[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/14/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458020,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Kia Sorento. The contact stated that the air bag warning light was illuminated. The contact stated that she contacted an independent mechanic who advised her that she needed a new OCS seat mat. The contact stated that she then contacted the dealer who advised her that there was a recall for the failure she was experiencing, however the VIN was not included in NHTSA Campaign Number: 11V473000 (Air Bags). The manufacturer was not notified of the failure. The failure mileage was 136,000.",
        "vin": "KNDJD735X85"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2021",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443506,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Even after having the ESC and relay box replaced the vehicle has become much worse. It's shuts down my accelerator pedal and won't move I have to shut it off completely for it to reset its extremely unsafe and is now affecting my job. And the ability to take car of my son. And Kia wants to charge me $200 plus for a diagnosis when it clearly keeps shutting down the vehicle and the esc off light is on. I even replaced the accelerator pedal assembly $180 and it did not fix the problem please help. Also this has been an on going issue since August 2020 and even after running diagnostic on it. I keep getting the run around from everyone stating a different issue each time.",
        "vin": "Kndjc735585"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/01/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439851,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Kia Sorento. The contact stated that while operating the vehicle a burning odor and smoke were present inside the cabin of the vehicle. Also, the engine had stalled while driving and the vehicle would not properly accelerate while driving on inclined roads. The cause of the failures was not yet determined. The contact indicated that the failures began after the vehicle was serviced under the NHTSA Campaign Number: 20v088000 (Electrical System, service brakes) which involved a fire hazard. The local dealer was informed of the failures. The manufacturer was not yet contacted. The failure mileage was 181,000.",
        "vin": "KNDJC736785"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426651,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Kia Sorento. The contact received notification of NHTSA campaign number: 20V088000 (Electrical System, Service Brakes, Hydraulic), and the vehicle was taken to the local dealer for the recall repair. The contact stated that the dealer-installed a fuse box assembly to prevent the ABS from overheating while performing the recall repair. Two days later while the contact was traveling the vehicle went into limp mode causing the vehicle to drive only in 2nd gear. The contact took the vehicle to another local dealer; Jones Kia (2001 Belair Rd Fallston, MD 21047, (410) 879-6400) who inspected the vehicle and determined that the ABS module was damaged and need to be replaced. The local dealer replaced ABS module and the vehicle was finally repaired on 07/14/21. The manufacturer was made aware of the failure. The failure mileage was 130,000.",
        "vin": "kndjc735785"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424133,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver airbag light has been on a year I keep checking for recalls but none are shown. What is my next step afraid bag will not work if needed.",
        "vin": "Kndjd735285"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423082,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2008 kia Sorento has a faulty passenger air bag, or air bag sensor. The ‘passenger air bag off’ light has been on since I purchased this car from a dealership in January of 2019. This jeopardizes the safety of my passengers because if the sensor or software is faulty, the airbags won’t deploy when needed. The vehicle was inspected by an independent mechanic, but I plan to take it to a dealership as well, it is available to be inspected upon request. I have called kia consumer affairs twice because there was a recall for this same passenger airbag issue in Kia Sorentos manufactured from 2007-2009 (SC067), but the first time they told me there was nothing I could do because the VIN wasn’t listed as affected. The second time I called to get more information, they put me on hold and then hung up on me so I do not know how to progress when kia is refusing to address my concern. I have to drive on the highway frequently and I am very worried about having a faulty airbag system. Thank you for your time!",
        "vin": "KNDJD735685"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/10/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420671,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I pulled into my driveway and the car shut off and I heard a pop, never had an issue before this. Upon getting out I noticed smoke and asked my neighbor to help me open the hood. Upon opening the hood we noticed a fire in the passenger side of the engine and called 911. The entire car was engulfed in flames within minutes of me getting out of the vehicle, luckily I made it out but what if I had not? I am mentally traumatized along with my family especially my young child. The car is sitting in my driveway still and it is a daily reminder of what happened.   There is a recall SC186 on Kia Sorento year 2007-2009 that I was never informed about.  Something needs to be done or I will be making sure this is a case that is handled in the court system.",
        "vin": "KNDJC735785"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394611,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE AIR BAGS WARNING LIGHT WAS ILLUMINATED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 11V473000 (AIR BAGS) HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS TAKEN TO DAYTONA KIA (510 N NOVA RD, DAYTONA BEACH, FL 32114, (386)252-7000) WHERE THE DEALER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 97,000.",
        "vin": "KNDJD735885"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386065,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR LIGHT STAYS ON. COMPUTER CODE INDICATES THAT THERE IS A DEFECT WITH THE SENSOR.  AIR BAGS WILL NOT BE ENGAGED DUE TO THE SENSOR MALFUNCTION.",
        "vin": "KNDJD735685"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377106,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED GOSSETT KIA SOUTH (2680 MT MORIAH RD, MEMPHIS, TN 38115;(901) 328-8173) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KNDJD736585"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377119,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AIRBAG LIGHT REMAINS ON, PASSENGER SIDE SEEMS OPERATIONAL. IN MOTION ON HIGHWAY, DURING THE SAME TRIP INTERIOR LIGHTS, EXCEPT MANUAL PUSH LIGHTS AND DASHBOARD,  DO NOT AUTOMATICALLY TURN ON",
        "vin": "KNDJC735X85"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "01/24/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360542,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS READIND DOWN BEARESS AVE IN TAMPA FLA IAS I WAS RIDING MY TRUCK WENT INTO FLAMES AS SOON AS I LEFT MY HOME AT THE TIME NOT EVEN A HALF MILES THE HILSS COUNTY SHERIFF DID LET THE HOOD UP ATTEMPTED TO PUT THE FIRE OUT THE FIRE DEPARTMENT MY INSURANCE DID COVER CAUSE I IHAD PIP THE TOW TRUCK CAME AND PUT. THEFIRE OUT THE CAUSE WAS ELACTRIC BATTERY BURNED UP CABLES ETC",
        "vin": "KNDJD735785"
    },
    {
        "components": "WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355706,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER WEATHER IS MOIST OR RAINY THE ENGINE HAS BOGGED DOWN WHILE DRIVING AND HAS NO POWER EVEN WITH GAS PEDDLE PRESSED TO FLOOR.  THIS HAS LEFT US STRANDED TWICE NOW BUT WHEN TAKEN TO BE CHECKED THEY CAN'T DIAGNOSE THE PROBLEM.  ALSO TPMS IS ALWAYS ON EVEN THOUGH TIRE PRESSURES HAVE BEEN CHECKED AND IT WILL NOT GO OFF.   HAS BEEN THIS WAY FOR OVER 1 1/2 YEARS NOW WITH NO EXPLANATION.",
        "vin": "KNDJD736485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354403,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE AIR BAG WARNING LIGHT ILLUMINATED AND REMAINED ON FOR BOTH THE PASSENGER'S AND DRIVER'S SEATS. THE DEALER FIRST TEAM KIA (4834A BRIDGE RD, SUFFOLK, VA 23435, (757) 320-1088) STATED THAT THERE WERE NO RECALLS ON THE VEHICLE PERTAINING TO THE AIR BAGS. THE DEALER OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 155,000.",
        "vin": "KNDJD735X85"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO POCATELLO NISSAN KIA (1900 FLANDRO DR, POCATELLO, ID 83202 (208)232-1062) AND IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KNDJC736985"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11353218,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 KIA SORENTO. THE CONTACT STATED THAT HE FELL ASLEEP WHILE DRIVING ABOUT 54 MPH. UPON REALIZING WHAT HAPPENED, THE VEHICLE WAS STEERED OFF THE ROAD, INTO A GRASSY DITCH, TO AVOID OTHER VEHICLES. AS THE DRIVER TRIED TO RE-ENTER THE ROAD, THE VEHICLE ROLLED OVER A COUPLE OF TIMES FROM EAST TO WEST ON OPPOSITE SIDES OF THE ROAD AND DAMAGED THE FRONT DRIVER'S SIDE OF THE VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED SKIN LOSS FROM LACERATIONS ON HIS LEG AND NECK. THE NECK INJURY WAS CAUSED BY THE SEAT BELT'S SHOULDER STRAP. THE CONTACT WAS TREATED BY THE EMERGENCY VEHICLE TEAM AT THE ROADSIDE. THE VEHICLE WAS TOTALED AND WAS TOWED TO A TOW YARD. THE DEALER AND THE MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 145,000.",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343129,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT'S HUMID OUTSIDE OR THERE IS ANY KIND OF MOISTURE IN THE AIR MY CHECK ENGINE LIGHT COMES ON ALONG WITH THE ESC LIGHT. THE CAR SEEMS BOGGED DOWN AND WONT GO ABOVE 2000 RPM. IT TAKES 15 MINUTES JUST TO GET THE CAR UP TO 50 MPH AND THATS WITH THE GAS PEDDLE PUSHED ALL THE WAY TO THE FLOOR. IT DOES IT MAINLY WHEN I'M DRIVING ON THE HIGHWAY WHICH IS SCARY.  IT LOOSES MOST OF ITS ACCELERATION POWER",
        "vin": "KNDJD735485"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343369,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS EXPERIENCING SEVERAL ISSUES CAUSING THE CHECK ENGINE LIGHT TO TURN ON. I TOOK THE VEHICLE FOR RECALL REPAIR TODAY AND ALL TROUBLE CODES AND ISSUES RESOLVED THEMSELVES. I BELIEVE THE ELECTRICAL ISSUES ALSO CAUSED FAILURE OF THE AIR CONDITIONER COMPRESSOR THAT HAS BEEN REPLACED TWICE AND IMMEDIATELY BURNED UP. THESE ISSUES HAVE COST $500+ TO ATTEMPT TO REPAIR AND I BELIEVE KIA SHOULD BE RESPONSIBLE DUE TO FAULTY WIRING. KIA DENIES THE ISSUE IS RELATED, HOWEVER, RESOLUTION OF MANY ISSUES UPON RECALL REPAIR TELL ME THEY ARE WRONG.",
        "vin": "KNDJD735085"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "01/18/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341086,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JAN 18 2016 NOT KNOWING OF ANY RECALL AS WE MOVE FROM OUR HOME ADDRESS AT THE TIME TO NEW ADDRESS, WE TOOK THE KIA TO DEALER BECAUS THE PASS AIR BAG SHOWS: OFF. DEALER JUST TOLD US THIS WILL COST $1800 TO FIX AND NEVER EVEN BOTHER TO CHECK ON RECALLS.  NOW WHEN WE CHECK NHTSA FOR THIS VEHICLE WE FOUND THE RECALL CAMPAIGN # 11V473000  . WR CALL KIA MOTORS AND THEY REFUSE TO HONOR THE CAMPAIGN RECALL ON PASS AIR BAG ON OUR TRUCK CLAIMING THE PART AFFECTED THAT MAKES HAS NOTHIN TO DO WITH THE AIR BAG !! PASSENGER AIR BAG CONTINUES TO BE OFF SO WHEN WE RIDE IN THE SUV I HAVE NO PROTECTION. WE CALLED KIA TODAY 7/23/20 AND THEY REFUSED TO HONOR IT OR INSTRUCT DEALER TO REPARIR IT . IF THE PART AFFECTED HAS NOTHING TO DO WITH IT, THEN WHY IS THE AIR BAG NOT WORKING IF THIS WAS CORRECT?   PLEASE HELP US BECAUSE OF UR MOVING FROM ONE ADDRESS TO ANOTHER WE WERE NEVER TOLD AND IN THE BLOGS AND YOUR WEBSITE ALL KIAS HAVE THE SAME PROBLEM WITH THE PASSENGER AIR BAGS",
        "vin": "KNDJD735985"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338745,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS BROUGHT IN FOR REPAIR FOR THE PUBLISHED RECALL AND NOW THE VEHICLE DOES NOT WORK. THE DEALERSHIP TRIED TO EXTORT MONEY TO FIX THE VEHICLE BY SAYING SOMETHING WAS WRONG WITH THE STARTER AFTER THEY COULD NOT START THE CAR. THE CAR WORKED FINE BEFORE IT WAS BROUGHT IN AND NOW ELDERLY OWNERS ARE WITHOUT TRANSPORTATION.",
        "vin": "KNDJD735885"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11330925,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN AUTO ACCIDENT 8/18/17 TOSSED BACK AND FORTH LIKE A RAG DOLL MY AIR BAG DIDN'T DEPLOY ON IMPACT UNTIL THE 4TH TIME AND I WAS KNOCK OUT UNCONSCIOUS. DON'T RECALL MY SEAT BELT WORKED I RECALL BEING TOSSED BACK AND FORTH BACK AND FORTH AND TOOK MY LAST BREATH. THIS IS MY 3 TIME DOING THIS. IT WAS MOVING I WAS HIT IN AN ACCIDENT.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327200,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LEFT TAIL LIGHT IS OUT. I HAVE GONE TO THE MECHANIC, CHANGED THE LIGHT BULB BUT NO FIX. I WAS ADVISED THERE WAS SOME SORT OF SHORT HAPPENING FROM KIA THROUGH A RECALL LETTER. SINCE I'VE RECEIVED THE LETTER NOTHING HAS BEEN DONE. I WAS TOLD NOT TO DRIVE THE CAR AND TO PARK IT AWAY FROM OTHER CARS IN CASE OF IT CATCHING FIRE. I LIVE IN THE BAY AREA AND DO NOT HAVE THE LUXURY OF PARKING IT AWAY FROM OTHER CARS, THIS IS IMPOSSIBLE. I NEED TO KNOW WHEN THEY'RE GOING TO FIX THIS?     I CAN'T MOVE AROUND WITHOUT MY CAR AND I ALSO FEAR FOR MY NEIGHBORS ASSETS IF THIS CAR WOULD TO IGNITE AS THE RECALL STATES.     PLEASE HELP AND ADVISE ON WHAT CAN BE DONE TO SOLVE THIS ISSUE PROMPTLY.  *TR",
        "vin": "KNDJC736885"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "05/24/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326829,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING 4 MPH, THE VEHICLE OVERHEATED WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO NAPLETON'S NORTHLAKE KIA (3626 NORTHLAKE BLVD, PALM BEACH GARDENS, FL 33403, (561) 285-2325) WHERE THE CONTACT WAS INFORMED THAT THE REMEDY WAS NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED.  THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 174,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KNDJD735785"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325958,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THE REMEDY WAS NOT AVAILABLE. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED INTERMITTENTLY ON SEVERAL OCCASIONS. THE APPROXIMATE FAILURE MILEAGE WAS 66,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KNDJC736085"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326025,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. KIA OF CARSON (22020 RECREATION RD, CARSON, CA 90745) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KNDJD735485"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324557,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED INTERIM NOTICE FROM KIA DATED 4/8/2020 THAT THE HECU ASSEMBLY CONTROLLING THE ANTI-LOCK BRAKE SYSTEM IS DEFECTIVE, AND THAT IT CAN CAUSE AN ELECTRICAL SHORT CIRCUIT FIRE IF \"MOISTURE\" ENTERS THE HECU, EVEN IF THE VEHICLE IS TURNED OFF AND PARKED. MY LOCAL KIA DEALER HAS NOT RECEIVED THE REQUIRED PARTS TO CORRECT THE PROBLEM.  IT IS NERVE WRECKING WHILE I'M DRIVING, PARKING OUTSIDE AND  NOT KNOWING WHEN THIS WILL BE RESOLVED. THIS IS MY ONLY VEHICLE!!!  I HAVE CONTACTED KIA AND ALL THEY EXPLAIN IS THAT THEY ARE WORKING ON THE REMEDY BUT THAT PARTS ARE NOT YET AVAILABLE. PLEASE PROVIDE UPDATE AS TO WHEN KIA WILL BE RESOLVING THIS PROBLEM. THANK YOU!!!  *TR",
        "vin": "KNDJD735X85"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324311,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. DENNIS EAKIN KIA (5200 E. CENTRAL TEXAS EXPY, KILLEEN, TX 76543, (254)699-2909) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KNDJD736485"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321475,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MANUFACTURER HAS ISSUED A RECALL REGARDING A REMEDY ON HECU REPAIR OR REPLACEMENT. THEY ARE ASKING US TO PARK OUR CAR AWAY FROM OTHER VEHICLE BECAUSE THE RECALLED CAR MAY GET IN FIRE. HOW THE OTHER PEOPLE MAY KNOW TO PARK AWAY FROM MY DEFECTIVE CAR. THIS IS A SAFETY ISSUE FOR ME AND FOR OTHER PEOPLE IN THE COMMUNITY. THIS IS THE ONLY CAR I HAVE AND I HAVE TO USE IT EVERY DAY. IF KIA IS NOT ABLE TO FIX THE RECALL ,THEY MUST PROVIDE ME WITH A SUBSTITUTE CAR UNTIL THEY CAN REPLACE THE DEFECTIVE PART.  *TR",
        "vin": "KNDJD735385"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11318775,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HER STEP-SON WHOM WAS A PASSENGER IN A 2008 KIA SORENTO. THE CONTACT STATED THAT HER STEP- SON PASSED AWAY AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT STATED THAT PER THE POLICE REPORT THE DRIVER WAS DRIVING AT APPROXIMATELY 55 MPH WHEN HE LOSS CONTROL OF THE VEHICLE, CROSSING INTO ON-COMING TRAFFIC, COLLIDING HEAD ON INTO THE DRIVER SIDE OF THE OTHER VEHICLE. THE CONTACT STATED THAT THE FRONTAL DRIVER SIDE AR BAG DEPLOYED HOWEVER, THE FRONT PASSENGER SIDE AIR BAG DID NOT. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS. THE DRIVER SUSTAINED A BROKEN FOOT THAT REQUIRED MEDICAL ATTENTION HOWEVER, THE FRONT SEAT PASSENGER SUSTAINED FATAL INJURIES. THE MANUFACTURER WAS NOT CONTACTED BY THE CONTACT'S FAMILY. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN. *LN*JB",
        "vin": "KNDJC736985"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210664,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A GUARD RAIL ON THE FRONT; SIDE AND REAR (DID A 360 AND 180) AND NONE OF THE AIR BAGS IN MY VEHICLE DEPLOYED.  I WAS ON INTERSTATE 90 GOING ABOUT 65-70",
        "vin": "KNDJC735X85"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182252,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE GOES ON AND OFF WHENEVER. PASSENGER AIRBAG LIGHT GROUT IT TO AUTOZONE FOR CHECK AND IT STATED SENSORS. MY SHOP SAYS THEY FIX IT AND IT CONTINUES I HAVE HAD THE CAR FOR ALMOST 2 YEARS NOW",
        "vin": "KNDJC735285"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182352,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHEN STARTING THE VEHICLE, A LOUD ABNORMAL NOISE WAS HEARD. THE CONTACT SCHEDULED A DIAGNOSTIC APPOINTMENT WITH BOB MOORE KIA NORTHWEST (7340 NORTHWEST EXPY, OKLAHOMA CITY, OK 73132, (405) 720-3800) WHERE IT WAS DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "KNDJD735385"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11175087,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 KIA SORENTO. WHILE MAKING A LEFT TURN, THE CONTACT'S VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE. THE CONTACT'S VEHICLE ALSO SUSTAINED A SIDE IMPACT BY A DIFFERENT VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK, NECK, AND SHOULDER INJURIES AS WELL AS INTERNAL BLEEDING FROM THE SEAT BELT, WHICH REQUIRED MEDICAL ATTENTION. THE FRONT AND REAR PASSENGERS ALSO SUSTAINED BACK AND NECK INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED DESTROYED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 86,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/24/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172001,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 01/24/2019 AT APPROXIMATELY AROUND 6:00 I WAS ATTEMPTING TO MAKE A U TURN ON E. BEARESS AVE IN FRONT OF MORT ELEM SCHOOL IN TAMPA FLA WHEN MY 2008 KIA SORENTO CUT OFF THEN COULD NT GET IT TO COME AS I WAS TURNING THE KEY SO I HAD AND OFFICER BEHIND HELP ME PUSH IT OUT THE ROAD AS GOT IT LET THE HOOD UP WE NOTICE IT WAS ON FIRE ON THE DRIVER SIDE FIRE DEPARTMENT WAS DISPATCHED THEY CAME OUT ASSESS THE DAMAGE TOOK PICTURES AND RULED OUT FJRE DUE TO ELECTRICAL PROBLEMS THEY UNHOOKED THE BATTERY TO PREVENT FURTHER FIRE VIN# IS. (XXXX) CAN PROVIDE FIRE REPORT BUR NOT AT THE MOMENT    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "KNDJD735785"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "05/13/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166255,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER AIR BAG SAYS ITS  TURNED OFF WHEN THERE IS AN ADULT IN THE PASSENGER SEAT.",
        "vin": "KNDJD736185"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/30/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164070,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL DOOR HANDLES HAVE FALLEN OFF IT'S GOING TO BE $250.00 TO HAVE ONE FIXED. I AM NOT ABLE AT THIS TIME TO HAVE A MALFUNCTION FIXED! IT IS NOT VANDALISM OF ANY KIND! IT'S A DEFECTIVE PART! THE AUTO REPAIR PLACE SAID TO LOOK INTO RECALLS! I NEED THIS PROBLEM FIXED! NO CAR I HAVE OWNED HAS EVER HAD THIS PROBLEM BUT THIS ONE!",
        "vin": "KNDJD735585"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129087,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING 25 MPH, THE VEHICLE SHOOK AND STALLED. ADDITIONALLY, THERE WAS AN ABNORMAL THUMPING NOISE AND THE CHECK ENGINE, AIR BAG, AND ELECTRONIC CONTROL INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO STATED THAT THE AUTOMATIC CONTROL SENSOR, REAR SENSOR BEARING, AND REAR LINE DRIVESHAFT NEEDED TO BE REPLACED. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 128,000.",
        "vin": "KNDJD735885"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2018",
        "dateOfIncident": "09/09/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128582,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNDAY SEPT 9TH AT AROUND 9 - 9:30 AM I SMELLED SMOKE AND WALKED AROUND THE HOUSE AND SMELLED THAT IT WAS COMING FROM THE GARAGE. WHEN I OPENED THE DOOR I SAW  FLAMES UNDERNEATH THE CAR AND SMOKE AND FIRE ON TOP OF THE HOOD. I CALLED THE PALM BAY FIRE DEPARTMENT WHEN THEY GOT THERE THEY PUT THE HOSE ON THE CAR UNTIL THE FIRE WAS OUT THEY HAD TO CUT THE HOOD IN ORDER TO FINISH PUTTING OUT THE FIRE. THEY FIRE MARSHALL CAME AND INSPECTED THE VEHICLE IT COULD HAVE BEEN AN ELECTRICAL PROBLEM. WHEN I CALLED KIA CUSTOMER SERVICE THEY GAVE ME A CLAIM NUMBER AND THEY TOLD ME WHAT WOULD YOU LIKE KIA DO FOR YOU .  THE CUSTOMER SERVICE AGENT SAID THEY WILL GIVE THE CLAIM TO THE RIGHT DEPARTMENT AND THEY WILL GET BACK TO ME IN 3 TO 5 BUSINESS DAYS. THIS HAPPENED WHILE THE  CAR WAS PARKED IN THE GARAGE AND IT HADN'T BEEN TURNED ON SINCE FRIDAY . THIS VEHICLE WAS A 2008 SORENTO  WITH LESS THAN 90,000 MILES IT WAS IN GREAT CONDITION ALSO.",
        "vin": "KNDJD735585"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "04/14/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120106,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORRENTO, WITH ONLY 92K MILES ON IT... I HAD IT IN THE SERVICE SHOP AT THE KIA DEALER, FOR A NOISE COMING FROM THE ENGINE.. THEY INFORMED ME IT WAS THE MAIN BARRING GOING OUT.. AND THEY QUOTED ME 12K TO REPLACE MY ENGINE AS A FIX... OF COURSE I SAID NO, THAT WAS 3 YEARS AGO, MY SORRENTO IS STILL SITTING IN MY DRIVEWAY UN-DRIVEN, WHICH IS COMPLETELY PAID OFF.. INSTEAD I PURCHASED ANOTHER CAR FROM KIA... RECENTLY I HAVE SEEN NUMEROUS REPORTS OF THE SAME PROBLEMS ON NEWER VERSIONS OF THE SORRENTO'S... I WROTE KIA CORPORATE, ABOUT THIS, AND OF COURSE NO RESPONSE BACK FROM THEM AT ALL. I AM A LOYAL KIA DRIVER, HOWEVER I WISH KIA WOULD STEP UP AND CLAIM RESPONSIBILITY OF THIS MAIN BARRING DEFECT.. A LOUSY $20 DOLLAR PART FAILED ON A 30K PURCHASED SORRENTO, AND THEY WILL NOT ANSWER ME BACK.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "01/30/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119336,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR LIGHTS HAVE NOT WORKED FOR YEARS. THE LIGHT ON CEILING OF CAR IS SWITCHED TO OFF BECAUSE THE INTERIOR LIGHTS DO NOT GO OUT WHEN YOU SHUT ALL OF THE DOORS",
        "vin": "KNDJD736985"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONICAL PARTS OF THE IGNITION SWITCH WENT OUT AT THE SAME TIME THE BATTERY AND THE STARTER DID . THEN ON TOP OF MY ESC  RANDOMLY COMING ON AND EVERY TIME THIS HAS HAPPENED IT MADE IT TO WHERE I COULDN'T GO ABOVE 5 MILES HAVE TO TURN THE CAR OFF AND THEN RESTART IT MULTIPLE TIMES JUST SO I CAN DIVE HOME THIS HAS BEEN HAPPENING SINCE I HAVE HAD HE VEHICLE NOVEMBER 2016",
        "vin": "KNDJD735X85"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/10/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100741,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG OFF LIGHT IS STILL ON WHEN SOMEONE IS SITTING IN THE PASSENGAR SEAT",
        "vin": "KNDJC735585"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "05/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100355,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY 2008 KIA SORENTO EX WHEN I PUT IT IN REVERSE ALL OF A SUDDEN IT MAKES A LOUD BUMP NOISE AND WITH PRESSURE ON THE BRAKES IT JUMPS HARD IN REVERSE I LOOK AND SEE MY ESC LIGHT CAME ON AND I COULD NOT ACCELERATE, MY VEHICLE IN FACT SLOWED DOWN TERRIBLY. I HAVE NOTICED THAT IF I SHUT MY CAR OFF THEN TURN IT BACK ON SOMETIMES THIS WILL TAKE CARE OF THE PROBLEM FOR A SHORT TIME. IT LOOKS LIKE THIS HAS HAPPENED 3 TIMES DURING HOT DAYS.  THIS IS VERY DANGEROUS WHEN DRIVING WITH MY KIDS IN THE BACKSEAT. IF MY CAR SLOWS WHILE ON THE HIGHWAY I COULD END UP CAUSING QUITE AN ACCIDENT NOT TO MENTION HURTING MYSELF OR MY FAMILY THAT IS IN THE VEHICLE. MILEAGE ON MY VEHICLE AT THE TIME WAS APPROXIMATELY 88000 MILES.",
        "vin": "KNDJC736885"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "05/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096709,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING 15 MPH, THE CONTACT HEARD AN ABNORMAL NOISE AND THE STEERING BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE DRIVE SHAFT DETACHED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND A COMPLAINT WAS FILED. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 126,000.",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "03/19/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089996,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY 08 KIA SORENTO HOME AT ABOUT 730 AM. I WORK NIGHT SHIFT AND WENT TO SLEEP AND WAS WOKEN UP AT 945 BY EMS TO MY CAR UP IN FLAMES. IT WAS SHOWING NO SIGNS OF ANY PROBLEMS, NOT RUNNING HOT, NOTHING. IT WAS PARKED FOR ABOUT AN HOUR WHEN IT WENT UP IN FLAMES. THE FIRE CHIEF WAS ON THE TRUCK THAT DAY AS HE HAD ORIENTEE'S, AND SAID THE FIRE STARTED BEHIND THE STEERING WHEEL/DASH AND THAT IT WAS AN ELECTRICAL ENGINE FIRE WHICH IS STATED ON MY FIRE REPORT. I CONTACTED KIA THEY TOLD ME IT WAS NO WAY IT WAS THEIR PROBLEM AND HAD TO BE A USER ERROR.     I HAVE PHOTOS BUT MY COMPUTER WOULD NOT LET ME UPLOAD THEM FOR A REASON.",
        "vin": "KNDJD735285"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063281,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STARTER BURNED OUT AND THE STARTER RELAY IS STICKING. IT STARTED STICKING AND MAKING FUNNY NOISES AROUND MID OCTOBER OR BEGINNING OF NOVEMBER 2017 AND ACUTALLY BURNED OUT DECEMBER 8, 2017 AND WAS REPLACED DECEMBER 9, 2017. NOW THE STARTER WENT OUT AGAIN JANUARY 16, 2018. ALSO I HAD MY DRIVER SIDE BRAKE LIGHT BULB REPLACED AROUND JULY OR AUGUST 2017 AND NOW THE SAME DRIVER SIDE BRAKE LIGHT IS OUT AGAIN.",
        "vin": "KNDJD735285"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "04/07/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054151,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING VARIOUS SPEEDS, THE CHECK ENGINE INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL AND THE VEHICLE WENT INTO LIMP MODE. THE CONTACT DROVE THE VEHICLE TO SHAWNEE MISSION KIA (7591 SHAWNEE MISSION, KS 66202), BUT THEY COULD NOT REPAIR THE FAILURE. THE CONTACT EXPERIENCED THE SAME FAILURE SIX YEARS AGO. THE MANUFACTURER WAS CONTACTED AND WAS UNABLE TO ASSIST. THE FAILURE MILEAGE WAS 31,970. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "09/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11044238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE SIDE OF A SECOND VEHICLE. THE CRASH CAUSED SEVERE DAMAGE TO THE FRONT END OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE DRIVER SUSTAINED A HEAD CONTUSION, WHICH DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED AND THE VEHICLE WAS TOWED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. AN UNKNOWN KIA DEALER IN CAPE DORODO, MISSOURI AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 103,000. *LN",
        "vin": "KNDJC736485"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "09/09/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032832,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ESC OFF LIGHT COMES ON AND SENDS THE TRANSMISSION INTO A \"LIMP\" MODE.  THIS CAUSES EXTREME LOSS OF ACCELERATION.  DEALERSHIP REPLACED THE ABS CONTROL MODULE, BUT IT DID NOT FIX THE PROBLEM.  DEALERSHIP CAN NOT FIGURE OUT WHY THE VEHICLE IS DOING THIS.",
        "vin": "KNDJC736885"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020670,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A MARCH 2010 TECHNICAL BULLETIN ISSUED FOR THIS MAKE AND MODEL YEAR VEHICLE (TSB-023) OF FAULTY REAR DIFFERENTIAL.  A MECHANIC AT DEALERSHIP INFORMED ME MY MAKE AND MODEL YEAR CAR HAS THIS PROBLEM, AND MADE ME AWARE OF THE MARCH 2010 TSB- 023.  MECHANIC STATED MY WHEELS IN THE REAR WILL BECOME LOUDER THAN THE CURRENT NOISE I HAVE, THE WHEELS WILL GRIND, I WILL FEEL REAR VIBRATION.  WITH 14 OTHER KIA SORENTO OWNERS WITH THIS SAME ISSUE, REPORTED REAR WHEELS LOCKED UP WHILE DRIVING DOWNHILL, AND SAW REAR WHEEL IN REAR WINDOW MOVING AWAY FROM THE VEHICLE.  I PUCHASED VEHICLE IN 2016 WITH LOUD NOISE IN REAR THINKING IT WAS TYPES OF TIRES ON VEHICLE.  I KNOW NOTHING WHAT A TSB IS.  WHY DEALER KNEW OF THIS BUT NEVER SERVICED REAR DIFFERENTIAL?  I HAVE 13000.00 AUTO LOAN AND NEED ALMOST 2000.00 TO REPAIR THIS ON A 2008 VEHICLE.  TOYOTA HAS RECALLS FOR BAD REAR DIFFERENTIALS.  HOW DOES KIA NOT HAVE TO RECALL ON THIS?  THIS ISSUE DEALER NEVER CORRECTED SO THAT CONSUMER BECOME RESPONSIBLE.",
        "vin": "KNDJC736085"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/27/2017",
        "dateOfIncident": "08/27/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11019996,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A COLLISION THAT WAS MY FAULT, I REAR ENDED A MINI VAN HIT A CONCRETE/STONE/ DIRT BARRIER AND MY AIR BAGS DID NOT DEPLOY.",
        "vin": "KNDJC736685"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011400,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXITING A STRIP CENTER TO CROSS 2 LANES OF TRAFFIC AND MAKE A LEFT TO MERGE INTO TRAFFIC, I ACCELERATED IN A SAFE GAP ONLY TO FIND MY VEHICLE HAD ALMOST NO ACCELERATION.  I WAS NEARLY IN A SIDE IMPACT COLLISION IF NOT FOR THE EXCELLENT AWARENESS AND REACTION OF THE OTHERS ON THE ROAD.  I PULLED IMMEDIATELY INTO A PARKING LOT TO TRY TO FIND OUT WHAT HAD HAPPEN.  AT THIS TIME MY CHECK ENGINE LIGHT AND THE ESC OFF LIGHT WERE ON.  THEY WERE NOT WENT I STARTED THE TRIP FROM MY HOUSE ABOUT 1 MILE AWAY. I SHUT THE CAR OFF AND RESTARTED AND THE ESC OFF LIGHT WAS NO LONGER THERE, BUT THE CHECK ENGINE WAS.  THE NORMAL POWER HAD BEEN RESTORED BACK TO MY CAR.  I DROVE TO AN AUTO PARTS SHOP AND HAD THEM PULL CODES ON THE VEHICLE.  IT RETURNED 2 CODES:  1.  P2138 (THROTTLE/PEDAL POSITION SENSOR/SWITCH \"D\"/\"E\" VOLTAGE CORRELATION, 2.  P2106 (THROTTLE ACTUATOR CONTROL SYSTEM - FORCED LIMITED POWER).    I ASKED THEM TO CLEAR THE CODES AND THEY DID.  MY DRIVE HOME TRIGGERED NO LIGHTS.  AFTER A MONTH THE SAME ISSUE HAPPENED AND I CLEARED THE CODES ONCE AGAIN.  IT NOW HAPPENS 6 MONTHS TO YEAR MOSTLY WHEN THE TEMPERATURE GET REALLY WAR (USUALLY JULY). I GOT ON THE INTERNET TO RESEARCH THE ISSUE AND WAS AMAZED TO FIND HOW MANY PEOPLE WERE HAVING THE EXACT SAME ISSUE.  ALL WERE THE SAME STORY OF SUDDEN AND UNEXPECTED LOSS OF POWER, BOTH LIGHTS ON, NEAR ACCIDENTS, FEAR FOR ONE'S SAFETY.   LITERALLY HUNDREDS AND HUNDREDS.  THERE WERE MANY POSTS OF THOSE THAT WENT TO DEALER OR CALLED KIA WITH EITHER EXORBITANT REPAIR COSTS, LACK OF CONCERN, AND NO KNOWLEDGE OF THE ISSUE.  FOR MOST, THE PROBLEM WAS NEVER COMPLETELY SOLVED WITH DEALER REPAIRS AND INTERMITTENTLY HAPPENS. THIS IS A DANGEROUS PROBLEM AND PEOPLE WILL DIE, OR MOST LIKELY ALREADY HAVE.  TOO MANY PEOPLE WITH THE SAME PROBLEM NOT TO HAVE A RECALL FOR KIA OWNERS AND THEIR CHILDREN'S SAFETY.  PLEASE HELP.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000846,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO TIRE DISCOUNTERS FOR AN OIL CHANGE. IT WAS NOTICED THAT THE CHECK ENGINE AND OIL INDICATORS WERE ILLUMINATED. THE CONTACT STATED THAT 200 MILES LATER, THE ENGINE FAILED. THE VEHICLE WAS TAKEN TO AUTO MALL OF DAYTON WHERE IT WAS NOTICED THAT THE VEHICLE WAS PROPERLY MAINTAINED AND THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "KNDJC735285"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979666,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE SUSPENSION WAS UNSTABLE AT THE FRONT END OF THE VEHICLE. THE DEALER DIAGNOSED THAT THE CONTROL ARMS NEEDED TO BE REPLACED. WHILE DRIVING, THE CONTACT HEARD AN ABNORMAL NOISE NEAR THE FRONT OF THE VEHICLE AND THE VEHICLE FAILED TO MOVE. AN INDEPENDENT MECHANIC CAME TO THE LOCATION AND STATED THAT THE FRONT WHEEL SUSPENSION FAILED AND THAT THE FRONT PASSENGER SIDE AXLE NEEDED TO BE REPLACED. THE VEHICLE WAS TOWED TO THE INDEPENDENT MECHANIC WHO REPLACED THE FRONT PASSENGER SIDE AXLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THERE WAS NO SERVICE CAMPAIGN OR RECALL TO ADDRESS THE FAILURE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 154,000.",
        "vin": "KNDJD735485"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958900,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEER WHEEL LOCKED UP WHEN I WAS COMING OFF HIGHWAY TO INTERSECTION.  THIS HAS HAPPENED TWICE ALREADY.",
        "vin": "KNDJD735185"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946950,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE DECELERATED INDEPENDENTLY TO 30 MPH AND FAILED TO ACCELERATE. THE CONTACT MENTIONED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER HOWEVER, A TECHNICIAN REVIEWED THE VEHICLE AND DIAGNOSED THAT THE THROTTLE ACTUATOR NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 170,000.",
        "vin": "5XYKT4A27BG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926748,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE'S PASSENGER ALERT SYSTEM, WHICH INFORMS WHEN THE SEAT WAS OCCUPIED, REMAINED ACTIVATED. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE AIR BAG SENSOR MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "KNDJD735985"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919210,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPERATE OCCASIONS APPROXIMATELY 2 MONTHS APART ON START UP AND INITIAL DRIVE THE ENGINE SUDDENLY LOST ALL POWER, THE CHECK ENGINE LIGHT CAME ON AND THE ESC OFF LIGHT CAME ON.  PULLED VEHICLE TO CURB, SHUT OFF ENGINE, WAITED SEVERAL MINUTES TO ONE HOUR, RESTARTED ENGINE AND HAD FULL POWER.. CHECK ENGINE LIGHT REMAINS ON FOR SEVERAL START UPS THEN RESETS ITSELF.  THIS SUDDEN LOSS OF POWER AT HIGHWAY SPEEDS COULD BE DEVASTATING AND POTENTIALLY LEAD TO FATALITIES.",
        "vin": "KNDJC735X85"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10910025,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 KIA SORENTO. WHILE DRIVING APPROXIMATELY 35 MPH APPROACHING A TRAFFIC LIGHT, THE BRAKE PEDAL WAS APPLIED AND THE VEHICLE SUDDENLY SURGED AT A HIGH RATE OF SPEED. THE CONTACT CRASHED INTO THE PRECEDING VEHICLE, WHICH CAUSED THAT VEHICLE TO CRASH INTO A THIRD VEHICLE. THE DRIVER SIDE AIR BAG DEPLOYED WITH EXTREME FORCE. THE CONTACT SUSTAINED INJURIES TO THE HEAD, NECK, AND A WHIPLASH. THE CONTACT WAS ALSO INJURED BY THE SEAT BELT. MEDICAL ATTENTION WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A YARD AND DESTROYED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V114000 (EXTERIOR LIGHTING, SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 122,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907675,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCCASION, \"PASSENGER AIR BAG OFF\" LIGHT GOES ON WHILE AN ADULT (>120LBS.) IS SITTING IN THE FRONT PASSENGER SEAT.",
        "vin": "KNDJC735585"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903721,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE AND ESC LIGHT CAME ON WHILE DRIVING DOWN THE INTERSTATE. TRUCK IMMEDIATELY LOSES POWER.",
        "vin": "KNDJC735385"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876599,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS VEHICLE FROM A KIA DEALERSHIP NOW OUT OF BUSINESS IN FEBRUARY 2009 AS A NEW VEHICLE. THE ODOMETER READING  TODAY IS 31000 MILES. DESPITE REGULAR KIA MAINTAINANCE A FEW WEEKS AGO WE NOTICED SLUGGISH ACCELERATION AND A HUM AT INCREASED SPEED FROM THE REAR END.  WE TOOK IT TO A KIA DEALERSHIP AND WAS DIAGNOSED AS ENTIRE REAR AXLE ASSEMBLY NEEDED TO BE REPLACED AS WELL AS LEFT REAR TIRE. THE SERVICE TECH SAID IT WAS UNSAFE WITHOUT THE REPAIRS AND THE ORIGINAL MICHELIN LEFT DRIVER SIDE TIRE WAS CLOSE TO FAILURE. I NOTICE THAT NHTSAID# 10625749 COMPLAINT ON THIS SITE IS NEARLY IDENTICAL. AUTHORIZED REPLACEMENT OF REAR AXLE AT A COST OF $2219 AND PICKED UP VEHICLE YESTERDAY AND BOUGHT NEW TIRE FROM TIRE STORE. WHILE CAR IN KIA SHOP I NOTICED 10 YEAR 100000 MILE WARRANTY COVERED  REAR AXLE SO CALLED KIA MOTORS USA AND OPENED A CASE. CASE STILL UNDER REVIEW BUT WAS SURPRISED TO LEARN KIA CLAIMS 100 K WARRANTY NOT APPLICABLE  BECAUSE THEIR RECORD SHOWS WE ARE NOT THE ORIGINAL OWNER DESPITE ALL OUR PURCHASE DOCUMENTS SAY IT IS NEW AND NOT A USED OR DEMONSTRATOR WE PURCHASED. REALIZE THAT IS WARRANTY DISPUTE WITH KIA BUT SHOWS HOW KIA WILL TRY ALL IN ITS POWER TO COVER UP DEFECTS THEY SHOULD KNOW ABOUT AND NOT HONOR THEIR WARRANTY.",
        "vin": "KNDJD735X85"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10876112,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"    I WAS HIT  HEAD ON  WHERE MY AIRBAGS NEVER CAME OUT. AIRBAG LIGHTS ARE ON BUT AIR BAGS NEVER DEPLOYED. I WAS AT A COMPLETE STAY STEAL WHEN I WAS HIT.",
        "vin": "KNDJD735785"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2016",
        "dateOfIncident": "10/20/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875044,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MAKES A HIGH PITCH WHINING NOISE. HAVE NOT HAD ANY REPAIRS AS OF YET. KIA THINKS IT'S THE TIMING CHAIN TENSIONER. KIA STATES THIS WILL COST 4000 OR MORE TO FIX",
        "vin": "KNDJC735485"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/29/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871393,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS ON A KIA SORENTO 2008 DOOR LOCKS. I BOUGHT THIS CAR NEW IN 2009, MY DRIVER'S DOOR WOULDN'T NOT OPEN FROM THE OUTSIDE,  I HAD THE DOOR HANDLE CHANGED WHICH COST ME $200.00. NOW MY PASSENGER BACK LEFT DOOR WILL NOT OPEN FROM THE OUTSIDE OR INSIDE AND WITH TIME I'M SURE THE OTHER 2 LEFT WILL NEED REPAIR.    HOW CAN KIA SAY,  \"THIS IS NOT A SAFETY ISSUE THEREFORE IT IS NOT A RECALL\". THIS IS A SAFETY ISSUE WHEN I HAVE PASSENGERS IN THE BACK AND AN ACCIDENT OCCURS AND THEY ARE UNABLE TO GET OUT TO SAFETY.      I HAVE A 4 DOOR CAR AND AFRAID TO DRIVE ANYONE AS PASSENGERS DUE TO THEIR SAFETY.  FROM MY ONLINE RESEARCH THIS HAS BEEN AN OCCURRING PROBLEMS WITH KIA AND I'M GLAD THERE HAS BEEN NO DEATHS RESULTING FROM IT. BUT IF THIS PROBLEM IS NOT FIX AND KIA DOESN'T TAKE RESPONSIBILITY FOR A DEFECTED PARTS THERE WILL MOST LIKELY BE DEATH RESULTING FROM IT IN THE FUTURE. PLEASE HELP US OUT AND LET THIS BECOME A RECALL.",
        "vin": "KNDJD735885"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10862788,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED WHILE STARTING THE VEHICLE AND IN PARK, THE AIR BAG DEPLOYED INADVERTENTLY. THE CONTACT SUSTAINED LEFT ARM INJURIES AND LEFT LEG INJURIES DUE TO DEPLOYMENT OF THE AIR BAGS. MEDICAL ATTENTION WAS NOT REQUIRED AND NO POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 114,000.",
        "vin": "KNDJC735485"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "09/28/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855477,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORENTO HAS HAD NUMEROUS INSTANCES OF THE REAR TAILLIGHT/SIGNALLIGHT FAILING TO OPERATE CORRECTLY.  THE VEHICLE DOES HAVE A RECALL ON THIS ISSUE FOR WHICH IT WAS TAKEN IN FOR SERVICE AND THE DEALERSHIP HAS SINCE WORKED ON THE VEHICLE TO REMEDY THE SITUATION A NUMBER OF TIMES.  THEY HAVE SAID AND NOTED THAT IN A PRIOR VISIT THEY REPLACED THE STOPLIGHT SWITCH.  HOWEVER THE PROBLEM CONTINUES AND I HAVE BEEN CITED A NUMBER OF TIMES WITH A WARNING FOR LAW ENFORCEMENT.  ATTACHED IS ONE OF THE RECEIPTS FROM THE DEALERSHIP NOTING THE RECALL AND PROBLEM.  NOW, THE DEALERSHIP IS INSISTING THAT WE SHOULD PAY FOR THE LATEST ATTEMPT TO CORRECT THE PROBLEM, ALTHOUGH THE ISSUE HAS NEVER BEEN FIXED WITHOUT A RECURRENCE OF THE ISSUE.  THE REAR TAILLIGHT/SIGNAL LIGHT FAILS TO ILLUMINATE.",
        "vin": "KNDJD735685"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838043,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT'S WIFE, WHO WAS 5 FOOT 6 INCHES TALL AND WEIGHED 130 LBS, WAS SEATED IN THE FRONT PASSENGER SEAT. THE FRONT PASSENGER SIDE AIR BAG LIGHT ILLUMINATED, INDICATING THAT THE AIR BAG SYSTEM WAS DEACTIVATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE SEAT CUSHION AND RE-FLASHED THE SOFTWARE, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 55,648.",
        "vin": "KNDJD735885"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824295,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG INDICATOR LIGHT ON. DEALER TEST SHOWED PROBLEM IS WITH THE SENSOR LOCATED INSIDE THE DRIVER SIDE SEAT. THEY SAY THE SOLUTION REQUIRES ME TO REPLACE THE DRIVERS SIDE SEAT FOR $2500.",
        "vin": "KNDJD735985"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2015",
        "dateOfIncident": "02/25/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808244,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING 60 MPH, THE ESC, PASSENGER SIDE AIR BAG, AND MOTOR LIGHT ILLUMINATED BEFORE THE VEHICLE LOST POWER. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V473000 (AIR BAGS).  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": "KNDJC735385"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790206,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON IN DASHBOARD AFTER STARTING THE CAR AND STAYED ON, ALSO LIGHT STATING PASSENGER AIRBAG IS OFF GOES ON AN OFF.  TOOK THE VEHICLE TO THE DEALERS BACK ON 8/9/12 FOR PASSENGER AIRBAG LIGHT, SUPPOSEDLY IT WAS REPAIRED BUT STILL HAPPENING.  TOOK VEHICLE TO DEALER FOR AIR BAG LIGHT IN DASH WAS ADVISED B1448 OCS, PASSENGER BOTTOM SEAT WOULD NEED TO BE REPLACED WHICH WOULD COST $2219.34.  INFORMED DEALER CHOOSING NOT TO HAVE REPAIRED, FEEL IT SHOULD BE COVERED UNDER RECALL 11V473000, THEY STATED MY VEHICLE IS NOT PART OF RECALL",
        "vin": "KNDJD735385"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789143,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWNED THIS VEHICLE FOR LESS THAN A YEAR AND HAVE OBSERVED SEVERAL AFFECTED PARTS THAT PRESENT SIGNIFICANT SAFETY ISSUES AND SUBSTANTIAL CONCERNS TO MY OVERALL WELFARE. MOST ALARMING IS THE VEHICLE LOSES POWER DURING OPERATION EITHER IN AND INABILITY TO ACCELERATE OR THE COMPLETE LOSS OF POWER WHILE MERGING OR DRIVING WITH THE FLOW OF TRAFFIC ON THE HIGHWAYS AND INTESTATES. THE ESC AND CHECK ENGINE LIGHTS COMES ON INTERMITTENTLY AND REMAIN ON UNTIL ENGINE IS TURNED OFF. THE DASH PANEL LIGHTS FLICKERS OFF/ON WHEN BRAKE PEDAL IS ENGAGED. THE BACK DRIVERS BRAKE LIGHT GOES OUT SPORADICALLY. IN THE EVENT THAT THERE IS A NEED TO CUT THE HEAD LIGHTS OR WINDSHIELD WIPERS ON WHILE THE CAR IS IN MOTION, THERE IS A COMPLETE LOSS OF POWER OR ACCELERATION AND THE CAR WILL SLOW TO A COMPLETE STOP IN THE MIDST OF HEAVY TRAFFIC CONDITIONS.  THE PASSENGER AIR BAG LIGHT IS CONSISTENTLY ON. THE CRUISE CONTROL FUNCTION COMES ON WHILE TRAVELING ON THE HIGHWAY WITHOUT PROMPTING AND THE PANEL KEYS ARE NON RESPONSIVE TO OFF ON COMMANDS. THERE IS ALSO A HEAVY SHAKING THAT OCCURS ON THE FRONT END WHEN TRAVELING AT SPEED OF 55 MPH OR GREATER.",
        "vin": "KNDJD736985"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787662,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE LOW BEAM HEADLIGHT BULBS AT LEAST 3 TIMES IN THE 3 YEARS I HAVE OWNED MY CAR.  JUST HAD MY RIGHT PASSENGER SIDE REPLACED AGAIN, WAS WORKING IMMEDIATELY AFTER BEING REPLACED, AND NOW THE NEXT MORNING WHEN I GET IN MY CAR NEITHER HEADLIGHT WORKS.  I AM A SINGLE MOM ON A FIXED INCOME AND I CANNOT AFFORD TO KEEP REPLACING THESE BULBS AT $20 EACH TIME.",
        "vin": "KNDJC735885"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "10/28/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786620,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STOPPING AND LOOKING FOR ONCOMING CARS AND STARTING AGAIN,  THE CAR JETTISONED CAUSING ME TO HIT ANOTHER CAR AND THE CAR WOULDN'T STOP FOR ABOUT A HALF BLOCK.",
        "vin": "KNDJD735485"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783223,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL WAS DEPRESSED AND THE BRAKE LAMP FAILED TO ILLUMINATE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE BRAKE LAMP SWITCH GROUND WIRE WAS REPLACED. THE FAILURE PERSISTED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V114000 (EXTERIOR LIGHTING, SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.   UPDATED 02/05/16*LJ UPDATED 4/23/18*JB    *CN",
        "vin": "KNDJD735185"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783165,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY 6 MONTHS THE ENGINE LIGHT AND ECS OFF LIGHTS COME ON AND THE CAR LOSES POWER INTERMITTENTLY. THIS IS DANGEROUS WHEN IT HAPPENS ON THE FREEWAY.  I BOUGHT THE CAR FROM CARMAX IN JULY 2014. BY NOVEMBER, IT STARTED TO HAVE THE ISSUE, IT PROGRESSED AT I CHECKED IT ON THE INTERNET AND SAW A RECALL AND BROUGHT IT IN TO CITY KIA IN ORLANDO. THE MECHANIC COULD NOT FIND AN ISSUE WHY THE ENGINE LIGHT WAS ON AND THERE WAS NO CLEAR CODE. HOWEVER, WHEN HE REPLACED THE RECALL LAMP SWITCH PART IT WENT AWAY UNTIL NOW (OCT 2015).  IT IS CLEAR TO ME THAT THERE IS AN ISSUE WITH THE ELECTRICAL SYSTEM THAT CAN CAUSE THE LOSS OF POWER. THERE ARE NUMEROUS COMMENTS FROM OTHERS WITH THE SAME ISSUE AND THE SAME SYMPTOMS.  I EXPECT CARMAX AND KIA UNDERSTAND THERE IS AN ISSUE. I BOUGHT THE CAR WITH 32K MILES ON IT FROM CARMAX AND IT ALREADY HAD 2 PREVIOUS OWNERS.  THE AVERAGE KIA MECHANIC SEEMS INCAPABLE OF DIAGNOSING AND RESOLVING THIS ISSUE. THEY WILL JUST CHANGE OUT PARTS EVERY 6 MONTHS AND HOPEFULLY RESET THE ELECTRONICS SOMEHOW.  I AM A LICENSED MECHANICAL ENGINEER AND SAFETY ENGINEER WORKING IN THE RIDE INDUSTRY FOR 30 YEARS.  I BELIEVE THIS IS A SAFETY ISSUE AND I WOULD LIKE KIA TO EITHER FIX IT OR TAKE MY CAR BACK OR CARMAX TO TAKE THE CAR BACK.  THE LOSS OF POWER CAN OCCUR WHEN YOU START OR WHEN YOU ARE DRIVING. THE ENGINE LIGHT AND ECS LIGHT COME ON AND ALWAYS ACCOMPANY THIS ISSUE.    TYPICAL POSTS ON INTERNET  JUN 30, 2014 - CHEEKTOWAGA, NY - POWER TRAIN   TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE DECELERATED. THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND THE VEHICLE SLOWLY DECELERATED TO 20 MPH. THE SERVICE ENGINE AND ESC SENSORS ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "KNDJD735585"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781600,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IS ON WITH THE TROUBLE CODES OF B1511, B1513, AND B1448 ALL AT THE SAME TIME. I FIND IT HARD TO BELIEVE THAT ALL THIS GOES WRONG AT THE SAME TIME.",
        "vin": "KNDJD735485"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761063,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING UP HILL AT 35 MPH IN AUTOMATIC DRIVE OUR VEHICLE LOSES POWER. WHEN PUSHING DOWN ON GAS PEDAL, IT DOES NOT RESPOND.   WE TOOK IT TO A LOCAL MECHANIC WHO TEST DROVE IT AND EXPERIENCED SAME PROBLEM.  WHEN USING MANUAL SHIFT THE CAR DOE NOT LOSE POWER AND RESPONDS WHEN GOING UP HILL.    WE WERE TOLD IT GOES FROM FIRST GEAR TO FIFTH GEAR IN ABOUT 500 FEET WHEN IN AUTOMATIC DRIVE.  LOCAL MECHANIC CALLED KIA DEALS IN SPOKANE AND I WENT TO EDMARK KIA IN NAMPA EACH DEALERSHIP CLAIMS TO KNOW NOTHING ABOUT THIS PROBLEM. ESC LIGHT IS ALSO ON.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "11/27/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760307,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 10 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED AND HESITATED TO RESPOND. THE ESC AND THE ENGINE WARNING INDICATORS ILLUMINATED. THE FAILURE RECURRED ON FIVE SEPARATE OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO WAS UNABLE TO LOCATE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.   MA 10/15/2015    *CN",
        "vin": "KNDJC735685"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750425,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDDAUGHTER OPENED THE REAR PSGR DOOR ON THE DRIVERS SIDE AND IT BROKE OFF AND THE FRONT PASSENGER DOOR IS ABOUT TO BREAK OFF I TOOK IT TO LUTHER KIA IN INVER GROVE HEIGHTS AND THEY SAID THAT IT WOULD COST $322.00  TO FIX THE BROKEN HANDLE.  I TOOK IT TO A BODY SHOP AND THEY TOLD ME THAT IN HIS 12 YEARS WORKING WITH CARS THAT A DOOR HANDLE WOULD BREAK OFF LIKE THAT AND HE ALSO SAID THAT THE FRONT PSGR DOOR WILL HAVE TO BE REPLACED ALSO. AND THEY WOULD CHARGE $368.00 FOR BOTH DOORS.  I TALKED TO A LADY AT MY JOB SHE JUST BOUGHT A 2013 KIA SORRENTO AND SHE SAID THAT WHEN SHE PURCHASED IT THE DOOR HANDLES WERE MISSING AND THEY WERE GOING TO REPLACE THEM FOR FREE SINCE SHE JUST BROUGHT THE CAR.  BUT THEY SOLD HER THE CAR WITH 2 HANDLES MISSING I FEEL THAT THERE IS DEFINITELY SOMETHING WRONG WITH THE THE DOOR HANDLES ON THESE CARS.  HAVE THERE BEEN ANY OTHER COMPLAINTS ABOUT DOOR HANDLES MISSING.  I ALSO HAD TO REPLACE MY REAR BRAKE LIGHT TWICE AND MY SISTER WAS FOLLOWING ME AND SHE SAID THAT MY BRAKE LIGHT WOULD SOMETINE GO ON THEN NOT.  I WAS ALSO STOPPED BY A POLICE OFFICER ABOUT THE SAME REAR BRAKE LIGHT AND I GOT IT FIXED THEN MONTH LATER IT DID THE SAME THING.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724933,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING AT APPROXIMATELY 55 MPH, THE VEHICLE DECELERATED TO 20 MPH WITHOUT THE BRAKE PEDAL BEING DEPRESSED. THE SEC AND THE CHECK ENGINE WARNING INDICATORS ILLUMINATED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE THROTTLE POSITION SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000.",
        "vin": "KNDJD735X85"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2015",
        "dateOfIncident": "05/10/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722538,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE \"AIR BAG TURNED OFF\"  SIGN COMES ON INTERMITTENTLY EVEN WHEN AN ADULT IS SITTING IN THE PASSENGER SEAT AT THE STARTING THE VEHICLE AND TAKES SEVERAL ATTEMPTS TO GET DOWN AND GET BACK IN TO TURN THE SIGN OFF.  OCCASIONALLY, THIS SIGN LIGHTS UP WHILE DRIVING THE VEHICLE AND IT IS SCARY AT THAT TIME AND NOT POSSIBLE TO TAKE ANY MEASURES AT THE TIME.  I HAVE COMPLAINED TO KIA DEALERSHIP AND DIRECTLY TO KIA COMPANY.  I WAS TOLD TO GIVE THEM PICTURES TAKEN OF THE LIGHTED SIGN WHEN THE VEHICLE WAS IN MOTION AND THERE  WAS PASSENGER IN THE PASSENGER SEAT.  I PROVIDE SUCH PICTURES TOO.  HOWEVER, THE DEALER AFTER KEEPING THE VEHICLE FOR OVER A WEEK AT A TIME TOLD US THEY ARE UNABLE TO REPEAT THE PROBLEM AND THAT WE SHOULD KEEP THE LEATHER SEATS TREATED WITH SMOOTHING TREATMENT.  THIS IS SCARY SITUATION THAT KIA IS AWARE OF BUT NOT WILLING TO ADDRESS IT.",
        "vin": "KNDJD736385"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/17/2015",
        "dateOfIncident": "05/17/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716963,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST POWER WHILE DRIVING 30MPH SINCE THEN IT WILL START NOW BUT SHUTS OFF AFTER A BLOCK'S DRIVE.  LIMPED IT HOME AND HAVE BEEN READING ON LINE THIS IS NOT AN UNCOMMON PROBLEM.  WE'VE HAD IT IN FOR RECALL (FRONT SEATBELT LIGHT) AND THE ESC LIGHT ILLUMINATION WAS DISMISSED AT THAT TIME.",
        "vin": "KNDJC735785"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/18/2015",
        "dateOfIncident": "03/19/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706415,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HEARD GRINDING NOISES WHEN DRIVING OUR 2008 KIA SORENTO. WHEN APPLYING THE BRAKES, THE STEERING WHEEL BEGAN PULLING, JERKING, AND LUNGING. WE NOTICED NICKEL-SIZE CHIPPED PIECES OF METAL IN THE DRIVE THAT HAD FALLEN FROM UNDERNEATH THE CAR. WE TOWED THE CAR TO OUR LOCAL AUTO REPAIR SHOP. THE MECHANIC DISCOVERED THAT THE RIGHT WHEEL BEARING HAD DISINTEGRATED; THE ROTOR AND HUB TO RIDE INTO THE CALIPER AND SEIZE--THE WHEEL WAS WITHIN SECONDS OF FLYING OFF THE AXLE. THEY HAD DIFFICULTY FINDING PARTS BECAUSE THIS SEEMED TO HAVE BEEN A COMMON PROBLEM WITH KIA SORENTOS.      I CONTACTED THE NEWLY OPENED KIA DEALERSHIP ABOUT THE RECENT CAR REPAIR AND THAT AFTER HEARING OF THE DIFFICULTY IN FINDING PARTS AND BEING TOLD THAT THIS HAS BEEN A COMMON PROBLEM, I WAS EXTREMELY DISAPPOINTED THAT THERE WAS NO RECALL ON THIS REPAIR. I WAS TOLD THAT THE ENTIRE REPAIR IS COVERED UNDER THE 100,000 MILE WARRANTY (MILEAGE ON THE KIA WAS 90,317). I WAS DIRECTED TO KIA OF AMERICA (1-800-333-4542) TO SUBMIT A REIMBURSEMENT REQUEST FOR THE REPAIR. MY CLAIM WAS DENIED SIMPLY BECAUSE WE HAD NOT TAKEN THE CAR TO A KIA DEALERSHIP FOR REPAIR. I ASKED FOR AN APPEAL AND WAS DIRECTED TO THE REGIONAL OFFICE. THE KIA REPRESENTATIVE MISTAKENLY STATED THAT WE HAD SAID WE KNOWINGLY WERE AWARE THAT THE CAR WAS COVERED UNDER WARRANTY BUT WE TOOK THE CAR ELSEWHERE. I STATED THIS WAS INCORRECT--THAT WE HAD NO IDEA WHAT THE PROBLEM WAS AND THAT WE TOOK IT TO THE SAME PLACE WE ALWAYS GO. I ASSURED KIA OF AMERICA, IF WE HAD KNOWN THAT THE REPAIR WAS COVERED BY A WARRANTY, WE WOULD HAD THE CAR TOWED TO THE NEWLY OPENED KIA DEALERSHIP.     BOTTOM LINE: KIA OF AMERICA DOES NOT STAND BEHIND THEIR WARRANTY. OUR MAJOR CONCERN IS WITH THE SAFETY OF OUR FAMILY AND DRIVING A WELL-MAINTENANCED CAR. OUR REQUEST IS THAT KIA OF AMERICA HONOR THE WARRANTY. PLEASE INVESTIGATE WHY A RECALL  HAS NOT BEEN ISSUED ON THIS CONCERN.  *TR",
        "vin": "KNDJC735085"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702703,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING AT AN UNKNOWN SPEED, THE PASSENGER AIR BAG OFF WAS DISPLAYED ACROSS THE MESSAGE BOARD. IN ADDITION, THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE SENSOR IN THE PASSENGER SEAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT WAS AWARE OF NHTSA CAMPAIGN NUMBER: 11V473000 (AIR BAGS) BUT THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "KNDJD735785"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693090,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS WITH THE FRONT PASSENGER SEAT OCCUPIED, THE PASSENGER AIR BAG OFF WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO DIAGNOSED THAT THE FRONT PASSENGER SIDE AIR BAG SYSTEM FAILED AND THE FRONT PASSENGER SEAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 151,000. UPDATED. 06/09/15 *TA  THE DEALER INFORMED THE CONSUMER THE SEAT NEEDED TO BE REPLACED DUE TO THE LIGHT NOT GOING OFF.  UPDATED 08/04/15*JB",
        "vin": "KNDJD735885"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "02/10/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690649,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON A BUSY FREEWAY ON THE WAY TO WORK, THE STEERING WHEEL STARTED GETTING STIFF SO WE SLOWED DOWN AND MOVED OVER TO THE FAR RIGHT.  THE CAR DIED BUT WE WERE ABLE TO COAST OVER OUT OF TRAFFIC THOUGH THE BACK OF THE CAR WAS STILL NOT OUT ALL THE WAY DUE TO THE ANGLE. WE WERE NOT ABLE TO STEER AND STRAIGHTEN THE CAR.  THE CAR WOULD NOT START. WE CALLED ROADSIDE ASSISTANCE AND THEY WERE UNABLE TO JUMP THE CAR.  IT WAS TOWED TO A MECHANIC. THE ENGINE WAS LOCKED. THE MECHANIC SAID A SCREW BROKE OFF. THERE WAS AN ISSUE WITH THE CRANKSHAFT. I HAD TO GET A NEW ENGINE PUT IN AT THE COST OF JUST OVER $2400.   *JS",
        "vin": "KNDJD735385"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/21/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689772,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AT A 35 MPH SPEED WHEN I TRIED TO BREAK AND INSTEAD THE VEHICLE ACCELERATED CAUSING ME TO HIT THE VEHICLE I FRONT OF ME. IT WAS AT THE SHOP FOR REPAIR FOR A WEEK THE BREAKS WHERE CHECKED. 2 HOURS AFTER THE CAR WAS OUT THE SHOP I WAS TURNING WHEN INSTEAD OF BREAKING IT ACCELERATES AGAIN CAUSING THE VEH TO LOOSE CONTROL AND HIT THE CURB. I ONLY HAD THE SUB FOR 3 MONTHS AND NEARLY CAUSE ACCIDENTS 3 TIMES... ALSO ON THE HIGHWAY THE BRAKES WON'T WORK I HAVE TO PRESS ON THE BRAKE PEDAL VERY HARD AND STILL TAKES A LONG TIME TO BRAKE. THE VEHICLE IS NOT SAFE AT ALL.   *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659395,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DIM LIGHTS BOTH QUIT AT THE SAME TIME IN EARLY MORNING (DARK) DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/02/2014",
        "dateOfIncident": "09/25/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651978,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR YEARS NOW I HAVE REPLACED LIGHTS ON THIS VEHICLE. I HAVE REPLACED HEADLIGHTS AT LEAST 15 TIMES AND BRAKE LIGHTS ABOUT 20 TIMES. ON AT LEAST 5 OCCASIONS ALL LIGHTS BURNED OUT AT ONCE.. THE FUSES AND RELAYS HAVE NEVER BEEN BAD BECAUSE WHEN I REPLACE THE LIGHTS THEY WORK.SOMETHING IS WRONG WITH THE VEHICLE AND I HAVE KNOWN MANY OTHER KIA OWNERS TO HAVE THE SAME PROBLEM BUT THE DEALERSHIP SAYS NOTHING IS WRONG. I CAN'T AFFORD ANOTHER VEHICLE AND THIS IS A SERIOUS SAFETY ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637156,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD NOTHING BUT PROBLEMS WITH MY 2008 KIA, FIRST IT WAS THE FRONT ROTORS REPLACED THREE TIMES WITHIN 3 MOS. AFTER MULTIPLE DIAGNOSES TO FIGURE OUT THE PROBLEM. I HAVE HAD ACCELERATION PROBLEMS, I JUST PUT 800.00 IN NEW ROTORS AND TIRES AND FUEL/AIR INDUCTION SERVICES. THEN THE OTHER DAY DRIVING 45 MPH THE VEHICLE STARTED TO SHAKE, MAKING A THUD THUD THUD NOISE IN THE FRONT END, FELT LIKE I HAD A FLAT TIRE, I PULLED OVER, NO FLAT TIRES. I STARTED DRIVING AGAIN AND IT HAPPENED AGAIN, WORSE THAN THE FIRST TIME IT SOUNDED LIKE A HELICOPTER IN MY VEHICLE AND IT VIBRATED AND WHILE SLOWLY DRIVING IT FELT LIKE IT WAS GLIDING. I WAS AFRAID THE WHEELS WERE GOING TO FALL OFF, I TOOK IT TO THE DEALER IMMEDIATELY AND THEY CALLED ME LATER WITH THE DIAGNOSES OF A CARRIER BEARING COMING APART, THE CARRIER BEARINGS ARE NOT ABLE TO BE REPLACED ALONE, THE WHOLE DRIVE SHAFT HAS TO BE REPLACED AS IN THIS MODEL IT IS ALL ONE PIECE. TO REPLACE THE DRIVE SHAFT IT WILL COST $1100.00 TO REPLACE. I DECLINED THE REPAIRS I CAN NOT AFFORD THAT, ESPECIALLY AFTER ALL THE MONEY I HAVE HAD TO INVEST IN THIS VEHICLE JUST TO KEEP IT RUNNING. I FEEL KIA SHOULD STAND BEHIND THEIR PRODUCTS, I WILL NEVER BUY ANOTHER KIA. THANK YOU FOR YOUR TIME IN THIS MATTER.  *TR",
        "vin": "KNDJD735285"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/26/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628371,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE 3RD TIME IN AS MANY YEARS, THE CHECK ENGINE LIGHT AND ESC LIGHT COME ON AT THE SAME TIME CAUSING THE CAR TO GO INTO LIMP MODE.  SOMETIMES IT WILL RESET IF YOU TURN THE CAR OFF AND RESTART.  HAVE REPLACE CATALYTIC CONVERTER. SEE THIS IS A COMMON THEME WITH THIS CAR.  I HAVE NO IDEA WHY IT HAS NOT BECOME A RECALL.  WHEN LOSING ALL POWER ON HWY IN TRAFFIC THIS IS SURE TO BECOME A FATALITY ISSUE BEFORE LONG.  I WOULD THINK THE COMPANY WOULD RATHER RECALL BEFORE IT BECOMES A LAWSUIT..  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2014",
        "dateOfIncident": "08/16/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625749,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS MAKING A NOISE COMING FROM THE REAR END. I HAD THE DEALER WHERE I PURCHASED THE KIA SORENTO DIAGNOSE THE PROBLEM. THEY CONFIRMED REAR CARRIER ASSEMBLY ( REAR DIFFERENTIAL GEARS) NEEDED TO BE REPLACED AT A COST OF $1942.00. UPON  FURTHER RESEARCH I FOUND OUT IT'S A COMMON PROBLEM WITH THAT YEAR VEHICLE DUE TO SUB-STANDARD SUPPLIER PARTS. VECHICLE WARRANTY 5YR/60,000 MLIES ;NOT COVERED. I BELIEVE THIS IS A PREMATURE AND A MANUFACTURER DEFECT , THAT MAKES THE VEHICLE UNSAFE AND A DANGER ON THE ROAD. THE VEHICLE HAS LOSE POWER (NOT STALLED) WHILE DRIVING THE VEHICLE(NOT SURE IF RELATED TO PROBLEM.  *TR",
        "vin": "KNDJC736285"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619627,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO.  CONSUMER WRITES IN REGARDS TO FRONT PASSENGER SEAT AIR BAG LIGHT PROBLEMS.  *SMD  THE CONSUMER STATED THE RIGHT FRONT PASSENGER SEAT AIR BAG LIGHT WOULD STAY ON AFTER THE PASSENGER FASTENED THE SEAT BELT. *JB",
        "vin": "KNDJD735085"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "06/20/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10619370,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO PUMP GAS INTO THE TANK, IT FORCEFULLY SPEWED OUT ALL UP MY ARM AND ON MY FEET BEFORE I COULD JUMP BACK OUT IF THE WAY. I TRIED AGAIN, THIS TIME VERY SLOWLY BUT IT SPEWED OUT AGAIN. HAVING ENOUGH GAS TO GET HOME, I LEFT THE CAP LOOSE. BY THE NEXT DAY, IT HELD THE GASOLINE JUST FINE. SO I CONTINUED TO LEAVE THE CAP LOOSE, WHICH WAS WORKING UNTIL YESTERDAY. I WAS OUT OF TOWN SHOPPING. THE LOW FUEL LIGHT CAME ON, SO I ATTEMPTED TO GET GAS BUT IT SPEWED OUT ALL OVER MY ARM AND FEET AGAIN. FORTUNATELY, THERE WAS A KIA DEALERSHIP NEARBY AND I HAD ENOUGH GAS TO GET THERE. AS OF TODAY, THEY TELL ME THAT TWO VALVES ARE CLOGGED AND REPAIRS WILL BE AROUND $500 ASSUMING THE CHARCOAL FILTER IS OKAY, WHICH THEY HADN'T YET CHECKED WHEN THEY CALLED ME. IN RESEARCH, I DISCOVERED THAT 2003-04 KIA SORENTOS WERE RECALLED FOR FAULTY FUEL VALVES THAT RESULTED IN THE EXACT SPEWING PROBLEMS I EXPERIENCED. MINE IS A 2008 BUT SEEMS TO HAVE THE SAME PROBLEM. THIS IS NOT DUE TO NEGLECT OF MAINTENANCE OR TO ROUTINE WEAR AND TEAR. I DON'T FEEL THAT I'M FINANCIALLY RESPONSIBLE FOR THIS. I DO FEEL VERY FORTUNATE THAT I WASN'T BURNED. I AM STILL LEERY OF DRIVING IT AFTER REPAIR THOUGH IN FEAR OF A GAS TANK EXPLOSION.  *TR",
        "vin": "KNDJC735585"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618711,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 2 YEARS AGO, THE ESC LIGHT WOULD COME ON AND THE VEHICLE HAD NO ACCELERATION AND PULLING OUT INTO ONCOMING TRAFFIC WOULD BE VERY SCARY TO SAY THE LEAST. IT WOULD BE VERY SLUGGISH AND NO ACCELERATION AND ONCOMING TRAFFIC WOULD COME UP ON YOU BEFORE YOU COULD GET IT GOING. I CARRIED IT TO THE KIA DEALERSHIP WHERE IT WAS PURCHASED AND THEY SAID IT WAS A FAULTY ACCELERATOR AND REPLACED IT AT A COST OF 350 DOLLARS. IT HAS STARTED DOING IT AGAIN. THIS IS VERY DANGEROUS AND I AM AFRAID TO DRIVE IT AND DON'T HAVE 350 DOLLARS TO TRY AND FIX IT AGAIN. THIS IS A SERIOUS PROBLEM THAT I HAVE FOUND TONS OF COMPLAINTS WITH THIS. SOMETHING NEEDS TO BE DONE AND IT SHOULD NOT BE AT THE COST OF THE CONSUMER FOR A FAULTY PRODUCT.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615217,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REMOVING THE GEAR FROM REVERSE TO DRIVE, THE ACCELERATION WILL NOT COMPLY, GOES LESS THAN 10 MPH WHILE PRESSING ON THE GAS.  I STOPPED AND SWITCHED BACK TO PARK.  TRIED THE DRIVE GEAR AGAIN, AND IT WAS STILL NOT ACKNOWLEDGING THE CHANGE, IT RESPONDS LIKE IT'S IN NEUTRAL.  I PARKED FOR A FEW MINUTES AND TURNED OFF THE VEHICLE.  AFTER 10 MINUTES I TRIED IT AGAIN AND IT WAS FINE. THIS HAS SINCE HAPPENED ON FOUR DIFFERENT OCCASIONS.  AFTER THE FIRST INCIDENT I HAD THE VEHICLE CHECKED BY A MECHANIC, TOLD THE TRANSMISSION WAS FINE, NO SIGN OF THE PROBLEM.  PROBLEM HAS OCCURRED IN PUBLIC AREAS WHERE HELP MAY NOT BE AVAILABLE SHOULD THE GEARS NOT CORRECT THEMSELVES.  THE PROBLEM USE TO OCCUR ONLY COMING OFF A SLANTED PARKING AREA LIKE A DRIVEWAY, BUT IT'S STARTED HAPPENING WHILE PARKED ON A LEVELED PARKING SPACE ALSO.  *TR",
        "vin": "KNDJD735385"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/21/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615186,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ESC LIGHT HAS BEEN COMING ON SINCE THE BEGINNING OF 2014. WHEN THIS HAPPENS THERE IS VERY LITTLE ACCELERATION AND IT IS DIFFICULT TO GET TO THE SPEED LIMIT. THE DEALERSHIP SAID IT IS A CHIP THAT NEEDS TO BE REPLACED AND IT WOULD COST ABOUT $3,000. WE WERE ALSO TOLD IT WAS NOT A GUARANTEE IT WOULD STILL FIX THE ISSUE. WE WERE ALSO TOLD THAT THIS ISSUE COULD CAUSE THE CAR TO GO FROM DRIVE FROM DRIVE TO PARK WHILE DRIVING. THIS ALONE IS A DANGER IN ITSELF CAUSING HARM TO US AND TO OTHERS IN TRAFFIC.  WHEN THE LIGHT IS ON THE CAR DOES NOT ACCELERATE AND TRYING TO MERGE INTO TRAFFIC IS DIFFICULT  ESPECIALLY UP HILL. I TALKED TO KIA CUSTOMER CARE AND THEY SAID THEY WOULD TALK TO THE DEALERSHIP. THE PERSON I TALKED TO WAS NOT VERY HELPFUL. IF THIS A CHIP ISSUE THEN IT SHOULD BE A RECALL OR AT LEAST SOMETHING THAT KIA SHOULD FIX.  IT IS SOMETHING THAT IS OUT OF CONTROL OF THE OWNER.  THERE ARE TIMES WHEN THE LIGHT IS OFF AND THE VEHICLE RUNS OK. I THINK THIS SHOULD BE A SITUATION THAT SHOULD BE HANDLED WITH GREAT URGENCY BEFORE THERE IS A SERIOUS ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606928,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO.  WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE DECELERATED.  THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND THE VEHICLE SLOWLY DECELERATED TO 20 MPH.  THE SERVICE ENGINE AND ESC SENSORS ILLUMINATED INTERMITTENTLY.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOTIFIED.  THE VIN WAS UNAVAILABLE.  THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "04/05/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604712,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BEING PARKED WITH VEHICLE OFF, TURNED VEHICLE ON AND VEHICLE WOULD ONLY ACCELERATE AT A VERY SLOW SPEED, MAYBE 5 MPH. TRIED TO SWITCH IT TO MANUAL SHIFT BUT IT WOULD NOT REGISTER. TURNED VEHICLE OFF FOR A FEW MINUTES AND TURNED IT BACK ON AND IT WAS BACK TO NORMAL. THIS HAS HAPPENED AT LEAST THREE TIMES A MONTH SINCE AND  HAS NOT DONE IT ONCE FOR THE DEALER TO FIGURE OUT THE PROBLEM. THEY ALWAYS ACT LIKE I AM INSANE AND DON'T KNOW WHAT I AM TALKING ABOUT. VEHICLE IS NOW OVER 60,000 MILES AND THE DEALERS COULD CARE LESS ABOUT MY ISSUE. IT IS SO IMMENSELY FRUSTRATING.  *TR",
        "vin": "KNDJD735X85"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/11/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO HAS A DASHBOARD ALERT WHEN SOMEONE SITS IN THE PASSENGER SEAT. THE WARNING LIGHT GOES OUT AND THERE BY ARMING THE PASSENGER SIDE AIR BAG. IF THIS LIGHT DOESN'T GO OUT, THE AIRBAG SYSTEM ON THE PASSENGER SIDE WILL NOT ACTIVATE. I WENT TO THE KIA DEALER TO CONFIRM THIS IS WHAT WOULD HAPPEN. HE SAID IF THE LIGHT STAYS ON, THE SYSTEM WILL NOT ACTIVATE. HE STATED THAT IT WAS BECOMING A PROBLEM IN MY MODEL OF KIA. IT IS APPROXIMATELY $2,000.00 TO REPAIR. TO ME THIS IS A SAFETY CONCERN WORTHY OF FURTHER ACTION BY YOUR AGENCY.  *TR",
        "vin": "KNDJC735185"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584254,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WILL ROCK BACK AND FORTH VIOLENTLY WHILE DRIVING. NOTICE IT MORE AT HIGHER SPEEDS, SEEMS TO HAPPEN WHEN I TAKE MY FOOT OFF THE GAS PEDAL. IT'S PROGRESSIVELY GETTING WORSE AND I'M TERRIFIED OF HAVING A WRECK. HAVE TRIED NEW TIRES, TIRE ROTATIONS, ALIGNMENTS ETC.. I'VE BEEN TOLD IT MAY BE THE DIFFERENTIAL.  *TR",
        "vin": "KNDJD735385"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "03/27/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583530,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE  PASSENGER AIR BAG LIGHT CONTINUOUSLY ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000 AND THE CURRENT MILEAGE WAS 169,720.  UPDATED 6/10/14*CN",
        "vin": "KNDJD735485"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566395,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AND THE CAR SHUT DOWN AND THE ALL THE PANEL LIGHTS CAME ON. HAD TO STOP ON THE SIDE OF THE ROAD TO START THE CAR. OIL LIGHT CAME ON AND TOOK TO MY MECHANIC. REPLACE ON OIL PUMP AND CAR WILL NOT START. HE STATED MOTOR WAS GONE. PLEASE HELP ME. HAVE 30 MORE PAYMENTS ON THIS 2008 KIA SORENTO. GOD BLESS ND HAVE A GOOD DAY.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "10/22/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THERE WAS AN ABNORMAL INCREASE IN BRAKING DISTANCE. THE CONTACT CHANGED THE BRAKES AND ROTORS BUT THE PROBLEM PERSISTED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS STILL REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "KNDJD735085"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2013",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549660,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT HANDLE CAME OFF WHILE THE VEHICLE WAS MOVING IN REVERSE, RENDERING IT ALMOST IMPOSSIBLE TO PUT THE VEHICLE IN PARK.   *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "10/18/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549463,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY DRIVING. SUSPENSION IS SO TIGHT VEHICLE \"BOUNCES\" WHEN BUMP, POT HOLE, ETC ENCOUNTERED.  HIT BUMP, BOUNCE ALMOST THREW US INTO ADJACENT LANE STRIKING TRAILER TRUCK.  THIS HAS HAPPENED MULTIPLE TIMES, BEING BOUNCED ALMOST INTO ANOTHER LANE.  VERY UNSAFE AND COULD ALSO LEAD TO LOSS OF CONTROL IF UNSUSPECTING DRIVER BEHIND WHEEL.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "10/21/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549464,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL (OR COMPUTER PROGRAM) VERY TOUCHY.  WHEN SOMEONE WHO IS NOT AWARE OF ISSUE DRIVES CAR, AS THEY START TO PRESS GAS PEDAL IT WILL LURCH FORWARD.  WAS DRIVING WITH DAUGHTER WHO WENT TO STEP ON GAS AND VEHICLE JUMPED FORWARD AND WE ALMOST HIT ANOTHER VEHICLE.  THIS HAS HAPPENED MULTIPLE TIMES WITH OTHER DRIVERS, INCLUDING MYSELF WHO IS WELL AWARE OF ISSUE AND MAKES SURE NOT TO PRESS PEDAL QUICKLY, BUT IT STILL LURCHES ON OCCASION.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MADE A PROGRESSIVE NOISE COMING FROM THE REAR OF THE VAN. IF SOUNDED LIKE OVERSIZED MUD TIRES WERE ON THE VEHICLE. BROUGHT IT INTO THE DEALERSHIP AND THEY SAID IT WAS THE REAR DIFFERENTIAL ASSEMBLY.  THE DEALERSHIP SAID THERE WERE A LOT OF COMPLAINTS ABOUT THE REAR DIFFERENTIAL ASSEMBLY. THIS VEHICLE WAS BOUGHT NEW BY MYSELF AND ONLY HAS 22,508 MILES ON IT..  AT THE SAME TIME THE AIR COMPRESSOR WENT OUT. THIS WAS ALSO REPLACED.                  THESE PARTS SHOULD NOT HAVE FAILED THIS EARLY ON A NEW VEHICLE.  *TR",
        "vin": "KNDJD736885"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545514,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DAYS AGO THE CHECK ENGINE LIGHT ILLUMINATED (AND STAYED ON) WITH INTERMITTENT ELECTRONIC STABILITY CONTROL OFF LIGHT ILLUMINATED; VEHICLE ACCELERATION BECAME SLUGGISH AND SOMETIMES UNRESPONSIVE. VEHICLE CODES USING OBDII POCKETSCAN SHOWED ACTIVE AND STORED CODES OF P2138 (ACCELERATOR), P2127 (ACCELERATOR) AND P2106 (LIMP MODE). I MADE AN APPOINTMENT TO TAKE IT TO THE DEALERSHIP ON 09/25/13. ON THE DAY OF APPOINTMENT THE CHECK ENGINE LIGHT WAS NOT ILLUMINATED, BUT THE DEALERSHIP FOUND STORED CODES IN THE COMPUTER OF P2138, P2127 AND P2106. THE DEALERSHIP REFUSED TO FIX THE VEHICLE EVEN THOUGH IT WAS STILL UNDER WARRANTY BECAUSE THERE WAS NOT AN ACTIVE CODE (CHECK ENGINE LIGHT) ON AT THE TIME OF THE APPOINTMENT AND THE PART WAS FUNCTIONING PROPERLY FOR THE TIME BEING. WHEN ASKED IF IT WAS THEIR POLICY OR KIA MOTORS POLICY NOT TO REPLACE COMPONENTS THAT WERE FAILING, THEY STATED IT WAS KIA MOTORS POLICY. THIS IS THE SECOND TIME THE ACCELERATOR ASSEMBLY HAS FAILED IN THIS VEHICLE. THE LAST FAILURE WAS 08/23/12 AT 27,545 MILES.  A VAST MAJORITY OF THE COMPLAINTS WITH NHTSA FOR THIS MAKE, MODEL AND YEAR VEHICLE INVOLVE THESE CODES AND THIS COMPONENT. A SERIOUS ACCIDENT, OR LOSS OF LIFE SHOULD NEVER BE THE DETERMINING FACTOR WHEN MAKING A DECISION THAT A MANUFACTURER SHOULD TAKE ACTION TO CORRECT A FAULTY COMPONENT; BY THEN IT IS MUCH TOO LATE.  *JS",
        "vin": "KNDJD735785"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2013",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545351,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ESC LIGHT COMES ON THEN THE ENGINE LOSES POWER, IT ALSO DID THIS 2 YEARS AGO ON 10/31/2011.  *JS",
        "vin": "KNDJC735X85"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "09/09/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544690,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING LA GOING OVER THE GRAPEVINE ON THE FREEWAY,AFTER REACHING THE TOP I STARTED ON THE DOWN SIDE OF THE GRADE WHEN THE BRAKES WENT OUT COMPLETELY.TRAFFICK EVERYWHERE BARELY MADE IT TO SAFETY,WITHOUT HITTING TWO AUTOS IN FRONT OF ME! I WAS SCARED TO DEATH.THE MASTER  CYLINDER $438.58  WENT OUT.    SEPTEMBER 18TH2013,5:40AM,NO POWER TO ENGINE THE GAS PEDAL WAS NOT WORKING COULD NOT GO MORE THAN 20 MILES AN HOUR,I WAS IN TRAFFIC AND WAS ALMOST REAR ENDED WHEN IT HAPPENED ALL AT ONCE.THE ELECTRIC GAS PEDAL WENT OUT!. REPAIR COST $430.00.MILEAGE ONLY43069.  *TR",
        "vin": "KNDJD735885"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544284,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALMOST KILLED EVERYONE IN MY CAR, ALONG WITH OTHERS ON THE HIGHWAY. I PULLED OUT ONTO THE HIGHWAY AND HAD NO POWER TO MY VEHICLE. I COULD NOT ACCELERATE AT ALL AND HAD TO PULL OVER TO THE SHOULDER TO GET OUT OF THE WAY OF TRAFFIC. I NOTICED MY ESC OFF LIGHT HAD COME ON SOMEHOW. I TURNED MY VEHICLE OFF AND TURNED IT BACK ON AND THE LIGHT DISAPPEARED AND I HAD POWER AGAIN. SEVERAL TIMES SINCE THEN THE LIGHT WILL RANDOMLY COME ON AND I WILL LOSE POWER. I CALLED A COUPLE MECHANIC SHOPS BUT WHEN I TRY TO TAKE IT IN THE LIGHT DOESN'T COME ON. I DON'T KNOW WHAT CAUSES THIS TO HAPPEN BUT I SEE I'M NOT THE ONLY ONE WITH THE ISSUE.   *JB",
        "vin": "KNDJC735685"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2013",
        "dateOfIncident": "09/14/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542466,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING DOWN THE ROAD WHEN ALL OF A SUDDEN THE VEHICLE DECELERATED QUICKLY AND THE ESC LIGHT CAME ON. I COASTED OVER TO THE SIDE OF THE ROAD AND TURNED THE ENGINE OFF. SAT THERE A FEW MINUTES THEN TURNED VEHICLE BACK ON AND THE POWER CAME BACK ON. I HAVE SINCE EXPERIENCED THIS ISSUE SEVERAL TIMES AND HAVE NOW THE SAME ISSUE HOWEVER THE LIGHT IS NOT GOING OFF.",
        "vin": "KNDJD735485"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "08/28/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT AND ESC OFF LIGHT CAME ON.  AFTER DRIVING AROUND FOR THE DAY IT WENT OFF. THEN LAST NIGHT SEPT. 2 2013 THEY BOTH CAME ON AGAIN. *JB",
        "vin": "KNDJC735485"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING TO WORK ON THE HIGHWAY AT 65 MPH, I LOST SIGNIFICANT POWER AND WAS UNABLE TO ACCELERATE PAST 40 MPH ON A LOCAL HIGHWAY. I WAS ABLE TO SLOWLY DRIVE TO A AUTO CENTER WHERE I WAS TOLD MY TRANSFER CASE ASSEMBLY AND ACCELERATOR PEDAL ASSEMBLY WAS MALFUNCTIONING, CAUSING ME TO LOSE POWER AND CAUSING MY CAR TO SHIFT ERRATICALLY WHILE DRIVING. I HAVE OWNED THIS CAR FOR LESS THAN 11 MONTHS.*JB",
        "vin": "KNDJC735885"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538420,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE RETURNING HOME FROM THE STORE SHUT THE VEHICLE OFF AND THE KEY WOULD NOT COME OUT . TWO HOURS LATER WE WERE ABLE TO REMOVE THE KEY. IF THIS WOULD HAVE BEEN AN EMERGENCY WE WOULD HAVE BEEN DELAYED BECAUSE WE COULD NOT GET THE KEY OUT.  *JS",
        "vin": "KNDJD735285"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "12/29/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537641,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KIA SORENTO THAT HAS HAD THE FRONT ROTORS REPLACED THREE TIMES DUE TO WARPING. I AM ABOUT TO REPLACE THEM FOR THE FOURTH TIME AT 79,000 MILES. I BELIEVE THAT THE BRAKES ON THIS SUV ARE INADEQUATE FOR THIS VEHICLE. KIA HAS INFORMED ME THAT SINCE THE SUV IS OUT OF WARRANTY IT DOES NOT FEEL IT HAS ANY RESPONSIBILITY. I BELIEVE THAT SINCE THIS ROTOR WARPING PROBLEM HAS HAPPENED SO MANY TIMES THAT IT IS A DESIGN ISSUE WITH THE BRAKES AND SHOULD BE COVERED BY A RECALL. I HOPE ENOUGH CONSUMERS? COMPLAIN SO THAT THE NTSB DOES AN INVESTIGATION.  *TT",
        "vin": "KNDJC736885"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "09/03/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536047,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA HAS HAD A CONTINUING  PROBLEM WITH THE ESC OFF LIGHT COMING ON INTERMITTENTLY. CAUSING FAILURE TO ACCELERATE PROPERLY. DEALER RAN DIAGNOSTICS. REPLACED AN ITEM AND SAID THAT SHOULD TAKE CARE OF IT. WITHIN THREE WEEKS IT STARTED AGAIN. THE LIGHT WOULD COME ON AND I WOULD LOSE POWER. THE DEALER STATED IT WASN'T RELATED BUT I NEVER LOST POWER UNTIL THE LIGHT WOULD COME ON. THEY CHECKED IT AGAIN AND COULDN'T FIND ANY PROBLEM. SERVICE TECH SAID HE COULDN'T \"RECREATE\" THE ISSUE. THE LIGHT WAS ON WHEN HE TESTED IT, BUT I TOOK IT TOO ANOTHER LICENSED MECHANIC SHOP AND THEY COULD TELL THAT THERE WAS NO ACCELERATION POWER. ANY ONE WHO DROVE THE CAR COULD TELL THAT IT WOULDN'T ACCELERATE. NOW THE ESC OFF LIGHT THEN STAYS ON CONSTANTLY. NO ACCELERATION. WILL NOT ALLOW  4 WHEEL ACCESS TO OPERATE. TRANSMISSION SHIFTS FROM 1ST TO 5TH TOO RAPIDLY NOT ALLOWING THE ACCELERATION.  I'M OBVIOUSLY NOT THE ONLY ONE WITH THIS PROBLEM THAT THE SERVICE TECH'S CAN'T SEEM TO FIGURE OUT.   *TR",
        "vin": "KNDJC735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533890,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CURRENT AND ONGOING PROBLEMS BEGAN JUST A FEW DAYS AFTER RECEIVING A NOTICE OF RECALL FROM KIA REGARDING THE FAULTY/DEFECTIVE BRAKE LIGHT SWITCH.  THE SWITCH WAS FAULTY AND THERE WAS A PROBLEM WITH NO BRAKE LIGHTS COMING ON UPON BRAKING AS WELL AS \"ESC OFF\" AND \"CHECK ENGINE\" MALFUNCTION INDICATOR LIGHTS APPEARING AND STAYING ON THE INSTRUMENT CLUSTER.  THE VEHICLE WAS PROMPTLY TAKEN TO A KIA DEALERSHIP WHERE THE RECALL SERVICE WAS PERFORMED.  REPLACEMENT OF A FAILED BRAKE LIGHT SWITCH UNDER THE RECALL CAMPAIGN DID NOT ELIMINATE THE PROBLEMS/CODES THAT BEGAN WHEN THE BRAKE LIGHT SWITCH FAILED.  SHORTLY AFTER THE REPAIR (LESS THAN A MONTH AFTERWARD AND VERY FEW MILES DRIVEN) THE \"ESC OFF\" AND \"CHECK ENGINE\" MALFUNCTION INDICATOR LIGHTS APPEARED, STAYED, THEN CAME ON AND OFF INTERMITTENTLY WITH ENGINE NOT GOING OVER PAST APPROXIMATELY 2,000 RPMS RESULTING IN UNPREDICTABLE VEHICLE BEHAVIOR ESPECIALLY WHEN IT COMES TO MERGING ONTO A HIGHWAY/INTERSTATE OR GETTING THROUGH AN INTERSECTION.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE SERVICE ADVISORS GAVE ASSURANCES THAT THE NEW BRAKE LIGHT SWITCH IS NOT DEFECTIVE.  THE PROBLEM IS THAT THE SERVICE ADVISORS/TECHNICIANS COULD NOT SPECIFICALLY DIAGNOSE WHAT NEEDS REPLACEMENT TO ULTIMATELY SOLVE THIS ONGOING PROBLEM OR IF IT IS RELATED TO THE FAILURE OF THE OF THE BRAKE LIGHT SWITCH.  *TR",
        "vin": "KNDJD735685"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2013",
        "dateOfIncident": "07/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532823,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE ON LOCAL AND HIGHWAYS, THE BRAKE DOES NOT GET ACTIVATED UNLESS YOU PRESS THE BRAKE PEDAL ALL THE WAY DOWN WHICH ENGAGES THE VEHICLE IN REDUCING SPEED BUT THIS TAKES TOO LONG.  THERE IS NO REDUCTION OF SPEED IF YOU PRESS A LITTLE OR IN INCREMENTS ON THE BRAKE PEDAL, THE ONLY WAY THE VEHICLE BRAKES IS YOU HARD PRESS YOUR FOOT DOWN ON THE PEDAL AND THAT TAKES TOO LONG TO MAKE IT EXTREMELY DANGEROUS.  WHEN I NEED TO COME TO A SUDDEN STOP THE BRAKES DO NOT ENGAGE PROPERLY WITH DELAY RESPONSE AND I AM PRESSING HARD ALL THE WAY DOWN ON THE BRAKE PAD.  I HAVE TAKEN THE VEHICLE TO DIFFERENT MECHANICS AND EVEN REPLACED BRAKE SHOES AND BRAKE PADS, HOWEVER THIS PROBLEM CONTINUES WITH VEHICLE TAKING TOO LONG TO BRAKE AND NOT BRAKING PROPERLY WAS A PROBLEM SINCE I BOUGHT THE VEHICLE.  I HAVE OWNED SEVERAL VEHICLES IN PAST AND AM VERY FAMILIAR WITH CAR BRAKING SYSTEMS AND THE RESPONSE TIMES NEEDED TO BRAKE.  THE BRAKING SYSTEM ON THIS VEHICLE IS FAULTY AND IS UNSAFE AND DOES NOT MEET STANDARDS TO APPROVE THIS VEHICLE FOR SAFE DRIVING.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2013",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532828,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE VEHICLE BRAND NEW AND NOTICED YOU HAVE TO DEPRESS THE BRAKE PEDAL ALL THE WAY DOWN IN ORDER FOR THE VEHICLE TO SLOW DOWN AND STOP.  SPOKE TO THE DEALERSHIP AND THEY SAID ALL KIA SORENTO MODELS ARE LIKE THIS, YOU HAVE TO PRESS HARD DOWN ON THE BRAKE PEDAL FOR VEHICLE TO SLOW DOWN AND FINALLY STOP AND IT TAKES A WHILE FOR IT TO RESPOND.  HAVING OWNED SEVERAL VEHICLES AND DRIVING FOR 15 YEARS, I KNEW SOMETHING WAS WRONG WITH THE VEHICLE BRAKING SYSTEM BUT I JUST DEALT WITH IT ACCEPTING THE ANSWER THAT KIA SORENTO BRAKES WERE NOT GOING TO BE AS GOOD AS OTHER BRAND BRAKES (HONDA, TOYOTA, MAZDA).  I TOOK THE VEHICLE IN FOR REGULAR MAINTENANCE AND ALWAYS ASKED THE ENGINEERS IF THEY COULD DO SOMETHING ABOUT THE BRAKES AND HOW LONG IT TAKES TO BRAKE (BRAKING DISTANCE).  I FELT UNSAFE DRIVING THIS VEHICLE AND ULTIMATELY SOLD AFTER REPLACE BRAKES AND SHOE PADS.  THE PASSENGER AIRBAG LIGHT WAS ALSO FAULTY WHEN AN ADULT WOULD BE SITTING THERE AND IT WAS NOT WORKING.  THERE WAS ALSO A CHECK ENGINE LIGHT THAT WOULD RANDOMLY COME ON AS WELL AS THE TPMS (TIRE PRESSURE MONITORING SYSTEM).  I TOOK IT TO THE MECHANICS AND KIA DEALERSHIP AND THEY WOULD JUST TURN OFF THE LIGHTS BUT COULDN'T EXPLAIN A REASON FOR THESE TURNING ON AS THE VEHICLE TIRES AND ENGINE WERE OK.  I CANNOT UNDERSTAND WHY THE BRAKING SYSTEM WAS ALLOWED TO PASS ON THIS VEHICLE WHEN IT WAS NOT ABLE TO STOP AT HIGHWAY SPEEDS IN A ACCEPTABLE TIME.  I HOPE KIA ISSUES A RECALL ON 2008 KIA SORENTO LX MODELS TO REPLACE OR FIX THE BRAKING ISSUES BECAUSE IT IS VERY DANGEROUS TO BE DRIVING ON THE ROAD AND NOT BEING ABLE TO BRAKE PROPERLY.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKED OUT OF DRIVEWAY, CHECK ENGINE & ESC OFF LIGHT CAME ON, WOULDN'T ACCELERATE OVER 20MPH.  BROUGHT BACK HOME AND PARKED.  FEW HOURS LATER TOOK GRANDDAUGHTER TO DENTIST AND ONLY CHECK ENGINE LIGHT ILLUMINATED.  DIDN'T GO OFF UNTIL TOOK TO AUTO ZONE ON ASHEVILLE HWY, KNOXVILLE, TN.  AFTER PLACING ON DIAGNOSTIC MACHINE AND GIVING A PRINT OUT OF PROBABLE CAUSES, CHECK ENGINE LIGHT WENT OFF.  TOOK TO DEALERSHIP ON 7/29 AND WOULDN'T EXCEPT DIAGNOSIS SINCE THEY DIDN'T PERFORM.  WAS SHOWING ELECTRICAL AND VALVE PROBLEMS.  STATED UNABLE TO REPAIR DUE TO LIGHTS NOT BEING ON WHEN CAR WAS AT THE KIA DEALERSHIP. STATED REPLACED THE PROBLEM WITH RECALL.  HOWEVER, NOW STATING MOTOR SEALS NEED REPLACED WHICH IS COVERED UNDER WARRANTY. UNSURE IF OTHER ISSUE HAS BEEN RESOLVED DUE TO NO ISSUES SINCE FRIDAY.  *TR",
        "vin": "KNDJD735785"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2013",
        "dateOfIncident": "07/20/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526018,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A SURFACE STREET WITH A 40 MPH SPEED LIMIT.  CAR SUDDENLY LOST POWER AND COULD NOT GET SPEED ABOVE 20 MPH.  WE WERE LUCKY THAT THERE WASN'T MUCH TRAFFIC ABOUT AS THIS COULD DEFINITELY HAVE CAUSED AN ACCIDENT.  WHEN THIS HAPPENED BOTH THE ESC OFF LIGHT AND THE CHECK ENGINE LIGHT CAME ON.  WE HAD TO LEAVE OUR CAR IN NEVADA AND GET A RENTAL CAR TO GET HOME TO ARIZONA, WE HAVE NO IDEA WHEN WE WILL GET OUR CAR FIXED AND BACK HOME.  WE WERE OWNERS OF A KIA RONDO AND THE SAME THING HAPPENED TO THAT VEHICLE TOO (NO LONGER OWN THAT ONE).  THIS VEHICLE NEEDS TO BE RECALLED IMMEDIATELY AND KIA NEEDS TO ADMIT THAT THERE IS SOMETHING SERIOUSLY WRONG AND THAT THEY WILL TAKE RESPONSIBILITY FOR FIXING IT.  TOO MANY OWNERS HAVING EXACTLY THE SAME PROBLEM, WE SHOULD NOT BE IGNORED.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "07/16/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON AN INTERSTATE WITH A SPEED LIMIT OF 65 MPH WHEN WITH NO WARNING THE \"CHECK ENGINE\" AND \"ESC OFF\" LIGHTS CAME ON SIMULTANEOUSLY.  AT THE SAME TIME, THE ENGINE LOST POWER, CAUSING MY VEHICLE TO SUDDENLY DECELERATE AND ALMOST CAUSING A COLLISION BOTH WITH THE CAR BEHIND ME AND WITH THE CARS MERGING OVER FROM AN ENTRANCE RAMP.  LUCKILY, I WAS ABLE TO SAFELY MAINTAIN CONTROL OF MY CAR AND PUT ON MY HAZARD LIGHTS TO WARN OTHER DRIVERS OF MY MUCH SLOWER SPEED.  EVEN DEPRESSING THE GAS PEDAL TO THE FLOOR, I WAS UNABLE TO ACCELERATE ABOVE 55 MPH, AND MY SPEED GOING UP HILLS WAS SIGNIFICANTLY SLOWER.  ONCE I WAS ABLE TO SAFELY REACH A SHOULDER WITH COMFORTABLE CLEARANCE, I PULLED OVER AND STOPPED THE CAR FOR A FEW MINUTES.  I RESTARTED THE CAR, BOTH LIGHTS REMAINED ON, AND I SIMILARLY WAS UNABLE TO ACCELERATE THE CAR APPROPRIATELY, ESPECIALLY FROM A STOP.  I LIMPED ALONG WITH MY HAZARD LIGHTS FOR THE LAST FEW MILES TO WORK WHERE I IMMEDIATELY BEGAN RESEARCHING THIS ISSUE ONLY TO FIND THAT THIS IS FAR FROM AN ISOLATED INCIDENT.  IN FACT, THIS PROBLEM SEEMS TO BE PERVASIVE IN KIAS OF SIMILAR MODEL YEAR.  THERE ARE SCORES OF KIA OWNERS WHO HAVE EXPERIENCED A SIMILAR SERIES OF EVENTS.  THE SUDDEN AND UNEXPECTED LOSS OF POWER WITH ABSOLUTELY NO WARNING IS HIGHLY DANGEROUS IN ANY SITUATION, BUT ESPECIALLY SO ON THE INTERSTATE WHEN SPEED LIMITS ARE SO HIGH.  I WAS SO LUCKY THAT THE DRIVERS AROUND ME AND I WERE ABLE TO AVOID AN INJURY-CAUSING CRASH.  THIS ISSUE NEEDS TO BE INVESTIGATED SWIFTLY AND THOROUGHLY.  AGAIN, A SIMPLE SEARCH OF THIS VERY WEBSITE AS WELL AS OTHER ONLINE CAR FORUMS REVEALS A PROBLEM SO WIDESPREAD THAT IT SHOULD WARRANT A RECALL BY KIA.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "06/27/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524808,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 KIA SORENTO EX WHEN ALL OF A SUDDEN MY ESC LIGHT AND ENGINE LIGHT CAME ON AND I COULD NOT ACCELERATE, MY VEHICLE IN FACT SLOWED DOWN TERRIBLY. I HAVE NOTICED THAT IF I SHUT MY CAR OFF THEN TURN IT BACK ON SOMETIMES THIS WILL TAKE CARE OF THE PROBLEM FOR A SHORT TIME. THIS IS VERY DANGEROUS WHEN DRIVING WITH MY KIDS IN THE BACKSEAT. IF MY CAR SLOWS WHILE ON THE HIGHWAY I COULD END UP CAUSING QUITE AN ACCIDENT NOT TO MENTION HURTING MYSELF OR MY FAMILY THAT IS IN THE VEHICLE. MILEAGE ON MY VEHICLE AT THE TIME WAS APPROXIMATELY 65000 MILES.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523281,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR TO WARM UP FOR TRIP TO WORK. ESC LIGHT STAYED/CAME ON. ENGINE WOULDN'T ALLOW SPEED OVER 55 WITH THE GAS PEDAL FLOORED. TOOK TO KIA DEALER MADE APPOINTMENT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2013",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512733,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I TURN ON MY CAR THE ESC OFF LIGHT IS ILLUMINATED.  WHEN I STEP ON THE GAS I HAVE NO POWER.  IF I TURN THE CAR OFF AND THEN BACK ON, IT WILL USUALLY DISAPPEAR.  I HAVE DONE RESEARCH ON LINE, AND MANY PEOPLE WITH MY SAME CAR HAVE THE SAME ISSUE.  THE ISSUE IN THEIR CARS HAVE PROGRESSED TO RANDOMLY TURNING ON WHILE GOING 65 MILES AND HOUR, AND LOSING SPEED WHICH HAS ALMOST CAUSED SEVERAL ACCIDENTS.  I CURRENTLY DO NOT KNOW OF ANY ACCIDENTS, BUT THIS NOW HAS ME AFRAID TO DRIVE MY CAR.  IF IT IS A KNOWN PROBLEM, WHY HAS THERE NOT BEEN A RECALL TO FIX IT?  *TR",
        "vin": "KNDJC736085"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2013",
        "dateOfIncident": "01/19/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN.19,2013 MY 2008 KIA SORENTO STARTED TO LOSS POWER AND THE ENGINE LIGHT TURNED ON THE CAR STARTED TO SHAKE, THE DEALER FOUND THE VEHICLE SHOWN CODE PO300 ,VEHICLE MISFIRE AND IT BURNED PLUG ASSY-SPARK AND COIL ASSY-IGNITION. REPAIRS WERE DONE AT CITY KIA OF GREATER ORLANDO. SERVICES WAS GREAT.    MARCH 7,2013 THE SAME INCIDENT AS ABOVE  HAPPENED AGAIN THE REPAIR SHOP FOUND CAMSHAFT SENSOR CONNECTION ERROR, PERFORM PIN TENSION RECHECKED. I WAS TREATED BADLY, THEY STATED AT FIRST THEY DID NOT KNOW WHAT WAS GOING ON AND REFUSED TO OFFER ANY SITUATION. REPAIR WERE DONE WHERE I HAD PURCHASED THE VEHICLE IN 2/2011 WITH KIA WARRANTY. LOCATION ORLANDO KIA E.COLONIAL DRIVE.ORL FL.32817. ON MAY 4,2013 MY VEHICLE APPEARS TO HAVE THE SAME ISSUES AS ABOVE INCIDENTS WILL TAKE IT BACK TO DEALER ON E. COLONIAL DRIVE ON MONDAY 6,2013. HOPE THEY WILL HELP ME....  *TR",
        "vin": "KNDJD735985"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "01/31/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505347,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED WHENEVER THE FRONT PASSENGER SEAT WAS OCCUPIED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THE CONTACT WAS ADVISED HIM THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000. THE CURRENT MILEAGE WAS APPROXIMATELY 20,000. THE VIN WAS UNAVAILABLE.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2013",
        "dateOfIncident": "02/12/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504877,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, A LOUD BANGING NOISE WAS HEARD FROM THE REAR PASSENGER'S SIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE ENGINE THREW A ROD, CAUSING A HOLE IN THE OIL PAN. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 63,000.  *TR",
        "vin": "KNDJC735385"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2013",
        "dateOfIncident": "12/21/2006",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE  DRIVING DOWN ROAD, CAR WAS BEARLY PULLING. NOTICED SMOKE ON FRONT PASSENGER SIDE OF CAR. STOPPED AND CHECKED UNDER HOOD AND SAW NOTHING. WALKED AROUND CAR AND FLAMES WERE COMING OUT OF WHEEL AREA. HAD CAR TOWED. HAD NEW CALIPER, ROTOR, AND BRAKE PADS PUT ON. DROVE ABOUT A WEEK. AND BEGAN DOING THE SAME THING. HAD CAR TOWED TO MECHANIC SHOP, 4TH DAY THERE THE BRAKES WENT TOTALLY OUT. CAR CRASHED THROUGH THE DOOR OF SHOP AND HIT POLE. CAR IN STILL AT BODY SHOP SOME PARTS WERE HARD TO FIND. STILL WILL HAVE TO GET BRAKES FIXED WHEN I GET CAR THIS WEEK. I HAVE BEEN WITHOUT MY CAR SINCE JANUARY 2013. THIS IS MARCH 27TH 2013.  *TR",
        "vin": "KNDJD735485"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2013",
        "dateOfIncident": "03/18/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504467,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO GET ON THE HIGHWAY WHEN MY 2008 KIA SORENTO REFUSED TO ACCELERATE. I HAD TO PULL OVER AND WHILE I WAS DOING SO I DID NOT HAVE MY FOOT ON THE GAS OR BRAKE. INSTEAD IT WAS BRAKING ITSELF. THIS THE 3RD TIME THIS HAS HAPPENED. I'M READY TO GET A NEW CAR!  KIAS SUCK!  *TR",
        "vin": "KNDJD735285"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2013",
        "dateOfIncident": "03/14/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503256,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RESEARCHED AND FOUND THAT OTHER 2008 KIA SORRENTO OWNERS HAVE REPORTED TO KIA, ABOUT THE ESC LIGHT COMING ON CAUSING LOST OF POWER IN THE VEHICLE. KIA IS CONTENT TO CHARGE CUSTOMER A DIAGNOSTIC FEE, FIX PART THAT DO NOT NEED TO BE FIXED WHEN CLEARLY THERE IS A DEFECT IN THE VEHICLE. WHEN YOU MENTION TO THEM THE COMPLAINTS FILED ABOUT THE PROBLEM, THEY INDICATE THE HAVE NEVER HEARD ANYTHING ABOUT IT INSTEAD OF TAKING THE TIME TO LOOK ON SAFECAR.GOV, THEY CONTINUE TO BRUSH IT OFF. NOT SURE HOW BEING ON THE HWY DRIVING AT 70 MPH AND YOUR VEHICLE SUDDENLY DROPPING TO 20MPH IS A CUSTOMER PROBLEM. ALSO NOT SURE HOW WHEN YOU PLACE MY CAR ON THE MACHINE AND IT GIVES YOU A CODE TO FIX THIS LIFE THREATENING PROBLEM AND IT HAPPENS AGAIN CAUSING ME TO HAVE TO COAST INTO THE EMERGENCY LANE TO KEEP FROM BEING HIT FROM BEHIND WITH 2 CHILDREN IN THE BACK SEAT IS A CUSTOMER PROBLEM SOUNDS LIKE A DEFECT TO ME.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2013",
        "dateOfIncident": "01/30/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498098,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ELECTRONIC STABILITY CONTROL \"OFF\" (ESC OFF) LIGHT AND THE CHECK ENGINE LIGHT CAME ON AT THE SAME TIME.  UPON TAKING IT TO THE A MECHANIC, HE INFORMED ME THAT THE ACCELERATOR PEDAL POSITION SENSOR WAS BAD.  I CONTINUED READING ONLINE, AND HAVE NOTICE THIS HAS HAPPENED ON MANY OCCASIONS.  WHEN THIS OCCURS THE VEHICLE LOOSES ALL POWER TO MAKE ANY NECESSARY CORRECTIVE ACTIONS WHICH COULD RESULT IN A ACCIDENT.  IT ALSO SLOWS THE CAR DRASTICALLY WHILE IN MOTION, AGAIN WITH THE POSSIBILITY OF CAUSING AN ACCIDENT.   ## VIN FAILED ##   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2013",
        "dateOfIncident": "02/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496960,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 KIA SORENTO LAST YEAR AS A PRE-OWNED VEHICLE. I HAVE STARTED HAVING SERIOUS ISSUES WITH THIS VEHICLE. A DEER RAN INTO MY VEHICLE APRIL 2012 REALLY MESSED UP MY ENTIRE FRONT END AND SIDE. MY INSURANCE COMPANY HAD MY VEHICLE BOTCHED UP AND MY NOW MY AVS SYSTEM AND CLUTCH ARE NOT WORKING PROPERLY THEY REFUSED TO FIX MY VEHICLE. NOW I AM HAVING PROBLEM WITH A ESC LIGHT COMING ON I COULDN'T FIND OUT WHAT THIS LIGHT MEANT BUT I CAN IMAGINE THAT IT IS NOT GOOD. THEY NEED TO RECALL THIS VEHICLE BECAUSE TRULY THEY ARE NO GOOD.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493717,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE VEHICLE LOST ACCELERATION POWER AND DID NOT ACCELERATE OVER 20 MPH. THE FAILURE WAS EXPERIENCED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE A DIAGNOSTIC WAS PERFORMED AND REVEALED THAT THE OXYGEN SENOR, BRAKE PEDAL LIGHT SWITCH, AND THROTTLE PEDAL SENSOR HAD FAILED. THE DEALER REPLACED THE FAILED PARTS BUT THE FAILURE RECURRED. THE VEHICLE CONTINUED TO LOSE POWER. THE FAILURE MILEAGE WAS 55,371 AND THE APPROXIMATE CURRENT MILEAGE WAS 64,000.",
        "vin": "KNDJC735585"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10493077,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 18 YEAR OLD SON WAS DRIVING MY KIA SORENTO ALONG WITH HIS 16 YEAR OLD BROTHER IN THE PASSENGER SEAT WHEN THE VEHICLE HYDROPLANED ON A WET ROAD. THE VEHICLE CRASHED INTO A TREE ON THE PASSENGERS SIDE OF THE VEHICLE IN BETWEEN THE FRONT PASSENGER WHEEL AND THE DOOR HINGE. MY 18 YEAR OLD MANAGED TO GET OUT OF THE VEHICLE AND GET HELP FOR HIS BROTHER THAT UNFORTUNATELY HAD PASSED AWAY ON THE SCENE. AFTER REVIEWING MY VEHICLE, I PERSONALLY NOTICED THAT NONE OF THE DRIVER'S OR PASSENGERS AIR BAGS WERE DEPLOYED. I TRAGICALLY LOST MY 16 YEAR OLD SON IN THE MIST OF THE SITUATION AS WELL AS HAVING MY 18 RUSHED TO THE HOSPITAL. MY CONCERN IS THAT WHEN I RECEIVED THE REPORT FROM MY INSURANCE ADJUSTER FOR THE LOSS OF MY VEHICLE... THERE WAS RECALL ATTACHED TO THE FINDINGS FOR THESE AIR BAGS FOR WHICH I HAD NEVER BEEN NOTIFIED OF. I KNOW THIS WILL NEVER BRING HIM BACK TO ME BUT THE AIR BAGS MAY HAVE PREVENTED THE INJURIES AND THE FATALITY!!!!  *TR",
        "vin": "KNDJD735585"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/26/2012",
        "dateOfIncident": "12/26/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10490126,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORRENTO. THE CONTACT STATED THAT WHILE DRIVING 55 MPH IN SNOWY WEATHER, HE ATTEMPTED TO AVOID CRASHING INTO ANOTHER VEHICLE AND SWERVED OFF THE ROADWAY. THE CONTACT TRAVELED OVER A GRASSY AREA BEFORE CRASHING INTO A TREE. THE AIR BAGS FAILED TO DEPLOY AND THE VEHICLE WAS DESTROYED. THE CONTACT STRUCK HER HEAD ON THE WINDSHIELD BUT WAS NOT TRANSPORTED TO THE HOSPITAL. THE POLICE WERE NOTIFIED AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A SALVAGE YARD.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 50,500.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "03/07/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481975,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR PRE OWNED. ABOUT 2 WEEK LATER, WHILE DRIVING THE ESC LIGHT SHOWS UP CAUSING THE CAR TO SLOWLY LOSE POWER. THIS IS VERY DANGEROUS. I ALMOST GOT HIT WHEN THIS HAPPENED!! AFTER 3-4 TIMES LATER, KIA DEALERSHIP CANNOT REPAIR THE ISSUE OR EVEN SOLVE IT. THEY ACTUALLY TOLD ME YESTERDAY THAT THE CAR WAS READY, HOWEVER IT WAS NOT FIXED BC THEY CANT FIGURE IT OUT. THEY TRIED EVERYTHING. I DID PICK UP THE CAR ONLY TO BRING IT RIGHT BACK THIS MORNING. I AM SCARED FOR MY SAFETY AS WELL AS MY CHILDREN. I LOOKED ONLINE AND THEIR ARE SO MANY OTHERS WITH THIS SAME ISSUE. THIS IS INSANE. I AM NOW IN A RENTAL AS THEY ARE TRYING AGAIN FOR TIME #5 TO FIGURE IT OUT. I HAVE SPOKEN TO KIA CORPORATE. I HAVE FILED COMPLAINTS WITH THE BBB. AND NOW I AM HERE. IF ANYONE CARES ABOUT OTHERS SAFETY THIS NEEDS TO BE RECALLED. I REFUSE TO PUT MY CHILDREN'S LIFE AT RISK. IMAGINE DRIVING ON THE HIGHWAY AND ALL OF A SUDDEN THIS LIGHT TURNING ON RANDOMLY AND YOUR CAR JUST LOSING POWER. VERY UNSAFE!!  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2012",
        "dateOfIncident": "09/11/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477012,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO START-UP STALLING TEMPERAMENTALLY FOR THREE WEEKS. ON 9/11/2012 THE CHECK ENGINE LIGHT AND ESC OFF LIGHT APPEARED, FOLLOWED WITH A \"PUTTING\" ENGINE AND LIMP MODE. THE CAR WOULD NOT ACCELERATE WHEN FOOT APPLIED TO GAS PEDAL. KIA DEALERSHIP CONFIRMED TPS AND BRAKE SENSOR FAILURE AND ELECTRONIC STABILITY CONTROL NEEDED REPROGRAMMING. (ERROR CODES READ: P2135, P0638, AND P2A00 OR P2A03.) KIA PUBLISHED BULLETIN TSB 044: HTTP://WWW.KIA-FORUMS.COM/ATTACHMENTS/KIA-CARENS-RONDO-FORUM/5552D1272512047-ENGINE-RACING-STOP-TSB-TPS.PDF    DANGER ASPECT: THE CAR SEEMED DRIVABLE, HOWEVER, THE LIMP MODE DOES NOT ALLOW THE CAR TO ACCELERATE TO THE SPEED LIMIT OR FLOW OF TRAFFIC. RESEARCHED MANY SIMILAR COMPLAINTS -- PLEASE ISSUE AN INVESTIGATION FOR A RECALL.  *TR",
        "vin": "KNDJC735785"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/27/2012",
        "dateOfIncident": "08/26/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. WHILE DRIVING APPROXIMATELY 5 MPH THE RPM READINGS INCREASED AND THE VEHICLE INDEPENDENTLY ACCELERATED TO 20 MPH. THE CONTACT APPLIED THE BRAKE PEDAL BUT THE BRAKES WERE HESITANT TO RESPOND. THE CONTACT ALSO  USED THE EMERGENCY BRAKE IN ORDER TO STOP THE VEHICLE. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 53,455.",
        "vin": "KNDJD735985"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2012",
        "dateOfIncident": "07/30/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472414,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER AIR BAG IS TURNED OFF WHEN AN ADULT SETS IN THE SEAT. THE OCS MISS CLASSIFIES THE ADULT IN THE FRONT SEAT AND THE AIR BAG LIGHT STAYS ON WHICH TURNS THE FRONT AND THE SIDE AIR BAG OFF. KIA HAS A RECALL CAMPAIGN FOR CERTAIN SORENTOS TO BE REPROGRAMMED. HOWEVER WHEN I TOOK MY CAR TO THE KIA DEALER I WAS TOLD THAT MY VIN NUMBER WAS NOT IN THE RECALL EVEN THOUGH I HAVE THE SAME PROBLEM. THEY TOLD ME THAT I WOULD HAVE TO PAY FOR THE REPROGRAMMING MY SELF. THIS DOESN'T MAKE SENSE TO ME BECAUSE MY SORENTO WAS MANUFACTURED WITHIN THE RECALL DATES AND HAS THE SAME PROBLEM. I FEEL THIS IS A SERIOUS SAFETY CONCERN AND SHOULD ME PAID FOR MY KIA MOTORS.  *TR",
        "vin": "KNDJC735185"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2012",
        "dateOfIncident": "06/14/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472024,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TOWED TO THE DEALER WHO DIAGNOSE THAT THE ACCELERATION SENSOR NEEDED TO BE REPLACED. THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 76,000.",
        "vin": "KNDJD735485"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/22/2012",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471955,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CHECK ENGINE AND ESC LIGHTS ILLUMINATED. VEHICLE HAD SUDDEN LOSS OF ACCELERATION AND WOULD NOT GO BEYOND 40MPH. SPEED DECREASED BELOW 40MPH ON HILLS. VEHICLE CONTINUED TO HAVE PROBLEMS EVEN AFTER RESTARTING. A CHECK OF THE ODB-II CODES GAVE P2138, P2127 AND P2106. ALL OF THE CODES REFLECT A MALFUNCTION IN THE ACCELERATOR CONTROL SYSTEM. AWAITING REPAIRS BY LOCAL KIA DEALER.  *TR",
        "vin": "KNDJD735785"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/30/2012",
        "dateOfIncident": "04/17/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468375,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE HAVING PROBLEMS WITH OUR 2008 KIA SORENTO. THE ESC LIGHT, BRAKE LIGHT, BATTERY LIGHT, CHECK ENGINE LIGHT, AND ABS LIGHTS HAVE COME ON. I HAVE CHANGED BRAKES, CHECKED THE BATTERY AND THESE LIGHTS GO OFF AND ON. MY CAR HAS EXPERIENCED REDUCING SPEED WHEN ESC LIGHT HAS COME ON AND STARTED MALFUNCTIONING AT AROUND 64,000 MILES. ABS LIGHT AND CHECK ENGINE HAVE WENT OFF. ESC LIGHT IS STILL GOING OFF AND ON. THE BRAKE LIGHTS HAVE FAILED ON US. I AM CONCERNED FOR MY WIFE'S SAFETY TO ALL THESE DEFECTS THAT ARE HAPPENING, AND WOULD LIKE FOR YOUR HELP IN RESOLVING THESE ISSUES WITH KIA. I HAVE READ OF OTHER PEOPLE HAVING COMPLAINTS WITH THE SAME ISSUES AND SAW TO REPORT THIS TO NHTSA. FURTHERMORE I TOLD KIA OF AN OIL LEAK I WAS HAVING AND ASKED IF IT WOULD BE COVERED UNDER WARRANTY AND THEY FAILED TO ANSWER, AND DID NOT FIX IT. NEVER HAD ANY TROUBLE WITH THE CAR UNTIL I TOOK IT TO THE DEALERSHIP TO HAVE TRANSMISSION FLUID CHANGED AND AFTER THAT IS WHEN ALL THE PROBLEMS STARTED HAPPENING. PLEASE HELP.  *TR",
        "vin": "KNDJD735985"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/09/2012",
        "dateOfIncident": "07/05/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10464743,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT WHILE DRIVING INTO A PARKING SPACE, THE VEHICLE SURGED FORWARD AND CRASHED INTO A TREE. THERE WAS ONE REPORTED INJURY. THE VEHICLE WAS TOWED AWAY FROM THE LOCATION. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WERE 27,000.",
        "vin": "KNDJD736485"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/16/2012",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458745,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE 3RD TIME MY WIFE'S CAR ESC LIGHT AND CHECK ENGINE LIGHT CAME ON AS THE VEHICLE SPEED CAME TO ALMOST A STOP.  THIS IS VERY DANGERS FOR UP HILL OR IN HEAVY TRAFFIC.  SHE ALSO HAD PREVIOUS PROBLEMS WITH   THE ESC LIGHT AND TPS LIGHT COMING ON.  TAKEN TO DEALER SEVERAL TIMES OVER THE LAST YEAR.  WE WERE TOLD TODAY IT WAS A THROTTLE SENSOR PROBLEM.   IT WAS REPLACED TODAY AND HOPEFULLY THAT FIXES THE PROBLEM, ALTHOUGH I SEE ON THE INTERNET WHERE THIS IS A COMMON OCCURRING PROBLEM.  I HOPE SOMEONE DOES NOT HAVE TO GET HURT BEFORE THIS IS A RECALL ISSUE.",
        "vin": "KNDJD736885"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2012",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454804,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS KIA BRAND NEW IN 2008. HAD TO TAKE IT TO THE DEALERSHIP 3 TIMES WITHIN THE FIRST 6 MONTHS BECAUSE WHEN I REACHED BETWEEN 40 AND 50MPH THE VEHICLE JERKED. WAS TOLD EACH TIME THERE IS NOTHING WRONG. ON THE FINAL TIME THE SERVICE MANAGER RODE WITH ME AND TOLD ME IT WAS THE WAY I DROVE. I  HAVE NOW HAD THIS VEHICLE FOR 3 AND HALF YEARS. IT HAS 67,000 MILES. I AM STILL HAVING THE JERKING ISSUE AND NOW THE ENTIRE REAR DIFFERENTIAL NEEDS TO BE REPLACED. I HAVE RESEARCHED DIFFERENT FORUMS ON DIFFERENT WEBSITES AND HAVE FOUND THAT THIS SEEMS TO BE AN ISSUE FOR A LOT OF KIA SORENTO OWNERS. THE DEALERSHIP WILL NOT HONOR MY WARRANTY BECAUSE I DID NOT HAVE THE SERVICE DONE AT  AUTHORIZED KIA SERVICE ESTABLISHMENT SO I HAD TO OUT OF POCKET PAY $1100 TO HAVE MY 3 AND HALF YEAR OLD VEHICLE FIXED. I HAVE OWNED MANY NEW CARS AND HAVE NEVER HAD THIS MUCH OF AN ISSUE AS I HAVE HAD WITH A KIA WITH UNDER 100,000 MILES ON IT.  *TR",
        "vin": "KNDJD735585"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "05/21/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452185,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KIA SORENTO I HAVE HAD 6 SERVICE ISSUES WITH THE CHECK ENGINE LIGHT AND ESC COMING ON. KIA DEALERSHIP HAS REPLACED GAS PEDAL X2, THROTTLE SENSORY ASSY, TIGHTENED CONNECTIONS, CLEARED CODES, APPLIED STABULANT, TIGHTENED PINS, RESET CODES, CLEARED FAULTS,  CLEANED GROUND STATION AND NUMEROUS OTHER THINGS. I ONLY HAVE THESE ISSUES WITH THE CAR IN THE WARMER MONTHS (MAY-AUGUST)? IT LOSES POWER AND WON'T ACCELERATE.     *JS",
        "vin": "KNDJD735385"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2012",
        "dateOfIncident": "01/19/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450326,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3  OCCASIONS MY CAR HAS  SLIPPED OUT OF PARK AFTER STOPPING & REMOVING MY KEY... IT IS POSSIBLE THAT MY KIA HAS ALLOWED ME TO REMOVE THE KEY WHEN IT IS NOT IN PARK, BUT I THINK IT IS THE FORMER.. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2012",
        "dateOfIncident": "10/31/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442731,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A PROBLEM WITH THE PASSENGER SIDE AIR BAG INDICATOR AND AUTO SHUT OFF FEATURE.  THE VEHICLES OF THE SAME MAKE AND MODEL MANUFACTURED ONLY 6 MONTHS PRIOR TO MIND HAVE A RECALL.  THE PROBLEM LIES THAT THE PASSENGER SIDE SEAT HAS A SENSOR TO TURN ON THE AIR BAG.  THE FEATURE WILL ONLY TURN ON IF THE PASSENGER IS 130 LBS OR MORE.  SO MY WIFE THAT WEIGHS 120LBS WILL NOT ACTIVATE THE AIR BAG, AND THE PASSENGER SIDE AIR BAG OFF REMAINS ON.  I WAS TOLD OF THIS BY MY LOCAL KIA TECHNICIAN THAT SAID THIS IS A PROBLEM ON ALL THE SORENTO OF THIS YEAR.  SO THERE IS NOTHING HE CAN DO.  MY VEHICLE IS STILL UNDER WARRANTY.  KIA SAID THEY ARE UNWILLING TO FIX.  SO THEY MAY HAVE A LAWSUIT ON THEIR HANDS LATER.  THIS NEEDS TO BE RESOLVED ARE THERE ARE MANY ADULTS THAT WEIGH LESS THAN 130LBS.  *TR",
        "vin": "KNDJD735385"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2011",
        "dateOfIncident": "06/08/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440321,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. A WHINING NOISE DEVELOPED AROUND 40K AND PROGRESSIVELY GOT WORSE. WAS TOLD THE DIFFERENTIAL NEEDED TO BE REPLACED. COME TO FIND OUT IT WAS A FAULTY BEARING.  2. PASSENGER SIDE SEAT AIRBAG LIGHTS COME ON FOR NO REASON STATING THAT AIRBAGS ARE OFF EVEN WHEN THERE IS AN ADULT PASSENGER IN THE SEAT  3. SUDDEN LOSS OF POWER AND CAR IS LITERALLY NOT ABLE TO ACCELERATE, DUE TO SENSOR THAT CONTROLS ACCELERATOR, HAPPENED TWICE BEFORE BEING REPLACED. *TR",
        "vin": "KNDJC735385"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2011",
        "dateOfIncident": "12/08/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439854,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NO REAR BRAKE LIGHT. THE ESC OFF LIGHT COMES ON IN THE DASH.  I CAN TURN ON THE CRUISE CONTROL BUT I CAN'T SET A SPEED FOR CRUISE CONTROL. I HAVE A REMOTE STARTER THAT HAS A SAFETY SWITCH WHEN THE BRAKE IS PRESSED TURNS THE REMOTE STARTER OFF THAT ISN'T WORKING CORRECTLY CAUSE THERE IS NO SIGNAL THAT THE BRAKE HAS BEEN PRESSED.  *TR",
        "vin": "KNDJC736085"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2011",
        "dateOfIncident": "10/10/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435183,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG OFF WARNING LIGHT ILLUMINATED INTERMITTENTLY. THE DEALER ADVISED THE CONTACT THAT THE VEHICLE WAS OPERATING AS DESIGNED.  THE MANUFACTURER WAS CONTACTED AND A COMPLAINT WAS FILED.  THE CONTACT WAS ALSO ADVISED TO TAKE THE VEHICLE TO ANOTHER DEALER FOR A SECOND OPINION. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 31,700.",
        "vin": "KNDJD735185"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2011",
        "dateOfIncident": "10/12/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434824,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORENTO LX LOSES POWER & WILL NOT ACCELERATE TO 60MPH. I FEAR DRIVING MY VEHICLE BECAUSE I WAS ALMOST REAR ENDED ON 2 SEPARATE OCCASIONS BY AN 18-WHEELER DIESEL DUE TO THE FACT THE POWER IS LOST UPON ACCELERATION ATTEMPTS. IN ADDITION TO THE LOSS OF POWER, THE CHECK ENGINE & ESC OFF LIGHTS STAY ILLUMINATED. LIKE MANY OF THE OTHER COMPLAINTS, I HAVE TRIED TURNING MY ENGINE OFF & WAITING 10 MINUTES BEFORE RESTARTING THE ENGINE TO SEE IF THAT CLEARS THE STATUS OF THE LIGHTS BUT HAD LIMITED SUCCESS. THE VEHICLE HAS BEEN TAKEN TO THE DEALERSHIP AT LEAST 3 TIMES, WHILE UNDER WARRANTY, FOR RESOLUTION. THE DEALERSHIP HAS ADVISED THAT CERTAIN SENSORS HAVE BEEN REPLACED AS WELL AS THE GAS PEDAL BUT YET EITHER HAS RESOLVED THE ISSUE. THE DEALERSHIP EVEN WANTED TO CHARGE ME $2800 FOR ONE TRIP & $1800 ON THE NEXT. THIS WAS TOTALLY UNACCEPTABLE & CORPORATE WAS CONTACTED IMMEDIATELY. I AM CURRENTLY WAITING ON A RESPONSE FROM THEM. THE BRAKES ON THIS VEHICLE AS WELL HAVE BEEN AN ISSUE & ARE ANOTHER REASON FOR WHY I FEAR FOR THE SAFETY OF ME & MY PASSENGERS WHEN THIS VEHICLE IS DRIVEN.  *TR",
        "vin": "KNDJD735685"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2011",
        "dateOfIncident": "11/26/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434828,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE NEEDLE DROPS DOWN FROM FULL TO EMPTY AND THE LOW/OUT OF GAS INDICATOR LIGHT COMES ON, BUT GOES OFF AFTER NEEDLE MOVES FROM THE LOW FUEL GAUGE MARKING. THIS MALFUNCTION OF THE FUEL GAS NEEDLE HAPPENS AT NO SPECIFIC TIME INTERVAL OR SPEED RATE.  *TR",
        "vin": "KNDJC735785"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/16/2011",
        "dateOfIncident": "10/16/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430403,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"CHECK ENGINE\" LIGHT HAS COME ON AND STAYS ON.  ALSO, THE \"ESC OFF\" LIGHT COMES ON INTERMITTENTLY.  THE CAR IS ONLY DRIVEN SHORT DISTANCES A COUPLE OF TIMES A WEEK, HOWEVER WE ARE AFRAID TO DRIVE IT AT ALL BECAUSE OF THE REPORTS OF POWER AND CONTROL FAILURE.  THE BRAKE LIGHTS ARE ALSO NOT WORKING, WHICH COMPOUNDS THE PROBLEM.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/21/2011",
        "dateOfIncident": "08/21/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420887,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO TPS PROBLEM CAUSING MY VEHICLE TO HAVE NO ACCELERATION VERY DANGEROUS WHILE DRIVING ESC AND CHECK ENGINE LIGHT COME ON WHEN PROBLEM OCCURS. TOOK TO LOCAL AUTO ZONE TO SEE WHY ENGINE LIGHT CAME ON AND THERE CODE READER SAID I HAD 3 DIFFERENT CODES WRONG WITH THE CAR WHICH ALL WERE RELATED TO THE TPS SENSOR. THIS NEEDS TO BE A SAFETY RECALL ASAP.  *TR",
        "vin": "KNDJC736085"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2011",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419279,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO LOSES POWER.  ESC LIGHT ILLUMINATES AS WELL AS CHECK ENGINE LIGHT.  VEHICLE WILL NOT ACCELERATE TO MORE THAN ABOUT 40-45 MPH.  IF I PULL OVER TO A STOP AND TURN THE ENGINE OFF AND THEN RESTART THE ENGINE THE PROBLEM SOMETIMES RESOLVES ITSELF.  SOMETIMES I FIND THE FUEL CAP IS LOOSE AND WITHOUT TURNING THE ENGINE OFF I TIGHTEN THE CAP AND THIS RESOLVES THE PROBLEM.  I BOUGHT THIS VEHICLE IN JUNE 2009.  IT WAS USED WITH ABOUT 12,000 MILES ON IT.  THE FIRST TIME THIS HAPPENED MY SON HAD IT ON A TRIP AND HE CALLED IN A PANIC WHILE DRIVING IN A LARGE CITY WITH HEAVY TRAFFIC.  THAT WAS IN THE SUMMER OF 2010.  THE PROBLEM WAS RESOLVED BY TIGHTENING THE FUEL CAP AS HE TOLD ME HE HAD JUST FILLED IT WITH FUEL.  DURING THE SUMMER OF 2011 THE PROBLEM HAS BECOME MUCH MORE FREQUENT, NEARLY A WEEKLY EVENT FOR EITHER MY WIFE OR ME.  THANKFULLY WE LIVE IN A SMALLER CITY WHERE TRAFFIC IS LIGHTER AND IT IS EASY TO  PULL OFF ON A SIDE STREET TO DO THE \"SHUTDOWN/RESTART\" PROCEDURE.  *TR",
        "vin": "KNDJC735185"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/11/2011",
        "dateOfIncident": "08/08/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418591,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE CAR IN DECEMBER OF 2008. PROBLEMS BEGAN WITH THE ESC OFF LIGHT AND CHECK ENGINE ABOUT A YEAR LATER. MULTIPLE PARTS WERE SUPPOSEDLY FIXED AND REPLACED BUT THE LIGHTS KEPT COMING ON, EACH TIME LOOSING ALL ACCELERATION SOMETIMES ON THE HIGHWAY! A FEW DAYS AGO, DRIVING UP A HILL, BOTH LIGHTS ARE ON, MY CAR STALLS OUT, STEERING LOCKS AND STARTS ROLLING DOWN THE HILL, LUCKILY IN A QUIET, SLOW TRAFFIC NEIGHBORHOOD. AFTER THAT MY CAR WON'T EVEN START. HAD TO GET IT TOWED TO THE DEALERSHIP. THEY HAVE SINCE CALLED CORPORATE... WE WILL SEE WHAT THAT DOES.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "08/08/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418202,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORENTO IS EXPERIENCING INTERMITTENT TRANSMISSION LUNGING.  THERE IS ONLY 40,000 MILES ON THIS VEHICLE.  THE VEHICLE DOES THIS EVERY DAY, EXCEPT WHEN I TAKE IT INTO THE DEALER.  ONCE I DO TAKE IT IN TO THE DEALER, THEY SAY THAT NOTHING IS WRONG AND THAT THEY CANNOT GET THE CAR TO DO THE SAME THING I DO.  I BELIEVE THAT NO DIAGNOSTICS WERE PERFORMED, AND I KNOW THAT A PROPER ROAD TEST WAS NOT PERFORMED.  I HAVE TAKEN THIS VEHICLE IN 2 TIMES WITHIN THE LAST MONTH AND NO SOLUTION HAS BEEN DETERMINED.  *TR",
        "vin": "KNDJD736485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/04/2011",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417074,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE WE PURCHASED OUR 2008 KIA SORENTO IN MARCH 2009, THERE HAS BEEN A PROBLEM WITH THE PASSENGER SEAT WHERE WHEN I AM SITTING THERE AND THE \"PASSENGER AIRBAG OFF\" LIGHT IS ILLUMINATED.  I AM 150 POUNDS, AND MOVED MYSELF AROUND IN THE SEAT, WEIGHT CENTERED, SITTING PROPERLY.  AT THE SAME TIME WE HAVE BEEN FIGHTING THE ISSUE OF THE ESC OFF AND CHECK ENGINE LIGHT AS WELL, SO THE 3 TIMES THE VEHICLE HAS BEEN TO SERVICE FOR THE ESC OFF PROBLEM, WE ALSO TOLD THEM ABOUT THE PASSENGER AIRBAG OFF.  MY HUSBAND IS THE ONE WHO TOOK THE VEHICLE AND THE FIRST TIME THEY TOLD HIM THAT I WAS NOT POSITIONED IN THE SEAT PROPERLY.  THE SECOND TIME THE VEHICLE WENT TO THE SERVICE DEPT, IT WAS AFTER I BASICALLY YELLED AT THEM ON THE PHONE AND TOLD THEM TO RIP OUT THE SEAT IF THEY HAD TO IN ORDER TO FIX IT. AGAIN, MY HUSBAND TOOK IT, THEY SAID THAT \"THE AIRBAG WILL DEPLOY, BUT IT MIGHT BE SLOW.\" I KNEW THIS WAS INCORRECT.  I KNOW THE WAY IT WORKS AND IF THE SENSOR IS NOT WORKING PROPERLY AND IT SAYS THE AIRBAG IS OFF, IT WILL NOT DEPLOY.  THE THIRD TIME IT WENT TO SERVICE FOR THE ESC OFF LIGHT PROBLEM, MY FATHER WENT AND HAD A STERN CONVERSATION WITH THE SERVICE MANAGER AND ADVISED HIM THAT HE WAS A SERVICE MANAGER AND THAT HE KNOWS THAT IT IS HIS RESPONSIBILITY TO FIND OUT THE CAUSE OF THE PROBLEM AND FIX IT, ESPECIALLY BEING THE CAR IS UNDER WARRANTY AND THAT THIS IS A SAFETY ISSUE.  THEY SUPPOSEDLY FIXED THE ISSUE, I'M NOT SURE WHAT THEY DID, BUT WE HAVE ONLY HAD THE PROBLEM AGAIN ONCE IN THE PAST 6 MONTHS, AS OPPOSED TO TWICE A WEEK FOR OVER A YEAR.  I HAVE FILED A SEPARATE COMPLAINT REGARDING THE ESC OFF AND CHECK ENGINE LIGHT. *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2011",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417070,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2008 SORENTO, PURCHASED IN MARCH 2009 (NEW). APPROXIMATELY A YEAR AND A HALF AGO, ONLY APPROX 15,000MILES, WE HAD OUR FIRST INCIDENT THAT THE ESC OFF LIGHT AND CHECK ENGINE LIGHT ILLUMINATED ON THE DASH, AT THE SAME TIME, POWER WAS SIGNIFICANTLY DECREASED TO THE ENGINE. THANKFULLY, I WAS DRIVING IN MY NEIGHBORHOOD AND NOT ON THE HIGHWAY. I TURNED THE CAR OFF AND BACK ON AND THE ESC OFF LIGHT WAS NOW OFF, BUT THE CHECK ENGINE LIGHT REMAINED ON FOR THE REST OF THE DAY. WE DIDN'T THINK MUCH OF IT UNTIL IT HAPPENED AGAIN, ABOUT 2-3 WEEKS LATER. THIS TIME WE TOOK IT TO THE SERVICE DEPARTMENT. THEY INSISTED THAT THEY DIDN'T KNOW WHAT CAUSED IT AND THAT THERE WAS NO RECORD IN THE \"COMPUTER\" OF THE CHECK ENGINE LIGHT BEING ON. WE WERE BASICALLY DISMISSED BECAUSE THEY COULD NOT EVEN TELL THAT IT HAPPENED. THE THIRD TIME IT HAPPENED I WAS ON MY WAY TO WORK, TURNING ONTO THE ENTRANCE RAMP OF I-95, I LOST POWER AND COULD NOT ACCELERATE TO MERGE ONTO THE HIGHWAY. I WAS FURIOUS AND FRIGHTENED OF THE POSSIBLE DANGER OF THE SITUATION, AND CALLED TO MAKE A SERVICE APPOINTMENT, THIS WAS THE 2ND TIME, WHICH BY THE TIME WE GOT THERE EVERYTHING WAS BACK TO \"NORMAL\" AND NO RECORD IN THE COMPUTER. I HAD PRINTED OUT RESEARCH FOR MY HUSBAND TO TAKE WITH HIM TO SHOW THEM THAT OTHER PEOPLE HAVE HAD THIS PROBLEM AND THAT THE TCM WAS REPLACED, HOWEVER THEY DISMISSED HIM AND DID SOMETHING ELSE. IT WAS FINE FOR A WHILE, THEN HAPPENED AGAIN (APPROX DEC. 2010) WHEN MY HUSBAND WAS DRIVING DOWN I-95, WE LOST POWER WHILE GOING 65 MPH AND THE ESC AND CHECK ENGINE LIGHT ON. THIS TIME, MY DAD (WHO USED TO BE A SERVICE MANAGER) WAS AVAILABLE AND WENT TO THE DEALERSHIP AND HAD A STERN CONVERSATION WITH THE SERVICE MANAGER EXPRESSING HIS CONCERN FOR OUR SAFETY. THEY SUPPOSEDLY FIXED THE PROBLEM, I'M NOT SURE WHAT THEY DID, AND IT HAS BEEN FINE FOR THE PAST 6 MONTHS, UNTIL THE PAST 2 WEEKS, THE SAME PROBLEM HAS OCCURRED TWICE. WE ALSO HAD THE PASSENGER AIRBAG OFF WHEN I AM SITTING IN THE SEAT AS WELL.  *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "05/29/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415858,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 75 MPH ON HIGHWAY THE ESC OFF LIGHT LUMINATED AND CHECK ENGINE LIGHT CAME ON.  CAR LOST ACCELERATION AND POWER (WENT FROM 75 MPH TO 10 MPH INSTANTLY ON HWY). KIA REPLACED THE TPS SENSOR AND UPDATED ECM MODULE.  ONE YEAR LATER SAME EVENT HAPPENED REPEATEDLY. DEALER WILL NOT FIX EVEN WITH TECH BULLETIN. TRIED TO CONTACT KIA MOTORS WITH NO RETURN RESPONSE.  AT THE CURRENT TIME THE VEHICLE WILL NOT ACCELERATE.  FASTEST IT WILL GO IS 45MPH EVEN WITH ACCELERATION PEDAL PUSHED ALL THE WAY DOWN.  WHEN YOU TRY TO PULL OUT OR ACCELERATE THE VECHICLE LOOSES POWER.  RANDOMLY THE CHECK ENGINE AND \"ESC OFF\" LIGHT WILL GO OFF AND CAR WILL ACCELERATE BUT ONCE OVER 65MPH WILL LOSE ALL POWER HAS ALMOSTED CAUSED SEVERAL WRECKS THAT WOULD HAVE CAUSED AN ACCIDENT FROM BEHIND.  THE LACK OF POWER IS DANGEROUS BUT NOT AS DANGEROUS AS THE VEHICLE LOSING POWER ON THE HIGHWAY OR WHILE TRYING TO PULL OUT FROM A COMPLETE STOP.  VEHICLE HAS LOST POWER IN INTERSECTION NEARLY CAUSING SIDE WRECK.  SEARCHED ON INTERNET AND TPS SEEMS TO BE COMMON PROBLEM",
        "vin": "KNDJC735085"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/24/2011",
        "dateOfIncident": "07/24/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414923,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORENTO HAS 40000 MILES AND THE ESC OFF INDICATOR, AS WELL AS, THE CHECK ENGINE LIGHT IS ON. I WAS DRIVING TO CHURCH AND WHILE DRIVING THE ACCELERATION DIMINISHED. I AM VERY DISAPPOINTED, BEING I JUST BLUNT THE CAR A MONTH AGO. YES IT IS STILL UNDER WARRANTY, BUT WHAT ABOUT WHEN IT IS NOT.... FROM THE LOOKS OF IT THIS IS A CONTINUAL PROBLEM THAT SHOULD BE INVESTIGATED, BEFORE SOMEONE LIFE BE HARMED WHILE DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2011",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412010,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KIA SORENTO WITH JUST OVER 34,000 MILES ON IT AND AM ON MY SECOND EXPERIENCE WITH THE ESC OFF PROBLEM. THE FIRST TIME WAS JULY 2010, CAR WAS TAKEN TO A DEALERSHIP AND THEY REPLACED THE SENSOR AND CAR WORKED FINE UNTIL THIS PAST MONDAY. I STARTED MY CAR TO WARM IT UP AND AFTER 10 MINUTES I RETURNED TO THE CAR TO LEAVE AND NOTICED THAT THE ESC OFF LIGHT WAS ON AS WELL AS THE CHECK ENGINE LIGHT. AS PREVIOUS EXPERIENCE HAS SHOWN ME, THE ESC OFF LIGHT IS DANGEROUS AS THE CAR LOSES POWER. I TURNED THE CAR OFF, THEN ON, BUT THE LIGHTS WERE STILL ON. I GOT A RIDE TO WORK THAT DAY, BUT MY DAD WENT OVER TO LOOK AT THE CAR. THE ESC OFF LIGHT WENT OFF FOR HIM AND SO DID THE CHECK ENGINE, HE DROVE IT AROUND WITH NO PROBLEM. NOW THIS MORNING I STARTED IT TO WARM IT UP, NO LIGHTS CAME ON. I GOT IN TO LEAVE AND WHEN I REACHED THE END OF MY ROAD AT THE STOP SIGN, BOTH LIGHTS CAME ON AGAIN. I TURNED THE CAR OFF, THEN ON AND THE ESC OFF WENT OFF, BUT THE CHECK ENGINE IS STILL ON.  THIS PROBLEM WILL STILL HAPPEN EVERY NOW AND THEN.  THIS PROBLEM HAS HAPPEND MORE THAN A DOZEN TIMES AND IT DOSN'T MATTER WHAT SPEED I'M DRIVING IT WILL HAPPEN WHEN DRIVING SLOW OR FAST.  LOSS OF POWER IS DANGEROUS WHEN THERE IS NOWHERE TO PULL OVER.  I HAVE BEEN ON SEVERAL WEBSITED WHERE OTHERS HAVE HAD THE SAME PROBLEM.  I HAVE ALSO BEEN TOLD THAT I NEED TO HAVE THE ACCELERATOR SENSOR REPLACED, NOT THE ESC SENSOR.  IN JULY 2010 THE ESC SENSOR WAS REPLACED AND THE PROBLEM OCCURED AGAIN THE FOLLOWING JAN. 2011.  *TT",
        "vin": "KNDJC735785"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "06/06/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405316,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO ESC LIGHT AND CHECK ENGINE LIGHT CAME ON AND VEHICLE LOST POWER.  *TR",
        "vin": "KNDJC735585"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2011",
        "dateOfIncident": "12/30/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401252,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "01/25/10 WITH 22,395 MILES ON VEHICLE. THE CAR HAD NO ACCELERATION. HAD PART #35107-3C100FF TH SENSOR ASSY REPLACED. 11/12/10 WITH 30,002 MILES ON VEHICLE.  THE CAR HAD NO ACCELERATION AGAIN. HAD PART #91214-3E324 WIRING ASSY-ENG REPLACED. 12/30/10 WITH 32,064 MILES ON VEHICLE. THE CAR HAD NO ACCELERATION AGAIN. HAD PART #32700-3E400 PEDAL ASSY-ACCE REPLACED. MY CONCERN IS LOSING POWER ON A FREEWAY AND GETTING INTO A ACCIDENT. ALSO HAVE PROBLEMS WITH THE PASSENGER AIR BAG BEING ON AT RANDOM TIMES. MY CONCERN IS HAVING A ACCIDENT AND THE PASSENGER AIR BAG NOT WORKING.  *TR",
        "vin": "KNDJC735285"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "05/11/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400554,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SORENTO'S THROTTLE ACCELERATOR SENSOR HAS GONE OUT FOR THE SECOND TIME IN A YEAR.  I LOOKED THIS ISSUE UP ONLINE, SINCE THIS IS THE SECOND TIME, AND FOUND EXTENSIVE COMPLAINTS ABOUT THE SAME PROBLEM.  WHEN IT GOES OUT THE ELECTRONIC STABILITY CONTROL SYSTEM QUITS FUNCTIONING ALSO.  MY CAR HAS LESS THAN 20,000 MILES ON IT.  IT HAS A LOSS OF POWER AND STABILITY CONTROL WHEN THIS HAPPENS.  THE DEALERSHIP KNEW EXACTLY WHAT HAD HAPPENED AND ASK ME TO BRING IT IN.  THIS SHOULD NOT HAPPEN REPEATEDLY.  *TR",
        "vin": "KNDJD735685"
    },
    {
        "components": "EXTERIOR LIGHTING,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "06/06/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386291,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ESC OFF LIGHT COMES ON, SUDDEN LOSS OF ACCELERATION, HEAD LIGHTS CONSTANTLY NEEDING TO BE CHANGED. MIDDLE SEAT BELT IN BACK MALFUNCTIONS BY NOT UNLOCKING AT TIMES.  *TR",
        "vin": "KNDJD735385"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "07/06/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383069,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG LIGHT ILLUMINATED EVEN WHEN SOMEONE WAS SEATED IN THE PASSENGER SEAT. THE DEALER REPLACED THE SEAT CUSHION THREE TIMES BUT THE FAILURE CONTINUED. THE DEALER SCANNED THE SENSOR BUT THE FAILURE CONTINUED. THE CONTACT ALSO STATED THAT THE TIRE PRESSURE MONITORING SYSTEM LIGHT ALSO ILLUMINATED. THE DEALER CLEARED THE MEMORY AND THE LIGHT TURNED OFF FOR TWO MONTHS BUT ILLUMINATED AGAIN. THE FAILURE MILEAGE WAS 15,000 AND THE CURRENT MILEAGE WAS 45,000.    UPDATED 5/2/11 *CN   THE CONSUMER STATED HE HAS BEEN TO THE DEALER NUMEROUS TIMES, BUT THE AIR BAG LIGHT CONTINUES TO ILLUMINATE.  UPDATED 05/11/11",
        "vin": "KNDJC735785"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2011",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380998,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION - VEHICLE TURNS ON, WHEN PLACED IN REVERSE A LOUD/HARD JOLT OCCURS.  WHEN PLACED IN DRIVE, VEHICLE WILL HARDLY MOVE WITHOUT PRESSING ALL THE WAY DOWN ON THE GAS PEDAL.  ENGINE ROARS AND HARDLY MOVES FORWARD.  HAPPENED ON TWO OCCASIONS IN THE LAST FEW MONTHS.  WAS RECENTLY FIXED  TWO MONTHS AGO BUT HAPPENED AGAIN. *LN",
        "vin": "KNDJC735285"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/25/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378753,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "LATITUDE TOUR",
                "productYear": "9999",
                "size": "235/70R16",
                "type": "Tire"
            }
        ],
        "summary": "MICHELIN TIRE ON VEHICLE COMPLETELY BLEW OUT THAT ALMOST CAUSED A CRASH. TIRE TORE COMPLETELY AROUND THE OUTER PART. VEHICLE WAS TRAVELING ABOUT 70 MPH ON INTERSTATE WHEN BLOWOUT OCCURRED. *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/25/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378828,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "LATITUDE TOUR",
                "productYear": "9999",
                "size": "235/70R16",
                "type": "Tire"
            }
        ],
        "summary": "MICHELIN TIRE ON VEHICLE COMPLETELY BLEW OUT THAT ALMOST CAUSED A CRASH, TIRE TORE COMPLETELY AROUND THE OUTER PART. VEHICLE WAS TRAVELING ABOUT 70 MPH ON INTERSTATE WHEN BLOWOUT OCCURRED. *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/28/2010",
        "dateOfIncident": "11/11/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368017,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH LIGHTING PROBLEM ON 2008B KIA SORENTO. WHEN CONTROL KNOB ON TURN SIGNAL SWITCH IS ROTATED FOR NIGHT LIGHTING OF DASH LIGHTS, THE DASH LIGHTS GO OUT, BLOWING A FUSE. POSSIBLE SHORT IS SYSTEM SOMEWHERE. UNABLE TO TRACE AT CANADIAN KIA DEALERSHIP WITHOUT PAYING $90.00/HR FEE WHICH COULD TAKE MANY HOURS. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2010",
        "dateOfIncident": "11/07/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10366985,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO AIRBAG DEPLOYMENT WHILE THE VEHICLE WAS PARKED.  38 Y W/F SITTING IN DRIVER'S SEAT, VEHICLE NOT RUNNING AND NO ONE WAS AROUND VEHICLE. AIRBAG DEPLOYED STRIKING FEMALE ON LEFT SIDE CAUSING INJURY TO ABDOMEN, ARM, SHOULDER AND FACE. ACCORDING TO KIA COMPUTER MALFUNCTION CAUSED PROBLEM. GLAD SHE WAS WAITING ON OTHER SON TO LEAVE CHURCH. KIA'S SOLUTION IS TO REPLACED AIRBAG SYSTEM. VEHICLE STILL UNDER WARRANTY. EVENTS FEMALE SAT IN DRIVER'S SEAT. CONSEQUENCES MODERATE INJURY, DISORIENTED UNABLE TO REMEMBER WHICH CHILD WAS IN THE BACK SEAT SHE WAS TALKING TO AT THE TIME. OFFICIAL MEDICAL VISIT AT URGENT CARE THE NEXT MORNING. X-RAYS AND CAT SCAN. SEVERE CONSEQUENCES COULD HAVE BEEN DEATH IF IT HAPPENED 5-10 MINUTES LATER GOING DOWN ROAD. WHAT HAS BEEN DONE? I HAVE BEEN INFORMED KIA DOES NOT DEAL WITH HYPOTHETICAL SITUATIONS. FAMILY COULD HAVE BEEN JUST ANOTHER NUMBER. *TR",
        "vin": "KNDJD735685"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2010",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORRENTO. THE VEHICLE EXHIBITED  ABNORMAL HESITATION WHEN ACCELERATING FROM A COMPLETE STOP AND WOULD ONLY ACCELERATE AT A VERY LOW SPEED. AFTER SHUTTING THE VEHICLE OFF AND ALLOWING IT TO SIT FOR A FEW HOURS, THE VEHICLE WOULD OPERATE AS NORMAL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE UPGRADES WERE MADE TO THE COMPUTER SYSTEM. THE FAILURE SINCE RECURRED APPROXIMATELY 3 TIMES. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER FOR FURTHER REPAIRS OR DIAGNOSIS. THE FAILURE MILEAGE WAS 20,000 AND THE CURRENT MILEAGE WAS 25,000.",
        "vin": "KNDJC736585"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346765,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORRENTO. WHILE THE CONTACT WAS  DRIVING APPROXIMATELY 55 MPH, THE CHECK ENGINE WARNING LIGHT  ILLUMINATED, FOLLOWED BY A COMPLETE LOSS OF ENGINE POWER. THE  VEHICLE WAS COASTED TO THE SIDE OF THE ROAD. THE ENGINE RESTARTED  AND THE VEHICLE RESUMED OPERATION. THE VEHICLE WAS IN THE PROCESS  OF BEING DIAGNOSED BY AN AUTHORIZED DEALER AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "KNDJC736485"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/25/2010",
        "dateOfIncident": "06/21/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339977,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORRENTO. SHE STATED WHILE DRIVING AT 70 MPH, THE CHECK ENGINE AND ESC WARNING LIGHTS ILLUMINATED. THE VEHICLE THEN INDEPENDENTLY DECELERATED TO SPEEDS OF 5 MPH. THE VEHICLE WAS TOWED TO THE DEALER WHO ADVISED THAT THE THROTTLE PEDAL WAS DAMAGED. THE THROTTLE PEDAL WAS REPLACED. THE FAILURE RECURRED WITHIN ONE MONTH. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE CONTACT WAS AWAITING REPAIRS. THE MANUFACTURER WAS CONTACTED AND SHE WAS ADVISED THAT THE PARTS WERE ON BACK ORDER DUE TO THE DEMAND FOR THE PARTICULAR PART. THE FAILURE AND CURRENT MILEAGE WAS 33,000.",
        "vin": "KNDJD736X85"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/04/2010",
        "dateOfIncident": "12/03/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334568,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE CONTACT STATED THE PASSENGER'S FRONTAL AIR BAG WARNING LIGHT INDICATING THE AIR BAG WAS INOPERABLE, CONTINUOUSLY ILLUMINATES ON THE DASHBOARD . THE DEALER AND MANUFACTURER WERE BOTH CONTACTED AND ADVISED THEY WERE AWARE OF THE FAILURE BUT WOULD NOT PROVIDE A REMEDY FOR THE FAILURE. THE CONTACT WAS CONCERNED THAT IN THE EVENT OF A CRASH, THE PASSENGER'S FRONTAL AIR BAG WOULD NOT DEPLOY. THE FAILURE AND CURRENT MILEAGES WERE 10,000.  THE CONSUMER STATED THE AIR BAG OFF LIGHT WOULD STAY ON WHEN THE PASSENGER SEAT WAS OCCUPIED. UPDATED EVOQ 12/03/10.*JB",
        "vin": "KNDJC736085"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "12/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316847,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": "P195/55R15",
                "type": "Tire"
            }
        ],
        "summary": "ON A TRIP FROM BILOXI, MS TO FORT MYERS, FL- APPROXIMATELY 800 MILES ALL 4 TIRES ON A \"NEW\" (13,000 MILES) KIA SORENTO FAILED.  AFTER SEVERAL HUNDRED MILES OF THE TRIP THE CAR BEGAN TO SHAKE VIOLENTLY AND LUCKILY WAS KEPT UNDER CONTROL.  A TOWTRUCK HAD TO BE CALLED AND THE CAR TOWED TO TWO CITIES BEFORE A DEALERSHIP COULD BE FOUND TO \"FIX\" THE CAR.  THIS MEANT AN OVERNIGHT STAY.  THE SERVICE DEPT PROBABLY DIDN'T UNDERSTAND WHAT HAPPENED!  THEY PUT 2 NEW TIRES ON, INSPECTED OTHERS AND ALIGNED  THE CAR- COSTLY SERVICE CALL + 2 NEW TIRES.  BACK TO THE TRIP AND SEVERAL MORE HUNDRED MILES AND AGAIN VIOLENT SHAKING.  ANOTHER TIRE WAS FALLING APART!    SAME THING ANOTHER TOW, OVER NIGHT STAY, DEALER, ANOTHER TIRE.  BOTH DEALERS SAID THEY WOULD SEND TIRES BACK TO KUMHO FOR EXAMINATION.  WE COULD NOT BELIEVE, BUT OUTSIDE TAMPA AT 10:30 AT NIGHT-VIOLENT SHAKING.  CHANGED THE TIRE ON THE SIDE OF THE ROAD IN THE DARK.  THANK GOD, NO ONE HURT.  HAD TO ORDER A NEW TIRE FROM SEARS IN FORT MYERS FOR THIS ONE.  I NOW HAVE MIS-MATCHED TIRES ON MY NEW VEHICLE- HAD TO BUY NEW TIRES 30,000 MILES BEFORE I SHOULD OF HAD TO- HAD A FAMILY MEMBERS LIFE IN DANGER, HAVE TO WORRY ABOUT DAMAGE DONE FROM ALL THE VIOLENT SHAKING, WAS SERVICE WORK DONE CORRECTLY,  DO I STILL NEED AN ALIGNMENT-- IT TOOK OVER 48 GRUELING, NERVE-RACKING HOURS FOR AN 11 HOUR TRIP- WITH A LOT OF EXTRA EXPENSES.   KUMHO DOES NOT WANT TO MAKE US \"WHOLE\" ON THIS FIASCO (WE ARE HAPPY THOUGH THAT IT IS NOT A TRAGEDY). BY \"WHOLE\" WE MEAN REIMBURSE US FOR WHAT WAS SPENT ON THIS \"MESS\".  THEY DON'T SEEM CONCERNED THIS IS A SAFETY ISSUE.  WE HOPE THIS DOES NOT HAPPEN TO SOMEONE ELSE WITH WORSE RESULTS.  YOU WILL NOT BELIEVE WHAT THE TIRE WE HAVE KEPT LOOKS LIKE.  THE AIR PRESSURE SENSORS NEVER SHOWED LOSS OF AIR AND THE LAST TIRE WHEN BROUGHT TO SEARS STILL HAD AIR IN IT.  TREAD IS COMING OFF OF THE TIRE AND THE STEEL BELTS ARE FRAYED.  PLEASE CONTACT US SO WE CAN SEND YOU PICTURES OF THE TIRE.  THANK YOU FOR YOUR QUICK RESPONSE. *TR",
        "vin": "KNDJD735485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "12/28/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316023,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2008 KIA SORENTO. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG WARNING LIGHT OCCASIONALLY FAILED TO INDICATE THAT A PASSENGER WAS SEATED IN THE FRONT SEAT. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE MANUFACTURER WOULD NOT REPLACE THE COMPUTER BECAUSE IT WAS A SMARTS SYSTEM. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 62,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2010",
        "dateOfIncident": "03/19/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302911,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT DISPLAY ON DASH \"PASSENGER AIR BAG OFF'\" WHILE PASSENGER IS SEATED AND BELTED INTO PASSENGER SEAT. SEVERAL DOCUMENTED SERVICE APPOINTMENTS WITH DEALER HAVE FAILED TO ELIMINATE PROBLEM.  *TW",
        "vin": "KNDJD736785"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/27/2009",
        "dateOfIncident": "01/21/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293733,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2008 KIA SORENTO FROM KIA OF BRADLEY, ILLINOIS, LAST NOVEMBER.  THE FRONT PASSENGER AIR BAG LIGHT SIGNALS THAT THE AIR BAG IS OFF, EVEN THOUGH SOMEBODY IS SITTING IN THE SEAT.  AS I UNDERSTAND IT, THEN, THAT IF YOU WERE IN A FRONT END ACCIDENT AND THE LIGHT IS STATING THE AIR BAG IS OFF, IT WILL NOT DEPLOY.  WE HAVE COMPLAINED NUMEROUS TIMES TO KIA OF BRADLEY, TALKED WITH THE REGIONAL MANGER, AND HIS BOSS AND THEIR STAND IS THAT MY WIFE IS SITTING WRONG IN THE SEAT.  I DON'T BUY THIS.  THERE WAS A RECALL, WE TOOK IT IN TO BE FIXED, THAT DID NOT HELP.  ALSO, THE FRONT PASSENGER SEAT WAS REPLACED AND THAT DID NOT HELP EITHER.  THEY DID ALL THIS WORK BUT CONTINUE TO MAINTAIN THAT MY WIFE IS SITTING IN THE SEAT INCORRECTLY. *TR",
        "vin": "KNDJD736685"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "10/30/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290749,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG LIGHT COMES ON WITH A PASSENGER IN THE SEAT AND SAYS THAT AIR BAG IS TURNED OFF. WIFE WEIGHTS 160 AND IS A FULL SIZE ADULT. KIA SAYS SHE IS NOT SITTING IN THE SEAT RIGHT, I HAVE HAD IT IN TO THE DEAL TWICE NOW FOR THIS SAME PROBLEM. THEY KNOW THEY HAVE A PROBLEM AND ARE AVOIDING IT. IT IA A KIA SORENTO. *TR",
        "vin": "KNDJC735685"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "08/30/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287452,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"PASSENGER AIRBAG OFF\" LIGHT REMAINS ON WHEN ADULT PASSENGERS OVER 108 LB SIT IN SEAT. NO AIRBAG FAILURE LIGHT INDICATED. HAD DEALER REP INSPECT AND DO CALIBRATION TO OCS IN LATE AUG. HOWEVER, THE FAULT STILL HAPPENS ABOUT 1OUT OF 10 TIMES. *TR",
        "vin": "KNDJD735085"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2009",
        "dateOfIncident": "12/28/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286757,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE OCS MISCLASSIFIES THE PRESENCE OF CERTAIN ADULT PASSENGERS BASED ON A COMBINATION OF THEIR WEIGHT, STATURE, BODY SHAPE AND POSITION ON THE SEAT CUSHION. AS CONSEQUENCE THE AIR BAGS MAY FAIL TO DEPLOY IN A SITUATION THAT WARRANTS. THE VEHICLE WAS TAKEN  TO THE DEALERSHIP THREE TIMES FOR THE FAILURE. THE VEHICLE WAS REPAIRED ONCE ACCORDING TO SERVICE BULLETIN #10030366 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE). THE REPAIR DID NOT REMEDY THE FAILURE. THE CURRENT MILEAGE WAS 7,321. THE FAILURE MILEAGE WAS APPROXIMATELY 30.",
        "vin": "KNDJD735485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2009",
        "dateOfIncident": "08/09/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286316,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SORENTO. THE PASSENGER FRONT AIR BAG MISCLASSIFIED A SMALL ADULT AS A CHILD. AS A CONSEQUENCE IN A SITUATION THAT WARRANTS, THE AIR BAGS MAY FAIL TO DEPLOY.  THE DEALER WAS CONTACTED AND A TECHNICIAN COULD NOT IDENTIFY THE CAUSE OF THE FAILURE. HOWEVER HE SPECULATED THAT THE SEATS WOULD HAVE TO BE POSITIONED FAR AWAY FROM THE AIR BAG IN ORDER TO BE OPERATIVE.  THE FAILURE MILEAGE WAS 3,000. THE CURRENT MILEAGE WAS 6,900.",
        "vin": "KNDJC736685"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285979,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO. THE PASSENGER FRONT AIR BAG SENSOR MISCLASSIFIED A SMALL STATURE ADULT AS A CHILD. THE CONTACT IS AWARE OF THE SAFETY RISK IN THE EVENT OF A CRASH, THE AIR BAG MAY FAIL TO DEPLOY. THE VEHICLE WAS TAKEN TO THE DEALER, AND A TECHNICIAN CONCLUDED THAT SINCE THE PASSENGER WEIGHED ONLY 130 LBS, SHE WAS NOT LARGE ENOUGH FOR THE SENSOR TO DETECT HER WEIGHT. THE FAILURE MILEAGE WAS 380 AND THE CURRENT MILEAGE WAS 3,200.",
        "vin": "KNDJD735X85"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "07/25/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281328,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KIA SORENTO.  THE LOW HEADLIGHTS MAKE A CIRCLE IN FRONT OF MY CAR.  THE HEADLIGHTS ILLUMINATE THE STREET AND I CAN SEE THE CIRCUMFERENCE.  BEYOND THE LIGHT, IT IS PURE DARKNESS.  IS THERE A RECALL ON THE HEADLIGHT RANGE?  *TR",
        "vin": "KNDJD736685"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/04/2009",
        "dateOfIncident": "07/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279287,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SERENTO TPMS LIGHT COMES AND OFF   CAME ON THE SECOND DAY I OWNED THE CAR COMES ON FOR A DAY THEN OFF FOR A DAY GIVE OR TAKE A COUPLE OF DAYS   TOOK IT TO DEALER WAS CLEAR THEN COULDN'T FIND NOTHING CAME BACK ON JUST BEFORE ARRIVING AT HOME THE SAME DAY TOOK IT BACK AFTER A COUPLE OF DAYS THEY SAID IT WAS THE SENSOR IN THE LEFT REAR TIRE HAD TO ORDER PART AFTER ABOUT TWO WEEKS TOOK IT BACK TO HAVE SENSOR REPLACED WAS NOT CHANGED THEY SAID THEY WOULD CONTACT THE MANUFACTURER AFTER RE-TESTING IT FOR  THE PROBLEM IM STILL WAITING THATS NOW BEEN 1 MONTH. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269671,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIR BAG LIGHT WILL NOT GO OFF. I HAVE TAKEN IT INTO THE DEALERSHIP 2 TIMES AND THEY SAID THEY HAVE FIXED THE SENSOR. IT STILL IS NOT FIXED. I HAVE SEEN ON A FEW FORUMS (IE. EDMUNDS.COM) THAT IT HAS BEEN AN ISSUE AND IT IS NOT GETTING RESOLVED. I AM CONCERNED FOR MY PASSENGERS SAFETY. *TR",
        "vin": "KNDJC735585"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2009",
        "dateOfIncident": "05/07/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269468,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  WHENEVER AN OCCUPANT IS SEATED IN THE PASSENGER SEAT, THE AIR BAG LIGHT ILLUMINATES, WHICH INDICATES THAT IT IS NOT ENGAGED NOR WORKING PROPERLY.  THE FAILURE WAS NOTICED WHILE DRIVING AT ANY SPEED.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER ON TWO OCCASIONS.  THE FIRST TIME, THE MECHANIC STATED THAT OTHER CONSUMERS WERE EXPERIENCING THE SAME FAILURE.  THE CONTACT WAS INFORMED THAT MOVEMENT IN THE SEAT WILL USUALLY ENGAGE THE AIR BAGS.  THE DEALER DID NOT OFFER A REMEDY AT THAT TIME.  A WEEK LATER, THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THEY STATED THAT IT WAS UNSAFE TO SIT IN THE VEHICLE.  THE AIR BAG LIGHT WILL  DIM ONCE THE VEHICLE HAS BEEN RESTARTED A FEW TIMES.  THE SERVICE MANAGER CALLED AND STATED THAT A RECALL WAS ISSUED FOR THIS FAILURE.  THE NHTSA CAMPAIGN ID NUMBER WAS UNABLE TO BE LOCATED.  THE CURRENT AND FAILURE MILEAGES WERE 150.  UPDATED 06/10/09. *JB",
        "vin": "KNDJD735285"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267891,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2008 KIA SORENTO 11/11/2008. IN MARCH 2009, I STARTED TO NOTICE A COMPRESSION TYPE NOISE AND IT OCCURS EVERY 3-5 SECONDS. THE KIA DEALERSHIP HAS HAD THIS VEHICLE SEVERAL TIMES, BUT CAN'T FIGURE OUT THE ISSUE. THIS IS AN ONGOING AND STILL CURRENT ISSUE. IT'S VERY INCONVENIENT TO TAKE MY VEHICLE TO THE DEALERSHIP EVERY OTHER WEEK JUST TO HEAR THAT THEY CAN'T FIGURE OUT THE ISSUE. THE KIA DEALERSHIP CAN NOT TELL ME IF IT A SAFETY ISSUE. IF THE DEALERSHIP SERVICE TECH'S CAN'T FIGURE OUT THE PROBLEM, THEN HOW DO I KNOW IF MY FAMILY IS SAFE IN THIS VEHICLE? *TR",
        "vin": "KNDJD735185"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "01/30/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261142,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG LIGHT WILL NOT TURN OFF WHEN PASSENGER SITS IN SEAT. MEANING THE AIRBAGS WILL NOT DEPLOY IF AN ACCIDENT OCCURS. THIS HAS BEEN HAPPENING INTERMITTENTLY SINCE DECEMBER 2008, THE FIRST DOCUMENTED TIME WAS JANUARY 2009, AND HAS BEEN DOCUMENTED FIVE TIMES. THE ONLY ATTEMPT TO REPAIR WAS TO UPDATE THE COMPUTER CHIP, WHICH DID NOT WORK. WE HAVE BEEN TOLD BY THE DEALER THAT THEY WILL NOT REPAIR THIS PROBLEM, WHICH TO ME IS A MAJOR SAFETY ISSUE. *TR",
        "vin": "KNDJD735885"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/07/2009",
        "dateOfIncident": "12/27/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261003,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE FIRST DAY I PURCHASED MY VEHICLE, I'VE NOTICED A PROBLEM WITH THE HEADLIGHTS VISIBILITY. WHEN DRIVING, THE HEADLAMPS ARE NOT AIMED OR FOCUSED TO SEE MORE THAN TWO CAR LENGTHS IN FRONT OF THE VEHICLE.  I WENT BACK TO KIA AND HAD THEM CHECK IT OUT.  THEY SAID THE  LIGHTS WERE ADJUSTED AS FAR UP AS THE STATE ALLOWS. I CONTACTED KIA CUSTOMER SERVICE AND THEY CLAIM THEY HAVEN'T HAD ANY COMPLAINTS. THE VISIBILITY WITH THE HEADLIGHTS IS TERRIBLE.  THE HEADLIGHTS ARE NOT ADJUSTED HIGH ENOUGH TO SEE WHEN NIGHT DRIVING.  YOU CAN ONLY SEE TWO CAR LENGTHS IN FRONT OF YOU AND IF DEPENDING ON THE TERRAIN OF THE ROAD OR IF THERE IS NO OTHER AREA LIGHTING, I.E. STREET LIGHTS, STORE LIGHTS OR OTHER COMMERCIAL LIGHTING, THE AREA BEYOND TWO CAR LENGTHS IS COMPLETELY BLACK..  THE VISIBILITY IS HORRIBLE AND UNSAFE. IT'S AT THE POINT, THAT WE'RE AFRAID TO DRIVE THE CAR AT NIGHT. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "11/30/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257211,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  THE CONTACT STARTED THE IGNITION AND SUDDENLY THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF.  THE FAILURE OCCURRED WHENEVER AN OCCUPANT WAS SEATED IN THE FRONT PASSENGER SEAT.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING AND THEY STATED THAT THE FAILURE WAS RELATED TO THE AIR BAG SENSOR.  THE AIR BAG SENSOR AND PAD WERE REPLACED AND THE VEHICLE WAS TAKEN TO THE AUTHORIZED DEALER ON THREE SEPARATE OCCASIONS FOR IDENTICAL FAILURES; HOWEVER, THERE WERE NO RESOLUTIONS.  THE MANUFACTURER IS AWARE OF THE FAILURE AND AN ENGINEER CONDUCTED AN INSPECTION ON THE VEHICLE.  THE AIR BAG SENSOR WAS REPROGRAMMED; HOWEVER, THE FAILURE CONTINUED.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 200 AND CURRENT MILEAGE WAS 4,400.",
        "vin": "KNDJD735885"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "11/27/2008",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251440,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 22 YR SON. WAS DRIVING A KIA SORENTO, AT HIGHWAY SPEED ON 11/27/08 ON I-10 W IN HOUSTON, TX, JUST EAST OF LOOP 610.  THE VEHICLE WAS A RENTAL FROM ENTERPRISE RENTAL CAR AND HAD CA. 4000 MILES ON THE ODOMETER.  MY SON REPORTS HEARING A LOUD BOOM FROM THE ENGINE COMPARTMENT AND IMMEDIATELY NOTICED SMOKE COMING FROM THE DASHBOARD VENTS.  HE IMMEDIATELY PULLED THE VEHICLE OVER TO THE MEDIAN SHOULDER AND EXITED THE VEHICLE, NOTICING DARK SMOKE COMING FROM THE HOOD, THEN FLAMES.  HE PROMPTLY CALLED 911.  THE OPERATOR SAID SHE HAD HIS VEHICLE FIRE ON THE OVERHEAD HIGHWAY CAMERA.  MY SON IS A CULINARY STUDENT AND RAPIDLY RETRIEVED HIS VALUABLE KNIFE ROLL FROM THE REAR SEAT FLOORBOARD, BUT WAS UNABLE TO GET ANYTHING ELSE FROM THE VEHICLE BECAUSE OF THE HEAT AND SMOKE.  HE SAYS THE FD ARRIVED WITHIN 5 MINS AND DOUSED THE ENGINE FIRE.  THERE WAS EXTENSIVE FIRE DAMAGE TO THE FRONT PASSENGER COMPARTMENT AND LESS SO TO THE REAR PASSENGER COMPARTMENT.  MY SON IS SMART, QUICK AND AGILE.  THUS, HE SUFFERED NO PHYSICAL INJURY,  BUT WAS QUITE DISTRAUGHT.  HE WILL DO WELL.  I AM AN EMERGENCY PHYSICIAN WITH 20 YRS OF EXPERIENCE.  I HAVE VERY SERIOUS CONCERNS REGARDING THIS APPARENT CATASTROPHIC FAILURE THAT RAPIDLY RESULTED IN AN ENGINE AND VEHICLE FIRE.  IT IS APPARENT THAT A DEFINITELY ADVERSE OUTCOME, INCLUDING SERIOUS INJURY AND/OR DEATH COULD RESULT IF THE OCCUPANTS WERE ELDERLY OR A FAMILY WITH CHILDREN IN PROPER RESTRAINTS, BOOSTER OR INFANT SEATS.  ADDITIONALLY, MY SON REACTED RAPIDLY AND IMMEDIATELY PULLED OVER.  ANOTHER TRAGIC SCENARIO COULD OCCUR IF THERE WERE A NARROW OR NO SHOULDER.  THANK YOU FOR YOUR REVIEW AND ACTION. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "09/18/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248575,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2008 KIA SORENTO. ON THE EVENING I BOUGHT THE CAR, I WAS SITTING IN THE PASSENGER SIDE AND THE AIRBAG LIGHT CAME ON STATING THAT THE AIRBAG WAS OFF. I HAVE TAKEN IT TO THE DEALERSHIP AND THEY SAID THERE IS A NATIONWIDE BACKORDER FOR THE PART AND NOT TO ALLOW ANYONE TO SIT IN THE FRONT SEAT. THIS WAS A MONTH AGO THEY STILL CANNOT GET THE PART. I WILL BE TAKING IT TO THE DEALERSHIP THIS FRIDAY TO SEE IF THEY CAN RESET THE COMPUTER. THEY SAID THEY HAVE HAD ALOT OF COMPLAINTS ON THIS PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/23/2008",
        "dateOfIncident": "04/05/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243170,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  WHILE DRIVING AT ANY SPEED, THE BRAKES SQUEAK WHEN THE PEDAL IS DEPRESSED.  THE SQUEAKING SOUND IS GRADUALLY BECOMING LOUDER.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER FOR THIS ISSUE FOUR OR FIVE TIMES, BUT THEY CANNOT FIND ANY FAILURES.  WHILE IDLING AT A TRAFFIC LIGHT, THE VEHICLE DOES NOT MOVE WHEN THE ACCELERATOR PEDAL IS DEPRESSED.  THE TIRES JUST SPIN AND THEN THE VEHICLE FINALLY MOVES.  THE CONTACT IS AFRAID THAT THE VEHICLE WILL BE REAR ENDED.  THE FAILURE MILEAGE WAS 1,620.   UPDATED 10/20/08.  *LJ",
        "vin": "KNDJC735385"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2008",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236722,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED A BRAND NEW 2008 KIA SORENTO. THE PASSENGER SIDE AIR BAG ONLY ACTIVATES 50% OF THE TIME WHEN A PASSENGER IS IN THE SEAT. TOOK VEHICLE TO DEALER AND DEALER COULD NOT REPLICATE THE PROBLEM. RETURNED VEHICLE TO DEALER A 2ND TIME WITH A PASSENGER SEATED IN THE SEAT AND THE AIR BAG WAS NOT ACTIVATED. THE SERVICE MANAGER ACTUALLY WITNESSED A 150LB PASSENGER PROPERLY SEATED IN THE SEAT AND THE AIR BAG WAS NOT ACTIVATED. THEY KEPT THE VEHICLE 5 ADDITIONAL DAYS. THEY RAN DIAGNOSTICS AND CONTACTED KIA. KIA WOULD NOT AUTHORIZE A REPAIR SINCE ALL THE DIAGNOSTICS PASSED EVEN THOUGH THE SERVICE MANAGER PERSONALLY WITNESSED IT NOT WORKING. THE DEALER STATES THAT KIA REFUSES TO ACKNOWLEDGE A KNOWN PROBLEM WITH THE PASSENGER SEAT AIR BAG SENSOR.  *TR",
        "vin": "KNDJD735885"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234813,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  WHILE DRIVING AT ANY SPEED, THE PASSENGER SIDE AIR BAG LIGHT WOULD REMAIN ILLUMINATED REGARDLESS IF A PASSENGER WAS SEATING IN THE SEAT.  THE VEHICLE HAS BEEN DIAGNOSED BY THE DEALER ON THREE DIFFERENT OCCASIONS, BUT THE FAILURE STILL OCCURS.  THE CURRENT MILEAGE WAS 871 AND FAILURE MILEAGE WAS 200.",
        "vin": "KNDJD735485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2008",
        "dateOfIncident": "04/16/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228643,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  THE CONTACT NOTICED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT CONTROL PANEL, WHICH INDICATED THAT THE PASSENGER SIDE AIR BAG WAS INOPERATIVE.  A REPRESENTATIVE FROM THE DEALER STATED THAT THEY COULD NOT REMEDY THE FAILURE BECAUSE THE PARTS WERE UNAVAILABLE FOR THE SOFTWARE.  THEY WOULD ALSO HAVE TO WAIT FOR A SUBJECT MATTER EXPERT TO REPAIR THE VEHICLE.  THE CONTACT CALLED THE MANUFACTURER AND THEY STATED THAT THEY WERE WAITING FOR A RESPONSE.  THE FAILURE AND CURRENT MILEAGES WERE 15,557.    UPDATED 06/25/08 *BF  THE CONSUMER STATED THE PASSENGER SIDE AIR BAG SENSOR WAS REPAIRED. UPDATED 06/25/08. *JB",
        "vin": "KNDJD735X85"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2008",
        "dateOfIncident": "01/04/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  WHILE DRIVING 35 MPH, THE CONTACT EXPERIENCED AUTOMATIC TRANSMISSION FAILURE AND TOOK THE VEHICLE TO THE DEALER.  THE DEALER OFFERED NO ASSISTANCE, SO THE CONTACT TOOK THE VEHICLE TO ANOTHER DEALER ON JANUARY 21, 2008.  TWO MECHANICS TEST DROVE THE VEHICLE AND ACKNOWLEDGED THE FAILURE; HOWEVER, THEY NEEDED TO ORDER THE CODES TO MAKE THE REPAIR.  AS OF FEBRUARY 22, 2008, THE DEALER HAS YET TO CALL THE CONTACT TO SCHEDULE THE REPAIR WORK.  THE DEALER INFORMED HER THAT THE VEHICLE HAD TO GET USED TO THE WAY SHE DROVE AND THAT THERE WAS NO FAILURE.  THE CONTACT ALSO STATED THAT THERE WAS AN ISSUE WITH THE PASSENGER SIDE AIR BAG.  THE DEALER INFORMED HER THAT SHE HAD TO SIT IN THE VEHICLE A CERTAIN WAY.  THE CONTACT STATED THAT NO MATTER HOW SHE SITS, THE LIGHT REMAINS ILLUMINATED.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 4,020 AND FAILURE MILEAGE WAS 100.",
        "vin": "KNDJD735485"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2008",
        "dateOfIncident": "11/28/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218297,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SORENTO FAULTY PASSENGER AIRBAG. CONSUMER STATES THAT THE AIRBAG WORKS INTERMITTENTLY. CONSUMER STATES THAT IT DOES NOT WORK WHEN HIS FATHER IS IN THE VEHICLE.  *KB  THE WIRING CONNECTION WAS LOOSE AND THE SENSOR WAS RESET ON THE FIRST VISIT.  THE SECOND TIME, THE DEALER STATED THEY WOULD HAVE TO ORDER A CUSHION TO REPLACE THE PASSENGER SIDE SEAT BECAUSE THE SENSOR WAS IN THE CUSHION.  *JB",
        "vin": "KNDJC735X85"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2007",
        "dateOfIncident": "10/12/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208122,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SORENTO.  WHILE DRIVING 45 MPH, THE PASSENGER SIDE AIR BAG LIGHT REMAINED ILLUMINATED, WHICH INDICATED THAT THE AIR BAG WOULD NOT DEPLOY.  THE DEALER STATED THAT THE AIR BAG SENSOR FAILED.  AS OF NOVEMBER 7, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 600.  UPDATED 01/09/08.  *LJ  THE CONSUMER STATED THE INCIDENT HAS HAPPENED SEVERAL TIMES EVEN ON THE WAY HOME FROM CHURCH RECENTLY. UPDATED 12/12/07  *TR",
        "vin": "KNDJD735585"
    }
]