[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441382,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Land Rover LR2. The contact stated that the vehicle would not start with the key in the ignition. The vehicle was towed to the dealer and diagnosed with body control module failure. The body control module needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 89,000.",
        "vin": "salft24n18h"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416689,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF SIDE RAILS HAVE BROKEN AND THE PLASTIC PIECES ARE LODGED IN THE SUNROOF. IT WILL NOT OPERATE AND SEEMS DANGEROUS TO DRIVE.",
        "vin": "SALFR24N68H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/24/2020",
        "fire": true,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361884,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 LAND ROVER LR2. THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, THE CHECK ENGINE LIGHT ILLUMINATED AS THE VEHICLE BEGAN TO LOSE POWER. AS THE CONTACT PULLED THE VEHICLE OVER, BLACK SMOKE HAD COME THROUGH THE PASSENGER AIR VENTS. UPON INSPECTION OF THE VEHICLE, THE CONTACT SAW FLAMES COMING FROM THE ENGINE. A TRANSPORTATION SERVICE VEHICLE HAPPENED TO BE BEHIND AND WITNESSED THE FAILURE. THE SERVICE OFFICER ASSISTED HIM WITH THE FIRE AND THE FIRE DEPARTMENT WAS CALLED AND THE FIRE WAS EXTINGUISHED. THE CONTACT WAS UNCERTAIN IF A FIRE REPORT WAS FILED. NO INJURIES WERE REPORTED AS A RESULT OF THE FIRE. THE VEHICLE WAS DESTROYED AS A RESULT OF THE FIRE AND WAS INITIALLY TOWED TO AN INDEPENDENT MECHANIC. LATER ON, THE VEHICLE WAS TOWED TO LAND ROVER DENVER(6160 S BROADWAY, LITTLETON, CO 80121). THE CAUSE OF THE FIRE HAD YET TO BE DETERMINED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 208,000.",
        "vin": "SALFS24N18H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328558,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT THE SUNROOF CEASED IN THE OPENED POSITION. THE CONTACT STATED THAT ONE TRACK WAS FRACTURED. THE VEHICLE WAS TAKEN TO LAND ROVER BIRMINGHAM LOCATED AT 3000 TOM WILLIAMS WAY, BIRMINGHAM, AL 35210, WHERE IT WAS STATED THAT THE VEHICLE WAS NOT SUBJECTED TO A RECALL. THE CONTACT WAS INFORMED THAT A SPECIALIST WAS NEEDED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 146,000.",
        "vin": "SALFS24N28H"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309287,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HUMMING NOISE WHEN DRIVING DUE TO FAULTY DIFFERENTIAL. ONLY HAS 40,099 MILES....ALSO STARTS SOME DAYS AND OTHER DAYS MAY TAKE UP TO 3 TIMES BEFORE IT WILL START WITHOUT DYING. TOOK TO SEVERAL SHOPS THAT SAID THEY CAN'T FIGURE OUT PROBLEM AND THEY CALLED LANDROVER ONLY TO BE TOLD, THIS IS A COMMON PROBLEM AND NO ONE SOLUTION HAS BEEN FOUND TO FIX IT. THIS HAS BEEN GOING ON FOR 3 YEARS AND NO ONE CAN FIX.",
        "vin": "SALFS24N68H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281794,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMOBILE'S BATTERY DIES (I HAVE BOUGHT 2 NEW BATTERIES) OR RUNS OUT OF CHARGE WHEN IT GETS TOO COLD OR WHEN I DO NOT DRIVE IT FOR 3 DAYS OR MORE.  SOMETIMES, AS I AM  DRIVING IT ON A HIGHWAY, IT JUST CUTS OFF, AND I HAVE TO WAIT FOR AT LEAST 10 MINUTES AND START IT AGAIN. SOMETIMES IT STARTS, SOMETIMES IT DOESN'T.  THEN I HAVE TO WAIT LONGER.",
        "vin": "SALFR24N08H"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268722,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD IS SEPARATING FROM THE GLASS, AND GETTING SMALL CRACKS TOO AT THE EDGES, WHICH CAN BE DANGEROUS BREAKING DIRECTLY WHILE DRIVING ANYTIME. I DON'T EXACTLY WHEN IT HAS HAPPENED, BUT NOTICED IT NOW.",
        "vin": "SALFP24N98H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267199,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE FAILURE OF BEARINGS, RACES AND GEARS IN REAR DIFFERENTIAL.",
        "vin": "SALFS24N78H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223033,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR IN MARCH OF 2017 WITH 101,000 MILES ON IT.  IT NOW HAS 119,000.  AS OF 24 JUN 2019, THE REAR END BEGAN MAKING A NOISE WHILE TURNING.  I TOOK IT TO A LOCAL IMPORT REPAIR SHOP.  MY MECHANIC INFORMED ME THAT THE DIFFERENTIAL IS CURRENTLY BEING HELD TOGETHER WITH ZIP-TIES.  ZIP. TIES.  AS I HAVE NEVER HAD WORK DONE ON THE REAR END OF THE CAR, THAT MEANS THAT THE ZIP-TIES WERE PUT ON BEFORE I PURCHASED THE VEHICLE.  I HAVE NO IDEA WHEN BUT THE REAL QUESTION IS THIS: HOW LONG IS A DIFFERENTIAL SUPPOSED TO LAST? THE DIFFERENTIAL IS CURRENTLY LOCKED INTO ALL-WHEEL DRIVE ALL THE TIME.  THE DIFFERENTIAL ALONE WILL COST $4900.  THE FLUIDS WILL COST $40.  I AM NOT SURE ABOUT THE NUMBER OF HOURS OF LABOR BUT IT WON'T BE OVER A DAY.  SO LET'S SAY A DAY OF LABOR WOULD BE 8 HRS AT A RATE OF $120/HOUR.  4900+40+960 = 5900.  RIGHT NOW, MY VEHICLE IS ONLY WORTH 2,200.  I OWE NO LOAN BUT I AM UPSIDE-DOWN NONETHELESS.  THIS IS NOT WEAR AND TEAR.  THIS DIFFERENTIAL WAS POORLY DESIGNED.  THE POOR DESIGN WAS EXACERBATED WHEN THE DIFFERENTIAL WAS NOT DEALT WITH.  IF NOT REPLACED, THE LOCKED DIFFERENTIAL WILL DESTROY THE TRANSMISSION.  THEN WHAT WILL I DO?",
        "vin": "SALFP24N78H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156366,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"   WHEN MOVING AT LOW OR REGULAR SPEED AND TURNING, THERE IS A RUMBLING STUMPING SOUND COMING FROM THE REAR. I TOOK IT TO THE SHOP AND IT WAS DIAGNOSED THAT THE REAR DIFFERENTIAL WAS THE ISSUE. ON RESEARCHING THE LAND-ROVER FORUM, I FOUND THAT MY ISSUE WAS NOT PECULIAR TO ME ALONE BUT IT WAS A MAJOR ISSUE WITH OTHER 2008 LR2 OWNERS AND COSTLY TO CHANGE TOO. HOWEVER LAND-ROVER ISSUED A TECHNICAL SERVICE  BULLETIN LTB00342 (ISSUE 3) IN AUG 2011) ABOUT THIS. WHY NOT A RECALL FOR THE FAULTY REAR DIFFERENTIAL OR FREE REPLACEMENT OF THE",
        "vin": "SALFS24N78H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130698,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I STARTED NOTICING A HUMMING NOISE COMING FROM THE REAR END OF THE VEHICLE THAT SEEMS TO SLOWLY BE GETTING WORSE. THEN WE STARTED GETTING A TRANSMISSION FAULT ERROR MESSAGE ON THE DASH. STARTED DOING RESEARCH AND HAVE FOUND MANY OTHERS WITH THE SAME SYMPTOMS BEFORE THEIR REAR DIFFERENTIAL GOES OUT COMPLETELY. WE ARE DRIVING THE LR2 ACROSS COUNTRY A FEW TIMES THIS NEXT YEAR. IT'S PROBALY GOING TO GO OUT AT SOME POINT. IF THIS IS SUCH A WELL KNOWN ISSUE. I DON'T UNDERSTAND WHY A RECALL HASN'T BEEN ISSUED!",
        "vin": "SALFP24N78H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118668,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE 1000S OF OTHER OWNERS, MY LR2 NEEDS REAR DIFFERENTIAL REPLACED. WHY NHTSA HAS NOT REVIEWED THIS IS UNBELIEVABLE.  THE VOLVO'S BUILT WITH SAME DESIGN HAVE PROBLEMS WITH REAR DIFFERENTIAL FAILING AS WELL. THE COST OF THIS REPAIR $2400-3000.. HAS THE NHTSA EVEN LOOKED INTO THIS? THIS IS AN EXPENSIVE REPAIR AND I'M READING BLOGS WHERE MANY PEOPLE ARE ATTEMPTING TO DO THE REPAIRS THEMSELVES N GIVING EACH OTHER 'TRIAL N ERROR' TIPS. OTHERS ARE POSTING ASKING WHAT'S THE WORST THAT CAN HAPPEN IF THEY DON'T DO THE REPAIRS. WELL, THE TRANSMISSION CAN LOCK UP CAUSING AN ACCIDENT. SO WHAT WILL IT TAKE FOR A RECALL TO BE AT LEAST CONSIDERED?    THIS SEEMS TO BE VERY SIMILAR TO TOYOTA PRIUS RECALL SEVERAL YEARS AGO. AND IT TOOK HOW MANY DEATHS BEFORE A RECALL WAS ISSUED?? OR FORD PINTO CASE  SAD THING HERE IS... NHTSA SHOULD BE LISTENING TO THE CONSUMERS! YET SEEMS LIKE NOT MUCH HAS CHANGED OR MAYBE FORGOTTEN....",
        "vin": "SALFP24N58H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110254,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL",
        "vin": "SALFP24N28H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102485,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LOUD HUMMING NOISE COMING FROM THE DRIVER'S SIDE REAR WHEN GOING 25MPH+",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "02/22/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074404,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DIFFERENTIAL HAS FAILED AND NEEDS TO BE REPLACED. VERY COMMON PROBLEM WITH THIS YEAR AND MODEL AFFECTING THE TRANSMISSION AND SAFETY OF ANYONE IN OR AROUND THE VEHICLE.",
        "vin": "SALFS24N88H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073392,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A USED 2008 LAND ROVER LR2 AND I STARTED HEARING NOISES FROM REAR END WENT TO INDEPENDENT SPECIALIST FOR LAND ROVER   HE TOLD ME THAT THIS ISSUE IS A COMMON IN THIS CAR...BAD REAR DIFFERENTIAL...HAVE A SCHEDULED APPOINTMENT W HIM IN TUESDAY ALSO HE TOLD TO CONTAC THE LAND.ROVER OF AMERICA BUT THEY R NOT GOING TO DO ANYTHING BUT IT'S THEIR FAULT! PLEASE NHTSA CAN DO SOMETHING W IT? THANK YOU",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045233,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "3TIMES NOW FIRST BATTERY LIGHT GOES ON THEN  ALL LIGHTS ON PANELS STARTS LIGHTING UP FOR NO REASON ANDCAR STARTS SLOWING DOWN AND THEN DIES WHILE DRIVING.  IT HAPPENED ON A HIGHWAY AND ON BUSY RUSH HOUR. ALL SYSTEM SHUTS DOWN.  IF WINDOWS ARE OPEN THERE IS NO WAY TO SECURE. IN ONE INSTANCE THE KEY WAS IN THE IGNITION AND WAS NOT ABLE TO RETRIEVE IT THIS IS NOT BEING RECOGNIZED ADDRESSED BY LAND ROVER. CANNOT KEEP ON IGNORING THIS ISSUE.  UNFORTUNATELY NOT EVERYONE REPORTS TO THE MANUFACTURER,  SOMEONE HAS TO DO SOMETHING  THIS PROBLEMS ARE DRAINING THE WALLETS OF CONSUMERS BECAUSE EACH TIME CARS HAVE TO BE TAKEN TO THE DEALERSHIP TO UNLOCK SYSTEM RELOAD SOFTWARE ONLY TO START A DIAGNOSE. ENDING UP WITH THOUSANDS IN REPAIRS .  POLICE HAD TO STOP TO PUT FLARES LAST TIME THE CAR BROKE BECAUSE IT WAS DANGEROUS TO WAIT IN THE DARK FOR TOWING",
        "vin": "SALFS24N78H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020970,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING COLUMN HAS LOCKED ON ME THREE TIMES AFTER STOPPING MY CAR.  WHEN I WOULD REENTER, IT WOULD NOT START BUT MY STEERING COLUMN WOULD TURN.  THE DEALERSHIP, EACH TIME, SAID MY STEERING COLUMN WAS LOCKED BECAUSE I NEEDED A BODY CONTROL MODULE, THEN A NEW BATTERY, AND THE 3RD TIME I HAD A BAD STEERING COLUMN.  HOWEVER, IT WAS NEVER A RECALL.  I SAW SEVERAL COMPLAINTS OF THIS ONLINE, THOUGH NO ONE HAS BEEN KILLED AS A RESULT OF IT.  THE CATCH IS THAT IT HAS CAUSED ME AND OTHERS LOTS OF MONEY (OVER $1400.00) EACH TIME THIS PROBLEM OCCURS.  IT HAS NEVER STOPPED WHILE I AS DRIVING (ALWAYS STATIONARY), BUT IT DOES MAKE ME NERVOUS THAT IT MIGHT OR SIMPLY THAT I MAY GET STRANDED AGAIN WITH TOW AND REPAIR COSTS.",
        "vin": "SALFP24N48H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000782,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL FAILURE",
        "vin": "SALFT24N68H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000933,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAN STOPPED WORKING.",
        "vin": "SALFT24N58H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990890,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST TIME  AFTER CAR WAS PARKED IN COSTCO, LEFT WITH MY DAUGHTER AND ALL OUR GROCERIES AND AFTER A COUPLE IF BLOCKS, WITHOUT ANY SIGN THE CAR  SLOWLY DIED, WHILE DRIVNG. IT WAS 9 PM AND WAS THE MIDDLE OF BUSY ROAD. DANGEROUS. NOTHING ELECTRICAL WORKED, COULD N CLOSE WINDIWS, PUT NEUTRAL TO MOVE CAR FRIM INTERSECTIONWT   HAD IT TOWED TO CAR CENTER AND CHANGED BATTERY. AFTER A COUPLE IF WEEKS LAST THURSDAY  EVE, IN MY BUILDING GARAGE INSERTED KEY IN ENGINE, DID NOT TURN ON AT ALL. THE DRIVER DISPLAY SHOWED CHECK SYSTEM AS USUAL AND LIGHTS WERE ON, BUT VEHICLE WOULD NOT START. HAD IT TOWED AGAIN TO VEHICLE CENTER, THEY RECOMMENDED TO TOW IT AGAIN TO DEALER. I HAVE CHECKED ON LINE MANY COMPLAINTS WITH THE SAME ISSUE, NO RECALL ON THE VEHICLE, THERE IS A COMPUTER PROBLEM THAT CAN LEAVE FAMILIES STRANDED IN DANGEROUS SITUATIONS EITHER WITH BRAND NEW BOUGHT VEHICLE OR AFTER A COUPLE IF YEARS.  IT SEEMS THAT LAND ROVER IS NOT RECOGNIZING THE COMPUTER, SOFTWARE PROBLEM THEY HAVE.  AND THEY KEEP CHARGING THOUSANDS TO THE CONSUMERS FOR DEFAULT ISSUES IN THEIR ELECTRICAL, SOFTWARE SYSTEMS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/15/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865656,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A LAND ROVER LR2 2008, AND IT STARTED MAKING A HUMMING NOISE FROM THE BACK END STARTING AROUND 50,000 MILES. THE NOISE HAS PROGRESSIVELY GOTTEN LOUDER. AFTER CHANGING TIRES, DIFFERENTIAL FLUIDS, AND BRINGING IT TO A MECHANIC (INDEPENDENT), THE PROBLEM WAS DIAGNOSED AS A FAULTY DIFFERENTIAL SYSTEM. ONLINE RESEARCH CONFIRMS THIS PROBLEM AS COMMON AMONG THIS MAKE MODEL AND YEAR. LAND ROVER NORTH AMERICA HAS NOT ISSUED ANY RECALLS FOR THE FAULTY DIFFERENTIAL SYSTEM AND IS NOT CORRELATED TO ANY FAULT OF THE OWNER/DRIVER.   THE HUMMING NOISE IS LOUDEST WHEN ACCELERATING OR CRUISING. THE SOUND SOFTENS WHEN DE-ACCELERATING OR WHEN TURNING TO THE \"RIGHT\".   CONTINUED USE OF A FAULTY REAR DIFFERENTIAL WILL RESULT IN THE GEARS LOCKING UP AND POSSIBLY LEADING TO AN ACCIDENT. FAULTY DIFFERENTIALS ARE NOT THE RESULT OF DRIVING PATTERNS NOR MAINTENANCE NEGLECT. CURRENT RATES TO FIX REAR DIFFERENTIALS ON THIS MAKE AND MODEL ARE BETWEEN $3K AND $5K AND LAND ROVER NORTH AMERICA DOES NOT OFFER ANY FINANCIAL ASSISTANCE. ONLINE RESEARCH INDICATES THIS PROBLEM IS A PATTERN AND A TREND AND LAND ROVER SHOULD ISSUE AN OFFICIAL RECALL.",
        "vin": "SALFP24N38H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "01/11/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864346,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. WHILE THE VEHICLE WAS PARKED, IT FAILED TO START. THE FAILURE OCCURRED WHEN THE ENGINE WAS HOT ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "SALFT24N78H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "03/19/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10860739,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. WHILE DRIVING 35 MPH, ANOTHER VEHICLE PULLED OUT FROM A PARKING SPACE AND COLLIDED INTO THE PASSENGER SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACTED SUSTAINED FACE AND CHEST INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT DID NOT KNOW IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "SALFT24N58H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2016",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846327,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 25,000 MILES THE KEYS WERE NOT WORKING, WE WENT TO THE DEALER THAT TOLD US THAT THE INSIDE BATTERY GETS RECHARGE WHILE WE DRIVE, BOTH KEYS WERE NOT GETTING ANY CHARGE, THE BATTERY CAN NOT BE REPLACED, YOU WILL HAVE TO BUY A NEW KEY AND GET IT PROGRAMMED BY THE DEALER AT A COST OF $500.00 EACH IN MIAMI, THERE IS NO WAY TO OPEN THE KEY OR TO GET A CHEAPER KEY.",
        "vin": "SALFT24N18H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2016",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846326,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 20,000 MILES AND 4 YEARS AND NOT UNDER WARRANTE TOOK THE CAR TO THE DEALER AND  REPORTED A LOUD NOISE, AFTER 2 DAYS AT THE SHOP THEY TOLD ME IN MIAMI THAT THE CAR WAS FINE, I REQUESTED THE SERVICE MAN TO DRIVE WITH ME AND SHOWED HIM THE REAR NOISE WAS NOT NORMAL, HE AGREE THEN HE QUOTED ME OVER $3,000 TO REPAIR THE REAR TRANSMISSION, AFTER TWITTING TO LAND ROVER AND FILLING A COMPLAINT THEY CAL THE DEALER AND AGREE TO DO THE REPAIR, THEN THE DEALER ONLY REPLACE A GEAR FOR $300.00 INSTEAD OF THE WORK THEY HAVE QUOTED; SOMEBODY SHOULD GET AN ATTORNEY AND REQUEST A CLASS ACTION TO REPLACE THE REAR TRANSMISSION.",
        "vin": "SALFT24N18H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/06/2016",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824643,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL REPLACED AROUND 80,000 MILES.",
        "vin": "SALFP24NX84"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787818,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HEARING A LOUD WHIRRING NOISE COMING FROM THE BACK WHEELS AND KEPT ON GETTING LOUDER.  I TOOK IT IN TO AUTO REPAIR AND IT IS THE REAR DIFFERENTIAL THAT HAS GONE OUT.  AFTER SEARCHING ONLINE I FOUND THAT THIS IS A COMMON PROBLEM WITH 2008 LR2, AND SHOUD BE ON RECALL!",
        "vin": "SALFT24N68H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "10/18/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786063,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. WHILE DRIVING 40 MPH, THE SUN ROOF SHATTERED. AS A RESULT, GLASS SHARDS FELL INTO THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "SALFS24N48H"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750083,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER I DID THE RECALL ABOUT THE SUNROOF,MAYBE A MONTH AFTER THE RECALL WHEN I TRY TO USE THE SUNROOF,THE PARTS JUST CAME OUT OF THE TRACKS AND BROKE.  I CALL LAND ROVER AND THEY SAID IS NOTHING THEY CAN DO,I WILL HAVE TO PAY FROM MY OWN POCKET,OH WELL NOW I HAVE TAPE ON MY SUNROOF BECAUSE SOMETHING THAT LAND ROVER SHOULD FIX.  PLEASE IF SOMEBODY CAN HELP WITH THIS I REALLY APPRECIATE!!  THANK YOU!!  *TR",
        "vin": "SALFS24N98H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "07/04/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750094,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL FAILURE , A SLIGHT MOANING NOISE FROM THE REAR END PROGRESSED INTO GRINDING, RENDERING THE CAR UNSAFE TO DRIVE. THIS ISSUE IS NOT UNCOMMON AND MANY LAND ROVER LR2 OWNERS HAVE EXPERIENCED THIS FROM 45K-60 MILES.   I WENT TO LOCAL PLACE TO SEE HOW MUCH IT WILL COST,THEY WANT 3.276,00.  ITS TOO MUCH MONEY AND I DRIVE KIDS ALL THE TIME,AND I AM AFRAID SOON I WILL HAVE BIG PROBLEMS OR ACCIDENT.  PLEASE HELP ME TO FIX THIS PROBLEM,LAND ROVER SHOULD FIX THIS WITHOUT CHARGE.  THANK YOU SO MUCH!!    VIEW DETAILS  *TR",
        "vin": "SALFS24N98H"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745465,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR STARTED MAKING GRINDING NOISE WHEN ACCELERATING AND TURNING TO THE LEFT OR RIGHT.  I TOOK IT TO THE DEALERSHIP, THEY SAID THAT THEY DID NOT HEAR THE NOISE AND I MAY NEED TO WAIT UNTIL IT GETS WORSE, NUMEROUS ONLINE COMPLAINTS OF A FAULTY DESIGN FOR THE DIFFERENTIAL - LAND ROVER TOLD ME THAT THEY HAVE REPLACED 2 DIFFERENTIALS IN LAST COUPLE OF MONTHS AND IF THAT IS WHAT IS WRONG WITH MY VEHICLE IT COULD POTENTIALLY LOCK UP WHILE I'M DRIVING AND COULD CAUSE AN ACCIDENT.  WILL YOU PLEASE LOOK INTO WHY LAND ROVER HAS NOT DONE A RECALL ?    THANK YOU VERY MUCH,  LAURIE .....UPDATED 10/19/15 *BF      *CN",
        "vin": "SALFP24N58H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "05/12/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717546,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LAND ROVER LR2 - INSERTED KEY TO START THE ENGINE - WILL START ON FIRST TRY HAVE TO REMOVE KEY LET CAR SIT PUMP THE BRAKES AND TRY AGAIN THE CAR WILL EVENTUALLY TURN OVER AND START. I TOOK THE VEHICLE TO FRED LAVERY LAND ROVER DEALERSHIP THEY KEPT MY CAR FOR 4 DAYS AND TOLD ME IT WAS A SOFTWARE UPDATE THAT MY EXTENDED DIDN'T COVER. 1500.00 DOLLARS LATER I RECEIVED MY CAR BACK AND THE NEXT DAY THE SAME PROBLEM NOW EVEN WORST. THE CAR HAS TO SIT FOR ABOUT 5-10 MINUTES TO START. I CALLED THE DEALER AND WAS ADVISED THAT THEY NEVER DUPLICATED THE PROBLEM AND THEY WOULD NEED TO HAVE THE MECHANIC TAKE MY CAR HOME OVERNIGHT TO SEE IF HE COULD DUPLICATE AND FIX THE PROBLEM.",
        "vin": "SALFT24N28H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714796,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT IN FOR REGULAR OIL CHANGE: MULTI POINT INSPECTION REVEALED \"REAR HALDEX LEAKING BADLY NEED PRICE AND FLUID\". DEALER SAYS \"READ DIFFERENTIAL FAILURE: NEEDS TO BE REPLACED\". DEALER QUOTED COST FOR THE REPLACEMENT: $5199 + LABOR CHARGE.   REVIEW OF SEVERAL LAND ROVER FORUMS SHOWS THIS IS AN ONGOING ISSUE DATING BACK TO 2011, ONE PARTICULAR FORUM \"LANDROVERSONLY.COM\" HAS 160 COMPLAINTS ON THIS VERY PARTICULAR ISSUES. THE NHTSA WEBSITE HAS 46 COMPLAINTS (MAJORITY OF THEM REGARDING THIS ISSUE.   REQUESTING IMMEDIATE ATTENTION TO HOLD LAND ROVER/DEALERSHIP ACCOUNTABLE FOR THIS KNOWN DEFECTIVE PART.   *TR",
        "vin": "SALFP24N58H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713047,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. WHILE DRIVING AT APPROXIMATELY 50 MPH, THERE WAS AN ABNORMAL HUMMING NOISE COMING FROM THE REAR OF THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE REAR DIFFERENTIAL FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "SALFP24N88H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "03/19/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695375,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "QUOTED BY DEALERSHIP THAT REAR DIFFERENTIAL NEED TO BE REPLACED FOR ~$2200. RESEARCH HAS SHOWN MY THERE ARE HUNDREDS OF COMPLAINTS ABOUT THE SAME ISSUES ON MANY LAND ROVER LR2/3 MODELS. I WOULD LIKE TO ADVOCATE FOR A RECALL, AS EVERY TIME LAND ROVER FIXES THIS KNOWN DEFECTIVE PART, THEY MAKE A BIG PROFIT. OTHERWISE, A CLASS ACTION LAWSUIT WILL BE INITIATED AGAINST LAND ROVER.   *TR",
        "vin": "SALFS24N88H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/04/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693252,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 LR2 AND JUST RECEIVED CONFIRMATION FROM THE LOCAL DEALER SERVICE DEPARTMENT THAT THE REAR DIFFERENTIAL HAS FAILED AND IS THE SOURCE OF THE WIDELY REPORTED LOW PITCHED REAR HUM.  THIS NOISE FROM THE REAR OF THE VEHICLE STARTED AROUND 66,000 MILES (CURRENT MILEAGE 74,600).  I WAS NOT AWARE AT THE TIME OF THE REAR DIFFERENTIAL ISSUE WITH THESE CARS, AND GIVEN THAT THE SET OF TIRES ON THE CAR WERE DUE TO BE CHANGED I ATTRIBUTED THE NOISE TO THE TIRE TREAD WEAR.     I OPTED TO RUN THE EXISTING TIRES THROUGH THE WINTER AND STRETCH THE MILEAGE AS MUCH AS POSSIBLE.  THE NOISE CONTINUED TO GET WORSE, BUT AGAIN, ATTRIBUTED THAT TO THE TIRE TREAD.  I SUBSEQUENTLY STARTED SOME RESEARCH INTO OTHER CAUSES OVER THE PAST COUPLE WEEKS AND FOUND MANY, MANY REPORTS OF DIFFERENTIAL FAILURES ON THESE CARS.  I REPLACED THE TIRES HOPING THAT WAS THE ROOT CAUSE.  IT WAS NOT, SO THE APPOINTMENT AT THE DEALER WAS SCHEDULED AND THEY CONFIRMED THAT THE REAR DIFF IS DEFECTIVE.  THE QUOTED PRICE FOR THE REPAIR ' 5  HRS + PARTS, $3,000+.  FORTUNATELY I HAD THE DEFECT DIAGNOSED BEFORE A CATASTROPHIC FAILURE THAT COULD HAVE POTENTIALLY RESULTED IN EXTENSIVE DAMAGE TO THE VEHICLE AND/OR INJURY TO PASSENGERS.    AS I HAVE SUBSEQUENTLY DISCOVERED AS I WAS GIVING APPROVAL TO ORDER THE NEW DIFFERENTIAL, THE PART HAS BEEN RE-DESIGNED SIX TIMES.  THIS FACT ESSENTIALLY CONFIRMS THAT LAND ROVER HAS RECOGNIZED THE DESIGN FLAWS, BUT IS NOT DOING ANYTHING TO RESOLVE THE PROBLEM WITH OWNERS.  *TR",
        "vin": "SALFP24N28H"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682964,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SEEMS LIKE THE CAR WHAT'S TO STALL AND I NOTICED THE RPMS WOULD SHOOT UP AND THEN DROP AND THE CAR JUST ABOUT STALLS. THIS HAPPENED TO MY WIFE AND I ABOUT 8 DIFFERENT TIMES IN THE LAST 4 MONTHS WHILE DRIVING AND ABOUT 4 TIMES WHILE WAITING FOR A RED LIGHT TO CHANGE OR WHILE STOPPED.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "12/25/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676657,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE GUIDE RAIL OF THE SUNROOF BECAME INOPERABLE. IN ADDITION, THE CONTACT STATED THAT THE RUBBER SEALANT AND THE SUN ROOF FRACTURED. AS A RESULT, THE CONTACT WAS UNABLE TO CLOSE THE SUN ROOF. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE SUN ROOF NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS AWARE OF NHTSA CAMPAIGN NUMBER: 08V055000 (VISIBILITY). THE FAILURE MILEAGE WAS 96,000.",
        "vin": "SALFP24N88H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671806,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL NOISE.  *TR",
        "vin": "SALFS24N98H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "07/30/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654828,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT WHILE ENTERING A PARKING LOT, THE ENGINE STALLED. THE VEHICLE FAILED TO RESTART UNTIL THE NEXT DAY. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 79,600.",
        "vin": "SALFR24N48H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643318,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE OTHERS, OUR LR2 BEGAN TO DEVELOP A WHINING SOUND FROM THE REAR AROUND 85,000 MI (NOW AT 88,000 SOCCER MOM MILES - NEVER OFF ROAD OR ABUSED).  THIS CAR IS A MONEY PIT.  AC WENT OUT AT 80,000 ($2,000 REPAIR), HOOD LATCH CAUSING FALSE ALARMS ($300), CONSTANTLY NEEDS BRAKES AND ROTORS (EVERY 25 TO 30K MILES), SUNROOF WENT (BUT APPARENTLY WE JUST MISSED THE VIN FOR THE RECALL)($3,000), AND NOW $4,000 FOR REAR DIFFERENTIAL WORK.  LAND ROVER WHICH HAS ISSUED A SERVICE BULLETIN ON THE DIFFERENTIAL, SHOULD DO THE RIGHT THING AND ISSUE A RECALL AND REPAIR THIS.    *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638381,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE WEARING OF BRAKE PADS AND ROTORS.  WHEN NEW, THE CAR MADE IT TO 37,450 ON THE REAR BRAKES.  THEY WERE THEN REPLACED FOR ABOUT $400 ON 12/31/10.  THOSE LASTED 29,000 MILES UNTIL 66,082 MILES ON 2/18/13.  THEY WERE REPLACED AGAIN, THIS TIME FOR ABOUT $500.  NOW, AT 87,500 MILES (ONLY 22,000 MILES LATER), THEY ARE WORN TO THE BONE.  LAND ROVER CLAIMS IT IS A WEARABLE ITEM AND THEY USE SOFT PADS FOR BETTER BRAKING.  I'VE OWNED DOZENS OF VEHICLES OVER 50 YEARS AND USUALLY 40,000 MILES IS NORMAL FOR PADS AND ROTORS.  EVEN IF WHAT LAND ROVER SAYS IS TRUE AND 30,000 IS ABOUT RIGHT FOR THIS VEHICLE, THE 22,000 MILES I JUST GOT OUT OF THE LAST SET IS HORRIBLE.  NEVER AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622200,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG AND SEAT BELT LIGHTS STAY LIT WHILE DRIVING.  DEALER SAID WHEN BOTH LIGHTS ARE LIT AIRBAGS WILL NOT DEPLOY.  $1000.00 TO REPLACE PASSENGER SEAT CUSHION BECAUSE OF \"FAULTY\" SENSOR EMBEDDED IN CUSHION.  NOW WHEN I SEE THE LIGHTS I TURN VEHICLE OFF AND THEN BACK ON UNTIL I DON'T SEE THE LIGHTS.  STRANGE THAT A FAULTY SENSOR WOULD DISABLE SAFETY FEATURES.   *TR",
        "vin": "SALFR24N28H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604656,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE CALL INITIATED DUE TO HUMMING/GRINDING FROM REAR OF THE VEHICLE FOR WHICH THE PITCH CHANGES WITH THE SPEED OF THE VEHICLE. LAND ROVER DEALER INDICATES THAT THE COUPLING ASSEMBLY NEEDS TO BE REPLACED AT A COST OF $3642. I HAVE BEEN INFORMED THAT THIS IS A COMMON PROBLEM, INCLUDING INVOLVEMENT OF THE PINION BEARING/REAR DIFF WITH YEARS 08-12. RESEARCH REVEALS THAT THIS IS, IN FACT, QUITE COMMON THROUGHOUT THE EARLY YEARS OF THE LR2 PRODUCTION LINE OFTEN WITH LESS MILEAGE WITH SERVICE BULLETINS IN PLACE. SAID VEHICLE HAS BEEN METICULOUSLY CARED FOR AND MAINTAINED. THESE ARE COSTLY REPAIRS WITH THE BURDEN OF SUCH PLACED ON UNSUSPECTING LAND ROVER OWNERS. LAND ROVER SHOULD STAND BY THEIR WORKMANSHIP AND SUPPORT THEIR CUSTOMERS IN THESE REPAIRS BEFORE MORE SERIOUS EVENTS OCCUR.  *TR",
        "vin": "SALFT24N58H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604857,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ADDENDUM TO ODI# 10604656 HUMMING/GRINDING FROM REAR OF VEHICLE. SPOKE TO THE LAND ROVER USA REPRESENTATIVE TODAY AND THEY OFFERED $500 TOWARD THE TOTAL REPAIR OF $3642. SAID REPRESENTATIVE INDICATED THERE IS NO OTHER RECOURSE OTHER THAN CONTACTING THE BETTER BUSINESS BUREAU. BASICALLY, I WAS TOLD TO GO POUND SAND DUE TO THE VEHICLE BEING OUT OF WARRANTY AND I AM FIRST-TIME OWNER. HENCE, I HAVEN'T PROVIDED ENOUGH BUSINESS TO LAND ROVER TO QUALIFY FOR GREATER MONETARY ASSISTANCE. LAND ROVER IS ESSENTIALLY BENEFITING FROM THE COSTLY REPAIR OF THESE DEFECTIVE VEHICLES THAT THEY SOLD TO THEIR CUSTOMERS. THESE DRIVETRAIN ISSUES ARE CLEARLY CAUSED DUE TO DEFECTIVE PARTS AND/OR IMPROPER DRIVETRAIN DESIGN AND THE NHTSA REALLY NEEDS TO SUPPORT CONSUMERS IN GUIDING THE MANUFACTURER TO INITIATE A RECALL, ETC.   *TR",
        "vin": "SALFT24N58H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585523,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT THE HDC AND TRANSMISSION FAIL LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE RELAY FUSE WOULD NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 75,700.",
        "vin": "SALFP24N78H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579733,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 11, 2014, A CHECK ENGINE LIGHT IS ON AND RMPS GOES UP AND DOWN AT IDLE. I WENT TO THE DEALERSHIP AND HAD TO PAY $340.00 FOR DIAGNOSTIC AND SOFTWARE UPDATES THAT SHOULD BE FREE AND COVERED BY LAND ROVER, NOT BY ITS CUSTOMERS. THEY USE THIS TRICK AS A HIGH JACKING POINT TO SQUEEZE MONEY OUT OF THEIR CUSTOMERS' POCKETS.  I HAVE NEVER EXPERIENCED ANY SUCH THING WITH ANY OTHER VEHICLE I HAVE EVER OWNED.  THIS IS A SUMMARY OF CHARGES AND CODES:  66806 CJA 2.50 USE DSS TESTER TO DIAGNOSE ENGINE LIGHT ON/ READ CODES  P050B FLAGED NEC TO PERFORM LTB00264 ECM UPDATE, THEN PERFORM  LTB00094 FOR STUMBLE UPDATE BCM IPK SOLAR SENSOR    REPLACE ENGINE AIR FILTER  1 LR005816 FILTER - AIR CLE  66806 CJA 0.30 INSTALL NEW AIR FILTER    WAITER ENGINE LIGHT SOFTWARE UPDATES.    PLEASE INVESTIGATE THESE SOFTWARE SYSTEM DEFECTS AND MAKE LAND ROVER LIABLE FOR PAYMENT FOR ITS OWN DEFECTIVE SOFTWARE. THEY SHOULD BE MADE RESPONSIBLE AND ACCOUNTABLE FOR ANY DEFECTS. I EXPECT TO BE REIMBURSED FOR FULL PAYMENT AS A RESULT OF THIS INVESTIGATION.    THANK YOU!    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)   *JS",
        "vin": "SALFP24N58H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "03/12/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578089,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A HUMMING SOUND COMING FROM THE REAR OF MY LAND ROVER LR2.  SO I TOOK IT INTO A LOCAL SHOP AND ASK THEM TO LOOK AT IT.  I THEN TOOK THE INFORMATION THAT THEY PROVIDED ME AND CALLED THE NEAREST LAND ROVER DEALER ABOUT 100 MILES AWAY. THEY SAID THAT IT SOUNDED LIKE THE PINION GEARS, THAT IT WAS A \"KNOWN PROBLEM\" AND \"VERY COMMON\" THEY EXPLAINED THAT THEY HAVE A WAY TO FIX THE ISSUE AND THAT IT WOULD BE AROUND $1,000.00 THEY ALSO DISCOURAGED ME FROM HAVING MY LOCAL SHOP WORK ON IT.  SO AT THIS POINT I'M GOING TO CALL THE LAND ROVER DEALER AND SETUP AN APPOINTMENT.  THE LOCAL SHOP SUGGESTED THAT I FILL OUT A COMPLAINT.  NOW THAT I LOOK AT THE DATABASE IT SEEMS LIKE A LOT OF PEOPLE ARE HAVING THIS SAME ISSUE.  *TR",
        "vin": "SALFR24N28H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2014",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568318,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 LAND ROVER LR2 HAS SUFFERED 2 DIFFERENT DRIVELINE FAILURES WITHIN A COUPLE MONTHS OF EACH OTHER AT APPROXIMATELY 84,000 MILES. FIRST, THE PINION BEARING IN THE REAR DIFFERENTIAL FAILED CAUSING THE DEALER TO REPLACE THE WHOLE DIFFERENTIAL AS THIS IS A SEALED UNIT. SHORTLY AFTER THIS, A DRIVESHAFT BEARING FAILED AS WELL REQUIRING A NEW DRIVESHAFT SINCE LR DOES NOT SELL THE BEARING INDIVIDUALLY ONLY WHOLE ASSEMBLIES.  BOTH REPAIRS WERE DIAGNOSED AND REPAIRED BY THE LOCAL LAND ROVER DEALER AT CONSIDERABLE COST OF APPROX $4500. THIS VEHICLE WAS PURCHASED NEW AND HAS HAD ALL REGULAR SERVICES PERFORMED BY THE DEALER.  FOR A VEHICLE OF THIS SUPPOSED QUALITY TO SUFFER TWO SUCH FAILURES BELOW 100,000 MILES AS MOST MANUFACTURERS WARRANTY SUCH COMPONENTS IS UNACCEPTABLE.  ONLINE LR FORUMS INDICATE THAT THIS REAR DIFFERENTIAL FAILURE IS QUITE COMMON AND OFTEN OCCURS AT EVEN LOWER MILEAGES THAN MINE DID; SOMETIMES EVEN WITHIN THE WARRANTY PERIOD FOR SOME \"LUCKY\" PEOPLE. THE FACT THAT THESE FAILURES TO SUCH A MAJOR COMPONENT ARE OCCURRING AT LOW MILEAGES INDICATE A FAULTY DESIGN AND LAND ROVER SHOULD INITIATE A RECALL ON THE REAR DIFFERENTIAL.  *TR",
        "vin": "SALFP24N68H"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2013",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556626,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL FAILURE. GRINDING NOISE, PINION AND CARRIER BEARINGS REPLACED.  *TR",
        "vin": "SALFR24NX8H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2013",
        "dateOfIncident": "09/18/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546377,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE BRAKES WERE APPLIED BUT THE VEHICLE DID NOT STOP. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHERE IT WAS ADVISED TO THE CONTACT THAT THE BATTERY FAILED AND ACID HAD LEAKED FROM THE BATTERY, SPREADING TO THE BRAKE LINE AND ALL COMPONENTS THAT WERE NEAR THE BATTERY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 105,000. THE CURRENT MILEAGE WAS 108,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "12/12/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515761,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY LAND ROVER LR2 HSE BRAND NEW FROM A DEALER IN NJ ON MAY 31, 2008 . IN MID 2012, AT 45K MILES RIGHT AFTER MY WARRANTY EXPIRED, I STARTED TO HEAR A DISTURBING HOWLING OR HUMMING NOISE FROM THE REAR WHICH IS GETTING MUCH LOUDER AT HIGHWAY SPEEDS. IT GOT WORSE AFTER DRIVING ANOTHER 2K MILES, SO I TOOK IT TO THE DEALERSHIP IN APRIL 2013. I WAS TOLD THAT THE REAR DIFFERENTIAL (RDIFF) NEEDS TO BE REPLACED WHICH WAS THE CAUSE FOR THE NOISE. I WAS GIVEN AN ESTIMATE FOR THE REPLACEMENT OF A REBUILT (NOT A BRAND NEW ONE) FOR $2321. THIS CAR HAS AN ALMOST UNUSED REAR SEAT AND HAS NEVER BEEN OFF-ROAD AND 80% OFF THE MILEAGE HAS BEEN ON THE HIGHWAY. I CALLED THE LAND ROVER NORTH AMERICA IN MAY TO OPEN A CASE AND ASKED THEM TO PAY FOR THE COST OF THE REPAIR SINCE I FOUND THIS PROBLEM EXTREMELY PREMATURE FOR A HIGH END SUV. THEY DON'T EXPLICITLY ADMIT 2008 LR2S HAVE FAULTY RDIFFS BUT THEY AGREED TO PAY ONLY $500 TOWARDS THE REPLACEMENT. I AM AFRAID THIS PROBLEM MIGHT GET WORSE AND TREACHEROUS TO DRIVE AND STRONGLY BELIEVE THAT LAND ROVER NORTH AMERICA SHOULD MAKE A RECALL FOR THIS PROBLEM AND BE HELD RESPONSIBLE FOR THE WHOLE COST OF REPLACEMENT WITH A BRAND NEW (INSTEAD OF A REBUILT) ONE. I ALSO FOUND OUT ON THE INTERNET THAT IS A COMMON PROBLEM FOR 2008 LR2S. HTTP://WWW.LANDROVERSONLY.COM/FORUMS/F11/LR2-REAR-DIFFERENTIAL-FAILURE-41070/.  *TR",
        "vin": "SALFT24N68H"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494382,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO , I AM A FORMER US MARINE DISABLED  AND THIS LAND ROVER LR2 HSE HAS A BIG PROBLEM WITH WINDSHIELD WASHER PUMPS IT HAS TWO PUMPS ONE FOR THE HEAD LIGHTS AND ANOTHER FOR THE WINDSHIELD I JUST BOUGHT THIS VEHICLE IN MAY OF 2012 AT TEDDY VOLKSWAGEN IN BRONX ,NEW YORK AND I LIVE IN YONKERS,NY . I CALLED THE DEALER  TO FIX THE PROBLEM THEY SAY THEY HAVE  TO BRING THE DOWN THE FRONT BUMPER DOWN TO FIX A WINDSHIELD PUMP THAT COST $24.26 FOR A WINDSHIELD WASHER FRONT PUMP ITS OUTRAGES HOW MUCH THIS WINDSHIELD WASHER PUMP COST AND THE ONLY WANT THAT CAN FIX IT IS THE LAND ROVER DEALER A $ 24.26 WINDSHIELD PUMP FOR A LAND ROVER LR2 HSE I THINK THERE SHOULD BE A RECALL ON THIS VEHICLE IT DOESN'T MAKE SENSE THE COST OF FIXING OR REPLACING A WINDSHIELD WASHER PUMP TO REMOVE THE FRONT BUMPER TO REMOVE THE FRONT BUMPER !!PLEASE RECALL THE THIS VEHICLE WITH THIS MAJOR PROBLEM LAND ROVER LR2 HSE 2008. PLEASE HELP ME OUT ,I SERVED MY COUNTRY WITH LOT OF PRIDE AND HONOR AND RESPECT .    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SALFR24N98H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2012",
        "dateOfIncident": "12/17/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489547,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN HEARING A VERY LOUD HUMMING SOUND FROM THE REAR SO I TOOK IT TO A MECHANIC AND FOUND THE REAR DIFFERENTIAL NEEDED TO BE CHANGED.  I BEGAN TO DO SOME RESEARCH AND FOUND THIS TO BE A WIDESPREAD PROBLEM AMONGST ALL 2008 LAND ROVER LR2S ONCE THE LR2 REACHES AROUND 60K TO 80K.  THIS IS REALLY UNACCEPTABLE OF LAND ROVER TO NOT TAKE RESPONSIBILITY FOR THIS ISSUE AS IT IS A VERY BIG SAFETY CONCERN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2012",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489360,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER ONE YEAR AGO I BEGAN NOTICING A HIGH PITCHED WHINING NOISE COMING FROM REAR END OF VEHICLE DURING STARTING AND STOPPING WHILE TRANSMISSION IS IN FIRST GEAR.  RESEARCHED THE ISSUE ON INTERNET FORUMS AND DISCOVERED NUMEROUS REPORTS OF REAR DIFFERENTIAL PROBLEMS.  FINALLY PAID TO HAVE LR DEALERSHIP LOOK AT ISSUE ON 15 DEC 2012 AND THEY DETERMINED PROBLEM IS INDEED REAR DIFF.  I OPTED TO ATTEMPT A REBUILD THROUGH THEM, AND THEY REPLACED THE PINION BEARING AND SERVICED OTHER PARTS AND FLUIDS.  UPON A ROAD TEST THE NOISE STILL PERSISTED AND THE SERVICE ADVISOR ADVISED ME THAT THERE COULD BE A PROBLEM WITH THE GEARS THAT COULD EVENTUALLY LEAD TO A LOCK-UP OF THE REAR DIFFERENTIAL, RECOMMENDING A COMPLETE REPLACEMENT OF THE UNIT.  ASIDE FROM THE EXORBITANT COMPOUNDING COSTS TO REBUILD AND NOW REPLACE THE UNIT, THIS SOUNDS LIKE A POTENTIAL SERIOUS SAFETY ISSUE TO ME AND LR APPEARS TO BE TAKING NO RESPONSIBILITY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2012",
        "dateOfIncident": "11/27/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487667,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT THE DRIVER OF THE VEHICLE WAS TRAVELING 30 MPH WHEN SHE HEARD A HOLLOW NOISE COMING FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A REPAIR SHOP WHERE THEY ADVISED HER THAT THE REAR DIFFERENTIAL NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 42,000.",
        "vin": "SALFT24N08H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/20/2012",
        "dateOfIncident": "07/19/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466745,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, AT ANY SPEED, I EXPERIENCED A LOUD HUMMING NOISE FROM THE REAR OF THE CAR. I BROUGHT THE VEHICLE TO A REPAIR FACILITY AND WAS TOLD THE REAR DIFFERENTIAL IS DEFECTIVE. DOING SOME RESEARCH ON THE TOPIC, FOUND THAT THERE ARE MANY CASES OF THE REAR DIFFERENTIAL FAILING BEFORE THE RECOMMENDED SERVICE TIME OF 10 YEARS/100,000 MILES. IT APPEARS LAND ROVER IS AWARE OF THE PROBLEM AND HAS COMMENTED ON REPLACING THE DEFECTIVE  UNIT WITH A NEW DESIGNED REAR DIFFERENTIAL. A CALL TO LAND ROVER CORPORATE REGARDING A RECALL WAS NEGATIVE, AND NON COMMITTAL TO A SOLUTION OTHER THAN OUT OF POCKET EXPENSE OF $2500 TO ME. I FEEL THAT THIS IS A MAJOR SAFETY ISSUE AS THIS COMPONENT IS PART OF THE DRIVE TRAIN.  *TR",
        "vin": "SALFP24NX8H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466504,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RESPECTFULLY REQUEST TO RECALL THE REAR DIFFERENTIAL OF A LAND ROVER 2008 LR2 HSE.  A MOANING NOISE IS HEARD FROM THE REAR AND IT GETS LOUDER AS THE SPEED GOES UP.  READING THROUGH THE LR OWNERS OF THIS SAME VEHICLE FROM US AND UK AND IT IS NOT FAIR THAT THE CONSUMERS COUGH UP OVER $2,500 TO $5,000 FOR THIS REPAIR. LAND ROVER OF AMERICA SHOULD HAVE KNOWN THAT THEY PUT IN A FAULTY REAR DIFFERENTIAL ON THE 2008 LR2 RIGHT JUST AS THE WARRANTY EXPIRED. THE COST OF REPAIR IS PRETTY HEFTY AND THE VEHICLE IS STILL DRIVABLE EVENTHOUGH THE REAR DIFFERENTIAL IS BROKEN. SHOULD WE WAIT UNTIL AN ACCIDENT HAPPENS ON THE HIGHWAY BEFORE THEY RECALL THE REAR DIFFERENTIAL?  PLEASE INITIATE RECALL INVESTIGATION.  THANK YOU.  *TR",
        "vin": "SALFR24N18H"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459581,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C DOES NOT PUT OUT COOL AIR WHEN THE CAR IS NOT MOVING AT HIGH SPEEDS. THE OVERHEATING LIGHT CAME ON, UNSURE WHY. NOTHING WRONG WITH COOLANT.  *TR",
        "vin": "SALFT24N58H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/05/2011",
        "dateOfIncident": "09/28/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428801,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LAND ROVER LR2.  THE CONTACT WAS DRIVING 60 MPH WHEN THE VEHICLE STALLED DUE TO COOLANT LEAKING ON THE ALTERNATOR AND CAUSING THE ALTERNATOR TO MALFUNCTION.  THE CONTACT TOOK THE VEHICLE TO A LOCAL MECHANIC AND WAS ADVISED THAT THERE WAS AN OPEN RECALL REGARDING THE COOLANT HOSE.  THE CONTACT CALLED THE MANUFACTURER REGARDING THE UNKNOWN RECALL AND WAS ADVISED THAT THE VEHICLE WAS INCLUDED IN A MANUFACTURERS RECALL BUT NOT FOR THE ALTERNATOR.  THE CONTACT STATED THAT THEY NEVER RECEIVED A RECALL NOTICE. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "SALFP24N98H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "08/05/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419760,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PERIODICALLY, THE CAR TEMPERATURE WOULD SUDDENLY SHOOT UP OVERHEATING AND THE A.C. WOULD STOP WORKING. I HAD TO PULL OVER TO COOL DOWN THE ENGINE AND THEN THE TEMPERATURE WOULD RETURN BACK TO NORMAL AND THE A.C WOULD START WORKING AGAIN. LAND ROVER SAID IT WAS AN \"INTERMITTENT OPEN IN THE FAN MOTOR WHEN IT WAS HOT\". THEY REPLACED THE FAN ASSEMBLY AND MODULE AND REPROGRAMMED THE ECM.  *KB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2011",
        "dateOfIncident": "11/22/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417979,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO EVENT- CAR WOULD STALL OUT, WOULD HAVE TO REV UP TO GET GOING. INTERMITTENT PROBLEMS.     2008 LANDROVER LR2 SHUTS OFF AT IDLE- BAD FUEL PUMP AT 50, 000 MILES    MULTIPLE VISITS TO THE LANDROVER DEALERSHIP SHOP, FUEL PUMP MODULE FIXED UNDER WARRANTY AS PER LANDROVERS SUGGESTION- PRIOR TO 50,000 MILES, AFTER HITTING 50,000 MILES AND WARRANTY NO LONGER VALID, PROBLEM FOUND! FUEL PUMP NEEDS REPLACED FOR A VERY UNREASONABLE $ RATE . (AS ORIGINALLY SUGGESTED BY OWNERS)    SEE WHAT THE SHOP DIDN'T KNOW WAS PRIOR TO THEM REPLACING THE MODULE AND READING THE CODES, I WENT AND HAD THE CODES READ  AT ANOTHER SHOP. THE DEALERSHIP FIXED CODE- PO62800, WHEN ACTUALLY THE CODES THAT THE CHECK ENGINE LIGHT WAS READING WAS 0087, 0305, 0306, 0300. ALL CODES THAT WOULD HAVE LET YOU KNOW THAT THIS WAS SURELY A FUEL PUMP ERROR.     OBVIOUSLY A SCAM, SO THAT THE WARRANTY WOULD RUN UP, AND WE WOULD HAVE TO PAY OUT OF POCKET.     IN THE END, WHEN YOU READ ONLINE, THIS IS A VERY COMMON PROBLEM WITH THESE VEHICLES, AND THESE DEALERSHIPS.     IN ADDITION, THEY HAVE ALSO NOTED THAT THE REAR DIFFERENTIAL NEEDS REPLACED?  *TR",
        "vin": "SALFP24N98H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/2011",
        "dateOfIncident": "05/23/2011",
        "fire": true,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407223,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THAT WHEN THE DRIVER STOPPED THE VEHICLE AND TURNED THE STEERING WHEEL TO THE LEFT SMOKE WAS UNDERNEATH THE VEHICLE. THE STEERING WHEEL LOCKED WHEN THE FAILURE OCCURRED. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE STEERING PUMP WAS REPLACED AND A NEW STEERING FITTING KIT WAS INSTALLED. THE CONTACT WAS ALSO INFORMED THAT THE SMOKE WAS A RESULT OF THE STEERING FLUID SPRAYING ONTO THE EXHAUST SYSTEM. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT REFUSED TO SHARE ANY CASE INFORMATION WITH THE CONTACT. THE FAILURE MILEAGE WAS 56,000.",
        "vin": "SALFS24N48H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/31/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403981,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL FAILURE    OVER A THREE DAY PERIOD, A SLIGHT MOANING NOISE FROM THE REAR END PROGRESSED INTO GRINDING, RENDERING THE CAR UNSAFE TO DRIVE.  THIS ISSUE IS NOT UNCOMMON AND MANY LAND ROVER LR2 OWNERS HAVE EXPERIENCED THIS FROM 45K-60 MILES.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "06/03/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404017,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LAND ROVER LR2. THE CONTACT STATED THE FUEL GAUGE WOULD SUDDENLY MOVE TO EMPTY AND HE WAS UNSURE OF HOW MUCH FUEL WAS IN THE FUEL TANK. THE CONTACT ALSO STATED THAT WHEN ADDING GASOLINE TO THE FUEL TANK, FUEL WAS POURING OUT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE FUEL LINE HAD SPLIT AND IT WAS REPLACED. IN REGARDS TO THE FUEL GAUGE, THE DEALER REPLACED TWO SENSORS, WATER PUMP AND ANOTHER FUEL LINE. THE FAILURE WAS TRIGGERED DURING COLD WEATHER. THE MIRRORS ALSO STOPPED MOVING WHEN THE CONTACT SHIFT IN REVERSE. THE MIRRORS WERE REPLACED. THE AIR CONDITIONER ALSO STOPPED FUNCTIONING AND CAUSED THE VEHICLE TO OVERHEAT AND THE FAN WAS REPLACED. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 51,500. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2011",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399086,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE LAND ROVER LR2 2008 AND THE ENGINE WOULD SHUT DOWN.  I COULDN'T GET THE KEY OUT AND ENGINE'S ELECTRONIC IS NOT RESPONDING.  I HAVE TO GET IT TOWED TO THE DEALERSHIP AND THEY COULDN'T EXPLAIN THE REASON.  THEY CHARGED US $1900 ON REPLACING THE NEW ELECTRONIC BOARD AND SOME FLUID LEAKAGE ON THE CAR.  WE JUST GOT OUR CAR BACK FROM THE DEALER THREE WEEKS EARLIER FOR A THOROUGH CHECK-UP AND INSPECTIONS ON THE CAR AND WE ALSO HAD OUR BRAKES CHANGED.  THEY CHARGED US $1400 THREE WEEKS AGO AND NOW THEY ARE CHARGING US AGAIN.  SO FRUSTRATING. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2010",
        "dateOfIncident": "08/30/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352866,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LAND ROVER LR2 - INSERTED KEY TO START THE ENGINE - COMPLETELY DEAD EXCEPT FOR A STRANGE CLICKING SOUND FROM THE ENGINE COMPARTMENT. THE DRIVER DISPLAY WAS FLICKERING AS IF THERE WAS A SHORT CIRCUIT. NOTHING ELECTRICAL WORKED AT THIS STAGE. AFTER ABOUT 5 MINUTES THE INDICATORS STARTED BLINKING ALL ON THEIR OWN (HAZARD LIGHTS - BUT VERY FAST). TRIED TO JUMP START THE VEHICLE WITHOUT SUCCESS. WE HAVE THE KEY STUCK, VEHICLE IS DEAD AND IN PARK - EVENTUALLY HAD TO TOW TO THE DEALER WHO IS TRYING TO FIND THE CAUSE. *TR",
        "vin": "SALFT24NX8H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "07/17/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344015,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1 &2. RANDOM NON-START WITH NO SYMPTOMS.  INSERT KEY, PRESS BRAKE PEDDLE AND PUSH START BUTTON BUT NOTHING HAPPENS OTHER THAN A SOFT WHIRRING SOUND FOR ABOUT 3-5 SECONDS.  3. REPEAT TRIES, TAKE KEY IN AND OUT. LET SET FOR 10-15 MINUTES HAS WORKED MOST TIMES.  AFTER 4TH TIME OVER 10 DAY PERIOD THE CAR WOULD NOT START AND WAS TOWED TO GARAGE.  THEY HAD FOR 6 DAYS COULD FINE NO FAULT. HOWEVER, BATTER WAS DISCHARGED WITH NO INDICATION OF WHY. (PERHAPS REPEATED ATTEMPTS TO START) TWO DAYS AFTER WE GOT CAR BACK IT HAPPENED AGAIN.  TOOK KEY OUT AND REPEATED START PROCESS AND IT STARTED.  FEAR OF FAMILY BEING STUCK IN A HIGH RISK SITUATION HAS CAUSED US TO LIMIT THE USE OF THE VEHICLE AND INCREASED FRUSTRATION WITH THE BRAND AND THE DEALER. *TR",
        "vin": "SALFS24N38H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "12/03/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295053,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY LIGHT CAME ON WHEN I STARTED THE VEHICLE. IT OCCURRED EVERY MORNING AND AFTER LEAVING WORK. TOOK VEHICLE TO DEALER AND THEY FOUND OUT IT WASN'T THE BATTERY. THERE WAS AN INTERNAL FAULT IN ALTERNATOR. DEALER REPLACED ALTERNATOR. OLD PART IS NOT AVAILABLE. THE DEALER TOOK THE OLD PART. *TR",
        "vin": "SALFR24N58H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "11/19/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295055,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE KEEP WARNING THAT COOLANT FLUID WAS LOW EVERY THREE WEEKS. WE KEPT REFILLING THE CONTAINER WITH COOLANT FLUID EVERY 3 WEEKS WHICH IS NOT NORMAL. ASSUME THERE WAS A LEAK. TOOK VEHICLE TO DEALER THEY FOUND HOSE LEAKING. DEALER REPLACED BLEED HOSE RESERVOIR TO ENGINE. LEAKING AT ENGINE. SHOULDN'T HAVE COOLANT PROBLEMS SO SOON WITH NEW VEHICLE. *TR",
        "vin": "SALFR24N58H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "06/30/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295059,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C STOPPED COOLING. AC WAS BLOWING HOT AIR ONLY. TOOK VEHICLE TO DEALER NUMEROUS OF TIME TO CHECK AC SYSTEM SINCE JULY 22, 2008. THE DEALER FINALLY FOUND THE PROBLEM ON JUNE 30, 2009. TURNS OUT THE AC SYSTEM WAS NOT WORKING. DEALER HAD TO REPLACE A/C COMPRESSOR. *TR",
        "vin": "SALFR24N58H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "04/29/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267775,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 LANDROVER LR2. THE VEHICLE (AUTOMATIC TRANSMISSION) WENT INTO REVERSE WHEN PUT IN DRIVE. THIS PROBLEM OCCURS INTERMITTENTLY. THE DEALERSHIP AND LANDROVER'S CORPORATE OFFICE WERE BOTH CONTACTED. THEY STATED THAT \"IT IS IMPOSSIBLE\" FOR THIS TO HAPPEN AND WILL NOT EVEN ALLOW A TECHNICIAN TO OPEN THE TRANSMISSION TO LOOK FOR THE CAUSE. THE IS A DANGEROUS SITUATION AND THE MANUFACTURER IS TAKING NO ACTION TO REMEDIATE OR INVESTIGATE THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2009",
        "dateOfIncident": "01/24/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258407,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING VEHICLE NORMALLY WITHOUT ANY SIGN OF A PROBLEM FOR ABOUT AN HOUR THEN PARKING FOR ABOUT 20MIN THE BATTERY WAS DEAD, UNABLE TO START BY JUMPING FROM SEVERAL LARGER VEHICLES. NO LIGHTS OR OTHER ACCESSORIES LEFT ON. FOLLOWING BEING TOWED TO THE DEALER TO HAVE THE BATTERY REPLACED, NO EXPLANATION FOR BATTERY FAILURE. IT WAS RETURNED TO US ON 1/26/08. THE VEHICLE THEN AGAIN STALLED IN THE STREET BACKING OUT OF THE DRIVEWAY. THIS OCCURRED LESS THAN 24 HOURS, ON 1/27/08, AFTER WE RECEIVED THE CAR BACK FROM THE DEALER. AGAIN TOWED TO DEALER WHO COULD NOT DIAGNOSE ANY PROBLEM, AND OFFERED NO EXPLANATION FOR THIS PROBLEM. DEALER STATED THE VEHICLE'S COMPUTER SYSTEM SHOWED NO FAULT CODES. *TR",
        "vin": "SALFP24N68H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "04/24/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241550,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LAND ROVER LR2 HAS A PROBLEM WITH OVERHEATING AND NON ACCELERATION.   *NJ  THE CONSUMER STATED THE VEHICLE BEGAN KNOCKING SLIGHTLY AFTER STARTING IT. AFTER DRIVING A FEW FEET, IT WOULD NOT ACCELERATE. THE REDUCED ENGINE PERFORMANCE LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER AND A DAY LATER, THE DEALER INFORMED THE CONSUMER THAT THE FUEL LINE WAS FAULTY. FOUR DAYS LATER, THE VEHICLE STOPPED ACCELERATING AND IT FELT AS THOUGH THE VEHICLE WAS IN NEUTRAL. THE CONSUMER LOOKED DOWN AND THE DYNAMIC STABILITY CONTROL LIGHT HAD ILLUMINATED. WHEN THE THIRD INCIDENT OCCURRED, THE CONSUMER PULLED OVER, BUT THE VEHICLE WOULD NOT SHUT OFF. THE REDUCED ENGINE LIGHT ILLUMINATED AGAIN AND THEN THE BATTERY LIGHT ILLUMINATED. THE STEERING WHEEL THEN LOCKED. *JB",
        "vin": "SALFP24N08H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "08/07/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240779,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST BRAND NEW LANDROVER LR2 HAD FAILED TO OPERATE WHILE DRIVING TWICE. BROUGHT INTO DEALERSHIP--TOLD ME TRANSMISSION FAILED AND GAVE ME ANOTHER NEW LR2. THIS SECOND LR2 HAS OVERHEATED TWICE (AGAIN, WHILE DRIVING). THE MOST RECENT EVENT OCCURRED WHILE DRIVING IN THE CITY AND SUDDENLY STARTED TO OVERHEAT WHILE DRIVING. I IMMEDIATELY DROPPED IT OFF AT THE DEALERSHIP WHICH WAS NEARBY AND SMOKE WAS COMING OUT OF THE HOOD. IT HAS BEEN IN THE SHOP FOR GOING ON TO FOUR WEEKS NOW. *TR",
        "vin": "SALFP24N38H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233668,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2008 LAND ROVER LR2, ABOUT 6 MONTHS AFTER THE PURCHASE I STARTED TO HAVE PROBLEMS TURNING THE CAR ON, THE ENGINE WOULD TURN BUT THE VEHICLE WOULDN'T START. I TOOK IT TO THE DEALERSHIP 4 TIMES (EACH TIME I LEFT THE CAR FROM 2 TO 4 DAYS IN THE DEALERSHIP) ONLY TO TELL ME (THE FOURTH TIME) THAT THE PROBLEM DIDN'T HAVE A FIX, THAT LAND ROVER WAS WORKING TO FIX THE PROBLEM AND I HAD TO WAIT UNTIL THEY FOUND ONE. SO NOW EVERY TIME I DRIVE MY CAR FOR ABOUT 30 MINUTES (TO THE MARKET, THE MOVIES, GAS STATION, ALMOST EVERYWHERE) THE CAR DOESN'T START, IT TAKES ABOUT 2 TO 5 MINUTES AND ABOUT 5 TRIES TO GET IT STARTED, IT DOES NOT SOUND LIKE MUCH, BUT AFTER IT HAPPENS 3 OR 4 TIMES A DAY IT BECOMES REALLY IRRITATING NOT TO MENTION THAT YOU HAVE AN UNRELIABLE $42K VEHICLE WITH ONLY 15K MILES.  *TR",
        "vin": "SALFS24N68H"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "01/05/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226032,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RIGHT FRONT DOOR OPENED ONE TIME WHILE DRIVING.  THE SAME DOOR HAS HAD ISSUES LATCHING DURING NORMAL DOOR CLOSING.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/27/2007",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210020,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS LESS THAN 5000 MILES AND HAS BEEN BACK TO THE LOCAL LAND ROVER DEALER NOW 3 TIMES FOR WHAT CAN BEST BE DESCRIBED AS A COMPLETE LACK OF ENGINE POWER, ALMOST AS IF IT IS BEING STARVED OF FUEL, ALWAYS MORE THAN 1/4 TANK WHEN THIS HAS OCCURRED.   THE FIRST TWO TRIPS TO THE DEALER FOR THIS PROBLEM WERE FOR A \"SOFTWARE UPDATE\" WHICH APPEARED TO CORRECT THE PROBLEM, UNTIL IT RESURFACES A FEW WEEKS OR A MONTH LATER.  ON THE MOST RESENT TRIP TO THE DEALER WE WERE INFORMED THAT THERE WAS SOME PROBLEM WITH THE RECEIVER IN THE DASHBOARD FOR THE ELECTRONIC KEY AND THAT THIS WAS NOW THE SOURCE OF THE PROBLEM.   *TR",
        "vin": "SALFP24N68H"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/24/2007",
        "dateOfIncident": "05/28/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209816,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LAND ROVER LR2 - OCCASIONALLY THE PARK ASSIST WILL NOT SOUND WHEN GEAR SELECTOR IS IN \"REVERSE\" POSITION-SINCE THE VEHICLE HAS BIG BLIND SPOTS, PARK ASSIST IS A MAJOR SAFETY FACTOR WHEN BACKING UP THE VEHICLE.  CURRENT SOLUTION IS TO RE-LOAD THE SOFTWARE, BUT THE PROBLEM COMES BACK IN A FEW WEEKS, REQUIRING ANOTHER TRIP TO THE DEALER TO RE-LOAD THE SAME DEFECTIVE SOFTWARE. THIS PROBLEM IS WELL DOCUMENTED ON LAND ROVER FORUMS (INCLUDING UK), OWNERS HAVE COMPLAINED ABOUT IT TO THE VARIOUS DEALERSHIPS, INCLUDING UK-NO PERMANENT FIX FROM LAND ROVER, EVEN THAT LR2 IS IN PRODUCTION FOR ABOUT 1 YEAR .  *TR",
        "vin": "SALFP24N78H"
    }
]