[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Lamborghini (Automobili Lamborghini)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269079,
        "products": [
            {
                "manufacturer": "Lamborghini (Automobili Lamborghini)",
                "productMake": "LAMBORGHINI",
                "productModel": "GALLARDO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY CAR THROUGH THE DRIVE-THRU AND IT WAS UNEXPECTEDLY VERY SLOW.  I GOT STUCK IN THE DRIVE-THRU FOR ABOUT 7 MINUTES WHILE THE ENGINE WAS RUNNING AND THE AC WAS BROWN AT MAX.  I WAS IN GEAR 1 AND WAS PULLING THE LEFT AND RIGHT PADDLE SHIFTERS TO SET TO NEUTRAL BECAUSE I PICKED UP FOOD FROM THE WINDOW AT IN-N-OUT BURGERS AND SUDDENLY THE CAR WAS JUST AUTOMATICALLY SHUT OFF COMPLETELY.  SO THE SHUT-DOWN OCCURRED RIGHT AT THAT MOMENT SO I DON'T KNOW IT HAD SET TO NEUTRAL PRIOR TO THE SHUT-OFF OR NOT.  IT'S IN A INDETERMINISTIC STATE.   ALL ELECTRICAL POWER WAS GONE.  PEOPLE HELPED PUSHING MY CAR OUT TO OF THE DRIVE-THRU TO PARK SAFELY.  I CHECKED AGAIN AND FOUND THAT ONLY THE RADIO WAS WORKING.  THIS CAR HAS NEVER BEEN CRASHED OR SALVAGED SO THERE IS NO REASON THAT IT BEHAVES LIKE THIS.  THE SOFTWARE MUST BE FAULTY.   PRIOR TO THIS INCIDENT, RADIO AND MUSIC CANNOT BE PLAYED WITHOUT INSERTING THE KEY.  AFTER THE INCIDENT, RADIO AND MUSIC CAN BE PLAYED WITHOUT INSERTING A KEY.  THIS IS INDICATIVE OF SOMETHING FAULTY.    I VERIFIED THE BATTERY WAS GOOD AND FULLY CHARGED, AND HAD GOOD CONTACT WITH THE CHASSIS. I CHECKED ALL THE FUSES AND THEY ALL WERE GOOD.    I'VE BEEN OWNING AND DRIVING MANY CARS IN MY 28 YEARS AND NEVER HAD EXPERIENCED ANY CAR SHUT-OFF IN THE MIDDLE OF THE DRIVE UNTIL THIS ONE.",
        "vin": "ZHWGU22T88L"
    }
]