[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN suspect brake actuator failure. Brake noise when stepping on pedal at a stop.",
        "vin": "JTJHW31U182"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2022",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2020 Had to replace transmission at 90,000 miles. In Sept. 2021 - Window seals are melting all over the windows.  Will have to get them all replaced as a driving hazzard to even see out the windows. Now the tinting is coming off from the windows sticking.",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/21/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446883,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Lexus RX350. The contact stated that while driving at 40 MPH, she saw smoke coming from the front passenger seat. There were no warning lights illuminated. The contact pulled into a parking lot and parked the vehicle until the smoke vanished. The dealer was notified of the failure and advised the contact that they could not assist. The manufacturer was notified of the failure and advised the contact that an agent of the  Federal Department of Agriculture would inspect the vehicle and would send them a report. The contact stated that the vehicle was taken to the same dealer and was inspected on February 10, 2021 by a Federal Department of Agriculture agent who also disconnected the heating system of the front passenger seat. The contact stated that the manufacturer had not followed up with her since then. The vehicle was not repaired. The failure mileage was approximately 160,691.",
        "vin": "JTJHK31U682"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442945,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 Lexus RX 400H Faulty ABS Actuator yes my car is available for inspection upon request . This is a known problem on this vehicle there is 100s of complaints on same issue with the same cars Lexus is neglecting responsibility for this faulty and very dangerous hazard , this part has been faulty for years with out my knowledge and now it’s gotten worse all the lights related to my brake system is on and the brakes seem to have a mind of there own they break real hard at times and times I have to slam on them to break . yes I have had the car checked and the dealer told me that there was a extended warranty issued on this part but that it’s expired. they also gave me a quote $2,100 just for the part no labor that’s crazy, this is not a extended warranty matter this should be recalled there is thousands of people driving this cars with out knowing that there breaks could give out anytime . I hope that Lexus considers the seriousness of this matter and not wait on till lives are lost do to neglecting. they took effort years ago in extending the warranty on the part but there is thousands of owners like my self that were not aware or notified of this extension , also this is a malfunction that is not noticeable and can happen at anytime especially while you driving .",
        "vin": "Jtjhw31u082"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430877,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "In 2020 entire dash sticky to touch, and cracking of dash 2021. VSC light on/off.",
        "vin": "2T2GK31U08C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Complete DASH board is cracked spanning from Drivers side to Passengers Side including Cracks on the AIRBAGS on both sides",
        "vin": "2t2hk31u98c"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423197,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS 350 RX. CONSUMER WRITES IN REGARDS TO A OIL LINE DEFECT.  THE CONSUMER STATED THE DEALER WOULD NOT REPAIR THE VEHICLE UNTIL IT EXHIBITED A FAILURE. THE OWNER SUSPECTED THE VEHICLE WOULD FAIL IN THE FUTURE. THE DEALER ADVISED THE CONSUMER TO PAY FOR THE REPAIRS.THE CONSUMER DECLINED.",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD FILED A COMPLAINT OVER MY LEXUS BRAKES BUT PUT IN THE INCORRECT VIN. MY COMPLAINT CODE IS 11413142 AND WAS ACCIDENTLY PUT UNDER MY TOYOTA HIGHLANDERS VIN",
        "vin": "JTJGW31U382"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALLED THE LOCAL DEALER WAS TOLD THEY CAN NOT HELP ME. I CALL THE LEXUS BRAND ENGAGEMENT CENTER LINE AND WAS CALLED BACK WITH AN EXPLANATION WHY MY VEHICLE IS NOT ELIGIBLE. EVEN THOUGH IT IA EXHIBITING THE MALFUNCTION. THE DEADLINE WAS DECEMBER 31,2020. THIS LAST REFUSAL TO DEAL WITH A PART THAT THEY ARE WELL AWARE IS MALFUNCTIONING DUE TO THEIR FAILURE TO BUILD A RELIABLE PRODUCT, AS THEY HAVE OFFERED THEIR OWN VERSION OF SATISFACTION FOR THOSE LUCKY ENOUGH TO HAVE THE FAILURE OCCUR TIMELY. MINE DID NOT KNOW IF THE TIMELY REQUIREMENTS AND OPTED TO MALFUNCTION LESS THAN A YEAR AFTER THE ESTABLISHED DEADLINE. HOWEVER, THE LETTER THEY SENT WENT TO THE PREVIOUS REGISTERED OWNER. AS A REGISTERED OWNER IN THE STATE OF FLORIDA, IT IS MY OPINION THAT LEXIS COULD HAVE EASILY LOCATED ME THROUGH THE HELP OF THE STATE OF FLORIDA REGISTRATION OFFICE. WHICH IS WHAT THEIR SITE STATES IS DONE. I PURCHASED THIS CAR JUNE 2020.    LEXUS/TOYOTA SHOULD HAVE TO FIX BECAUSE IT IS A KNOWN ISSUE THAT THEY SENT OUT CUSTOMER SUPPORT WARRANTY EXTENSIONS FOR PREVIOUSLY.  AS OF THIS WEEK MY VEHICLES BRAKING ABILITY HAS ONLY 10% OF WHAT IT HAD A MONTH AGO AND IS NO LONGER SAFE TO DRIVE! I HAVENT OWNED FOR A YEAR AS YET SMH! IT IS NOW PARKED IN MY GARAGE.",
        "vin": "JTJHW31U882"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "02/17/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399646,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX350 WAS PARKED IN GARAGE WITH ENGINE HOT. ONE MINUTE AFTER THE ENGINE STOPPED, IT CAUGHT ON FIRE AND REQUIRED THE FIRE DEPARTMENT TO FINALLY PUT IT OUT. ENGINE COMPARTMENT SO COMPLETELY DESTROYED THAT THE IMMEDIATE CAUSE OF THE FIRE NOT DETECTABLE. CAR IS TOTAL LOSS, GARAGE DAMAGED BUT NOT DESTROYED.MOST RECENT SERVICING WAS BY THE LEXUS DEALER THREE MONTHS PREVIOUS.",
        "vin": "JTJHK31U082"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390804,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING I WOULD HAVE ALL THE LIGHTS ON MY DASH COME ON WITH A DINGING SOUND AND WHEN I GO TO PRESS ON MY BRAKES VEHICLE WILL NOT STOP UNLESS I PRESS DOWN HARD ON THE BRAKE THIS IS REALLY DANGEROUS WILL CAUSE A DEADLY CRASH AND TO REPLACE THIS WILL COST 3000 DOLLARS THAT I DO NOT HAVE I REALL BELIEVE RX 400H HAVE A DEFEAT WITH THERE BRAKING SYSTEM.",
        "vin": "JTJGW31U382"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377120,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A VEHICLE FROM A DEALERSHIP IN ILLINOIS. DRIVING THE VEHICLE HOME TO MILWAUKEE, WISCONSIN THE HYBRID SYSTEM, TRACTION CONTROL SYSTEM, AND ALL WHEEL DRIVE SYSTEM ERROR LIGHTS WENT OFF AT ONCE. THE VEHICLE WENT INTO LIMP MODE IN THE MIDDLE OF THE LANE. I STRUGGLED TO MERGE OVER ONTO THE EMERGENCY LANE. I  INFORMED THE DEALERSHIP OF THE ISSUE, AND TOWED THE VEHICLE TO A LOCAL TOYOTA DEALERSHIP. THE LOCAL DEALERSHIP INFORMED US THAT NO CODES WERE SHOWING UP, AND TO PICK UP THE VEHICLE. WE PICKED THE VEHICLE UP, AND ON THE WAY HOME THE SAME WARNING SYSTEMS SHOWED AGAIN. I INFORMED THE DEALERSHIP I WANTED A REFUND, AND NOW THEY'RE PLAYING GAMES. WHEN GETTING HOME, AND CHECKING THE VIN TO MAYBE SEE IF THERE WAS ANY SAFETY RECALLS ON THE VEHICLE. IT'S SHOWING AS A SALVAGED VEHICLE.",
        "vin": "JTJHW31UX82"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366317,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS CRACKING AND EXPOSING FOAM UNDERNEATH.  CONCERN THAT PIECES WILL CONTINUE TO FALL OFF AND TAPING OR COVERING THE DASHBOARD MAY INTERFERE WITH AIRBAG DEPLOYMENT.",
        "vin": "2T2HK31U18C"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353491,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS DETERIORATING OMITTING GASES, AND CAUSING GLARE ON INTERIOR WINDSHIELD. EXTREMELY UNSAFE TO DRIVE ESPECIALLY IF RAINING.",
        "vin": "2T2GK31U78C"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CHECK ENGINE, CAR SKID LINES WONT SHUT OFF. ENGINE STALLS WHILE DRIVING  WHEN CAR IS STOPPED TRIED TO TURN OFF LIGHTS. WOULD NOT GO OUT. NOT FLASHING LIGHTSS ON DASHBOARD. STABLE LIGHT NOT GOING OUT.",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY TOOK MY NEWLY BAUGHT 2008 LEXUS RX 350 IN AT A LEXUS DEALERSHIP FOR ROUTINE MAINTENANCE. I DIDN'T NOTICE AND STEERING ISSUES OR LEAKS BUT WAS TOLD I NEEDED A NEW RACK AND PINION. SINCE ITS LEXUS DEALERSHIP I RESPECT THEIR INSPECTION AND RECOMMENDATION...BUT LIKE MANY OTHERS...IT TURNS OUT THE RACK AND PINION ON THE RX 350 IS COMMON ( TOO COMMON  ) AND I HAVE READ MANY PEOPLE WRITING A COMPLAINT TO NHTSA. I DON'T SEE ANY RESOLUTION OR EXPLANATION TO THE \" SAME \" COMPLAINTS. I ALSO HAVE TO PAY $1,800 + AND AM SUPPOSED TO PICK UP MY RX350 JULY 7 OR 8TH, 2020. THE RACK AND PINION IS OBVIOUSLY A HUGE SAFETY ISSUE... SO I ECHO EVERYONE ELSE. WHY IS THE MANUFACTURER/ DEALERSHIP NOT GIVING US ANSWERS AS TO WHY THIS IS AN ONGOING ISSUE. I FOUND THIS OUT BY RESEARCHING ONLINE. THEY SURE ARE QUICK TO TAKE THE $1800+. GOOD MONEY MAKER DON'T YOU THINK. ALL I'M SAYING IS, IF IT NEEDS REPLACED THEN YES OF COURSE I'LL REPLACE IT AND I'LL TRY TO SOMEHOW FIND THE MONEY TO DO SO... BUT IF THIS HAS BEEN ONGOING FOR YEARS ON THE RX350... WHY AM I AND MANY OTHERS COUGHING UP MONEY THAT I HONESTLY DONT HAVE !! TO REPLACE THE RACK AND PINION ?  I JUST CAME IN FOR AN OIL CHANGE AND 100,000 MILE OVERALL ROUTINE INSPECTION. STEERING FELT GOOD. NO LEAKS NOTED IN MY GARAGE FLOOR...OTHER THEN AC RESIDUAL FLUID WHICH OF COURSE IS NORMAL.",
        "vin": "2T2HK31UX8C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329818,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 3RD, 2020 I GOT MY 2008 LEXUS RX 350 SERVICED FOR 115,000 MILE SERVICE AT JOHNSON LEXUS OF RALEIGH. I HAVE HAD MY CAR SERVICED RELIGIOUSLY AT THE SAME DEALER SINCE I BOUGHT IT BRAND NEW IN 2008. IT COST ABOUT $250, ON JUNE 13TH  I NOTICED LARGE AMOUNT OF ENGINE OIL UNDER THE CAR. THE CAR HAD NOT BEEN DRIVEN MORE THAN 50 MILES AFTER SERVICE. THE ENGINE HAD A STRANGE SOUND. I CHECKED THE OIL LEVEL IN THE ENGINE AND THERE WAS NO OIL AT ALL.THERE WERE NO WARNING LIGHTS ON THE DASH. I HAD THE CAR TOWED TO THE DEALER AT MY OWN EXPENSE. THE SERVICE ADVISOR AT THE LEXUS DEALER INFORMED ME THAT THE \"ENGINE OIL COOLER PIPE\" HAD BURST AND IT WOULD COST AROUND $500 FOR REPAIRS. HE EMPHASIZED THAT THE DEFECT WAS NOT RELATED TO THE SERVICE. ON FURTHER RESEARCH ON THE INTERNET, I FOUND THE \"SB-10056509-3341\" SERVICE BULLETIN WHICH ACKNOWLEDGED THE DEFECT IN THE PART AND PROVIDED ENHANCED WARRANTY. UNFORTUNATELY IT DID NOT APPLY TO ME SINCE THE CAR HAD BEEN PURCHASED MORE THAN 10 YEARS AGO EVEN THOUGH IT WAS WELL WITHIN THE 150,000 MILE LIMIT. IF THE OIL HAD LEAKED ON THE HIGHWAY, THE VEHICLE WOULD HAVE STALLED ON THE HIGHWAY RISKING A SERIOUS ACCIDENT.  *TR",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329280,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE AND PUSHED ON BRAKE PEDAL TO STOP AT RED LIGHT. WHAT I NOTICED THAT BRAKE, ABS, TRACTION, CHECK ENGINE AND MORE WARNING LIGHTS CAME ON IN THE DASHBOARD AND I ALMOST REAR ENDED CAR IN FRONT OF ME DUE TO NO BRAKES. PEDAL WENT TO THE FLOOR, SLOWLY I DROVE MY CAR TO BP WORKSHOP ON LIBERTY ROAD RANDLESTOWN MD, 21133 FIRST. LATER I DROVE TO A&B AUTOBODY 901 DUNDALK AVE BALTIMORE MD 21224. FOR THE REPAIR. AFTER 2DAYS, TECH CALLED AND TOLD ME THAT MY CAR NEEDS BRAKE ACTUATOR WHICH IS ALMOST $2000.00 PARTS AND LABOR. RIDICULOUS. TECH TOLD ME ITS COMMON PROBLEM WITH THESE VEHICLES. I CALLED LEXUS OF TOWSON AND THEY  TOLD ME THAT WE WOULD'VE GOT IT DONE FOR FREE OF CHARGE IF THE VEHICLE WAS SOLD AT OUR DEALERSHIP. I GUESS DEALERS DO RECALLS ONLY ON THOSE CARS THAT ARE SOLD THRU THEM BUT I'VE BOUGHT IT USED. I DON'T HAVE THIS MUCH MONEY TO FIX MY [XXX] TRUCK. PLEASE HELP ME TO GET MY CAR BACK ON THE ROAD. THANKS  *TR    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JTJHW31U382"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325398,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BY AN OIL CHANGE SERVICE THAT I HAD AN OIL LEAK.  I DID NOT DRIVE MY VEHICLE AND HAD TO WAIT OVER THE WEEKEND TO GET IT INTO A SHOP.  THE SHOP TOLD ME THAT MY RUBBER OIL COOLER PIPE WAS LEAKING AND IT WAS A BAD LEAK. I CANNOT DRIVE IT.  I HAD IT TOWED TO TOYOTA TO LOOK AT IT SINCE THE CLOSETS LEXUS DEALER IS 2 HOURS AWAY.  THE TOYOTA DEALER INFORMS ME THAT THE OIL COOLER PIPE IS LEAKING AND NEEDS TO BE REPLACED.  THROUGH RESEARCH AND A TIP FROM THE FIRST AUTO SHOP THAT THERE IS A LIMITED-SERVICE CAMPAIGN FOR THIS DEFECTIVE PART AND LEXUS EVEN EXTENDED THE CAMPAIGN THROUGH DECEMBER 2021.  I AM RELIEVED THAT IT WILL BE COVERED JUST AS IT SHOULD BY LEXUS.  I GET A CALL FROM LEXUS THEY ARE NOT COVERING IT, BECAUSE MY VIN IS NOT INCLUDED IN THE EXTENSION OF THE CAMPAIGN,  EVEN THOUGH, MY CAR HAS THE DEFECTIVE PART.  MY CAR IS PART OF THAT MANUFACTURING LINE THAT HAD THE DEFECTIVE PART PUT IN.  PLEASE HAVE LEXUS EXPAND THEIR VEHICLES TO INCLUDE ALL 07-08 LEXUS RX 350'S FOR THE LIMITED-SERVICE CAMPAIGN AS IT IS STILL A PROBLEM IN THOSE VEHICLES REGARDLESS OF THE VIN.  THAT IS WHY THEY GAVE THE EXTENSION OF THE LIMITED-SERVICE-CAMPAIGN BECAUSE LEXUS AND TOYOTA KNOW IT IS STILL A PROBLEM FOR LEXUS AND TOYOTA OWNERS.    IF THE RUBBER HOSE IS NOT REPLACED IT COULD CAUSE THE HOSE TO BREAK AND CAUSE ENGINE FAILURE AND DAMAGE OR CAUSE THE ENGINE TO CEASE AND CAUSE A MAJOR ACCIDENT.  THIS NEEDS TO BE ADDRESSED IMMEDIATELY BY LEXUS.  THUS, I AM REQUESTING THAT LEXUS AND TOYOTA NEED TO REPLACE ANY RUBBER HOSES WITH THE METAL ONES AT NO COST TO THE CUSTOMER. THANK YOU.  *TR",
        "vin": "2T2HK31U48C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322809,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE ACTUATOR HAS MALFUNCTIONED. LEXUS HAS VERIFIED THIS HAS HAPPENED TO MY VEHICLE THIS WEEK. THEY HAVE DECLINED ANY ASSISTANCE, INCLUDING REPLACEMENT OF THE PART AND LABOR, PROVIDING ME THE PART TO REPLACE MYSELF (AT NO  COST FOR THE PART), AND EVEN REFUSE TO SELL ME THE PART AT THEIR MANUFACTURED COST BASIS. THIS LAST REFUSAL TO DEAL WITH A PART THAT THEY ARE WELL AWARE IS MALFUNCTIONING DUE TO THEIR FAILURE TO BUILD A RELIABLE PRODUCT, AS THEY HAVE OFFERED THEIR OWN VERSION OF SATISFACTION FOR THOSE LUCKY ENOUGH TO HAVE THE FAILURE OCCUR TIMELY. MINE DID NOT KNOW IF THE TIMELY REQUIREMENTS AND OPTED TO MALFUNCTION LESS THAN A YEAR AFTER THE ESTABLISHED DEADLINE. HOWEVER, THE LETTER THEY SENT WENT TO THE PREVIOUS REGISTERED OWNER AND LEXUS EXPLAINED TO ME THAT I SHOULD HAVE CONTACTED THEM WHEN I PURCHASED THIS VEHICLE. I DO NOT AGREE. AS A REGISTERED OWNER IN THE STATE IF TEXAS, IT IS MY OPINION THAT LEXIS COULD HAVE EASILY LOCATED ME THROUGH THE HELP OF THE STATE IF TEXAS REGISTRATION REQUIREMENT. LEXUS SHOULD HAVE TO FIX ITEMS THEY BUILT WITH POOR DESIGNS OR WORKMANSHIP! AS IF THIS WEEK MY VEHICLES BRAKING ABILITY HAS ONLY 10% OF WHAT IT HAD A MONTH AGO AND IS NO LONGER SAFE TO DRIVE!",
        "vin": "JTJHW31U082"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE PEDAL GOES TO THE FLOOR DUE TO THE ABS ACTUATOR DEFECTS.   I HAVE VIDEO OF THE SOUND AND BEHAVIORS WHEN THE PROBLEM OCCURS.   I HAVE NOT BEEN ABLE TO DRIVE THE VEHICLE AND THE DEALER WILL NOT FIX THE PROBLEM.   THE BRAKES DIDN'T WORK,  DIDN'T STOP THE VEHICLE UPON MY LAST USE OF THE CAR.  THE VEHICLE DASHBOARD GIVES WARNING AND ERROR CODES RELATED TO THE BRAKES,  EMERGENCY BRAKE,  ABS, VSC, ETC. I HAVE WRITTEN LEXUS FOR ANY ASSISTANCE.   I PURCHASED THE VEHICLE IN MARYLAND FROM A USED CAR DEALER WHO CLEARED THE CODES BEFORE OBTAINING THE SAFETY INSPECTION.   HOWEVER IF THIS CAR WERE STARTED OR IF THE BRAKE PEDAL WAS TESTED,  THE VEHICLE WOULD HAVE FAILED.   AS WAS THE CASE WHEN I OBTAINED MY OWN SAFETY INSPECTION ON THE VEHICLE WHICH IT NOW FAILED",
        "vin": "JTJHW31U082"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CRACKED DASHBOARD OR A MELTED DASHBOARD WITH GLAZED STICKINESS AND SHINY.I HAVE A HARD TIME SEEING THE ROAD THROUGH THE REFLECTION ON THE WINDSHIELD.",
        "vin": "JTJGK31U180"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291474,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX400H: ALL WARNING LIGHTS AND BUZZER CAME ON UNEXPECTEDLY. BRAKE LOST INTEGRITY, HAVE TO PRESS HARDER ON BRAKES FOR THEM TO WORK. DOES NOT FEEL SAFE TO DRIVE AS I DO NOT WANT TO INJURE OR KILL ANYONE. RAN DIAGNOSTIC AND ERROR CODES C1256 AND C1365 CAME UP. THESE CODES POINT TO THE BRAKE ACCUMULATOR FAILURE. REPAIR IS QUOTED AT $3200 BY TOYOTA DEALER. AFTER RESEARCHING THIS IS A VERY COMMON SAFETY ISSUES WITH TOYOTA VEHICLES. MY BROTHERS PRIUS HAS THE SAME ISSUE. I FOUND OUT THERE WAS POSSIBLE A RECALL/EXTENDED WARRANTY BUT IT HAS ENDED A FEW MONTHS AGO. I DO NOT KNOW WHY THIS IS NOT A STANDING SAFETY RECALL AS IT IS EXTREMELY DANGEROUS.  FROM MY RESEARCH AND REPORTS FROM PERSONAL ACQUAINTANCES IT IS VERY APPARENT THAT IS AN ONGOING ISSUE. I CAN NOT DRIVE MY VEHICLE OR JUSTIFY SPENDING $3200 FIXING A KNOW SAFETY DEFECT.",
        "vin": "JTJHW31U682"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290079,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE AUTOMATIC TRUNK DOOR CLOSED DOWN ON A FAMILY MEMBER WITHOUT WARNING. THERE WAS NO INJURY. THE FAILURE OCCURRED SEVERAL TIMES WITH THE TRUNK DOOR AUTOMATICALLY CLOSING WITHOUT WARNING. THE CONTACT SCHEDULED A DIAGNOSTIC APPOINTMENT AT LEXUS OF RICHMOND (703 MIDLOTHIAN TURNPIKE, RICHMOND, VA 23235, (804) 323-8000). THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 109,000.",
        "vin": "2T2HK31UX8C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289797,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS BREAKING DOWN (MELTING) CAUSING IT TO BE EXTREMELY SHINY AND STICKY. AS WELL AS OMITTING A GAS WHICH HAS CAUSED A SEVERE GLARE ON THE INSIDE OF THE WINDSHIELD.  THIS HAS MADE IT EXTREMELY DIFFICULT AND UNSAFE TO DRIVE AT NIGHT.  LEXUS HAD MY VEHICLE IN SEPTEMBER OF 2016 TO FIX AN OIL HOSE RECALL AND PURPOSELY DID NOT MAKE ME AWARE OF THE FAULTY DASHBOARD ISSUE,( SAID THEY DIDN'T HAVE TO) THEREFORE, I MISSED THE WINDOW TO HAVE THIS REPAIRED AT THEIR EXPENSE.  LEXUS REFUSES TO MAKE THIS ISSUE A RECALL WHICH HAS AFFECTED THOUSANDS OF VEHICLES.",
        "vin": "2T2GK31U78C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280999,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS EXPERIENCING SYMPTOMS EXACTLY AS DESCRIBED IN THE INVERTER MODULE RECALL, WHEREBY AFTER HIGHWAY DRIVING, THE ELECTRIC MOTOR WILL FAIL RANDOMLY, TRIPPING ALL DASHBOARD FAILURE LIGHTS, AND PUTTING THE VEHICLE IN \"LIMP\" MODE, WHERE IT EITHER SLOWS SIGNIFICANTLY OR STOPS, AND THEN THUS POSES GREAT SAFETY RISK WITH SURROUNDING TRAFFIC.",
        "vin": "JTJGW31UX82"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279057,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO CONTINUOUS ISSUES WITH MY VEHICLE SINCE I BECAME THE OWNER OF IT.  #1 THE HEADLAMP GETS VERY FOGGY.  EVERY 2-3 MONTHS I TAKE IT TO THE CAR WASH, THEY POP IT OUT AND CLEAN IT.  I GET THIS DONE BECAUSE THE LAMP LOOKS VERY DIM WHILE I AM DRIVING IT AT NIGHT AND IT MAKES IT DIFFICULT TO SEE THE ROAD.  THIS IS A SAFETY ISSUE.  THE SECOND ISSUE IS THAT THE DASHBOARD IS HEAVILY CRACKED TO THE POINT WHERE MY SON IS ABLE TO PICK OFF PIECES AND TRIES TO PUT IT IN HIS MOUTH.  I AM AFRAID OF WHAT TOXIC CHEMICALS THE CRACKED DASHBOARD IS EXPOSING ME AND MY CHILD TO.  I CALLED LEXUS TO GET THESE REPAIRED UNDER THE WARRANTY ENHANCEMENT PROGRAM AND THEY TOLD ME THAT BOTH OF THESE ARE NOW 1 YEAR PAST THE WARRANTY.  I HAVE BEEN THE OWNER OF THIS CAR SINCE 2017 AND I NEVER GOT NOTICE OF EITHER OF THESE WARRANTY ENHANCEMENTS.  BEFORE THAT MY DAD OWNED IT AND HE ALSO NEVER RECEIVED NOTICE. I HAVE FILED A CASE # WITH LEXUS [XXX].  THEY NOW TELL ME THERE IS NOTHING THEY CAN DO AND I WILL HAVE TO PAY OUT OF POCKET FOR ISSUES THAT HAVE BEEN EXISTING FOR THE LAST 4-5 YEARS!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T2GK31U48C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268182,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEXUS OF BELLEVUE SERVICE DEPARTMENT (IN BELLEVUE, WA) COMPLETED A ROUTINE OIL CHANGE ON MY 2008 LEXUS RX 350 AND THEN TOLD ME THEY DISCOVERED A GASKET POWER STEERING FLUID LEAKAGE ON PASSENGER SIDE POWER STEERING RACK AND THAT THIS IS A CRITICAL SAFETY ISSUE THAT WOULD REQUIRE A COMPLETE REPLACEMENT OF POWER STEERING RACK AND GASKETS.  THIS WAS COMPLETED AND COST ME $1,874.93 (AFTER APPLYING A LEXUS SERVICE CREDIT FOR $237.99) - SO IT ACTUALLY COST ME $2,112.92.  AS THIS LUXURY CAR ONLY HAD 71,604 MILES ON THE ODOMETER, I WANTED TO SEE IF THIS WAS A COMMON ISSUE/DEFECT WITH THIS CAR TYPE.  I FOUND NUMEROUS COMPLAINTS REGARDING THIS SAFETY DEFECT WHICH COULD POTENTIALLY CAUSE CATASTROPHIC STEERING FAILURES. SEE: [HTTP://WWW.CARPROBLEMZOO.COM/LEXUS/RX350/STEERING-RACK-AND-PINION-PROBLEMS.PHP] [HTTPS://WWW.CLUBLEXUS.COM/FORUMS/RX-2ND-GEN-2004-2009/768754-POWER-STEERING-LEAK.HTML]  I ASK THE NHTSA TO CONDUCT A FORMAL INVESTIGATION OF THIS DEFECT IN LEXUS RX 350'S SO THAT A RECALL COULD BE MADE ON THIS VEHICLE, AND SO THAT THOSE WHO HAVE ALREADY PERFORMED THE REPLACEMENTS WOULD BE REIMBURSED BY LEXUS CORPORATE.  THANK YOU.",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "09/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE REVERSING, THE VEHICLE SPONTANEOUSLY ACCELERATED AND CRASHED INTO THREE TREES. THE STEERING WHEEL BECAME UNCONTROLLABLE/INOPERABLE AND THE BRAKE PEDAL WAS APPLIED, BUT TRAVELED TO THE FLOORBOARD. THE CONTACT TURNED OFF THE IGNITION TO STOP THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THERE WERE NO INJURIES. THE POLICE DEPARTMENT ARRIVED, BUT A REPORT WAS FILED 3 DAYS LATER. THE AIR BAGS DID NOT DEPLOY. THE LOCAL DEALER WAS NOT CONTACTED. THE  VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: [XXX]. THE MANUFACTURER INSPECTED THE VEHICLE AND STATED COMPONENTS WERE WORKING PROPERLY AND CONSUMER MADE NO ATTEMPT TO STOP OR STEER. THE VEHICLE WAS UNABLE TO BE DRIVEN. THE FAILURE MILEAGE WAS 103,000. VEHICLE ALSO CRASHED INTO 1 CAR.*PM  CONSUMER'S INSURANCE COMPANY STATED CAR WAS TOTALED.    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "JTJGK31U380"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266912,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VVT-I RUBBER OIL LINE RUPTURED LEAKING ALL 6 QUARTS OF OIL OUT OF ENGINE, CAUSING CATASTROPHIC ENGINE DAMAGE WHILE DRIVING IN 2008 LEXUS RX350  TOYOTA SHOULD HAVE NEVER PUT A RUBBER HOSE ON AN OIL LINE WITH 80PSI AND THEY SHOULD HAVE ISSUED A RECALL. THE LEXUS DEALER HAS NEVER ADVISED ME OF POTENTIAL PROBLEM. THEY SHOULD HAVE TO REPAIR MY ENGINE.  FURIOUS AT TOYOTA FOR CUTTING COSTS!",
        "vin": "2T2GK31U98C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259080,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE ENTIRE DASHBOARD WAS CRACKING FROM THE DRIVER'S SIDE TO THE PASSENGER SIDE. THE VEHICLE WAS TAKEN TO LEXUS OF WICHITA (1555 N GREENWICH RD, WICHITA, KS 67206, (316) 779-2606) WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS COSMETIC; THEREFORE, IT WOULD NOT BE REPAIRED FOR FREE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243658,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX. CONSUMER WRITES IN REGARDS TO DETERIORATING DASH BOARD. *LD  *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243230,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK WHILE DRIVING - ENGINE OIL COOLING PIPE  TECHNICAL SERVICE BULLETIN #L-SB-0154-11  TECHNICAL SERVICE BULLETIN# ZLC  TECHNICAL SERVICE BULLETIN # POL14-02",
        "vin": "JTJHK31U582"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL COOLER LINE MALFUNCTIONED. MAJOR OIL LEAK, TOWED VEHICLE TO MECHANIC. HOPEFULLY NO ENGINE DAMAGE. THIS WAS REPLACED BY LEXUS DEALER IN 09, THEY USED A RUBBER HOSE ASSEMBLY INSTEAD OF THE NEW METAL PIPE REDESIGN.",
        "vin": "2T2HK31U88C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242143,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG/SEATBELT PASSENGER LIGHT WARNING IS ON AND NOT FUNCTIONAL. TIRE LIGHT WARNING IS ALSO ON AND COULD NOT BE RESET.",
        "vin": "2T2HK31U98C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235202,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "3.5 L ENGINE HAS PROBLEMS WITH OIL COOLING PIPE/HOSE. IT LEAKS OIL EVERY 4 TO 5 YEARS. DANGER IS EMPTYING THE MOTOR OIL WITHOUT NOTICE. ONE CAN EASILY BURN THE ENGINE IF GONE UNNOTICED.  AND GET STRANDED ANYWHERE WITHOUT WARNING.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MASSIVE CATASTROPHIC OIL LEAK. NOTICED HOT OIL SMELL. NO OIL ON DIPSTICK. OIL SPRAYING OUT AT BOTTOM OF ENGINE, RIGHT FRONT. CAR TOWED TO SHOP. OIL HOSE BETWEEN COOLER AND FILTER BURST. KNOWN PROBLEM. TOYOTA/LEXUS HAS MADE AN UPGRADED PART BUT NOT NOTIFIED MOST OWNERS AND WILL NOT REPLACE UNTIL IT FAILS. WHEN IT FAILS CAR CAN CATCH FIRE AND SEVERE ENGINE DAMAGE RESULTS. MANY VIDEOS AND REPORTS ON THE INTERNET AS THIS IS A WIDESPREAD PROBLEM.",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEATBELT GETTING TIGHT.  IT IS HARD TO PULL OUT AND HARD TO WITHDRAW.",
        "vin": "JTJGK31U989"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163703,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD I NEED A NEW RACK & PINON DUE TO LEAKAGE WITH LESS THAN 92,000 MILES ON THE VEHICLE.  I BOUGHT THE CAR USED JUST 2 YEARS AGO AND HAD ALL REGULAR MAINTENANCE RECORDS FROM PREVIOUS OWNER & DEALER SERVICE.  HAVE HAD REGULAR SERVICE SINCE PURCHASING IT - WHICH IS HOW ISSUE WAS DISCOVERED.  WILL COST OVER $1500 TO REPAIR.  UPON DOING SOME INVESTIGATION ON-LINE, I SEE I AM NOT THE ONLY OWNER EXPERIENCING THIS IN UNDER 100,000 MILEAGES.",
        "vin": "2T2HK31U58C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "09/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154797,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE DRIVING 65 MPH, THE OIL COOLER LINE BURST AND ALL THE OIL LEAKED OUT. THE VEHICLE WAS TOWED TO THE CONTACT'S HOME WHERE HE REPLACED THE OIL COOLER LINE HIMSELF. THE CONTACT FOUND THERE WAS INTERNAL ENGINE DAMAGE AND A HOLE IN THE BOTTOM OF THE ENGINE. THE DEALER AND THE MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OIL LINE BURST ON MY LEXUS RX 350 SUV AND CAUSED SEVERE ENGINE DAMAGE AS A RESULT. THIS IS A VERY LARGE LEAK WHICH COVERS THE GROUND, ENGINE, AND UNDERCARRIAGE. IF THE OIL LINE RUPTURES WHILE DRIVING, THE LOW ENGINE OIL MESSAGE AND ENGINE OIL PRESSURE WARNINGS WILL ILLUMINATE (WHICH IT DID NOT, NO WARNING, NO ILLUMINATION OF LIGHTS) AND WILL RESULT IN COMPLETE ENGINE FAILURE DUE TO OIL STARVATION.THERE WAS NO WARNING LIGHTS AHEAD OF TIME AND THEN ALL THE WARNING LIGHTS WENT OFF AT THE SAME TIME WHEN I CAME OUT OF THE STORE TO START THE CAR, AND IT WAS TOWED IMMEDIATELY TO A SERVICE CENTER AND WAS NOT DRIVEN WHEN THE PANEL LITE UP (THE WHOLE PANEL ILLUMINATED WITH WARNINGS IN EVERY CATEGORY WITH NO WARNING TO INCLUDE TIRE PRESSURE, OIL LIGHT, ENGINE LIGHT, BATTERY LIGHT, AIR BAG, SRS, MASTER LIGHT, BRAKE LIGHT, POWER STEERING LIGHT, ELECTRIC CHARGING SYSTEM LIGHT). THE CAR HAS NO DAMAGE TO THE UNDERCARRIAGE INDICATING THIS COULD NOT BE THE CAUSE. THE MECHANIC REPORTS A DEFECT IN THE OIL LINE/PUMP, IT CRACKED AND SHOULD NOT HAVE. THEY ARE REPORTING A VERY LARGE LEAK THAT WOULD HAVE OCCURRED THUS DAMAGING THE ENTIRE ENGINE VERY QUICKLY. WITH A RUPTURE OF THIS MAGNITUDE NO OIL TO THE ENGINE, THE ENGINE WILL BE IRREPARABLY DAMAGED, YOU CANNOT JUST REPLACE . YOU CANNOT REPAIR SUCH A MASSIVE OIL LEAK WITHOUT WARNING BECAUSE THE DAMAGE CAN BE DONE IMMEDIATELY WITH SUCH A SEVERE LOSS SO SUDDENLY. I NEVER RECEIVED A RECALL NOTICE REGARDING THIS ISSUE. THE ONLY WAY TO FIX IT IS TO REPLACE THE ENGINE. THIS IS A CATASTROPHE ON A CAR THAT IS IN PERFECT CONDITION, WELL MAINTAINED FOR ALL SERVICES WITH ONLY 77,000 MILES ON IT. VEHICLE WAS STATIONARY",
        "vin": "2T2HK31U18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142279,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A WINING SOUND COMING FROM UNDER THE HOOD.  WHEN I STARTED MY SUV UP IN THE MORNING THERE WAS A LOUD WINING SOUND.  THE SOUND LOWERED AS THE CAR WARMED UP, NUT WHEN I PUT THE CARE IN DRIVE AND ACCELERATED THE NOUS BECAME LOUDER.  I TOOK MY CAR IN TO THE DEALER THEY SAID IT HAS THE POWER STEERING SO I HAD THEM REPLACE THE POWER STEERING PUMP.  BUT BEFORE THEY RETURNED THE CAR TO ME THEY CALLED ME AND SAID THE NOISE WAS STILL THERE AND THAT I NOW NEEDED A TRANSMISSION OVERHAUL. AT 120,000 MILES THIS SHOULD NOT BE HAPPENING. I WAS TOLD THAT THEY COULD CLEAN THE TRANSMISSION OIL MOTOR PAN AND THAT COULD STOP THE NOISE FOR NOW. THE DEALER CLEANED OIL PAN AND THE NOISE STOPPED.  I AND TOLD THAT THIS IS A TEMPORARY FIX AND THAT I WILL NEED A NEW TRANSMISSION SOON.  I THINK IF THIS IS HAPPENING TO OTHERS THAT THERE SHOULD BE A RECALL ON THE TRANSMISSION OF THE 2008 RX 350.",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2018",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIFTGATE HANDLE MELTING WHEN CAR IS OPERATIONAL. HOT TO THE TOUCH. HAVE READ THIS HAS HAPPENED TO MULTIPLE LEXUS/TOYOTA MODELS.",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASHBOARD HAS A SERIOUS CRACKING ISSUE. IT IS ALSO STICKING AND IS MELTING CAUSED BY HEAT. I WAS NEVER NOTIFIED THAT THERE WAS A RECALL AND REPLACEMENT ON THE DASHBOARD. ONCE I RESEARCHED THE DASHBOARD ISSUE ONLINE I CONTACTED LEXUS ON JUNE 01, 2017. THE TOLD ME THAT SINCE IT WAS NOT A SAFETY ISSUE AND IT WAS ONLY COSMETIC ISSUE THAT BY LAW THEY DID NOT HAVE TO NOTIFY ME. I THINK THIS IS VERY UNFAIR.",
        "vin": "2T2GK31U78C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE DRIVING 65 MPH, THE HEADLIGHTS FAILED AND IMPAIRED THE DRIVER'S VISION. THE HEADLIGHT WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO LEXUS OF CHERRY HILL (1230 ROUTE 73 SOUTH, MOUNT LAUREL, NJ 08054, (856) 393-4583) WHERE THE FAILURE WAS DIAGNOSED, BUT THE CONTACT WAS UNAWARE OF THE DIAGNOSIS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 117,000.",
        "vin": "2T2HK31U98C"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112800,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT IN THE BACK PASSENGER SIDE NOT WORKING.   CRACKED DASH BOARD.",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE DASHBOARD WAS CRACKED ON THE FRONT PASSENGER SIDE OF THE VEHICLE. THE CONTACT ALSO STATED THAT THE REAR PASSENGER SEAT BELT UNBUCKLED WITHOUT WARNING. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 89,000. *DT  UPDATED 12/18/18*JB",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112447,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REGULARLY MAINTAINED MY LEXUS RX AT AN INDEPENDENT LEXUS SHOP. WHILE THE CAR WAS PARKED/RUNNING, THE ENGINE SUDDENLY, WITHOUT ANY WARNING NOISE OR DASHBOARD ALERT, STOPPED.  AFTER THE CAR FAILED TO RESTART, I SUSPECTED IT NEEDED A BATTERY JUMP. HOWEVER AFTER REPLACING THE BATTERY, THE CAR STILL DID NOT START.  THE CAR WAS TOWED TO AN INDEPENDENT LEXUS SHOP-DAVENPORT, WHERE IT WAS DISCOVERED THAT VALVE SPRINGS HAD DROPPED AND CAUSED THE ENGINE TO SEIZE/LOCK.  THE SHOP NOTIFIED ME THAT I WOULD NEED TO EITHER GET A NEW ENGINE OR HAVE IT REPAIRED, BOTH OPTIONS WOULD COST >$8500USD.  THIS IS UPSETTING BECAUSE MY CAR WAS WELL MAINTAINED, THERE WERE NO WARNINGS, AND IF THIS HAD HAPPENED WHILE DRIVING IT COULD HAVE CAUSED AN ACCIDENT OR LEFT ME TOTALLY STRANDED.",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "05/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104064,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2008 LEXUS RX 350 FROM A ONE OWNER.  ONLY 122,000 MILES, GARAGED KEPT AND EXTREMELY CLEAN.  UPON TAKING THE CAR OVER AND BRINGING IT HOME.  I REMOVED THE ENGINE SPLASH GUARD TO GET A BETTER LOOK AT THE UNDERNEATH.  REMOVED THE SPLASH GUARD AND WOUND THAT THE RACK/PINION WHICH IS COVERED BY THE SPLASH GUARD HAD ONE BOOT TOTALLY BUSTED AND THE OTHER (DRIVER SIDE) LEAKING.  AFTER LOOKING ONLINE TO FIND OUT MORE ABOUT THIS.  I FIND THAT THERE ARE HUNDREDS, MAYBE THOUSANDS OF OTHERS WHO HAVE THE SAME ISSUE.  LEXUS SHOULD BE RESPONSIBLE FOR THIS.  WE'VE DRIVEN TOYOTA FOR OVER 25 YEARS.  THIS IS OUR FIRST UPGRADE TO THE TOYOTA BRAND.  THIS LEXUS WAS \"BABIED\" AND THAT WAS MY MAIN REASON TO BUY IT.  I TOO \"BABY' ALL OUR CARS AS WE KEEP THEM FOR AT LEAST 10 YEARS.  I'VE TAKEN THE LEXUS TO MY ASE MECHANIC THAT I'VE USED FOR 30 YEARS.  HE IS GOING TO REPLACE THE RACK.  MY TOYOTA HIGHLANDER THAT I SOLD HAD 360.000 MILES.  NEVER A STEERING OR \"BOOT\" ISSUE..... MY FIRST EXPERIENCE WITH LEXUS AND SO FAR....NOT GOOD.  I WILL KEEP THIS CAR AND HAVE MY MECHANIC DO A FULL SERVICE ON IT (BELTS, WATER PUMP, THERMOSTAT, TRANS OIL, ETC) SOMETHING I DO WITH ALL MY VEHICLES.  BUT I'M NOT USED TO HAVING LARGE SAFETY ITEMS LIKE THIS FROM TOYOTA.  DOMESTIC CAR MAKERS, YES, BUT NOT TOYOTA.....NOT RIGHT BY LEXUS!  THE PREVIOUS OWNER COULD NOT HAVE SEEN THIS.  IT'S BEEN THIS WAY FOR SOMETIME.",
        "vin": "2T2GK31U48C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104099,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE DRIVING 30 MPH, THE VEHICLE MADE AN ABNORMAL NOISE AND THE ESP, OIL, AND ENGINE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER (TOM WOOD LEXUS, 4610 E 96TH ST, INDIANAPOLIS, IN 46240, (317)-580-6880) WHERE IT WAS DIAGNOSED THAT THE OIL COOLING LINE FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 144,000.",
        "vin": "2T2HK31U58C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099205,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER HOSE IN THE OIL LINE TO THE OIL COOLER FAILED, ALLOWING ALL ENGINE OIL TO QUICKLY LEAK OUT. IF THIS HAD HAPPENED AT FREEWAY SPEEDS, THE ENGINE WOULD HAVE SEIZED AND POWER STEERING AND POWER BRAKES WOULD HAVE BEEN INSTANTLY LOST... CREATING AN EXTREMELY DANGEROUS SITUATION.  LUCKILY I WAS DRIVING ON SURFACE ROADS AT 25-35 MPH WHEN MINE FAILED  LEXUS KNEW OF THIS PROBLEM AND ELIMINATED THE RUBBER HOSE IN ITS 2011 MODELS BUT DID NOTHING TO WARN OWNERS OF THAT VEHICLE.  NHTSA WAS ALSO AWARE AND ADDRESSED IN NHTSA ID 10056509 (POSSIBLY INCORRECT ID).  I'M REALLY PISSED THAT IT IS GOING TO COST ME $500 TO FIX THIS LEXUS DEFECT, BUT I'M THANKFUL I HADN'T DRIVEN TO MY OFFICE THAT DAY USING INTERSTATE HIGHWAYS!  ALL LEXUS VEHICLES HAVING THIS DEFECT SHOULD BE RECALLED IMMEDIATELY.",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088568,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NO LONGER HAVE THE CAR BUT WAS REPEATEDLY REPLACING THE BRAKES ROTORS, BRAKE PADS AND BRAKES THEMSELVES. LEXUS WAS TELLING ME THAT I WAS RIDING THE BRAKES TOO HARD AND ULTIMATELY I GOT RID OF THE CAR.  I AM ONCE AGAIN SEEKING ANOTHER CAR BUT WOULD LOVE TO GET ANOTHER LEXUS SO I GOOGLED THE ISSUE, AND DISCOVERED MANY, MANY OTHERS HAVE EXPERIENCED THE SAME ISSUE ON THIS AND OTHER MODELS AND RECEIVED THE SAME REPLY. I AM SHOCKED TO SEE THAT LEXUS CONTINUES NOT TO ACKNOWLEDGE AND/OR FIX THIS ISSUE. PERHAPS A GOVT AGENCY INVESTIGATION WOULD INSPIRE THEM TO RECTIFY IT ONCE AND FOR ALL.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD ON MY 2008 LEXUS 350  IS CRACKING AND GETS STICKY WHEN PARKED OUTSIDE. THE LIFT TAB FOR THE BACK POWER DOOR IS TACKY LIKE TAR WHEN YOU TOUCH IT.  THE CAR ONLY HAS 37,476 MILES ON IT. THIS SHOULD NOT HAPPEN TO A CAR ESPECIALLY A LEXUS. I TOOK IT TO TUSTIN LEXUS ON SATURDAY 4/7/18 AND THEY SAID IT WAS OUT OF WARRANTY AND COULD NOT REPLACE THE DASHBOARD. THE LETTER I RECEIVED FROM LEXUS  ADVISED ME OF THE ENHANCEMENT COVERAGE EVEN  TO COVER CARS OUT  WARRANTY. I BELIEVE LEXUS SHOULD REPLACE THE DASHBOARD. WE WERE LOOKING TO REPLACE OUR 2ND LEXUS  GX460 WITH A NEW ONE BUT WE DECIDED WE WILL NOT BUY ANOTHER LEXUS IF THEY CANNOT WARRANTY THE DEFECTS IN THEIR CARS.",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  DASHBOARD IS CRACKING AND I DID NOT GET THE RECALL TO HAVE IT REPLACED.",
        "vin": "212GK31O18C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076563,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DRIVING MY VEHICLE AROUND AND NOTICED MY STEERING WHEEL HAS BECOME \"LOOSE\". THE POWER STEERING FLUID WAS LEAKING, BUT I WASN'T ABLE TO PINPOINT THE PROBLEM. I FILLED IT BACK UP WITH ANTI-LEAK POWER STEERING FLUID, BUT A COUPLE MONTHS LATER I HAD IT CHECKED OUT BECAUSE THE STEERING BECAME NOTICEABLY LOOSER. RACK AND PINION IS IN NEED OF REPLACEMENT. MY VEHICLE HAS BEEN SERVICED FROM BRAND NEW SINCE 2007 AND ONLY HAS 75,000 MILES ON IT. MY VEHICLE IS OUT OF WARRANTY, BUT THIS SEEMS TO BE A COMMON PROBLEM WITH THE MANUFACTURING OF THE VEHICLE (BASED UPON OTHER CONSUMER COMPLAINTS). NORMAL CITY AND HIGHWAY DRIVING.",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064830,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE HEADLAMPS FAILED TO ILLUMINATE. THE BULBS WERE REPLACED BY AN INDEPENDENT MECHANIC, BUT THE FAILURE RECURRED. THE INDEPENDENT MECHANIC DIAGNOSED THAT THE HEAD LAMP ASSEMBLIES NEEDED TO BE REPLACED. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE STATUTE HAD EXPIRED TO RECEIVE A MANUFACTURER RECALL REPAIR. THE MANUFACTURER PROVIDED NO SOLUTION OTHER THAN HAVING THE VEHICLE REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 115,000.",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMED BY DEALER SERVICE DEPARTMENT OF LEAK IN RACK AND PINION SYSTEM.  NEEDS REPLACED.  QUOTE APPROX 1800.00.",
        "vin": "2T2HK31UX8C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. TWO YEARS AGO, THE CONTACT NOTICED WATER ON THE FLOOR OF THE VEHICLE AS WELL AS THE FRONT DRIVER'S AND REAR SEATS. THE CONTACT ALSO NOTICED MOLD IN THE VEHICLE ALONG WITH AN ODOR. THE VEHICLE WAS TAKEN TO LEXUS OF EDISON AT (732) 798-7948 (711 U.S. HIGHWAY 1, EDISON, NJ 08817) WHERE THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE DEALER STATED THAT THE CARPET NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO LEXUS OF EDISON WHERE THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "2T2HK31U58C"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048290,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN MAKING NOISE WHILE DRIVING  . THE POWER STEERING FLUID IS LEAKING AND KEEPS DROPPING LOW. COMPLAINTS HAVE BEEN MADE TO LEXUS DEALER AT MASSEPUQUA, NY AND LATELY FARMINGDALE, NY NOW OVER PAST MANY YEARS .ON EVERY VISIT.",
        "vin": "JTJHK31U482"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043458,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH HAS SEVERAL MAJOR CRACKS.  VEHICLE WAS STATIONARY WHEN CRACKS APPEARED.  IT IS UNKNOWN WHEN THIS HAPPENED AS I JUST BOUGHT THE LEXUS.",
        "vin": "JTJGK31U580"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY FOOT ON THE BRAKE PULLING INTO A PARKING SPACE WHEN I FELT A QUICK ACCELERATION SURGING MY CAR FORWARD, LOCKING MY STEERING WHEEL CAUSING ME TO PLOW ONTO A PARKED TRUCK. I HAD TO BE TOWED TO REPAIR SHOP. STEERING BECAME DIFFICULT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032751,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL COOLER LINE DEVELOPED A PIN HOLE LEAK IN IT IN WHICH IN A MATTER OF MINUTES THE CAR WAS COMPLETELY OUT OF OIL IN WHICH THE ENGINE STARTED MAKING GRINDING NOISES UNTIL I STOPPED THE CAR.  THIS HAPPENED ON MY 2008 LEXUS AND LOOKING INTO THE ISSUE, LEXUS CHANGED THE DESIGN OF THE PART IN 2011 AFTER CONCERNS OF FAILURE OF THIS PART.  THERE WAS A SECTION OF THE PART THAT WAS A RUBBER HOSE IN BETWEEN TWO METAL LINES.  LEXUS CHANGED THIS PART TO MAKE IT ONE WHOLE METAL LINE IN 2011.  FOR SOME REASON FROM 2007 TO 2011 THIS PART WAS NOT RECALLED AND STILL HAS THE RUBBER HOSE OIL LINE ON IT.  IT COSTED ME SEVERAL HUNDRED DOLLARS TO REPLACE THIS PART AND COULD OF DESTROYED MY ENGINE AS WELL OR AT LEAST LIMITED THE ENGINE LIFE SINCE IT WAS WITHOUT OIL FOR A COUPLE MILES.  I'M CONCERNED THAT IT HAPPENED WHILE I WAS DRIVING AND LEAKED OIL ON THE ROAD TO THE POINT OF MY VEHICLE BEING EMPTY AND COULD OF SEIZED UP MY ENGINE AS WELL WHICH BOTH ARE SAFETY CONCERNS AND ENVIRONMENTAL ISSUES.  LEXUS OBVIOUSLY KNEW OF THE PART ISSUE TO CHANGE IT'S DESIGN IN 2012 BUT STILL DOESN'T HAVE A RECALL ON IT.  NOT SURE IF I'M BUYING ANOTHER LEXUS BECAUSE OF THIS.",
        "vin": "2T2HK31U08C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/01/2017",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030687,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC REAR DOOR DOES NOT OPEN IN HOTTER WEATHER. VEHICLE IS CONSISTENTLY GARAGED. LATCH ON REAR DOOR MELTS AND BLACK GOOEY TAR RUBS OFF ON FINGERS AND HANDS WHEN OPENING DOOR. DEALER SAID TO REPLACE THIS MELTED TAR LIKE DOOR LATCH IS $650. AUTOMATIC DOOR DOES NOT OPEN IN HEAT. LEXUS SAYS THERE IS NO FIX FOR THIS.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL COOLER PIPE ASSEMBLY ON THE ENGINE FAILED CATASTROPHICALLY CAUSING A SUDDEN LOST OF A LARGE VOLUME OF OIL.  THE FAILURE OCCURRED WHILE DRIVING ON A STREET AND WAS ONLY NOTICED WHILE PARKING (A CO-WORKER SAW THE OIL POURING OUT OF THE CAR).    THE CONSUMER STATED HE WAS NOT MADE AWARE OF THE WARRANTY ENHANCEMENT PROGRAM. THE CONSUMER REQUESTED TO BE REIMBURSED FOR THE REPAIRS. UPDATED 10/10/2017*JS",
        "vin": "JTJGK31U389"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "04/29/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN UNINTENDED ACCELERATION ISSUE.  I WAS PULLING INTO A PARKING SPACE AT 8 MPH WHEN SUDDENLY MY VEHICLE REVVED UP ON ITS OWN, JUMPED THE CURB, AND CRASHED INTO A BUILDING.  LUCKILY, I WAS NOT HURT OR HURT SOMEONE ELSE.  THE EDR DOWNLOAD CLEARLY SHOWED MY RPMS JUMPED FROM 400 TO 2,000 IN NANOSECONDS AND THAT THE ACCELERATOR WAS \"OFF.\"  TOYOTA'S RESPONSE TO ME WAS \"WE FOUND NO EVIDENCE THAT THIS INCIDENT WAS THE RESULT OF ANY TYPE OF DEFECT WITH THE ACCELERATOR OR BRAKES.\"  I AGREE IT IS NOT.  IT IS NOT A BRAKE PEDAL OR ACCELERATOR ISSUE.  IT IS A SOFTWARE ISSUE THAT CONTROLS THE FUEL TO THE VEHICLE.  AFTER TOYOTA WAS FINED $1.2 BILLION (LARGEST EVER FINE TO AN AUTO MAKER), THEY UPDATED THE SOFTWARE SO THERE IS A BRAKE OVERRIDE IN CASE THIS HAPPENS.  THE LOCAL LEXUS DEALERSHIP NEVER MENTIONED THIS TO ME NOR HAVE I EVER RECEIVED ANY TYPE OF RECALL NOTICE.  THIS COULD HAVE BEEN AVOIDED IF THE SOFTWARE IN MY VEHICLE HAD BEEN UPDATED.  TOYOTA IS \"VERY SORRY ABOUT THIS UNFORTUNATE INCIDENT.\"  PRETTY SAD WORDS FOR ALL OF THE PEOPLE THAT HAVE BEEN KILLED IN ACCIDENTS BECAUSE OF THIS ISSUE.",
        "vin": "JTJHK31U282"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005906,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS DEVELOPED NUMEROUS CRACKS,  HEADLIGHT COVERS ARE FOGGED UP.",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/16/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986067,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT SMELLED A BURNING ODOR AND STATED THAT THE OIL COOLANT COIL CONTAINED A HOLE, WHICH CAUSED OIL TO LEAK. THE DEALER INDICATED THAT THE VEHICLE WAS INCLUDED IN A MANUFACTURER RECALL; HOWEVER, THE CONTACT DID NOT RECEIVE A RECALL NOTIFICATION. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE RECALL DETAILS WERE NOT PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "2T2HK31U68C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "07/14/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970705,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE FIRE HAZARD ON MANY OF THESE VEHICLES.  THE REAR TAILGATE HANDLE HAS MELTED ON MANY OF THESE AND SHOULD NOT EXPIRE UNDER WARRANTY.  A LEXUS FORUM HAS NUMEROUS COMMENTS ABOUT THIS ISSUE.  APPARENTLY SOME DEALERSHIPS WOULD CHARGE UPWARDS OF $350+ TO REPLACE A DEFECTIVE AND PERHAPS HAZARDOUS PART.  I UNDERSTAND THE TOYOTA SIENNA HAS SIMILAR ISSUES WITH LIFTGATE.    DO NOT NOT WHEN MELTING OF HANDLE BEGAN.",
        "vin": "JTJHK31U482"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959905,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT GOT MOISTURE IN SIDE BURNED OUT   HAD TO REPLACE ENTIRE HEAD LIGHT $2200.00  THIS HAD AN EXTENDED WARRENTY BUT I MISSED IT   NEVER GOT NOTICE   NOT MOVING",
        "vin": "2T2HK31U48C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960070,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER COVER OF THE LIFTGATE SENSOR MELTED. I AM CONCERNED ABOUT IT CATCHING FIRE AND THE DOOR DOES NOT OPEN WHEN THIS IS TOUCHED AS IT IS SUPPOSED TO.  I HAVE READ MULTIPLE COMPLAINTS ONLINE FROM OWNERS WITH THE SAME ISSUE. THE BLACK RUBBER MELTS AND STICKS TO FINGERS AND IS HARD TO REMOVE.  I HAVE GRANDCHILDREN WHO TRY AND OPEN THE DOOR AT TIMES.   IT ALSO CAUSES THE SENSOR TO MALFUNCTION SINCE THE RUBBER PIECE INTERFERES WITH THE SENSOR.  THIS VERY COMMON DEFECT SHOULD ELICIT A RECALL.",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956257,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTIFICATION FROM LEXUS IN 2014 REGARDING REPLACEMENT OF RX350 DASHBOARD DUE TO A COSMETIC MANUFACTURER DEFECT IN WHICH THE DASHBOARD BECOMES CRACKED AND MELTED/STICKY. IT HAS BEEN OVER 2 YEARS AND THE DASHBOARD HAS STILL NOT BEEN REPLACED DESPITE MANY ATTEMPTS TO CONTACT LEXUS, I AM TOLD THE PARTS ARE NOT IN YET AND THAT I AM SUPPOSEDLY ON THE LIST AND THEY WILL NOTIFY ME AS SOON AS THE PARTS BECOME AVAILABLE. MY CONCERN IS OVER TIME THE DASHBOARD HAS BECOME WORSE, IT HAS BECOME EXTREMELY CRACKED. THIS IS A SAFETY ISSUE AND I AM CONCERNED THAT IT MAY AFFECT AIRBAG DEPLOYMENT IN THE CASE OF AN ACCIDENT.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2017",
        "dateOfIncident": "02/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949620,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RACK AND PINION LEAKS THAT APPEARS TO BE A COMMON PROBLEM WITH THE LEXUS RX 350. THIS FAILURE IS A CRITICAL COMPONENT OF THE STEERING SYSTEM AND NEEDS TO BE ADDRESSED BY THE MANUFACTURER. THE STEERING OIL COULD POTENTIALLY LEAK ONTO THE EXHAUST AND CATCH FIRE AND SHOULD BE A MAJOR SAFETY ISSUE! LEXUS IS WELL AWARE THEY HAVE AN ONGOING SAFETY PROBLEM AND THEY NEED TO ISSUE A RECALL TO COVER THESE INSANE COSTS.",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2017",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945524,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MELTING DASHBOARD RECALL NOTICE LAST YEAR ,FROM SCANLON FORT MYERS FLORIDA ,NO ACTION ON REPLACEMENT ,NO DATE OF REPLACEMENT SCANLON STATED NO INVENTORY FOR REPLACEMENT   WE HAVE GLARE AND CONCERNED ABOUT AIR BAG AND WARNING LIGHTS EFFECTED WHAT DO WE DO MY EMAIL IS [XXX] TEL [XXX] MY NAME IS [XXX] HELP WOULD BE APPRECIATED  KIND REGARDS   IM RETIRED AGED 69.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T2HK31U08C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926202,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE STARTING THE VEHICLE, THE CONTACT HEARD A GRINDING NOISE UNDER THE HOOD. THE NOISE WAS ONLY PRESENT FOR A FEW SECONDS, ESPECIALLY IN COLD WEATHER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE CAMSHAFT SENSORS WERE FAILING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.  UPDATED 05/09/17*LJ  CONSUMER STATED THIS IS AN ISSUE WITH THE CAM GEARS. POSSIBLY CAUSING THE ENGINE TO LOCK UP.  UPDATED 7/6/18*JB  *TR",
        "vin": "2T2HK31U18C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908754,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DOOR HATCHBACK RUBBER HANDLE HAS MELTED & DRIPPED ON THE BUMPER. IF I TRY TO OPEN THE DOOR USING THE HANDLE, BLACK TARRY GOOP GETS ON MY HAND & VERY DIFFICULT TO GET OFF. THIS VEHICLE IS KEPT IN MY GARAGE IN ARKANSAS.",
        "vin": "JT6HF10U6X0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON CITY STREET IN MADISON WI,SEVERE OIL LOSS DUE TO HOSE TO OIL COOLER. PART WAS CHANGED BY MANUFACTURER FROM RUBBER HOSE TO METAL. THIS TELLS ME THEY KNOW IT IS A PROBLEM. DEALERSHIP IN MADISON WI SAYS THEY GET THIS REPAIR WEEKLY.",
        "vin": "2T2HK31U88C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905610,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO DOESN'T HAVE ANY SOUND / VOLUME. LIGHT IS ON, STATIONS ARE LISTED AND CD TRACKS APPEAR. CANNOT ADJUST BASE, TREBLE, OR ANY OTHER SETTINGS ALTHOUGH THEY APPEAR WITH \"0\". CHECKED ALL FUSES RELATED TO THE AUDIO SYSTEM, NONE BLOWN. JUST HAPPENED LAST WEEK WHETHER CAR IS MOVING ON STATIONARY.",
        "vin": "2T2GK31U68C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY DISAPPOINTED WITH LEXUS FOR NOT ADDRESSING THE RACK AND PINION LEAKS THAT APPEARS TO BE A COMMON PROBLEM WITH THE RX 350 MODELS. I AM NOT ALONE IN REPORTING THIS FAILURE OF A CRITICAL COMPONENT OF THE STEERING SYSTEM TO NHTSA.  THE LEXUS DEALER THAT I TAKE MY CAR FOR SERVICE FOUND THESE LEAKS AT AROUND 91,000 MILES. THE DEALER COULD NOT PROCEED WITH THE WHEEL ALIGNMENT AFTER DISCOVERING THE RACK AND PINION LEAKS. THE REPAIR COSTS THE DEALER ESTIMATED WAS $1320.   I DO HOPE THAT NHTSA WILL INVESTIGATE THIS PROBLEM. THANK YOU.  *TR",
        "vin": "2T2HK31U08C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898069,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY:  THE DASHBOARD IS CRACKING AND GETTING STICKY. WHILE READING ABOUT SOME OF THE LEXUS COMPLAINTS I SAW SEVERAL COMPLAINING ABOUT THE LIFT-GATE CONTROL ON THE BACK OF THE CAR MELTING. I CHECKED AND SURE ENOUGH SO IS MINE. I WENT TO USE IT AND MY FINGERS WENT RIGHT THROUGH. NOW IT IS TOTALLY USELESS. I WILL CALL LEXUS BUT DON'T EXPECT ANY ASSISTANCE. MY CAR IS ALWAYS GARAGED AND ONLY HAS ABOUT 75K MILES. THE CAUSE IS UNKNOWN.",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892170,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS CRACKING AND GETTING STICKY.  WHILE READING ABOUT SOME OF THE LEXUS COMPLAINTS I SAW SEVERAL COMPLAINING ABOUT THE LIFTGATE CONTROL ON THE BACK OF THE CAR MELTING.  I CHECKED AND SURE ENOUGH SO IS MINE.  I WENT TO USE IT AND MY FINGERS WENT RIGHT THROUGH.  NOW IT IS TOTALLY USELESS.  I WILL CALL LEXUS BUT DON'T EXPECT ANY ASSISTANCE.  MY CAR IS ALWAYS GARAGED AND ONLY HAS ABOUT 15K MILES.",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875568,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MY PREVIOUS COMPLAINT OF EXPERIENCING TRANSMISSION SHUDDERS, THE CAR BECAME PROGRESSIVELY WORSE.  I HAD IT TAKEN TO THE LOCAL DEALER, WHERE THEY INFORMED ME THAT THE TRANSMISSION HAD FAILED.  THIS CAR HAS ONLY 136,000 MILES, WHICH IS NOT MANY FOR THE QUALITY USUALLY ASSOCIATED WITH THE LEXUS BRAND.  THEY CLAIM TO HAVE NO REASON FOR THE FAILURE, BUT ARE CHARGING ME ALMOST $5,700 TO REPLACE IT.  I ASKED LEXUS CORPORATE TO ASSIST ME WITH THIS REPAIR, DUE TO THE KNOWN TRANSMISSION ISSUES ON MANY RX MODELS, BUT THEY DECLINED.  THE VEHICLE ALMOST DIED ON ME IN THE MIDDLE OF THE HIGHWAY ON SEVERAL OCCASIONS WHILE EXPERIENCING THESE TRANSMISSION SHUDDERS, WHICH COULD HAVE LED TO A BAD ACCIDENT.  I THINK THIS IS RIDICULOUS AND SHOWS POOR QUALITY IN THEIR MANUFACTURING.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE STALLED. THE VEHICLE WAS PUSHED TO THE SIDE OF THE ROAD. WHEN THE CONTACT DISENGAGED THE AIR CONDITION COMPRESSOR, THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE AIR CONDITION COMPRESSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 89,000.  UPDATED 08/05/16*LJ    *CN",
        "vin": "2T2GK31U98C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/26/2016",
        "dateOfIncident": "05/21/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871108,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING TO REPLACE BRAKE CALIPERS, A BROKEN KEY, AND THE ENGINE OIL COOLING PIPE (WARRANTY) IN THE LAST YEAR, MY RX 350 IS HAVING TRANSMISSION SHUDDERS WITH 136K MILES. THIS IS RIDICULOUS FOR A CAR WITH THE LEXUS NAME AND PRICE. THE CAR IS HESITATING DURING SHIFTING CAUSING ISSUES WHILE DRIVING. I HAVE NOT HAD TO REPLACE THE TRANSMISSION YET, BUT WITH THE REVIEWS FOR SOME OLDER MODELS, I FEAR THIS IS COMING SOON. I AM VERY DISAPPOINTED TO PAY THIS MUCH MONEY FOR A QUALITY CAR THAT IS SUPPOSED TO LAST 250K+ MILES, AND HAVING SO MANY PROBLEMS WITH JUST 136K MILES ON IT. IT DOES NOT LIVE UP TO THE LEXUS QUALITY REPUTATION!",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "05/22/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850395,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE HEADLIGHT, HAS CONSISTENTLY FILLED UP WITH WATER, VIA WASHING THE CAR, RAINING, ETC., CAUSING IT TO FOG UP.  THIS IS RIDICULOUS, AND TO GO GET IT FIXED, THEY WANT AN ARM AND A LET, THE CAR IS IN BEAUTIFUL CONDITION, WHY NOT HONOR THIS BY FIXING IT, YOU'VE HAD OTHER COMPLAINTS!  MY DAUGHTER JUST PURCHASED A 2015, THIS IS OUR 3RD LEXUS, WE LOVE THE CARS, NOW WHY DON'T YOU FIX WHAT IS WRONG, I CAN'T GO AROUND WITH A HEADLIGHT THAT IS NOT DAMAGED AND I'VE BEEN TOLD BY LEXUS, \"AH YES, WE'VE HAD COMPLAINTS BUT THAT'S THE WAY IT GOES?\", KEEP IT UP, I'LL BUY A DIFFERENT CAR NEXT TIME! AND SO WILL FAMILY MEMBERS!",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840014,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SIGNIFICANT AMOUNT OF WHITE GRANULES EMITTING FROM EVAPORATOR CORE THROUGH AIR VENTS WHEN HEAT/AC IS ON. CONCERN ABOUT HEALTH HAZARDS TO FAMILY FROM BREATHING PARTICLES.",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/21/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837382,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HATCH HANDLE FOR REAR DOOR MELTED. REAR INTERIOR MODULE BUCKLING.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "12/30/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWING A ROUTINE OIL CHANGE AT MY LEXUS DEALER, THE CAR EXHIBITED AN OIL LEAKAGE WHILE DRIVING ON THE HIGHWAY. THE CAR'S ENGINE BEGAN SMOKING, A BURNING SMELL WAS NOTICEABLE, AND THE REAR WINDSHIELD WAS COVERED IN OIL. THE VIEW THROUGH THE REARVIEW WINDSHIELD WAS NOT VISIBLE. THE CAR ENGINE MADE SOME STRANGE NOISES AND IT WAS DIFFICULT TO DRIVE THE VEHICLE. RESIDUAL ENGINE DAMAGE IS POSSIBLE, AND AN ACCIDENT WAS LUCKILY AVOIDED. THE DEALER CLAIMED THAT THERE WAS A RECALL ON THE VEHICLE FOR THIS PROBLEM, AND THAT THEY WOULD EXTEND THE WARRANTY OF THE VEHICLE AND REPLACE THE OIL COOLER. SOME RESEARCH ONLINE YIELDED SOME CONFLICTING INFORMATION. MANY DIFFERENT CUSTOMERS HAVE EXPERIENCE THIS PROBLEM, BUT NO RECALL WAS EVER ISSUED. T.S.B. POL-14-02 (NHTSA NUMBER 10056509) WAS ISSUED IN JULY 2014 TO FIX THIS DANGEROUS DEFECT THAT PUTS DRIVERS AT RISK, WHEN A RECALL MAY HAVE BEEN WARRANTED. WE WERE NEVER NOTIFIED BY LEXUS OR THE DEALER THAT THIS WAS A POTENTIAL ISSUE. THOUSANDS OF TOYOTA AND LEXUS OWNERS MAY HAVE FACED OR WILL FACE A SIMILAR RISK IN THE NEAR FUTURE.",
        "vin": "JTJHK31U282"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "09/21/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10807607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBER ON TAILGATE HANDLE MELTED. I BELIEVE THIS IS DUE TO AN ELECTRICAL PROBLEM. I WENT ONLINE AND FOUND MANY OTHER SIMILAR COMPLAINTS. THIS MAY BE A FIRE HAZARD.  NOW THE TAILGATE GOES UP, AND THEN AUTOMATICALLY COMES RIGHT DOWN. THE FIRST TIME IT HAPPENED THE HEAVY TAILGATE HIT ME ON THE TOP OF MY HEAD CAUSING A GREAT DEAL OF PAIN AND SOME BLEEDING. I HAVE READ THAT THE SAME THING HAS HAPPENED TO OTHERS. THIS IS VERY DANGEROUS. IT DOES NOT ALWAYS HAPPEN. IT TENDS TO HAPPEN WHEN THE WEATHER IS COOLER OUT.",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "10/24/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10787382,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED AND BEING LOADED THRU REAR DOOR. I USED CAR REMOTE TO OPEN REAR DOOR AND LOADED ITEMS INTO TRUNK.  WITHOUT WARNING REAR DOOR STARTED CLOSING.  THIS PROBLEM IS INTERMITTEN AND HAS HAPPENED BEFORE.  ON THIS OCCASION DOOR CAME SLAMMING DOWN ON MY HEAD CAUSING A BLOODY INJURY.  I HAVE PHOTOS OF MY INJURY. LEXUS HAS BEEN NOTIFIED.  THIS PROBLEM IF NOT CORRECTED CAN CAUSE SERIOUS INJURY.  THE REAR DOOR COMES DOWN QUICKLY AND IS VERY HEAVY.",
        "vin": "2T2GK31U48C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787103,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR RUBBER COVER FOR THE LIFT GATE HAS MELTED.",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/09/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780592,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBER ON BACK LATCH HANDLE HAS MELTED INTO A BLACK TARRY GOO THAT DRIPPED DOWN ONTO THE LICENSE PLATE.  I HAVE READ ONLINE OF MANY OTHER PEOPLE LIVING IN HOT STATES HAVING THE SAME PROBLEM AND SOME THINK IT IS CAUSED BY AN ELECTRICAL ISSUE BUT I AM UNSURE.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767291,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED WHILE DRIVING 45 MPH, THE TIRE WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT WHEN BRAKING, THE VEHICLE VEERED TO THE RIGHT MAKING IT DIFFICULT TO MANEUVER THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764027,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SWITCH ON THE TAILGATE IS MELTED. WHEN YOU PUSH ON THE BUTTON IF FEELS STICKY AND COMES OFF ON YOUR HANDS. TO REPLACE THIS PART IT COST 100.00 FOR THE PART AND 200.00 TO INSTALL. WHEN I LOOKED ONLINE SO MANY PEOPLE ARE HAVING THIS ISSUE. SOMETHING IS WRONG WITH THE MAKING OF THIS PART. IT HAS FAILED.",
        "vin": "2T2HK31U08C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MELTED RUBBER BOOT HANDLE COVER FOR THE REAR LATCH CAUSING REAR DOOR AUTOMATIC LIFT TO STOP FUNCTIONING  ISSUE REPORTED MULTIPLE TIMES ON HTTP://WWW.CLUBLEXUS.COM/FORUMS WITH INCIDENT OF ELECTRICAL ISSUE INVOLVED.",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761001,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER ON THE BACK DOOR OPENER HAS GOTTEN MORE MELTED AND STICKY OVER THE PAST YEAR.  IT IS NOW UNUSABLE DUE TO THE TAR LIKE SUBSTANCE THAT CANNOT BE REMOVED VERY EASILY.  IF THIS MELT DOWN IS ELECTRICAL, IT COULD BE A SAFETY ISSUE.",
        "vin": "2T2GK31U78C"
    },
    {
        "components": "STRUCTURE,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760230,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A ROAD, MY VEHICLE BEGAN TO SHAKE UNTIL EVENTUALLY DROPPING TO THE ROAD AND DRAGGING UNTIL I COULD GAIN CONTROL OF IT , BY APPLYING THE BRAKES. I NOTICED OUT OF MY DRIVER'S SIDE WINDOW ACROSS THE ROAD WAS MY TIRE ROLLING AT A RAPID SPEED. I CALLED 911 TO RECEIVE ASSISTANCE TO STOP THE TRAFFIC AND TO HELP WITH MY DISABLED VEHICLE. OFFICERS ASSISTED WITH HELPING MYSELF, MY MOTHER AND MY TWO TODDLERS OUT OF THE VEHICLE AND TO RETRIEVE MY TIRE. THE TIRE HAD FALLEN OFF OF MY VEHICLE, AT THE RIM, LEAVING THE BOLTS AND THE MIDDLE PORTION OF THE RIM STILL ATTACHED TO THE VEHICLE, WHILE THE REMAINING MAJORITY OF THE RIM WAS STILL ATTACHED TO MY TIRE ROLLING DOWN THE ROAD. THE VEHICLE WAS IN PROPER WORKING CONDITION PRIOR TO THIS INCIDENT. I DID NOT HIT A POTHOLE NOR WAS I IN AN ACCIDENT. MY VEHICLE WAS TOWED TO MY RESIDENCE, THE FOLLOWING DAY AFTER CONTACTING LEXUS AND ADVISING THEM OF THE INCIDENT, I WAS INSTRUCTED BY LEXUS TO HAVE THE VEHICLE TOWED TO THEIR PROPERTY FOR AN INSPECTION. AFTER THE VEHICLE ARRIVED TO THEIR PROPERTY, THEY CONTACTED ME AND STATED THAT THE THE INCIDENT WAS NOT A MANUFACTURERS DEFECT, THAT HAD IT BEEN A MANUFACTURES DEFECT IT WOULD HAVE HAPPENED WITHIN THE FIRST YEAR THE VEHICLE WAS MANUFACTURED. LEXUS THEN INFORMED MYSELF THAT I  NEEDED TO MAKE A CLAIM WITH MY INSURANCE COMPANY FOR DAMAGES THAT HAVE BEEN INCURRED. PRIOR TO THIS INCIDENT THIS VEHICLE WAS IN PERFECT WORKING ORDER. ALL PREVIOUS SERVICES WERE PERFORMED BY AUTO LENDERS AND THE MOST RECENT WAS JUNE 23, 2015, WHEN A ROUTINE OIL AND FILTER CHANGE OCCURRED, AS WELL AS, THE BRAKE PADS AND ROTORS BEING REPLACED. THE SAFETY OF OURSELVES AND OUR CHILDREN ARE A GREAT CONCERN GOING FORWARD IN THIS VEHICLE AND WE DO NOT FEEL THAT THE MANUFACTURER IS IN FACT CONCERNED WITH OUR SAFETY AND WELL BEING AND IF THIS IS AN ISSUE WITH OTHER LEXUS VEHICLES, IT IS A SAFETY CONCERN FOR ALL.",
        "vin": "2T2HK31U98C"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT MY INFLATE TIRE LIGHT WAS ON. WHEN I LOOKED UNDER MY CAR TO INFLATE THE SPARE I NOTICED THAT THE SPARE WAS GONE AND THE CABLE HAD SNAPPED DUE TO RUSTING. THIS IS AN OBVIOUS DEFECT AND IS SURELY A SAFETY HAZARD IF THE TIRE WERE TO FALL OFF WHILE DRIVING. 2008 LEUS RX 350 AWD.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2015",
        "dateOfIncident": "08/09/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BOOT OPENER IS MELTED AND DRIPPING ONTO THE BUMPER",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "07/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733800,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BROUGHT VEHICLE TO DEALER FOR ROUTINE SERVICE, WAS INFORMED ONE OF THE POWER STEERING BOOTS WAS \"RIPPED AND LEAKING PRETTY GOOD.\" I WAS QUOTED $1600 FOR A COMPLETE RACK & PINION STEERING REPLACEMENT INCLUDING PARTS AND LABOR, WHICH I DECLINED BECAUSE THOSE ARE MSRP PRICES.. MY WIFE DRIVES THIS CAR AND I AM NOW CONCERNED FOR HER SAFETY AS WELL AS OTHER PASSENGERS. BASED ON OTHER COMPLAINTS WITH 2007-2009 RX350'S ON THIS SITE, LEXUS IS WELL AWARE THEY HAVE AN ONGOING SAFETY PROBLEM AND THEY NEED TO ISSUE A RECALL TO COVER THESE INSANE COSTS. WE MAINTAIN THE VEHICLE AT THE DEALER, I HAVE NEVER HEARD OF A POWER STEERING FAILURE AT BELOW 75K MILES ON ANY VEHICHLE BUILT IN THE LAST 20 YEARS...NOT HAPPY AND THIS WILL BE ONE AND ONLY LEXUS!",
        "vin": "2T2GK31U08C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2015",
        "dateOfIncident": "07/25/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732779,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THE CAR IN 2012 BY 2013 DASH STARTED TO CRACK & GET VERY STICKY. NOW DASH COMPLETELY CRACKED AROUND PASSENGER FRONT AIRBAG. WE ARE CONCERNED ABOUT THE CONTINUED DASH CRACKING & IF WILL EFFECT THE AIRBAGS & INJURY FROM THE AIRBAG IF DEPLOYED.",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "12/04/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724345,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LATCH MELTED, NOT DUE TO TEMPERATURES IN THE CITY AND STATE WHERE I LIVE BUT INSTEAD TO A ELECTRICAL COMPONENT OVERHEATING. LEXUS WILL NOT FIX WITHOUT A CHARGE OF OVER $200. THIS IS CLEARLY A DEFECT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I  APPROACH A RED LIGHT, I NOTICED THE CAR WAS SMOKING.   I PULLED INTO THE NEAREST AUTOMOTIVE FACILITY AND I NOTICE A TRAIL OF OIL WAS FOLLOWING ME.  I LOOK UNDER THE MY HOOD AND I SAW AND OIL LEAK.  I LOOKED UNDER THE CAR AND THERE WAS A PUDDLE OF OIL.  *TR",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "03/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A TORN POWER STEERING BOOT ON THE RACK. THE TORN SHOULD BE THERE FOR A WHILE. I PURCHASED A 100K MILES WARRANTY WHEN I BOUGHT THE CAR BUT THE LEXUS DEALERS NEVER MENTIONED OR POINTED OUT ABOUT THE DAMAGE UNTIL THE 100K MILES WARRANTY RAN OUT. AS SOON AS THE WARRANTY RAN OUT, I GOT INFORMED THAT THE POWER STEERING BOOT ON THE RACK GOT TORN AND IT WILL COST ME $1600.  *TR",
        "vin": "2T2HK31U58C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702033,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TICKING NOISES WHEN COLD START FOR FIRST 15 MINUTES.  *TR",
        "vin": "2T2GK31U68C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2015",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683201,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD STICKY, SHINY AND CRACKED ALL OVER.  THE HOOD IS STARTING TO RUST.  *TR",
        "vin": "2T2GK31U98C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676555,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR IN FOR A ROUTINE SERVICE; WHEN I WENT TO PICK IT UP I WAS TOLD THAT THE RACK AND PINION WAS LEAKING,  THERE WAS A TEAR IN THE BOOT AND IT WAS LEAKING FLUID,  AFTER BEING QUOTED $1800 FOR PARTS AND LABOR I DECLINED THE REPAIR.  I FIND IT HARD TO BELIEVE THAT A 7 YEAR OLD CAR WITH MAJORITY OF HIGHWAY MILES WOULD HAVE AN ISSUE WITH THE RACK AND PINION GOING BAD. WHEN I CAME HOME I DID SOME RESEARCH AND FOUND THAT THIS SEEMS TO BE A COMMON PROBLEM WITH THE SECOND GENERATION RX.  IN MY FAMILY, MAJORITY OF OUR CARS ARE TOYOTAS & LEXUS; WE HAVE A COROLLA, 2 CAMRY'S, SIENNA, HIGHLANDER, IS350, RX350.  ONE CAMRY HAS ALMOST 200KMILES, THE COROLLA HAS OVER 150K MILES. WE'VE OWNED 2 OTHER COROLLAS, ES250, CELICA, I'VE OWNED OTHER BRAND CARS TOO AND HAVE DRIVEN OVER 150K MILES AND NEVER HAD A PROBLEM WITH THE RACK AND PINION BOOT TEARING.  THIS IS NOT THE FIRST TIME I HAD AN ISSUE WITH THE RX, THE LAST TIME THERE WAS AN ISSUE WITH A (MOTOR) OIL LINE BURSTING, THE OIL LINE THAT RUNS FROM THE OIL COOLER - THANK GOD NOTHING HAPPENED, THE CAR MADE IT HOME SAFELY HOME (BUT NO LOW OIL LIGHT CAME ON) AND WE HAD IT TOWED TO THE DEALERSHIP AND THE REPAIRS WERE COVERED UNDER WARRANTY. WAS TOLD BY A MECHANIC THAT THE OIL LINE BURSTING WAS A COMMON PROBLEM, AND THAT THE NEWER RX MODELS THE PIPE WAS REPLACE WITH METAL PIPE.     IN MY OPINION ABOUT THE RACK AND PINION, IT'S DEFINITELY A SAFETY ISSUE - THE STEERING OIL COULD POTENTIALLY LEAK ONTO THE EXHAUST AND CATCH FIRE, AND IF ALL THE POWER STEERING FLUID LEAKS OUT ONE MAY NOT REALIZE IT AND MAY NOT BE ABLE TO STEER THE CAR OUT OF HARMS WAY.    WE'VE OWNED SO MANY TOYOTA/LEXUS CARS AND WE'VE NEVER HAD ANY PROBLEMS, WE'VE ALWAYS BEEN AN BELIEVER OF TOYOTA/LEXUS, BUT THIS RX HAS GOT ME WORRIED. I HOPE THAT THIS IS NOT A SIGN OF THINGS TO COME.  WILL BE THINKING REALLY HARD ABOUT TOYOTA/LEXUS WHEN IT COMES TIME TO BUY ANOTHER CAR.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2015",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PART# 84840G 8484021010 SWITCH ASSEMBLY, BACK DOOR OPENER - RUBBER COVER OF SWITCH HOUSING DETERIORATES/DEPOLYMERIZES LEAVING BEHIND A HAZARDOUS GOO AND HINDERING OPERATION OF REAR HATCH RELEASE MECHANISM.  *TR",
        "vin": "2T2GK31U78C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/03/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACK AND PINION STEERING BLEW UP SPEWING POWER STEERING FLUID ALL OVER THE UNDERCARRIAGE.  LOSS OF THE POWER STEERING RESULTED DO TO LACK OF FLUID.   NO PRIOR WARNING OF ANY LEAKS OR POOR PERFORMANCE FROM THE STEERING.  NO NOISE INDICATING THAT THERE MAY HAVE BEEN A LEAK.  FORTUNATELY, NO ACCIDENTS WAS CAUSED.  THE OIL GOT ALL OVER THE CATALYTIC CONVERTER AND COULD HAVE RESULTED IN A FIRE.  THIS IS A VERY UNSAFE CONDITION THAT COULD HAVE BEEN CATASTROPHIC.   *TR",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/03/2015",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD BEGAN TO CRACK SHORTLY AFTER WE PURCHASED THE CAR IN MARCH OF 2012.  AT THAT TIME I THOUGHT THAT THE PREVIOUS OWNER MIGHT HAVE HIT THE DASH WITH HIS FIST STARTING THE PROBLEM.  HOWEVER, THIS WAS NOT THE CASE.  THE DASH CONTINUED TO CRACK IN MULTIPLE PLACES AND CHUNKS OF THE VINYL STARTED TO FALL OFF LEAVING THE FOAM UNDER THE DASH COVERED EXPOSED.  WITH THE RECENT PROBLEMS WITH AIR BAGS, I FEARED THAT IF THE AIR BAG WENT OFF IT COULD SEND DASH PIECES FLYING EVERYWHERE POSSIBLE CAUSING INJURY.  I CONTACTED LEXUS, THEY ARE AWARE OF THE PROBLEM BUT THEY REFUSED TO DO ANYTHING ABOUT IT.    *TR",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "12/09/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664822,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER COVER OF THE LIFTGATE SENSOR MELTED. I AM CONCERNED ABOUT IT CATCHING FIRE. I HAVE READ MULTIPLE COMPLAINTS ONLINE FROM OWNERS WITH THE SAME ISSUE. THE BLACK RUBBER MELTS AND STICKS TO FINGERS. I ALSO CAUSES THE SENSOR TO MALFUNCTION SINCE THE RUBBER PIECE INTERFERES WITH THE SENSOR.  *TR",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662160,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2008 LEXUS RX350 AT 35 MPH IN HEAVY TRAFFIC, THE VEHICLE SUDDENLY STALLED LEAVING ME WITHOUT POWER STEERING OR BRAKES.  I WAS ABLE TO STOP THE VEHICLE BUT WAS STUCK IN THE TRAFFIC LANE WITH HEAVY TRAFFIC.  FEARING THAT I WOULD BE HIT BY ONCOMING TRAFFIC I CALLED 911 FOR SUPPORT WHILE THE TOW VEHICLE WAS DISPATCHED.  I WAS UNABLE TO LEAVE THE VEHICLE SAFELY UNTIL POLICE ARRIVED 20 MINUTES LATER, DUE TO THE POSITION OF THE VEHICLE AND THE TRAFFIC.      THE LOCAL LEXUS DEALER HAS CONTACTED ME TO LET ME KNOW THAT THE ISSUE WAS A BROKEN VALVE SPRING CAUSED THE ENGINE TO SEIZE WHILE RUNNING.  I AM CONCERNED THAT THIS CONDITION MAY BE SOMEWHAT OF A KNOWN ISSUE WITH LEXUS AS I HAVE SEEN THAT THEY HAD PROBLEMS WITH VALVE SPRINGS BREAKING IN THIS ENGINE. *TR",
        "vin": "2T2GK31U48C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK HEARD A FUNNY NOISE AND OIL LIGHT BEGIN TO BLINK.  FOUND OUT ENGINE OIL COOLING TUBE BURST AND LEAKED ALL THE OIL OUT AND HAS CAUSED MOTOR DAMAGE.  LEXUS SEND A WARRANTY ENHANCEMENT LETTER JUST A FEW WEEKS BEFORE DESCRIBING A PROBLEM WITH THE TUBE AND THAT THEY WOULD INSPECT AND REPAIR.  WAITING ON LEXUS CUSTOMER CARE TO ASSIST.  SO FAR ONLY 25%.  LOOKS LIKE A CLASS ACTION LAWSUIT MAY ENTAIL.  *JS",
        "vin": "2T2GK31U08C"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2014",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651354,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK  MY RX 350 FOR THE 80,000 SERVICE.  MY SERVICE ADVISER CALLED ME AND TOLD ME THE I HAD AN OIL LEAK IN THE RACK AND PINION STEERING AND IT MUST BE REPLACED AT THE COST OF $2600.00 TO $3000.00. I BELIEVE THIS IS A LEXUS PROBLEM THEY SHOULD TAKE CARE IT.   *TR",
        "vin": "2T2GK31U48C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651138,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS CRACKING IN MULTIPLE AREAS AND GETTING WORSE EVERY DAY.  *TR",
        "vin": "2T2GK31U68C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644978,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, AS I WAS CLEANING MY SUV, A LEXUS 2008 RX350, I 1ST NOTICED THAT THE COVERING PLASTIC BOOTH, AT THE OPENING HATCH/LATCH, WAS MELTING. SINCE THAT WAS NOT EXPECTED, I WENT ONLINE AND SEARCHED FOR THAT SAME ISSUE, TO FIND OUT THERE HAS BEEN OTHER SIMILAR REPORTS. I'M CONCERN THAT AN ELECTRIC OVERHEATING MAY HAVE CAUSED THAT MELTING, WHICH COULD CAUSE A FIRE OR SOMETHING WORSE TO THE CAR AND EVEN DANGEROUS TO ANY HUMAN OR LIVING THING.  THROUGH THE ONLINE RESEARCH, I DISCOVERED THAT LEXUS HAS REFUSED TO RECALL THE AFFECTED VEHICLES TO \"FREELY\" REPLACE THE PROBLEM, BUT WILL REPLACE THE ITEM FOR OVER $100.  BY MEANS OF THIS COMPLAINT, I WOULD LIKE TO REQUEST A DETAILED INVESTIGATION OF THAT PROBLEM AND THE PROPER FIXING OF SUCH PART WITHOUT HAVING THE CONSUMER TO BEAR ANY COSTS. *TR",
        "vin": "2T2GK31U38C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643440,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SWITCH ASSEMBLY PART #84840 FAILED. CAR IS SUBJECT TO SOUTHERN CALIFORNIA TEMPERATURES AND IS PARKED IN THE GARAGE. PLASTIC MELTED THE REAR DOOR MANUAL SWITCH/HANDLE AND PROVIDE A MELTED TAR LIKE SUBSTANCE BEHIND. NO ACCIDENT OR ANY MISUSE WAS DONE TO THE VEHICLE.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "05/28/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641280,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS AT THE DEALER FOR MY ROUTINE OIL CHANGE, I WAS TOLD THE POWERING STEERING FLUID WAS LEAKING AND  THEREFORE THE RACK AND PINION STEERING WOULD NEED TO BE REPLACED AT A COST OF $1600. MY CAR IS OUT OF WARRANTY BUT LOW MILEAGE AND SO FOR A LUXURY VEHICLE, I THOUGHT THIS TYPE OF REPLACEMENT THIS SOON WAS RIDICULOUS. THIS TYPE OF LUXURY CAR AT 55,000 MILES SHOULD NOT NEED THIS REPLACED. IT SEEMS LIKE A MANUFACTURING DEFECT AND LEXUS SHOULD DO A RECALL TO FIX THIS PROBLEM FOR ALL 2008 LEXUS RX350.  *TR",
        "vin": "2T2GK31UX8C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640369,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BROUGHT MY CAR AT THE DEALER FOR SERVICE, I WAS TOLD THE POWER STEERING FLUID WAS LEAKING AND THEREFORE THE RACK AND PINION STEERING ASSEMBLY WOULD NEED TO BE REPLACED AT A COST OF $1602.44. MY CAR HAS LOW MILEAGE AND SO FOR A LUXURY VEHICLE, I THOUGHT THIS TYPE OF REPLACEMENT THIS SOON WAS RIDICULOUS. I HAVE RESEARCHED THROUGH THE INTERNET AND FOUND SAME PROBLEM WITH THIS CAR. THIS TYPE OF LUXURY CAR AT 81,000 MILES SHOULD NOT NEED THIS REPLACED. DESPITE WITH ALL COMPLAINTS AND SAME PROBLEM WITH THIS LEXUS 2008 RX350 REGARDING THE POWER STEERING RACK ASSEMBLY, LEXUS SHOULD RECALL THIS PART FOR REPLACEMENT WITH NO COST TO OWNER.    *TR",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2014",
        "dateOfIncident": "08/08/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECENTLY NOTICED THAT MY DASHBOARD HAD CRACKS AND WAS STICKY/SHINY WHEN HOT. I ALSO FOUND SMALL FOAM FRAGMENTS ON THE FLOOR COMING FROM THE DASHBOARD. I CONSIDER THIS  A SERIOUS QUALITY PROBLEM THAT MAY CAUSE AN ACCIDENT BECAUSE OF THE REFLECTIVE DASHBOARD. IT ALSO COULD BECOME A FIRE HAZARD WHEN SMALL FOAM PARTICLES COLLECT AROUND ELECTRICAL PARTS UNDER THE DASHBOARD. I HAVE CONTACTED TOYOTA CUSTOMER SERVICE AND WAS TOLD THAT THEY DO NOT HAVE TO DO ANYTHING SINCE THE CAR IS OUT OF WARRANTY. HOWEVER THEY OFFERED TO COVERED 25% OF THE ESTIMATED $2520.00 REPAIR COST. THIS IS NOT ACCEPTABLE FOR ME SINCE THIS IS A HAZARDOUS QUALITY PROBLEM CAUSED BY TOYOTA AND THEY SHOULD COMPLETELY COVER THE REPAIR.  *TR",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629906,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS KEPT GOING OF AND ON AT CERTAIN POINTS, NOW AT NIGHT I HAVE NO LOW BEAM, IT APPEARS TO HAVE MOISTURE INSIDE THE LENS AND THE LENS ON ALL OF THE HEADLIGHTS ARE VERY FOGGY LOOKING.  THEY LOOK LIKE THEY ARE 20 YEARS OLD. WHEN TAKEN TO THE DEALER IRA LEXUS IN BEDORD NH,  THEY SAID IT IS NOT UNDER WARRANTY EVEN THOUGH I HAVE A LETTER FROM LEXUS DESCRIBING EXACTLY HOW MY LIGHTS ARE WORKING OR SHOULD I SAY NOT WORKING.  I REALIZED THE PROBLEM WHEN I WAS STOPPED AND ISSUED A WARNING FOR HAVING A HEADLIGHT BURNED OUT.  LEXUS IS TRYING TO BLAME IT ON A BALLISTER WHICH THEY WANT $900 TO REPLACE.  I SAY IT IS WHAT IS IN THE LETTER THAT IS CAUSING THIS.  I FEEL THEY ARE JUST TRYING TO CHARGE ME $900 FOR SOMETHING THAT SHOULD BE TAKEN CARE OF BY LEXUS.  I HAVE OWNED LEXUS VEHICLE FOR YEARS AS WELL AS MANY FAMILY MEMBERS AND IT DOES SEEM LIKE IF YOU HAVE AN ISSUE IT IS NEVER UNDER WARRANTY OR IF IT IS,  THEN SOMETHING ELSE CAUSED IT TO HAPPEN. IT IS SO HARD TO SEE AT NIGHT AND I FEEL THIS IS A HUGE SAFETY ISSUE THAT SHOULD BE TAKEN CARE OF BY  THEM OR AT LEAST OFFER AND AFFORDABLE RESOLUTION NOT OVER $900 FOR A SINGLE HEADLIGHT, WHICH ACTUALLY  COULD  CAUSE THE OTHER HEADLIGHT  TO GO. WHAT WOULD HAPPEN  WITH THE OTHER HEADLIGHTS IN THE FUTURE.   I AM GETTING SO DISAPPOINTED WITH LEXUS , SAD TO SAY THIS MAY BE MY LAST LEXUS VEHICLE. I HAVE OWNED THIS VEHICLE SINCE AUGUST 2009.  *TR",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629376,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS AT THE DEALER FOR MY ROUTINE OIL CHANGE, I WAS TOLD THE POWERING STEERING FLUID WAS LEAKING AND  THEREFORE THE RACK AND PINION STEERING WOULD NEED TO BE REPLACED AT A COST OF $1790.  MY CAR IS OUT OF WARRANTY BUT LOW MILEAGE AND SO FOR A LUXURY VEHICLE, I THOUGHT THIS TYPE OF REPLACEMENT THIS SOON WAS RIDICULOUS.  I HAVE 2 FRIENDS WITH THE EXACT SAME CAR AND SAME YEAR AND THEY BOTH HAD THE SAME PROBLEM AND HAD TO HAVE THEIRS REPLACED AS WELL.  ONE WAS UNDER WARRANTY, ONE WAS NOT.  I CALLED TO COMPLAIN TO LEXUS CORPORATE AND WAS OFFERED $700 TO HELP PAY HALF OF THE REPAIR.  THIS TYPE OF LUXURY CAR AT 65,000 MILES SHOULD NOT NEED THIS REPLACED.  *TR",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK HATCH HANDLE HAS MELTED COMPLETELY, LEAVING BLACK RUBBERY GOO.  UNABLE TO OPEN THE BACK TRUNK DUE THIS ISSUE.  *TR",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608505,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD ON MY LEXUS RX350 HAS CRACKED IN 4 PLACES.  OF SERIOUS CONCERN IS THE MULTIPLE CRACKS ON THE GLOVE COMPARTMENT ON THE PASSENGER SIDE THAT HOUSES THE AIRBAGS.  I HAVE ADDRESSED THIS WITH LEXUS AND THEY REFUSE TO REPLACE THE DASHBOARD.  THEY OFFERED A 25% ON THE REPAIR.  THIS IS A MAJOR PROBLEM OCCURRING ALL OVER THE WORLD AND LEXUS/TOYOTA IS REFUSING TO ADDRESS IT BECAUSE DEFECTS ARE NOT REPAIRED AFTER THE WARRANTY EXPIRES.  IT IS A SAFETY CONCERN OF THE HIGHEST ORDER AND I AM REQUESTING THE NHTSA ORDER A RECALL ON ALL MAKES AND MODELS THAT HAVE CRACKED DASHBOARDS.    THANK YOU.   *JS",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605787,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK HATCH HANDLE HAS MELTED, LEAVING BLACK RUBBERY GOO ON FINGERS IF OPENING USING THE HANDLE. RESIDUE IS HARD TO WASH OFF. CONCERNED THAT IT MELTED DUE TO ELECTRICAL PROBLEM.  I'VE READ ALL COMPLAINTS AND HAVE FOUND NUMEROUS OTHER OWNERS EXPERIENCED THE SAME PROBLEM.  *TR",
        "vin": "JTJHK31U382"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "06/03/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598616,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK HATCH HANDLE HAS MELTED, LEAVING BLACK RUBBERY GOO ON FINGERS IF OPENING USING THE HANDLE.  RESIDUE IS HARD TO WASH OFF.  THIS DOES NOT SEEM SAFE AS MY CHILDREN SOMETIMES OPENS IT AND MAY ACCIDENTALLY INGEST THE RESIDUE IF NOT WASHED OFF COMPLETELY.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585804,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IN MY VEHICLE HAS BEEN CRACKING OVER THE PAST 2 YEARS. INITIALLY IT WAS A SMALL CRACK ON THE PASSENGER SIDE, SO I OVERLOOKED IT. HOWEVER THE MORE TIME HAS PASSED, THE MORE IT CRACKS, EVEN ON THE DRIVER'S SIDE AND THE AREA AROUND THE SPEED/MILEAGE METERS. I HAVE CONTACTED LEXUS AND THEY HAVE OFFERED TO PAY FOR THE PARTS BUT I WOULD BE RESPONSIBLE FOR THE LABOR BECAUSE THEY CLAIM THAT MY CAR IS OUT OF WARRANTY. I HAVE SEEN REPORTS FROM OTHER CONSUMERS REGARDING A DEFECTIVE DASHBOARD MAINLY FOR TOYOTA AND LEXUS. I BELIEVE THAT THIS IS A MANUFACTURER DEFECT. AT THIS POINT I AM AFRAID THAT MY ENTIRE DASHBOARD WILL FALL APART AS I AM DRIVING. THIS IS POTENTIALLY DANGEROUS AND HOPEFULLY SOMETHING COULD BE DONE ABOUT THIS BEFORE SOMEONE ACTUALLY GETS HURT.   *JS",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION COMPLETELY FAILED WHILE I WAS DRIVING ON THE FREEWAY.  THIS WAS VERY DANGEROUS AND CAUSED A SAFETY HAZARD.  THE TRANSMISSION HAD TO BE REPLACED.  THE POWER STEERING RACK HAD TO ALSO BE REPLACED.  IT'S RIDICULOUS THAT THESE FAILURES OCCURRED BEFORE 120,000 MILES.  *TR",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH BOARD CRACKED AND THIS IS A MANUFACTER'S ISSUE.  THERE ARE THOUSANDS W/ THE SAME ISSUE & LEXUS DOES NOT WANT TO BE RESPONSIBLE.  IT CRACKS EVERY WHERE & MELTS BECAUSE OF THE HEAT.  OUR CARS ARE WORTH NOTHING W/ THIS ISSUE.  THERE ARE CRACKS WHERE THE AIR BAG RESIDES & THIS IS A SAFETY ISSUE.  PLEASE HELP US!!!  *TR",
        "vin": "2T2GK31U8C0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565071,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO UNDERWENT ROUTINE 35,000 MILE MAINTENANCE - DEALER NOTED POWER STEERING LEAK, REQUIRING RACK AND PINION REPLACEMENT. IS THE PART DEFECTIVE? WHY IS THERE NO RECALL? NOTED LARGE NUMBER OF THE SAME ISSUE ON THE INTERNET.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/26/2013",
        "dateOfIncident": "11/26/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT GATHER WATER WHICH CAUSES DIM HEAD LIGHTING . COILED GO OUT AT ANYTIME WHILE DRIVING. LOTS OF CONDENSATION ON THE HID HEADLIGHTS.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/03/2013",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550654,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A LEXUS RX350 2008 WITH MOISTURE IN THE PASSENGER SIDE HEADLIGHT, NO MORE WARRANTY (55,000) AND  IS BLOCKING THE LIGHT, WENT TO THE DEALER AND COST TOO MUCH TO REPAIR.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/30/2013",
        "dateOfIncident": "10/20/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10550135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT WHILE TRAVELING AT UNKNOWN SPEEDS, THE VEHICLE ERRONEOUSLY ACCELERATED. THE CONTACT CRASHED INTO ANOTHER VEHICLE AND THEN INTO A TELEPHONE POLE. THE CONTACT SUSTAINED CHEST AND KNEE INJURIES AND THE DRIVER OF THE SECOND VEHICLE SUSTAINED MULTIPLE FRACTURES. THE VEHICLE WAS DESTROYED AND A POLICE REPORT WAS FILED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 69,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2013",
        "dateOfIncident": "10/29/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549969,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INNER AREA THAT COVERS THE REAR HATCH HANDLE/OPENER HAS COMPLETELY MELTED, IT HAS TURNED INTO A SUPPER STICKY AND STAINY BLACK GU.  LEXUS RX 350 - 2008.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "10/20/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10549813,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE ENGINE RPMS INCREASED EXCESSIVELY AS THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT ALSO STATED THAT THE BRAKES FAILED TO STOP THE VEHICLE. THE CONTACT CRASHED INTO THE DRIVER'S SIDE OF ANOTHER VEHICLE AND THEN CRASHED INTO A POLE. A POLICE REPORT WAS FILED. THE CONTACT WAS TRANSPORTED TO A HOSPITAL FOR TREATMENT OF CHEST AND LEGS INJURIES. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS  NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DESTROYED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 69,000...UPDATED 12/03/13 *BF UPDATED 12/06/2013 *JS",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/19/2013",
        "dateOfIncident": "10/18/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ENTERING A PARKING LOT AND TURNING SLOWLY INTO A VACANT SPOT THE CAR ACCELERATED REALLY FAST AND WOULDN'T STOP WHEN BRAKE PRESSED AS THE SPEED CAME TO HALT WHEN CRASHING VERY HARD INTO A BRICK WALL. BOTH AIR BAGS ON DRIVER SIDE DEPLOYED AND WERE SMOKING REALLY BAD. THE IMPACT TO MY KNEES AND FACE CAUSED TEMPORARY NUMBNESS FOR WHICH I COULDN'T FEEL MY LEGS OR MOVE. THE POLICE & PARAMEDICS WERE CALLED. THE ENTIRE FRONT END DO MY CAR WAS DAMAGED. RECENTLY PURCHASED USED IN MAY 2013. IT HAS BEEN TOWED TO REPAIR SHOP FOR INSPECTION UPCOMING MONDAY. I SUSPECT IT WILL BE TOTALED AND JUDGING BY THE NUMEROUS COMPLAINTS SIMILAR IN NATURE, THIS PROBABLY SHOULD HAVE BEEN ADDRESSED AND RECALLED PRIOR TO BEING SOLD.  *TR",
        "vin": "2T2HK31U58C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE COMPLAINED ABOUT A NOISE UPON STARTING THE CAR FOR THE PAST YEAR WHEN HAVING THE VEHICLE SERVICED. THIS WAS THE FIRST SERVICE VISIT WHERE DEALER WAS ABLE TO PINPOINT THE CODE AND THEY CAME BACK WITH THE CAM SHAFT VARIABLE VALVE TIMING (VVT) GEAR ISSUE. THE REPAIR ESTIMATE WAS $6830. I FOUND YOUR RECALL DATED SEPTEMBER 4, 2013 # 13V395000 FOR VVT ON LEXUS GS350, IS350 AND IS350C MODELS FOR THE SAME MODEL YEAR AND FIND IT SUSPICIOUS AS THE SAME ENGINE IS USED.     I AM WONDERING IF OTHER RX 350S HAVE THE SAME ISSUE AND THE RECALL SHOULD ACTUALLY BE EXPANDED TO INCLUDE THE RX350 MODEL. AT THIS POINT, THE DEALER SAYS THEY NEED TO TEAR THE VEHICLE DOWN TO ACCURATELY ASSESS IF IT IS THE BOLTS OR ANOTHER ISSUE BUT THE EXPENSE IS VERY HIGH. I ALSO WAS WONDERING WHAT THE RANGE OF MILES WERE ON THE RECALLED VEHICLES?  THANK YOU FOR LOOKING INTO THIS.  *TR",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "09/30/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546269,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF THIS DATE, THERE HAS NOT BEEN AN ACCIDENT OR FAILURE TO THE STEERING RACK ON THIS CAR. HOWEVER, WHEN THE CAR WAS IN THE LEXUS DEALERSHIP FOR A ROUTINE OIL CHANGE, I WAS TOLD BY A REPRESENTATIVE OF THE SERVICE DEPARTMENT THERE IS A LEAKAGE OF FLUID FROM THE STEERING RACK BOOT AND IF LEFT UN-REPAIRED IT WOULD BE A SIGNIFICANT PROBLEM. WHAT CAUGHT MY ATTENTION MORE WAS THEIR STATEMENT THAT THIS SHOULD BE/HAVE BEEN A RECALL AS IT IS A PROBLEM ON THE LEXUS RX350 SPANNING  SEVERAL MODEL YEARS. I DON'T KNOW IF BY \"RECALL\" THEY MEANT A VOLUNTARY RECALL OR A NHTSA RECALL. ONE DOES NOT HAVE TO LET ONE'S IMAGINATION WANDER TOO FAR TO CONTEMPLATE THE SERIOUSNESS OF A FAILURE WHILE ON THE HIGHWAY.  *TR",
        "vin": "2T2HK31U78C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "08/24/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY BACK DOOR OPENER SWITCH WAS STARTING TO MELT. AT FIRST WE THOUGHT ITS FROM THE HEAT OF THE SUMMER BUT THEN AFTER CAREFUL CONSIDERATION WE THOUGHT THAT WE'VE HAD THE CAR FOR 4 PREVIOUS SUMMERS WITH NO ISSUES WITH SAID BUTTON. WE THOUGHT THAT THERE MUST BE SOME ELECTRICAL COMPONENT INSIDE THE AUTOMATIC BUTTON THAT MUST BE GETTING TOO HOT THAT'S CAUSING THE HARD PLASTIC TO MELT.  *TR",
        "vin": "2T2GK31U08C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534504,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST WISH TO REPORT MELTED REAR DOOR LATCH... BEEN GETTING GOOEY FOR MONTHS AND FINALLY CAME OFF - SEEMS TO BE AN ONGOING PROBLEM WITH SEVERAL LEXUS AND TOYOTA VEHICLES. WASN'T SURE IF THIS IS HEAT RELATED OR ELECTRICAL.  *TR",
        "vin": "JTJGK31U389"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "08/31/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514475,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE STREETS AND THE SUNROOF JUST SHATTERED. NO IMPACT OR ANYTHING. I DO NOT KNOW WHY IT SHATTERED BUT I BELIEVE THAT ITS A DEFECT.  REPORTED IT LEXUS AND THEY REFUSED TO FIX IT UNDER MY EXTENDED WARRANTY.  *TR",
        "vin": "2T2HK31U48C"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WATER PUMP WENT AND WHILE REPLACED THE RACK AND PINION IS LEEKING.....SEEMS EARLY FOR PROBLEMS WITH THESE CARS AND MAYBE A MAJOR SAFETY ISSUE!  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/06/2012",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487620,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MOISTURE/CONDENSATION IN HEADLAMP DUE TO MANUFACTURE DEFECT( KNOWN FOR SEVERAL YEARS BY TOYOTA). DEALER CLAIMS NOT UNDER WARRANTY (COSMETIC). IT IS A HAZARD AS WHOLE SYSTEM CAN FAIL AT ANY TIME (NIGHT) MANY COMPLAINTS FILED AND NO ACTION TO CORRECT THE PROBLEM BY TOYOTA. IT IS MY UNDERSTANDING THAT ONLY A LEXUS/TOYOTA DEALER CAN INSTALL REPLACEMENTS AT A HIGH COST TO CONSUMER ( $1500 ). THE MOISTURE BUILDUP IS PRESENTLY ON THE DRIVERS SIDE, HOWEVER WHEN THE OTHER FAILS...AND HOW MANY TIMES THIS MAY HAPPEN WITHOUT A TRUE \"FIX\".  *TR",
        "vin": "2T2GK31UX8C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/18/2012",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485063,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A LEXUS RX350 THAT WE PURCHASED USED IN 2011. I WAS PULLING INTO A PARKING SPACE IN FRONT OF A LOCAL BUSINESS. WHEN I PUT MY FOOT ON THE BRAKE NOTHING HAPPENED AND THE VEHICLE SPED UP AND RAN INTO AN OFFICE IN THE BUILDING WHERE A LADY WAS SITTING AT A DESK. MY CAR CAME TO REST AGAINST HER DESK. I LOST CONSCIOUSNESS FOR A MOMENT DUE TO FRIGHT I THINK. THEREFORE, AN AMBULANCE WAS CALLED AND I WAS TAKEN TO A LOCAL HOSPITAL WHERE I HAD TO HAVE NUMEROUS XRAYS. THANK GOODNESS I HAD ONLY SOME STIFFNESS IN MY NECK AND SOME SORENESS....THE SAME FOR THE LADY IN THE OFFICE. I COULD HAVE KILLED HER OR ANYONE IN THE VICINITY OF THE OFFICE. MY CAR WAS TOTALED BY THE INSURANCE COMPANY. THIS WAS ONE OF THE MOST FRIGHTENING EXPERIENCES I HAVE EVER HAD. *TR",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2012",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483763,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 LEXUS RX350 ON THE FREEWAY AT 65MPH AND MY SON ROLLED DOWN HIS WINDOW AND INSTANTANEOUSLY THERE WAS AN EXTREME AND PAINFULL CABIN PRESSURE THAT LEXUS CALL \"NORMAL CABIN PRESSURE\". IT STARTLED ME, I ALMOST CRASHED WITH MY WIFE AND TWO KIDS IN THE CAR WITH ME.IT MAKES YOUR EARS HUT, VERY PAINFULL. I BOUGHT A LEXUS BECAUSE OF T HE QUALITY AND LUXURY THAT THE LEXUS CORPORATION PORTAYS. I AM VEY DISAPPOINTED BECAUSE THE LEXUS DEALERSHIP TOLD ME THIS IS  NORMAL CABIN PRESSURE. THE CORPORATE OFFICE TOLD ME THAT THIS IS NORMAL AND IS NO LONGER WANTING TO DISCUSS THIS MATTER ANY FURTHER WITH ME. THEY SAID THAT I WILL HAVE TO HIRE A LAWYER IF I WANT TO PURSUE THIS MATTER ANY FURTHER. I THINK THAT THE LEXUS CORPORATION IS PROMOTING FALSE ADVERTISEMENT BY CLAIMING THAT THEY ARE COMMITED TO HIGH QUALITY AND LUXURY WHILE STILL MASS PRODUCING THE LEXUS RX MODEL WITH THIS DEFFECT OF \"NORMAL CABIN PRESSURE\". THIS IS SO FRUSTRATING. I FINALLY BUY A LUXURY VEHICLE AND IT TURNS OUT TO BE DEFECTIVE WITH NO APPARENT SOLUTION. BASSICALLY I JUST HAVE TO LIVE WITH THIS EAR PEARCING ANNOYANCE. WHAT A DISAPPOINTMENT WITH LEXUS.I PAYED SO MUCH MONEY FOR A DISAPPOINTMENT! *TR",
        "vin": "2T2GK31U39C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "09/28/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480747,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX8. THE CONTACT STATED THAT WHILE ENTERING A PARKING SPACE, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO A WALL. THERE WAS EXTENSIVE FRONT END DAMAGE TO THE VEHICLE. NO ONE WAS INJURED AND THE POLICE WERE NOT NOTIFIED. THE VEHICLE WAS TOWED TO AN AUTO BODY SHOP FOR REPAIRS. THE MANUFACTURER WAS NOTIFIED WHO ADVISED THAT THE INVESTIGATION OF THE FAILURE WOULD TAKE THIRTY DAYS TO COMPLETE. THE CONTACT STATED THE VEHICLE WAS GIVEN BACK TO HER AFTER THE BODY DAMAGE WAS REPAIRED BUT THE MEMORY CARD THAT WAS RETRIEVED WAS NOT INSPECTED TO DETERMINE THE CAUSE OF THE ACCELERATION FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "08/03/2012",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470640,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 65,000 MILES VEHICLE HAD A MAJOR BREAKDOWN.   SERPENTINE BELT RUPTURED CAUSING FIRE AND SMOKE INSIDE THE ENGINE COMPARTMENT AND BOTH INSIDE THE CABIN AND OUTSIDE.   GAS PEDAL BECAME INOPERATIVE AND VEHICLE HAD TO BE TOWED TO A REPAIR FACILITY.   AS FURTHER DETERMINED THE CAUSE OF THE BELT RUPTURE IS THE A/C COMPRESSOR FREEZING STUCK.    REPAIR IS EXTREMELY COSTLY.  PARTS ALONE ARE CLOSE TO $1500.   LEXUS IS NOT WILLING TO HELP IN ANY WAY AND ALL OF THE MAINTENANCE PER THE MAINTENANCE BOOKLET IS PERFORMED AND ON TIME.   ADDITIONALLY THE MAINTENANCE BOOKLET DOES NOT REQUIRE ANY WORK OTHER THAN FILTERS, OIL CHANGES UNTIL 100,000 AT WHICH TIME ONLY SPARK PLUGS ARE MOSTLY DUE TO BE REPLACED.    A/C COMPRESSOR SHOULD NOT HAVE GONE OUT AT 65,000 MILES ON A 2008 LEXUS.  *TR",
        "vin": "2T2GK31U18C"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/18/2012",
        "dateOfIncident": "03/29/2012",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE PASSENGER SIDE WINDOW FAILED AND WOULD NOT ROLL UP. THE CONTACT HAD THE VEHICLE TAKEN TO A DEALER FOR AN INSPECTION AND THEY STATED THAT THE WINDOW SWITCH WAS BURNED OUT AND NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WANTED THE VEHICLE TO BE TAKEN ANOTHER DEALER FOR REPAIR. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "2T2HK31U98C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/24/2012",
        "dateOfIncident": "03/31/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456332,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE PASSENGER SIDE HEADLIGHT FAILED. THE HEADLIGHT HAD WATER CONDENSATION THAT CAUSED THE ILLUMINATION OF THE HEADLIGHT TO BECOME EXTREMELY DIM. THE VEHICLE WAS TAKEN TO THE DEALER. THE DEALER INSPECTED THE VEHICLE AND ADVISED THE CONTACT THAT THE HEADLIGHT ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 41,100 AND THE CURRENT MILEAGE WAS 41,448.",
        "vin": "2T2HK31U88C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "12/06/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I SET THE CRUISE CONTROL WHILE DRIVING THE DISPLAY ON THE DASH INDICATING MPG, CURRENT MPG, AVERAGE SPEED, ETC. GOES BLAND.  THE DEALER SAID HE CANNOT FIX THIS PROBLEM AS THERE APPEARS TO BE A \"BUG\" IN THE ELECTRONICS. *TR",
        "vin": "2T2HK31U68C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "09/09/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426490,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350.  THE CONTACT STATED WHILE STOPPED AT A TRAFFIC LIGHT, AN ABNORMAL GRINDING SOUND WAS HEARD COMING FROM THE ENGINE AND THE VEHICLE ATTEMPTED TO STALL.  THE CONTACT TOOK THE VEHICLE TO DEALER AND AFTER PERFORMING A DIAGNOSTIC TEST, THE DEALER ADVISED THAT THE CAMSHAFT TOWER CAUSED THE ENGINE TO STALL AND WOULD NEED REPLACING.  THE VEHICLE WAS NOT REPAIRED.  THE CONTACT STATED THAT THE FAILURE WAS A COMMON PROBLEM WITH THE YEAR, MAKE, AND MODEL.  THE FAILURE MILEAGE WAS 88,000.  UPDATED 10/17/11",
        "vin": "2T2HK31U88C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "03/27/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LEXUS RX350. THE CONTACT STATED THAT THE SIDE CURTAIN AIR BAGS DEPLOYED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT SHE TURN THE VEHICLE OVER TO HER INSURANCE COMPANY. THE MANUFACTURER WAS CONTACTED WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 66,000.     UPDATED 5/24/11 *CN  UPDATED 06/24/11",
        "vin": "2T2GK31438C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362500,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RX350 LEXUS, I EXPERIENCED A SUDDEN SURGE IN RPMS WHILE TRAVELING DOWNHILL. RPMS SURGED 1000 IN SECONDS AND DROPPED BACK DOWN. HAS HAPPENED TWICE IN PAST 4 WEEKS. SCARY, PLEASE LOOK INTO THIS PEOPLE ALL OVER INTERNET ARE REPORTING SAME PROBLEM. LEXUS SERVICE COULD NOT REPLICATE AND SAID NOTHING IS WRONG!",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "10/09/2010",
        "dateOfIncident": "10/07/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359891,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE FIRST SERVICE OF MY LEXUS RX 350FWD THE BRAKE PADS WERE REPLACED BY THE DEALER BECAUSE THEY FELT IT WAS UNUSUAL AND THE THEY ADVISED MY DRIVING WITH A LOWER GEAR ON HILLS AND LESS BRAKING.  SINCE I NEITHER DRIVE HILLS OR BREAK UNUSUALLY ON FLAT ROADS I FOUND THIS ODD.  AT THE NEXT SERVICE I HAD TO PAY FOR WARPED ROTORS THAT NEEDED MACHINING AND THE SANDED THE BRAKE PADS DOWN.  THE LAST SERVICE RESULTED IN POOR BRAKING RESPONSE.  I HAVE TALKED TO LEXUS CORPORATE BUT THERE SEEMS TO BE NO SOLUTION. *TR",
        "vin": "JTJGK31U480"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "06/21/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WESTBOUND ON I-90W COMING FROM BOSTON WHEN A MILK TRUCK 2 CARS IN FRONT SLAMMED ON HIS BRAKES.  TRAFFIC WAS NORMAL AT 4 PM EST.  CARS WERE TRAVELING 40-45 MPH AS WE WERE ABOUT 1 MILES OUT OF THE ALLSTON/BRIGHTON TOLLS.  I SLAMMED ON MY BRAKES, BUT THE CAR SLID FOR A LITTLE WHILE BEFORE HITTING THE CAR IN FRONT.  THE LEXUS RX350 SEEMED TO HAVE VERY SOFT BRAKES, SOMETIMES REQUIRING ALMOST FLOORING OF THE BRAKES BEFORE THE BRAKE CATCHES.  THIS IS ESPECIALLY WORSE WHEN THE CAR IS COMING DOWN AN INCLINE, EVEN MODERATE ONES.  I'VE REQUESTED A CHECK OF THE BRAKES EVERY TIME THE CAR WAS BROUGHT IN FOR THE 5K SERVICE.  BRAKE PADS WERE REPLACED AT 30,000 MILES SERVICE, SO THE BRAKES SHOULD BE NEW.  *TR",
        "vin": "2T2HK31U48C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342577,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX350 ENGINE NOISE STARTED MAKING NOISE AT ABOUT 23,000 MILES. THE DEALER SAID IT WAS NORMAL. TOOK IT BACK IN FOR THE 30,000 MILE CHECK UP AND TOLD THEM THAT IT WAS  GETTING LOUDER. THEY CHECKED IT OUT AGAIN AND SAID THAT IT MIGHT BE THE MECHANICAL FUEL PUMP,BUT THAT WAS NORMAL.THIS IS STARTING TO  SOUND LIKE A DIESEL AND IS GETTING A LITTLE EMBARRASSING TO DRIVE AROUND SOUNDING THIS WAY. IF THIS IS NORMAL, THIS WILL BE MY FIRST AND LAST LEXUS....  *TR",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336296,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX350 MOTOR STARTED MAKING LOUD \"RAPPING\" NOISE AT 10,000 MILES, AFTER MANY COMPLAINTS TO THE DEALER LEXUS FIELD REP. ADMITTED IT WAS AN ENGINE DEFECT CALLED \"COLD ENGINE PISTON SLAP\" LEXUS TELLS MOST OF THEIR COMPLAINING RX OWNERS THAT THE NOISE IS FUEL INJECTORS AND IT IS NORMAL! LEXUS REFUSES TO FIX UNDER THE WARRANTY. MY CAR IS AN EMBARRASSMENT TO DRIVE, IT SOUNDS LOUDER THAN ANY DIESEL. *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM SENATOR DURBIN ON BEHALF OF CONSTITUENT RE PROBLEMS WITH HER 2008 LEXUS RX350 (DOT/ I#2010-1104 *TGW  THE CONSUMER STATED THE VEHICLE HAS EXCESSIVE RAIL DUST. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "03/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10323731,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LEXUS RX350. UPON PLACING THE VEHICLE IN REVERSE, IT IMMEDIATELY BOLTED IN REVERSE OUT OF THE DRIVEWAY. AT SPEEDS OF 40-45 MPH. THE BRAKES WERE APPLIED, BUT WITH NO EFFECT. IN AN ATTEMPT TO SHIFT TO SHIFT INTO NEUTRAL , THE VEHICLE WAS SHIFTED INTO DRIVE AND THE VEHICLE BEGAN TO INVOLUNTARILY ACCELERATE LEAVING THE DRIVER NO CHOICE, BUT TO CRASH INTO A TREE. THE POLICE AND AMBULANCE WERE CALLED TO THE SCENE. THE CONSUMER SUSTAINED INJURIES. THE VEHICLE WAS DESTROYED. UPDATED 11/16/10",
        "vin": "2T2HK31U18C"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "03/02/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318179,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2008 LEXUS RS350. WHILE DRIVING APPROXIMATELY 3 MPH INTO HIS DRIVEWAY THE VEHICLE SURGED FORWARD. THE CONTACT WAS UNABLE TO STOP THE VEHICLE. THE CONTACT DEPRESSED THE BRAKES TO THE FLOOR AND THE VEHICLE FAILED TO STOP. THE VEHICLE CRASHED INTO A WALL. THE ENTIRE FRONT END OF THE VEHICLE WAS DAMAGED. THE AIR BAG DID NOT DEPLOY. THE POLICE WAS NOT CALLED TO THE SCENE. THE CONTACT TOWED THE VEHICLE TO AN AUTHORIZED DEALER. THE DEALER STATED THAT ESTIMATED REPAIR COST WAS $12,000. THE INSPECTOR INFORMED HIM THAT THEY WERE UNABLE TO OFFER HIM ANY ASSISTANCE.  THE VEHICLE WAS AT AN AUTHORIZED DEALER TO BE REPAIRED WHEN THE COMPLAINT WAS FILED.  THE APPROXIMATE FAILURE MILEAGE WAS 24980 AND THE CURRENT MILEAGE WAS 25000.",
        "vin": "2T2HK31U98C"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316995,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "### I HAD ORIGINALLY IGNORED THIS INCIDENT AS REPORTED BY MY WIFE BUT WITH THE TOYOTA PROBLEMS IT MAY BE USEFUL IN YOUR TOYOTA INVESTIGATIONS. ### MY WIFE WAS COMING TO A STOP AT A LIGHT (5 MPH) AND HIT A SIGNIFICANT BUMP AND IMMEDIATELY ALL BRAKING WAS GONE FOR ABOUT 5 TO 10 FEET AND THEN RETURNED. IT WOULD HAVE BEEN AN ACCIDENT EXCEPT THE CAR IN FRONT MOVED. THIS HAS OCCURED ONLY ONCE . . .  SHE IS A CONSERVATIVE DRIVER AND DRIVES ALMOST ALWAYS ON PAVED CITY STREETS . . . THE BUMP WAS IN A CONSTRUCTION AREA. *TR",
        "vin": "2T2GK31U58C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "02/22/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIRBAG LIGHT IS ALWAYS SAYING OFF AND DISPLAYING AN ICON ON THE INSTRUMENT PANEL. THIS HAS BEEN IN THE SHOP FOR AT LEAST 6 TIMES OVER THE PAST 4-5 MONTHS.  IT WAS LAST IN THE SHOP IN JANUARY 2010 WHERE THEY KEPT IT FOR ABOUT 3 WEEKS AND REPLACED THE SEAT AND THE SENSORS .... WE THOUGHT THIS WOULD RESOLVE THE PROBLEM... BUT THE LIGHT CAME ON AGAIN THIS EVENING.  *TR",
        "vin": "2T2GK31U08C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "01/19/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LEXUS RX 350 WITH SEVERAL PROBLEMS INCLUDING STICKY ACCELERATOR WHICH CAUSED HESITATION AND THEN A SURGE AND RELATED SENSOR PROBLEM. CONSUMER STATED THAT THE WARNING LIGHTS ILLUMINATED AND THE VEHICLE SURGED FORWARD. WHEN TAKEN TO THE DEALER, THE WARNING LIGHTS WENT OFF.  *KB  THERE WAS A LOOSE WIRE BETWEEN E5-A12 PIN AND GENERAL INSTABILITY WITH SENSORS AND VARIOUS TROUBLE LIGHTS INCLUDING THE CHECK ENGINE LIGHT, VSC AND LOSS OF CRUISE CONTROL.  A CODE DIAGNOSED A PROBLEM AS ACCELERATION POSITION SENSOR SWITCH MALFUNCTION, WHICH SEEMED TO BE ASSOCIATED WITH THE WARNING LIGHTS FOR THE CHECK ENGINE, VSC AND SKID. THE CONSUMER STATED THE VEHICLE LOST POWER AND SIGNIFICANT USE OF THE ACCELERATOR WHILE DRIVING 70 MPH.  *JB",
        "vin": "2T2HK31U68C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303624,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LEXUS RX350. HE EXPERIENCED SUDDEN ACCELERATION TWICE WHILE DRIVING 30 MPH AND ATTEMPTING TO STOP AT AN INTERSECTION AND AGAIN WHEN HE TRIED TO PARK. DURING BOTH INCIDENTS HIS FOOT WAS ON THE BRAKE PEDAL; HOWEVER, THE ACCELERATOR PEDAL STUCK, THE VEHICLE CONTINUED TO ACCELERATE AND IT FAILED TO STOP. THE VEHICLE WAS  TAKEN TO THE DEALER TO BE DIAGNOSED. THE DEALER WAS UNABLE TO LOCATE THE FAILURE. A REPORT WAS FILED WITH THE MANUFACTURER WHO STATED THAT SOMEONE WOULD CONTACT HIM.  THE CURRENT AND THE FAILURE MILEAGES WERE 19, 700.",
        "vin": "2T2GK31U88C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2010",
        "dateOfIncident": "01/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303093,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR STICKS. I HAD A 2002 LEXUS RX300 AND THE ACCELERATOR KEPT STICKING . I TOOK IT TO THE AUSTIN TX LEXUS DEALER IN SPRING 2008 AND REPORTED IT. THEY SAID THERE WAS NOTHING WRONG. I SOLD THE CAR AND BOUGHT A NEW 2008 RX350 AND IT DOES THE SAME THING. SO LEXUS HAS KNOWN ABOUT THIS PROBLEM FOR A LONG LONG TIME AND THAT MAKES ME MAD FOR THEM TO KNOWNINGLY JEOPARDIZING MY SAFETY.  TW*",
        "vin": "11111111111"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "09/21/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10293945,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Brake Parts Inc.",
                "productMake": "BRAKE PARTS",
                "productModel": "DISC BRAKE ROTOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AS A LEXUS OWNER AND INTERNATIONAL JOURNALIST (WASHINGTON, DC) I HEREBY LODGE A FORMAL COMPLAINT AGAINST LEXUS USA/TMS OFFICES IN TORRANCE, CA. MY MOTHER AND I SURVIVED DEATH, SUSTAINED TRAUMATIC SERIOUS INJURIES (WHICH LED TO MY MISCARRIAGE) DUE TO MY LEXUS CAR MANUFACTURER DEFECTS AND MECHANICAL MALFUNCTIONING RESULTING IN A LOSS OF CONTROL COLLISION ON 09/21/2009. SINCE 09/22/2009 UP TO DATE 11/30/09 I HAVE BEEN CHEATED, SCAMMED AND LIED TO BY MY CAR MANUFACTURER AND SALES OFFICES CORPORATE LEADERS, WHO CONTACTED ME AND GAVE ME FALSE PROMISES OF MY CAR RE-PURCHASE, STATING THAT MY DEFECTIVE CAR IS SUBJECT TO A BUY-BACK AND REPLACEMENT IN ADDITION TO LEGAL LIABILITY ISSUES RELATED TO OUR MEDICAL BILLS. UP TO DATE I HAVE BEEN CHEATED, LIED AS BEING A VICTIM OF A CHAIN OF LIARS, CHEATERS AND FRAUD MASTERS FROM LEXUS-USA. PROOF OF ALL COMMUNICATIONS WILL BE PROVIDED TO YOUR OFFICE UPON REQUEST. PLEASE HANDLE AN EXPEDITED AND EXTENSIVE INVESTIGATION IN THIS MATTER. MY CAR IS ABANDONED BY LEXUS USA HEADQUARTERS THOSE WHO CONTACTED ME A FEW TIMES AND CHEATED ABOUT PROMPT RESOLUTION OF MY CLAIM FOR ALL DAMAGES RESULTED FROM MY CAR DEFECTS. AS JOURNALIST AND VICTIM OF FRAUD, I WILL PREPARE A SPECIAL NEWS COVERAGE WITH MY COLLEAGUES THAT WILL DISCLOSE AND EXPOSE LEXUS USA DECEPTIVE BUSINESS PRACTICE AND FRAUD. I WILL SEEK RECOVERY TO THE FULLEST EXTENT OF LAWS. LEXUS USA OFFICE FRAUD MASTERS WHO HAVE BEEN ASSIGNED TO MY CLAIM, CAUSED ME PUNITIVE AND MONETARY DAMAGES. AS A RESULT I SUSTAINED MEDICAL, RENTAL AND OTHER EXPENSES. ALL WRONGDOERS SHALL BE HELD ACCOUNTABLE  DUE TO VIOLATIONS AND NON COMPLIANCES WITH FEDERAL, STATE AND LOCAL LAWS AND REGULATIONS. PLEASE CONTACT ME AND ADVISE ME OF THE STATUS OF THIS CASE. *TR  UPDATED 03/23/2010",
        "vin": "JTJGK31U880"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2009",
        "dateOfIncident": "06/05/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LEXUS RX350.  WHEN THE CONTACT PURCHASED THE VEHICLE, SHE NOTICED THAT THE PASSENGER SIDE AIR BAG WAS INOPERATIVE.  IN FEBRUARY OF 2008, THE AIR BAG LIGHT ILLUMINATED AND READ \"AIR BAG OFF\".  IN MAY OF 2009, THE CONTACT FILED A COMPLAINT WITH LEXUS REGARDING THE ISSUE.  THE VEHICLE HAS BEEN TAKEN IN FOR SERVICE ON FOUR OCCASIONS, BUT THE FAILURE STILL PERSISTS.  THE FAILURE MILEAGE WAS 12,790.  UPDATED 07/08/09. *LJ  THE AIR BAG LIGHT WOULD READ OFF, WHEN THE PASSENGER SIT WAS OCCUPIED. UPDATED 07/08/09.*JB",
        "vin": "2T2GK31UX8C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/18/2009",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BACK UP LIGHTS DON'T SEEM BRIGHT, CANT SEE VERY WELL WHEN BACKING UP AT NIGHT.  COULD BE A POTENTIAL INCIDENT IN THE FUTURE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2008",
        "dateOfIncident": "05/08/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR TIRES NEEDED TO BE REPLACED IN A BRAND NEW VEHICLE AFTER ONLY 1000 MILES BECAUSE THE CAR IS TITLED TO THE LEFT AND MISALIGNED. AFTER SIX ATTEMPTS, TWO DIFFERENT DEALERS CAN'T GET THE DEFECTS FIXED.  *TR",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2008",
        "dateOfIncident": "05/07/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227666,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PUT THE VEHICLE IN REVERSE, IT RAPIDLY AND SUDDENLY ACCELERATED OUT OF CONTROL AND HIT A LIGHT POST.  TRYING TO REGAIN CONTROL, I PUT ON THE BRAKE AND SHIFTED TO DRIVE, WHERE IT SUDDENLY AND VERY RAPIDLY SPED FORWARD AND HIT A FENCE BEFORE I COULD STOP THE VEHICLE.  WHEN THIS OCCURRED, THE COUPLE I WAS DINING WITH HEARD THE CAR BACKFIRE TWICE WHICH CAUGHT THEIR ATTENTION.  I COULD NOT HEAR THE BACKFIRE INSIDE OF THE VEHICLE.  THE ACCELERATION WAS EXTREMELY RAPID AND DANGEROUS.  THE VEHICLE DID THIS ON ITS OWN.  THIS IS NOT A CASE OF WHERE I ACCIDENTALLY HIT THE GAS PEDAL INSTEAD OF THE BRAKE.           IN THIS PARTICULAR SITUATION, NO ONE WAS HURT, AND THE VEHICLE ONLY HAS MINOR SCRATCHES.  HOWEVER, AS YOU MIGHT SURMISE, THIS COULD HAVE BEEN A POTENTIALLY DANGEROUS AND DEADLY SITUATION HAD SOMEONE BEEN IN THE PATH OF THE CAR.      VEHICLE WAS BROUGHT TO WESTSIDE LEXUS TO CHECK ON 5.13.2008.  THEY WERE UNABLE TO IDENTIFY THE PROBLEM AND SAID THE VEHICLE WAS SAFE TO DRIVE.  *TR",
        "vin": "2T2GK31U68C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/23/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216447,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A COMPLAINT ON THE DIM, WEAK BACK-UP LIGHTS IN THE 2008 LEXUS RX-350.  *CN",
        "vin": "2T2HK31U28C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211008,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LEXUS RX350.  THE CONTACT STATED THAT THE REAR AND SIDE WINDOWS ARE DARK DUE TO TINTING.  THE POLICE STATED THAT TINTING IS ILLEGAL.  THE MANUFACTURER STATED THAT THE WINDOWS HAVE STANDARD FACTORY TINT.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 7,000.",
        "vin": "2T2GK31U28C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/13/2007",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BEING DRIVEN BY DENICA GORDON-MANDEL (WIFE).  DRIVER WAS ON TOP FLOOR OF A PARKING GARAGE ADJOINING A DEPARTMENT STORE.  DRIVER APPLIED GAS TO PULL INTO PARKING SPACE, THEN DRIVER APPLIED BRAKE TO SLOW DOWN, THEN DRIVER TOOK FOOT OFF BRAKE.  CAR LURCHED FORWARD AND SLAMMED INTO WALL OF PARKING STRUCTURE.  *TR",
        "vin": "JTJGW31U982"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "10/05/2007",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205829,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LEXUS RX350.  WHILE DRIVING 50 MPH, THE VEHICLE BEGAN DRAGGING AND WOULD NOT ACCELERATE OVER 50 MPH.  THE VEHICLE WAS PULLED OVER AND SMOKE WAS COMING FROM THE WHEEL ASSEMBLY.  THE BRAKES LOCKED.  THE VEHICLE WAS RESTARTED AND DROVE NORMALLY FOR 5 MILES.  THE DEALER WAS UNABLE TO DUPLICATE OR DETERMINE THE CAUSE OF THE FAILURE.  THE FAILURE MILEAGE WAS 9,000 AND CURRENT MILEAGE WAS 13,000.",
        "vin": "2T2HK31U38C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/21/2007",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10200237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO BRING TO YOUR ATTENTION A VERY SERIOUS AND TROUBLING INCIDENT THAT RECENTLY OCCURRED WHILE I WAS DRIVING MY BRAND NEW LEXUS RX350.  IT IS NO EXAGGERATION TO SAY THAT MY PASSENGER AND I WERE EXTREMELY LUCKY TO NOT HAVE INCURRED SERIOUS INJURY, OR EVEN DEATH.  WHILE DRIVING ON A VERY BUSY HIGHWAY, A DEFECT IN THE LEFT FRONT (DRIVER'S SIDE) GLASS CAUSED AN EXPLOSION THAT COULD HAVE LED TO VERY DIRE CONSEQUENCES. THE INCIDENT OCCURRED AT AROUND 10:30 AM ON JULY 27, 2007 WHILE WE WERE TRAVELING NORTHBOUND ON I-95 IN FLORIDA.  WE WERE A SHORT DISTANCE NORTH OF EXIT 289 (WHERE WE ENTERED THE HIGHWAY) MOVING AT A NORMAL HIGHWAY RATE OF SPEED.  WE WERE TRAVELING IN THE RIGHT LANE.    SUDDENLY I HEARD WHAT SOUNDED LIKE AN EXPLOSION!  I LOOKED TO SEE WHERE THE NOISE WAS COMING FROM (MY LEFT) AND FOUND THE DRIVERS SIDE WINDOW EXPANDED OUTWARD.  IT ALMOST APPEARED LIKE A BUBBLE THAT WAS BLOWING OUT FROM THE SIDE OF THE CAR.   THE GLASS THEN SHATTERED IN A SPIDER WEB FASHION THE GLASS BEGAN TO BREAK, FALLING BOTH INSIDE AND OUTSIDE OF THE CAR. ONCE STOPPED, I REALIZED THAT GLASS WAS COVERING ME FROM HEAD TO TOE.  THERE WERE SEVERAL CUTS AND SCRAPES ON MY ARMS AND LEGS FROM THE SHATTERED GLASS.  GLASS WAS IN MY HAIR, FELL DOWN MY NECK AND MANAGED TO MAKE ITS WAY INTO MY SHIRT.  MY BROTHER, WHO WAS TRAVELING WITH ME, TRIED TO HELP ME BY REMOVING SOME OF THE GLASS, CUTTING HIS OWN FINGERS IN THE PROCESS.  WHEREAS MY CAR HAD, PRIOR TO THIS INCIDENT, BEEN IN NEW CONDITION, IT WAS NOW SCRATCHED AND GOUGED ON BOTH DRIVER'S SIDE DOORS.  THE SCRATCHES ON THE OUTSIDE OF BOTH DOORS.  THERE ARE ALSO SEVERAL GOUGES ON THE INTERIOR PLASTIC PANELS ALONG THE LEFT (DRIVER'S) SIDE OF THE CAR (DOORS AND PILLARS). *TR  THE CONSUMER PROVIDED A INSURANCE CLAIM REPORT AND VARIOUS INTERNET ARTICLES PERTAINING TO THE DEFECT. UPDATED 09/19/07  *TR",
        "vin": "2T2HK31U48C"
    }
]