[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456440,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Turning signals don't work.  I bought this used 2008 Lincoln Navigator with the written text on my phone that said the used car lot took the vehicle to their mechanic and he said he had fixed the problem.  I called him (the mechanic) upset and said the used car lot said he fixed the problem.  He said he didn't say that; the signals could not be fixed without certain parts (computer parts) that are not available from anywhere.  The parts are not being made and the re-conditioned parts are not available from re-conditioned businesses.  I did sign an \"as is\" bill of sale with the understanding they would fix the signals.  I have saved those text on my cells phone.  They initially took responsibility of the defected signals by asking the mechanic to replace the signal arm.  That didn't fix the problem.  If they did this to me, they would do it to others.  Now I have an unsafe vehicle that I should not drive.  I also took this vehicle to a Lincoln dealership who confirmed what their mechanic stated.",
        "vin": "5lmfu27538l"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318186,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY CHROME PAINTED WHEELS PEELING CAUSED TIRE BLOWOUT ON THE HIGHWAY. THE CHROME SEPARATES FROM THE ALUMINUM WHEEL AND THE TIRE STARTS TO LOSE AIR OR IN MY CASE BLOW OUT. THIS IS A HUGE SAFETY RISK AND THERE'S NOT ANYTHING I'M ABLE TO DO. THIS IS HAPPENING WITH MANY OTHER LINCOLN VEHICLES THAT HAVE CHROME PAINTED WHEELS FROM 2007 TO 2014. LINCOLN HAS NO ANSWERS FOR ME AND SUGGEST I ORDER FACTORY WHEELS. NEW FACTORY WHEELS WILL JUST START PEELING AGAIN.",
        "vin": "5LMFL28518L"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT DRIVER SEAT WON'T GO BACK OR FORWARD. AND MY RUNNING BOARD IS NOT WORKING ANY MORE. ON THE DRIVER SIDE WON'T COME OUT ANY MORE AND THE PASSENGER SIDE STUCK OUT AND WON'T GO BACK IN. I TOOK IT TO MY MANICA AND HE SAID IT'S A RECALL ON THE ELECTRICAL SYSTEM.",
        "vin": "5LMFU27558L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR. WHILE DRIVING VARIOUS SPEEDS, THE ACCELERATOR PEDAL WOULD BECOME STUCK. THE CONTACT HAD TO DEPRESS THE BRAKE PEDAL MORE THAN ONCE TO STOP THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 141,000.",
        "vin": "5LMFU28508L"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166569,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING THE STEERING WHEEL THE STEERING WHEEL WILL NOT RETURN TO CENTER, IT MUST BE BROUGHT BACK MANUALLY.  SECOND, THE ROCKER PANELS FRONT AND BACK ARE RUSTED OUT COMPLETELY AND I WORRY ABOUT INTEGRITY AND SAFETY OF THE FRAME.",
        "vin": "5LMFU28518L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970583,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A WRENCH APPEARS ON MY DASH BOARD, AND THE CAR STARTS TO SLOW DOWN IN TRAFFIC.",
        "vin": "5LMFU28508L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "04/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917886,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES DO NOT ALWAYS FUNCTION.  PEDAL GOES DOWN TO FLOOR. BROUGHT TO LINCOLNS ATTENTION LAST APRIL, JUNE AND JULY.  WE HAVE NOTES AND LETTERS WITH HEATHER CARLYLE FROM LINCOLN MOTOR COMPANY",
        "vin": "5LMFL28558L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "08/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUV GOT A CHECK ENGINE LIGHT AND WRENCH SYMBOL(POWER TRAIN) AND BEGAN TO JERK AFTER STOPS AT RED LIGHTS OR STOP SIGNS WHILE HEADING TO THE EXPRESSWAY. IT LOST POWER COMPLETELY,WHILE IN MOTION AND NEARLY CAUSED AN ACCIDENT ON THE BELT PKWY. I HAD THE GAS PEDAL FULLY PRESSED DOWN AND COULDN'T ACCELERATE SUDDENLY. I HAD TO DRIVE WITH ON FOOT ON THE BRAKE AND THE OTHER ON THE GAS TO KEEP CONTROL OF THE SUV AND WAS AFRAID IF BE REAR ENDED OR WORST AT HIGH SPEED. I GOT OFF AT THE NEAREST EXIT ON THE WAY HOME AND SHUT IT OFF. I LET IT REST A FEW MINUTES AND CUT BACK ON AND IT DROVE LIKE NORMAL WITH LOW RPM'S AND A CONSTANT SHUTTERING OR PINGING FEELING AND SOUND. I BROUGHT THE SUV TO JAMAICA NY LINCOLN/FORD SERVICE CENTER WHO TOOK THE SUV FOR CLOSE TO 1 MONTH AND GAVE IT BACK STATING \"IT NEEDS A THROTTLE BODY\". NOTHING ELSE IS WRONG WITH IT. IT'S NOT A TRANSMISSION ISSUE, OR ELECTRONICAL ISSUE ITS THE ENGINE. THEY ALSO SAID ALOT OF FORD VEHICLES HAVE HAD THE SAME ISSUES AND IT WAS A FAULTY THROTTLE BODY. I'VE CHANGED THIS SUV'S ENGINE, TRANNY, CONVERTERS, SPARK PLUGS, COILS, ETC ETC ETC. THE SERVICE RECORDS FROM PURCHASE DATE, YEAR TO DATE ARE SO LONG IT'S STUNNING! EVERY 90 DAYS IT HAS HAD TO BE SERVICED FOR SOME REASON OR ANOTHER. I FOUND MY SELF OUT OF IT FOR 1 MONTH EVERY QUARTER OF A YEAR. THAT'S RIDICULOUS!!! LINCOLN/FORD HASN'T DONE MUCH TO HELP ME AND I'VE PURCHASED SEVERAL VEHICLES FROM THE SAME DEALERSHIP. SMH. I'VE WENT TO PRIVATE MECHANICS WHO BELIEVE IT'S THE TRANNY AGAIN, AND SOME LEAN YEARS THE THROTTLE BODY UNIT. NOBODY CAN EVEN GIVE ME AN EXACT ANSWER AS TO WHAT IT IS AND A SOLUTION TO MY SUV NIGHTMARE! I'VE ALREADY WASTED $500.00. ANYWAY YOU CAN ASSIST ME OR HELP ME WOULD BE GREATLY APPRECIATED. THANKS FOR LISTENING.",
        "vin": "5LMFU28508L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908828,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD COMPLETE BRAKE FAILURE 5 TIMES DURING NORMAL OPERATIONS.  VEHICLE WAS SERVICED BY FORD DEALERSHIP AND RECOMMENDED BRAKE REPAIRS AND/OR UNABLE TO REPRODUCE.  UPON LAST TIME, TECHNICIAN FOUND A FORD SERVICE BULLETIN THAT COVERED OTHER SIMILAR MODELS AND YEARS HAVING EXACT SAME PROBLEM.  THEY REPLACED THE TRACTION CONTROL MODULE, BUT STATED THAT IT WAS A VOLUNTARY REPLACEMENT.  LOSING BRAKES ON A 6,000 POUND CAR GOING 30MPH IS A RECIPE FOR SERIOUS DEATH OR INJURY.  THIS COMPONENT SHOULD BE RECALLED.  THE CAR HAS FULL PAPERWORK FROM PREVIOUS BRAKE REPAIRS, PREVIOUS REQUEST FOR BRAKE REPAIRS AND THE CURRENT REPLACEMENT OF THE TRACTION CONTROL MODULE BLACK BOX.  THERE ARE OTHER CAR OWNERS ONLINE THAT HAVE EXPERIENCED THE SAME ISSUE INCLUDING SEVERAL THAT WON LEMON LAW LAWSUITS.   LINCOLN REFUSES TO ACKNOWLEDGE THE FAULTY COMPONENT AND STATES THAT THE REPLACEMENT WAS CUSTOMER REQUESTED AND VOLUNTARY WITH NO CONCERN THAT THEIR VEHICLE LOSES BRAKES.  DISCUSSIONS WITH THE LINCOLN \"CONCIERGE\" CUSTOMER SERVICE ARE RECORDED.   FAILURES HAPPENED WHEN CAR WAS TRAVELING 30MPH AND BRAKING ON A DOWNHILL SLOPE.   TECHNICIAN SUGGESTED THAT DURING SUCH A BRAKE FAILURE TO TURN OFF THE TRACTION CONTROL WHICH IS AN UNREASONABLE REQUEST.  THE COMPANY DOES NOT SEEM TO BE TAKING THE LOSS OF BRAKES THAT COULD RESULT IN DEATH OR INJURY SERIOUSLY.",
        "vin": "5LMFU27538L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY THE BRAKES WERE APPLIED TO SLOW THE VEHICLE. WHEN THE BRAKE PEDAL WAS DEPRESSED, A LOUD GRINDING NOISE AND PEDAL SHUDDER WAS FELT. BRAKE POWER DIMINISHED, AND THE ANTI-SKID LIGHT ILLUMINATED. ONCE OFF THE PEDAL, THE CAR COASTED FOR A FEW SECONDS. THE BRAKE WAS APPLIED, AND THE SYSTEM WENT BACK TO NORMAL. FORD IS UNABLE TO FIND AN ISSUE WITH THE SYSTEM OR DUPLICATE THE EVENT. ABS WAS NOT ENGAGED IN THIS SITUATION. GRADUAL BRAKE PEDAL PRESSURE WAS APPLIED TO SLOW THE VEHICLE, NOT COME TO ABRUPT STOP. HOWEVER, THE CAR WAS UNABLE TO SLOW DUE TO THE MALFUNCTION.",
        "vin": "5LMFU27538L"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837550,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR. THE CONTACT STATED AT LOW SPEEDS THE VEHICLE BRAKE PEDAL WENT TO THE FLOORBOARD AND FAILED TO RESPOND. IN ADDITION, THE TRACTION CONTROL AND THE MAINTENANCE WARNING INDICATORS ILLUMINATED. THE CONTACT STATED AFTER A FEW MINUTES, THE BRAKE PEDAL FUNCTIONED NORMALLY AND AFTER RESTARTING THE VEHICLE, IT OPERATED NORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "5LMFU27568L"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "01/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822972,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN SPARK PLUGS",
        "vin": "5LMFU28558L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10716234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR. WHILE DRIVING AT 37 MPH, ANOTHER VEHICLE CRASHED INTO THE VEHICLE AND THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED TO AN IMPOUND LOT, BUT WAS NOT DIAGNOSED OR REPAIRED. THE DRIVER AND THE PASSENGER IN THE OTHER VEHICLE SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 101,000.",
        "vin": "5LMFU28558L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "03/28/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663173,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL - FELT LOOSE UNATTACHED PARTS RATTLING AGAINST EACH OTHER IN STEERING ASSEMBLY WHEN CROSSING RAILROAD TRACKS OR UNEVEN PAVEMENT.   *TR",
        "vin": "5LMFU28538L"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "06/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RUNNING BOARD MOTOR FAILURE BILATERALLY, JUST LIKE 2004 MODEL.    REAR WINDOW LEAKS FROM TOP MOULDING., JUST LIKE 2004 MODEL.    REAR LIFT DOOR RUST RIGHT UNDER THE WINDOW, JUST LIKE 2004 MODEL.  *TR",
        "vin": "5LMFL28588L"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2014",
        "dateOfIncident": "10/16/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORS IN SIDE STEP BOARDS STOP WORKING. BUTTON TO CONTROL TRUNK DON'T WORK. BACK REAR GATE KEEPS CLOSING HAS HIT THE KIDS AND MYSELF MANY TIMES TRYING TO GET THINGS OUT OF BACK. CASING AROUND DOOR HANDLE BROKE OFF. THIS IS AN EXPENSIVE VEHICLE AND THIS SHOULD NOT BE HAPPENING!  I SEE OTHER NAVIGATORS WITH THE RUNNING BOARDS OUT!  THESE  ITEMS SHOULD BE RECALLED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "06/07/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515631,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR. THE CONTACT STATED WHILE DRIVING 60 MPH, THE PANEL LIGHTING FAILED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHERE IT WAS STATED THE FUSE BOX IN THE DASHBOARD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.  *TR",
        "vin": "5LMFL27528L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2012",
        "dateOfIncident": "03/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE STEP BOARDS DON'T WORK. WINDOWS STOP WORKING DUE TO THE DESIGN OF VEHICLE AND WATER GETTING IN. POWER HEATING AND COOLING SEATS DON'T WORK. BACK REAR GATE KEEPS CLOSING HAS HIT THE KIDS AND MYSELF MANY TIMES TRYING TO GET ITEMS OUT OF BACK. CASING AROUND DOOR HANDLE BROKE OFF. THIS IS AN EXPENSIVE VEHICLE THESE COMPLAINT ARE MADE BY NUMEROUS PEOPLE OWNING THIS VEHICLE AND SHOULD BE RECALLED.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2012",
        "dateOfIncident": "12/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES WILL FAIL WITHOUT ANY WARNING.  I WILL BE DRIVING AND ALL OF A SUDDEN MY BRAKES WON'T WORK.  THE ANTI-SKID LIGHT WILL GO ON ALONG WITH GRINDING NOISES.  IT FEELS LIKE I AM PRESSING A STAKE DOWN THROUGH ROCKS AS I PRESS DOWN ON THE BRAKE PEDAL.  DURING THIS TIME, I HAVE NO CONTROL OVER THE BRAKES AND I PANIC THAT THE CAR WILL NOT STOP.  AFTER A FEW SECONDS, THE BRAKES WORK ONCE AGAIN.  I HAVE TAKEN THE CAR INTO THE DEALERSHIP MULTIPLE TIMES FOR THIS ISSUE AND THEY HAVE NEVER BEEN ABLE TO FIX IT.  THE SITUATION KEEPS HAPPENING.  THE MOST RECENT OCCURRENCE WAS IN JANUARY, 2012.  I AM VERY SCARED TO DRIVE THIS CAR.  I HAVE BEEN VERY FORTUNATE THAT ANOTHER CAR HASN'T BEEN CLOSE BY WHEN MY BRAKES HAVE FAILED.   *KB",
        "vin": "5LMFL27568L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/26/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT 2008 LINCOLN NAVIGATOR.  THE CONTACT STATED THE DRIVER AND PASSENGER SIDE WINDOW REGULATOR MALFUNCTIONED MAKING BOTH WINDOWS INOPERABLE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THE DEALER REPLACED BOTH REGULATORS.  THE CONTACT CALLED THE MANUFACTURER REGARDING THE WINDOW REGULATORS AND THE MANUFACTURER INFORMED HIM THAT THERE WERE NO RECALLS ON THE VEHICLE.  THE CONTACT STATED THE WINDOW REGULATOR IS A MANUFACTURER DEFECT THAT SHOULD BE ADDRESSED.  THE FAILURE MILEAGE WAS 65,208.",
        "vin": "5LMFU28548L"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2011",
        "dateOfIncident": "06/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR. THE CONTACT STATED THAT THE NAVIGATION SYSTEM WOULD CONTINUOUSLY PROVIDE ERRONEOUS DIRECTIONS. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE SYSTEM NEEDED TO BE UPDATED. THE CONTACT DECLINED, STATING THAT HE DID NOT BELIEVE THAT THE UPDATE WOULD CORRECT THE FAILURE.  THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 20,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379732,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCLON NAVIGATOR. WHILE DRIVING APPROXIMATELY 20 MPH, THE CONTACT APPLIED PRESSURE TO THE BRAKE PEDAL AND THE VEHICLE CAME TO A COMPLETE STOP AND JERKED FORWARD. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TRANSMISSION CONTROL MODULE CALIBRATION WAS REPROGRAMMED AND UPDATES WERE MADE TO THE POWER TRAIN CONTROL MODULE. THE CONTACT CONTINUED TO EXPERIENCE THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER FIVE TIMES WHERE THE SAME REPAIRS WERE MADE EACH TIME. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 78,300.",
        "vin": "5LMFU27598L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "06/17/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276882,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR.  THE VEHICLE BURST INTO FLAMES WHILE PARKED IN THE GARAGE.  BOTH THE VEHICLE AND THE GARAGE WERE DESTROYED.  THE FIRE INVESTIGATOR COULD NOT DETERMINE WHY THE FIRE OCCURRED.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 22,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/08/2008",
        "dateOfIncident": "12/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251124,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED NAVIGATOR 2008 IN HOTEL PARKING LOT, GETTING READY TO EXIT VEHICLE AND THE REAR WINDOW EXPLODED IN A MILLION PIECES.  NO FOREIGN OBJECTS INVOLVED. *TR",
        "vin": "5LMFU27558L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/13/2008",
        "dateOfIncident": "05/13/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230946,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR.  THE CONTACT STATED THAT HIS WIFE HAD A FLAT TIRE ON THE REAR PASSENGER SIDE OF THE VEHICLE.  HE NOTICED THAT THERE WERE TWO DIFFERENT TIRE SIZES ON THE VEHICLE.  THE FRONT TIRES WERE LARGER THAN THE REAR TIRES.  HE BELIEVED THAT THE DIFFERENCE IN THE TIRE SIZES COULD POSSIBLY CAUSE A POTENTIAL SAFETY HAZARD.  AT THE TIME OF THE COMPLAINT, THE CONTACT COULD NOT LOCATE THE TIRE SIZES.  THE CURRENT MILEAGE WAS APPROXIMATELY 7,000 AND FAILURE MILEAGE WAS APPROXIMATELY 3,000.   THE TIRE HAD A NAIL IN IT. ALSO THE TIRE PRESSURE SENSOR WAS INOPERATIVE. UPDATED 07/08/08",
        "vin": "5LMFU27568L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/06/2008",
        "dateOfIncident": "02/27/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230132,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR.  WHILE DRIVING BETWEEN 30-45 MPH, THE TRACTION LIGHT BEGAN BLINKING ON THE INSTRUMENT PANEL.  IN ADDITION, THE STOPPING DISTANCE INCREASED WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE CONTACT DID NOT NOTICE ANY DIFFERENCES IN THE VEHICLE PRIOR TO THE FAILURES.  THE VEHICLE WAS DIAGNOSED BY THE DEALER, BUT THE FAILURES STILL PERSIST.  THE CURRENT MILEAGE WAS 9,200 AND FAILURE MILEAGE WAS 3,000.",
        "vin": "5LMFU28558L"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": true,
        "dateComplaintFiled": "01/14/2008",
        "dateOfIncident": "12/18/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214805,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN NAVIGATOR SOMETIMES HAS NO BRAKES.  HAVE ALREADY HAD ONE ACCIDENT BECAUSE OF THIS.  TOOK THE NAVIGATOR IN TO THE DEALERSHIP AND THEY CHECKED IT OUT AND SAID THERE WAS NOTHING WRONG. WROTE FORD A LETTER AND THEY REPLIED \"THE CIRCUMSTANCES WHICH YOU OUTLINED CONCERNING YOUR NAVIGATOR, HAVE BEEN GIVEN CAREFUL CONSIDERATION.  FORD MOTOR COMPANY CONSIDERS THE SATISFACTION OF ITS OWNERS TO BE ONE OF OUR MOST IMPORTANT OBJECTIVES.  WE COMMIT VERY SUBSTANTIAL RESOURCES AND EFFORT IN A SINCERE ATTEMPT TO RESOLVE THE CONCERNS OF OUR OWNERS.  HOWEVER, LIMITS MUST BE PLACED ON THOSE EFFORTS.  ALTHOUGH WE REGREST NOT BEING ABLE TO MEET YOUR EXPECTATIONS, OUR REVIEW INDICATES THAT THE INFORMATION PROVIDED BY YOUR DEALER IS APPROPRIATE.  THEREFORE, WE ARE UNABLE TO BE OF FURTHER ASSISTANCE IN THIS MATTER.\"  THIS IS NOT ACCEPTABLE!  I PAID $60,000 FOR THIS VEHICLE AND AM AFRAID TO DRIVE IT.  *TR",
        "vin": "5LMFU28568L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN NAVIGATOR.  A DAY AFTER THE VEHICLE WAS PURCHASED, THE CONTACT SMELLED SOMETHING BURNING.  SHE RETURNED TO THE DEALER TO HAVE THE VEHICLE DETAILED AND INFORMED THEM THAT SHE COULD SMELL SOMETHING BURNING.  THE DEALER STATED THAT THE SMELL ORIGINATED FROM THE UNDERCOATING.  TWO DAYS LATER, HER HUSBAND DROVE THE VEHICLE AND THE COUPLE RETURNED TO THE DEALER.  UPON ARRIVING AT THE DEALER, THERE WAS BLACK SMOKE RISING FROM THE VEHICLE.  THE DEALER STATED THAT THE TRANSAXLE LEAKED FLUID DUE TO THE SEAL UNIT.  AT THAT TIME, THE CONTACT'S HUSBAND STATED THAT HE WAS NOT PURCHASING THE VEHICLE AND WANTED HIS OLD VEHICLE BACK.  THE DEALER REFUSED.  THE DISTRICT OFFICE STATED THAT THEY WOULD BE ABLE TO GET THE OLD VEHICLE BACK WITHIN 48 HOURS.  THE CONTACT HAS BEEN UNABLE TO REACH ANYONE SINCE THAT TIME.  CURRENTLY, SHE DOES NOT HAVE HER OLD VEHICLE, RETURNED THE VEHICLE THAT WAS PURCHASED, AND HAS NOT RECEIVED A REFUND FOR THE $3,400 DOWN PAYMENT.  THE CURRENT AND FAILURE MILEAGES WERE 48.",
        "vin": "2LMDU88C48B"
    }
]