[
    {
        "components": "SERVICE BRAKES, AIR,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458318,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Lincoln MKX. The contact stated that while operating the vehicle the ABS, air bag, and check engine warning lights remained illuminated. The vehicle was taken to an independent mechanic who replaced the ABS sensor; however, the failure persisted. The local dealer and manufacturer were not notified of the failure. The failure mileage was 134,000.",
        "vin": "2lmdu88c38b"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448192,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata recall. The contact owns a 2008 Lincoln MKX. The contact received notification of NHTSA Campaign Number: 21V158000 (Air Bags) and contacted the manufacturer for assistance with locating a dealer who had the parts for the recall repair;  however, the manufacturer informed her that the local dealers did not yet have parts for the recall repair. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/20/2021",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11421749,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The fuel system was faulty on my 2008 MKX, my life as well as my family life was almost loss due to the fact that my MKX caught on fire.  Everytime I would put gas in my truck when i got back in the cabin I always smell gas.  One time when i was on my way to work I walked outside and smelled gas and when I looked under my truck I could see the gas leaking out at an alarming rate, i put a pan under it and went to work to tell them i need some time off cause if someone walk by my car  smoking they would blow up, I got it fix and it was the fuel system and cost me 800 dollars and at that time the mileage was around 117000.  Yesterday on fathers day I watch my MKX burn to the ground and me and my family almost didnt make it out. Lincoln knew about this problem since 2013 and have done nothing about it, to this day there are Innocence people driving these MKX and their life is in danger just like my family life was put in danger and they knew about the problem NHTSA campaign number 14V68200 (fuel system, gasoline) since 2013 here it is 2021 and I almost loss my family and they knew since 2013, 9 years later and i had the same problem and at the same mileage as these other complaints",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MKX DRIVER SEAT AND PASSENGER SEAT KEEP ROCKING BACK AND FORTH. MY FIANC WAS DRIVING 40 MPH WE START TO SLOW DOWN ON A CITY STREET AND AS HE IS STOPPING HIS SEAT ROCKS BACK AND HIS FOOT COMES OF THE BREAK AND ALMOST HITS THE BACK OF ANOTHER CAR. I'M SITTING IN THE PASSENGER SEAT ALSO FEELING MY SEAT MOVE AS WELL. I LOOK OVER AT HIM AND SEE HIS FACE AND YOU CAN TELL HE GOT SCARED FOR A SECOND BECAUSE HE IS WONDERING WHY HIS SEAT ROCKED BACK AND HE ALMOST HIT A CAR IN FRONT OF HIM.IT IS ALSO HAPPENING WHEN ACCELERATING. MAKING IT A SAFETY HAZARD AS WELL BECAUSE YOU ARE SLOWING DOWN WHILE THE DRIVER BEHIND US IS SPEEDING UP AND COULD POSSIBLY HIT US BECAUSE OUR FOOT IS NO LONGER ON THE GAS.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414949,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PANORAMIC STATIONARY GLASS (SUNROOF) SHATTERED ON ITS OWN, NO IMPACT FROM ANYTHING. SHATTERED IN ALL 4 CORNERS. CAR WAS STATIONARY IN PARKING LOT.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER REAR DOOR WILL NOT UNLOCK. TOU CAN'T OPEN FROM OUTSIDE OR INSIDE. MY GRANDSON GOT STUCK. I HAD TO HAVE HIM USE A DIDN'T DOOR TO GET OUT. IF THERE WAS A ACCIDENT HE WOULD HAVE BEEN STUCK IN THERE. IT WAS STATIONARY",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COMPUTER  /TRANSMISSION   /ALT    AT BILL TALLEY FORD ELECTRICAL SYSTEM INSTALLED ALT. THEN WAS TOLD I HAD TRANSMISSION PROBLEMS NEVER HAD BEFORE THEY PROGRAMED ENGINE COMPUTER TWO TIMES AND GAVE THE CAR BACK   BACK TO ME WITH PROBLEMS  I NEVER HAD AND COULD SOLVE",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AND TRANSMISSION SHIFT TO LOW BY ITSELF. IT ALMOST CAUSED ME TO GET IT. THE PTU IS LEAKING TRANSMISSION FLUID. YOUNEVERKNOW WHEN IT IS LOW. THIS CAR HAD THIS PROBLEM SINCE IT WAS MANUFACTURED AND THEY NEVER FIXED THE PROBLEM. IT NEEDS TO BE FIXED AND NEEDS A HEAT SHIELD BETWEEN THE PTU AND THE ENGINE TO KEEP IT FROM LEAKING AND CAUSING DANGEROUS SITUATIONS ON THE ROAD. THE CAR SMOKES SO BAD THAT IT LOOKS LIKE IT IS ON FIRE. SCARED TO DRIVE BECAUSE I NEVER KNOW WHAT WILL HAPPEN IF THE FLUID IS LOW. YOU CAN SEE THE LEAK FROM THE PTU UNDER THE CAR. NOT MANY PEOPLE COMPLAINED ABOUT IT BECAUSE THEY DON'T KNOW ABOUT THIS WEBSITE. THIS IS REALLY DANGEROUS IF IT DOESN'T GET RECALLED SOON. WHEN THE CAR WAS MANUFACTURED IT WAS UNDER WARRANTY. SO THEY FIXED IT THEN BUT WHEN THE WARRANTY WAS UP. IT WAS UP TO THE CUSTOMER TO DISHUP 2500.00 TO FIX IT. YOU CAN CALL AMCCO IN ZANESVILLE OHIO THEY WILL TELL YOU HOW MANY GOT FIXED UNDER WARRANTY. THE PROBLEM IS THE PTU IS SO CLOSE TO THE ENGINE IT BURNS THE FLUID IN IT. EVENTUALLY IT WEARS OUT OTHER SEALS IN THE TRANSMISSION, WHICH MAKES THINGS WORST. MY CAR SITS MOST OF THE TIME. TOO SCARED TO DRIVE IT. PLEASE HELP ME GET A RECALL ON THIS. IF YOU LOOK UP PROBLEMS WITH 2008 LINCOLN MKX YOU WILL SEE THAT IS ONE OF THE MAIN PROBLEMS",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375459,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PTU LEAKS TRANSMISSION FLUID. I WAS TOLD THIS WAS A PROBLEM SINCE THE CAR WAS MANUFACTURED. I WANTED TO KNOW WHY THERE WASN'T A RECALL ON IT. IT CAN DAMAGE OTHER SEALS ON CAR AND CAUSE A SAFETY HAZARD. I JUST BROUGHT MY CAR A MONTH AGO AND WAS NEVER TOLD ABOUT IT. I WAS TOLD NOT TO DRIVE IT THAT OFTEN TILL I GET IT FIXED. MY CAR WAS NOT SHIFTING RIGHT, SMOKING, AND I HAVE TO ADD TRANSMISSION FLUID TO IT. THERE IS NO WAY TO TELL IF IT HAS TOO MUCH, WHICH WILL CAUSE IT TO HAVE OTHER PROBLEMS IN THE LONG RUN. YOU SEE THE SMOKE WHEN DRIVING. IT LOOKS LIKE THE CAR IS ON FIRE",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD NUMEROUS ALIGNMENTS AND TIRES SINCE GOT THIS VEHICLE LAST YEAR AND NOW IT'S SHACKING, RIDES LIKES I HAVE A FLAT OR WEAVING UP AND DOWN AND STARTING TO PULL/ STOP WORKING WHILE DRIVING AND CAN'T FIND ANYTHING WRONG STILL HAS ALL ORIGINAL PARTS! LIGHTS GO THRU BULBS AND CAN'T SEE",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351658,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD ALL AIR FILTERS REPLACED AND AIR UNIT REPLACED DUE TO OVER HEATING BUT STILL WHEN TURN AIR ON AND ON SEATS JUMPS OR LOSES THROTTLE AND LIGHTS GO OFF AND AT TIMES SEATS RE ADJUST WHILE DRIVING, KEEPS HAPPING CAN'T FIGURE IT OUT",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350976,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A PIECE OF PLASTIC BROKE ON THE POWER SEAT ACTUATOR, ALLOWING THE SEAT TO CHANGE POSITION UNEXPECTEDLY, PARTICULARLY WHEN ACCELERATING..  THE MANUFACTURER DOES NOT SELL THE BROKEN POWER SEAT ACTUATOR SEPARATELY.  INSTEAD, IT WANTS $1100 TO REPLACE THE ENTIRE SEAT BASE.  THE RESULT IN THAT PEOPLE CANNOT AFFORD TO GET THIS SAFETY ITEM FIXED",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341631,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT THE POWER BRAKE BOOSTER FAILED WHILE HIS DAUGHTER WAS DRIVING AT AN UNDISCLOSED SPEED. THE CONTACT STATED THAT ADDITIONAL FORCE WAS APPLIED ON THE BRAKE PEDAL TO BRING THE VEHICLE TO A STOP. THE CONTACT STATED THAT HE WAS NOT AWARE OF ANY WARNING LIGHTS BEING ILLUMINATED. THE CONTACT CALLED BRONDES FORD LINCOLN MAUMEE (1475 ARROWHEAD RD, MAUMEE, OH 43537), AND INFORMED THE DEALER OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT SUBJECTED TO A RECALL. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE CONTACT MADE AN APPOINTMENT WITH AN INDEPENDENT MECHANIC TO HAVE THE VEHICLE REPAIRED WHICH WAS STILL PENDING. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 150,000.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "04/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL INITIALLY HAVE THE SPEED ODOMETER DROP TO 0 MPH WHILE STILL MOVING. A \"WRENCH\" LIGHT WILL ILLUMINATE ALONG WITH THE AIRBAG LIGHT. THE VEHICLE WILL LOSE POWER AND NOT SHIFT PROPERLY. ONCE THE VEHICLE COMES TO A STOP, THE DRIVER MUST PUSH THE ACCELERATOR DOWN UNTIL THE TACH READS APPROX. 3000 RPMS BEFORE THE VEHICLE WILL START MOVING AGAIN. WHEN IT IS MOVING IT SHIFTS ERRATICALLY AND \"BANG\" THE GEARS. IF THE DRIVER, AFTER STOPPING, TAKES THE VEHICLE OUT OF DRIVE AND PUTS IN REVERSE, IT BANGS THE TRANSMISSION SO HARD IT FEELS IT GOING TO DROP OUT OF THE VEHICLE. THIS HAPPENED TO ME A NUMBER OF TIMES. THE IMAGE I ATTACHED I WAS GOING 55 MPH.  *TR",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318365,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM GASOLINE) IN 2015 BY BRAD MANNING FORD INC., LOCATED AT (901 S 4TH ST, DEKALB, IL 60115 815-756-6325), DUE TO A FUEL LEAK. THE CONTACT WAS CONCERNED THAT THE REPAIR WAS IMPROPERLY PERFORMED. THE CONTACT STATED THAT THERE WAS LEAK AT THE SEAMS OF THE FUEL TANK. THE CONTACT REACHED OUT TO LINCOLN DIVISION AND WAS INSTEAD REFERRED TO CONTACT FORD MOTOR COMPANY. FORD MOTOR COMPANY WAS CONTACTED AND INFORMED THE CONTACT THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY AND THAT THE VEHICLE WOULD HAVE TO BE REPAIRED OUT OF POCKET AT A COST OF $2,000. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 125,550.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308774,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT THERE WAS A STRONG FUEL ODOR IN THE CABIN OF THE VEHICLE. THE CONTACT LOOKED UNDERNEATH THE VEHICLE AND BECAME AWARE OF FUEL LEAKING FROM THE FUEL TANK. DANA FORD LINCOLN LOCATED AT 266 WEST SERVICE ROAD, STATEN ISLAND, NY 10314 (718) 983-8700, WAS CONTACTED BY PHONE AND INFORMED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED NOR INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 139,000.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/06/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307447,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING 2008 LINCOLN MKX PASSENGER SEAT CAUGHT ON FIRE, HEATED SEAT WAS NOT ON",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF THE OWNER OF A 2008 LINCOLN MKX. WHILE DRIVING 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. ALSO, THE VEHICLE FAILED TO SLOW DOWN WHEN THE BRAKE PEDAL WAS DEPRESSED AND THE POWER STEERING BECAME INOPERABLE. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD AND TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE THROTTLE BODY POSITION SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. A LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 115,575.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269227,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A FUEL LEAK COMING FROM THE VEHICLE. THE CONTACT SMELLED FUEL OUTSIDE THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM, GASOLINE). THE CONTACT CALLED PURVIS FORD LINCOLN (LOCATED AT 3660 JEFFERSON DAVIS HWY, FREDERICKSBURG, VA 22408, (540) 898-3000) AND INFORMED THEM OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 176,000.",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166267,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V384000 (AIR BAGS) AND 14V682000 (FUEL SYSTEM, GASOLINE). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUTONATION FORD TORRANCE AT (424-253-4976 (LOCATED AT 3111 PACIFIC COAST HWY, TORRANCE, CA 90505) AND WAS INFORMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBERS: CA516177384 AND CAS16177323. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. NORTHTOWNE FORD LINCOLN (21 NE VIVION RD, KANSAS CITY, MO 64118, (816) 453-2710) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161004,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE DEALERS (MAXWELL FORD, 5000 S IH 35 FRONTAGE RD, AUSTIN, TX 78745, (512) 443-5000) AND (LEIF JOHNSON FORD, 501 E KOENIG LN, AUSTIN, TX 78751, (512) 454-3711) STATED THAT THE PARTS WERE UNAVAILABLE AND DID NOT KNOW WHEN THEY WOULD ARRIVE. THE MANUFACTURER WAS CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154008,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. FIESTA LINCOLN (1720 SOUTH MESA DRIVE, MESA, ARIZONA 85210, (480) 428-3254) WAS MADE AWARE OF THE RECALL IN 2016 AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *TT  CONSUMER STATED AIR BAG WAS REPLACED IN DEC. 2018 *JB",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152491,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  NHTSA RECALL NUMBER 16V384  MANUFACTURER RECALL NUMBER 16S26  RECALL INCOMPLETE",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150436,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  MY VEHICLE WAS INVOLVED IN THE TAKATA AIRBAG RECALL. I WAS APPROVED FOR A RENTAL CAR IN MAY 2018, WHICH I HAD BEEN DRIVING UNTIL 5 OCT 2018. I RECEIVED THE PHONE CALL FROM MY LOCAL FORD DEALERSHIP, GARY SMITH FORD IN FORT WALTON BEACH, FL ABOUT A WEEK PRIOR THE THE 5TH OF OCTOBER INFORMING ME MY AIRBAGS WERE IN AND I COULD BRING MY VEHICLE IN FOR REPLACEMENT. I BROUGHT IT IN FOR A 1200 APPOINTMENT ON 05 OCTOBER 2018. MY HUSBAND WENT TO PICK THE VEHICLE UP, WHICH HE HAD TO DROP OFF THE RENTAL VEHICLE BEFOREHAND AND GET THE RECEIPT TO GIVE TO THE FORD DEALERSHIP BEFORE HE COULD GET MY VEHICLE BACK. HE WAS WAITING FOR AWHILE BECAUSE THE DEALERSHIP WAS BUSY AND THEY EVENTUALLY TOLD HIM THAT THEY WOULD MAIL THE RECEIPT/SERVICE PAPERWORK TO US, WHICH WE STILL HAVE NOT RECEIVED TO THIS DAY. SINCE I RECEIVED MY VEHICLE BACK, I HAVE BEEN DRIVING IT ON A DAILY BASIS WITH NO CONCERNS. TODAY, 09 NOV 2018 AT 5:22 PM I RECEIVED A PHONE CALL FROM GARY SMITH FORD TO NOTIFY ME THAT MY AIRBAGS HAVE ARRIVED AND I MAY SCHEDULE AN APPOINTMENT TO HAVE MY VEHICLE FIXED. I TOLD THE WOMAN I HAD ALREADY BROUGHT MY VEHICLE IN ABOUT A MONTH AGO TO HAVE MY AIRBAGS REPLACED AND SHE SOUNDED SURPRISED. SHE ASKED IF I WERE STILL IN A RENTAL CAR, IN WHICH I TOLD HER NO BECAUSE MY AIRBAGS HAD SUPPOSEDLY BEEN REPLACED. SHE TRIED TO GET OFF THE PHONE WITH ME QUICKLY BUT I INTERRUPTED HER AND ASKED HER TO VERIFY IN THE SYSTEM THAT MY AIRBAGS HAD BEEN REPLACED. SHE TOLD ME SHE HAD NO RECORD OF ANY SERVICE ON MY VEHICLE IN THE SYSTEM. SHE ASKED A COWORKER, WHOM WAS APPARENTLY ABLE TO VERIFY THE SERVICE. THIS PHONE CALL LEFT ME UNEASY SO I CHECKED MY VIN ON THIS WEBSITE FOR OPEN RECALLS AND IT STATES AS OF 09 NOV 2018, THERE IS STILL AN OPEN RECALL FOR THE TAKATA AIRBAG ON MY VEHICLE. I DO NOT BELIEVE THE DEALERSHIP REPLACED MY AIRBAGS LIKE THEY HAD INFORMED ME THEY HAD.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149677,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE DEALER (EAST WEST LINCOLN, 7591 ANNAPOLIS RD, NEW CARROLLTON, MD 20784) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145356,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVE LETTER AFTER LETTER TELLING MY AIRBAG CAN CAUSE MY DEATH BUT YEARS LATER THE PARTS STILL HAVEN'T ARRIVED.  THIS SEEMS UNACCEPTABLE.  I HAVE ASKED THE DEALERSHIP TO DISABLE THE AIRBAG BUT THEY CANNOT.  HOW MANY PEOPLE SHOULD DIE WAITING FOR PARTS?",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS RECALL  CONTINUED  DELAYS... DRIVING AN UNSAFE VEHICLE.  LINCOLN SAYS THEY DON'T KNOW WHEN REPLACEMENT AIRBAG WILL BE AVAILABLE!  NOT ACCEPTABLE. NEED NHTSA INVOLVEMENT TO RESOLVE THIS MAJOR SAFETY ISSUE!",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG RECALL",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144302,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT ADVISED NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS) HAD EXCEEDED A REASONABLE TIME FOR REPAIR. THE CONTACT STATED THAT THE RECALL NOTIFICATION WAS RECEIVED TWO YEARS AGO. THE MANUFACTURER WAS CONTACTED. THE MANUFACTURER ADVISED THAT PARTS SHOULD BE AVAILABLE AT THE FOURTH QUARTER OR AT THE END OF 2018.  PARTS DISTRIBUTION DISCONNECTS.",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "05/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION FROM THE NY DMV AND NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED RC LACY FORD LINCOLN SUBARU DEALER ((519) 943-4300, 25 MAPLE AVE, CATSKILL, NY 12414) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND INFORMED THE CONTACT THAT THE PART WAS NOT AVAILABLE AND DID NOT OFFER ANY FURTHER ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA AIR BAG RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. STAR LINCOLN (24350 WEST 12 MILE ROAD, SOUTHFIELD, MICHIGAN 48034, (248) 354-4900) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILALBE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR IN FOR SERVICE BECAUSE ABS LIGHT CAME ON AND BRAKES WOULD SCRUB WHEN STOPPING. DEALER REPLACED WHEEL SENSOR AND TOLD US THAT BRAKE BOOSTER WAS BAD, SO WE AGREED TO REPLACEMENT. AFTER REPAIRS, WITH NEW BRAKE BOOSTER THE BRAKES SOMETIMES ARE REAL HARD TO PUSH AND DO NOT STOP THE CAR CORRECTLY. VERY UNSAFE CONDITION. IT SEEMS TO BE RE-OCCURRING AND SHORT-LIVED WHEN IT HAPPENS, BUT WHO KNOWS WHEN IT WILL HAPPEN AT THE WRONG TIME. DEALER ALSO SUGGESTED NEW PADS WHICH HAD JUST BEEN REPLACED???",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143948,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NOTIFIED OF THE RECALL IN JULY 2016;  NEARLY 2 1/2 YEARS LATER NOTHING HAS BEEN DONE",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143513,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, STILL WAITING ON REPAIR FOR PASSENGER SIDE AIRBAG, RECALL STARTED MARCH 2017? CAMPBELL FORD IN NILES MI. SAID NO LOANER CARS AVAILIABLE? I CALLED ANOTHER FORD DEALERSHIP THAT TOOK DOWN VIN NUMBER AND SAID THEY WOULD CALL WHEN PARTS ARE AVAILIABLE, STILL WAITING?",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11143334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2016 I WAS THE DRIVER AND WAS IN A ACCIDENT THE AIRBAG DEPLOYED AND CUT MY LEFT FOREARM OPEN.  WAS TREATED AT HOSPITAL AND THEY GLUED IT TOGETHER.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143362,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  RECALL NUMBER NHTSA RECALL 17V-024",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143419,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TACKATA RECALL SINCE JUNE 1 2016 DEPLOYMENT OF PASSENGER  AIR BAG HAS FATAL METAL FRAGMENTS",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "06/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143432,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I FIRST RECEIVED NOTICE IN JUNE 2016 OF THE RECALL.  ANOTHER NOTICE WAS SENT IN DECEMBER 2017 INDICATING PARTS WERE NOT AVAILABLE.  ANOTHER LETTER WAS SENT EARLIER THIS YEAR, STILL NO PARTS.  OVER 2 YEARS IS NOT TIMELY IN RESOLVING THIS ISSUE.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTICE IN JUNE OF 2016. THE DEALER (PARKS LINCOLN OF LONGWOOD, 3505 N US HWY 17 92, LONGWOOD, FL 32750) STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS ALSO CONTACTED AND CONFIRMED THAT THE PARTS WERE UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOLS CONFIRMS PARTS NOT AVAILABLE. *TT  CONSUMER STATED PARTS WERE INSTALLED 11/07/18. UPDATED 12/18/18*JB",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142112,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM LOUISIANA OMV ABOUT AIRBAG RECALLS IN AUGUST 2018. BROUGHT THE VEHICLE TO THE DEALERSHIP TO HAVE THIS FIXED. I WAS INFORMED THAT THE PARTS ARE NOT IN STOCK AND THAT THERE ARE THREE OTHER RECALLS ON THIS VEHICLE AS WELL. OVER THE PAST MONTH THEY HAVE CONTINUED TO STATE THAT THE PARTS WERE NOT IN. NOW THAT A MAN TOOK THE VEHICLE ALL OF SUDDEN THEY RECEIVED THE PARTS IN THREE DAYS. HOWEVER, NOW THEY ARE STATING THAT THEY ARE ONLY REPLACING THE PASSENGER AIRBAG AND NOT ALL AIRBAGS AS REPORTED ON THE RECALL FROM LA OMV. WHAT SHOULD I DO? MY DAUGHTER DRIVES THIS VEHICLE AND TRAVELS FOR SCHOOL I AM VERY CONCERNED ABOUT WHAT EXACTLY THEY SHOULD BE REPLACING. IF ALL AIRBAGS NEEDED TO BE REPLACED DUE TO SHRAPNEL TWO MONTHS AGO HOW IS IT NOW ONLY ONE NEEDS TO BE REPLACED?",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141930,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS WERE NOT AVAILABLE. THE DEALER (BIG SPRING FORD, 500 W 4TH ST, BIG SPRING, TX 79720, 432-267-7424) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140325,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A MONTH AGO, WHILE DRIVING ON THE INTERSTATE MY ABS AND TRACTION CONTROL PANEL LIGHTS LIT UP WITH SEEMINGLY NO INSTIGATOR,  THEY STAYED ON UNTIL I GOT OFF THE INTERSTATE THEN WENT AWAY. FROM THEN ON THEY WOULD INTERMITTENTLY POP ON WHICH I EVENTUALLY DISCOVERED WAS MOSTLY ONCE THE VEHICLE WAS GOING OVER 60MPH. ABOUT A WEEK AFTER THE LIGHTS STARTED COMING ON, I NOTICED OCCASIONALLY WHEN I WOULD TRY TO STOP MY VEHICLE THE BRAKES WOULD LOCK UP AS IF I WAS DRIVING ON ICE. I WOULD HAVE TO PUMP MY BRAKES MULTIPLE TIMES TO GET THEM TO ENGAGE WHICH IS VERY NERVE WRECKING. THAT PARTICULAR ISSUE HAS HAPPENED A 2-3 TIMES A WEEK SINCE THEN. I HAVE TAKEN MY VEHICLE IN AND HAD THE SEAL REPLACED WHICH DIDN'T FIX THE ISSUE AND NOW I'M BEING TOLD THAT THIS IS SUCH A COMMON ISSUE AMONG LINCOLN MKX'S, FORD EDGES, AND FORD FUSIONS THAT THEY HAVE \"UPDATED\" AXLES THAT REMEDY THE PROBLEM.    I AM GETTING THESE NEW AXLES TO HOPEFULLY FIX THIS ISSUE BUT THIS HAS BEEN A HUGE SAFETY CONCERN THAT HAS MADE ME NERVOUS TO EVEN PUT MY SON IN THE CAR.",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139663,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE DEALER (SHEEHY FORD LINCOLN OF RICHMOND, 10601 MIDLOTHIAN TURNPIKE, RICHMOND, VA 23235, (804) 794-0500) CONFIRMED THAT THE PART WAS UNAVAILABLE AND STATED THAT THE CONTACT WAS PLACED ON A WAITING LIST. THE DEALER STATED THAT THERE WAS NOT AN OPTION FOR A LOANER VEHICLE DUE TO A LIMITED SUPPLY OF LOANER VEHICLES. THE MANUFACTURER WAS CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED 2 LETTERS ABOUT AIR BAG RECALL, I HAVE REPEATEDLY CALLED VAUGH FORD IN OAKDALE LOUISIANA TO HAVE MY AIRBAGS REPLACED. I AM TOLD THEY CAN NOT GET THE PLACEMENT AIRBAGS. I CALL EVERY MONTH AND RECEIVE NO SATISFACTION, I RECEIVED A LETTER FROM THE DMV OF LOUISIANA ABOUT REPLACEMENT OF AIRBAGS. CAN YOU ASSIST?",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG RECALL",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131470,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL PASSENGER AIR BAG LIGHT GOING OFF AND ON. IT HAS BEEN DOING IT FOR A LONG TIME AND CONTINUES. RECEIVED RECALL NOTICE. PARTS ARE STILL NOT AVAILABLE.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130657,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  17V024000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (HEMPSTEAD FORD, 301 N FRANKLIN ST, HEMPSTEAD, NY 11550, (516)-483-7200) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. VOLVO CARS MT KISCO (271 N BEDFORD RD, MT KISCO, NY 10549, (888) 247-2672) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT RECEIVED A LETTER FROM THE NEW YORK DMV REGARDING THE RECALL. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124236,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKZ. THE CONTACT STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS) SINCE JANUARY 10, 2017; HOWEVER, THE MANUFACTURER HAD NOT PROVIDED THE REMEDY AND PART FOR THE RECALL REPAIR. THE DEALER (HUNTINGTON FORD LINCOLN, 333 W JERICHO TURNPIKE, HUNTINGTON, NY 11743, (631) 271-6800) CONFIRMED THAT THE PART WAS UNAVAILABLE AND COULD NOT PROVIDE A TIME FRAME. THE MANUFACTURER WAS CONTACTED CONCERNING PART AVAILABILITY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I CONTACTED MY LOCAL FORD/LINCOLN (GORDIE BOUCHER) DEALER ON OR ABOUT JULY 26TH, 2018 TO RECEIVE A RENTAL VEHICLE TO DRIVE WHILE WAITING FOR A NEW AIRBAG REPLACEMENT FOR MY 2008 LINCOLN MKX RECALL TO COME IN. THE SERVICE PERSON, MIKE, SAID HE WOULD START THE PROCESS RIGHT AWAY AND I SIGNED A NOTE SAYING I WOULD NOT BE DRIVING THE CAR UNTIL FIXED. TODAY, AUGUST 31, I CALLED AND SPOKE TO THE SAME SERVICE PERSON. HE SAID THAT HE DID NOT GET TO STARTING THE RENTAL CAR PROCESS BUT THAT HE COULD DO SO TODAY. I ASKED HIM TO PROCEED. I HONESTLY DO NOT THINK HE HAS.",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE CONTACT CALLED CORTESE LINCOLN AT 585-277-3252 (LOCATED AT 2452 W HENRIETTA RD, ROCHESTER, NY 14623) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PREMIER FORD INC (5001 GLENWOOD ROAD, BROOKLAND, NEW YORK 11234, (888) 381-4515) WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND PROVIDED THE CONTACT WITH CASE NUMBER: CAS-15651748. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REMEDY. THE DEALER (SANDS FORD OF POTTSVILLE, 440 N CLAUDE A LORD BLVD, RT 61, POTTSVILLE, PA 17901, (570) 622-1991) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2018",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST SEVERAL YEARS, WHILE DRIVING, ALTHOUGH THE ENGINE STAYS ON, THE VEHICLE SIMPLY LOSES TRANSMISSION POWER AND LEAVE ME STRANDED AND IN DANGER ON THE SIDE OF THE ROAD.  THIS HAS PUT BOTH MY WIFE AND IN ME IN PRECARIOUS SITUATIONS WHEN THE CAR HAS ABRUPTLY STALLED IN TRAFFIC AND WE HAVE TO ROLL TO THE SIDE OF THE ROAD.  THIS HAPPENS 2 OR 3 TIMES A YEAR. BOTH IN THE CITY AND ON THE HIGHWAY.  AS LONG AS I SLIGHTLY OVER FILL THE TRANSMISSION WITH FLUID, IT WILL DRIVE FINE FOR ANOTHER 3 OR 4 MONTHS WITH NO ISSUES.  THE PROBLEM IS THAT I CAN NOT FIND ANY TRANSMISSION FLUID LEAKAGE AND HAVE TO OVERFILL THE TRANSMISSION TO BE ABLE TO DRIVE THE VEHICLE.  WHEN I CONTACTED LINCOLN ABOUT THE TRANSMISSION PROBLEM, I WAS FINALLY TOLD THAT THERE HAD BEEN A VOLUNTARY SAFETY ALERT THAT EXTENDED THE MANUFACTURERS 6 YEAR WARRANTY TO 8 YEARS.  BUT, SINCE I NOTIFIED THEM ONE MONTH AFTER THE 8 YEARS HAD EXPIRED, THEY WOULD NOT RESOLVE THE TRANSMISSION SAFETY ISSUE UNDER WARRANTY.  WHEN I WROTE A DISPUTE LETTER TO LINCOLN, ABOUT THE TRANSMISSION SAFETY ISSUE AND TOLD THEM THAT THE VEHICLE HAD LESS THAN 60,000 MILES ON IT AND THAT I WAS NOT TIMELY NOTIFIED ABOUT THE VOLUNTARY SAFETY ALERT, THEY ADVISED ME THAT THE MILEAGE DID NOT MATTER.  THEY ALSO DID NOT CARE WHEN I TOLD THEM THAT I HAVE BEEN A LOYAL CUSTOMER AND OWNED SEVERAL LINCOLNS (AND MERCURYS) OVER THE YEARS.  I AM RETIRED, AND AFRAID TO DRIVE THE CAR ANY DISTANCE AT ALL.  WITH THE TWO YEAR OLD AIR BAG RECALL, WE WERE ADVISED THAT MY WIFE CANNOT EVEN RIDE IN THE PASSENGER SEAT.   ALTHOUGH TWO MONTHS AGO THEY FINALLY PROVIDED A LOANER CAR, IT IS UNCOMFORTABLE FOR MY WIFE WHO HAS HAD MAJOR BACK SURGERY.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122057,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. MASTEL FORD-LINCOLN (1674 E STATE ST, OLEAN, NY) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  **TR  *JS",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BLEVINS FORD INC (1136 US-11, GOUVERNEUR, NY 13642, (315) 287-0200) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "01/30/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121863,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS) AND STATED THAT THE MANUFACTURER FAILED TO REPAIR THE VEHICLE WITHIN A REASONABLE AMOUNT OF TIME. THE DEALER (RIVERHEAD FORD LINCOLN, 1419 OLD COUNTRY ROAD, RIVERHEAD, NY 11901) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. FORD LINCOLN OF QUEEN BOULEVARD (139-48 QUEEN BLVD, JAMAICA, NY) CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "11/03/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALSO LIKE SO MANY OTHERS RECEIVED THE 'TAKATA RECALL' AND CONTACTED MY LOCAL FORD DEALERSHIP WHO ACTED AS IF I WAS SOME CONFUSED OR DELUSIONAL PERSON,  AND INFORMED ME THEY HAD NEVER HEARD OF ANY SUCH RECALL!!  SO I CALLED THE ONLY OTHER FORD DEALERSHIP I KNEW AND THEY EXPLAINED 'OH YEAH, WE HAVE HEARD OF IT, BUT WE HAVE NO PARTS OR AUTHORIZATION NUMBERS TO FIX IT WITH YET'  WELL MY HUSBAND HAS TO SIT IN THAT PASSENGER'S SEAT AS I DRIVE HIM TO THE HOSPITAL ; FOR CANCER SURGERY AT THE END OF THIS MONTH! SO COULD YOU PLEASE TELL ME WHEN THE NHTSA IS GOING TO MAKE FORD MOTOR CORPORATION DO WHAT IS RIGHT? PLEASE.??? NO MORE GRANTED SECRETLY MAILINGS FOR FORD OR TAKATA. PLEASE HELP US!! I MEAN NO DISRESPECT WHATSOEVER TO ANYONE  BUT PLEASE DON'T LET ANY OF  THEM KEEP IGNORING US. PLEASE I DON'T WANT MY HUSBAND TO FIGHT CANCER ONLY TO LOSE HIS LIFE TO A FAULTY AIR-BAG THAT WAS IN MY CAR!!!! PLEASE",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120545,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL     ALTHOUGH, I HAVE NOT BEEN INVOLVED IN AN ACCIDENT, WILL THERE BE A SOLUTION SOON. OR WILL I HAVE TO HAVE AN ACCIDENT FOR THERE TO BE A RESOLVE. IS THERE ANY UPDATES. I'VE NEVER BEEN THROUGH THIS.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114980,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED A 2008 LINCOLN MKX IN MARCH. THE CAR RAN GREAT UNTIL I WENT ON A ROAD TRIP IN THE BEGINNING OF JULY. I DROVE ABOUT A COUPLE 1000 MILES. MY LAST DAY OF MY TRIP ON JULY 12 MY CAR STARTED ACTING UP. IT HAD A HARD TIME SHIFTING BETWEEN GEARS. I WOULD PUSH DOWN ON THE GAS PEDDLE AND IT TOOK IT A LONG TIME TO ACCELERATE. I FINALLY MADE IT TO MY DESTINATION. I TURNED OFF THE CAR. WHEN I WENT TO START IT BACK UP IT STARTED. BUT WHEN I OUT IT IN DRIVE IT WOULDN'T MOVE, NOR IN REVERSE AND COULD NOT GET IT IN TO NEUTRAL. HAD IT TOWED TO A SHOP. WHERE AFTER FURTHER EXAMINATION TO TRANSFER CASE WENT OUT INT TURN RUINED THE TRANSMISSION. NEVER A SIGN THAT ANYTHING WAS WRONG UNTIL THAT JULY 13. I TALK TO THE SHOP THAT SAYS HE HAS FIXED 3 OTHER LINCOLNS WITH THE SAME PROBLEM. IF YOU LOOK ONLINE THERE ARE TONS OF COMPLAINTS ABOUT THIS SAME PROBLEM. SEEMS TO ME FORD NEEDS TO RECALL BOTH THE TRANSFER CASE AND TRANSMISSION. NOW I AM HAVING TO PUT MORE MONEY IN IT THEN ITS WORTH. THE TOTAL COST FOR REPAIR AND LABOR IS $6296.22. IF IT KEEPS HAPPENING TO OTHER PEOPLE OVER AND OVER WITH THE SAME PROBLEM THEN FORD SHOULD HAVE TO BE HELD ACCOUNTABLE FOR SELLING DEFECTIVE PRODUCT. I HOPE SOMETHING CAN BE DONE, ESPECIALLY SINCE THIS AS NOTHING TO DO WITH THE DRIVER BUT THE MANUFACTURER WHO HAS MADE A FAULTY PRODUCT.",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113751,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN. MKX. CONSUMER WRITES IN REGARDS TO AIRBAG SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT COMPLETING THE RECALL REPAIR. *JS",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.        I HAVE BEEN BATTLING FORD AND ITS DEALERSHIPS TO GET ME A LOANER VEHICLE WHILE OUR FAMILY MKX IS PENDING RECALL.  I HAVE BEEN TRYING FOR 7 MONTHS.  I HAVE NOW FILED A BBB COMPLAINT AND GOING THROUGH THAT PROCESS, FILED COMPLAINT WITH OREGON DOJ, AND NOW WITH NHTSA.  WE NEED THIS RECTIFIED ASAP.",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111284,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - YOU GUYS NEED TO GET OFF YOUR ASSES AND GET THIS PROBLEM FIXED. I HAVE BEEN TRYING FOR 2 YEARS TO GET FIXED. RECALL SAYS MY PASSENGER MAY SUFFER DEATH? HOW CAN YOU LET THIS GO ON AND KILL OTHER AMERICANS? PLEASE DO YOUR JOB!!",
        "vin": "NHTSA.GOV/E"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110749,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING BRAKING ISSUES. I HAVE BROUGHT MY MKX TO A DEALER AND WAS INFORMED THAT I NEED A NEW BRAKE BOOSTER. THEY HAVE INFORMED ME THAT FORD IS AWARE OF THIS DESIGN ISSUE. IS THIS COVERED UNDER ANY TYPE OF RECALL SINCE THEY ARE AWARE OF THE ISSUE?",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102638,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  FAILING REPAIR SERVICE FROM LINCOLN/FORD IN REPLACING THE TAKATA AIRBAGS IN OUR VEHICLE. WE RECEIVED THE RECALL NOTICE 1.5 YEARS AGO. WE FOLLOWED THE DIRECTIONS IN THE NOTICE LETTER & CALLED A LOCAL LINCOLN DEALER, NORTH PARK LINCOLN IN SAN ANTONIO, TX. EACH TIME WE CALLED THEY DID NOT HAVE THE PART. NO ONE TOLD US ABOUT THE HIGH RISK OF SERIOUS INJURY RELATED TO THE AIRBAGS. MAY OF 2018 WE GET A LETTER FROM LINCOLN/FORD SAYING THEY HAVE NO PARTS, BUT LINCOLN/FORD WILL PAY FOR A RENTAL CAR UNTIL PARTS COME IN. WE WONDER WHY THEY WOULD PAY FOR RENTALS & FIND OUT THE AIRBAGS ARE TAKATA AIRBAGS THAT OFTEN EXPLODE AND KILL PEOPLE. WE CONTACT NORTH PARK LINCOLN WHO SAYS THEY HAVE NO PARTS & WILL NOT PROVIDE A RENTAL THEY GET PARTS. WE PAY FOR OUR OWN RENTAL TO AVOID THE RISK OF DEATH. MY COMPLAINT IS I DO NOT WANT LINCOLN/FORD TO BENEFIT IN ANY NHTSA INVESTIGATION BY SHOWING THE ADMINISTRATIVE AGENCY HOW THEY \"OFFERED\" TO PROVIDE RENTAL VEHICLES TO PEOPLE WHO BOUGHT THEIR VEHICLES EQUIPPED WITH THE DANGEROUS AIRBAG SYSTEMS. LINCOLN/FORD DID SEND A LETTER OFFERING TO PROVIDE RENTALS TO PEOPLE WHO WERE IN NEED OF A SAFETY RECALL REPAIR TO REPLACE THE TAKATA AIRBAGS IN THEIR VEHICLES. HOWEVER, ONCE THE PERSON SHOWS UP AT THE DEALERSHIP ASKING FOR A RENTAL VEHICLE THE PERSONNEL AT THE DEALERSHIP REFUSE TO FIX THE VEHICLE BECAUSE \"THEY HAVE NO PARTS\", AND ALSO REFUSE TO HONOR THE MAY 2018 LETTER TERMS BY PROVIDING A RENTAL VEHICLE AS PROMISED. INSTEAD THEY ARE TELLING PEOPLE THEY HAVE NO PARTS, THEY HAVE NO RENTAL VEHICLES, AND TO KEEP DRIVING THE CAR WITH THE DANGEROUS AIRBAGS. I PROVED THEY LIED TO ME ABOUT THEIR HERTZ RENTAL AVAILABILITY BY MAKING MY OWN RENTAL RESERVATION, BUT WE ARE PAYING FOR IT. I BELIEVE THEY ARE SENDING THE LETTER BUT FAILING TO COMPLY WITH THE TERMS IN ORDER TO HAVE A CHILLING EFFECT ON PEOPLE ASKING FOR REPAIRS/RENTALS TO SAVE MONEY.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101399,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. DUBLIN FORD LINCOLN (2265 VETERANS BLVD, DUBLIN, GA) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "06/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101248,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED RAY PEARMAN LINCOLN AT (256) 533-0625 (2501 BOB WALLACE AVE SW, HUNTSVILLE, AL 35805) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE PART SHOULD BECOME AVAILABLE BETWEEN MARCH AND SEPTEMBER OF 2018. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100187,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (PHIL FITTS FORD & LINCOLN, 3250 WILMINGTON RD, NEW CASTLE, PA 16105, (888) 650-2917) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  HOW MANY YEARS WILL THIS TAKE?  I AM LOSING MONEY!!  I CAN'T HAVE A PASSENGER!!!!  I AM IN A HIGH RISK ENVIRONMENT!!!",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: THERE HAS BEEN A SAFETY RECALL FOR THE AIR BAG IN MY CAR SINCE 2016. I HAVE RECEIVED NOTICES THAT A REPLACEMENT WILL BE AVAILABLE IN SPRING 2018 AND THAT NO-ONE CAN RIDE IN THE PASSENGER SEAT FOR SAFETY REASONS. I HAVE CALLED THE DEALER A COUPLE OF TIMES AND THEY HAVE STATED THAT THE PART IS NOT IN. TOMORROW WILL BE JUNE, AND I FEEL THIS IS AN UNREASONABLE WAIT TIME FOR ME TO ALLOW SOMEONE TO SIT IN THE PASSENGER SEAT.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A NOTICE OVER A YEAR AGO THAT MY 2008 LINCOLN MKX HAD BEEN RECALLED DUE TO SAFETY RECALL 16S26-PASSENGER AIRBAG INFLATOR REPLACEMENT. THE AIRBAGS COULD RUPTURE AND MAY RESULT IN METAL FRAGMENTS STRIKING VEHICLE OCCUPANTS CAUSING SERIOUS INJURY OR DEATH.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096581,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  IT HAS BEEN ALMOST 2 YEARS AND I AM STILL WAITING ON THIS. WILL THERE BE ANY COMPENSATION FOR NOT BEING ABLE TO DRIVE PASSENGERS UNLESS THEY SIT IN THE BACK? NOT SATISFIED WITH LINCOLN AND DEALERSHIP RESPONSE.  IF THEY HAD TO PROVIDE LOANERS TO ALL OF US I WOULD BET THAT THE PARTS AND INSTALLATION WOULD HAVE BEEN EXPEDITED. WHAT WILL BE DONE TO RECTIFY THIS AND PREVENT SUCH LONG-TERM INCONVENIENCES IN THE FUTURE?",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093796,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER (SOUTHWORTH FORD, 1430 N BALDWIN AVE, MARION, IN 46952, (765) 662-2561) WAS UNABLE TO VERIFY WHEN THE PARTS WOULD BE SUPPLIED FROM THE MANUFACTURER. THE MANUFACTURER WAS CONTACTED. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *LN *TT",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091631,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO SUNLAND FORD (15330 PALMDALE RD, VICTORVILLE, CA 92392, (760) 241-7751), BUT THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE DEALER FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  SINCE RECEIVING OUR AIRBAG RECALL (OVER 1 YEAR AGO) WE HAVE BEEN TO OUR LOCAL DEALERSHIP OVER 3 TIMES AND NO PARTS ARE AVAILABLE TO FIX THE RECALL AND DRIVING THE VEHICLE CAN CAUSE DEATH. LOCAL DEALERSHIP STATED NO DATE FOR PARTS WAS GIVEN BY FORD. CONTACTED FORD AND NO DATE GIVEN AND NO RESOLUTION TO FIX VEHICLE WHICH IS NOT DRIVABLE WITHOUT THE RISK OF DEATH.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083284,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. WHILE DRIVING VARIOUS SPEEDS, ON AN INCLINE OR DECLINE, THE VEHICLE DID NOT RESPOND WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE CONTACT ALSO STATED THAT THE VEHICLE JERKED AND WOULD NOT ACCELERATE FORWARD IN STOP AND GO TRAFFIC. FURTHERMORE, THE CHECK ENGINE INDICATOR ILLUMINATED BRIEFLY AND THE RPMS RAPIDLY INCREASED. ROB SIGHT FORD IN KANSAS CITY, MISSOURI WAS NOTIFIED AND STATED THAT THERE WAS NO RECALL FOR THE FAILURE. IN ADDITION, THE DEALER OFFERED TO PROVIDE DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH CASE NUMBER: CAS-14516361. THE FAILURE MILEAGE WAS 142,000.",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAGS FOR MY CAR HAS A RECALL. IT HAS NO REMEDY AFTER YEARS. WHAT SHOULD I BE DOING TO PROTECT MYSELF AND OTHERS?",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE  WERE NOTIFIED ON 05/31/2016 THAT THE AIR NEEDED TO BE REPLACED BUT THERE HAS BEEN NO ATTEMPT BY FORD TO REPLACE THE BAG.  THEY SAY RECALL STATUS INCOMPLETE REMEDY NOT AVAILIABLE YET.  THATS BEEN ALMOST 2 YEARS AGO    .UMMARY:  PASSENGER AIRBAG INFLATOR REPLACEMENT   SAFETY RISK:  THE PASSENGER FRONTAL AIRBAG INFLATOR COULD RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WERE THE SUPPLEMENTAL FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. THIS DEFECT REPORT IS IN RESPONSE TO DIRS 17E001, 17E002, 17E003. FORD IS NOT AWARE OF ANY REPORTS OF ACCIDENT OR INJURY RELATED TO THIS CONDITION.   REMEDY:  OWNERS WILL BE NOTIFIED BY MAIL AND INSTRUCTED TO TAKE THEIR VEHICLE TO A FORD OR LINCOLN DEALER TO HAVE THEIR PASSENGER FRONTAL AIRBAG INFLATOR REPLACED. THERE WILL BE NO CHARGE FOR THIS SERVICE.   RECALL STATUS: RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076101,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY 2016 I RECEIVED AN ***IMPORTANT SAFETY RECALL*** NOTICE. IT WAS LABELED AS SAFETY RECALL 16S26/ NHTSA RECALL 16V-384 FOR OUR 2008 LINCOLN MKX. THE LETTER GAVE NOTICE OF THAT THE VEHICLE'S PASSENGER FRONTAL AIRBAG INFLATOR MAY RUPTURE IN AN EVENT OF A CRASH NECESSITATING AIRBAG DEPLOYMENT. THE LETTER GAVE INSTRUCTION TO TAKE THE VEHICLE TO THE LOCAL LINCOLN DEALER TO HAVE THE AIRBAG(S) REPLACED, FREE OF CHARGE. I HAVE TAKEN THE VEHICLE TO THE LOCAL LINCOLN DEALER EVERY OCT/NOV OF EVERY YEAR SINCE RECEIVING THE NOTICE, BUT AT EACH VISIT I AM TOLD THAT THE AIRBAG CAN NOT BE REPLACED BECAUSE IT IS NOT IN STOCK AND THAT THE DEALER IS WAITING FOR FORD TO DISTRIBUTE THE RECALLED AIRBAGS FOR REPLACEMENT. I WAS FURTHER INSTRUCTED BY THE DEALER TO CALL FORD CUSTOMER SERVICE AT 800-392-FORD(3673) TO REQUEST FURTHER INFORMATION ON WHEN I CAN REPLACE THE RECALLED AIRBAG. OVER THE PHONE, FORD INSTRUCTED THAT I CONTINUE BRINGING THE CAR TO THE DEALERSHIP UNTIL OTHERWISE THEY HAVE NEW AIRBAGS IN STOCK. WE DRIVE THIS VEHICLE EVERY DAY AND MOST OF THE TIME WITH A SPOUSE OR MINOR CHILD IN THE PASSENGER'S SEAT. SINCE WE PURCHASED THE VEHICLE FROM FORD ON MAY 27, 20112, WE DRIVE ON STREETS AND HIGHWAYS FOR BOTH SHORT AND LONG DISTANCES. THE VEHICLE HAS NOT BEEN IN AN ACCIDENT DURING OUR OWNERSHIP.     I HAVE SINCE RECEIVED A DUPLICATE LETTER DATED DECEMBER 2017. AND AGAIN I BROUGHT THE VEHICLE TO THE FORD DEALERSHIP. AND AGAIN I WAS TOLD THE REPLACEMENT AIRBAG WAS NOT IN STOCK. AND AGAIN I WAS TURNED AWAY.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAMARA RECALL\" I HAVE BEEN WAITING ON A RECALL REGARDING THE AIRBAGS FOR OVER A YEAR. I WOULD LIKE TO SECURE MY VEHICLE, AS MY CHILDREN ARE DRIVEN IN THE VEHICLE REGULARLY. THIS IS NOT SOMETHING THAT O WANT TO CONTINUE TO WORRY ABOUT.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074850,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN MAX. CONSUMER WRITES IN REGARDS TO PASSENGER AIRBAG SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO BE COMPLETED. *JS  *JS",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "03/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073911,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HENDERSON FORD (810 RIDGE RD, WEBSTER, NY) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED FAMILY FORD-LINCOLN OF MARIETTA AT (740) 373-3431 (LOCATED AT 909 PIKE ST, MARIETTA, OH 45750) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071468,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONGRESSMAN WITTMAN ON BEHALF OF CONSTITUENT RE 2008 LINCOLN MKX SAFETY RECALL PASSENGER SIDE AIRBAG. *LD     THE CONSUMER REQUESTED TO BE PROVIDED A RENTAL VEHICLE UNTIL THE RECALL COULD BE COMPLETED. *JS",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066840,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    RECEIVED RECALL NOTICE IN JULY 2006.  IT'S NOW FEB 2018.  RECENT LETTER FROM LINCOLN INSTRUCTES ME NOT TO USE PASSENGER SEAT.  PROBLEM GOING ON 2 YEARS AS OF JULY 2018.  WHAT GIVES?  NOW I CAN'T USE PASSENGER SEAT PER LINCOLN.  THIS IS RIDICULOUS.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066542,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I LIVE IN A HIGH HEAT AREA AND I HAVE BEEN WAITING 1 1/2 YEARS FOR REPLACEMENT.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064638,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ON EXPRESSWAY.  IT WAS MID AFTERNOON AND TEMPERATURE WAS ABOUT 72 DEGREES.  VEHICLE IS HOUSED IN A GARAGE MOST OF THE TIME.  LUCKILY SUN SHADE WAS CLOSED.  INSURANCE COVERED COST WHICH WAS $1,700.",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064116,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (VILLAGE FORD, 11660 US-441, BELLEVIEW, FL 34420) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3LNHM26T18R"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064112,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (LINCOLN OF OCALA, 2816 N PINE AVE, OCALA, FL 34475) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. CROWE FORD SALES COMPANY (1041 SOUTH STATE STREET, GENESEO, IL) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (SENTRY LINCOLN, 4080 MYSTIC VALLEY PKWY, MEDFORD, MA 02155) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2018",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063924,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 LINCOLN MKX STARTS CUTTING OUT AND CHUGGING AT THE SPEED OF 45 MPH YOU HAVE TO GIVE IT GAS TO GET IT UP OVER 50ISH TO COME OUT OF IT. IT WILL DO AGAIN AT TIME OUT ON THE INTERSTATE AROUND THE SPEED OF 60 MPH BUT AT THIS TIME THE ABS AND SKID LIGHT COME ON. I'M AFRAID WITH HAVING MY GRANDDAUGHTERS IN THE CAR THAT SOMETHING BAD WILL HAPPEN WHEN I'M OUT ON THE ROAD WITH THEM. I HAVE TAKEN IT TO THE FORD DEALERSHIP AND THEY WANT AN ARM AND A LEG AND WILL NOT JUST GIVE A SUGGESTION OR ADVICE, THE TRANSMISSION SHOP PUT A MACHINE ON IT BUT CAN'T DETECT ANY CERTAIN CAUSE.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063618,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATRA RECALL: STILL WAITING ALMOST A YEAR FOR THE FIX TO THE AIR BAG. FORD/LINCOLN AT CORPORATE AND LOCAL DEALER LEVELS HAVE SAME STORY, NO FIX AVAILABLE AND NO TIME LINE FOR WHEN IT WILL BE AVAILABLE, THIS IS REALLY GETTING OLD, TIRED OF THE CONTINUING RUN AROUND. I HAVE BEEN IN CONTACT AT LEAST 5 TIMES OVER THE PAST YEAR.    IN THE MEANTIME, I AM DRIVING A POTENTIALLY DANGEROUS VEHICLE AND NOT ABLE TO SELL THE VEHICLE WITH AN OUTSTANDING SAFETY RECALL.",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063025,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I RECEIVED A RECALL NOTICE IN MARCH 2017. CALLED THE DEALER WHO ADVISED NO PARTS WERE AVAILABLE. I FOLLOWED UP AGAIN IN OCTOBER OF 2017 AND WAS TOLD NO PARTS AVAILABLE. WHEN CAN I EXPECT TO HAVE THIS SAFETY ISSUE REMEDIED?",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN JUNE OF 2016. THE DEALER (CAPITAL FORD LINCOLN OF WILMINGTON, 4222 OLEANDER DR, WILMINGTON, NC 28403) STATED THAT THE PARTS WERE UNAVAILABLE FOR REPAIR. THE MANUFACTURER CONFIRMED THAT THE PARTS WERE UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-CONTACT OWNS A 2008 LINCOLN MKX -- --- DRIVERS SIDE AIRBAG WAS REPLACED A FEW MONTHS AGO --- PASSENGER AIR BAG WAS RECALLED --- RECEIVED RECALL LETTER FROM FORD STATING TO NOT USE PASSENGER SEAT UNTIL AIRBAG IS REPLACED.  FORD STATED TO CONTACT NO PARTS ARE AVAILABLE FOR AIRBAG TO BE REPLACED --- CONTACT STATED VEHICLE IS BEING USED AS A FAMILY VEHICLE ---- CONTACT WAS GIVEN NUMBER TO FEDERAL TRADE COMMISSION --- 1RECALLSASSOCIATED WITH THIS VIN    JUN 01,2016   MANUFACTURER RECALL NUMBER16S26  NHTSA RECALL NUMBER16V384  RECALL STATUSRECALL INCOMPLETE, REMEDY NOT YET AVAILABLE  SUMMARYTHE PASSENGER FRONTAL AIRBAG INFLATOR COULD RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WHERE THE SUPPLEMENTAL FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. THIS DEFECT REPORT IS IN RESPONSE TO TAKATA DIRS 16E-042, 16E-043, 16E-044.    SAFETY RISK THE PASSENGER FRONTAL AIRBAG INFLATOR COULD RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WHERE THE SUPPLEMENTAL FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. THIS DEFECT REPORT IS IN RESPONSE TO TAKATA DIRS 16E-042, 16E-043, 16E-044.    REMEDY OWNERS WILL BE NOTIFIED BY MAIL AND INSTRUCTED TO TAKE THEIR VEHICLE TO A FORD OR LINCOLN DEALER TO HAVE THEIR PASSENGER FRONTAL AIRBAG INFLATOR REPLACED. THERE WILL BE NO CHARGE FOR THIS SERVICE.",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057956,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V384000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER (FLINT HILLS AUTO, 7920 E HIGHWAY 24, MANHATTAN, KS 66502, (785) 776-4004) DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE DEALER STATED MONTHS AGO THAT THE CONTACT WOULD RECEIVE A SECOND LETTER. THE CONTACT RECEIVED THE LETTER, STATING THAT PARTS MAY BECOME AVAILABLE IN SPRING OF 2018. THE MANUFACTURER WAS CONTACTED. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058080,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN JULY OF 2016. AN UNKNOWN DEALER STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS CONFIRMED THE PARTS WERE UNAVAILABLE AND WAS NOT SURE WHEN THEY WOULD ARRIVE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056640,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM ALARMED THAT NEARLY TWO YEARS AFTER A RECALL THAT THE LINCOLN MOTOR COMPANY HAS YET TO SECURE REPLACEMENT PARTS FOR THE AIR BAG INFLATOR. THEIR REMEDY IS JUST DON'T USE THE FRONT PASSENGER SEAT. THIS IS NOT REALLY A SOLUTION.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055650,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  RECEIVED RECALL NOTICE IN JULY 2016 AND AS OF YET FORD HAS NOT NOTIFIED ME THAT PARTS ARE AVAILABLE TO FIX THIS SERIOUS SAFETY ISSUE.",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055644,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PORTSMOUTH FORD LINCOLN (400 SPAULDING TURNPIKE, PORTSMOUTH, NH 03801 (603) 433-1221) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT RECEIVED A NOTICE FROM TK HOLDINGS, ALERTING HIM THAT TAKATA FILED FOR BANKRUPTCY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *BF  UPDATED 8/15/18*JB",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055530,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RISK DESCRPITION  THE PASSENGER FRONTAL AIRBAG INFLATOR COULD RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WERE THE SUPPLEMENTAL FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. THIS DEFECT REPORT IS IN RESPONSE TO DIRS 17E001, 17E002, 17E003. FORD IS NOT AWARE OF ANY REPORTS OF ACCIDENT OR INJURY RELATED TO THIS CONDITI",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL IN PLACE FOR MORE THAN A YEAR WITH NO SOLUTION",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054879,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKZ. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (AUTONATION LINCOLN CLEARWATER, 2085 GULF TO BAY BLVD, CLEARWATER, FL 33765 (727) 231-1380) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT RECEIVED A RECALL NOTICE FROM TK HOLDINGS, ALERTING HIM THAT TAKATA FILED FOR BANKRUPTCY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  UPDATED 8/27/18*JB",
        "vin": "3LNHM26T98R"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE THIS AUTO WAS TAKEN TO GRANITE FORD, ROCHESTER, NH. I WAS TOLD THEY HAVE NOT RECEIVED THE \"PARTS\" YET AND THAT FORD MOTOR CORP. HAS NOT EVEN RECEIVED THIS REPLACEMENT.-MOST RECENT 11/28/2017. THIS IS WHERE I PURCHASED THE CAR-I AM 82 YEARS OLD AND CANNOT DRIVE TO A DEALER IN MANCHESTER ETC.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052545,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE DEALER (CHAPMAN FORD, 9371 ROOSEVELT BLVD, PHILADELPHIA, PA 19114) STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (WEST HERR FORD LINCOLN OF AMHERST, 10 CAMPBELL BLVD, BUFFALO, NY 14228) AND WAS INFORMED THAT THE PARTS WERE ON BACKORDER. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND DID NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2017",
        "dateOfIncident": "11/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048355,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED SAFETY RECALL NOTICE. TRIED TO GET APPOINTMENTS WITH EAST CAROLINA AUTO AND TRUCK CENTER, GREENVILLE, NC, FOR THE PAST YEAR OR SO. HAVE TRIED TO GET IT FIXED NUMEROUS TIMES, BUT RECEIVED THE SAME RESPONSE, \"THEY DON'T HAVE THE PARTS YET.\"",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047716,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).    TAKATA RECALL   VIN [XXX]  FORD SENT NOTICE OF RECALL LONG AGO AND SAID THEY WOULD NOTIFY ME FOR REPAIR.  EVEN AS OF TODAY 21 NOV 2017; LOCAL FORD SAYS NO PARTS ARE RELEASED TO COMPLETE THE RECALL. *DL",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047000,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LINCOLN DEALER IN CATHEDRAL CITY, CA WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047106,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER DOOR AJAR LIGHT CONTINUES TO ILLUMINATE CAUSING THE ALARM TO GO OFF WHEN PARKED AND LOCKED. IT WILL TURN ON CONSISTENTLY EVEN WHILE DRIVING.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE PER THE DEALERSHIP AND THE RECALL SITE. WAITING ON REPLACEMENT PARTS. DEALERSHIP SAID I WOULD RECIEVE SOMETHING IN THE MAIL ONCE THE PARTS ARE AVAILABLE. I CHECKED ON SEVERAL SERVICE VISITS, SAME RESPONSE. I CHECKED THE STATUS ON THE AIRBAG SITE TODAY AS WELL, SAME NOTICE SHOWING> RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046037,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF THE TAKATA RECALL AND CONTACTED SERVICE DEALERS RECOMMENDED.  NO ONE HAS THE PARTS AS IT APPEARS THEY HAVE GONE BANKRUPT.  WHEN AND IS THIS GOING TO BE RESOLVED AND BY WHOM?  THIS RECALL WAS DATED JUNE 2016 AND I JUST GOT NOTICE OF IT.",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER STATED THEY DID NOT HAVE THEM IN STOCK ON 7-17-17.  DEALER NEVER CALL BACK WITH DATE TO REPLACE AIR BAG.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: DEALER DOES NOT HAVE A REPLACEMENT PART.  HAVE CHECKED BACK WITH THE DEALER NUMEROUS TIMES SINCE THE RECALL AND STILL HAS NOT BEEN REPAIRED.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044866,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED DOUG GRAY FORD INC AT (580) 928-3369 (800 N E HWY 66, SAYRE, OK 73662) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE/PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044887,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: REPLACEMENT PARTS UNAVAILABLE AFTER MORE THAN 16 MONTHS AFTER RECALL.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044720,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER (TUTTLE-CLICK FORD LINCOLN, 43 AUTO CENTER DR, IRVINE, CA 92618, (949) 472-5200) DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS INCLUDED IN A MANUFACTURER SERVICE CAMPAIGN (14R02) FOR THE FUEL TANK SEAM LEAKS (07-08 EDGE-MKX - NON CORROSION ST-PROV). THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE CALLED EVERY AVAILABLE DEALER LISTED ON THE WWW.AIRBAGRECALL.COM WEBSITE AND NONE OF THEM HAVE THE PARTS.  I AM CONCERNED ABOUT ARE SAFETY.  HOW DO WE GET THIS RESOLVED",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044361,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I WAS NOTIFIED IN JUNE 2016 THAT THE AIRBAGS HAVE BEEN RECALLED , AND CAN CAUSE SERIOUS INJURY AND EVEN DEATH.  IT'S NOW 16 MONTHS LATER AND THE DEALER SAYS THEY STILL DON'T HAVE THE REPLACEMENT PARTS. HOW CAN I FACILITATE THIS REPAIR?",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  FORD HAS NOT INFORMED US WHEN THEY ARE GOING TO REPLACE PASSENGER FRONT AIR BAG AND RECALL DATED IN JUNE 2016.",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. RIVERGATE LINCOLN IN GOODLETTSVILLE, TENNESSEE (CURRENTLY OUT OF BUSINESS) WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043802,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - JUNE 2016 NOTIFICATION BY LETTER. EVERY DEALER I TAKE IT TO SAYS THERE ARE NO PARTS AVAILABLE TO FIX IT. I JUST RECEIVED A LETTER IN THE MAIL FROM TK HOLDINGS INDICATING THEY FILED FOR CHAPTER 11 STATUS. I AM VERY WORRIED I AM NEVER GOING TO GET THIS FIXED AND MY FAMILY RIDES IN THE VEHICLE TOGETHER.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042836,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 01, 2016  NHTSA RECALL NUMBER 16V384  MANUFACTURER RECALL NUMBER 16S26  REMEDY  OWNERS WILL BE NOTIFIED BY MAIL AND INSTRUCTED TO TAKE THEIR VEHICLE TO A FORD OR LINCOLN DEALER TO HAVE THEIR PASSENGER FRONTAL AIRBAG INFLATOR REPLACED. THERE WILL BE NO CHARGE FOR THIS SERVICE.    RECALL STATUS:  RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042933,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT RECEIVED THE RECALL NOTICE OVER A YEAR AGO. THE DEALER (OLATHE FORD LINCOLN, 1845 E SANTA FE ST, OLATHE, KS 66062 (913) 782-0881) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT RECEIVED A POSTCARD FROM TK HOLDINGS, ALERTING HIM THAT THEY FILED FOR BANKRUPTCY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042505,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL MY SIGNIFICANT OTHER AN I ARE SO SCARED TO DRIVE OUR CAR! I'M THE MOTHER OF OUR TWO BEAUTIFUL CHILDREN, WHO DRIVE'S THIS CAR EACH AND EVERY DAY, NOW, I FIND OUT ON TOP OF THE FUEL RECALL I HAVE TO WORRY ABOUT DYING BECAUSE YOU HAVE YET TO FIND A REPLACEMENT FOR OUR TAKATA AIRBAG! I FEEL IT IS NECESSARY FOR YOU TO REPLACE OUR CAR NOT WITH CASH BUT WITH A REPLACEMENT VEHICLE SIMILAR TO OURS SO MY FAMILY CAN FEEL SAFE AND NOT HAVE TO WORRY ABOUT ADDITIONAL PROBLEMS FROM BEING IN AN ACCIDENT AND OR GOING OVER A BUMP OR HEAT OR WHAT NOT. OR SIMPLY PROVIDE US WITH A RENTAL UNTIL SUCH PROCEDURE IS REMEDIED. I CAN NOT AFFORD ANOTHER CAR AND THIS IS HOW I GET TO AND FROM WORK, SCHOOL, CHILDREN'S ACTIVITIES AND SO ON AND SO FORTH.  WHAT IS HAPPENING TO OUR WORLD AND GOVERNMENT AND OR FEDERAL SYSTEM THAT THIS IS BEING ALLOWED TO HAPPEN? WHEN CITIZENS STARTED DYING FROM THIS UNFORTUNATE SITUATION ALL CARS SHOULD HAVE BEEN RECALLED PERMANENTLY IMMEDIATELY INSTEAD OF LETTING OTHERS DIE.  I'M COMPLETELY APPALLED BY HOW THIS IS BEING HANDLED IF HANDLED AT ALL.  PLEASE CONTACT US AT [XXX] OR [XXX]  SINCERELY,                     [XXX]       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042526,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  UNABLE TO GET AIRBAGS REPLACED.  THERE HAS BEEN NO INCIDENT AS OF YET.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042680,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL ISSUED IN JANUARY 2017 AND AS OF TODAY NOVEMBER 2, 2017.  SIGNATURE FORD DEALER IN OWOSSO, MICHIGAN HAS NOT RECEIVED THE REPLACEMENT AIRBAGS TO COMPLETE THE RECALL REQUIREMENTS.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HELLER MOTORS IN PONTIAC, ILLINOIS WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIR BAG. IT HAS BEEN OVER A YEAR THAT THE RECALL HAS BEEN OUT AND THE DEALER TELLS ME THAT THEY DO NOT HAVE A REPLACEMENT AIR BAG TO INSTALL. AND THEY DO NOT KNOW WHEN IT WILL BE ADDABLE. WHAT AM I TO DO WITH THIS SAFETY PROBLEM?",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PAUL CERAME FORD LOCATED AT 11400 NEW HALLS FERRY ROAD, FLORISSANT, MO WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *LN",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041011,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  THEY CONTINUE TO SAY PARTS ARE NOT AVAILABLE AND NOW TK HOLDINGS INC AND CERTAIN OF IT'S AFFILIATES HAVE FILED CHAPTER 11 BANKRUPTCY.  I JUST WANT MY CAR FIXED THAT'S IT, NOTHING ELSE.  THIS HAS BEEN AN ONGOING ISSUE BUT WE JUST RECEIVED THE BANKRUPTCY NOTICE ON THE 26TH ON OCTOBER 2017.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041124,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE DEALER (DON FRANKLIN FORD LINCOLN, 388 KY-192, LONDON, KY 40741; 888-461-0896) AND WAS INFORMED THAT THE REMEDY WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2C3AA53G55H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041309,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  RECALL NOTICE WAS JUNE 1, 2016.  STILL NO PARTS AVAILABLE FOR THE DEALERSHIP TO FIX THIS DANGEROUS SITUATION. THE PASSENGER FRONTAL AIRBAG INFLATOR COULD RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WHERE THE SUPPLEMENTAL FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. THIS DEFECT REPORT IS IN RESPONSE TO TAKATA DIRS 16E-042, 16E-043, 16E-044.  NO SITUATION/ACCIDENT YET BUT MY KIDS RIDE IN THE PASSENGER SEAT WHICH IS A POTENTIAL LIFE-THREATENING SITUATION.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL IN JUNE OF 2016 OF MY PASSENGER AIRBAG. THERE IS STILL NO FIX AVAILABLE.I HAVE A 5 PASSENGER CAR AND CAN'T HAVE ANYONE IN MY FRONT SEAT STILL. I DESERVE A RENTAL CAR. ENOUGH IS ENOUGH.",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040909,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - AS PER NOTICE RECEIVED IN MAIL, I CHECKED MY VEHICLE DETAILS AGAINST THE TAKATA AIRBAG RECALL NOTIFICATION. THE WEBSITE STATES THAT MY VEHICLE IS SUBJECT TO A JUNE 1, 2016 AIRBAG RECALL. THIS IS THE FIRST I HAVE HEARD - I HAVE RECEIVED NO NOTIFICATION FROM LINCOLN. THE WEBSITE STATES THAT \"RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE\". I HAVE A FAMILY AND THIS IS THE FAMILY CAR. VERY CONCERNED THAT LINCOLN HAS NO REMEDY AVAILABLE - THIS IS NOT THE FIRST TIME. PREVIOUS PRODUCT RECALLS ON GAS TANK NOT RECTIFIED BECAUSE NO REMEDY AVAILABLE. SEEMS COMPANY BECOMES AWARE OF PROBLEMS THEN DOES NOTHING TO NOTIFY THE CUSTOMER AND DOES NOTHING TO RECTIFY THE PROBLEM AS SOON AS POSSIBLE. THIS TIME WASTAGE PUTS MY FAMILY AT RISK WHICH I AM NOT HAPPY ABOUT. NO INCIDENT AS OF YET, BUT YOUR WEBSITE ADVISED TO MAKE CONTACT WITH YOU AND FILE COMPLAINT IF NOT HAPPY WITH RESOLUTION TO PRODUCT RECALL. IT SEEMS THERE IS NO RESOLUTION - I HAVE NOT EVEN BEEN NOTIFIED BY THE CAR MANUFACTURER DESPITE THE RECALL BEING DATED OVER A YEAR AGO!",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL       DEALER STILL WAITING ON AIRBAGS SO REPLACEMENT CAN BE ACCOMPLISHED PER RECALL LETTER RECEIVED. ORIGINALLY CONTACTED DEALER ABOUT RECALL NOTICE POSSIBLY IN ? MID JUNE 2017.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040007,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTSTANDING RECALL HAVE TALKED TO THE DEALER ON MULTIPLE TIMES ABOUT THIS RECALL ONLY TO BE TOLD THAT THEY HAVE NO ANSWER AND NO IDEA WHEN OR IF THERE WILL BE A REPLACEMENT",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  AIRBAG REPLACEMENTS ARE NOT AVAILABLE",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - 16  MONTHS SINCE RECALL IS NOT TIMELY ACTION TO ADDRESS THIS RECALL.  CONTACTED FORD TODAY (10/24/17).  NO PARTS AVAILABLE TO PERFORM REPAIR.",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039360,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. EFFECTIVE RECALL SINCE JUNE 2016 BUT STILL NO RECALL NOTICE FROM MANUFACTURER FOR A FIX TO THE PROBLEM.  LOOKUP STATES \"NO SOLUTION AVAILABLE\".",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035759,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (ALTON BLAKELY FORD IN SOMERSET, KY, 606- 678-5181) CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035883,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED ROGERS FORD AT (432) 694-8801 (4200 W WALL ST, MIDLAND, TX 79703) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE CONTACT THEN CALLED BLUEBONNET MOTORS INC. AT (830) 606-8011 (351 IH 35 SOUTH SUITE #F, NEW BRAUNFELS, TX 78130) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE/PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035966,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL MY CAR WAS AT BOGGUS FORD IN MCALLEN TEXAS.I ASKED ABOUT AIR BAG RECALL  THE SERVICE REP HECTOR TAMEZ FROM SERVICE DEPARTMENT STATED THERE WAS NO RECALLS FOR MY CAR .",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  MONTGOMERY LINCOLN TELLS ME THERE IS NO REPLACEMENTS FOR THE DEFECT BAGS AT THIS TIME... SOMEONE NEEDS TO PUSH THEM ALONG.. I TALKED TO THEIR SERVICE DEPT. TODAY 10/20/2017 AT 3:10PM",
        "vin": "2LMDU68C68B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "10/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034483,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ASKED DEALER TO REPAIR AIRBAG RECALL. 2 YEARS AGO. DEALER SAYS NO PARTS. HAVE GOTTEN NO RECALL FORMS, NO LETTERS. CALLED TWICE. STILL NO REPAIR. 19 OCT 2017",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. TED RUSSELL FORD LINCOLN (8551 KINGSTON PIKE, KNOXVILLE, TN 37919 (865) 223-6727) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED NORTHTOWNE LINCOLN (21 NE VIVION RD, KANSAS CITY, MO 64118 (816) 453-2710) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE/PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023535,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL IN JULY OF 2016. THE DEALER (HERTRICH CAPITOL, 1127 S DUPONT HWY, DOVER, DE, 19901) STATED THAT THE PARTS WERE UNAVAILABLE FOR REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT INCLUDED THAT THE AIR BAG WARNING SENSOR WAS ILLUMINATED. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER RICK RIDINGS FORD LOCATED AT  1817 RIDINGS DR, MONTICELLO, ILL, 61856 WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO BOB-BOYD LINCOLN OF COLUMBUS (LOCATED AT 2445 BILLINGSLEY RD, COLUMBUS, OH 43235, (614) 863-2800) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (MONTROSE FORD IN FAIRLAWN LOCATED AT 3960 MEDINA RD FAIRLAWN, OH 44333 330-666-0711) AND WAS INFORMED THAT THE PARTS WERE ON BACKORDER. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2017",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014781,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: LETTER RECEIVED IN JULY 2016 ABOUT SAFETY RECALL NOTICE 16S26/NHTSA RECALL 16V-384. ISSUE HAS STILL NOT BEEN RESOLVED.",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013953,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND WENT TO PUT ON THE BRAKES  AND  THE  PEDAL  WAS  REAL  HARD  HAD TO PUMP AND PUSH HARD. WAS TOLD IT COULD BE  MASTER CYLINDER . WAS TOLD BY A  LOCAL MECHANIC HE THOUGH IT WAS UNDER WARRENTY AS A RECALL. DEALER SHIP  HAD  NO RECORD OF  SUCH.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011666,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "95000 MILES. WENT OVER A SMALL POTHOLE WHILE TAKING A RIGHT HAND TURN. BRAKE PEDAL WENT TO THE FLOOR. 4TH TIME THIS HAS HAPPENED IN THE LAST 2 YEARS. USUALLY FIXED ITSELF AFTER A COUPLE HOURS OF DRIVING. THIS TIME IT DID NOT. DROVE OVER 200 MILES WITH THE PEDAL GOING TO THE FLOOR TO STOP. READ ON A FORUM THAT IT IS A BAD AND HYDRAULIC C UNIT AND THAT A TEMP FIX WOULD BE TO DO SEVERAL ABS STOPS ON A LOOSE GRAVEL ROAD. TRIED THAT AND IT WORKED. AFRAID THAT THIS IS GOING TO HAPPEN AGAIN AND WON'T STOP IN TIME. THIS IS VERY DANGEROUS. NEED A RECALL. THIS IS HAPPENING IN 2008 FORDS AND LINCOLNS. SAW AT LEAST 200 INSTANCES ON FORUMS. I HAVE A EXTENDED WARRANTY BUT UNLESS IT'S DOING IT WHEN I BRING IT IN THEY WON'T FIX IT",
        "vin": "3LN28TX8R63"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010976,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I FIRST RECEIVED RECALL 16S26 IN JULY 2016. I AM STILL BEING TOLD THAT THERE ARE NO PARTS AVAILABLE AND CAN'T BE ORDERED FOR THE PASSENGER FRONTAL AIRBAG INFLATOR. I CONSIDER THIS A VERY IMPORTANT SAFETY ISSUE;HOWEVER, LINCOLN IS UNABLE TO FIX IT AFTER MORE THAN A YEAR.",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11009970,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONGRESSMAN GRAVES ON BEHALF OF CONSTITUENT RE 2008 LINCOLN MKX RECALL NOTICE FOR FRONT PASSENGER AIRBAG. *LD    THE CONSUMER STATED THE RECALL REPAIR EXCEEDED A REASONABLE AMOUNT OF TIME TO BE COMPLETED. *JS",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004760,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) FOR THE FRONTAL PASSENGER AIR BAG INFLATOR EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN JUNE OF 2016. THE DEALER (LINCOLN OF WAYNE, 1910 NJ-23, WAYNE, NJ, 07470) STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT CONTACTED OR NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003015,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ENTERING AN ON-RAMP TO THE THRUWAY, THE DRIVER SIDE LOWER BALL JOINT WAS COMPLETELY GONE, DISABLING THE VEHICLE WHILE MY WIFE WAS ACCELERATING. THE WHEEL CAME ALMOST COMPLETELY OFF THE VEHICLE. I'M NOT SURE WHERE OR HOW THE BALL JOINT CAME OFF. MY INFANT SON WAS IN THE BACK SEAT, HAD THE VEHICLE BEEN GOING THRUWAY SPEED, THIS INCIDENT COULD HAVE BEEN DEADLY.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, SHIFTING MISFIRE, FAULTY BATTERY AND LOW GAS MILEAGE",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/16/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSISSILON  HAS BEEN SLIPPINBG FOR MONTHS.  TOLD IT WAS MISFIRE.   NOW CAR INCHES ALOLNG WITH HIGH ACCELERATION ATTEMPT.   SEVERAL  NOISES AND STOPPED.  WAS ABLE TO CREEP OUT OF TRAFFIC AND PARK.    NOW WONT MOVE AT ALL.",
        "vin": "2LMDU68CO8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985772,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE RECALL REPAIR WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/14/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VEHICLE FREQUENTLY HAS TO STARTED TWICE BECAUSE THE FIRST TIME THE VEHICLE IS STARTED IF I GO OVER 40MPH THE ENGINE AND SUSPENSION START PULLING AND JERKING  AND THE SPEEDOMETER WILL KEEP INCREASING EVEN THOUGH THE CAR SUSPENSION IS ONLY ALLLOWING 30MPH",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983272,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V024000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED. THE DEALER WAS CONTACTED MORE RECENTLY TO TRADE IN THE VEHICLE. THE DEALER STATED THAT THE VEHICLE COULD NOT BE TRADED WITH AN OUTSTANDING RECALL AND THE PARTS WERE STILL UNAVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "04/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981209,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTIFICATION OF AN AIRBAG RECALL AND THE TIME FROM NOTIFICATION TO REMEDY, WHICH AT THIS TIME STILL HAS YET TO BE DETERMINED, HAS BEEN EXTREMELY LONG AND LEAVING OWNERS IN A VERY DANGEROUS POSITION.  I DEMAND THAT FORD IMMEDIATELY ADVISE WHEN A REMEDY BE AVAILABLE.  THE TIME FOR WAITING IS OVER.",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PTU UNIT LEAKING OUT VENT ONTO EXHAUST ..HEAT HAS CAUSED SEALS TO FAIL AS WELL..",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956075,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER  THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 05/02/17*LJ    *CN",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WE WERE DRIVING DOWN THE ROAD ALL OF A SUDDEN THE WRENCH LIGHT COME ON AND THE SPEEDOMETER QUIT WORKING AND TIRE PRESSURE SENSOR MONITOR FAILURE LIGHT CAME ON. THEN RPM PICKED UP TO 3000 WAS LOOSING POWER, DROVE 3 MILES TO NEAREST WIDE SPOT. PUT VEHICLE IN PARK CUT ENGINE OFF, LET IT SIT , ALL LIGHTS WENT OFF , PUT IT IN REVERSE IT JERKED ABNORMALLY HARD AND WHEN I PUT IT IN DRIVE IT WOULD NOT PULL OUT. VEHICLE NOW WILL NOT DRIVE FORWARD AT ALL. WHEN WE FINALLY GOT HOME WITH OUR SON I LOOKED ONLINE TO FIND THAT THIS VEHICLE HAS DONE THIS TO OTHER PEOPLE. I WENT TO YOU TUBE AND TYPED IN 2008 LINCOLN MKX AND WAS AMAZED TO FIND THAT OTHERS HAVE HAD THE SAME PROBLEM WITH THIS VEHICLE AND IT SAYS ITS SOMETHING WITH A SPEED SENSORS FOR THE TRANSMISSION. THERE ARE HUNDREDS OF COMPLIANTS SIMILAR TO MINE. I FEEL IF THIS WERE TO HAPPEN TO SOMEONE WHO WAS DRIVING DOWN THE HIGHWAY IT COULD GET THEM KILLED. PLEASE LOOK INTO TO THIS AND SEE IF A RECALL NEEDS DONE FOR THE SAFETY OF EVERYONE. THANKS",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949267,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946466,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STARTED TO MISS AND LOST POWER HAD TO PULL OFF ROAD IMMEDIATELY. COIL SHORTED OUT SO BADLY MECHANIC SAID IT COULD HAVE CAUGHT FIRE! DATE OF TROUBLE 12-26-15. AFTER SPENDING $1600 TO REPLACE ALL 6 COILS PER THE TSB REQUIREMENTS AND SPARK PLUGS ETC STILL NOT WORKING BECAUSE OF BAD PCM UNIT THAT HAS TO BE FIXED AND REPROGRAMMED! ANOTHER $1100! PLEASE CONSIDER THIS A SAFETY HAZARD! I WAS A SINGLE WOMAN DRIVING MY CAR AND THANK GOD IT WASN'T AT NIGHT! THIS COULD EASILY HAVE RESULTED INA FIRE AND FURTHER DAMAGE TO THE VEHICLE.  *TR",
        "vin": "2LMDU68C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "07/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 01/26/2017*CT     *CN",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925440,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE RECALL IS DUE TO A DANGEROUS AND DEADLY FAILURE.  THE FAILURE CAUSES SHRAPNEL TO IMPALE THE PASSENGERS, CAUSING DEATH. WHY HAVE I NOT BEEN INSTRUCTED TO STOP DRIVING?  WHY IS A LOANER CAR NOT BEEN MADE AVAILABLE?  WHY ARE THEY ALLOWED TO WAIT UNTIL 2017 TO MAKE THE PART AVAILABLE?",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924663,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 01/06/2017*CT",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "11/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY (11/05/2016), I WAS GOING TO GO TO THE STORE. THE CAR STARTED FINE AND RAN FINE AS I BACKED IT OUT OF OUR DRIVEWAY, BUT WHEN I WENT DOWN THE STREET IN FRONT OF OUR NEIGHBORS HOUSE, IT SUDDENLY FELT LIKE IT SHIFTED INTO A LOWER GEAR. I TURNED THE CORNER NEXT TO MY NEIGHBORS HOUSE AND PROCEEDED DOWN A HILL THAT'S THERE, BUT THE CAR STILL WOULD ONLY GO VERY SLOWLY. WHEN I GOT DOWN THE HILL, I STOPPED AT A STOP SIGN AND WHEN I STEPPED ON THE GAS IT SUDDENLY STARTED TO RUN FINE. I DROVE ANOTHER 7 OR 8 BLOCKS UNTIL STOPPING FOR A RED LIGHT, THAT'S WHEN I NOTICED THE WARNING LIGHTS SHOWING A WRENCH AND AN AIRBAG COME ON. THE LIGHT TURNED GREEN AND WHEN I STEPPED ON THE GAS TO MAKE IT GO, IT AGAIN WOULD ONLY GO AT A VERY SLOW SPEED. BY THE TIME I CROSSED THE STREET, THE LIGHT HAD SWITCHED BACK TO RED. TERRIFIED, I PULLED INTO THE PARKING LOT ACROSS THE STREET AND NOTICED THE ODOMETER WAS SHOWING ALL ZEROS. I SHUT THE CAR OFF AND WENT INTO THE STORE, SHAKING AND VERY SCARED. I CAME BACK OUT PRAYING IT WOULD START UP AND RUN FINE. IT MADE A GRINDING NOISE AND SOUNDED LOUDER, BUT THEN IT STARTED RUNNING FINE AND DID SO ALL THE WAY HOME. I HAVE DRIVEN THE CAR TWICE SINCE THEN FOR SHORT DISTANCES BUT HAVEN'T HAD IT HAPPEN AGAIN. WE BOUGHT THIS 2008 LINCOLN MKX USED WITH 92,474 MILES ON IT JUST 3 WEEKS PRIOR TO THIS HAPPENING. WHEN THIS OCCURRED, THERE WAS APPROXIMATELY 92,808 MILES ON IT. THAT'S A WHOPPING 334 MILES PUT ON IT BY US AS WELL AS OTHERS WHO TEST DROVE THE CAR SINCE THIS DEALER LISTED IT FOR SALE.  SINCE THE WRENCH WARNING LIGHT CAME ON, MY HUSBAND SUSPECTS THE POWERTRAIN MALFUNCTIONED OR A AWD FAULT OCCURRED, AS IT SHOWS IN THE OWNERS MANUAL, BUT SAID HE WOULDN'T RULE OUT OTHER POSSIBLE CAUSES. SINCE WE BOUGHT THIS FROM A USED CAR DEALER, THOUGH WE DID TAKE OUT AN EXTENDED WARRANTY THROUGH OUR CREDIT UNION, WE DON'T KNOW WHAT RIGHTS EXIST PROTECTING US.",
        "vin": "2LMDU88C18B"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "10/21/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919761,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. WHILE DRIVING 20 MPH, AN ABNORMAL SOUND EMITTED FROM THE VEHICLE AND THE INSTRUMENT PANEL WARNING INDICATORS ILLUMINATED. THE BRAKES AND STEERING BECAME INOPERABLE. THE VEHICLE EVENTUALLY STOPPED INDEPENDENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 149,000.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919002,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C38B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TRAIN UNIT FAILURE - 89K MILES WITH WARRANTY BEING DECLINED DUE TO LUBRICATION ISSUE.  APPARENTLY THE FLUID LEAKED AND THERE WAS NO WAY FOR MYSELF TO KNOW THIS AS FLUID IS VERY MINIMAL IN THIS UNIT THAT IT WOULDN'T EVEN SPILL DOWN TO THE GROUND PER THE DEALER.... THIS HAS CAUSED FAILURE TO THE UNIT - THIS IS A HUGE HIT TO THE WALLET AS WELL AS THE VEHICLE IS UNABLE TO BE DRIVEN LARGE RATTLING NOISE AND CAR SHAKES.....REPLACEMENT COSTING $1600.00",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS). FOR MONTHS, THE DEALER WAS UNAWARE WHEN THE MANUFACTURER WOULD SUPPLY THE PARTS. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURES. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 10/13/16*LJ  *TR",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896349,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893926,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL; I HAVE CONTACTED MY DEALERSHIP  AND THEY SAID THEIR IS NOTHING THEY CAN DO AT THIS TIME. I WANT SOMETHING TO BE DONE.  I AM PREGNANT AND HAVE A 2 1/2 YEARS OLD IN THE CAR. I WOULD A REMEDY TO THIS ISSUE THAT DOES NOT PUT MY FAMILY AND I AT RISK OF DEATH!",
        "vin": "2LMDU88CX8B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892139,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS RECENTLY BEEN A RECALL ON FORD/LINCOLN TRUCKS FOR THE BRAKE BOOSTERS BEING BAD. I HAVE A 2008 LINCOLN MKX AND MY BRAKE BOOSTER STARTED MAKING A NOISE LAST WEEK. I TOOK IT IN TO A MECHANIC AND HE TOLD ME THE BRAKE BOOSTER WAS FAILING BUT IT MAY NOT GO OUT FOR 6 MONTH OR EVEN YEARS. YOU NEVER KNOW. HOWEVER, I WOULD LIKE TO KNOW IF SOMEONE IS LOOKING INTO THIS OR IF I CAN REQUEST THIS SINCE I HAVE NOT YET RECEIVED A NOTICE FOR MY 2008 LINCOLN MKX AND IT IS A FAULTY PART.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR A COUPLE OF MONTHS AGO USED. A FEW WEEKS AGO THE LOW TIRE PRESSURE LIGHT CAME ON. I WAS TOLD I NEEDED NEW TIRES SO I BOUGHT NEW TIRES AND THE LAST WEEK THE LIGHT CAME ON TWICE. I WAS JUST TOLD THAT I NOW NEED TO BUY NEW RIMS BECAUSE THE FACTORY ONES ARE NO GOOD. THEY ARE PEELING AND NOW MAKING THE NEW TIRES LEAK AIR. THIS ISN'T MONEY I WAS EXPECTING TO SPEND. THEY NEED TO PUT BETTER RIMS ON THE TIRE SO PEOPLE DON'T KEEP HAVING A SIMPLE ISSUE IF THE COMPANY WOULD BETTER MAKE THEM.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS 69,129 MILES ON IT AND I JUST HAD TO HAVE THE BRAKE BOOSTER REPLACED FOR THE THIRD TIME.",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "04/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ODO ERROR.  WRENCH AND AIRBAG LIGHTS ON. TRANSMISSION WOULD BARELY MOVE CAR, EVEN WHEN REVVING ENGINE. STOPPED ON HIGHWAY IN TRAFFIC.  TURNED  ENGINE ON/OFF SEVERAL TIMES THEN ODO WORKED, BUT TRANSMISSION BANGED REALLY HARD, THEN ENGAGED NORMALLY, AND RAN NORMALLY.  HAPPENED 2 MORE TIMES IN TWO WEEKS.  WITH JUST 200,000 MILES, THE PTU LEAKED AND WAS REPLACED BY DEALER.  AFTER ONE WEEK, THE ODO ERROR FIRS T OCCURRED.  I BELIEVE THAT THE PTU REPLACEMENT MIGHT HAVE CAUSED THIS PROBLEM!",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN MKX.  CONSUMER WRITES IN REGARDS TO FUEL PUMP AND VEHICLE BRAKE SYSTEM ISSUES.  *SMD  THE CONSUMER STATED THE VEHICLE WAS NOT READY ON SEVERAL OCCASIONS, WHEN SHE WAS TOLD IT WOULD BE. *JB",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780869,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. WHILE MAKING A RIGHT TURN AT APPROXIMATELY 35 MPH, THERE WAS AN ABNORMAL NOISE COMING FROM THE FRONT OF THE VEHICLE. IN ADDITION, THE GEAR SHIFT FAILED TO GO INTO THE REVERSE POSITION WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS TAKEN TO THE AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "2LMDU68C28B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779760,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2LMDU68CX8B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767573,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE THOUGHT WE NEEDED NEW BULBS IN THE HEADLIGHTS. FIRST ONE STOPPED WORKING ON DIM AND IT WASN'T LONG BEFORE NEITHER WOULD WORK ON DIM.  WE'VE REPEATEDLY TRIED DIFFERENT NEW BULBS WITHOUT SUCCESS. WE HAVE ALSO HAD IT IN A DEALERSHIP SERVICE DEPARTMENT TRYING TO TRACK DOWN WHERE THE PROBLEM IS. THE ONLY WAY TO DRIVE THE CAR AT NIGHT IS TO USE THE FOG LIGHTS, WHICH DON'T PROVIDED THE NEEDED LIGHTING.",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2015",
        "dateOfIncident": "09/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10766289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE HIGHWAY AT 65 MPH AND I NOTICE THE ODO FAULT LIGHT ON WITH AIRBAG AND WRENCH SYMBOLS LIT. THE ODOMETER READ ONLY DASHES BUT SEEMED TO BE OKAY AT THAT SPEED. SEEMED TO BE IN 3RD GEAR? WHEN I STOPPED AT A RED LIGHT, THE CAR HAD NO POWER AT ALL. TOOK FOREVER TO GET IT UP TO 20 MPH. VERY DANGEROUS AS I WAS ALMOST STUCK IN AN INTERSECTION. DOES SOMEONE NEED TO DIE BEFORE YOU RECALL THIS?",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "10/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762583,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SURGES AT LOWER RPMS BETWEEN 1,000 AND 2,000.  DEALERSHIP TESTED THE PROBLEM AND FOUND A DEFECTIVE THROTTLE POSITION SENSOR.  UPON REVIEW A NEW THROTTLE BODY ASSEMBLY ALSO NEEDED TO BE REPLACED.  THE DEALERSHIP THEN RE-PROGRAMMED THE PCM TO CURRENT CALIBRATION AND ROAD TESTED THE VEHICLE.  APPROXIMATELY TWO YEARS LATER THE SAME PROBLEM HAS REOCCURRED.  THE CAR SURGES AT VARIOUS SPEEDS AND LOSES POWER.  IT IS EXTREMELY DANGEROUS.  WE HAVE BROUGHT THE VEHICLE TO DIFFERENT MECHANICS WHO HAVE DIAGNOSED THE VEHICLE WITH AGAIN HAVING A DEFECTIVE THROTTLE SENSOR AND THROTTLE BODY.  WE HAD THE THROTTLE BODY REPLACED BUT ARE STILL EXPERIENCING THE PROBLEM.  THE CHECK ENGINE LIGHT AND MAINTENANCE LIGHT COME ON WHEN THE CAR LOSES ACCELERATION POWER, BUT ONCE WE RESTART THE CAR THE LIGHTS GO OFF.  AGAIN, THIS IS EXTREMELY DANGEROUS AS IT HAS OCCURRED AT SPEEDS BETWEEN 45-55 MPH.  WE ARE SEEKING TO HAVE THIS VEHICLE RECALLED AS WE HAVE SEEN MANY OTHER CUSTOMER COMPLAINTS WITH THE SAME PROBLEM, OR RECEIVING A DEALERSHIP CREDIT TO HAVE THE WORK DONE AGAIN.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/26/2015",
        "dateOfIncident": "07/26/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743543,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ARE VERY HARD TO PRESS AND UPON \"PUMPING\" ALMOST COMPLETELY FAIL.  FAIL LIKE PUT THE CAR IN NEUTRAL OR DON'T STOP!  STILL PASSED INSPECTION TODAY EVEN WITH THE I THINK IT IS YOUR \"BOOSTER\".  I KNOW NOTHING BUT FOUND SEVERAL(MANY ) COMPLAINTS THAT WERE EXACTLY AS MINE.  THIS IS NOT A DEFECT?  THIS IS A PART THAT ALL WOULD SAY COULD OR SHOULD WEAR OUT.  MY WIFE DRIVES THIS CAR ,ARE YOU KIDDING ME?  I ALSO READ THAT IT COULD COST BETWEEN $750-$1,000 FOR THE REPLACEMENT!  HOW COULD THIS NOT BE A RECALL.  WE HAVE OWNED THIS VEHICLE FOR 4 YEARS AND IT WENT BAD FAST!  LIKE YESTERDAY!  NO HELP FROM OUR GOV?",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2015",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721117,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THERE WAS A FUEL ODOR INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL TANK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "05/10/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716531,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY FILED A COMPLAINT ABOUT THIS TRUCK NOT ACCELERATING IN TRAFFIC AND REPLACED THE TURBO SPEED SENSOR APROX 1 MONTH PRIOR TO THIS. THIS TRIP ENGINE LIGHT FLASHED ON AND CAR STRUGGLED TO ACCELERATE, I ASSUMED SAME ISSUE, PUT IT IN CRUISE CONTROL, CAR STABILIZED FOR ABOUT 3 MILES THEN STARTED JERKING FORWARD, I TOOK CRUISE OFF, AND WHOLE TRUCK STOPPED ACCEL, THEN ENGINE LIGHT CAME ON AND THEN ENTIRE TRUCK SHUT DOWN! NO POWER STEERING, NO HEAT, NO NOTHING! I PULLED INTO ON RAMP V SECTION TO GET OUT OF SLOW LANE (I95S) IT WAS 6:20 AM SO STILL DARK. VERY DANGEROUS! KNOWN ISSUE WITH THIS TRUCK. HAD TO GET TOW. HE CHANGED PRICE FROM $75 $4 AMILE TO $175 $4 A MILE AS SOON AS MY TRUCK WAS ON HIS CARRIER. DEALERSHIP SAID IF TRUCK HAD CAUGHT FIRE IT'D BE A RECALL. FIX COST ME $1100 PLUS $465 FOR RENTAL CAR, THEN AFTER REPAIR I GOT HOME WITH TRUCK, NEXT AM I STARTED IT AND ENGINE LIGHT ON WITH CODE DISPLAY SAYING EXHAUST ISSUE CATALYTIC CONVERTER OR OXYGEN SENSOR OR PISTONS. I TRIED TO TRADE TRUCK NOONE WILL TAKE IT!! FIX IS 299-???? SERIOUS ISSUE AND VERY DANGEROUS VEHICLE!!!!!!!!!!!!!!!!!!!",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2015",
        "dateOfIncident": "04/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START MY CAR IT MAKES A CLUNK THEN WHEN I SHIFT IT INTO GEAR IT WILL GO INTO REVERSE BUT WILL CLUNK AND WHEN I PUT IT IN DRIVE AND I CAN'T GO OVER 5 MPH.  IT'S HAPPENING MORE AND MORE STARTED ABOUT 3 YEARS AGO BUT WHEN I TOOK IT INTO THE DEALER NOTHING THEY COULD DO CAUSE IT WASN'T HAPPENING THEN.  IT'S HAPPENED WHEN I'VE BEEN SITTING AT A LIGHT OR STOP SIGN AS WELL.  WE WILL THEN UNHOOK THE BATTER FOR A FEW MINS AND THEN EVERYTHING IS FINE.  *TR",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/07/2015",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING OR DRIVER ACTION, VEHICLE SHIFTS INTO HIGH GEAR AND REMAINS THERE FOR SOME PERIOD OF TIME WHILE WARNING LIGHTS COME ON INCLUDING, ENGINE, AIRBAGS AND OTHERS, ODOMETER AND SPEEDOMETER GO BLANK OR DISPLAY ERROR.  THIS CONDITION HAS LASTED FROM 4 MIN TO 20 MIN AND HAS HAPPENED APPROXIMATELY 20 TIMES SINCE FIRST INCIDENT.  SOMETIMES SHUTTING OFF VEHICLE AND RESTARTING AFTER SEVERAL MINUTES SEEMS TO HELP BUT UNTIL THE PROBLEM CORRECTS ITSELF, PUTTING IT IN GEAR RESULTS IN A BANG AND JOLTS THE VEHICLE AS IT GOES INTO HIGH GEAR.  WHEN IN HIGH GEAR, THE VEHICLE HAS NO POWER UNTIL IT REACHES HIGHER SPEEDS.  AT SPEEDS BELOW 55, THE VEHICLE DOES NOT  RESPOND WELL TO PRESSING THE ACCELERATOR.  IT BECOMES DANGEROUS WHEN ENTERING OR CROSSING AN INTERSECTION AND IT GOES INTO HIGH GEAR ON ITS OWN.  THE INTERNET HAS MANY POSTS OF THIS PROBLEM WITH THIS VEHICLE.  *TR",
        "vin": "2LMDU68C88B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2015",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "12/21/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694077,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V682000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT SPOKE WITH THE MANUFACTURER AND WAS INFORMED THAT THE PARTS MAY NOT BE AVAILABLE UNTIL AUGUST OF 2015. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING FUEL. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2LMDU88C48B"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682825,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHROME PLATING ON THE PLASTIC WHEEL COVERS IS PEELING OFF.  *TR",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "01/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE PLAY IN SEAT ASSEMBLY, DRIVERS SEAT TRACK BAR WAS FOUND TO BE DEFORMED THIS DEFECT ALLOWED SEAT TO MOVE BACKWARDS WITH ACCELERATION, FORWARD WHEN BRAKING. SEAT WAS REPAIRED BY CERTIFIED MECHANIC AND IS NOW IN OPERATING CONDITION.   *TR",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "01/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670575,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS ACTUALLY HAPPENED TO ME ONCE BEFORE ABOUT TWO MONTHS AGO, BUT AFTER IT HAPPENED AGAIN YESTERDAY I DECIDED TO TAKE MY CAR IN TO THE SHOP.      I GOT IN AND STARTED MY CAR.  WHEN I PUT IT IN REVERSE THERE WAS A PAUSE THEN A VERY LOUD 'BANG' AS I THOUGHT IT SETTLED INTO GEAR.  BECAUSE I WAS BACKING OUT OF A DRIVEWAY THAT IS ON A HILL, I DIDN'T REALIZE THE CAR REALLY WASN'T FUNCTIONING.  BUT WHEN I WENT TO PUT IT IN DRIVE, THERE WAS A PAUSE AGAIN AND THEN A VERY LOUD 'BANG'.  THE CAR THEN PROCEEDED TO INCH DOWN THE STREET EVEN THOUGH I WAS APPLYING GAS.  I TOOK IT TO AAMCO AND THEY TOLD ME AFTER RUNNING THE COMPUTER DIAGNOSTICS THERE WAS NOTHING THEY COULD FIND THAT WAS WRONG WITH THE CAR AND THAT THEY WANTED TO RUN SOME MORE TESTS.      GOOD THING I HAPPENED UPON THIS SITE.  I'M VERY DISAPPOINTED THAT LINCOLN / FORD COULD GET AWAY WITH PROBLEMS SUCH AS THIS WITHOUT A RECALL TO FIX A PROBLEM THEY KNOW HAS BEEN OCCURRING FOR YEARS!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/11/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 5 MPH, THE ACCELERATOR PEDAL WAS ENGAGED REPEATEDLY BUT THE VEHICLE FAILED TO ACCELERATE OVER 5 MPH. THE VEHICLE STALLED AND THE VEHICLE WAS ABLE TO RESTART. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT A SENSOR ON THE TRANSMISSION FAILED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "11/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654802,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT WHILE THE VEHICLE BEING SERVICED AT A DEALER, THE TECHNICIAN DIAGNOSED THAT THERE WAS A LEAK COMING FROM THE FUEL TANKS SEAM. THE TECHNICIAN DIAGNOSED THAT THE FUEL TANK NEEDED TO BE REPLACED.  THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "08/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648417,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A GAS LEAK IN THE TANK OF THE CAR. UNFORTUNATELY THERE ARE NO REPLACEMENT TANKS FOR THIS YEAR AND MODEL.  *TR",
        "vin": "2LMDU88C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LEAKING FUEL.  TOOK IT TO THE DEALERSHIP FOR REPAIR TO FIND OUT DUE TO A MANUFACTURING ERROR ONE OF THE WELDS RUSTED THUS CREATING A HOLE IN THE TOP OF THE FUEL TANK.  WAS TOLD THIS IS A VERY COMMON PROBLEM WITH THIS VEHICLE AND ITS TWIN, THE FORD EDGE.  WAS INSTRUCTED THAT THE REPAIR COST WOULD BE 1800.00 AND ALTHOUGH IT IS A COMMON PROBLEM DUE TO A MANUFACTURING ERROR, IT IS NOT UNDER RECALL WITH FORD/LINCOLN.  WE CONTACTED LINCOLN DIRECTLY AND THEY SAID THEY WERE AWARE OF THE PROBLEM BUT WOULD NOT OFFER US ANY INSIGHT AS TO WHY THIS ISSUE IS NOT UNDER RECALL OR HELP WITH THE REPAIR COSTS IF THEY AGREE IT IS A \"COMMON ISSUE\".      UPON TALKING TO OTHER FORD EDGE AND LINCOLN MKX OWNERS ONLINE, THIS IS A HUGE PROBLEM WITH THESE VEHICLES WITH 1000'S OF EFFECTED VEHICLES.      THIS IS AN ISSUE THAT IS LIFE THREATENING AND COULD CAUSE SERIOUS DAMAGE AND BODILY HARM, IF NOT DEATH, IF NOT CORRECTED.  *TR",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "10/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643526,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT 2 MPH, THE ACCELERATOR PEDAL WAS ENGAGED BUT THE VEHICLE FAILED TO ACCELERATE OVER 2 MPH. THE CONTACT MENTIONED THAT ONCE THE VEHICLE WAS TURNED OFF AND RESTARTED, IT RESUMED NORMAL FUNCTION. THE PROBLEM OCCURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE SPEED CONTROL AND TRANSMISSION FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 88,000.",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628621,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT EVERY FEW WEEKS, UPON DRIVING FROM A STOPPED POSITION, IT SEEMS LIKE THE CAR IS STUCK IN FIRST GEAR OR IN LOW GEAR- IT ACCELERATES UPON STEPPING ON PEDAL, HOWEVER THE CAR IS JUST CRAWLING ALONG AND NOT PICKING UP SPEED AT ALL.  CONSEQUENTLY, I HAVE TO STOP THE CAR AND PUT IT IN PARK AND THEN BACK IN DRIVE, ONCE I DO THIS IT WORKS NORMAL AGAIN.  ON OTHER OCCASIONS I FEEL A HARD KICK WHEN I PUT THE CAR OUT OF DRIVE AND BACK INTO DRIVE.  THIS IS VERY DANGEROUS IF I HAPPEN TO BE PULLING INTO A BUSY INTERSECTION AND I WOULD HAVE TO COME TO A COMPLETE STOP TO GET THIS CAR GOING AGAIN.  *TR",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627911,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ARE STIFF, HAVE A WHISTLE WHEN PUSHED IN TO FLOOR AND SOUNDS LIKE AIR IS COMING FROM BRAKE PEDAL. CAN BARELY STOP THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT SMELLED FUEL INSIDE THE VEHICLE. WHILE THE VEHICLE WAS PARKED IN THE CONTACT'S GARAGE, A FUEL ODOR SEEPED INTO THE RESIDENCE. AN INDEPENDENT MECHANIC FOUND A LEAK IN THE BOTTOM OF THE FUEL TANK. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 08V301000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 116,000.",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX.  THE CONTACT STATED THAT THE INTERNAL COMPUTER IN THE MEDIUM OF THE VEHICLES DASHBOARD COMPLETELY MELTED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS, WHO STATED THAT THE FAILURE DAMAGED THE COIL.  THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 100,000.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/19/2014",
        "dateOfIncident": "08/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINALLY I LOST THE CONTROL OF THE ADJUSTMENT OF REAR-VIEW SIDE MIRRORS.  REPAIRED BY FORD  NOW THE PASSENGER MIRROR WONDERS TO VIEW MY CARS IMAGE. THIS IS DANGEROUS WHEN CHANGING LANES, TO THE RIGHT SIDE.  *TR",
        "vin": "LMDU88C68BJ"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595071,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT THERE WAS AN ODOR OF GASOLINE FUEL PRESENT FROM THE REAR END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE FUEL TANK HAD CORRODED CAUSING FUEL TO LEAK OUT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "05/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587827,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE (08 LINCOLN MKX) WAS CRUISING AT 35MPH GOING DOWN SLIGHT INCLINE WHEN SUDDENLY VEHICLE STARTED ACCELERATING ON ITS OWN AT ~3,500RPM. AS THE VEHICLE WAS GOING DOWN HILL AT 35MPH IN A 30MPH ZONE WITH NO OTHER VEHICLES IN SIGHT, NEITHER GAS NOR BRAKES WERE APPLIED AS THERE WAS NO NEED. FOOT WAS OFF BOTH PEDALS UNTIL I REALIZED THAT THE CAR WAS ACCELERATING ON ITS OWN AT AN UNCONTROLLABLE RATE AND IT WAS THEN THAT I APPLIED THE BRAKES. CAR CONTINUED TO ACCELERATE AS THE BRAKES WERE BEING APPLIED. ACCELERATION LASTED APPROXIMATELY TEN SECONDS AND THEN VEHICLE REVERTED BACK TO NORMAL. BROUGHT THE VEHICLE IN FOR SERVICE THE FOLLOWING DAY (13MAY2014) AND WAS TOLD THAT THERE ARE CURRENTLY NO SERVICE BULLETINS OR KNOWN SAFETY ISSUES WITH THIS MAKE AND MODEL.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "02/17/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578863,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOIN DOWN HIGHWAY AT 65, I SMELLED GAS PULLED OVER AN GAS WAS LEAKING ON GROUND, TOOK TO FORD DEALER, THEY SAID I NEEDED A GAS TANK, I TOLD THEM I HAD ESP WARRANTY, THEY FIXED, BUT WARRANTY SAID THEY WOULD NOT PAY , SAID RUST WAS CAUSE. LEAK WAS AT TOP OF TANK, NOT BOTTOM WHERE RUST WOULD BE.  *TR",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2013",
        "dateOfIncident": "09/27/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546836,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE AFTER 5 MILES OF DRIVING SUDDENLY LOST POWER AND ENTERED WHAT THEY CALL LIMP HOME MODE DROPPING THE SPEED TO 40 MPH  AND THEN TO A CRAWL INTO A NEARBY PARKING LOT. THE DEALER THAT REPAIRED MY VEHICLE SAID THIS HAPPENS TO AVOID FURTHER DAMAGE TO THE ENGINE.  THERE WAS NO WARNING UNTIL AFTER THE VEHICLE HAD BEEN STOPPED IN THE PARKING LOT WHEN THE RED ENGINE LIGHT STARTED FLASHING ON THE INSTRUMENT PANEL. THE CAR WAS TOWED TO THE LOCAL FORD DEALERSHIP FOR REPAIRERS    THE REPAIR BILL STATES:\" THERE WAS A FAILURE OF THE EEC MODULE RESULTING IN THE FAILURE OF THE PCM CRANKS, 6 COIL PACKS\" SIX SPARK PLUGS WITH A RESULTING COST OF REPAIRS AT $683.47 FOR THE EEC MODULE (THIS IS THE PART THAT CAUSED THE DESTRUCTION OF THE PCM CRANKS AND SIX COIL PACKS) THE COIL PACKS $999.48 FOR SIX, SPARK PLUGS TOTAL 45.54 FOR SIX, A PLENUM GASKET $14.90 AND $447.50 LABOR COST TO REPAIR VEHICLE.  AS AN EMPLOYEE OF FORD MOTOR COMPANY, I GOT A 10% DISCOUNT FOR THE PARTS BRINGING THE TOTAL REPAIR COST TO A TOTAL OF $2190.05  HERE'S MY COMPLAINT. THE EEC FAILED; OK I GET THAT BUT THAT PART FAILURE CAUSED ALL THE REST OF THE PARTS TO BE DESTROYED ADDING THE COST OF THE COIL PACKS, THE GASKET AND ADDITIONAL LABOR COSTS. THE EEC WAS $ 683.47 THE REST SHOULD BE FORD MOTOR COMPANY RESPONSIBILITY AT THE LEAST.  FORD MOTOR COMPANY DISTRIBUTED A TECHNICAL SERVICE BULLETIN TO THEIR DEALERS ABOUT THIS PROBLEM. FORD MOTOR COMPANY KNOWS THAT THIS PROBLEM CAN OCCURRED AND I TALKED TO THE MECHANIC THAT REPAIRED MY CAR STATING TO ME THAT HE HAD SEEN THIS PROBLEM IN FUSION CARS AND FORD PICKUP TRUCKS SO THIS ONE DEALER GARAGE TALKING TO ONE MECHANIC THAT HAD SEEN SEVERAL  VEHICLES  DO THIS. THERE HAS TO BE A LOT MORE.   THIS SHOULD BE A RECALL.  *TR",
        "vin": "2LMDU68C18B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "09/11/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY VEHICLE I APPLIED THE BRAKES.  THE BRAKE PEDAL BECAME VERY STIFF AND THE VEHICLE WAS NOT SLOWING DOWN.  I STEPPED HARDER ON THE BRAKE PEDAL AND THE VEHICLE FINALLY SLOWED DOWN AND CAME TO A COMPLETE STOP.  I PULLED OVER THE SIDE OF THE ROAD AND WHEN I PRESSED ON THE BRAKE PEDAL IT WENT TO THE FLOOR SLOWLY AND A HIGH PITCHED SOUND CAME FROM THE ENGINE COMPARTMENT.  I TURNED THE ENGINE OFF AND CHECKED THE BRAKE FLUID RESERVOIR TO INSURE THAT I DID NOT HAVE A LEAK.  I STARTED THE ENGINE AGAIN AND HEADED TO MY HOME.  EVERYTHING WORKED NORMALLY.  I TOLD MY WIFE TO NOT USE THE CAR AND TO USE OUR OTHER VEHICLE.  I CALLED AHEAD TO THE DEALER FOR SERVICE AND BROUGHT THE VEHICLE IN.  WHEN THEY CALLED ME THEY SAID THE BRAKE BOOST HAD FAILED.  THEY CHANGED IT AND CHECKED THE BRAKES AND THE VEHICLE WAS WORKING CORRECTLY.  I MOVED TO FLORIDA AND THE BRAKE BOOST HAS FAILED AGAIN.  THIS IS AFTER APPROXIMATELY 20,000 MILES. THE SAME SYMPTOMS AS THE PREVIOUS FAILURE.  THIS IS DISCONCERTING BECAUSE THE REPLACEMENT UNIT FAILED AS WELL LEADING ME TO BELIEVE THERE ARE POTENTIAL DISASTERS OUT THERE.  *TR",
        "vin": "21MDU88C68B"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "02/24/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500555,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KICKED ON CRUISE CONTROL AT SEVENTY.  RPM'S SHOT FROM 2 THOUSAND TO EIGHT THOUSAND AND CAR ACCELERATED TO EIGHTY MILES AN HOUR.  ALL WE  DOING WAS HOLDING THE STEERING WHEEL.  WE HAVE TAKEN IT BACK TO THE DEALER TWICE SINCE WE PURCHASED TWO MONTHS AGO AND THEY HAVE INFORMED US BOTH TIMES THAT THEY CAN FIND NOTHING WRONG WITH THE VEHICLE...  *TR",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/29/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495050,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL SYSTEM AND TANK LEAKED FUEL IN SEVERAL PLACES. THE FUEL LINE LEAKED FUEL OVER THE ENGINE MANIFOLD. THE FUEL TANK HAS A LEAK AT THE SEAM WHERE UPPER AND LOW TANK HALVES JOINT. BOTH LEAKS PRESENTED A SIGNIFICANT FIRE HAZARD. THE FUEL LINE LEAK WAS AT THE ENGINE MANIFOLD. THE FUEL TANK LEAK WAS NEXT TO THE EXHAUST SYSTEM.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/12/2012",
        "dateOfIncident": "09/24/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479868,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE BRAKE PEDAL SEIZED WHILE TRYING TO DECREASE VEHICLE SPEED. THE CONTACT WAS ABLE TO DECREASE VEHICLE SPEED BY APPLYING EXCESSIVE FORCE TO THE BRAKE PEDAL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS CONFIRMED THAT THE MASTER CYLINDER FAILED, WHICH CAUSED THE RUBBER TO HARDEN ON THE BRAKE PEDAL. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 71,000 AND THE CURRENT MILEAGE WAS 72,500.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2012",
        "dateOfIncident": "09/25/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9.25.12, I TRIED TO ENTER AN EXPRESSWAY WITH AN INCLINE ENTRANCE RAMP DURING RUSH HOUR.  WHEN I ATTEMPTED TO ACCELERATE, THE CAR BEGAN TO SPUTTER AND SHAKE, (SPUTTERING UNDER ACCELERATION) AND FINALLY STOPPED IN THE EXPRESSWAY.  THE CAR NEVER SHUT OFF, NO ENGINE LIGHTS APPEARED, AND AFTER ABOUT 5 MINUTES I WAS ABLE TO VERY SLOWLY DRIVE THE CAR TO THE SIDE OF THE EXPRESSWAY.  FOR THE NEXT 20 MINUTES I WAS ABLE TO DRIVE THE CAR AT 5-8 MPH UNTIL REACHING AN EXIT AND A PARKING LOT.  THE CAR NEVER TURNED OFF, NEVER DIED, AND NO ENGINE LIGHTS APPEARED WHILE DRIVING TO THE PARKING LOT.  ONCE IN THE PARKING LOT, I CALLED A LOCAL LINCOLN DEALER WHO ADVISED ME TO TURN OFF THE CAR AND RESTART IT.  AFTER RESTARTING THE CAR, I WAS ABLE TO DRIVE THE MKZ APPROXIMATELY 35 MPH AND WAS ABLE TO REACH MY HOME.  SINCE 9.25.12, I HAVE DRIVEN THE MKZ ONCE FOR A BRIEF \"RIDE AROUND THE BLOCK\" AND THE CAR NOW APPEARS TO ACCELERATE NORMALLY.  THE CAR HAS ALWAYS HAD AN \"UNINTENDED ACCELERATION\" ISSUE.  WHEN ACCELERATING FROM A DEAD STOP, THE CAR DOES NOT ACCELERATE IN A SMOOTH MOTION BUT RATHER A \"CHOPPY\" MANNER WHERE YOUR BODY \"JERKS BACK AND FORTH\".  I HAVE NEVER TAKEN THE MKZ INTO THE DEALERSHIP FOR THE \"UNINTENDED ACCELERATION\" AND HAVE JUST ACCEPTED THIS POOR/CHOPPY ACCELERATION FROM A DEAD STOP.  *TR",
        "vin": "3LNHM26T58R"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "07/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKS. THE CONTACT STATED THAT THE WRENCH WARNING INDICATOR ILLUMINATED AND THE VEHICLE LOST POWER. THE CONTACT STATED THE VEHICLE HAD TO BE TURNED OFF AND RESTARTED. ONCE THE VEHICLE WAS RESTARTED, THERE WAS A HARD THUMP HEARD FROM THE VEHICLE. IN ADDITION,  THE SPEEDOMETER WOULD FAIL WHEN THE FAILURE OCCURRED. THE CONTACT STATED THAT THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS TAKEN TO THE DEALER EACH TIME, BUT THE DEALER STATED THAT THE VEHICLE WAS RUNNING AS DESIGNED. THE FAILURE MILEAGE WAS 12,000 AND THE CURRENT MILEAGE WAS 48,000.",
        "vin": "2LMDU68C08B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2012",
        "dateOfIncident": "07/12/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PARK MY CAR AFTER RETURNING FROM WORK. A COUPLE HOURS LATER MY WIFE RETURNED IN HER CAR AND NOTICED THE STRONG SMELL OF GASOLINE IN THE GARAGE. UPON FURTHER INSPECTION, THE WELD SEEM ON  THE GAS TANK HAS SEPARATED AND LEAKING GAS.  THERE IS A RECALL FOR THIS ISSUE # 08S06 BUT THE DEALERSHIP HAS INFORMED ME THAT MY MANUFACTURING DATE DOES NOT MATCH THAT OF THE RECALL.  THIS TO ME SEEMS SUSPICIOUS.  *TR",
        "vin": "2LMDU88C78B"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "05/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED THE CAR AT A SHOPPING CENTER GARAGE IN TYSONS CORNER VA, TURNED THE CAR OFF AND REMOVED THE KEY.  AS I WAS WALKING AWAY FROM THE CAR, I HEARD THIS NOISE SOUNDING LIKE THE FAN STILL RUNNING.  AS I RETURNED TO THE CAR AND LISTENED CLOSER, I REALIZED THAT IT WAS THE ENGINE MOTOR STILL RUNNING.  I GOT BACK IN THE CAR AND PLACED THE KEY AND ATTEMPTED TO START THE CAR AND COULD NOT.  I TURNED THE KEY TO TURN IT OFF AND REMOVED THE KEY.  THE ENGINE WAS STILL RUNNING.  THE ONLY WAY THAT I COULD  GET IT TO CUT OFF WAS TO MOVE IT A FEW INCHES THEM BACK UP.  THIS TIME I TURNED THE KEY TO STOP THE ENGINE AND IT CUT OFF.  THE CAR WAS RUNNING WITHOUT THE KEY AND THE DOORS LOCKED FOR ABOUT 4 - 5 MINUTES.  WHAT HAPPENED.  *TT",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447532,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER-SIDE HEADLIGHT INTERMITTENT FAILS TO FUNCTION. REPLACED BULB AND ISSUE PERSISTS. DEALER UNABLE TO IDENTIFY AN ISSUE. ISSUE STILL PERSISTS 3 MONTHS LATER AND DEALER IS STILL UNABLE TO IDENTIFY THE ISSUE. *TR",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2012",
        "dateOfIncident": "04/05/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER FOUND TRANSMISSION LEAKING AT PTU AXLE SEAL. REMOVED/REPLACED. ISSUE HAS RE-OCCURRED ON SAME VEHICLE AT 44879 MILES AS OF 10 FEB. 2012 AND DEALER IS AGAIN RECOMMENDING REMOVE/REPLACE. *TR",
        "vin": "2LMDU88C88B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2012",
        "dateOfIncident": "01/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROPRIATE HANDLING-INFO COPY TO FORD MOTORS COMPANY RE 2008 LINCOLN MKX FROM TRINITY MCCGRIFF, 5TH ATTEMPT TO RESOLVE *TGW  THE CONSUMER STATED THE VEHICLE WAS LEAKING TRANSMISSION FLUID. THE DEALER REPLACED A SEAL AND THE PTU SEVERAL TIMES. *JB",
        "vin": "2LMDU88C38B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/04/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE THROTTLE BODY FAILURE RATE.  SECOND THROTTLE BODY FAILURE AT 62,978.  FIRST REPLACEMENT WAS AT 21,158.  I VERY VERY RARELY BUY NON BRAND NAME GAS, ONLY SHELL OR CHEVRON, OCCASIONAL SINCLAIR OR TEXACO.  I AVOID GASOHOL WHEN POSSIBLE.  *TR",
        "vin": "2LMDU68C78B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358290,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 LINCOLN MKX WHICH WAS PURCHASED LATE 2008.  IF I AM A STOP AT A LIGHT OR INTERSECTION AND IT IS ON AN INCLINE, AFTER I TAKE MY FOOT OFF THE BRAKE IT WILL ROLL BACK UNTIL I BRAKE OR USE THE ACCELERATOR.  ON FRIDAY, SEPT. 17TH, I WAS PULLING OUT OF A GAS STATION WHICH HAD A VERY STEEP INCLINE AND I HAD TO COME TO A STOP TO ALLOW FOR TRAFFIC BEFORE I LEFT THE STATION .  I TOOK MY FOOT OFF THE BRAKE TO TRY TO ACCELERATE AND IT ROLLED BACK SEVERELY ALMOST HITTING A GAS TANKER.    I TOOK IT IN TO LINCOLN AND HAD IT LOOKED AT BECAUSE I AM STILL UNDER WARRANTY AND THEY SAID THERE WAS NEVER ANY 'HILL ASSIST'  PUT ON THE NORMAL CHARACTERISTIC OF THE CAR.  THE DEALER ADVISED ME THERE WAS NOTHING THEY I COULD DO, AND THEN TOLD ME TO USE MY FULLY AUTOMATIC CAR LIKE I WAS USING A MANUAL TRANSMISSION AND THAT I SHOULD BRAKE AND ACCELERATE AT THE SAME TIME ON A STEEP HILL.   I REMIND YOU THAT I'M STILL UNDER WARRANTY.  THIS IS A SERIOUS SAFETY ISSUE AND SOMEBODY HAS TO DO SOMETHING.  EITHER A PEDESTRIAN OR ANOTHER VEHICLE WILL BE INVOLVED BECAUSE OF THE ROLL BACK.  *TR",
        "vin": "2LMDU68C58B"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/15/2010",
        "dateOfIncident": "07/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN MKX. THE CONTACT STATED SHE WAS LOCKED IN THE VEHICLE FOR THIRTY-FIVE MINUTES AND DISCOVERED THAT THE LIFT GATE COULD NOT BE OPENED FROM INSIDE THE VEHICLE. IN ADDITION, THERE WAS NOT A RELEASE TO OPEN THE LIFT GATE. THE CONTACT WAS ABLE TO EXIT THE VEHICLE BY USING A BOTTLE OF CLEANER TO REACH THROUGH THE BACKSEAT AND DEPRESSING THE REAR SEAT RELEASE TO FOLD OVER THE REAR SEAT. THE DEALER WAS CONTACTED AND ADVISED THAT THEY WOULD HAVE TO DEMONSTRATE HOW TO EXIT THE VEHICLE WHEN INSIDE. THE VEHICLE WAS NOT DIAGNOSED. THE FAILURE AND CURRENT MILEAGES WERE 19,000.  UPDATED 09/09/10. *LJ  UPDATED 09/14/10*JB",
        "vin": "2LMDU88C98B"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/19/2010",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339138,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LINCOLN MKX 2008 WITH AN AUTOMATIC OPEN/CLOSE FEATURE FOR THE REAR LIFT GATE, THE LIFT GATE HAS PERIODICALLY REOPENED SHORTLY AFTER CLOSURE WHEN USING THE BUTTON IN THE REAR TO CLOSE IT. IT HAS REOPENED TWICE WHILE THE VEHICLE WAS MOVING. THE MOST RECENT EVENT OCCURRED WHILE BACKING OUT OF THE GARAGE AND LED TO A SMASHED REAR WINDOW AND OTHER DAMAGE TO THE REAR OF THE VEHICLE LEADING TO $2000  IN REPAIRS. THE LATCH SEEMS TO BE THE PROBLEM. AN EARLIER EVENT OCCURRED AFTER A STOP AT A REST AREA. THE LIFT GATE OPENED AS WE WERE DRIVING ON THE ENTRANCE RAMP TO THE HIGHWAY. THE DEALER HAS BEEN REQUESTED TO FIX THE PROBLEM AND REIMBURSE US FOR THE REPAIRS. THE RESOLUTION FROM THE DEALER IS PENDING. *TR",
        "vin": "2LMDU88C68B"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "01/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN MKX. THE ARM REST ON THE DOOR ARE FADING. THE DEALER TOOK A PHOTOS, SENT THEM TO THE MANUFACTURER AND FILED CASE NUMBER 1423510330. THE MANUFACTURER HAS DENIED THAT THE ARM REST ARE DEFECTIVE. THE FAILURE AND CURRENT MILEAGES WERE 23,448.",
        "vin": "2LMDU68C48B"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/25/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243402,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHIRRING NOISE AT 30 MPH +.  WHEEL BEARING NEEDED REPLACEMENT. *TR",
        "vin": "2LMDU88C58B"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/30/2008",
        "dateOfIncident": "01/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN MKX.  THE CONTACT STATED THAT THE TIRE PRESSURE ICON ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT PLACED AIR IN THE PASSENGER FRONT AND REAR TIRES.  THE FRONT TIRE WAS REPLACED IN APRIL OF 2008 AND THE PASSENGER REAR TIRE WAS REPLACED IN MAY OF 2008.  IN ADDITION, THE DRIVER AND PASSENGER MIRRORS WOULD NOT ADJUST.  THERE ARE NO RECALLS ON THIS YEAR, MAKE AND MODEL VEHICLE.  THE CURRENT MILEAGE WAS 6,864 AND FAILURE MILEAGE WAS 840.",
        "vin": "2LMDU88C28B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "02/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN STOP/GO TRAFFIC ON A RAINY NIGHT.  FAN CONTROLLER BROKE CAUSING THE FAN TO SHUT OFF, ENGINE OVERHEAD, COOLANT BOIL OFF AND ENGINE GO INTO LIMP HOME MODE.  *TR",
        "vin": "2LMDU88C58B"
    }
]