[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449859,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Mazda 5 power steering system fails intermittently.  The power steering light comes on and steering becomes extremely difficult to steer.  Occasionally, the check engine comes on as well and the engine stalls making the situation even more dangerous.  The Mazda 5 is available for inspection upon request. My daughters life was put at risk when the steering fails intermittently potentially causing damage to the car, other vehicles, and injury or death of pedestrians. The car has not been repaired or inspected at this point. There is no warning before the power steering fails.  The power steering indicator light is illuminated and occasionally also the check engine light when the power steering failure causes the engine to stall as well. The first occurrence of the issue was January 17, 2022, while my daughter was driving the vehicle.  The vehicle recall history shows the power steering had been repaired previously for the same issue.",
        "vin": "JM1CR293980"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431413,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Giti Tire (USA), Ltd.",
                "productMake": "PRIMEWELL",
                "productModel": "VALERA TOURING II",
                "productYear": "9999",
                "size": "205/50R17 93V XL",
                "type": "Tire"
            }
        ],
        "summary": "We bought 4 of these tires 1/23/2018. The first failed within 3 months (passenger rear). The tire distributor no longer carried them, so we fit the next best ... a different Primewell. Now, the driver side front tire has developed a bulge where the tread and sidewall meet - similar to the first failure. We cannot drive it and - still - the distributor no longer carries THAT tire. We have - as of 9/1/2021 driven the car a TOTAL of less than 14,000 miles since the purchase. The 50K warranty was ignored in the first failure; and we have been told that it is irrelevant in this second one. The size is 205/50R17 for both - all four.  Both tires were continuously losing air and had to start carrying a portable air pump. Just noticed this weekend that the driver side tire was ONCE AGAIN low on air. When I went to fill it, noticed the bulge. Do not know hoe long ot has been there ... just noticed it this weekend.",
        "vin": "JM1CR293080"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242105,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA 5. WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING ASSIST LOST CONTROL AND ALL THE INSTRUMENT PANEL INDICATORS BRIEFLY ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1-2284518588. THE FAILURE MILEAGE WAS 179,889.",
        "vin": "JM1CR293080"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208333,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA 5. WHEN THE CONTACT STARTED THE VEHICLE, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 149,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "06/19/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103068,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT 4 KUMHO TIRES SIZED 205 50R17 FOR THIS CAR IN SEPTEMBER OF 2015.  IN AUGUST OF 2017, AT ABOUT 25000 MILES ON THE TIRES, ONE OF THEM DEVELOPED WHAT WE LATER LEARNED WAS A BELT SEPARATION.  THE SYMPTOMS WERE A SEVERE VIBRATION, AND SEVERE PULL.  WE REPLACED TWO OF THE TIRES.  10 MONTHS LATER THE CAR DEVELOPED EXACTLY THE SAME SYMPTOMS, AND IT WAS DISCOVERED THAT ANOTHER OF THE TIRES HAD A BELT SEPARATION.  I REPLACED ALL 4 TIRES WITH ANOTHER BRAND.  I CALLED KUMHO TO REPORT THE ISSUE, AS THEY CLEARLY HAD A BAD RUN OF TIRES FOR ME TO HAVE TO OUT OF ONE SET.  THE PERSON ANSWERING THE PHONE (WARRANTY DEPARTMENT) INSISTED THAT 'BELT SEPARATIONS ARE COMMON', THAT THE RECENT RECALL WAS A \"VOLUNTARY RECALL BECAUSE THE ENGINEERS JUST WANTED TO SEE THE TIRES'.  I ASKED TO SPEAK TO SOMEONE IN THEIR SAFETY OR ENGINEERING DEPARTMENTS.  SHE SAID \"WE DON'T HAVE ANYONE LIKE THAT\".",
        "vin": "JM1CR293180"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093335,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA 5. WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING SEIZED AND THE POWER STEERING ASSIST FAULT INDICATOR ILLUMINATED. THE FAILURE OCCURRED WITHOUT WARNING. THE DEALER WAS NOT MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 141,000.",
        "vin": "JM1CR293780"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005668,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA 5.  CONSUMER WRITES IN REGARDS TO SYSTEMIC PROBLEMS WITH VEHICLE TRANSMISSION.  *LD    THE CONSUMER STATED THE REAR SHOCK MOUNTS AND THE OIL ASSEMBLY HAD TO BE REPAIRED. THE WHEEL RIMS CORRODED INTERNALLY, ALLOWING AIR TO LEAK FROM THE TIRES. THE IGNITION SWITCH AND TRANSMISSION FAILED. UPDATED 08/23/2017*JS",
        "vin": "JM1CR293X80"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983817,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING  WARNING LIGHT COMES ON STEERING GETS HEAVY",
        "vin": "J1MCR293480"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944381,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SLIDING DOORS WILL NOT CLOSE IN COLDER TEMPERATURES THEY OPEN FINE AND THEN WILL NOT CLOSE, MEANING THE DOORS WILL NOT LATCH AND CAN COME OPEN WHILE DRIVING AND WILL NOT LOCK OR ALLOW SETTING THE ALARM FUNCTION WHEN PARKING. HAS HAPPENED MULTIPLE TIMES WHILE COLD,HAVING TWO KIDS THAT RIDE IN THE BACK MY DOORS SHOULD NO COME OPEN ON THE HIGHWAY.  *TR",
        "vin": "JM1CR293780"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936154,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TEMPERATURES DROP BELOW FREEZING, REAR SLIDING DOORS HAVE DIFFICULTY LATCHING TO THE POINT WHERE THEY CAN'T BE PROPERLY CLOSED. THIS EXACT ISSUE IS DESCRIBED IN RECALL #06V463000 FOR WHICH MY VEHICLE'S VIN/YEAR IS NOT INCLUDED. I WOULD LIKE MY VEHICLE TO BE INCLUDED IN THIS RECALL SO I CAN HAVE THE ISSUE ADDRESSED BY THE DEALER.  *TR",
        "vin": "JM1CR293X80"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/17/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936186,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SLIDER DOORS FREEZE SHUT.  THERE IS NO WAY TO KNOW THAT THIS PROBLEM IS GOING TO OCCUR UNTIL IT'S ALREADY AN ISSUE.  AT THE SAME TIME, THE REAR SLIDER DOOR LATCHING MECHANISM FREEZES IN 'OPEN' POSITION.  IF THE DOOR IS ABLE TO BE OPENED AND NOT CLOSED, THE DOOR HAS TO BE TIED SHUT WITH BUNGEES.  IF THE DRIVER DOES NOT NOTICE THE OPEN DOOR LIGHT AND THE PASSENGER DOES NOT NOTICE THAT THE DOOR DID NOT CLOSE AND LATCH, THE DOOR WILL SLIDE OPEN WHEN THE CAR IS MOVING.  THIS HAPPENED TO MY DRIVER SIDE DOOR IN 2013 AND MY PASSENGER SIDE DOOR ON SATURDAY, DECEMBER 19TH.  THE 2006 MAZDA 5 WAS RECALLED FOR THIS SAME REASON (4306K).  *TR",
        "vin": "JM1CR293880"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "08/04/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746183,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING DOWN THE ROAD AND ALL OF A SUDDEN IT SOUNDS LIKE A ROCK BANGING IN THE REAR DRIVER SIDE WHEEL WELL. IT TURNS OUT TO BE A BROKEN SHOCK MOUNT. THIS IS THE SECOND ONE THAT HAS BROKEN. ONE BROKE AT ~80,000 MILES AND NOW THIS AT ~120000. SEARCH THE INTERNET AND IT IS A KNOWN PROBLEM.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/28/2015",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722224,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 MAZDA 5. WHILE DRIVING AT AN UNKNOWN SPEED, THE DRIVER HEARD A BANG SOUND NEAR THE FRONT END OF THE VEHICLE AND PULLED OVER TO THE SIDE. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED FLAMES UNDER THE HOOD. THERE WERE NO WARNING INDICATORS ILLUMINATED PRIOR TO THE FAILURE. A POLICE REPORT WAS FILED AND THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE FIRE DEPARTMENT DID NOT KNOW THE CAUSE OF THE FIRE. THE VEHICLE WAS DESTROYED AND TOWED TO A PRIVATE TOW COMPANY. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 166,000.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672636,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS WHAT IS GOING ON WITH MY CAR.  I ALMOST HAD AN ACCIDENT BECAUSE OF THE POWER STEERING ASSIST IS SUDDENLY LOST BY REDUCING MY ABILITY TO STEER THE VEHICLE.  MAZDA SAID THERE WAS NO RECALL ON MY CAR SO THEY CANT HELP ME.       MAZDA IS RECALLING CERTAIN MODEL YEAR 2007-2009 MAZDA3 AND MAZDA5 VEHICLES MANUFACTURED FROM APRIL 2, 2007 THROUGH NOVEMBER 30, 2008. THESE VEHICLES MAY HAVE A CONDITION IN WHICH A SUDDEN LOSS OF POWER STEERING ASSIST COULD OCCUR AT ANY TIME WHILE DRIVING THE VEHICLE.    CONSEQUENCE:  POWER STEERING ASSIST IS SUDDENLY LOST REDUCING THE DRIVER'S ABILITY TO STEER THE VEHICLE AS TYPICALLY EXPECTED, AND INCREASING THE RISK OF A CRASH.  *TR",
        "vin": "JM1CR293380"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/07/2014",
        "dateOfIncident": "09/07/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631352,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEATBELT JAM AND WILL NOT UNLATCHED. SEATBELT LOCKUP AND CHILD WAS LOCK IN BELT AND HAD TO BE CAREFULLY PULLED FROM SEAT. SEAL BELT IS LOCK TO SEAT.  CANNOT USED EXISTING BELT.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/06/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609712,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MAZDA 5 AND STOPPED FOR TRAFFIC LIGHT AS IT WAS RED. AS THE LIGHT TURNED GREEN, I MOVED MY FOOT FROM BRAKE TO ACCELERATOR PADDLE, THE CAR STARTED GOING IN REVERSE DIRECTION. I IMMEDIATELY APPLIED BRAKES, I TRIED TO ACCELERATE AGAIN AND AGAIN THE CAR WAS GOING IN REVERSE.     NO I DID NOT HAVE MY CAR ON REVERSE GEAR, THE CAR WAS ON \"D\" DRIVE ALL THE TIME.    I TURNED OFF THE CAR AND RESTARTED THE CAR AGAIN AND OUT THE CAR ON \"D\" AND AGAIN THE CAR WENT ON REVERSE. I TRIED THIS PROCESS AGAIN, THIS TIME ALL THE CAR DASHBOARD LIGHTS CAME ON AND CAR DID NOT START.    I IMMEDIATELY CALLED 911, ON 5TH JULY (SUNDAY) AROUND 3:00PM. MY CALL DETAILS CAN BE RECEIVED.    I TOWED MY CAR TO DEALERSHIP AND THEY ARE SUGGESTING ENGINE FAILURE. THE CAR CAN NO WAY HAVE ENGINE FAILURE. IF IT WAS ENGINE FAILURE HOW CAN THE CAR GO ON REVERSE?    I AM THANKFUL TO GOD THAT I DID NOT HIT THE CAR BEHIND I HAD A 4 YEAR OLD CHILD IN MY CAR. THIS IS A SERIOUS ISSUE WITH THIS CAR. I WOULD SUGGEST PEOPLE ARE AWARE OF THIS MAJOR ISSUE AS THIS CAN LEAD TO MAJOR ACCIDENTS.    ALSO, I GOT IT SERVICED 3 MONTHS BACK AND NO ISSUE WAS IDENTIFIED. I LIKE MAZDA 5 MINI VAN I HAVE BEEN DRIVING FOR ABOUT 4 YEARS BUT THIS INCIDENT HAS GREAT SETBACK ABOUT MAZDA IN MY MIND. I ALSO HAVE MAZDA CX-7 THAT I AM SO SCARED TO DRIVE. I CAN NEVER IMAGINE THE CAR GOING INTO REVERSE WHILE IN DRIVE MODE. THIS IS LIFE THREATENING DEFECT IN THE CAR.     THANK YOU AND GOD BLESS YOU.    P.S. THE VEHICLE SPEED WAS BETWEEN 0-5 MPH, THE SPEED WHEN YOU TAKE FOOT OF BRAKE AND PRESS SPEED ACCELERATOR.  *TR",
        "vin": "JM1CR293X80"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496132,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA5 2008 WEARING INSIDE OF TIRES PREMATURELY AND CUPPING. OUTSIDE EDGE OF TIRES REPORTED TO STILL HAVE 15000 MILES LEFT OF USE. SECOND SET OF TIRES PURCHASED WITH SAME PROBLEM. GRINDING NOISE EVERY TIME DEALER ROTATED AND ALIGNED THE TIRES EVERY 5K MILES DURING OIL CHANGE. I WAS ACCUSED OF NOT ROTATING TIRES ENOUGH; HOWEVER, NOW THEY ADMIT THE ALIGNMENT IS A COMMON PROBLEM WITH MAZDA5. DEALER ONLY RECOMMENDS I GET A \"SPECIAL\" GERMAN ENGINEERING STYLE ALIGNMENT THAT COSTS $89 EVERY 10K MILES. I AM FORCED TO PAY FOR THEIR POOR DESIGN.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/18/2013",
        "dateOfIncident": "01/15/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493434,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA MAZDA5. THE CONTACT STATED THAT ALL FOUR TIRES WERE WEARING EXCESSIVELY DUE TO THE FACTORY SPECIFICATIONS OF THE ALIGNMENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND COULD NOT PROVIDE ANY ASSISTANCE TO THE CONTACT. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/27/2012",
        "dateOfIncident": "05/19/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463322,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THE SEAL THAT SECURES THE WINDOW TO THE FRAME OF THE VEHICLE HAS AN 1/8 INCH OPENING, A BREAK IN THE SEAL LINING.  ON A RECENT ROAD TRIP, IN MAY, DRIVER AND PASSENGER HEARD THIS POPPING NOISE, WE THOUGHT THAT SOMETHING WAS HITTING THE CAR TOP, APPARENTLY NOT, AS THE RIGHT WINDOW SEAL IS FURTHER STRETCHED OUT AND A BREAK HAS NOW OCCURRED. I AM CONCERNED THAT UNDER CONSISTENT USE AND PRESSURE THAT THE OPENING WILL CONTINUE TO STRETCH OUT EVEN FURTHER AFFECTING THE WINDSHIELD SECURITY AND THE DRIVER.  MY MILEAGE IS LIMITED AND VERY LOW AT THIS TIME BUT VERY CONCERNED FOR SAFETY PURPOSES.  *TR",
        "vin": "JM1CR293980"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463089,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING THE CAR ON THE HIGHWAY AND THE CAR BEGAN TO STALL AND SLOW DOWN SUDDENLY. THE CAR'S HEAT INDICATOR LIGHT WENT ON HIGH AND THEN WENT TO COLD. HE COULD NOT DRIVE THE CAR PAST 45 MILES. WHEN MY HUSBAND EXITED THE RAMP OFF THE HIGHWAY THE CAR SHUT DOWN COMPLETELY. THE INCIDENT COULD POTENTIALLY PUT MY HUSBAND IN A DEADLY ACCIDENT HAVING HAD STALLED AND STOPPED ON A HIGHWAY WITH CARS SPEEDING BEHIND HIM. WE WERE TOLD BY A MAZDA DEALER THAT WE ARE RESPONSIBLE FOR REPLACING THE ENGINE WHICH APPARENTLY BLEW. THEY CLAIM THE ENGINE HAD NO OIL, BUT WE KNOW THE CAR SHOULD HAVE HAD OIL. NO CHECK OIL LIGHT EVER CAME ON. IN ADDITION, THIS CAR STALLED WHILE I WAS DRIVING ON THE HIGHWAY 6 MONTHS AFTER WE PURCHASED THE CAR. THAT TIME I WAS ABLE TO PULL OVER TO THE SLOW LANE AND DRIVE IT SLOWLY AS THAT TIME IT ALSO DID NOT ALLOW ME TO DRIVE PAST 45 MILES. THE DEALER FIXED THE PROBLEM STATING THAT IT WAS THE TRANS CONTROL MODULE THAT WAS DEFECTIVE. EARLIER THIS MONTH THE CAR BEGAN TO STALL AGAIN WHILE I WAS DRIVING ON THE HIGHWAY ONCE MORE, THE MECHANIC SUGGESTED TO REPLACE THE TRANSMISSION. I FAILED TO MENTION THAT A FEW MONTHS AFTER BUYING THE CAR THE AIR BAG LIGHT WOULD COME ON INDICATING THAT IT WAS NOT WORKING. WE EXPECTED ALL THE TROUBLES WITH THE CAR TO BE ELECTRICAL, BUT EITHER WAY THESE PROBLEMS COULD HAVE CAUSED OUR LIVES.  *TR",
        "vin": "JM1CR293X80"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/18/2012",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444449,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA MAZDA5.  THE CONTACT HEARD A KNOCKING COMING FROM THE FRONT END OF THE VEHICLE WHEN ACCELERATING.  THE DEALER INFORMED THE CONTACT THAT BOTH THE STRUTS AND SHOCKS WERE FRACTURED, LEAKING AND NEEDED TO BE REPLACED.  THE CONTACT SENT THE MANUFACTURER AN EMAIL AND WAS AWAITING A RESPONSE.  NO REPAIRS WERE PERFORMED.  THE CURRENT MILEAGE WAS 51,000 AND THE FAILURE MILEAGE WAS 46,000.",
        "vin": "JM1CR29L880"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/26/2011",
        "dateOfIncident": "08/22/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427220,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "EXTENSA",
                "productYear": "9999",
                "size": "215/65R15",
                "type": "Tire"
            }
        ],
        "summary": "TOYO TIRES SIZE 205 50 17 FAILED AT 22,000 MILES.  *TR",
        "vin": "JM1CR293680"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/30/2011",
        "dateOfIncident": "03/28/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393772,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA 5. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH WHEN A TIRE SUDDENLY BECAME FLAT. THE VEHICLE WAS INSPECTED BY A DEALER WHO ADVISED HIM THAT THE VALVE STEM WAS FRACTURED AND CAUSED THE FLAT TIRE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 48,000.",
        "vin": "JM1CR29L180"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/08/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386865,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR IN DUE TO RECALL NOTICE FOR POWER STEERING FAILURE FOR REPLACEMENT PART. NEW PART INSTALLED WAS DEFECTIVE AND RESULTED IN LOSS OF STEERING ABILITY. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "01/08/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375443,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLASS PANEL OF 2008 MAZDA5 MOONROOF EXPLODED ON HIGHWAY WITH NO APPARENT REASON. LUCKILY THE INSIDE COVER WAS IN PLACE AND NOT MANY BROKEN PIECES FELL DOWN FROM THE GAP. AFTER A SEARCH ON THE INTERNET, THE ISSUE SEEMS NOT UNCOMMON AMONG MAZDA CARS AND MINIVANS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/28/2010",
        "dateOfIncident": "08/24/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352484,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/24/10 I WAS DRIVING IN SF CITY TRAFFIC AS I NEARED AN INTERSECTION, MY POWER STEERING ON MY 2008 MAZDA 5 FAILED. I PULLED OVER INTO A RED ZONE, BARELY OUT OF TRAFFIC, AND TURNED OFF THE CAR. I READ THE MANUAL AND IT SUGGESTED TURNING THE CAR ON AGAIN. I DID BUT THE STEERING LIGHT REMAINED ON. I MOVED THE CAR (WITH DIFFICULTY AND NO SMALL AMOUNT OF STRESS) TO A SAFER LOCATION. I CALLED MAZDA AND THEY CAME AND TOWED THE CAR TO THE DEALERSHIP. THEY REPAIRED THE CAR IN 4 DAYS TIME. THEY TOLD US THEY WERE \"ABOUT\" TO SEND OUT RECALL NOTICES ON THE MAZDA 5. THE NEXT DAY (8/25) I READ IN THE NY TIMES AUTO SECTION THAT THE MAZDA CORP. IN JAPAN HAD KNOWN ABOUT THIS POWER STEERING FAILURE FOR 2 YEARS. THIS SEEMS INCREDIBLE TO ME, GIVEN THAT THE CAR IS BARELY 2 YEARS OLD. LUCKILY NOTHING HAPPENED BUT 5 MINUTES BEFORE I HAD BEEN ON THE FREEWAY GOING 55 MILES AN HOUR. WHAT WOULD HAVE HAPPENED IF THE POWER STEERING HAD GONE OUT THEN? *TR",
        "vin": "JM1CR29LX80"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "05/14/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352341,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA 5 - 2008  SHOCKS AND STRUTS CAUSES CAR UNBALANCED AND DAMAGING RUBBERS (BETWEEN SHOCK AND FRAME)  TO CAUSE NOISES. THIS ALSO DAMAGES THE TIRES AND TIRE ALIGNMENT. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352158,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STEERING TWO TIMES ON MY MAZDA 5. *TR",
        "vin": "JM1CR29L180"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/16/2010",
        "dateOfIncident": "08/15/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10349666,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT, POWER STEERING WAS LOST WHILE MAKING A U-TURN.  WARNING LIGHT ILLUMINATED.  REGAINED POWER AFTER HALF AN HOUR. SECOND INCIDENT, ATTEMPTED TO AVOID A SWERVING CAR, BUT STEERING WHEEL LOCKED UP AND COULD NOT CONTROL VEHICLE.  ENDED UP SPINNING OUT AND CRASHED INTO ANOTHER CAR AND THE CENTER MEDIAN. *TR",
        "vin": "JM1CR29L980"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346164,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED THREE TIMES YESTERDAY.  DASH LIGHT CAME ON AND STEERING GOT VERY HEAVY ALTHOUGH I WAS ABLE TO MUSCLE THE CAR THROUGH TURNS.  DAY WAS VERY HOT AND WE WERE DRIVING IN AN URBAN ENVIRONMENT.  I DID WHAT THE OWNERS' MANUAL SAID - STOPPED AND SHUT OFF THE CAR, WAITED A FEW SECONDS AND RESTARTED THE CAR.  IN TWO OUT OF THE THREE INSTANCES THE POWER STEERING LIGHT HAD GONE OUT AND THE POWER STEERING WAS WORKING.  IN THE OTHER INSTANCE THE LIGHT DID NOT GO OUT AND THE POWER ASSIST WAS NOT WORKING.  THE CAR IS WORKING OKAY NOW AND I AM NOT SURE IF OR WHEN THIS MIGHT OCCUR AGAIN.  BECAUSE OF THE DRIVING SITUATION AT THE TIME AND BECAUSE I AM AN EXPERIENCED DRIVER THIS DID NOT PRESENT A GRAVE SAFETY ISSUE; HOWEVER, HAD I BEEN DRIVING FASTER AND THE ROAD CONDITIONS BEEN POOR IT COULD HAVE BEEN CATASTROPHIC. *TR",
        "vin": "JM1CR293680"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/04/2010",
        "dateOfIncident": "07/03/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341392,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA 3 AND 5 POWER STEERING FAILURE.  THIS IS CURRENTLY COVERED BY MAZDA TSB: 06-002/09     I THINK MAZDA SHOULD ISSUE A RECALL FOR THE AFFECTED PARTS. LOSS OF POWER STEERING CAN BE VERY DANGEROUS FOR PEOPLE WITH LIMITED PHYSICAL STRENGTH. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341335,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING MY 2008 MAZDA 5 IN LATE MARCH 2010, THE POWER STEERING STOPPED WORKING.  THE PROBLEM PERSISTED UNTIL WE GOT IT FIXED.     THE MECHANIC GAVE THE FOLLOWING DIAGNOSTIC, 'C1099 POWER STEERING CIRCUIT FAULT HYDROELECTRIC POWER STEERING PUMP INTERMITTENTLY SHUTS DOWN. MAZDA TSB REFERENCES THIS ISSUE. RECOMMEND PERFORM TSB PER MAZDA AND REEVALUATE.'     THE REPAIR COST AROUND $1,000. *TR",
        "vin": "JM1CR293380"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/02/2010",
        "dateOfIncident": "06/05/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341221,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A HOTEL PARKING LOT WHICH HAPPENED TO BE A STEEP SLOPE.  I STOPPED MID WAY UP THE HILL TO SEE WHERE I NEEDED TO CHECK IN AND PARK.  WHEN I TOOK MY FOOT OFF OF THE BRAKE, I STARTED ROLLING BACKWARDS.  I PUSHED THE ACCELERATOR BUT NOTHING HAPPENED, MY CAR CONTINUED TO ROLL BACKWARDS.  I PUSHED THE BRAKE PEDAL BUT IT WOULDN'T ALLOW ME TO PUSH IT DOWN.  IT WAS STUCK.  THEN MY CHECK ENGINE LIGHT CAME ON AS WELL AS MY BRAKE LIGHT.  AS I REACHED FOR THE EMERGENCY BRAKE MY CAR STOPPED BECAUSE I RAN INTO A LIGHT POST AND A TREE DAMAGING MY CAR.  I WAS ABLE TO GET THE CAR INTO PARK AND SHUT OFF THE ENGINE.  I TURNED THE CAR BACK ON AND THE LIGHTS WERE NO LONGER ON.  I WAS ABLE TO DRIVE IT AND PARK IT.  I ASSESSED THE DAMAGE WHICH WERE BOTH REAR QUARTER PANELS WERE DAMAGED AS WELL AS A FEW DENTS AND SCRATCHES.  SINCE IT WAS THE WEEKEND I WAITED TILL MONDAY MORNING TO CALL MY DEALERSHIP.  THEY SAID THEY WOULDN'T TOUCH IT WITHOUT ME REPORTING IT TO MAZDA CORP. FIRST.  I CALLED MAZDA AND EXPLAINED WHAT HAPPENED.  THEY TOLD ME I WOULD HAVE TO RUN IT THROUGH MY INSURANCE COMPANY SINCE THERE WAS DAMAGE TO MY CAR.  I CALLED MY INSURANCE COMPANY THE NEXT MORNING AND REPORTED IT.  I HAD TO PAY MY DEDUCTIBLE PLUS SOME MONEY FROM MY INSURANCE COMPANY TO GET IT FIXED.  I ASKED FOR MAZDA TO CHECK THE EVENT DATA RECORDER TO SEE WHY THIS HAPPENED.  I'M NOT SURE IF THIS WAS DONE BECAUSE IT SOUNDED LIKE THEY ONLY CHECKED THE DIAGNOSTICS AND SAID THERE WAS NOTHING WRONG WITH MY CAR.  I DON'T BELIEVE I SHOULD HAVE HAD TO PAY FOR MY CAR BECAUSE IT WAS FAULTY.  IT IS STILL UNDER WARRANTY. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "06/28/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340725,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA5 POWERSTEERING PUMP SHUTS DOWN WHEN HOT, MAZDA KNOWS ABOUT THE PROBLEM AND REFUSES TO RECALL. DANGEROUS FOR SMALL OR WEEK DRIVERS. HAS OCCURRED 2 TIMES ON ME IN AFTER SITTING IN TRAFFIC. INTERNET SEARCH REVEALS LOTS OF COMPLAINTS. *TR",
        "vin": "JM1CR293680"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2010",
        "dateOfIncident": "06/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340594,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILURE AT LOW SPEED, POWER STEERING LIGHT COMES ON.  AFTER RESTART FUNCTIONED NORMALLY. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/18/2010",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339094,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE ON MY MAZDA5 WAS RUNNING AT IDLE SPEED FOR APPROXIMATELY 10-15 MINUTES ON A WARM DAY.  IN PULLING OUT OF THE PARKING LOT, THE POWER STEERING FAILED COMPLETELY AND THE WARNING LIGHT CAME ON.  IN RESEARCHING WITH OTHER OWNERS, I REALIZED THAT THIS IS A PERVASIVE PROBLEM. *TR",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2010",
        "dateOfIncident": "05/07/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334239,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA 5. THE CONTACT STATED THAT ON MAY 7, 2010, THE POWER STEERING FAILED AND SHE HAD TO USE THE MANUAL STEERING POWER. THE VEHICLE WAS TAKEN TO A REPAIR SHOP WHERE THE CONTACT WAS INFORMED THAT THE POWER STEERING MODULE NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLAINT. THE CONTACT CALLED THE DEALERSHIP AND WAS TOLD THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE FAILURE MILEAGE WAS APPROXIMATELY 39,000. THE CURRENT MILEAGE WAS APPROXIMATELY 41,000.",
        "vin": "JM1CR29L280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2010",
        "dateOfIncident": "05/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333822,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA5 - 40K MILES    AFTER IDLING IN PARKING LOT FOR APPROX 20 MINS, PUT CAR IN DRIVE AND ATTEMPTED TO LEAVE.  POWER STEERING LIGHT ILLUMINATED, WIFE COULD NOT TURN WHEEL AT ALL.  TURNED OFF CAR.  I ARRIVED 10 MINS LATER AND WAS ABLE TO OPERATE THE STEERING WITH DIFFICULTY. *TR",
        "vin": "JM1CR293580"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/26/2010",
        "dateOfIncident": "05/26/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332377,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA 5 POWER STEERING FAILURE.  NORMAL DRIVING CONDITIONS AND POWER STEERING FAILED DURING OPERATION AT HIGHWAY SPEED.  POWER STEERING FLUID FINE AND NO OTHER PHYSICAL SIGNS APPARENT TO CAUSE FAILURE.  POWER STEERING RESUMED ONCE THE CAR WAS TURNED OFF AND THEN ON AGAIN. *TR",
        "vin": "JM1CR29L280"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/26/2010",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332434,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILURE.  NORMAL MIXED DRIVING, HIGHWAY & CITY STOP & GO,  WHILE WAITING IN A DRIVE THRU FOR COFFEE, STEERING WHEEL BECAME ALMOST IMMOVABLE, WOULD STILL TURN TO NORMAL LIMITS BOTH RIGHT & LEFT, HOWEVER THE EFFORT REQUIRED WAS VERY HIGH.  RETURNED CAR TO DEALER UNDER WARRANTY NOTICING THAT STEERING EFFORT REMAINED CONSTANT THROUGHOUT THE DRIVE.  EFFORT REQUIRED WAS NOT DEPENDENT ON SPEED, OR DIRECTION. *TR",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/05/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330052,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO PARALLEL PARK IN REVERSE AND THE POWER STEERING DIED.  A LIGHT SHOWED UP ON THE DASHBOARD INDICATING THE SAME.  BECAUSE IT WAS A BUSY STREET A BUNCH OF CARS AND BIKE RIDERS WERE BACKING UP BEHIND ME.  I MUSCLED THE CAR INTO THE SPOT WITHOUT THE POWER STEERING.  WHEN I SHUT THE CAR OFF AND RESTARTED IT, THE POWER STEERING WORKED AGAIN. *TR",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/01/2010",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328364,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IDLING IN THE GARAGE FOR ABOUT 20 MINUTES, WHEN I WENT TO BACK IT OUT OF THE GARAGE THE STEERING RESPONSE WAS EXTREMELY HEAVY (E.G. NO POWER STEERING) AND THE POWER STEERING WARNING LIGHT ON THE DASHBOARD WAS ON.   I DROVE WITHOUT POWER STEERING -- VERY DIFFICULT -- FOR ABOUT 10 MINUTES -- THEN CAME HOME, TURNED OFF THE ENGINE, AND LET THE CAR COOL.  AFTER COOLING OFF THE POWER STEERING RETURNED AND THE WARNING LIGHT NO LONGER CAME ON.    VARIOUS ONLINE FORUMS INDICATE THIS IS A PERSISTENT PROBLEM WITH MAZDA 3S AND 5S, AND THAT THE PROBLEM HAS OCCURRED TO MANY VEHICLE OWNERS WHILE DRIVING.    MAZDA HAS ISSUED A TSB, BUT HAS NOT ISSUED A RECALL.  SEE:    [BEGIN TECHNICAL SERVICE BULLETIN]    TSB: 06-002/09    2007-2009 MAZDA3 AND 2007-2009 MAZDA5 - HEAVY STEERING EFFORT WITH POWER STEERING MALFUNCTION INDICATOR LAMP ON AND DTC C1099    APPLICABLE MODEL(S)/VINS    2007-2009 MAZDA3 VEHICLES (NOT INCLUDING MAZDASPEED3) WITH VINS BELOW (PRODUCED BETWEEN APRIL 1, 2007 AND NOVEMBER 4, 2008)   '2007-2008 JM1BK****** 742201 - 880507   '2008-2009 JM1BK****** 100002 - 251982   2007-2009 MAZDA5 VEHICLES WITH VINS JM1CR***** 155672 - 349055 (PRODUCED BETWEEN PRODUCED BETWEEN APRIL 1, 2007 AND NOVEMBER 4, 2008)  DESCRIPTION    SOME CUSTOMERS MAY FEEL THAT THE STEERING EFFORT IS HARD OR HEAVY WITH POWER STEERING MALFUNCTION INDICATOR LAMP ILLUMINATION AND DTC C1099 [ELECTRO HYDRAULIC POWER ASSIST STEERING (EHPAS)] STORED IN MEMORY. THIS PROBLEM IS CAUSED BY CONTAMINATION OF THE SYSTEM FROM SUCH THINGS AS CORROSION GETTING INSIDE THE POWER STEERING LINE, STICKING IN THE POWER STEERING PUMP, AND LOWERING THE REVOLUTION SPEED. THE SYSTEM THEN GOES INTO A FAIL SAFE FUNCTION.  CUSTOMERS HAVING THIS CONCERN SHOULD HAVE THEIR VEHICLE REPAIRED USING THE FOLLOWING REPAIR PROCEDURE.    [END EXCERPT FROM TECHNICAL SERVICE BULLETIN]    I AM WRITING BECAUSE I FEEL THIS IS A MANUFACTURING DEFECT THAT MAZDA SHOULD BE REQUIRED TO REPAIR AT ITS EXPENSE, NOT THE OWNERS'.  THANK YOU.*TR",
        "vin": "JM1CR29L980"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/20/2010",
        "dateOfIncident": "04/20/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326680,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 MAZDA 5 WITH JUST OVER 50,000 MILES ON IT.  I TRAVEL IN SALES, SO I AM PUT QUITE A FEW MILES ON PER YEAR.  IN THE PAST MONTH I HAVE EXPERIENCED 3 OCCASIONS WHERE UPON STARTING MY CAR, THE POWER STEERING LIGHT COMES ON AND THERE IS NO POWER STEERING.  EACH TIME, I PUT THE CAR IN PARK AND RESTART AND THE LIGHT GOES OUT AND THE POWER STEERING RETURNS.  HEAT SEEMS TO PLAY AN ISSUE IN THIS.  ALSO, THE POWER STEERING WILL NOT RESET AFTER RESTARTING THE CAR UNLESS THE AIR CONDITIONING IS FIRST SHUT OFF.  THERE IS A SECTION IN THE OWNERS MANUAL THAT ADDRESSES WHAT TO DO IF THE POWER STEERING LIGHT COMES ON AND THE POWER STEERING FAILS TO RESPOND.  THIS WOULD INDICATE TO ME THAT MAZDA HAS SEEN THIS OCCUR.  AS SOMEONE WHO WAS IN THE AUTOMOTIVE INDUSTRY FOR OVER 30 YEARS, I HAVE NO CLUE WHY A AUTO MANUFACTURER WOULD ADD ELECTRONICS TO A POWER STEERING SYSTEM.  I HAVE CONTACTED MY LOCAL MAZDA DEALER AND THEY TOLD ME THAT THEY HAVE SEEN THIS PROBLEM BEFORE.  APPARENTLY, IT COULD BE THE PUMP OR THE HOSES TO THE STEERING RACK AND NATURALLY THE WARRANTY ENDS AT 36,000 MILES.  I KNOW PUMPS RUN OVER $ 650.00 WHICH DOES NOT INCLUDE LABOR.  I AM 58 YEARS OLD AND HAVE NEVER HAD TO REPLACE THE POWER STEERING ON ANY VEHICLE, ESPECIALLY ONE WITH SUCH LOW MILEAGE.  NEEDLESS TO SAY I AM NOT PLEASED. *TR",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "03/13/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325537,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA5 LOST POWER STEERING WHILE DRIVING. PS LIGHT CAME ON. PULLED OVER AND TURNED CAR OFF. WAITED WITH ENGINE OFF FOR 30 MINUTES. PS RESTORED AFTER ENGINE TURNED BACK ON. *TR",
        "vin": "JM1CR293180"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "04/11/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10325024,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA5. THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH. THE BRAKE PEDAL WAS APPLIED WITH EXCESSIVE FORCE AND THE ANTILOCK BRAKE SYSTEM FAILED TO ACTIVATE. THE VEHICLE CONTINUED TO ACCELERATE AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE CONTACT SUSTAINED INJURY TO HIS RIGHT FOOT. THE VEHICLE WAS TOWED TO A BODY SHOP. THE ENTIRE FRONT END OF THE VEHICLE WAS DAMAGED. THERE WAS DEPLOYMENT OF THE AIR BAGS DURING THE CRASH. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WILL BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 25,143.",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/08/2010",
        "dateOfIncident": "04/07/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324559,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING ON THE MAZDA 5 FAILS - NO STEERING AND LIGHT COMES ON. *TR",
        "vin": "JM1CR29L880"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324192,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA5. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 10 MPH, THE POWER STEERING FAILED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE IDENTICAL FAILURE OCCURRED EIGHT MONTHS AFTER THE FIRST OCCURRENCE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER TWICE. THE VEHICLE HAD NOT BEEN REPAIRED WHEN THE COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 3,000. THE VIN WAS NOT AVAILABLE. THE CURRENT MILEAGE WAS 15,800.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324198,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING FROM REAGAN AIRPORT TO KENSINGTON, MARYLAND.  WHILE CHANGING LANES ON I-495, THE POWER STEERING GAVE OUT ON OUR MAZDA5 WITH 39K MILES ON IT.  WE WERE ABLE TO DRIVE HOME WITH GREAT EFFORT.  WE TOOK THE CAR TO THE MAZDA DEALERSHIP AND THEY KNOW ABOUT THIS PROBLEM, THAT IT IS TYPICAL FOR MAZDA5S. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "04/04/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324033,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA 5. WHILE DRIVING AT APPROXIMATELY 10 MPH AND ATTEMPTING TO PARK, THE POWER STEERING LIGHT ILLUMINATED. THE DRIVER STATED THAT IT BECAME VERY DIFFICULT TO STEER AT THAT POINT. SHE WAS ABLE TO MANEUVER THE VEHICLE TO A SAFE AREA AND TURN IT OFF. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALERSHIP WHERE SHE WAS INFORMED THAT THE FAILURE WAS CAUSED BY A DEFECTIVE POWER STEERING PUMP. HE CALLED THE MANUFACTURER AND COMMUNICATED THE FAILURE. THE CONTACT HAD PLANNED TO HAVE THE VEHICLE REPAIRED AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE 14,428.",
        "vin": "JM1CR29L180"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322152,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING IN VERY SLOW MOVING TRAFFIC ON A SURFACE STREET, TRAVELED 1/4 MILE IN APPROXIMATELY A 45 MINUTE TIME SPAN.  AS I TURNED RIGHT ON TO A NEW STREET I NOTICED THE STEERING BECAME VERY DIFFICULT.  I IMMEDIATELY TOOK THE VEHICLE TO THE PARKING LOT TO MY LEFT.  IT TOOK GREAT STRENGTH TO TURN THE WHEEL TO MAKE THE LEFT HAND TURN.  I STOPPED THE CAR, CHECKED THE POWER STEERING FLUID.  IT WAS AT PROPER LEVEL.  I  RESTARTED THE VEHICLE AND STILL NO POWER STEERING.  AFTER SITTING FOR APPROCIMATELY 15 MINUTES.  I RESTARTED THE VEHICLE AGAIN AND THE POWER STEERING HAD RETURNED.  I  HAD THE CAR TOWED TO THE DEALERSHIP.  I AM READING SEVERAL REPORTS OF SIMILAR INSTANCES OF THIS OCCURRING IN THE SAME MAKE AND MODEL OF VEHICLE UNDER SIMILAR CIRUMSTANCES.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2010",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321173,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA5 WITH 55,000MI (90% HIGHWAY DRIVEN).  WHILE DRIVING ABOUT 20 MPH IN TOWN THE STEERING WHEEL ALL OF A SUDDEN BECAME VERY DIFFICULT TO TURN AND I NOTICED THE  STEERING FAILURE LIGHT ON THE DASHBOARD.  PULLED TO A SAFE LOCATION AND CALLED MY DEALERSHIP.  THE MECHANIC INDICATED THAT IT WAS A VOLTAGE TRIP AND IF I TURNED OFF THE CAR AND RESTARTED IT WOULD RESET AND WORK AGAIN.  THE STEERING DID WORK AFTER I STARTED THE ENGINE AND I HAVE DRIVEN ABOUT 200 MILES WITH NO OTHER OCCURRENCE.  ON FRIDAY I HAD MY OIL CHANGED AT THE DEALERSHIP AND WHEN I TOLD THEM OF THE PROBLEM THEY INDICATED THAT I WOULD HAVE TO REPLACE MY PUMP AND A LENGTH OF HOSE.  WHY THE HOSE TOO?  ITS 6,000MI OUT OF WARRANTY.    AFTER SOME INTERNET SLEUTHING, IT SEEMS THAT THIS IS A VERY COMMON MECHANICAL FAILURE THAT MAZDA IS NOT DEALING WITH RESPONSIBLY.  HARD TO IMAGINE THEY ARE NOT LEARNING FROM TOYOTA'S AND HONDA'S EXPERIENCE.  THIS IS A HUGE SAFETY ISSUE ESPECIALLY IF THIS FAILURE OCCURS UNEXPECTEDLY ON THE HIGHWAY WHILE DRIVEN BY AN INEXPERIENCED DRIVER.    NOT SURE ABOUT NOW BUT MANY OWNERS EARLIER IN 2010 WERE HAVING TO WAIT OVER 5 WEEKS TO GET A REPLACEMENT PUMP DUE TO A BACKORDER ISSUE.    I CAN'T BELIEVE THAT MAZDA IS NOT PROACTIVELY DOING A VOLUNTARY RECALL.    PLEASE INVESTIGATE THIS SERIOUS PROBLEM AND SUGGEST TO MAZDA THAT REPLACING THE FAULTY PUMPS UNDER AN EXTENDED WARRANTY IS GOOD FOR SAFETY AND GOOD FOR BUSINESS. *TR",
        "vin": "JM1CR293480"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "02/11/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318043,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PEDAL STICKS TO FLOOR WHEN WEATHER IS COLD CAUSING DIFFICULTY SHIFTING AND OR GETTING VEHICLE TO MOVE. WHEN OUTDOOR TEMPS ARE BELOW 35F, CLUTCH PEDAL WILL STAY DEPRESSED UNTIL VEHICLE WARMS UP OR IS MANUALLY PULLED BACK UP WITH HANDS. PEDAL MAY STAY DEPRESSED WHEN ATTEMPTING TO DRIVE OR POP BACK UP ABRUPTLY CAUSING STALLS IN TRAFFIC, SPINNING THE TIRES OR OTHER DANGEROUS ACTIONS. PROBLEM IS CAUSING EXCESSIVE CLUTCH WEAR AND CHATTER, DAMAGE TO MOTOR MOUNTS AND TIRES. *TR",
        "vin": "JM1CR293780"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": true,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "02/25/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318118,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FLOOR MAT FLIPS UP OVER CLUTCH AND BRAKE PEDAL SOMETIMES WHEN SHIFTING GEARS. CAN CAUSE ACCIDENTAL BRAKE APPLICATION WHEN SHIFTING GEARS. EYELET SECURING MAT TO FLOOR SEPARATES FROM MAT AFTER A FEW MONTHS OF USAGE. ALLOWS FLOOR MAT TO SHIFT FORWARD AND THE FRONT EDGE OF THE MAT CATCHES THE CLUTCH PEDAL. WHEN THE PEDAL IS DEPRESSED, THE MAT CATCHES THE PEDAL AND FLIPS UP OVER THE BRAKE AND CLUTCH PEDAL. PRESSING THE CLUTCH AGAIN WILL ALSO ENGAGE BRAKE.    WHEN OPERATING VEHICLE ON FEB 25, 2010, TWO TIMES THE BRAKES APPLIED WHEN SHIFTING GEARS DUE TO THE MAT INTERFERENCE. THE SECOND TIME THE VEHICLE SKIDDED OUT OF A TURN AND DAMAGED THE FRONT RIGHT WHEEL AND TIRE WHEN HITTING A CURB. THE MAT WAS REMOVED TO PREVENT FURTHER PROBLEMS. VEHICLE WAS INOPERABLE AFTER INCIDENT. *TR",
        "vin": "JM1CR293780"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2010",
        "dateOfIncident": "03/06/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317379,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED INTO PARKING SPACE, WHEN I PUT IT IN REVERSE TO BACK UP AND DRIVE AWAY THE POWER STEERING SUDDENLY TURNED OFF AND AN ORANGE CAUTION LIGHT TURNED ON MY DASH BOARD, THE POWER STEERING DID NOT WORK DURING THE DRIVE HOME. AFTER SOME RESEARCH IT SEEMS THAT THIS A RECURRING PROBLEM WITH THE MAZDA 5. *TR",
        "vin": "JM1CR293580"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317261,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED WHILE DRIVING DOWNHILL IN A PARKING GARAGE. *TR",
        "vin": "JM1CR293380"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "12/09/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311283,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA 5. WHILE DRIVING 30 MPH THE POWER   STEERING WARNING LIGHT ILLUMINATED AND THE STEERING WHEEL LOCKED. THE CONTACT WAS ABLE TO DRIVE WITH DIFFICULTY TO THE EMERGENCY LANE. THE VEHICLE WAS TURNED OFF FOR 30 MINUTES. WHEN THE VEHICLE WAS RESTARTED IT FUNCTIONED NORMALLY. THE DEALER STATED THAT THEY WOULD HAVE TO SEE THE WARNING LIGHT ILLUMINATED BEFORE REPLACING ANY PARTS. THE FAILURE HAS OCCURRED 3 TIMES AND NO REPAIRS HAVE BEEN MADE TO THE VEHICLE.  THE FAILURE MILEAGE WAS 8000.  THE CURRENT MILEAGE IS 10,000.      UPDATED 03/16/10   *BF  UPDATED 07/12/10. *JB",
        "vin": "JM1CR29L080"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/07/2009",
        "dateOfIncident": "09/06/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283068,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "TOYO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2008 MAZDA 5 GT    ANNOYING BAD TIRE NOISE ( TOYO TIRES ). *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/27/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282467,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "TOYO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MAZDA 5 PREMATURE TIRE WEAR ON TOYO TIRES. THE MAZDA HAS 24712 MILES, BUT ONLY ~15000 ARE ON THE TOYO TIRES DUE TO RUNNING SNOW TIRES ALL WINTER AND THERE IS CUPPING AND INNER TIRE WEAR. ALIGNMENT WAS CHECKED AT MAZDA AND REAR WAS SLIGHTLY OUT OF SPEC (-0.03). MAZDA DENIES EVER HEARING OF A TIRE PROBLEM ON THEIR MAZDA 5S, WHEN THE TOPIC IS ALL OVER THEIR WEB. WHEN I PURCHASED THE CAR THE SALEMAN ASSURED ME MAZDA HAD RESOLVED THE PREMATURE TIRE WEAR THAT HAD BEEN SEEN IN THE UK WHERE THE MAZDA 5 APPEARED BEFORE THE USA. *TR",
        "vin": "JM1CR29L180"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "09/24/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278691,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE TIRE WEAR IS A HUGE PROBLEM. HAD TO REPLACE THE FRONT 2 FACTORY TOYO TIRES AT 8,777 MILES (SEP 2008) DUE TO EVEN WEAR THAT PLACED THE TIRES IN THE \"RED\". REPLACED THE SAME TWO FRONT TIRES (WHICH WERE FALKEN) AT 24,437 MILES (JULY 2009) BECAUSE OF EVEN TIRE WEAR THAT PLACED THE TIRES IN THE \"RED\". I AM NOW ON MY THIRD SET OF TIRES AT ONLY 24,500 MILES. BOTH TIMES THAT TIRE REPLACEMENT OCCURRED, VEHICLE WAS TAKEN TO LOCAL MAZDA DEALERSHIP FOR ALIGNMENT CHECK AND TO VERIFY WHAT THE CAUSE OF THE ABNORMAL, PREMATURE WEAR IS. BOTH TIMES THE ALIGNMENT WAS NOT OFF AND THERE WAS NO DETERMINING CAUSE FOR THE PREMATURE WEAR OF THE FRONT TWO TIRES.*TR",
        "vin": "JM1CR293280"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273527,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GOES OUT SPORADICALLY. THERE HAVE BEEN THREE OCCASIONS SO FAR IN THE PAST YEAR THAT THE POWER STEERING HAS WENT OUT ON MY MAZDA 5. TWICE I WAS ABLE TO STOP THE CAR WAIT TEN SECONDS AND RESTART THE CAR AND IT RESET. ONCE IT TOOK TWO HOURS OF SITTING OFF BEFORE IT RESET ITSELF. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2009",
        "dateOfIncident": "05/22/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272691,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING FOR 2 HOURS OF A 4 HOUR DRIVE, POWER STEERING WENT OUT ON VEHICLE.  I WAS STOPPED AT A GAS STATION AND WENT TO PULL OUT WHEN IT HAPPENED.  IT HAD NOT HAPPENED BEFORE AND 24 HOURS LATER IT WAS WORKING AGAIN.  MAZDA HAS TAKEN MY CAR FOR REPAIR AND HAS GIVEN ME A RENTAL CAR.  HOWEVER DUE TO THE FREQUENCY WITH WHICH THIS HAS BEEN HAPPENING TO THE MAZDA 5 THE PARTS (PUMP AND PIPE) ARE ON BACK ORDER AND MY CAR WILL NOT BE REPAIRED AND RETURNED FOR 15 WEEKS.  IF I WERE TO TAKE POSSESSION OF MY CAR I WOULD HAVE TO SIGN A WAIVER THAT MAZDA IS NOT RESPONSIBLE FOR ANY ACCIDENT IF IT IS CAUSED BY THE PART FAILURE. *TR",
        "vin": "JM1CR293980"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/08/2009",
        "dateOfIncident": "04/04/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264758,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS FLOOR MAT RETAINING CLIP BEGINS TO SEPARATE FROM NORMAL USAGE. SEPARATION ALLOWS MAT TO MOVE FORWARD ENOUGH THAT EDGE OF MAT IS CAUGHT BY CLUTCH PEDAL DURING GEAR CHANGES. MAT LIFTS OVER CLUTCH PEDAL AND BECOMES ENTANGLED WITH CLUTCH AND BRAKE PEDAL WHEN TRYING TO SHIFT GEARS. MAT INTERFERENCE CAUSES ACCIDENTAL AND AGGRESSIVE BRAKE APPLICATION WHEN ATTEMPTING TO SHIFT GEARS. MAT HAS BEEN REPLACED BY DEALER PREVIOUSLY BUT PROBLEM RETURNS AFTER A FEW MONTHS OF USAGE. *TR",
        "vin": "JM1CR293780"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2009",
        "dateOfIncident": "03/24/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263798,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN HAS 15,000 MILES AND IS APPROX 14 MONTHS OLD. VEHICLE WAS DIAGNOSED WITH EXCESSIVE TIRE WEAR IN THE FRONT AND TIRE CUPPING IN THE REAR, CREATING EXCESSIVE ROAD/TIRE NOISE INSIDE OF THE VEHICLE CABIN. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "11/16/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253630,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA 5.  THE CONTACT STATED THAT THERE WERE LOOSE BOLTS ON THE REAR PASSENGER SIDE SUSPENSION.  WHILE DRIVING VARIOUS SPEEDS, THE CONTACT HEARD LOUD POPPING NOISES.  THE VEHICLE WAS TAKEN TO THE DEALER ONCE AND THEY PLANNED ON REPLACING THE BUSHING AND TIGHTENING THE BOLTS ON THE SUSPENSION.  THE INNER WALLS OF THE TIRES WERE WEARING OFF DUE TO THE LOOSE BOLTS, WHICH ALSO CAUSED THE SUSPENSION TO SLOWLY DETACH.  THE VEHICLE IS CURRENTLY IN THE SHOP FOR REPAIR.  THE CONTACT DISCOVERED THAT SEVERAL OTHER CONSUMERS WERE EXPERIENCING SUSPENSION FAILURE AS WELL.  THE FAILURE MILEAGE WAS 17,000 AND CURRENT MILEAGE WAS 21,000.",
        "vin": "JM1CR293180"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/14/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245449,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A 2008 MAZDA5 AND HAVE HAD TO TAKE IT TO THE DEALER TWICE FOR LOOSE BOLTS ON THE REAR RIGHT SUSPENSION. THE CAR HAS LESS THAN 2000 MILES ON IT. WE ARE CONCERNED ABOUT THE SAFETY OF THE CAR. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "09/27/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243922,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA 5.  WHILE DRIVING 65 MPH, THE SUNROOF SUDDENLY EXPLODED.  THE SUNROOF WAS CLOSED AT THE TIME OF THE FAILURE.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT SOMEONE IN THE VEHICLE CAUSED THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE 4,100.",
        "vin": "JM1CR293980"
    }
]