[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404636,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, WITHOUT WARNING, THE VEHICLE INDEPENDENTLY SWAYED TO THE RIGHT. THE CONTACT REGAINED CONTROL OF THE STEERING WHEEL. THE VEHICLE WAS NOT REPAIRED NOR DIAGNOSED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 13V385000 (STEERING) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 157,000.",
        "vin": "2LNHM82W48X"
    },
    {
        "components": "SUSPENSION,AIR BAGS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265222,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT STATED THAT THE CHECK AIR SUSPENSION AND TIRE FAULT WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE PASSENGER AND DRIVER SIDE AIR BAGS AND ALL FOUR TIRE SENSORS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 486,713.",
        "vin": "2LNHM84W78X"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/30/2018",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10869964,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN TOWN CAR.  CONSUMER WRITES IN REGARDS TO  FACTORY'S NON-REMOVAL OF PLASTIC SHEETING (USED TO PREVENT DUST IN FAN COMPARTMENT) SHREDDED/BLOCKED  DEFROSTER VENTS, FAN, BLEND DOOR, AND HEATER CAUSING NOISES AND SYSTEM MALFUNCTION.  *SMD *TR",
        "vin": "2LNHM82W28X"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "10/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. WHILE DRIVING AT ANY SPEED AND DEPRESSING THE BRAKE PEDAL, THE VEHICLE ACCELERATED. THE CONTACT DEPRESSED THE BRAKE PEDAL A COUPLE OF TIMES AND REGAINED CONTROL OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE FAILURE RECURRED FOUR TIMES. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.  UPDATED 10/26/17*LJ *JS",
        "vin": "2LNHM82VX8X"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/04/2017",
        "dateOfIncident": "02/04/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949532,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWLY BACKING OUT OF MY SHORT DRIVEWAY   MY FOOT ONLY ON THE BRAKE PEDAL WHEN SUDDENLY CAR ACCELERATES AND HIT PARKED CAR ACROSS AT RESULTING IN ACCIDENT.  TWO WEEKS BEFORE THIS I WAS DRIVING ON ROAD ABOUT 15 MPH AND SAW CAR AHEAD OF ME HAD STOPPED  I PUT FOOT ON BRAKE STARTED SLOWING WHEN CAR ACCELERATED HARD TAPPED BRAKE AND CAR STOPPED.  I DIDN'T PRESS THROTTLE.",
        "vin": "2LNHM82V78X"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. WHILE DRIVING VARIOUS SPEEDS, THE FRONT DRIVER SIDE DOOR INDEPENDENTLY LOCKED AND UNLOCKED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 46,800.",
        "vin": "2LNHM82W18X"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10840237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. WHILE APPROACHING TRAFFIC IN A LANE, THE BRAKE PEDAL WAS APPLIED AND WAS SLOW TO RESPOND. THE CONTACT APPLIED FORCE AND THE BRAKE PEDAL TRAVELED TO THE FLOOR. AS A RESULT, THE CONTACT CRASHED INTO THE PRECEDING VEHICLE. THE DRIVER SUSTAINED MINOR WHIPLASH THAT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS ABLE TO BE DRIVEN TO THE CONTACT'S RESIDENCE AND PARKED. THE VEHICLE WAS NOT INCLUDED IN NHTSA ACTION NUMBER: PE16003 (SERVICE BRAKES, SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE BRAKE MASTER CYLINDER WAS REPLACED PER THE CONTACT'S REQUEST. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO SPECIFIC REMEDY FOR THE CONDITION. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 32,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806229,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS SUDDENLY VIOLENTLY ACCELERATED ON FOUR DIFFERENT OCCASIONS DURING THE LAST ELEVEN MONTHS. THE FIRST INCIDENT OCCURRED AFTER TAPPING THE BRAKE PEDAL AT A VERY SLOW SPEED AND RESULTED IN THE CAR CRASHING INTO A BARRIER AT A FILLING STATION IN UPSTATE NEW YORK.   SUBSEQUENT EPISODES WERE HALTED BY TURNING THE IGNITION SWITCH OFF  WHILE ATTEMPTING TO STOP THE CAR WITH THE SERVICE BRAKES. THERE SEEMS TO BE  FEW COMMON THREADS AMONG THE INCIDENTS. THERE ARE NO WARNING INDICATORS BEFORE OR AFTER THE SUDDEN UNINTENDED ACCELERATION EVENTS. NO HISTORY CODES  WERE EVER RECORDED IN THE POWERTRAIN CONTROL MODULE.   THE INCIDENTS ALWAYS OCCURRED WHILE THE VEHICLE WAS MOVING AT A SLOW SPEED   SOMETIMES WHEN TAPPING THE BRAKE PEDAL AND OTHER TIMES WHILE PRESSING THE   ACCELERATOR PEDAL. NO FLOOR MATS WERE INVOLVED IN ANY OF THE INCIDENTS AND THE   DRIVER DEFINITELY DID NOT DEPRESS THE WRONG PEDAL OR BOTH PEDALS AT THE SAME TIME.",
        "vin": "2LNHM82W18X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790163,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. WHILE DRIVING AT 40 MPH AND MAKING A RIGHT TURN, THE STEERING WHEEL SEIZED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE STEERING SHAFT FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 63,478.",
        "vin": "2L1FM88W48X"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663889,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN TOWN CAR. CONSUMER REQUESTS REIMBURSEMENT FOR REPAIRS AND PARTS ON CAR BECAUSE IT WAS UNDER WARRANTY. *TA  THE CONSUMER STATED THE CHECK ENGINE LIGHT ILLUMINATED, A MECHANIC INFORMED THE CONSUMER THE ISSUE WAS RELATED TO THE CATALYTIC CONVERTER . ALSO, THE FUEL TANK HAD TO REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633596,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT STATED THAT THE VEHICLE FAILED TO RESPOND WHEN THE BRAKE PEDAL WAS DEPRESSED AND THE ENGINE REVVED. ON ANOTHER OCCASION, THE BRAKES FAILED TO RESPOND AND THE EMERGENCY BRAKE HAD TO BE APPLIED IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 43,200.",
        "vin": "2LNHM82W48X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/03/2014",
        "dateOfIncident": "11/12/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562609,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 13V385000 (STEERING) AND STATED THAT THE PART WAS UNAVAILABLE TO PERFORM THE REPAIR ON THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2LNHM85VX8X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "07/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534872,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT SHIFTED THE VEHICLE INTO PARK TO STOP THE ACCELERATION. THE VEHICLE DID NOT STOP AND CRASHED THROUGH A BARRIER. THE CONTACT WAS NOT INJURED DURING THE CRASH. THE VEHICLE WAS DESTROYED. THE CONTACT DID NOT CALL THE MANUFACTURER AND THE VEHICLE WAS NOT INSPECTED TO DETERMINE THE CAUSE OF THE FAILURE.  THE FAILURE MILEAGE WAS 61,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/17/2011",
        "dateOfIncident": "04/17/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396568,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "ENERGY LX4",
                "productYear": "9999",
                "size": "P225/60R17",
                "type": "Tire"
            }
        ],
        "summary": "IN 2008, I PURCHASED A NEW LINCOLN TOWN CAR. THE TIRES ON THE CAR ARE MICHELIN ENERGY LX4  XSE RADIALS. THE DOT NUMBER IS M3XHDEH3X0208.  TREAD WEAR IS SHOWN AS 500. TIRE SIZE IS P225/60R17.      MY COMPLAINT IS THAT ALL 4 TIRES SHOW SIDEWALL CRACKING. THE CAR HAS 23,000 MILES ON IT. TREAD WEAR LOOKS TO BE ABOUT HALF OF NEW. THE SIDEWALL CRACKING IS EXTENSIVE, AND I BELIEVE EXTREMELY DANGEROUS, ESPECIALLY IN WEST CENTRAL FLORIDA, WHERE I LIVE, BECAUSE OF THE HIGH AMBIENT DAYTIME TEMPERATURES.    I HAVE GOOGLED THE TIRE 'MICHELIN ENERGY LX4' AND HAVE FOUND THAT THERE ARE MANY CONSUMER SAME MODEL MICHELIN TIRE COMPLAINTS FOR SIDE WALL CRACKING.  DEALERS REPRESENTING THE MICHELIN BRAND, UPON INSPECTING THE PROBLEMATIC TIRES HAVE DETERMINED THE PROBLEM DUE TO 'TIRE ROT.'  I BELIEVE WHOLEHEARTEDLY THAT THIS ISSUE DEMANDS IMMEDIATE INVESTIGATION, BEFORE SOMEONE GETS KILLED, DUE TO A SIDEWALL BLOWOUT.  *TR",
        "vin": "2LNHM82VX8X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/09/2010",
        "dateOfIncident": "08/21/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365088,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN TOWN CAR. THE CONTACT STATED THAT WHEN HE DEPRESSED THE BRAKE PEDAL AT A SLOW SPEED, THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT EXPERIENCED THE FAILURE AND REAR ENDED ANOTHER VEHICLE. THERE WERE NO INJURIES AND NO POLICE REPORT WAS FILED. THE CONTACT BELIEVED THAT THE BRAKE PEDAL AND THE ACCELERATOR PEDAL WERE TOO CLOSE WHICH MAY HAVE CAUSED THE FAILURE. THE CONTACT ALSO NOTICED THE SAME FAILURE WITH THE 2004 LINCOLN TOWNCAR HE PREVIOUSLY OWNED. THE  VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP BUT THE DEALER STATED THAT THEY COULD NOT FIND ANY PROBLEMS. THE CONTACT CALLED THE MANUFACTURER WHO ASSIGNED HIM A CASE NUMBER AND STATED THAT SOMEONE WOULD CONTACT HIM. THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT MILEAGE WAS APPROXIMATELY 8,300. THE FAILURE MILEAGE WAS APPROXIMATELY 6,500.    UPDATED 1/19/2010 *CN  THE CONSUMER WAS INFORMED THE PROBLEM COULD BE CORRECTED BY USING AN AFTERMARKET PEDAL. UPDATED 03/25/11",
        "vin": "2LNHM82V08X"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364637,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN TOWN CAR. CONSUMER STATES WHEN THE BRAKE PEDAL IS DEPRESSED, THE GAS PEDAL IS ALSO DEPRESSED *TGW  THE CONSUMER STATED INSTEAD OF STOPPING, HE HIT A STOP SIGN.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "07/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 LINCOLN TOWN CAR, PURCHASED ON 5/18/10 AT CORTESE LINCOLN, ROCHESTER NY.    6/1/10:  BEGAN EXPERIENCING TROUBLE STOPPING - INTERMITTENT  7/2/10:  TRIP FROM ROCHESTER, NY TO VERMILION, OH; TRAVELING I90 WEST, COULD NOT STOP THE CAR WHEN APPROACHING THE TOLL BOOTH IN BUFFALO, NY.  STOPPED AT THE LAST SECOND INCHES AWAY FROM THE CAR AHEAD.  PUSHED THE PEDAL TO THE FLOOR AND PUT THE CAR IN NEUTRAL.  I PULLED OVER AND CHECKED THE BRAKE FLUID; IT WAS FINE. ON ROUTE 2 WEST, STOPPED AT MCDONALDS.  THE SAME THING HAPPENED AS JUST DESCRIBED.  ARRIVED AT VERMILION AT 4 P.M., TOOK THE CAR TO LIBERTY FORD-LINCOLN.  THEY COULD NOT EXPLAIN PROBLEM.  RETURNED TO ROCHESTER, NY ON JULY 5, 2010 AND USED EMERGENCY FLASHERS THE ENTIRE WAY.  ARRIVED SAFELY HOME.  ON JULY 6, 2010, TOOK THE CAR TO CORTESE LINCOLN, ROCHESTER, NY FOR FURTHER EVALUATION.  THEY COULD NOT FIND ANYTHING.  I TOLD THEM TO CONTACT THE FORD LINCOLN TECH HOTLINE DEPARTMENT.  THEY DID.  RECOMMENDATION:  BLEED BRAKES AND TEST DRIVE.  CORTESE TECHNICIAN:  9021 WARREN R HALTER.  I AM AFRAID TO DRIVE THIS CAR.  *TR",
        "vin": "2LNHM82V88X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330094,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 LINCOLN TOWN CAR.  I WAS COMING UP TO AN INTERSECTION AT ABOUT 10 MPH TO MAKE A RIGHT TURN AND WHEN I STEPPED ON THE BRAKE THE ENGINE REALLY REVVED UP AND I HAD TO REALLY STOMP ON THE BRAKE (ALL THE WAY TO THE FLOORBOARD) TO STOP THE CAR.  THE ENGINE THEN SLOWED DOWN.  IF I HAD BEEN DOING 75 MPH ON THE INTERSTATE I WOULD NOT HAVE BEEN ABLE TO STOP. *TR",
        "vin": "2LNHM82V08X"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "06/29/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A SUDDEN UNINTENDED ACCELERATION OF OUR CAR.  WE WERE TRAVELING WEST ON THE NEW YORK STATE THRUWAY (I-90) TOWARDS NIAGARA FALLS.  AS WE EXITED INTO A REST AREA, SUDDENLY THE ENGINE RACED AS IF THE GAS PEDAL WERE FLOORED.  THE DRIVER PRESSED ON THE BRAKE VERY VERY HARD, AND THE CAR ALMOST STOPPED, MOVING FORWARD SLOWLY.  THE DRIVER THEN SHIFTED INTO NEUTRAL, AND THE ENGINE SLOWEDAND WE STOPPED--ABOUT 50 FEET BEYOND WHERE THE SUDDEN UNINTENDED ACCELERATION STARTED.  WE TURNED THE ENGINE OFF, AND EXAMINED THE FLOORMAT--IT WAS NOT IN A POSITION TO PRESS THE GAS PEDAL.  WE CHECKED UNDER THE HOOD, AND DID NOT FIND ANYTHING THAT SEEMED RELATED TO CAUSING THE SUDDEN UNINTENDED ACCELERATION.  WE LATER CHECKED IF THE DRIVER COULD PRESS THE GAS AND BRAKE PEDALS AT THE SAME TIME, BUT ON OUR CAR THEY ARE SO FAR APART THAT THIS IS NOT POSSIBLE.  WE THINK IT IS POSSIBLE THAT THIS OCCURRENCE WAS DUE TO INADEQUATE SHIELDING, AND INADEQUATE PROGRAMMING, OF THE GAS PEDAL COMPUTER WHICH SENDS SIGNALS TO THE ACCELERATION SYSTEM.  AT THE TIME OF THE INCIDENT, WE HAD A GPS, CELL PHONES, AND GAME MACHINES  IN OPERATION, AND THE REST AREA WE WERE PULLING INTO HAD WIFI.  THUS, THE ACCELERATION SYSTEM COMPUTER WAS RECEIVING MANY SIGNALS FROM \"NOISE.\"  IF THEY CAME IN A CERTAIN SEQUENCE, IT WOULD CAUSE AN SUA, UNLESS THE CAR HAD ADEQUATE CODING TO PREVENT THAT OCCURRENCE.  THE FIX FOR THIS WOULD BE TO EITHER HARD WIRE THE GAS PEDAL, OR TO PUT ADEQUATE PROGRAMMING TO PREVENT STRAY SIGNALS FROM BEING ACCEPTED.  WE WOULD LIKE TO SEE ONE OF THESE FIXES IMPLEMENTED. *TR",
        "vin": "2LNHM82W48X"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/29/2009",
        "dateOfIncident": "05/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10272364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 LINCOLN TOWN CAR.  THE DRIVER PLACED THE VEHICLE INTO PARK AND TURNED OFF THE IGNITION.  SHE EXTENDED HER LEGS OUT OF THE DOOR AND PREPARED TO EXIT THE VEHICLE WHEN IT SUDDENLY ROLLED BACKWARDS INTO THE STREET.  THE VEHICLE CRASHED INTO A PARKED VEHICLE.  THE FAILURE OCCURRED WITHOUT WARNING.  THE DRIVER SUSTAINED LEG INJURIES.  THE FRONT DRIVER'S SIDE DOOR WAS DAMAGED.  THE POLICE WAS CALLED TO THE SCENE.  THE VEHICLE WAS TOWED TO A BODY SHOP.  THE CAUSE OF THE FAILURE HAS NOT BEEN DETERMINED.  THE FAILURE AND CURRENT MILEAGES WERE 17,000.",
        "vin": "2LNHM82VX8X"
    }
]