[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451491,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving my car pulling out of driveway when power steering cut out and steering became very difficult   Had car brought to mechanic and he found there was a recall on steering torque sensor. Mazda said that was replaced on 8/10/2016 but the part they replaced it with failed just like the original recalled part did.  They refused to fix it again saying they completed the recall on this car.  Wouldn’t even have a next level supervisor call me to talk about fixing the safety issue",
        "vin": "4f2cz96198k"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/05/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443278,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "It just hard and cant really drive it",
        "vin": "4f2cz02z38k"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422956,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Mazda Tribute. The contact stated that while driving at 70 mph, the power steering failed which caused the steering wheel to shake. The vehicle became difficult to steer. The vehicle was taken to the dealer and diagnosed that the steering shaft torque sensor malfunctioned, there was an open or short in the power steering control module, and an internal failure with the torque sensor. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure but informed the contact that there was a recall repair for the electronic power steering performed in 2014, and that was a one-time recall repair. The failure mileage was 167,968.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406329,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLDER FLORIDA WEATHER, FREEZING ISN'T REQUIRED, UPON START UP AND DRIVING FOR SEVERAL MINUTES BEFORE EVERYTHING IS WARMED UP THE ACCELERATOR PEDAL WILL STICK AND BE VERY HARD TO PUSH DOWN. WHEN IT DOES BREAK FREE IT CAN BE SUDDEN WHICH RESULTS IN EXCESSIVE ACCELERATION FOR A MOMENT. THERE IS NO PEDAL OBSTRUCTION, SUCH AS A FLOOR MAT. THIS HAPPENS WHEN COOLER WEATHER, STATIONARY OR IN MOTION ON STREET, HIGHWAY ETC UNTIL IT WARMS UP. NOT LONG AFTER BUYING THIS USED CAR, THE ACCELERATOR PEDAL CABLE BROKE WHILE DRIVING. HAD TO HAVE IT TOWED TO DEALER FOR A NEW CABLE. THEY SAID THEY HAD NEVER SEEN THIS HAPPEN.  THIS STICKING PEDAL HAS BEEN GOING ON FOR A LONG TIME. MY DAUGHTER DRIVES THIS CAR SO I WAS UNAWARE OF THE ISSUE UNTIL TODAY WHEN I WENT TO FILL IT UP WITH GAS. I'M A GROWN MAN AND I HAD TO PUSH DOWN VERY HARD TO GET IT TO MOVE.",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398710,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING BECAME UNUSEABLE COULD NOT CONTROL AUTO  WAS IN MOTION ON CITY STREET HAD IT TOWED TO TWO SERVICE CENTER COULD NOT FIX. ; MAVIS TIRE & REPAIR, LACKAWANNA, NY AND LUKES ENTERPRISE SOUTHWESTERN BLVD ORCHARD PARK,NY",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396225,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I AM DRIVING THE ABS AND TRACTION CONTROL LIGHTS COME ON AND THE CAR WILL START KICKING LIKE SOMETHING IS TRYING TO IN GAGE ITSELF THIS HAS CAUSED THE TRANSMISSION TO GO OUT SO I HAVE HAD IT REBUILT THINKING MAYBE THE TRANSMISSION WAS BAD I HAVE THE CAR BACK NOW AND THE CAR IS DOING THE SAME THING AS IT WAS DOING BEFORE TRANSITION WENT OUT  IT HAS DONE IT ALMOST EVERY TIME I DRIVE IT DRY PAVEMENT CITY AND OR COUNTRY ROADS WORRIED TO DRIVE IT NOW DON'T WANT TO HAVE TO REPLACE TRANSMISSION AGAIN OVER 3000 DOLLARS TO REPAIR ANY SUGGESTIONS WOULD BE GREATLY APPRECIATED",
        "vin": "4F2CZ96178K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395483,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL RANDOMLY LOCKS WHILE DRIVING AND SOMETIMES IN THE MIDDLE OF A TURN. DEALERSHIP SAYS THAT RECALL IS CLOSED.",
        "vin": "4F2CZ96138K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/03/2021",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386250,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE, ALL SCHEDULED MAINTENANCE DONE ON TIME.  AT 118,110 MILES TRANSMISSION WENT OUT WITHIN A DAY NO WARNING.  THE TRIBUTE, JUST STARTED LOSING POWER ON MY WAY HOME, THEN IN MY DRIVEWAY WOULD GO INTO ANY OF THE AUTOMATIC GEARS.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/18/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375310,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WHEEL STARTED VIBRATING BACK AND FORTH WHILE IN PARK AND I STARTED AND THE POWER STEERING WORKED FINE. THEN TURNED CAR OFF WENT IN THE STORE AND CAME OUT AND IT DIDN'T WANNA WORK. TURNED CAR OFF AND BACK ON IT WORKED FINE. ON THE WAY HOME COMING AROUND A SHARP CURVE IT DECIDED TO GO OUT AND THE WHEEL TIGHTENED AT 45. I HAD TO SLAM ON MY BRAKES AND TRY MY HARDEST TO KEEP FROM GOING OFF THE ROAD. TOOK IT TO THE MECHANIC AND HE SAID IT'S A RECALL TO TAKE IT TO THE DEALERSHIP. WELL IN 2014 A MONTH AFTER THE RECALL WE TOOK THE CAR TO THE DEALER FOR AIR FILTERS AND THEY HAPPENED TO \"FIX\" THE SOLUTION WHILE THERE WITHOUT NOTIFYING US. THEY NEVER FIXED IT BECAUSE THERE WAS NEVER AN ISSUE UNTIL NOW. AND THEY WONT FIX IT BECAUSE THEY SAID THAT IT WAS ALREADY REPAIRED. IN FACT IT WASN'T. THE ELECTRIC POWER STEERING SYSTEM IS VERY DANGEROUS AND I PRAY THAT MAZDA CONTACTS DEALERSHIPS AND HAS THEM ACTUALLY REPLACE THE COLUMN AS NEEDED AND NOT JUST CLEAR CODES. IT DOES NOTHING BUT RESET IT FOR IT TO HAPPEN AT A LATER DATE. I ALMOST RAN OFF THE ROAD!",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372819,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWE STEERING HAS WENT OUT & I CAN HARDLY TURN THE STEERING WHEEL AFTER I STOPPED IT & TRIED TO GO AGAIN",
        "vin": "4F2CZ02Z58K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362976,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH TURNS ACCESSORIES ON, BUT WILL NOT EASILY START THE ENGINE WHEN TURNED TO THE START POSITION. IT TAKES SEVERAL REPETITIONS OF WIGGLING AND PUSHING THE KEY IN WHEN TURNING IT TO THE START POSITION UNTIL THE CAR RESPONDS TO THE KEY START POSITION. THIS SEEMS TO BE A SAFETY ISSUE SINCE IT IS VERY DIFFICULT TO GET THE KEY SWITCH TO START THE ENGINE, SPECIALLY WHEN THE CAR IS A STICK SHIFT MANUAL TRANSMISSION WHERE IT IS POSSIBLE THAT THE ENGINE SHUTS OFF IN THE MIDDLE OF THE STREET OR INTERSECTION DUE TO INEXPERIENCED DRIVER, AND IF THIS HAPPENS, STARTING THE CAR AGAIN IS A CHALLENGE WHEN THE KEY DOESN'T EASILY START THE CAR IGNITION.",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363064,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR TO THE STORE AS I TURNED A CORNER A BEEP WENT OFF I LOOKED ON MY DASHBOARD AND SAW THE WRENCH LIGHT ON A FEW MINUTES LATER THE BEEP WENT OFF AGAIN I FELT A TIGHTNESS IN THE STEERING I DROVE APPROX 4 MORE MILES TO THE PARKING LOT REVIEWED BOOK NOTICED IT SAID IT WAS A POWER TRAIN ISSUE. I WENT IN STORE GOT MY GROCERIES CAME OUT UPON STARTING CAR IT SEEMED AS IF IT DID NOT WANT TO STEER AT ALL. AFTER A FEW DAYS LEAVING IT THERE WE GOT IT TO THE SHOP THEY SAID ITS A DEALER ISSUE WE RESEARCHED THE PROBLEM CALLED DEALER THEY STATE THE EPAS SYSTEM WAS REPLACED UNDER RECALL IN 2016 WHEN WE TOOK IT IN FOR AN IGNITION KEY PROBLEM THAT WE PAID CLOSE TO 500 FOR I DID FIND THE RECEIPT AND YES IT WAS REPLACED THEN HOWEVER WE HAD NO PROBLEMS WITH IT IT WAS THE IGNITION SWITCH WE TOOK IT IN FOR. THE DEALER STATES THEY   CANT REPLACE AGAIN FOR FREE THEY WILL EXAMINE CAR FOR 130.00 IF WE CAN GET IT TO THEM 38 MILES AWAY. THIS IS THE DEALER WE PURCHASED IT FROM BRAND NEW IT EVEN HAD TO HAVE A REPLACED TRANSMISSION AT OUR COST WHEN THE CAR WAS ONLY ABOUT 7 YEARS OLD.  WE MAINTAIN THE VEHICLE AND I WONDER IF THIS REPLACED EPAS. ALTHOUGH THE RECEIPTS DOESNT ACTUALLY SAY REPLACED NOW THAT I READ IT IT SAYS IT WAS UPDATED TO THE LATEST CALIBRATION AND CODES WERE CLEARED ACCORDING TO RECALL 7614E. NOW I AM HEARING IT MAY BE 1500 TO 2000 TO REPAIR ???????    BAD TIMING FOR ME TO NEED ANOTHER CAR. THIS CAR HAS HAD A LOT OF PROBLEMS I WONDER NOW AFTER RESEARCH IF THE TRANSMISSION WAS A RECALL AS WELL",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362494,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE #1 - LEFT FRONT CALIPER LOCKS UP PREVENTING VEHICLE TO MOVE. ON MULTIPLE OCCASIONS THE LEFT FRONT BRAKE CALIPER HAS LOCKED UP AFTER THE VEHICLE HAD BEEN TRAVELING AT SEVERAL DIFFERENT SPEEDS AND COMING TO EITHER A COMPLETE OR SUDDEN STOP AFTER HARD BRAKING. THE ISSUE MAKES IT EXTREMELY DIFFICULT TO DRIVE THE VEHICLE WHICH CAUSES THE BRAKE PADS TO OVERHEAT AND SMOKE. I'VE REPLACED THE CALIPER 3 TIMES AND HAVE HAD THE SAME ISSUE WITH EACH NEW CALIPER. THE UNDERLYING CAUSE FOR THE BRAKE LOCK UP HAS BEEN A MALFUNCTION IN THE ABS AND TRACTION CONTROL UNIT AND SENSORS. TEMPORARY REMEDY HAS BEEN TO REMOVE THE 50AMP ABS FUSE FOR 24 HOURS AND REPLACE. SYSTEM WORKS LIKE IT IS DESIGNED TO DO AFTERWARDS.    ISSUE #2 - POWER ASSISTED STEERING. THE VEHICLE HAD SHOWN SYSTEMS OF A VIBRATING AND TWITCHING STEERING WHEEL WHILE AT IDLE IN PARK AND WHILE IN GEAR WHILE SITTING AT A STOP. AFTER 2 DAYS OF THE MOVING STEERING WHEEL THE VEHICLE WAS TURNED OFF AND THEN RESTARTED 5 HOURS LATER WITH NO MORE JUMPING STEERING WHEEL BUT NOW WITH NO POWER ASSISTED STEERING AT ALL. MAKING IT EXTREMELY DIFFICULT TO STEER WHILE UNDER NO TO VERY LOW SPEED. THE VEHICLE CONTINUES TO HAVE NO POWER ASSISTED STEERING AS THERE IS NO CONSISTENT RESOURCE ON WHAT TO DO FOR THOSE VEHICLES THAT HAVE ALREADY BEEN THROUGH THE RECALL FOR THIS ISSUE.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330199,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT AT VEHICLE START-UP, THE POWER STEERING FAILED TO OPERATE AS DESIGNED, WITH THE SERVICE INDICATOR WARNING LIGHT ILLUMINATED. THE CONTACT ADDED POWER STEERING FLUID TO THE RESERVOIR HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. THE CONTACT LINKED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310716,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING AROUND FOR ABOUT AN HOUR, I STOPPED AT A STORE AND AFTER THAT THE VEHICLE WOULDN'T EXCEL CORRECTLY.   VEHICLE WOULDN'T SHIFT INTO 2ND OR 4TH GEARS. SHOP SAID IT WAS A 2/4 BELT OR SOMETHING LIKE THAT WHICH HAD TO BE REPLACED. THEY HAD CALLED MAZDA TO DETERMINE WHICH TRANSMISSION MY VEHICLE HAD, THANKFULLY IT WAS THE ONE THAT COULD BE REPLACED WITHOUT TEARING DOWN THE WHOLE TRANSMISSION. SOUNDS LIKE THIS WAS A COMMON ISSUE FOR THIS TRANSMISSION.",
        "vin": "4F2CZ92Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309822,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING AT AN UNDISCLOSED SPEED, THE STEERING CEASED WITHOUT WARNING. THE DRIVER WAS ABLE TO DRIVE THE VEHICLE TO AN INDEPENDENT MECHANIC TO HAVE THE VEHICLE DIAGNOSED. THE DRIVER WAS INFORMED THAT THE TORQUE SENSOR KIT, UPPER STEERING COLUMN BOT, AND STEERING COLUMN ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. NELSON MAZDA COOL SPRINGS LOCATED AT 7104 S. SPRINGS DR, FRANKLIN, TN 37067, WAS CONTACTED AND INFORMED OF THE FAILURE. THE DRIVER WAS THEN REFERRED TO THE MANUFACTURER FOR ASSISTANCE. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE DRIVER WAS INFORMED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) AND THAT A SECOND REPAIR WOULD NOT BE OFFERED. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308519,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT AT START UP, THE POWER STEERING WAS INOPERABLE. THE CONTACT STATED THAT IT WAS DIFFICULT TO MANEUVER THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) HOWEVER, THE FAILURE RECURRED. AN UNKNOWN DEALER AND THE MANUFACTURER WERE MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 145,000.",
        "vin": "4F2CZ061X8K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307511,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN CAR TO DRIVE MONDAY 02/03/2020 MORNING, CAR WAS EXTREMELY HARD TO TURN. ABLE TO DRIVE VEHICLE BUT TURNING IS EXTREMELY HARD. TOOK IT TO MECHANIC AND THEN TO AUTOZONE TO PRICE PART AND WAS TOLD THIS VEHICLE WAS PART OF A RECALL. I CALLED MAZDA AND WAS TOLD RECALL WAS NO LONGER OPEN, WAS CLOSED IN 2014. THE RECALL IS WHAT IS WRONG WITH MY VEHICLE. I HAVE CALLED MAZDA WITH NO RESOLUTION, IS THERE ANY WAY TO MAKE THEM RESPONSIBLE FOR THIS ISSUE, SINCE THERE WAS A RECALL FOR IT, MINE JUST DID NOT HAVE ISSUE IN THAT TIME FRAME.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301431,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) HOWEVER, THE FAILURE STATED IN THE RECALL WAS EXPERIENCED. THE VEHICLE WAS REPAIRED AT MURRAY MAZDA LOCATED AT 85 GRIFFITH RD, MUNCY, PA 17756, (570) 546-2222. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 163,611.",
        "vin": "4F2CZ92Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300881,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUES WITH ELECTRIC POWER STEERING. ATTEMPTED TO EXIT GAS STATION AND STEERING WHEEL WOULD NOT TURN. BOUGHT SUV USED, RECALL ISSUE WAS FIXED SEPTEMBER 2014. RECALL IS NOW CLOSED.",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289707,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING, THE STEERING WHEEL SHOOK AND BECAME DIFFICULT TO STEER. THE CONTACT STATED THAT THERE WAS ALSO NO POWER STEERING ABILITY AND THE WRENCH WARNING ICON ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED PER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING); HOWEVER, THE REPAIR DID NOT CORRECT THE FAILURE. THE FAILURE RECURRED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO LAIRD NOLLER MAZDA TOPEKA (2946 S KANSAS AVE, TOPEKA, KS 66611, (888) 312-2714) WHERE IT WAS DIAGNOSED THAT AN ELECTRONIC PART IN THE STEERING COLUMN FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT IT COULD NOT BE THE SAME FAILURE BECAUSE IT WAS PREVIOUSLY REPAIRED. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 190,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280022,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHEN THE VEHICLE WAS STARTED, THE WRENCH ICON ILLUMINATED AND THE POWER STEERING FAILED TO OPERATE. THE CONTACT TOOK THE VEHICLE TO PAUL MILLER MAZDA (1029 E NEW CIRCLE RD, LEXINGTON, KY 40505, (800) 528-1710) WHERE IT WAS DETERMINED THAT THE TORQUE SENSOR NEEDED TO BE REPLACED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 156,745.",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256028,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKS AND HAS TO BE KNOCKED LOOSE. HAPPENS WHILE VEHICLE IS IN MOTION.",
        "vin": "4F2CZ92Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221750,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE RECALL FOR ELECTRIC POWER STEERING ASSIST MODULE FAILURE.  VEHICLE TAKEN TO DEALERSHIP AND ISSUE REORTEDLY CORRECTED BY DEALERSHIP.  AT LEAST 2 INSTANCES HAVE SINCE OCCURRED IN WHICH THE STEERING ASSIST FAILED.  ONE INCIDENT NEARLY RESULTED IN AN ACCIDENT. WHILE ATTEMPTING TO TURN IN AN INTERSECTION, THE STEERING BECAME UNMANAGEABLE, RESULTING IN A NEAR COLLISION WITH A STONE WALL.  THE DEALER AND MAZDA CORPORATE WERE BOTH CONTACTED. THE DEALER ADVISED THAT AT THE LEAST THERE WOULD BE A $150 CHARGE FOR DIAGNOSTICS. MAZDA CUSTOMER SERVICE ADVISED THAT THEY WOULD NOT ADDRESS THE ISSUE AS THE RECALL HAD BEEN ADDRESSED AND CLOSED FOR MY VEHICLE.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182818,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY TO EAT OUT WITH MY WIFE. AND WHEN I WAS DRIVING MY STEERING WHEEL STARTEDAND SHAKING THEN A LIGHT APPEARED ON MY DASHBOARD A WRENCH LIT UP  INDICATING THAT I NEEDED TO FIX SOMETHING SO AS I WENT AND PARKED IN THE PARKING LOT OF A QUALITY DAIRY AND WHEN I WENT TO START THE VEHICLE BACKUP I HAD NO POWER STEERING. AND SO I TOOK IT TO MY MECHANIC AND HE RAN SOME DIAGNOSTICS AND TOLD ME THAT THE ELECTRONIC STEERING WENT OUT AND THAT THERE WAS A RECALL ON IT AND TOLD ME TO TAKE IT TO A DEALERSHIP SO I DID THAT AND THEN THE DEALERSHIP TOLD ME THAT THIS PART HAS ALREADY BEEN REPLACED SO IF THIS IS A RECALLED PART THAT HAS TO DO WITH SAFETY THEN WHY IS IT FAILING AGAIN AND WHY AM I HAVING TO PAY FOR IT OUT OF MY POCKET $1,200  THIS MAKES NO SENSE IF IT'S A SAFETY RECALL BECAUSE OF THE DEFAULT IN THIS PART THEN WHY IS IT FAILING AGAIN?",
        "vin": "4F2CZ96168K"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182140,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 TRIBUTE HAS HAD 3 TRANSMISSIONS REPLACED BEFORE THE 4TH WAS A BRAND NEW TRANSMISSION THAT WAS PUT IN. LAST NIGHT MY TRIBUTE WAS IN PARK AND KEYS OUT OF THE IGNITION AND IT ROLLED DOWN MY DRIVEWAY OUT IN TO THE MIDDLE OF THE ROAD. MY HUSBAND WAS ABLE TO GET OUT OF THE WAY BEFORE IT RAN OVER HIM. HE PULLED IT BACK IN THE DRIVEWAY AND SET THE PARKING BRAKE. IT ROLLED DOWN THE DRIVEWAY AGAIN. THIS DEATH TRAP OF A VEHICLE IS LISTED IN ONE OF THE RECALLS ON THE SHIFT LINKAGE. MY TRANSMISSIONS WERE REPLACED IN KILLEEN, TEXAS IN 2012. THE 3RD REBUILT TRANSMISSION WAS INSTALLED AND PULLED RIGHT BACK OUT. THAT'S HOW THE DEALERSHIP WAS ABLE TO REPLACE IT WITH A BRAND NEW ONE. LAST NIGHT MY HUSBAND PULLED IN FORWARD INTO ARE DRIVEWAY AND PUT THE SUV IN PARK, TURNED IT OFF, AND GOT OUT OF THE SUV AND WENT TO GET A CEILING FAN BOX OUT OF THE BACK AND HE FELT THE SUV ROLLING BACK ON HIM. HE THANKFULLY WAS ABLE TO MOVE TO THE SIDE AS IT ROLLED BACK OUT OF OUR DRIVEWAY TO THE MIDDLE OF OUR STREET. HE GOT THE KEYS FROM ME AND DROVE IT BACK INTO OUR DRIVEWAY AND SET THE PARKING BREAK. WE WALKED OUT FRONT THIS MORNING AND IT ROLLED BACK DOWN TO THE BOTTOM OF OUR DRIVEWAY. HE PUT CHALK BLOCKS BEHIND THE TIRES AND SET THE PARK BACK BRAKE AGAIN. MY HUSBAND IS AN ACTIVE DUTY SOLDIER. WE BOUGHT THE SUV WHILE WE WERE STATIONED AT FT. HOOD AND NOW WE ARE STATIONED AT FT. CARSON IN COLORADO SPRINGS, COLORADO. I'M LEAVING HIS CONTACT INFORMATION FOR YOU. I WILL ALSO INCLUDE MY RING DOORBELL VIDEO FROM LAST NIGHT.    THANK YOU,  [XXX] MY HUSBAND [XXX]  MY EMAIL ([XX] HUSBAND'S EMAIL [XXX].   LINK FROM RING DOORBELL : [XXX]    VIN # [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *CC *TR",
        "vin": "4F2CZ02Z28K"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181117,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VIOLENTLY JERKS & VIBRATES WHILE DRIVING AND IN IDLE.  STEERING COLUMN / WHEEL MAKES A GRINDING NOISE WHEN IT JERKS & VIBRATES.  ACCELERATOR PEDAL STICKS, ESPECIALLY IN COLDER WEATHER, MAKING IT HARD TO CONTROL VEHICLE...IE ACCELERATING TO GET ONTO A HIGHWAY OR EVEN COMING OUT OF A SIDE STREET ONTO A MAIN ROAD.  RECALL FOR ELECTRIC POWER ASSIST SYSTEM WAS \"FIXED\" BY MAZDA IN 2018, BUT I FEEL A MAJOR PROBLEM STILL EXISTS.  THIS IS A DANGEROUS MIX FOR DRIVING SAFELY.  I AM FEARFUL OF DRIVING THIS VEHICLE DUE TO THE FACT THAT I CANNOT ACCELERATE PROPERLY OR HOLD ONTO MY WHEEL WITHOUT IT JERKING.",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174826,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE ELECTRIC POWER STEERING FAILED, WHICH CAUSED THE STEERING WHEEL TO SEIZE WHEN TURNED TO THE LEFT. ALSO, THE ELECTRIC POWER STEERING WARNING INDICATOR RANDOMLY FLASHED. THE CONTACT HAD TO CONSTANTLY MANEUVER AND ADJUST THE STEERING WHEEL IN THE PROPER DIRECTION DUE TO THE FAILURE. TASCA FORD MAZDA SEEKONK (200 FALL RIVER AVE, SEEKONK, MA 02771, (800) 737-0435) INDICATED THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING), BUT THE VIN WAS NOT INCLUDED. THE DEALER CLEARED THREE FAILURE CODES, BUT DID NOT DIAGNOSE OR REPAIR THE VEHICLE. THE VEHICLE WAS CURRENTLY AT THE DEALER AWAITING THE MANUFACTURER TO DETERMINE THE GUIDELINES TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED AND ISSUED 12 TSBS FOR THE STEERING. THE MANUFACTURER CLOSED THE CASE AND DID NOT ASSIST. THE MANUFACTURER EXPECTED THE VEHICLE OWNER TO HAVE THE DEALER REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "4F2CZ96128K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157306,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "4F2CZ92Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129649,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED. HAD THE DEALER FIX THE ISSUE BASED ON THE EXISTING RECALL FOR THE VEHICLE. AFTER REPLACING, STEERING PULLED TO THE RIGHT. THIS HAPPENS BOTH WHEN THE VEHICLE IS SITTING STILL AND IN MOTION. PROBLEM WAS TOLERABLE, BUT GOT PROGRESSIVELY WORSE OVER THE NEXT SEVERAL MONTHS. FINALLY TOOK IT BACK TO THEM AND THEY SAY THE WHOLE STEERING COLUMN NEEDS TO BE REPLACED AT A COST OF ~$1600. THEY CANNOT DO THE WORK UNDER THE RECALL AS IT HAD ALREADY BEEN DONE ONCE FOR THE CAR. ISSUE IS A DEFECT, NOT SOMETHING CAUSED BY WEAR.",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111905,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL SHOOK INTERMITTENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO NELSON MAZDA TULSA (9902 S MEMORIAL DR., TULSA, OK 74133, (918) 296-7897) WHERE IT WAS DIAGNOSED THAT THE POWER STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS SERVICED PREVIOUSLY BY NELSON MAZDA TULSA PER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 185,000.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102445,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 45 MPH, A LOUD BANGING SOUND WAS HEARD FROM THE FRONT END OF THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROADWAY AND TURNED OFF. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC AND IT WAS DIAGNOSED THAT A PISTON SHOT THROUGH THE BACK OF THE ENGINE. THE ENGINE WAS REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 118,000. *TT",
        "vin": "4F2CZ92Z88K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097275,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. IN ORDER TO START THE VEHICLE, THE KEY NEEDED TO BE VIGOROUSLY PRESSED AND TURNED IN THE IGNITION. THE CONTACT CALLED AN UNKNOWN LOCAL DEALER AND WAS ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT BACK TO THE DEALER FOR DIAGNOSTIC TESTING. THE FAILURE MILEAGE WAS 146,000.",
        "vin": "4F2CZ06118K"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096671,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE TO GAS PEDAL BROKEN -- CANNOT BE DRIVEN.",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078675,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING, THE STEERING WHEEL BECAME DIFFICULT TO TURN AND THE POWER STEERING ASSIST FAILED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED PER NHTSA CAMPAIGN NUMBER: 142820000 (STEERING). THE CONTACT TOOK THE VEHICLE TO DAVIS GAINESVILLE CHEVROLET (2600 N MAIN ST, GAINESVILLE, FL 32609) WHERE IT WAS DIAGNOSED THAT THE POWER STEERING ASSIST AND TORQUE SENSOR FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE CONTACT WOULD HAVE TO PAY FOR THE REPAIRS SINCE THE RECALL WAS ALREADY REMEDIED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062652,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DEC 29, 2017 DRIVING MY 2008 MAZDA TRIBUTE THE STEERING WHEEL BEGAN SHAKING AND VIBRATING UNCONTROLLABLY WHILE DRIVING 70 MPH ON THE INTERSTATE. I BECAME EXTREMELY NERVOUS AND AFRAID OF BEING STRANDED OR EVEN WORSE WRECKING. LUCKILY, I WENT STRAIGHT TO A LOCAL MECHANIC AND WHEN HE STARTED IT UP THE STEERING WHEEL HAD COMPLETELY LOCKED UP AND THE ERROR 'POWER STEERING ASSIST FAULT' WAS DISPLAYED ON THE DASHBOARD. THIS WAS THE FIRST TIME IT HAD EVER HAPPENED AND AFTER RUNNING THE DIAGNOSTIC TEST THE CODE B2278 INDICATED THAT THERE HAD BEEN A RECALL NHSTA # 14V282000 IN 2014 CAUSING THE LOSS OF POWER STEERING. THE MECHANIC CONTACTED THE LOCAL MAZDA DEALERSHIP TO CONFIRM IF THE RECALL HAD BEEN DONE. THE RECALL WAS ON THE STEERING TORQUE SENSOR WHICH AFFECTS THE ABILITY TO PROPERLY DETECT THE DRIVER STEERING INPUT. THE MAZDA DEALERSHIP CONFIRMED THAT THE RECALL WAS COMPLETED IN 2014 AND MAZDA WAS NOT GOING TO REPLACE THE SENSOR AGAIN. I DECIDED TO DRIVE TO THE DEALERSHIP WHICH WAS ANOTHER 30 MINUTES AWAY, BUT NOW THE STEERING WHEEL WAS LOCKING UP AND EXTREMELY DIFFICULT TO TURN THE WHEEL. SO AFTER THEY INSPECTED THE TRIBUTE I WAS TOLD THAT IT NEEDED THE TORQUE SENSOR REPLACED AND IT WOULD COST ME $877 AND IF THAT DIDN'T FIX IT THEN THEY WOULD HAVE TO REPLACE THE WHOLE PART. SO THE TORQUE SENSOR DID NOT FIX THE ISSUE AND THE DEALERSHIP SAID THE STEERING WHEEL IS SHAKING EVEN MORE UNCONTROLLABLY. NOW I HAVE ANOTHER $1500 I HAVE TO PAY AND TOTALING $2400. AFTER RESEARCHING THIS PARTICULAR SITUATION THERE ARE NUMEROUS COMPLAINTS OVER THE EXACT SAME PROBLEM, THEREFORE THIS SHOULD BE HONORED UNDER A RECALL. IN ADDITION THE PART THAT'S NEEDED IS ON BACK ORDER AND MY VEHICLE WON'T BE READY UNTIL THE FIRST WEEK OF FEBRUARY.",
        "vin": "4F2CZ49H78K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/12/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045862,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES STARTED TO GO DOWN TO THE FLOOR INTERMITTENTLY.  THEY WILL GET HARD AND THE NEXT DAY OR TWO WILL GO BACK DOWN TO THE FLOOR.    THE MASTER CYLINDER HAS BEEN CHANGED, THE BRAKES HAVE BEEN BLED.  THE ROTORS ARE IN GOOD CONDITION AND HAVE BEEN TURNED AND NEW BRAKES WERE PUT ON THE CAR.  THE BRAKES STILL GO DOWN TO THE FLOOR.  I THINK THIS IS AN ONGOING PROBLEM WITH THIS MODEL OF CAR AND IT NEEDS TO BE ADDED AS A RECALL.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042910,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. UPON STARTING THE VEHICLE, THE STEERING WHEEL WAS DIFFICULT TO TO TURN AND THE POWER STEERING FAILED WITHOUT WARNING. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE  MANUFACTURER WAS NOTIFIED OF THE ISSUE AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE FAILURE MILEAGE WAS 161,000.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040907,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS SERVICED IN 2016 AS PART OF NHTSA RECALL #14V282000, BUT THE PCSM SOFTWARE WAS ONLY UPDATED. NO PARTS WERE REPLACED.THE FIRST TIME I NOTICED THE ISSUE AGAIN WAS OCTOBER 2017. I WAS STOPPED AT A STOPLIGHT, THE VEHICLE WAS AT AN IDLE, AND THE STEERING WHEEL BEGAN TO JERK BACK AND FORTH. THE STEERING WHEEL CONTINUES TO JERK VIOLENTLY WHEN THE VEHICLE IS AT AN IDLE. IT TAKES GREAT EFFORT TO KEEP THE VEHICLE STRAIGHT WHILE DRIVING 25-40 MPH ON CITY STREETS. IT ALSO JERKS MILDLY TO MODERATELY WHILE I AM DRIVING AT VARIOUS SPEEDS FROM 25MPH ON CITY STREETS-75MPH ON THE HIGHWAY OR FREEWAY. IT JERKS MOST VIOLENTLY WHEN IT IS AT AN IDLE, MODERATELY AT 25-45 MPH, AND MILDLY AT 50-75 MPH. IT JERKS WHEN I AM DRIVING STRAIGHT. WHEN THE VEHICLE IS IN PARK, IT JERKS VIOLENTLY, BUT WHEN THE WHEEL IS TURNED TO ABOUT THE 2 O'CLOCK POSITION IT WILL STOP UNLESS IT IS MOVED SLIGHTLY AND THEN IT WILL START JERKING AGAIN. THE VEHICLE WAS SERVICED IN 2016 AS PART OF NHTSA RECALL #14V282000, BUT THE PCSM SOFTWARE WAS ONLY UPDATED. NO PARTS WERE REPLACED AT THAT TIME. THE PART AT FAULT IS A FAULTY STEERING TORQUE SENSOR.",
        "vin": "4F2CZ96138K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032995,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE & SUDDEN LOSS OF STEERING CAPABILITY",
        "vin": "4F2CZ06188K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031437,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLOM IGNITION SWITCH. THE VEHICLE FELLS TO CRANK. THE LOCK ATTACHES AROUND THE STEERING COLOM IN WHICH THE IGNITION SWITCH GOES IN TO. THIS IS THE 3RD REPLACEMENT OF FACTORY OEM PARTS AND IT CONTINUES TO GO BAD. THE VEHICLE IS STATIONARY WHEN",
        "vin": "4F2CZ02Z58K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014021,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING OFF A ROAD INTO A PARKING LOT I LOST ALL POWER STEERING AND HAD TO MAN HANDLE THE TRIBUTE INTO A PARKING SPACE. ONCE THERE I TURNED OFF THE ENGINE AND AFTER A COUPLE OF MINUTES RESTARTED AND THE STEERING WORKED FINE. I'M CONCERNED AS TO WHEN IT WILL HAPPEN AGAIN. THIS IS THE FIRST TIME THIS HAS HAPPENED.",
        "vin": "4F2CZ96198K"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012892,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M DRIVING DOWN THE ROAD AND WHEN TRYING TO RIDE IN 5TH GEAR SINCE ITS A MANUAL TRANSMISSION IT KEEPS POPPING OUT OF 5TH GEAR EVERY TIME I'M DRIVING DOWN HIGHWAY NO MATTER WHAT I'M DOING I GO TO PUT IN 5TH GEAR AND IT POPS BACK OUT EVERY TIME UNLESS I HOLD THE GEAR SHIFT IN PLACE....I JUST HAD BOUGHT THIS VEHICLE T SWARTZ AUTO SALES IN HARRISONBURG VA AND I BROUGHT IT TO THEIR ATTENTION FOR WHICH THEY'RE NOT WANTING TO HELP ON THIS ISSUE EVEN THOUGH I HAVE JUST GOTTEN IT LITERALLY LAST WEEK N ONLY HAVE PUT MAYBE 250 MILES AND NOT ONLY THAT THE FIRST DAY I BOUGHT IT BROUGHT IT UP HOME WASHED IT UP I THEN REALIZED THAT THE TIRES ARE DRY ROTTED WHICH I HAVE ATTACHED PICTURES IT HAS AN INSPECTION STICKER STATING ITS GOOD TIL MARCH 18 NOT SURE HOW THESE TIRES EVEN PASSED INSPECTION I TOOK TO MY REGULAR MECHANIC AND HE ADVISED ME THAT THEY SHOULDN'T HAVE BEEN PASSED. AND WHILE TAKING OFF IN 1ST GEAR ITS A RATTLING OR MORE LIKE A SQUEEKING TO IT? COULD YOU PLEASE LET ME KNOW WHAT I CAN DO ABOUT THESE ISSUES AND ALSO MAYBE THE TRANSMISSION IS NO GOOD? IT DOES HAVE A RECALL ON IT WHICH I WILL ATTACH THAT AS WELL THANK YOU",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006088,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION SWITCH NOT WORKING. TRANSMISSION 2ND AND 5TH GEAR NOT WORKING AND CONTROL ARMS FOR ALL 4 WHEELS SEEM TO BE GOING BAD",
        "vin": "4F2CZ96118K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992984,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT LOOSES POWER AND WON'T CHANGE INTO GEAR. THE TROTTLE CONTROL LIGHT COMES ON.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979987,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I TURN MY STEERING WHEEL LEFT I HEAR A LOUD CLICKING NOISE.",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970935,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BACK IN 2016 JUST BEFORE CHRISTMAS AROUND DEC 14,2016 MY POWER STEERING IN THE TRIBUTE WENT COMPLETELY OUT!!! MAZDA TRIBUTE 2008 I RECEIVED A RECALL CARD IN THE MAIL STATING THAT I SHOULD BRING THE DEFECTIVE CAR IN I DID WHICH WAS AUGUST 2016, AS OF TODAY THEY CLAIM THE DEALERSHIP CLAIM THAT MY ISSUE WAS LOOKED AT REPROGRAMMED ALL SENSORS WERE CHECKED PERTAINING TO THIS ISSUE CONCERNING MY ELECTRICAL SENSOR. THE TECH ADVISOR SAID THEY PERFORMED THE RECALL SPECIFIED IN CARD LETTER, THE SIGNALING OF THE TORQUE SENSOR WAS POORLY MISFIRING TO THE ASSIST. WELL UNKNOWN TO MY KNOWLEDGE THEY DID NO SUCH THING!!! THERE IS A SERIOUS RECALL CONCERNING THIS ISSUE 'I'VE GONE BACK IN SPOKEN WITH TECH MANAGERS AND GOT CHARGED 65.00 FOR DIAGNOSTIC TESTING FOR A POWER STEERING FAULTY SENSOR NOT FIRING TO THE PSCM DUE TO THE FACT CLAIMED THEY FIXED THE PROBLEM WHY HAVE MY POWER STEERING GONE COMPLETELY OUT 3-4 MONTHS LATER?? IF THEY PERFORMED THE ELECTRICAL MODULE SENSORY PROGRAMMING AT FIRST NOT FEELING THIS AT ALL VERY DISATISFIED CUSTOMER",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969002,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE PULLING OUT OF A PARKING LOT AT AN UNKNOWN SPEED, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER WITHOUT WARNING. IN ADDITION, WHILE DRIVING AT LOW SPEEDS, THE STEERING WHEEL VIBRATED VIOLENTLY INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING TORQUE SENSOR NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE CONTACT MENTIONED THAT THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 185,000.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959562,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE FAILED TO ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE CONTACT HAD TO APPLY EXCESSIVE FORCE TO THE ACCELERATOR PEDAL IN ORDER TO ACCELERATE. IN ADDITION, THE VEHICLE STALLED WHILE DRIVING 55 MPH AND THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER WHEN MAKING TURNS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED, BUT NOT REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947708,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE OPERATING THE VEHICLE, THE ACCELERATOR PEDAL BECAME STUCK AND COULD NOT BE DEPRESSED. THE FAILURE ALSO OCCURRED WHEN THE VEHICLE WAS FIRST STARTED IN COLD TEMPERATURES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE THROTTLE WAS FAULTY. THE VEHCILE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V357000 (ENGINE), ALTHOUGH THE FAILURES WERE IDENTICAL. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "01/06/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945222,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I STOPPED AT A STOP SING, WHEN I WENT TO TAKE OFF THE VEHICLE STARTED ROLLING BACKWARDS. I STOPPED TURNED OFF THE CAR. THEN WHEN I STARTED IT AGAIN AND PUT IT IN REVERSE IT WENT FORWARDS. WHEN I PUT IT IN DRIVE IT WAS IN NEUTRAL, AND NATURAL WAS REVERSE. AFTER TURNING IT OFF AGAIN AND RESTARTING IT ALL GEAR POSITIONS DID NOT FUNCTION AND ACTED AS IF THEY WERE IN NEUTRAL. NOW EVERY TIME I TRY TO PUT IT IN A GEAR IT MAY BE THE RIGHT GEAR AND SOMETIMES ITS NOT AND SOME TIMES IT JUMPS TO NEUTRAL OUT OF NO WHERE. THERE IS A RECALL ON THIS EXACT ISSUE, WHEN I CONTACTED MAZDA I WAS INFORMED THAT MY CAR WAS NOT COVERED IN THE RECALL AND THERE WAS NOTHING THEY WOULD ABOUT IT.",
        "vin": "4F2CZ92Z88K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939861,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING AT ANY SPEED AND ATTEMPTING TO APPLY THE BRAKES, THE BRAKE PEDAL TRAVELED TO THE FLOOR WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED AND REPLACED THE MASTER CYLINDER AND THE BRAKE BOOSTER. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE MECHANIC WHO DIAGNOSED AND \"POWER BLED\" THE BRAKES. THE FAILURE RECURRED AFTER A FEW WEEKS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VEHICLE HAD HIGH MILEAGE. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 130,000.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "06/17/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935017,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT AT VARIOUS SPEEDS WHILE DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO ACCELERATE WITHOUT ANY WARNING INDICATOR. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "12/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934156,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED A LOSS OF POWER STEERING AND THE STEERING COLUMN EXPERIENCED SEVERE VIBRATION. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TORQUE SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. PRIOR TO THE FAILURE, THE VEHICLE WAS REMEDIED PER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851110,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING INTO A PARKING SPOT AND OF A SUDDEN I COULDN'T TURN MY STEERING WHEEL. I GOT IT TOWED TO A DEALERSHIP THEY SAID IT WAS THE POWER STEERING. THEY REPLACED THE TORQGUE SENSOR. THEN MY NEXT PROBLEM WAS MY GAS PEDAL SOMETIMES JUST WOULDN'T ACCELERATE. I WAS DRIVING ON THE HIGHWAY IN THE FAST LANE WITH CRUISE CONTROL ON I TURNED IT OFF. THEN I TRIED TO PUSH MY GAS PEDAL IT WOULDN'T ACCELERATE SO I HAD TO HURRY UP AND PULL ON THE SIDE OF THE HIGHWAY BECAUSE CARS WHERE BEHIND ME. IT EVENTUALLY JUST STARTED BACK AND ANOTHER TIME IT WAS 3 AM AND I WAS DRIVING ON A BACK ROAD. I PUSHED MY GAS PEDAL BUT IT WOULDN'T ACCELERATE SO I STARTED HITTING IT AS HARD AS I COULD. IT STILL WASN'T WORKING SO I PULLED OVER AND PUT IT IN PARK. I JUST KEPT ON PUSHING THE GAS PEDAL AND AFTER 15 MINS IT STARTED BACK WORKING. I TOOK MY TUCK TO ANOTHER MAZDA DEALERSHIP AND THEY REPLACE THE THROTTLE CABLE AND RETAINER. A MONTH LATER I STARTED HAVING THE SAME PROBLEM AGAIN. I WAS TURNING ON TO A HIGHWAY RAMP AND IT WOULDN'T ACCELERATE. SINCE I WAS TURNING I WASN'T GOING THAT FAST SO I HAD TO JUST LET MY TRUCK ROLL TO THE SIDE OF THE HIGHWAY UNTIL IT STARTED BACK WORKING. I CALLED MAZADA TO SEE IF THEY HAD A RECALL ON THE GAS PEDAL. THEY SAID NO BUT THERE WAS A RECALL ON THE POWER STEERING BUT IT ENDED SEPT. 2015. TODAY WAS MARCH 21,2016 I'M JUST FINDING OUT ABOUT IT, AND I DIDN'T RECEIVE ANYTHING IN THE MAIL ABOUT IT. THEY REALLY NEED TO HAVE A RECALL ON THE GAS PEDAL I STILL DON'T KNOW WHAT THE PROBLEM IS. I'M SO SCARED I'M GOING TO GET IN AN ACCIDENT.",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/23/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822271,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS THROTTLE STICKS, YOU CAN'T GIVE IT GAS, EVEN AFTER DRIVING IT FOR 15 MINS, IT WILL STILL GET STUCK AGAIN.  ALMOST CAUSED ME TO HAVE SEVERAL ACCIDENTS.  THE POWER STEERING ALSO GOES OUT AND YOU HAVE TO TURN THE CAR OFF AND BACK ON TO GET IT TO WORK AGAIN.  I DID HAVE THE SPRING ON THE GAS PEDAL REPLACED ABOUT 5 YRS AGO, BECAUSE IT GOT STUCK AND I KEPT PUSHING ON IT TILL IT BROKE.  THERE NEEDS TO BE A RECALL ON THESE VEHICLES DUE TO THESE PROBLEMS.  THANK YOU.  [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2CZ02Z28K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "01/18/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821012,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STICKING THROLLE ON VEHICLE OCCURS WHEN TEMPERATURE IS COLD.   I COULD NOT MOVE THE CAR AT ALL.  GAS PEDAL IS STUCK.   IT HAS HAPPENED TO ME AT A RED LIGHT AS WELL AND ALMOST CAUSED SOMEONE TO HIT ME FROM BEHIND.  HOWEVER ON 1/18 I COULD NOT GET THE THROLLE UNSTUCK AT ALL.   MAZDA SAYS THERE IS NO RECALL AND REFUSES TO REPAIR MY CAR FREE OF CHARGE, THEY DO NOT ACKNOWLEDGE THE RECALL AT ALL.  THOUGH THERE IS A TON OF INFORMATION ON LINE FROM THE WALL STREET JOURNAL.  CARS.COM AND BLOGS RE. THIS ISSUE AFFECTING OVER 218,000 VEHICLES.   SEE ARTICLES ATTACHED IS WHAT EXACTLY HAPPENED TO ME.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820542,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE ACCELERATOR PEDAL BECAME STUCK WHILE DEPRESSED. THE FAILURE RECURRED OCCASIONALLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V357000 (ENGINE AND ENGINE COOLING, VEHICLE SPEED CONTROL). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 107,500.",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807844,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT VARIOUS TIMES BETWEEN AUGUST 2015 AND NOVEMBER 2015, MY BRAKES DID NOT RESPOND PROPERLY.  AT ABOUT 3-WEEK INTERVALS, MY BRAKE PEDAL WOULD GO FARTHER DOWN TOWARD THE FLOORBOARD THAN IT USUALLY TAKES FOR ME TO STOP.  THIS USUALLY HAPPENED AT LOW SPEEDS (5MPH TO 40MPH), USUALLY WHEN I AM APPROACHING A STOPLIGHT OR STOP SIGN.  AFTER ALL OF THESE INSTANCES, WHENEVER I PARKED MY CAR AND STARTED A NEW TRIP, THE BRAKES WOULD GO BACK TO NORMAL.  HOWEVER, ON 11/10/15, THE BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR WHEN I TRIED TO STOP AT 15-20MPH.  THIS WAS ON A BUSY CITY STREET, AND I HAD TO DRIVE UP ON THE MEDIAN TO AVOID HITTING THE CAR IN FRONT OF ME.  I TOOK IT TO SEARS AND WAS TOLD THERE WAS NO PROBLEM WITH THE BRAKES; HOWEVER, THEY BLED THE BRAKE LINE, CHANGED THE BRAKE FLUID. THEN, I TOOK IT TO THE MAZDA DEALER AND WAS TOLD THERE WAS NO PROBLEM WITH THE BRAKES, BUT THAT THE FLUID NEEDED TO BE CHANGED.  WHEN I TOOK IT TO CARMAX, THEY TOLD ME IT WAS THE MASTER CYLINDER, AND THEY REPLACED IT ALONG WITH THE FRONT ABS TONE RINGS.  ON 11/25/15, TWO DAYS AFTER GETTING MY CAR BACK FROM THE CARMAX MECHANICS, THE BRAKE PEDAL WAS AGAIN FEELING LIKE IT WAS GOING FARTHER DOWN THAN NECESSARY, AND THEN IT WENT TO THE FLOOR AGAIN.  THAT TIME, I WAS APPROACHING A STOP SIGN IN A RESIDENTIAL NEIGHBORHOOD, SO IT WAS AT A LOW SPEED.  THE CAR IS NOW BACK AT CARMAX, AND THEY HAVE CALLED TO SAY THAT THEY CANNOT FIND ANY PROBLEM.  THE SCARIEST THINGS ABOUT THIS (BESIDES THE OBVIOUS FEAR THAT MY CAR WILL CAUSE AN ACCIDENT) ARE: 1) THE RANDOM NATURE OF THESE BRAKE PROBLEMS; 2) THE FACT THAT THE BRAKE PEDAL GOES BACK TO NORMAL AFTER ONE OF THESE EVENTS; 3) MECHANICS WERE NOT SPOTTING A PROBLEM WITH MY BRAKES; AND 4) WHEN A PROBLEM WAS SPECIFIED AND SUPPOSEDLY FIXED, THE BRAKES STILL WENT OUT.",
        "vin": "4F2CZ96108K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/22/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806160,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE AT A RED LIGHT, THE VEHICLE WOULD NOT RESPOND WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE WAS IDLING AND MOVING, BUT THERE WAS NO ACCELERATION. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 127,800.",
        "vin": "4F2C02Z38KM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "08/05/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789998,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING 35 MPH AND ATTEMPTING TO DECELERATE, THE BRAKE PEDAL FAILED TO RESPOND AND TRAVELED TO THE FLOORBOARD. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 105,000.",
        "vin": "4F2CZ96108K"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2015",
        "dateOfIncident": "10/07/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786977,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING 35 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN AND SEIZED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,090.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/16/2015",
        "dateOfIncident": "10/07/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782854,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING). THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE STEERING WHEEL BEGAN TO JERK AND THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE VEHICLE WAS TOWED TO THE DEALER AND WAS DIAGNOSED THAT THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "09/05/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762043,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BATTERY CHARGING MALFUNCTION LIGHT BEGAN TO COME ON INTERMITTENTLY TWO DAYS AGO.  TODAY, THE POWER STEERING HAS BEGUN TO GO OUT WHILE DRIVING AT LOW SPEEDS (SO FAR)  HAD THE NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) PERFORMED LESS THAN 2 MONTHS AGO AND AM WONDERING IF THEY ARE LINKED SOMEHOW.  WILL BE TAKING MY VEHICLE TO THE DEALER FOR DIAGNOSIS ASAP.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745429,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING AT UNKNOWN SPEEDS, THE ACCELERATOR PEDAL WAS DEPRESSED BUT THE VEHICLE HESITATED TO ACCELERATE. THE CONTACT NOTICED THAT THERE WAS A SUDDEN INCREASE OF ENGINE RPMS AND THE THROTTLE AND POWER TRAIN WARNING LIGHTS ILLUMINATED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 124,000.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732440,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 50 MPH, THE ACCELERATOR PEDAL BECAME STUCK AND CAUSED THE VEHICLE TO ACCELERATE INDEPENDENTLY. THE FAILURE RECURRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 12V357000 (ENGINE AND ENGINE COOLING, VEHICLE SPEED CONTROL); HOWEVER, THE PART WAS UNAVAILABLE TO PERFORM THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "4F2CZ96108K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725468,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING 55 MPH,  THE BRAKE PEDAL EXTENDED TO THE FLOORBOARD WHEN DEPRESSED. THE DEALER DIAGNOSED THAT THE ABS MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 143,000. THE VIN WAS INVALID.",
        "vin": "4F2CZ02Z6BK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "05/07/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715612,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING 80 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS MERGED TO THE SIDE OF THE ROAD. THE GEAR WAS SHIFTED INTO NEUTRAL AND THE VEHICLE RESTARTED. THE FAILURE RECURRED FOUR TIMES. THE VEHICLE WAS TAKEN TO A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "03/16/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695269,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACTED STATED THAT WHILE DRIVING AT APPROXIMATELY 20 MPH AND MAKING A TURN, THE STEERING WHEEL WAS DIFFICULT TO TURN LEFT OR RIGHT. THE FAILURE WAS EXPERIENCED AFTER THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 10V374000 (STEERING). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED FOR THE MOST RECENT FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 94,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694808,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE RECEIVED THE RECALL REPAIR FOR NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING) AND INDICATED THAT THE FAILURE OCCURRED WITHIN A YEAR OF THE REPAIR. THE DEALER UPDATED THE PSCM, BUT IT WAS NOT CONFIRMED IF THE INSTRUMENT CLUSTER MODULE WAS ALSO UPDATED. WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL AND COLUMN SHOOK AND VIBRATED AND THERE WAS A SUDDEN LOSS OF POWER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693376,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY OUT TO STORE I BACKED UP OUT OF MY DRIVEWAY AS I SWITCHED GEARS AND WENT INTO DRIVE MY GAS PEDAL WAS HARD TO PUSH DOWN ON. I  TRIED  AGAIN THEN PEDAL WAS STICKING THEN DROPPED   ALL THE WAY DOWN TO FLOOR. I LIFT MY FOOT OFF THE GAS PEDAL CAR CONTINUED TO GO IN DRIVE, I IMMEDIATELY PUSHED ON BREAKS THEY WERE THEN ALSO HARD TO PUSH SO I  PLACED CAR IN NEUTRAL AND PUT ON EMERGENCY BRAKE TO STOP THE VEHICLE.   *TR",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691914,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, THE SRS WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE FRONT DRIVER'S SIDE SEAT BELT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "4F2CZ06198K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683603,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING A CORNER, THE CAR STARTED UNCONTROLLABLY ACCELERATING AND DID NOT RESPOND WHEN THE BRAKE PEDAL WAS FULLY ENGAGED.  THE ENGINE CONTINUED TO GROW LOUDER AS THE CAR CONTINUED TO GAIN SPEED.  THE DRIVER'S FOOT WAS NOT ON THE GAS PEDAL AS THE CAR ACCELERATED, IN FACT, THE DRIVER PUSHED THE BRAKE PEDAL DOWN AS FAR AS IT COULD GO.  ENGAGING THE BRAKE DID NOT AFFECT THE SPEED OF THE VEHICLE, WHICH CONTINUED TO ACCELERATE WITH NO PRESSURE APPLIED TO THE GAS PEDAL AND CONSISTENT PRESSURE BEING APPLIED TO THE BRAKE PEDAL.  THE DRIVER ATTEMPTED TO DOWNSHIFT THE CAR WHILE PRESSING ON THE HORN IN AN ATTEMPT TO ALERT OTHER DRIVERS AND PEDESTRIANS THAT THE VEHICLE WAS OUT OF CONTROL.  THE DRIVER CONTINUED TO DOWNSHIFT THE CAR WHILE HOLDING DOWN THE BRAKE PEDAL AND USED THE EMERGENCY BRAKE BEFORE THE CAR EVENTUALLY SLOWED DOWN AND STOPPED.  THE DRIVER PUT THE CAR IN PARK WHEN IT STOPPED, TURNED IT OFF, AND CALLED A TOW TRUCK.  THE DRIVER CALLED MAZDA TO FILE A REPORT.  *TR",
        "vin": "4F2CZ92Z58K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "01/20/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679765,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THERE WAS A LOST OF POWER STEERING. THE VEHICLE WAS TAKEN TO A DEALER FOR NHTSA CAMPAIGN NUMBER: 14V282000 (STEERING).THE TECHNICIAN REPAIRED THE TORQUE SENSOR AND STATED THAT THE FAILURE WAS NOT RELATED TO THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 37,764.",
        "vin": "4F2CZ06178K"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/18/2015",
        "dateOfIncident": "12/25/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10676323,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO GET IN LEFT LANE TO TURN MY STEERING WHEEL LOCKED CAUSING ME TO LOSE CONTROL OF MY VEHICLE AND COLLIDE  WITH AN ON COMING VEHICLE.  *TR",
        "vin": "4F2CZ02Z28K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/04/2015",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669932,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAPPENS MORE DURING COLD WEATHER.  WHEN YOU PUSH ON THE ACCELERATOR IT STICKS AND WHEN IT FINALLY LETS GO YOU LURCH FORWARD.  LUCKILY I HAVE NOT HAD ANY ACCIDENTS OVER THIS YET, BUT FEEL THAT IS ALWAYS A POSSIBILITY AND FEEL LIKE IT IS UNSAFE.  I WAS TOLD IT HAS TO DO WITH THE BUTTERFLY VALVE.  IT HAS BEEN HAPPENING FOR AT LEAST 4-5 YEARS.  I HAVE ASKED NUMEROUS TIMES IF THERE HAS BEEN A RECALL BECAUSE FROM WHAT I CAN SEE THERE HAVE BEEN MANY COMPLAINTS BY OTHER CONSUMERS.  IF THIS EVER CAUSES ME TO HAVE AN ACCIDENT, I WILL BE SUING MAZDA!  *TR",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661806,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED WHILE THE VEHICLE WAS STOPPED AND THE BRAKES WERE APPLIED, THE VEHICLE STARTED TO ACCELERATE INDEPENDENTLY AND THE WRENCH WARNING ICON ILLUMINATED. ALSO, THE STEERING COLUMN STARTED TO VIBRATE ABNORMALLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT WAS MADE AWARE OF NHTSA CAMPAIGN ID NUMBER:  12V357000 (ENGINE AND ENGINE COOLING, VEHICLE SPEED CONTROL), BUT THE VEHICLE WAS NOT INCLUDED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653284,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE.  CONSUMER STATED THAT THERE WAS A RECALL. HOWEVER, HE NEVER RECEIVED A LETTER.*CW",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2014",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649583,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WEATHER GETS COOL (SUB 50F) THE GAS PEDAL WILL STICK. WHEN THE GAS PEDAL IS FULLY DEPRESSED AND YOU GO TO PUSH IT DOWN IT STICKS. WHEN THIS STICKING FINALLY LETS GO THE VEHICLE JUMPS FORWARD. THE V6 VERSION OF THIS SUV HAS A RECALL ON THE PEDAL BUT I OWN THE V4.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2014",
        "dateOfIncident": "09/10/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637830,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GAS PEDDLE DROPS AND I CANNOT ACCELERATE.   THIS HAS HAPPENED OVER 10 TIMES WHEN I'M DRIVING.  I THOUGHT THAT I POSSIBLY SLID THE CARPET TO KNOCK THE GAS PEDAL OFF, BUT I HAVE REMOVED MY CARPET AND IT HAPPENED TWICE SINCE THEN.    I'VE BEEN IN INTERSECTIONS AND MY GAS PEDAL JUST DROPS TO THE FLOOR.     THIS COULD BE VERY SERIOUS IF I HAPPENED TO HAVE BEEN PASSING SOMEONE.     IN THESE SITUATIONS, AFTER SEVERAL ATTEMPTS PULLING IT BACK UP, I DID MANAGE TO GET THE PEDDLE TO WORK AGAIN.  BUT I'M AFRAID I WON'T ALWAYS BE SO LUCKY.  I BROUGHT MY CAR IN TO A MAZDA DEALER AND THEY SAID THEY HAVE A BULLETIN THAT REQUIRES A CABLE CHANGE AND A CLIP AT THE COST OF APPROX. $140.00.     THIS STARTED HAPPENING AT APPROX. 65000 MILES, AND I NOW HAVE 80K MILES.",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631080,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED BUT THE VEHICLE FAILED TO ACCELERATE. THE CONTACT ALSO STATED THAT THE WRENCH WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 178,901.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631078,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED BUT THE VEHICLE FAILED TO ACCELERATE. THE CONTACT ALSO STATED THAT THE WRENCH WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 178,901.",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/06/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630651,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE ATTEMPTING TO START, THE VEHICLE FAILED TO START. THE CONTACT INDICATED THAT IN ORDER TO START THE VEHICLE PRESSURE WAS APPLIED TO THE KEY WHEN TURNING THE IGNITION SWITCH. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE IGNITION SWITCH HOUSING WOULD NEED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "09/26/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630367,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY LOST POWER AT HIGHWAY SPEED (60+ MPH) WITH RED TRIANGLE WARNING SYMBOL AND \"STOP SAFELY NOW\" MESSAGE.  EVENT HAS HAPPENED ON SEVERAL OCCASIONS WITH SIMILAR SAFETY RISKS ASSOCIATED WITH UNEXPECTED LOSS OF POWER WHILE DRIVING AT HIGHWAY SPEEDS.  DEALER RECOMMENDS REPLACING THROTTLE BODY SIMILAR TO CUSTOMER SERVICE REPLACEMENT UNDER WAY WITH FORD ESCAPE (SAME VEHICLE, DIFFERENT BADGE).  HOWEVER, MAZDA DOES NOT RECOGNIZE/ACKNOWLEDGE ANY RESPONSIBILITY IN THE MATTER AND TREATS THE INCIDENT AS JUST ANOTHER SERVICE EVENT.  UNPREDICTABLE CONDITION PUTS DRIVERS AT SIGNIFICANT SAFETY RISK.  NEEDS TO BE ADDRESSED GIVEN THIS IS A KNOWN ISSUE WITH THE FORD VARIANT.  MAZDA'S SMALLER SHARE OF THE MARKET IS NOT AN EXCUSE TO IGNORE THE SAFETY RISK.  *TR",
        "vin": "4F2CZ49H78K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "07/27/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619323,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING INTO MY DRIVEWAY THE STEERING MADE A GRINDING CLUNKING SOUND AS I WAS TURNING THE STEERING WHEEL.  TOOK VEHICLE FOR A TEST DRIVE AROUND BLOCK.  AS I TURNED INTO A SIDE STREET THERE WAS A LOUD CLUNKING SOUND AS IF THE STEERING SHAFT WAS BINDING UP AND NOT TURNING FREELY.  AFTER THAT WHEN I TURNED THE WHEEL TO STEER AROUND A CORNER THE CAR WOULD NOT TURN RIGHT AWAY.  AS I TURNED THE WHEEL MORE THE CLUNKING SOUND CAME BACK AND FINALLY THE STEERING CAUGHT AND THE WHEELS TURNED.  BROUGHT TO DEALER WHO DIAGNOSED IT AS A FAILED STEERING SHAFT COUPLER.  FORTUNATELY THIS HAPPENED WHILE NEAR HOME.  THIS IS A SAFETY ISSUE THAT SHOULD BE ADDRESSED BY MAZDA ON THE 2008 TRIBUTE WITH A RECALL.  THE TRIBUTE ONLY HAS AROUND 66K MILES.  *TR",
        "vin": "4F2CZ96198K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615284,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE ACCELERATOR PEDAL FAILED TO RESPOND.  THE CONTACT ALSO MENTIONED THAT THE VEHICLE WOULD NOT ACCELERATE WHEN THE ACCELERATOR PEDAL FAILED WAS APPLIED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO REPLACED THE CABLE AND THE CLIP TO THE PEDAL.  THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 62,000.",
        "vin": "4F2CZ92Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608701,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE POWER STEERING SUDDENLY SEIZED MAKING THE STEERING WHEEL VERY DIFFICULT TO TURN. THE CONTACT STATED THAT THE FAILURE HAD OCCURRED ON MULTIPLE OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 79,000.",
        "vin": "4F2CZ02Z58K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605405,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE THIRD TIME IN 5 YEARS THAT WE HAVE HAD TO REPLACE THE ABS TONE RING BECAUSE IT HAS BROKEN/CRUMBLED AND CAUSED OUR BRAKES TO GO OUT WHILE DRIVING!  THERE SEEMS TO BE SOME SERIOUS ISSUES WITH THE QUALITY OF THIS PRODUCT??  I FEAR FOR MY LIFE AT ALL TIMES, NEVER KNOWING WHEN ITS GOING TO DECIDE TO BREAK AGAIN.   *TR",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604847,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 MAZDA TRIBUTE, 3.0L V6, DEVELOPED A CLUNKING NOISE IN THE POWER STEERING COLUMN UNDER NORMAL DRIVING CONDITIONS. IT'S A CLUNK THAT CAN BE HEARD AND FELT AT SLOWER SPEEDS. ACCORDING TO MY MECHANIC, IT IS YET ANOTHER 2008 TRIBUTE STEERING U-JOINT FAILURE.   *TR",
        "vin": "4F2CZ96188K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597505,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN \"CLUNKED\" AS I WAS TURNING RIGHT INTO A PARKING SPOT.  AT SLOW SPEEDS, THE STEERING COLUMN MAKES A METALLIC CLUNK SOUND IF I TURN RIGHT OR LEFT AT SLOW SPEEDS.  *TR",
        "vin": "4F2CZ96198K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "12/22/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595818,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST YEAR AND A HALF, THE POWER STEERING IN MY 2008 MAZDA TRIBUTE HAS COME AND GONE AT VARIOUS TIMES MOSTLY OCCURRING IN THE WINTER MONTHS.  AT FIRST I WOULD JUST RESTART MY CAR A FEW TIMES AND MOST OF THE TIME IT WOULD COME BACK ON.  A FEW TIMES IT WOULD GO OUT WHEN I WAS ON THE INTERESTED GOING 70 MPH.  IT IS VERY DANGEROUS FOR ME TO BE DRIVING AT SUCH SPEEDS WITHOUT POWER STEERING.  RECENTLY THERE HAS BEEN NO POWER STEERING AT ALL.  IT IS COMPLETELY GONE.  I HAVE TALKED ABOUT ESTIMATES TO GET IT FIXED AND THE COST IS ANYWHERE BETWEEN $1200-$2000 TO REPAIR IT.  I HAVE ALSO RESEARCHED THIS PROBLEM ONLINE AND FOUND THAT THERE ARE MANY OTHER PEOPLE WITH THIS PROBLEM AND JUST READ THAT FORD HAS RECALLED THEIR 2008 FORD ESCAPE FOR THIS PROBLEM.  THIS IS PRETTY MUCH THE EXACT SAME VEHICLE.  I THINK THIS NEEDS TO BE ADDRESSED FOR 2008 MAZDA TRIBUTES AS WELL BEFORE AND SERIOUS INJURY CAN OCCUR.  *TR",
        "vin": "4F2CZ96198K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/26/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594133,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A FEW MONTHS NOW I HAVE A RANDOM TIMES WHEN STARTING THE CAR WHERE THE STEERING WOULDN'T WORK. I WOULD START THE CAR AND TRY TO BACK OUT OF A PARKING LOT OR SOMETHING AND THE CAR WOULDN'T TURN. I WOULD TURN THE CAR OFF AND THEN TURN IT BACK ON AND THE STEERING WOULD WORK JUST FINE. I TOOK IT TO A FEW AUTO REPAIR SHOPS AND COULD NEVER REPLICATE THE PROBLEM SO THEY WOULD TELL ME THAT THEY CAN'T DIAGNOSE THE PROBLEM AND SUGGEST IT WAS AN ISSUE WITH MY IGNITION KEY LOCKING THE STEERING. SO I DIDN'T LOOK INTO IT ANYMORE BECAUSE FOR A MONTH OR TWO IT STOPPED HAPPENING. THEN OUT OF NOWHERE TODAY, I WAS DRIVING DOWN THE HIGHWAY AROUND 60-70 MPH WHEN I NOTICED THE STEERING GOT REALLY STIFF. IT WAS REALLY SCARY BECAUSE IT FELT LIKE I DIDN'T HAVE ANY CONTROL OVER THE STEERING OF THE CAR.  SO I PULLED OVER AND TURNED THE CAR OFF FOR A FEW MINUTES AND TURNED IT BACK ON AND THE STEERING WORKED LONG ENOUGH TO GET TO THE NEXT EXIT WHERE I PARKED AT A AUTO REPAIR SHOP. I'M WAITING RIGHT NOW FOR THE REPAIR SHOP TOMORROW TO SEE HOW MUCH IT WILL COST TO FIX.   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2014",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584450,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHEN DEPRESSING THE ACCELERATION PEDAL AT ANY SPEED, THERE WAS A REVVING NOISE AS THE ACCELERATION PEDAL VIBRATED. THE FAILURE WAS RECURRING AND WOULD BECOME MORE PROMINENT WHEN DRIVING IN INCLEMENT WEATHER. THERE WAS ALSO AN INCREASE IN ENGINE RPMS. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 12V357000 (ENGINE AND ENGINE COOLING, VEHICLE SPEED CONTROL) BUT THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME FAILURE MULTIPLE TIMES WITH A 4-CYLINDER STICK SHIFT. THE VEHICLE WAS TO BE INSPECTED, DIAGNOSED AND REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35000.",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2014",
        "dateOfIncident": "12/28/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584067,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOTAL FAILURE OF THE ELECTRONIC POWER STEERING. THE VEHICLE WAS PARKED WHEN THE FAILURE OCCURRED ,POSSIBLY AVOIDING AN ACCIDENT. THE REPAIR REQUIRED REPLACEMENT OF THE ENTIRE POWER STEERING UNIT.  *TR",
        "vin": "4F2CZ92Z58K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583082,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE, I GLANCED DOWN TO SEE I WAS GOING 75MPH.  WHEN I BACKED OFF THE GAS, THE CAR DID NOT SLOW DOWN. IT KEPT GOING TO 75 MPH EVEN THOUGH I WAS NOT USING CRUISE CONTROL.  I MANAGED TO APPLY THE BREAKS HARD ENOUGH TO SLOW THE CAR DOWN AND GET TO THE SIDE OF THE ROAD.  (IT TOOK ALL MY WEIGHT ON THE BREAK TO SLOW IT DOWN)  I HAD THE CAR TOWED WHERE THE DEALER SAID THE ONLY THING THEY COULD FIND WAS THAT THE RUBBER MAT WAS WEDGED UNDER THE GAS PEDAL.  (I SPECIFICALLY REMEMBER STICKING MY FOOT UNDER THE PEDAL AND LIFTING IT UPWARD IN AN ATTEMPT TO STOP THE ACCELERATION AND SLOW THE CAR.) THE MATS ARE HEAVY DUTY AND DO NOT SLIDE AROUND OR BUNCH UP. *TT",
        "vin": ""
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576762,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WHEELS FELT LIKE THEY WERE LOOSE & THE TIRE COULD COME OFF AT ANY MOMENT.  THE POWER STEERING WENT OUT WENT I WAS MAKING A LEFT TURN.  TOOK IT TO THE DEALER AND WAS CHARGED APPROX $2100 TO REPLACE THE STEERING PROBLEM.  MAZDA WAS CONTACTED AND THEY STATED THAT THERE WAS NOTHING THEY WOULD DO ABOUT IT.  *TR",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "03/22/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576301,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY OTHER TIME THAT I TURN MY CAR ON, THE POWER STEERING IS GONE. THE STEERING WHEEL IS EXTREMELY TIGHT AND VERY DIFFICULT TO MOVE. IF I TURN THE CAR OFF AND WAIT A FEW SECONDS, THEN TURN IT BACK ON WHILE PULLING HARD TO TURN THE WHEEL, THE POWER STEERING SEEMS TO \"COME BACK.\" THIS IS VERY DIFFICULT FOR MANY REASONS. ONE, I'M WORRIED THAT THE POWER STEERING IS GOING TO GO OUT WHILE DRIVING, NOT JUST WHEN I TURN THE CAR ON AND OFF. ALSO, I FEEL LIKE IM WASTING A LOT OF MONEY ON GAS BY HAVING TO TURN MY CAR ON AND OFF MULTIPLE TIME. LASTLY, IT JUST PLAIN DIFFICULT. IT TAKES A LOT OF UPPER BODY STRENGTH TO MANUALLY TURN AN ENTIRE MINI SUV. THIS IS UNACCEPTABLE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2014",
        "dateOfIncident": "03/29/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575644,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING IS FAILING INTERMITTENTLY AND WITHOUT WARNING.  THE STEERING BECOMES VERY TIGHT AND DIFFICULT DURING AN OCCURRENCE.  UPON TURNING THE ENGINE OFF  AND BACK ON THE STEERING IS RESTORED.  THIS CONDITION IS EXTREMELY DANGEROUS AS A PERSON WITHOUT ENORMOUS UPPER BODY STRENGTH WOULD NOT BE ABLE TO SAFELY STEER THE VEHICLE.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "03/11/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574791,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE TRAVELING VARIOUS SPEEDS, THE POWER STEERING FAILED WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 109,000.",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574463,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING INTO A PARKING LOT, THE STEERING SUDDENLY BEGAN TO GRIND AND FELT UNCONTROLLABLE. MY PREGNANT WIFE WAS IN THE VEHICLE WITH ME SO IT WAS ESPECIALLY WORRISOME. I WAS ABLE TO NAVIGATE INTO THE PARKING LOT WITHOUT CRASHING BUT I THINK A RECALL IS IN ORDER. THIS TRIBUTE STILL HAS UNDER 60,000 MILES ON IT.   *TR",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569058,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL BECOMES HARD TO TURN WHILE DRIVING. POWER STEERING MODULE STOPS WORKING.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2014",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567875,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELERATOR STICKS CAUSING  THE VEHICLE TO STOP WHILE YOU ARE DRIVING DOWN THE ROAD BECAUSE THE ACCELERATOR DONE STUCK.  I FOUND OUT THAT MAZDA HAD A RECALL ON  THE 2008 MAZDA TRIBUTE FOR THE  EXACT SAME PROBLEM  BUT I WAS  TOLD MY VEHICLE WASN'T AMONG  THEM.  I'VE TRIED TOO CONTACT MAZDA BUT I GET NO ANSWER AND NO ONE RETURN MY CALLS.  *TR",
        "vin": "4F2CZO2Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "03/05/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567118,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL WOULD BECOME VERY DIFFICULT TO STEER.  I WOULD TURN IT OFF AND ON A FEW TIMES AND IT WOULD BE FINE, STILL SHAKE BUT I COULD AT LEAST STEER.  DRIVING DOWN INTERSTATE AT 65-70 AND THE STEERING WHEEL LOCKED UP.  VERY SCARY!!  NOW I AM SCARED TO DRIVE IT ANYWHERE OTHER THAN WORK BECAUSE IT COULD HAPPEN AGAIN.  RECALL!!!  THIS IS A SAFETY HAZARD!  UNFORTUNATELY THIS IS GOING TO GO ON UNTIL SOMEBODY IS SERIOUSLY HURT OR KILLED.  RECALLS ARE BASED ON COST TO REPAIR VS COST OF BEING SUED. RIGHT NOW IT COSTS MAZDA MORE TO REPAIR ALL AFFECTED VEHICLES THAN IT WOULD TO PAY IF THEY GOT SUED BECAUSE NOBODY HAS DIED.  THEY ARE WAITING FOR THAT. SICK SICK SICK!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "02/12/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567014,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC POWER STEERING UNIT IN MT TRIBUTE IS SHOT!  IT STARTED GOING OUT RANDOMLY AND WOULD COME BACK ON AFTER TURNING THE CAR OFF AND TURNING IT BACK ON.  OVER THE WEEKEND IT WENT OUT ON US WHILE DRIVING 70MPH DOWN THE HIGHWAY!  IT WAS A VERY SCARY SITUATION THAT COULD'VE WENT BAD.  THIS IS A KNOWN DEFECT THROUGH MAZDA AND SHOULD BE RECALLED!  IT IS THE SAME UNIT THAT WAS IN THE MAZDA 3 AND 5; WHICH WAS RECALLED.  THIS NEEDS TO BE DONE ASAP!  *TR",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566882,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED FOR GAS. UPON TURNING VEHICLE BACK ON THERE WAS NO POWER STEERING. TURNED VEHICLE OFF THEN BACK ON, STILL NO POWER STEERING. IT HAS NEVER COME BACK, AND ON MOST DAYS STEERING IS CLOSE TO IMPOSSIBLE, (STEERING WHEEL VERY TIGHT, WILL NOT TURN). DRIVING THIS VEHICLE WITH NO POWER STEERING IS EXTREMELY DIFFICULT. MUST DRIVE DAILY FOR WORK.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "02/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566892,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE REVERSING FROM OUT A PARKING SPACE, THE POWER STEERING FAILED. THE CONTACT TOOK THE VEHICLE TO THE DEALER, WHO STATED THAT THE STEERING COLUMN WOULD HAVE TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 84,000. THE VIN WAS NOT AVAILABLE.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "02/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566277,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED VEHICLE AT MALL, PUT IN REVERSE AND OUT OF NOWHERE  (NO WARNING) WE HAD NO POWER STEERING.  DROVE THAT WAY FOR ABOUT 5 MILES, STOPPED AND TURNED THE CAR OFF, RESTARTED AND IT STARTED WORKING AGAIN.  WITHIN A COUPLE OF DAYS THE STEERING WHEEL STARTING SHAKING WHEN IDLE OR EVEN IN PARK AND I AGAIN HAVE LOST POWER STEERING SEVERAL TIMES.  TOOK IT TO THE REPAIR SHOP WHERE THEY TOLD US WE WOULD HAVE TO GO TO THE DEALERSHIP FOR REPAIR OF THE SENSOR MODULAR IN THE ELECTRIC STEERING COLUMN.  THIS IS EXTREMELY DANGEROUS AS I CANNOT TURN WHEN THE POWER STEERING SUDDENLY GOES OUT, IT IS COMPLETELY UNSAFE TO DRIVE AND  THIS NEEDS TO BE RECALLED MY MAZDA BEFORE SOMEONE GET SERIOUSLY HURT...  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "02/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566378,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE TRAVELING VARIOUS SPEEDS, THE STEERING FAILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 95,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565858,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING BECAME VERY INTERMITTENT OVER THE PERIOD OF THREE WEEKS - WOULD WORK ONE DAY SOMETIMES AND NOT THE NEXT BEFORE QUITTING COMPLETELY LAST WEEK. WHEN IT WOULD WORK IT WOULD VIBRATE AND SHAKE AS TO NEED TWO HANDS ON THE WHEEL TO DRIVE AT ALL TIMES.  EXTREMELY UNSAFE AND VERY DIFFICULT TO MAKE A PROPER RIGHT HAND TURN.  I TOOK IT TO THE MECHANIC TODAY AND WAS INFORMED THAT IT IS THE STEERING COLUMN TORQUE SENSOR AND THE VEHICLE HAS A HISTORY OF THIS VERY SAME PROBLEM ON THE TRIBUTES.   MAZDA NEEDS TO RECALL THIS PART FAILURE AS IT IS VERY UNSAFE AND DANGEROUS!!!!!  *TR",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565087,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING STARTED SHAKING AROUND THE 10TH OF FEBRUARY JUST WHEN IT WAS IN PARK.  NOW IT IS SHAKING UNCONTROLLABLY EVEN WHEN WE ARE DRIVING IT. THE STEERING HAS ALSO LOCKED UP ON ME TO THE POINT I HAD NO STEERING AT ALL.  THE ENTIRE STEERING COLUMN HAS TO BE REPLACED TO THE TUNE OF 1,500.00 OR SO. IT IS EXTREMELY UNSAFE TO DRIVE HOWEVER TRYING TO GET IT FIXED AT A REPUTABLE PLACE HAS BEEN A LITTLE MORE CHALLENGING.   *TR",
        "vin": "4F2CZ92Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565199,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WEEK, AT A LOW SPEED OR IDLE, MY STEERING WHEEL WOULD SHAKE SLIGHTLY. TODAY, I WAS DRIVING MY DAUGHTER TO SCHOOL. UPON RETURNING THE POWER STEERING WENT OUT COMPLETELY...MAKING IT EXTREMELY DIFFICULT TO DRIVE. I PULLED INTO AN AUTO ZONE TO CHECK STEERING FLUID AND WAS TOLD THAT MY CAR HAS AN ELECTRIC POWER ASSISTED STEERING SYSTEM. WHEN I TURNED THE CAR BACK ON, IT WAS WORKING FINE. I HAVE READ SEVERAL POSTS THAT THE POWER STEERING HAS GONE OUT WHILE DRIVING. I CAN'T BELIEVE THERE HASN'T BEEN A RECALL. SO DANGEROUS!   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564642,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED ABOUT 2 WEEKS AGO WHEN DRIVING... COMING TO STOP. MY WHEEL SHAKES AND MAKES THIS NOISE. THEN MY WHEEL WOULD LOCK UP SO I HAVE TO CUT MY CAR OFF AND TAKE THE KEY OUT FOR IT TO LOOSEN UP. THEN PAST COUPLE OF DAYS THE WHEEL BEEN LOCKING UP WHILE I AM DRIVING. I HAVE TO CUT OFF AND TAKE THE KEY OUT TO UNLOCK THE WHEEL. I SEE ALL THESE COMPLAINTS BUT MAZDA HASN'T HAD A RECALL ON THEM YET. IT'S CRAZY.....SOMEONE NEEDS TO GET A LAWSUIT.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562877,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER STEERING STARTED GOING OUT ABOUT A WEEK AGO AND WOULD START WORKING AGAIN AFTER SHUTTING OFF THE VEHICLE AND RESTARTING. NOW IT IS GOING OUT WHILE DRIVING THE VEHICLE WITH NO WARNING AND IT'S ALMOST IMPOSSIBLE FOR ME TO TURN THE WHEEL. THE STEERING WHEEL IS TWITCHING WHILE RUNNING AND WHEN YOU SHUT OFF THE VEHICLE. WHEN I CALLED THE DEALER THEY EXPLAINED THERE HAVE BEEN A HUGE NUMBER OF COMPLAINTS ABOUT THE SAME THING. I CAN'T BELIEVE THERE HASN'T BEEN A RECALL FOR THIS. I REALLY THINK THERE SHOULD BE A CLASS ACTION LAWSUIT IF A RECALL IS NOT DONE.  *TR",
        "vin": "4F2CZ96138K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2014",
        "dateOfIncident": "01/24/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561632,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VIBRATED AND SHOOK WHEN STOPPED AND SLOWING DOWN  AFTER STARTING CAR, STEERING FROZE, TURNED CAR OFF AND ON AGAIN, STEERING WAS FINE  STEERING BECAME HARDER AND HARDER AS I DROVE- STOPPED USING AND TOOK TO AUTO SHOP  NO INDICATOR LIGHTS CAME ON  MECHANIC FOUND THAT ELECTRIC POWER STEERING UNIT HAD FAILED- THERE IS NO POWER STEERING ON MY CAR NOW.  *TR",
        "vin": "4F2CZ96138K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560562,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK AND I REACHED A STOP LIGHT. I PUSHED THE GAS AND IT WENT TO THE FLOOR AND REVVED UP VERY HIGH BUT DID NOT MOVE.  I DID THIS THREE TIMES. THE THIRD TIME I DID THIS IT REVVED AND WENT TO FLOOR BUT ACTUALLY MOVED AS NORMAL. THIS CYCLE HAPPENED TWICE THROUGH STOP LIGHTS BEFORE THE ORANGE WRENCH CAME ON. IT BEGAN FEELING VERY WEIRD TO DRIVE SO I DROVE IT STRAIGHT TO A FIRESTONE WHERE THEY TOLD ME MY TRANSMISSION WAS ALMOST SHOT. THIS CAR IS VERY WELL TAKEN CARE OF AND WAS FINE THAT MORNING PRIOR TO THE INCIDENT. IT WAS SCARY TO DRIVE AND CONTINUED FOR 18 MILES UNTIL I REACHED THE FIRESTONE.   *TR",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560244,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FAILS.  DEALER REPORTS STEERING TORQUE SENSOR HAS FAILED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "09/30/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551824,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE OF MONTHS AGO MY STEERING WHEEL BEGAN MOVING ON ITS OWN TRYING TO GET BACK LEFT - SHAKING UNCONTROBALLY.  THE PEDAL BEGAN GETTING VERY STIFF AND WOULD NOT ALLOW ME TO PRESS ON IT FOR GAS IN ORDER TO MOVE.  WHEN I CUT THE CAR OFF AND CUT IT BACK ON THE ISSUE GOES AWAY.  SOMETIMES IT TAKES THE CAR A FEW TIMES TO GET GOING.  MEANING I HAVE TO CUT IT OFF AND ON SEVERAL TIMES.  THE WHEEL CONTINUES TO SHAKE ALTHOUGH THE CAR IS NOT ON.  I INITIALLY THOUGHT IT WAS AN ELECTRICAL PROBLEM SO I TOOK IT TO BE SERVICED BUT EVERYTHING WAS OK.  RECENTLY (FOR THE LAST TWO WEEKS) THE CAR'S STEERING HAS GOTTEN WORSE AS IF THERE IS NO POWER STEERING IN THE CAR.  WHICH WILL NOT ALLOW ME TO TURN THE VEHICLE AT ALL.  WHILE IT RUNS I CANNOT STEER MAKING IT VERY DANGEROUS TO DRIVE.  I TOOK IT TO THE MAZDA DEALER TO GET ANOTHER DIAGNOSTIC TEST AND WAS TOLD THAT THE STEERING COLUMN WAS DEFECTED AND NEEDED TO BE REPLACED.  I AM IN AWE THAT A CAR SO NEW HAS THIS MANY MAJOR MECHANICAL ISSUES.  I NOW HAVE NO OTHER OPTION BUT TO GET THE STEERING COLUMN REPLACED AS I AM TOLD THIS IS HTE ONLY THING THAT WILL FIX THE STEERING ISSUE.  *TR",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/25/2013",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537119,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON COLD MORNINGS THE GAS PEDDLE STICKS AND WON'T PRESS DOWN UNTIL THE CAR WARMS UP COMPLETELY.  SOMETIMES TAKES ALONG AS 15 MINUTES TO WARM UP ENOUGH TO ENGAGE THE GAS PEDDLE.  AND SOMETIMES AFTER DRIVING THE CAR FOR SEVERAL MILES (AS MANY AS 15 MILES) THE GAS PEDDLE STICKS AGAIN AND NO GAS IS BEING SUPPLIED.  I'VE HAD TO JUST COAST OFF THE ROAD AND PAT THE GAS PEDDLE UNTIL IT BREAKS LOOSE.  *TR",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523662,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE INTERMITTENTLY FAILED TO START. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTICS, WHO STATED THAT THE KEY WAS NOT REACHING THE IGNITION. THE VEHICLE WAS REPAIRED. THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE FAILURE MILEAGE WAS 90,000. THE CURRENT MILEAGE WAS 96,418   UPDATED 8/12/13 *CNN",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/09/2013",
        "dateOfIncident": "02/22/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515904,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON A TWO-LANE HIGHWAY GO APPROX. 55 MPH ON OUR WAY TO A VOLLEYBALL TOURNAMENT WHEN WITHOUT WARNING THE POWER STEERING STOPPED WORKING THEN THE VEHICLE PULLED HARD TO THE LEFT. WE PULLED OVER, SHUT THE ENGINE OFF, AND RESTARTED IT TO SEE IF IT WOULD RETURN TO NORMAL. UPON RESTART THE STEERING WHEEL WOULD SHAKE AND VIBRATE AT IDLE AND WHILE MOVING. THEN THE POWER STEERING WOULD GO OUT AGAIN AND THE PATTERN WOULD START OVER.  *TR",
        "vin": "4F2CZ92Z28K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514493,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE ACCELERATOR AND BRAKES FAILED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS WHERE IT WAS ADVISED TO THE CONTACT THAT THE THROTTLE CABLE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000. THE VIN WAS NOT AVAILABLE.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/23/2013",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505065,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING HAS FAILED THREE TIMES, TWICE FOR ME AND ONCE FOR MY WIFE.  ALL THREE INCIDENTS OCCURRED WHEN THE ENGINE WAS FIRST STARTED, ALTHOUGH I DID DRIVE IT THE FIRST TIME WITH VERY GREAT EFFORT THINKING IT WAS A PERMANENT FAILURE AND I NEEDED TO GET IT HOME.  AFTER RESEARCHING THIS VEHICLES SISTER FORD ESCAPE I FIND THIS IS A COMMON PROBLEM.    IT APPEARS IN MY CASE THIS IS A SWITCH PROBLEM IN THE IGNITION.  ALL THE CASES OCCURRED WHEN THE STEERING WAS LOCKED HARD AGAINST THE COLUMN LOCK ON PARKING.  TURNING THE ENGINE OFF AND RESTARTING THE ENGINE WITH THE LOCK IN A FREER POSITION RESULTED THE POWER STEERING WORKING.  I HAVE ON SOME OCCASIONS NOTED THE STEERING 'TWITCHING' ON THE ROAD LIKE THE POWER STEERING DID NOT HAVE A COMPLETE CONNECTION.  THE REASON THAT THIS FAILURE IS SO CONCERNING IS;  I HAVE DRIVEN VEHICLES WITHOUT POWER STEERING AND  WHEN CONVENTIONAL HYDRAULIC POWER STEERING FAILED.  THOSE INSTANCES ARE MERELY ANNOYING, WITH THE DESIGN OF THE ELECTRIC POWER STEERING THE EFFORT NEEDED TO STEER THE VEHICLE WITH NO POWER STEERING IS GREATLY MAGNIFIED.  YOU NOW MUST OVERCOME THE EXTRA STEERING EFFORT PLUS TURN A WORM GEAR DRIVEN MOTOR BACKWARDS.  I AM A STRONG MAN AND IT TOOK GREAT EFFORT AND WAS EXTREMELY SLOW AT TURNING THE VEHICLE.  MANY WOMEN AND SOME WEAKER MEN WOULD NOT BE ABLE TO STEER THE VEHICLE IN A FAILURE AND IF AN ON THE ROAD FAILURE MAY NOT GET THE VEHICLE SAFELY OFF THE ROAD.  I WILL CONTINUE TO MONITOR MY VEHICLE TO TRACE THE CAUSE OF THE FAILURE, FORDS CURE OF REPLACING THE STEERING COLUMN MAY BE OVERKILL.",
        "vin": "4F2CZU2Z98K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503746,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE ACCELERATING FROM A STOP, THE ACCELERATOR PEDAL BECAME HARD TO DEPRESS. THE FAILURE RECURRED SPORADICALLY AND ON ONE OCCASION, THE VEHICLE BECAME RESISTANT TO ANY ACCELERATION ATTEMPTS. THE VEHICLE WAS TOWED TO THE DEALER BUT WAS NOT INSPECTED BY A DEALER OR AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 94,055.  *TR",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2013",
        "dateOfIncident": "03/09/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503638,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO GET ICE CREAM SHUT OFF THE VEHICLE AND WHEN THE VEHICLE WAS RESTARTED THE POWER STEERING WAS NOT WORKING I CHECKED THE FUSES THEY WERE ALL FINE DROVE HOME WITHOUT POWERSTEERING THE NEXT DAY THE VEHICLE WAS STARTED THE STEERING IS NOW WORKING BUT THE STEERING WHEEL RATTLES RIGHT TO LEFT UNLESS YOUR TURNING AND CONTINUES TO RATTLE WHEN THE VEHICLE IS TURNED OFF. THE STEERING OPERATION IS INTERMITTENT WHEN STARTING THE VEHICLE, WHEN IT DOESN'T WORK YOU HAVE TO START IT AND TURN THE STEERING WHEEL TO THE RIGHT THEN IT WILL WORK. THE STEERING WHEEL ALSO WANDERS WHEN DRIVING SIMILAR TO A WORN OUT TIE ROD BUT ONLY WHEN THE STEERING IS WORKING. MILEAGE IS 52354.  *TR",
        "vin": "8KM10782"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502993,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: I1320536A. 2008 MAZDA TRIBUTE. CONSUMER STATED THESE CARS HAVE POWER STEERING CONTROL ISSUES. *LN  THE CONSUMER STATED THE POWER STEERING CONTROL MODULE, AN INTEGRAL PART OF THE NEW ELECTRONIC POWER ASSIST STEERING SYSTEM CAN MALFUNCTION WITHOUT WARNING AND THE LEAVE THE DRIVER WITHOUT STEERING.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2013",
        "dateOfIncident": "01/29/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499277,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, THE STEERING WHEEL SHOOK VIOLENTLY AND BECAME DIFFICULT TO MANEUVER. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THERE WAS A FAILURE WITH THE CHARGING UNIT AND REPLACED THE BATTERY. AFTER THE BATTERY WAS REPLACED, THE FAILURE CONTINUED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "4F2CZ96168K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498303,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS NOW MY STEERING HAS GRADUALLY BEEN DISPLAYING STIFF STEERING. IT HAS PROGRESSED AND WAS UNSURE WHY IT WAS DOING THIS BEING THAT IT HAS NOT GIVEN ME ANY PROBLEMS BUT THE STEERING.  I HAVE BEEN DRIVING AND IT HAS GOTTEN STIFF. I WILL TURN OFF THE CAR AND RESTART AND IT WILL DRIVE NORMAL AND THEN EVENTUALLY WILL STIFFEN UP ON ME AGAIN AND AGAIN.  THIS IS VERY SCARY BEING THAT I HAVE ALSO BEEN ON THE FREEWAY AND EXITING AND HAVE TO GRAB AHOLD OF THE STEERING TO VEER OFF THE FREEWAY CAREFULLY. IT IS STRESSFUL TO BE IN A CAR THAT IS UNSAFE WHILE ON THE ROAD. GOD FORBID I HAVE TO SWERVE AWAY FROM DANGER AND I CAN'T BECAUSE I'M IN A DANGEROUS VEHICLE.  I AM STILL PAYING ON MY CAR AND DON'T CARE FOR A DISPOSABLE CAR WHILE STILL MAKING PAYMENTS.  I CONTACTED MAZDA IN VICTORVILLE, CA AND STATED THAT IT WOULD COST ME  (YOU READY) $ 2,000.00 PLUS ANOTHER FEW HUNDRED TO PROGRAM MY KEYS.  ABSURD!!! MY HUSBAND MADE CONTACT WITH SOMEONE WHO GAVE HIM A PRICE OF $1500.00 AND A LOCAL ECOLOGY CENTER PRICED AT $300-400. NOW THAT'S ON A PART I RISK PURCHASING AND THEN THE SAME THING HAPPENING AGAIN!!  THIS LOCAL JUNK YARD STATED THAT THIS IS A VERY TYPICAL PROBLEM THEY HAVE HAD WITH MAZDA'S COMING IN.  I CALLED MAZDA TO FIND OUT IF THERE WAS A RECALL ON THIS PROBLEM.  NOT!!  IT IS A SAFETY PROBLEM AND A RECALL PROBLEM!  I'M STILL PAYING ON MY CAR!!  THIS IS A FINANCIAL HARDSHIP.  PLEASE DO SOMETHING. *TR",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "02/09/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497781,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE POWER STEERING FAILED. THE VEHICLE WAS TAKEN TO A MECHANIC WHO INSPECTED THE FAILURE AND STATED THAT THE STEERING COLUMN NEED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED AND OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 80,100.",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/26/2012",
        "dateOfIncident": "11/21/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486067,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WENT FROM LEAVING MY DRIVEWAY ONTO THE ST WE LIVE ON I HAD NO PWER STEERING SO I CONTINUED TO GO TO THE MECHANIC AND WAS VERY LUCKY AS WHEN I WENT TO MAKE A RIGHT TURN COULDN'T STEER IT, HARD TO AND HARDLY STEER AT ALL, ENDED UP ON THE LEFT SIDE OF A MAIN ST AND SHOULD HAVE BEEN ON THE RIGHT, THIS WAS A VERY SCARY EXPERIENCE AND DON'T KNOW WHY MAZDA HASN'T PUT A RECALL ON THE TRIBUTE THEY KNOW THERE IS THE SAME PROBLEM WITH MAZDA 3 & 5 MODELS, AS I KNOW OF ANOTHER PERSON WHO HAD THE SAME PROBLEM WITH THEIR TRIBUTE 2008!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/16/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485144,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE TRYING TO COMPLETE A TURN, THE STEERING WHEEL SEIZED AND BECAME DIFFICULT TO TURN. THE CONTACT SHUT OFF AND RESTARTED THE VEHICLE AS IT BEGAN TO FUNCTION NORMALLY. THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE AND WAS LATER TAKEN TO A PRIVATE MECHANIC WHERE THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE. THE FAILURE AND CURRENT MILEAGE WAS 83,000. UPDATED 01/09/13*LJ UPDATED 1/11/2013 *JS",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2012",
        "dateOfIncident": "09/11/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483303,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOWER STEERING UNIVERSAL JOINT AND 2 INNER TIE RODS 1 OUTER WERE ALL FOUND TO CONTRIBUTE TO POOR ALIGNMENT-THE STEERING U-JOINT WAS IMPROPERLY INSTALLED[MAZDA] WHEN NEW --AS THE JOINT WAS SUPPOSED TO MOVE FREELY  IN 4 DIRECTIONS FLUIDLY--BUT, WHEN REMOVED IT WAS FROZEN;----AND U- JOINT MOVEMENT WASN'T POSSIBLE  IN TWO POINTS OR DIRECTION ; I.E. FOUND LOOSE -NOT GREASED--LEADING TO SLACK AND FAILURE OF THE OTHER NAMED PARTS--WHICH CAUSED EXCESSIVE SLACK OVERALL IN STEERING WHEEL! OVERALL THE WARRANTY --WAS WORTHLESS AND COSTS 2500.00 OF SELL PRICE-SO BETWEEN THESE FAILURES AND A PREVIOUS REPORT WE'VE SPENT OVER 2500.00 ON REPAIRS THAT SHOULD HAVE BEEN ON MAZDA--THESE ARE REPAIRS THAT WERE SUPPOSEDLY COVERED BY WARRANTY!  *TR",
        "vin": "4FZCZ02Z78K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/03/2012",
        "dateOfIncident": "10/03/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478476,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS PARTIALLY REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER 12V357000 (VEHICLE SPEED CONTROL:CABLES). THE DEALER ONLY HAD CERTAIN PARTS AVAILABLE FOR THE REPAIRS AND THE REMAINING PARTS WOULD NOT BECOME AVAILABLE UNTIL LATE OCTOBER 2012. THE CONTACT STATED THAT THE REPAIR TIME HAD EXCEEDED THE A REASONABLE TIME FRAME AND STATED THAT NOT HAVING THE SPEED CONTROL COMPONENT REPAIRED WAS A SAFETY ISSUE. THE MANUFACTURER WAS CONTACTED. THE CONTACT HAD NOT EXPERIENCED ANY FAILURES WITH THE VEHICLE.",
        "vin": "4F2CZ06178K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2012",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476863,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT HE ATTEMPTED TO ACCELERATE FROM A COMPLETE STOP BUT THE VEHICLE WOULD NOT RESPOND. THE CONTACT HAD TO FULLY DEPRESS THE ACCELERATOR PEDAL AS VEHICLE SURGED ABRUPTLY BEFORE FINALLY ACCELERATING. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE FAILURE WAS CAUSED BY CARBON BUILD-UP ON THE THROTTLE BODY. THE REMEDY WAS THE REPLACEMENT OF THE THROTTLE BODY HOWEVER, THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 15,000. THE CURRENT MILEAGE WAS 68,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "09/16/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475911,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE NOW HAD TO REPLACE 3 WINDOW REGULATORS.  (3 DIFFERENT DOORS.)  NO WARNING THAT THERE IS AN ISSUE WITH WINDOW.  1 TIME WE WERE DRIVING WHEN WINDOW JUST DROPPED OPEN.  WE LIVE IN FLORIDA AND RARELY USE THE WINDOWS AT ALL.  THE 2 BACK WINDOWS FAILED WITHIN A 2 WEEK PERIOD.  *TR",
        "vin": "4F2CZ02Z08K"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2012",
        "dateOfIncident": "07/28/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470337,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK THE VEHICLE TO THE LOCAL FIRESTONE STORE FOR SERVICE TO HAVE THE TRANSMISSION FLUID CHANGED AND FLUSHED AND THEY TOLD ME THAT THE TRANSMISSION COOLER WAS LEAKING AND THIS WAS A COMMON PROBLEM WITH THE 2008 MAZDA TRIBUTE AND FORD ESCORT AND THE ONLY WAY TO FIX IT WAS TO REPLACE THE ENTIRE RADIATOR BECAUSE THEY WERE BUILT INTO THE SAME PART.  THEY TOLD ME $550 MIN. TO REPLACE.  I THEN DID SOME ONLINE RESEARCH AND WENT TO THE LOCAL MAZDA DEALER.  THEY SAID IT WAS A COMMON PROBLEM AND THAT MAZDA HAD A PROGRAM TO FIX THIS BUT THE DATE WAS UP AND THAT THERE WAS NOTHING TO DO BUT PAY TO FIX IT.  THE MAZDA DEALER SAID $1100 TO FIX IT.  I WENT NUTS AND TOLD THEM THIS WAS A RIP-OFF.  THEY SAID THEY WOULD CALL MAZDA TO SEE IF THEY WOULD DO ANYTHING TO HELP WITH THE COST SINCE THIS WAS A KNOWN PROBLEM AND THERE WAS A PROGRAM TO FIX IT FOR CUSTOMERS.  THEY CALL BACK LAST THURSDAY TO TELL ME THAT MAZDA WAS NOT INTERESTED IN HELPING IN ANYWAY AND REJECTED THE REQUEST.  I TOLD THEM THIS WOULD MAKE THE DECISION FOR ME ON BUYING A FOURTH MAZDA.  I'M A REPEAT CUSTOMER AND THEY DIDN'T EVEN ASK THAT INFORMATION PRIOR TO MAKING A DECISION.  THE IS A BAD PROBLEM WITH THESE VEHICLES AND MAZDA NEEDS TO STEP UP AND FIX IT!!!  *TR",
        "vin": "4F2CZ02Z28K"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2012",
        "dateOfIncident": "02/20/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468148,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM A STOP SWITCHING TO GAS PEDAL OR ACCELERATOR THE PEDAL STICKS AND HARD TO PRESS AND DOES IT BACK TO BACK FOR A FEW MINUTES. ALSO IT CAN DO IT AT RANDOM AFTER DRIVING FOR AWHILE AND STOP AT A LIGHT IT WILL STICK WHEN TRYING TO GO. ONCE IT STOPS STICKING I HAVE TO QUICKLY HIT THE BRAKES TO NOT CAUSE OVER ACCELERATION.  *JS",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "07/20/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467072,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE WAY HOME AT 45MPH AND THE PEDAL STUCK TO THE FLOOR. I PULL ON SIDE OF THE ROAD AND HIT THE BRAKE PUT IN PARK. AFTER FEW MINUTE I TRIED TO HIT THE PEDAL AND IT COME BACK .THIS IS JUST NOT ACCEPTABLE IF I HAVE MY KIDS WITH ME AND I WILL BE STUCK IN THE MIDDLE OF THE BUSY ROAD. THIS SHOULD BE TAKEN CARE OF BY MAZDA AS THIS CALL SO MUCH DANGER TO THE PUBLIC.    THANKS.  *TR",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462525,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION OIL LEAKING FROM TRANSMISSION COOLER.  *TT",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2012",
        "dateOfIncident": "05/31/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461175,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING STEERING WHEEL A LOUD CLUNK NOISE IS APPARENT AND STEERING FEELS DISCONNECTED FROM VEHICLE WHILE DRIVING.  *TR",
        "vin": "4FACZ92ZX8K"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/18/2012",
        "dateOfIncident": "05/17/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458905,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOCK ISSUE - HATCHBACK AND BACK WINDOW ONLY    THIS IS AN ISSUE THAT I HAVE ALWAYS HAD, AND IT IS A PAIN IN THE NECK.  THE HATCHBACK DOOR OR WINDOW WILL NOT OPEN USING EITHER THE REMOTE OR THE DOOR UNLOCK BUTTON IN THE CAR.  AFTER HAVING GROCERIES IN THE BACK, PIZZA, MATERIAL BEING MOVED, ETC. ONE HAS TO DO THE FOLLOWING TO ACCESS THAT AREA OF THE VEHICLE:  1.)  CLIMB OVER THE SEAT - MANY TIMES NOT POSSIBLE TO REALLY GET AT ITEMS IN THE BACK.  2.)  WAIT ABOUT 5 MINS OR SO, AND THEN THE REMOTE WILL UNLOCK THE DOOR/WINDOW.  3.)  DISCOVERED THAT PUTTING THE KEY BACK IN AND TURNING IT TO ACCESSORY AND THEN REMOVING THE KEY, THE DOOR/WINDOW CAN BE UNLOCKED.  NOT SURE WHAT THE STORY IS OR EXACTLY WHAT STEPS MUST BE DONE FOR THIS ISSUE TO OCCUR, BUT IT OCCURS OFTEN.  USUALLY THE SEQUENCE IS, SHUT THE CAR ENGINE OFF, REMOVE THE KEY, SHUT OFF THE CARS LIGHTS, THEN TRY TO ACCESS THE BACK WITH THE REMOTE.  WHEN THAT DOESN'T WORK, TRY OPENING THE CAR DOOR AND UNLOCKING ALL THE DOORS AGAIN.  THIS WON'T WORK EITHER.  TRY LOCKING THE VEHICLE AGAIN USING THE REMOTE AND TRY OPENING UP THE DOORS AND THE BACK.  I BELIEVE THAT THE 'DOORS' WILL UNLOCK AT ALL TIMES, BUT NOT THE BACK OR THE BACK WINDOW.    REALLY A PAIN......AND EMBARRASSING TO HAVE PEOPLE WATCH YOU TRY TO GET INTO THE BACK OF THE CAR, WHEN THERE SHOULD BE NO PROBLEM.  *TR",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458851,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE ROAD, THE POWER STEERING FAILED IN THE MIDDLE. THERE WAS NO POWER TO THE STEERING ET ALL. PULLED OVER, STOPPED THE CAR AND RESTARTED IT WENT AWAY. DROVE COUPLE OF MORE MILES, AGAIN WHEN THE CAR WENT BACK TO DRIVE ON BATTERY POWER THE POWER STEERING FAILED AGAIN.HAD TO STOP AND RESTART AGAIN. THE \"WRENCH\" SYMBOL CAME ON THE DASHBOARD. TOOK IT TO THE MECHANIC , HE SAID THE CODE SHOWS POWER STEERING MODULE INSIDE THE STEERING IS \"BAD\", CHECKED WITH MAZDA AND THEY SAID THERE IS NO RECALL ON POWER STEERING FOR MAZDA TRIBUTE , BUT ONLY TO MAZDA 3 AND 5.  *TR",
        "vin": "4F2CZ49HX8K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2012",
        "dateOfIncident": "04/20/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456308,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OTHERS HAVE REPORTED, I COULD NOT DEPRESS THE ACCELERATOR.  IT WAS STUCK.  THIS HAPPENED ABOUT 3 TIMES DURING A DRIVE CROSS COUNTRY.  IT REALLY WASN'T THAT COLD - IN THE 40S OR 50S.  NO MATTER HOW HARD I PRESSED (WHILE THE CAR WAS RUNNING AND IN NEUTRAL), IT WOULDN'T GO DOWN.  FINALLY AFTER TRYING IT A NUMBER OF TIMES, I COULD DEPRESS THE ACCELERATOR AND DRIVE.  THIS IS VERY DANGEROUS, AS ONE IS TRYING TO TURN INTO TRAFFIC AND NOTHING HAPPENS OTHER THAN ROLLING FORWARD SINCE THERE IS NO ACCELERATION.  THIS SHOULD BE A MAJOR RECALL TO REPAIR THIS ISSUE!!!!  *TR",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2012",
        "dateOfIncident": "04/09/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454915,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL GETS STUCK IN PARTIAL ACCELERATION POSITION DURING ACCELERATION AND WILL NOT PRESS DOWN FURTHER PAST PARTIAL TO FULL ACCELERATION DURING COLD MORNINGS TO ACCELERATE FASTER (LESS THAN 35 DEGREES FARENHEIT). PEDAL TYPICALLY WORKS FINE AFTER VEHICLE WARMS UP. RELEASING PRESSURE FROM PEDAL USUALLY ALLOWS PEDAL TO RETURN TO REST/NOMINAL POSITION FOR NEXT ATTEMPT TO PRESS DOWN TO ACCELERATE. SOMETIMES IT IS STUCK AGAIN SOMETIMES IT WORKS.  *TR",
        "vin": "4F2CZ92Z28K"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2012",
        "dateOfIncident": "07/08/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453509,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT TRANSMISSION FLUID WAS LEAKING FROM THE FRONT OF THE VEHICLE. THE CONTACT STATED THAT HE BELIEVE THAT THE TRANSMISSION COOLER WAS CRACKED AND CAUSING THE LEAK. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 90,000 AND THE CURRENT MILEAGE WAS 108,000.  UPDATED 05/08/12*LJ  THE CONSUMER ALSO STATED THE FRONT WHEEL BEARINGS WERE NOISY, AND HAD BEEN SINCE THE DAY THE VEHICLE WAS PURCHASED AND THE OUTER TIE RODS NEEDED TO BE REPLACED. UPDATED 05/30/12",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/28/2011",
        "dateOfIncident": "12/28/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441529,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY MAZDA TRIBUTE NEW IN 2007.  THIS PROBLEM STARTED IN 2010 IN THE WINTER.  FROM TIME TO TIME, THE GAS PEDAL WOULD STICK IN THE UPRIGHT POSITION, USUALLY WHEN ACCELERATING FROM A FULL STOP, BUT SOMETIMES DRIVING IN TRAFFIC.  THE PAST FEW WEEKS, MY SON HAS BEEN DRIVING THE CAR AND HAS NOTICED THE STICKING PEDAL SITUATION ALSO.  I HAD ASKED THE DEALERSHIP PREVIOUSLY TO CHECK THIS OUT, BUT THEY SAID THEY COULD NOT GET THE PEDAL TO STICK WHEN THEY DROVE IT.  I AM TAKING IT BACK IN TOMORROW AND LEAVING IT SO THEY CAN TEST IT AFTER IT IS COLD FOR A WHILE.  THIS IS VERY DANGEROUS.  I HAVE HAD PROBLEMS WHEN STOPPED TO MAKE A LEFT TURN, AND THEN TRYING TO ACCELERATE TO MAKE THE TURN.  SO FAR I HAVE BEEN LUCKY, BUT LEFT TURNS AFTER A FULL STOP ARE SCARY TO SAY THE LEAST.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2011",
        "dateOfIncident": "12/04/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440012,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GAS PEDAL KEEPS STICKING ON OCCASION WHEN IN IDLE OR SLOW DRIVING. I NEED TO PRESS THE GAS PEDAL HARDER TO GET IT FROM BEING STUCK AND THEN MY VEHICLE LUNGES FORWARD.  CALLED FOR A SERVICE APPOINTMENT.  *TR",
        "vin": "4F2CZ02ZX8K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2011",
        "dateOfIncident": "10/30/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433564,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE CABLE WAS JAMMED IN THE IDLE POSITION, AND THE CAR WOULD NOT GO FORWARD AFTER BACKING OUT OF THE DRIVEWAY AT IDLE, I HAD TO PULL THE CAR BACK INTO THE DRIVEWAY WITH ARE 2ND CAR TO LET TRAFFIC GO BY AS ARE DRIVEWAY IS ON A SLIGHT INCLINE, THIS COULD HAVE BEEN A REAL PROBLEM IF MY WIFE HAD NOT BEEN HOME TO HELP STEER ONE OF THE CARS OR IF SOMEONE HAD COME SPEEDING DOWN THE ROAD AND NOT SEEN IT CROSSWAYS OF THE ROAD.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2011",
        "dateOfIncident": "10/29/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433521,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL WOULD NOT COMPRESS, STUCK FOR SEVERAL MINUTES IN THE UPRIGHT POSITION.  COULD NOT ACCELERATE ONTO THE HIGHWAY.  HAD TO COAST SLOWLY ONTO SHOULDER OF THE ONRAMP IN HEAVY TRAFFIC.  TURNING THE CAR OFF AND BACK ON DID NOT FIX THE PROBLEM. TRIED FOR SEVERAL MINUTES TO COMPRESS, FINALLY IT BECAME UNSTUCK ON ITS OWN.  HAPPENED AGAIN APPROACHING TRAIN TRACKS, GOT STUCK ON THE TRACKS WITH NO ACCELERATION, LUCKILY IT WAS ONLY FOR A FEW SECONDS THIS TIME.  VERY UNSAFE.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/28/2011",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427778,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT ATTEMPTED TO OPEN THE FRONT DRIVERS SIDE WINDOW, BUT HE WAS UNABLE TO ROLL IT DOWN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CONTACT WAS INFORMED THAT THE WINDOW MOTOR FAILED. THE VEHICLE WAS NOT REPAIRED, BUT THE DEALER PERMANENTLY FASTENED THE WINDOW SO THAT IT REMAINED CLOSED. THE FAILURE RECURRED ON BOTH REAR WINDOWS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 40,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/02/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423060,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT DOOR WILL NOT UNLOCK OR OPEN.  *TR",
        "vin": "4F2CZ92Z48K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403028,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKS ON ACCELERATION. MOSTLY HAPPENS ON COLD MORNINGS AND WHEN SHIFTING FROM LOW TO HIGH SPEEDS. I DON'T FEEL SAFE DRIVING THIS VEHICLE AND IT SHOULD BE A MAZDA RECALL. I HAVE CONTACTED MY LOCAL MAZDA DEALERSHIP AND WAS TOLD THEY NEVER HEARD OF SUCH AN ISSUE. AFTER DOING SOME INTERNET RESEARCH IT APPEARS THE GAS PEDAL IS THE NUMBER ONE ISSUE WITH THE 2008 MAZDA TRIBUTE. ALSO WHEN CONTACTING THE DEALERSHIP THEY INFORMED ME MY WARRANTY EXPIRED THE DAY BEFORE AND REFUSED TO LOOK AT CAR WITHOUT CHARGING ME.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "FUEL SYSTEM, OTHER,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2011",
        "dateOfIncident": "03/12/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390474,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION ISSUE. THROTTLE CABLE SNAPPED AT THE FIREWALL NEAREST TO THE GAS PEDAL, SO I WAS UNABLE TO ACCELERATE AND HAD TO COAST TO THE SHOULDER OF THE EXPRESSWAY.  *TR",
        "vin": "4F2CZ96188K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "02/26/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389751,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT WHEN DRIVING AT ANY SPEED, THE VEHICLE WOULD JERK ABNORMALLY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THAT TRANSMISSION COOLANT WAS LEAKING AND CAUSING THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 21,590.",
        "vin": "4F2CZ06118K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "11/02/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379974,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT STATED THAT THE ACCELERATOR PEDAL WAS STUCK AND WOULD NOT DEPRESS WHEN THE CONTACT ATTEMPTED TO ACCELERATE FROM A STOP. AFTER APPLYING HEAVY PRESSURE TO THE PEDAL, THE VEHICLE BEGAN TO ACCELERATE. THE FAILURE OCCURRED INTERMITTENTLY DURING COLD WEATHER. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THIS WAS A KNOWN FAILURE AND THE THROTTLE BODY ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 28,000 AND THE CURRENT MILEAGE WAS 33,000.",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2011",
        "dateOfIncident": "01/17/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376929,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE GAS PEDAL STICKS.  THIS HAS HAPPENED ON SEVERAL OCCASIONS EVEN WHEN HAVING TO ACCELERATE.  MY VEHICLE JERKS FORWARD WHEN I HAVE TO PRESS THE PEDAL HARD TO GET MY VEHICLE TO MOVE.  IT IS UNCOMFORTABLE AND YET SCARY WHEN DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376398,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 5 MPH AND DRIVING IN REVERSE, THE POWER STEERING STOPPED FUNCTIONING. THE FAILURE OCCURRED NUMEROUS TIMES. THE LAST TIME THE FAILURE OCCURRED, THE CONTACT WAS DRIVING ON THE  HIGHWAY AND THE POWER STEERING STOPPED WORKING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THE POWER STEERING MOTOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 88,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/27/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372471,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE, APPROX, 72,000 MILES. THE GAS PEDAL STICKS IN COLD WEATHER. WE LIVE IN THE BATON ROUGE AREA SO IT DOESN'T GET COLD OFTEN, BUT THE LAST FEW DAY'S WE'VE HAD LOWS IN THE 20'S AND THE GAS PEDAL HAS A STICKING ISSUE. IT'S HARD TO PRESS AND WHEN IT FINALLY DOES THE VEHICLE LUNGES FORWARD. WE HAD THIS SAME ISSUE LAST YEAR WHEN IT ALSO GOT ABNORMALLY COLD FOR THIS AREA.  *TR",
        "vin": "4F2CZ02Z48K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "10/10/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369339,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 MAZDA TRIBUTE THAT HAS A STICKING ACCELERATOR, ESPECIALLY WHEN THE WEATHER IS COLD. EVEN AFTER THE CAR IS WARM THE ACCELERATOR WILL SOMETIMES STICK AND WILL NOT ALLOW THE VEHICLE TO ACCELERATE. TODAY AFTER DRIVING THE VEHICLE ABOUT FIVE MILES IT WOULD NOT ACCELERATE WHEN I TRIED TO GET ON THE INTERSTATE. THIS HAS BEEN GOING ON THAT I HAVE NOTICED FOR ABOUT A YEAR. IT FIRST HAPPENED OCTOBER 2009.  *TR",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369373,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR BECAME STIFF ON COLD MORNINGS.  ACCELERATOR CABLE CLIP BROKE, TRIBUTE WOULD NOT ACCELERATE AT ALL. (FELL TO FLOOR)  CLIP REPLACED, STILL STICKING. TAKING BACK TO DEALERSHIP TO SEE WHAT ELSE IS GOING ON.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366249,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 MAZDA TRIBUTE HAS ABOUT 68,500 MILES. THE GAS PEDAL STUCK, AT INTERVALS, ALL THROUGH MY DRIVE BACK HOME FROM MY PARENTS. IT IS ABOUT A 25 MILE DRIVE ON THE HIGHWAY. THE PEDAL BECAME STUCK ONCE I DEPRESSED IT. IN ORDER TO ACCELERATE, I HAD TO PRESS ON THE PEDAL WITH ABNORMAL FORCE. THE CAR WOULD JERK FORWARD ONCE THE PEDAL BECAME UNSTUCK AND I WAS ABLE TO ACCELERATE AGAIN. THIS IS NOT THE FIRST TIME THAT MY 2008 MAZDA TRIBUTE DOES THIS. IT DID A WHILE BACK WHEN MY CAR HAD ABOUT 30,000 MILES. IT DID IT TWO TIMES. HOWEVER, IT NEVER DID IT AGAIN UNTIL TODAY, 11-14-2010. THIS TIME, HOWEVER, THE PEDAL GOT STUCK WELL OVER 10 TIMES. THE CAR WOULD DECELERATE WHILE I USED MORE AND MORE FORCE ON THE GAS PEDAL UNTIL THE PEDAL GAVE AND I WAS ABLE TO ACCELERATE AGAIN. I HAD MY WIFE AND CHILDREN IN THE CAR. I DID NOT FEEL SAFE DRIVING THE SUV. DOING RESEARCH ON THE NET AND ON THE NHTSA THIS SEEMS TO BE A PROBLEM WHICH IS HAPPENING TO AN ABNORMAL NUMBER OF 2008 MAZDA TRIBUTES THROUGHOUT THE USA. WHY HASN'T MAZDA DONE A RECALL? WHY HASN'T THE NHTSA ORDERED A RECALL? THIS IS VERY DANGEROUS!",
        "vin": "4F2CZ02Z98K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365709,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA TRIBUNE. THE CONTACT WAS DRIVING 45 MPH WHEN THE ACCELERATOR PEDAL BECAME STUCK IN THE OPEN THROTTLE POSITION. THE VEHICLE WAS TOWED TO THE DEALER WHO ADVISED THAT THERE WERE NO DEFECTS FOUND WITHIN THE ACCELERATOR PEDAL. THE DEALER ALSO ADVISED THAT THE ACCELERATOR CABLE COULD BE REPLACED AT THE CONTACTS EXPENSE. THERE WERE NO RECALLS FOR THE FAILURE. THE MANUFACTURER WAS CONTACTED AND A COMPLAINT WAS FILED BUT NO ASSISTANCE WAS OFFERED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 96,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2010",
        "dateOfIncident": "11/05/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364356,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL IS STICKING, NOT ALLOWING YOU TO ACCELERATE. MY WIFE AND I PURCHASED THIS CAR SO THAT OUR SON WOULD BE SAFE. IT HAS HAPPENED AT STOP SIGNS AND ON THE HIGHWAY GOING 65-70MPH. IT HAPPENED AROUND TEN SEPARATE OCCASIONS, MOSTLY IN THE MORNING. I WOULD HATE FOR MY FAMILY TO BE IN THE CAR WHEN SOMETHING WERE TO HAPPEN. WE WANT TO FIX THE PROBLEM BUT THIS SEEMS TO BE A CHRONIC ISSUE WITH THE MAZDA TRIBUTE. WE LOVE OUR CAR. CAN YOU PLEASE HELP? *TR",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350917,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE. CONSUMER STATES STEERING JOINT PROBLEM *TGW  THE CONSUMER WAS INFORMED THE STEERING JOINT HAD WORN OUT. THE DEALER FOUND THE STEERING COUPLER WAS COMING APART. THEREFORE, THE STEERING SHAFT WAS REPLACE. *JB",
        "vin": "4F2CZ96128K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/12/2010",
        "dateOfIncident": "09/14/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335994,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE ALWAYS MAINTAINED GOOD, FIRST WHEN DRIVING ON WET BRIDGES SUV TENDS TO GLIDE. THIS HAPPENS THE  TIME A BRIDGE IS WET. CAR IS NO LONGER UNDER WARRANTY AND IM SCARED THEY MIGHT OVERCHARGE ME. $100.0 JUST TO CHECK IT. ANOTHER PROBLEM IS THE FRONT BEARINGS IN THE FRONT HAD TO BE REPLACED, AND BRAKES MAKE A SWUSHING NOISE EVER TIME I APPLY THE BRAKES . IGNITION KEY HAS TO BE PUSH WHILE TURNING IT TO START CAR. TOOK IT TO MY MECHANIC AND HE SAYS THAT THE IGNITION SWITCH IS BAD. THIS CAR IS LACED WITH PROBLEMS PLEASE ADVISE FORD TO RECALL THIS SUV. IT WILL KILL PEOPLE , YOU DON'T WANT IT TO BE RAINING AND YOU SLAM YOUR BRAKES AND YOUR CAR SLIDES AND RUNS INTO PEOPLE. PLEASE ADDRESS THIS WITH FORD URGENTLY. THANK YOU    BTW WHEN YOUR BRAKING THE SEAT KIND OF FEELS LIKE ITS GOING FORWARD AND INCREASING SPEED KIND OF GOES BACK. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2010",
        "dateOfIncident": "05/12/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330239,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE STOPPED RUNNING AT HIGHWAY SPEED.  DANGEROUS TOTAL SHUT-OFF OF ENGINE WHILE DRIVING.  COULD NOT RE-START VEHICLE.  STARTER WOULD TURN ENGINE BUT ENGINE WOULD NOT START.  VEHICLE TOWED TO INDEPENDENT REPAIR SHOP.  SHOP RETRIEVED CODE P1260 \"ANTI-THEFT SYSTEM SIGNAL DETECTED - ENGINE DISABLED\".  MOST TOW VEHICLE TO MAZDA DEALER FOR SERVICE.  *TR",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "04/22/2010",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328794,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. WHILE TRAVELING AT 40 MPH, THE CONTACT CHANGED LANES TO PASS A VEHICLE BUT WHEN HE DEPRESSED THE ACCELERATOR PEDAL TO SPEED UP, THE PEDAL WENT TO THE FLOORBOARD AND THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE BUT THE ENGINE ONLY RACED UP AND DOWN WITH NO RESPONSE FROM THE ACCELERATOR PEDAL. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALERSHIP AND THE DEALER STATED THAT THE AIR FILTER AND FUEL CONTROL MODULE HAD BURNED OUT AND CAUSED THE FAILURE. THE CURRENT AND FAILURE MILEAGES WERE 25,185. UPDATED 07/22/10   *BF  UPDATED 09/23/10 *BF  UPDATED 09/24/10  THE CONSUMER NO LONGER OWNS THE VEHICLE. UPDATED 09/27/10",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326972,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL IS STICKY.  IT BECOMES VERY DIFFICULT TO PUSH, THEN WILL SUDDENLY RELEASE AND ALLOW YOU TO ACCELERATE.  HAPPENS EVERY MORNING, AND LASTS FOR ABOUT 5-10 MINUTES.  CONDITION IS WORSENING.  DEALER \"CLEANED THROTTLE BODY\", BUT IT DID NOT FIX THE PROBLEM.  I RETURNED THE VEHICLE TO THE DEALER WHO SAID THE THROTTLE BODY SHOULD BE REPLACED. MAZDA EXTENDED WARRANTY INITIALLY DENIED MY CLAIM FOR REPAIR STATING \"NOT A COVERED PART\".  HOWEVER, THEY NOW SAY IT IS A COVERED PART, BUT STILL HAVE NOT YET AGREED TO PAY FOR THE REPAIR.  I WAS TOLD THAT IF I PAY $100 THAT THE DEALER WOULD RUN SOME TYPE OF CLEANER INTO MY GAS TANK, BUT WITH NO GUARANTEE IT WOULD WORK.  THIS WOULD NOT BE COVERED BY MY EXTENDED WARRANTY.  A BADLY STICKING ACCELERATOR PEDAL SHOULD NOW BE CLASSIFIED AS A SAFETY CONCERN! *TR",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2010",
        "dateOfIncident": "03/14/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319571,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKS, PREVENTING YOU FROM ACCELERATING THE VEHICLE. SO WHEN DRIVING DOWN THE ROAD YOU MIGHT BE FINE, OR YOU COULD BE SITTING IDLE, UNTIL THE GAS PEDAL WILL FREE UP. THIS HAS PROBABLY HAPPENED 30 TIMES OR MORE. NEEDS TO BE RECALLED. ALSO AROUND 30,000 MILES THE PAINT STARTED COMING OFF ALL THE DOOR TRIM. *TR",
        "vin": "4F2CZ02Z78K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "03/07/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317865,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE:  ACCELERATOR STICKS IN THE UNACCELERATED POSITION.  HAVE HAD I FIXED BEFORE AND THE MECHANIC NEW EXACTLY WHAT THE PROBLEM WAS.  HE FIXES AT LEAST TWO A WEEK.  HE SAID THE THROTTLE CABLE RUNS THROUGH THE INTAKE AND IT ACCUMULATES GRIME UNTIL IT STICKS.  COSTS ME $75 BUCKS EVERYTIME.  ONE DAY MR MAZDA IS GOING TO BE SITTING INFRONT OF A CONGRESSIONAL HEARING EXPLAINING WHY A MOTHER AND HER KIDS COULDN'T GET OFF OF THE RXR TRACKS IN TIME.  BECAUSE HER PEDAL STUCK. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314105,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 MAZDA TRIBUTE AWD 4I GAS PEDAL STICKS IN COLD WEATHER AND SOMETIMES IN WARM WEATHER (EXACT PROBLEM COMPARED TO 2005 MODEL YEAR COMPLAINTS). IT HAPPENS USUALLY WHEN I GET INTO THE CAR ON A COLD MORNING AND HAVE NOT PROPERLY WARMED THE CAR UP. A FEW TIMES IT HAS HAPPENED ON THE HIGHWAY AFTER I HAVE FULLY TAKEN MY FOOT OFF THE GAS (SAY TO BRAKE) AND THEN RETURN MY FOOT TO THE GAS PEDAL. THE PEDAL WILL REFUSE TO PUSH DOWN EVEN WITH MY FULL BODY WEIGHT (240LB MAN) ON THE PEDAL. I FIND I HAVE TO JIGGLE MY FOOT AND STEP ON THE PEDAL MULTIPLE TIMES TO GET IT TO GO DOWN. A FEW TIMES I HAD TO PULL OVER AND PLAY WITH IT. EVERY TIME I GET IT TO THE DEALER, THE PROBLEM GOES AWAY AND THEY SAY THERE IS NOTHING THEY CAN DO FOR ME. MY MAIN CONCERN IS THAT ALL THE COMPLAINTS FROM THE 2005 MAZDA TRIBUTE ARE EXACTLY THE SAME AS WHAT I AM EXPERIENCING AND I AM WORRIED. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/14/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313875,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE. THE CONTACT TOOK OFF AND THE ACCELERATOR GOT STIFF AND STUCK. WHILE DRIVING 30 MPH, THE ACCELERATOR PEDAL BECAME STIFF, THE VEHICLE SURGED FORWARD AND NEARLY HIT ANOTHER VEHICLE. THE CONTACT  DID NOTIFY THE MANUFACTURER AND THEY INFORMED HIM THAT THERE WERE NO RELATED RECALLS. THE FAILURE MILEAGE WAS 42,000. THE CURRENT MILEAGE WAS 42,000.",
        "vin": "4F2CZ02Z18K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "02/16/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311928,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL OF MY VEHICLE STICKS WHEN IT IS FIRST DEPRESSED, AFTER SETTING IDLE AT TRAFFIC STOPS.  IT ALSO STICKS WHEN FIRST ACCELERATING THE VEHICLE ON MOST MORNINGS.  THIS HAS OCCURRED SEVERAL TIMES, AND HAS BECOME VERY FREQUENT.      THE MOST RECENT INCIDENT WAS ON TUESDAY, FEBRUARY 16, 2010. *TR",
        "vin": "4F2CZ02Z88K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/20/2010",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300482,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL STICKS.  YOU MUST PRESS GAS PEDAL ABNORMALLY HARD AND THEN WHEN IT GIVES THE CAR LUNGES FORWARD DANGEROUSLY AND UNEXPECTEDLY.    REQUIRES REPEATED THROTTLE BODY CLEANING.  DEALERSHIP RECOMMENDS REPLACING THE THROTTLE BODY EVERY TIME--A $130 PART. *TR",
        "vin": "4F2CZ02Z58K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/03/2010",
        "dateOfIncident": "01/03/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297888,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKING INTERMITTENTLY & HAS OCCURRED PREVIOUSLY   TYPICALLY DRIVING ON HIGHWAY AT 65-70MPH. NOT SOMETHING THAT  HAPPENS DAILY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2009",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297062,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2008 TRIBUTE (PURCHASED IN JULY 2007) FOR SERVICE WHEN AT THE 50, 300 MILES.  I REPORTED TO THE SERVICE DEPARTMENT THAT MY VEHICLE DOES A MILD OR HARD JERK WHEN COMING FROM A COMPLETE STOP.  IT WAS DISCOVERED THAT I HAD A SMALL HOLE IN THE CONDENSER CAUSING THE VEHICLE TO LOSE TRANSMISSION OIL.  I DO A LOT OF HIGHWAY DRIVING THUS THE HIGH MILEAGE SO THEY SURMISED THAT MAYBE A ROCK HIT IT.  I THOUGHT THIS WAS OUTRAGEOUS BECAUSE THIS VEHICLE WAS SUPPOSE TO BE DURABLE SINCE IT IS A SUV.  MY DRIVING IS NOT IN ROUGH TERRAIN JUST SMOOTH HIGHWAYS.  THE SERVICE DEPARTMENT POINTED OUT  TO ME THAT THE STYLE HAS THESE EXPOSED OR OPEN AREAS IN THE FRONT LOWER PART OF THE SUV SO BECAUSE THEY SAW A TINY ROCK EMBEDDED IN THE GRILL OF THE RADIATOR THAT POSSIBLY THIS IS WHAT HAPPENED TO THE CONDENSER.  I FELT IF I HAVE EXPOSED OR OPEN AREAS THEN THE PARTS EXPOSED SHOULD BE STRONG/DURABLE ENOUGH TO TAKE A ROCK HIT.  I HAVE NO FRONT IN DAMAGE AND I HAVE NEVER BEEN IN AN ACCIDENT.  A TRANSMISSION OIL LEAK WAS THE FARTHEST THING IN MY MIND, WHICH BY THE WAY WILL COST ME $580 TO FIX.  SINCE THIS DISCOVERY WAS ON 12/15/09, TEN DAYS FROM XMAS, I DID NOT HAVE IT FIXED.  MY FEAR IS THAT THERE ARE SUBSTANDARD PARTS THAT WERE PUT ON MY VEHICLE BECAUSE I FEEL THAT THE PARTS SHOULD BE DURABLE ENOUGH THIS IS AN 2008 VEHICLE I BOUGHT BRAND NEW SO IT IS NOT AN EARLIER MODEL AND THIS DID NOT HAPPENED FROM A LOT OF WEAR AND TEAR.  PLEASE LOOK INTO THIS MODEL FOR SUBSTANDARD PARTS. I JUST KNEW THAT I WOULD HAVE THIS VEHICLE FOR A FEW MORE YEARS BEFORE ANY MAJOR WORK WAS DONE. *TR",
        "vin": "4F2CZ02Z28K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/29/2009",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293930,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE - GAS PEDAL STICKING. *TR",
        "vin": "4F2CZ961X8K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "11/11/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292015,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COOLER LINE LEAK. *TR",
        "vin": "4F2CZ96178K"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "10/05/2009",
        "dateOfIncident": "10/04/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10286274,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR END COLLISION 10/4/09. STOPPED WITH TURN SIGNAL ON TO TURN INTO A PARKING LOT. REAR ENDED, BOTH FRONT PASSENGERS HAD SEAT BELTS ON. WE WERE THROWN FORWARD AND THEN BACKWARD BREAKING BOTH FRONT SEATS. INJURIES BACK, HIP, BROKEN VERTEBRA IN NECK FROM BEING THROWN AROUND. VERY DISAPPOINTED AT THE SEAT BREAKING CAUSING US MORE BODY DAMAGE.  ENTIRE BACK OF VEHICLE PUSHED IN AND BUCKLED ROOF. CAR WAS PURCHASED 4/19/08 AND HAD LESS THEN 6000 MILES ON IT. THIS IS A DEFINITE FAILURE IN THE SEATS OR VERY POOR DESIGN ON BOTH SEATS.",
        "vin": "4F2CZ92Z88K"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "09/11/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284204,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1998 MAZDA TRIBUTE.  HOOD LATCH DID NOT ENGAGE .  MAZDA DEALER SAID LATCH WORKS AS PRESCRIBED. MAZDA \"PEOPLE\" SAID NO PROBLEM.  COLLISION REPAIR SHOP UNDER CONTRACT WITH DEALER SAYS LATCH NEEDS TO BE REPLACED.  FAILURE OF LATCH AND SAFETY CATCH CAUSED BLOWN UP HOOD. *TR",
        "vin": "4F2CZ02Z38K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/29/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282428,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING TRANSMISSION COOLER AT 42,300 MILES. LEAKING FLUID IS BEING PICKED UP BY THE COOLING FAN AND AIR MOVING THROUGH THE ENGINE COMPARTMENT AND BEING SPREAD THROUGH THE ENGINE COMPARTMENT AND THUS A FIRE HAZARD. ALSO, IF THE LEAK HAD NOT BEEN CAUGHT THE TRANSMISSION WOULD HAVE RUN DRY AND LOCKED UP POTENTIALLY CAUSING A WRECK. *TR",
        "vin": "4F2CZ96178K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "06/28/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275490,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO TRANSMISSION COOLER LEAKING FLUID  \"FIRE HAZARD\". *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2009",
        "dateOfIncident": "05/22/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269691,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPPING AND LURCHING FORWARD WHEN IT ENGAGED AT AROUND 20MPH WITH NO WARNING. CHECKED FLUID AND ALMOST NONE LEFT.  14 MONTHS OLD AND 48,500 MILES.  DEALER STATES THAT THE TRANSMISSION/AC COOLER NEEDS REPLACEMENT AND THAT IT IS NOT PART OF THE 50,000 MILE POWERTRAIN WARRANTY.  $900. PLUS TO FIX.THIS IS A DEFINITE SAFETY ISSUE WITH THE LURCHING AND IF IT IS A PIECE THAT IS NEEDED BY THE TRANSMISSION TO WORK PROPERLY, IT SHOULD BE COVERED UNDER THE POWERTRAIN WARRANTY.  SAFETY BULLETIN ALREADY RELEASED ON THE ESCAPES AND HYBRIDS.  A RECALL NEEDS TO BE DONE. *TR",
        "vin": "4F2CZ96198K"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/13/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265148,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 MAZDA TRIBUTE WITH 13,000 MILES ON IT. LAST WEEK I NOTICED THE RIGHT REAR WHEEL WAS TILTED OUT OR IN TECHNICAL TERMS IT HAD EXTREME NEGATIVE CAMBER. I GOT UNDERNEATH THE VEHICLE AND SAW THAT THE LOWER BALL JOINT HAD COME OUT OF THE CONTROL ARM. THE LOWER CONTROL ARM IS DESIGNED FOR THE BALL JOINT TO FIT IN A STAMPED STEEL SLEEVE THEN BOLT TIGHT TO THE REAR SPINDLE ONCE THE BALL JOINT IS DISLODGED FROM THE CONTROL ARM THE INTEGRITY OF THE BALL JOINT AND THE CONTROL ARM ARE COMPROMISED. I CALLED THE DEALER AND EXPLAINED WHAT HAD HAPPENED AND HE TOLD ME TO BRING IT IN RIGHT AWAY FOR FEAR THAT THE REAR WHEEL COULD COLLAPSE UNDER THE VEHICLE. I'M WELL AWARE OF WHAT COULD HAPPEN BUT I'M MORE CONCERNED THAT A WARRANTY REPAIR WOULD NOT SOLVE THE CAUSE OF THE PROBLEM. I'M ALSO CONCERNED THE  PROBLEM WOULD DIE AT THE DEALERSHIP AND NOT BE BROUGHT TO THE PROPER PERSONNEL ATTENTION.  I'M GOING TO TAKE PICTURES OF THE BALL JOINT AND CONTROL ARM BEFORE I TAKE IT IN FOR THE REPAIR. I REALLY DON'T FEEL SAFE DRIVING THE VEHICLE NOW THAT I KNOW WHAT COULD POSSIBLY HAPPEN. I CAN'T BELIEVE THAT THIS HAS NEVER HAPPENED TO ANY OTHER TRIBUTE OR ESCAPE. I DON'T PLAN ON DRIVING THIS VEHICLE UNTIL I RECEIVE A RETURN RESPONSE FROM YOUR DEPARTMENT. *TR",
        "vin": "4F2CZ02Z68K"
    },
    {
        "components": "POWER TRAIN,TIRES,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2009",
        "dateOfIncident": "03/20/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262614,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MAJOR TRANSMISSION LEAK, IT KEPT LEAKING EVERYWHERE EVEN AT THE DEALERSHIP IT WAS LEAKING, BUT FOR  SOME REASON THE CAR DROVE NORMAL, THEY NEED TO RECALL THIS FAST, MAJOR PROBLEMS WITH THIS CAR 28,000 MILES AND THE BRAKES ARE MAKING GRUMBLING NOISES WHEN ITS LEFT TO COOL FOR LIKE 19 MINUTES, PLUS ONE OF THE SPEAKERS SOUND DISTORTED. TRANSMISSION LEAKED AND NOW MY PREFECT GARAGE AND READ TRANNY FLUID EVERYWHERE!!! MAZDA AND FORD PLEASE STOP MAKING CARS. *TR",
        "vin": "4F2CZ06128K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/23/2009",
        "dateOfIncident": "02/23/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259678,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MAZDA TRIBUTE CONDENSATION IN SEALED BEAM HEADLIGHT.  DEALERSHIP IS SAYING THAT MAZDA CORPORATE SENT OUT AN EMAIL DISALLOWING THE REPAIR OF HEADLIGHTS WITH CONDENSATION IN THEM.  THE CORPORATE EMAIL APPARENTLY STATES THAT THIS IS A \"NORMAL\" OCCURRENCE AND WILL NOT BE COVERED UNDER WARRANTY.  I AM AFRAID THAT THIS COULD IMPAIR OUR NIGHT VISION OR LEAD TO AN ELECTRICAL SHORT IN THE VEHICLE.  PLEASE INVESTIGATE THE VALIDITY OF MAZDAS CLAIM SINCE WATER SHOULD NOT BE IN THE HEADLIGHT.  CAR IS AT TOWN NORTH MAZDA IN RICHARDSON TX. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258330,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ALL SPEEDS OTHER THAN IDLE THE VEHICLE INADVERTENTLY LOSES POWER AND SMOKES.  THIS IS A NEW 2008 MAZDA TRIBUTE.  THE DANGER IS WHILE ON THE HIGHWAY AT SPEED SUDDENLY THE PROBLEM OCCURS AND THE CONDITION BECOMES UNSAFE. *TR",
        "vin": "4F2CZ92ZX8K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/11/2008",
        "dateOfIncident": "09/07/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241813,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE HAVING TRANSMISSION COOLER PROBLEMS. OUR 2008 TRIBUTE HAS A MAJOR LEAK...OR SHALL I SAY POUR. THE ITEM IS RECALLED. WE LIVE 1100 KM AWAY FROM DEALERSHIP.....SO WE COULD POTENTIALLY RUIN THE TRANSMISSION IF WE DRIVE THAT FAR...AND WE DO NOT HAVE 4000.00 TO GET IT TOWED. SO HERE WE ARE WITH A 2008 MAZDA TRIBUTE THAT WE CAN NOT DRIVE BECAUSE OF A TRANNY LEAK. WHAT TO DO.  *TR",
        "vin": "4F2CZ96118K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/05/2008",
        "dateOfIncident": "08/31/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10241094,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY IN 2008 MAZDA TRIBUTE WHEN IT CRASHED INTO A UTILITY POLE.  THE CAR HAS BEEN DECLARED TOTAL LOSS.  THERE ARE INJURIES THAT COULD HAVE BEEN PREVENTED BY DEPLOYMENT.  THIS CAR WAS PURCHASED BY MY FATHER I BELIEVE IN JUNE AND HE WAS DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/08/2008",
        "dateOfIncident": "07/07/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10233568,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BARS OF THE FRONT HEAD RESTS PROTRUDE FROM THE REAR OF THE SEAT AS THERE IS NO PROTECTION BETWEEN THE BARS AND THE CLOTH OF THE SEAT. BECAUSE OF THIS, IT IS VERY EASY FOR ONE TO HIT THEIR LEGS/KNEES WHEN ENTERING AND EXITING THE VEHICLE. MY MAIN CONCERN IS THAT IT SEEMS LIKE THERE COULD BE A VERY HIGH POTENTIAL FOR SERIOUS LEG/KNEE INJURIES IN THE CASE OF AN ACCIDENT. I BELIEVE THIS PROBLEM CAN AFFECT YOUNG TEENS TO ADULTS AS MY MOM, WHO IS ONLY 5' 1\" TALL, EASILY HIT ONE OF THE BARS WITH HER KNEE AS DID I WHEN GETTING IN AND OUT OF THE BACK SEATS.  *TR",
        "vin": "4F2CZ06138K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/26/2008",
        "dateOfIncident": "02/12/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10219157,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO ACCIDENT WHCH I WAS HIT ON THE LEFT SIDE. BOTH FRONT AND BACK DOOR CAVED IN AND NONE OF THE AIR BAGS DEPLOYED. ( CURTAIN ARBAGS ).  *TR",
        "vin": "4F2CZ06138K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/10/2007",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199051,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MAZDA TRIBUTE.  THE CONTACT STATED THAT THE BACK END OF THE VEHICLE SWAYS VIOLENTLY WHEN DRIVING OVER BRIDGES WITH IRON GRATES.  THE FAILURE CAUSES HIM TO GRIP THE STEERING WHEEL TIGHTLY IN ORDER TO MAINTAIN CONTROL OF THE VEHICLE.  THE FAILURE WAS NOTICED THE FIRST DAY THE VEHICLE WAS DRIVEN ON THE HIGHWAY.  THE SPEED WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 705.",
        "vin": "4F2CZ96178K"
    }
]