[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/24/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192461,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK ON DAY DURING A TURN THE POWER STEERING PARTIALLY WENT OUT MAKING THE TURN VERY DIFFICULT TO HOLD AND TO STRAIGHTEN OUT AFTER.  UPON LEAVING WORK THE STEERING WORKED FINE UNTIL THE NEXT DAY WHEN MAKING A TURN ON MY WAY HOME THE SAME THING HAPPENED WITH THE POWER STEERING BUT STILL NO LIGHT INDICATING A PROBLEM. I THEN DECIDED TO TAKE THE CAR IN BUT THE WHOLE DRIVE TO THE DEALERSHIP IT WOULD CREAK AND NOT ALWAYS WANT TO TURN COMPLETELY MAKING THE TRIP TAKE LONGER TRYING TO AVOID HIGHWAYS AND TO MANY SHARP TURNS IN FEAR OF IT LOCKING UP.  THIS IS VERY DANGEROUS ASPECIALY COMING OUT OF WINTER SEASON AND GOING INTO SPRING WITH ALL THE RAIN.  THIS SHOULD BE A RECAL IN THE US SINCE IT IS A RECAL IN OTHER PARTS OF THE WORLD.",
        "vin": "JM1FE173X80"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192464,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY RX IN TO GET POWER STEERING ISSUES FIXED JUST TO FIND OUT THAT THE OIL COOLER LINES WERE RUSTING OUT WHICH IS ALSO A RECALL IN OTHER PARTS OF THE WORLD BUT NOT THE US.  IN THE UPPER STATES THIS CAN BE A MASSIVE PROBLEM IF OIL STARTS SPRAYING ALL OVER THE MOTOR AND THE GROUND IT COULD CAUSE ENVIRONMENTAL, AND SAFETY HAZARDS TO OTHER PEOPLE ON THE ROAD.  IF GONE UNNOTICED IT COULD EASILY CAUSE ENGINE FAILURE AND POTENTIAL FIRES FROM THE MOTOR WHILE ON THE ROAD WHICH NO ONE WANTS, THERE'S NO REASON THIS RECALL SHOULD NOT APPLY TO THE US, ATLEAST THE NORTHERNMOST STATES.",
        "vin": "JM1FE173X80"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080368,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM TRYING TO GET THE AIRBAGS REPLACED BUT I CANNOT FIND A PLACE WHO WILL SERVICE OUR CAR.  WE ARE TRYING TO AVOID DRIVING IT UNTIL THE AIRBAG PROBLEM IS FIXED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045867,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY CAR SUDDENLY STOPPED ON THE SIDE, OF THE 101  FREEWAY OFF THE WEST LAKE VILLAGE EXIT GOING SOUTH, AND WOULD NOT TURN ON. I HAD MY CAR TOWED TO THE MAZDA DEALERSHIP AFTER FINDING OUT OF THE RECALL ON THE FUEL PUMP AND AIR BAGS ON THE MAZDA WEBSITE. AFTER 3 DAYS AT THE DEALERSHIP AND BEING CHARGED 3 HOURS OF $115.00 HOUR THEY WERE NOT ABLE TO REPAIR MY CAR OR REPLACE THE RECALL. THEY SUGGESTED FOR ME TO BUY A NEW ENGINE THAT WOULD COST ME $7000.00",
        "vin": "JM1FE173380"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2017",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032323,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30TH, 2017 I TOOK MY 2005 MAZDA RX8 TO THE GUNTHER MAZDA DEALERSHIP LOCATED AT 1800 SOUTH STATE ROAD 7 (441), FORT LAUDERDALE, FLORIDA 33317 FOR RECALL WORK OF THE FUEL PUMP SEALS. THE NEXT DAY I FILLED THE TANK AND WENT TO WORK, I DRIVE FORM HOLLYWOOD TO BOCA RATON DAILY. THE SMELL OF GASOLINE WAS STRONG AND MY TANK WASN'T LASTING AS LONG AS USUAL. I CALLED GUNTHER MAZDA AND WAS TOLD TO BRING THE CAR IN ON SATURDAY OCTOBER 7, 2017. THE SERVICE PERSON, RON, SAID HE STRONGLY SMELLED THE GASOLINE AND SAID IT WAS A CARBON BUILD UP ON THE THROTTLE AND THAT HIS FOREMAN WOULD LOOK AT THE CAR. I SIGNED PAPERWORK, BUT DIDN'T RECEIVE A COPY. I GOT THERE ABOUT 10:30, AT ABOUT 11:50, I WAS INFORMED THAT THE PROBLEM WAS MY CATALYTIC CONVERTER. I FILLED THE TANK WITH GAS AND MY MECHANIC TOOK THE BACK SEATS OFF. THE FUEL PUMP SEAL WAS FILLED WITH GASOLINE, THE CAR WAS LEAKING GASOLINE AND FUMES IN THE CABIN WERE OVERWHELMING. WHEN I CALLED GUNTHER MAZDA TO SPEAK WITH RON, I WAS HUNG UP ON 3 TIMES. WHEN MY HUSBAND CALLED HE WAS MET WITH EXTREME RUDENESS AND TOLD THAT IT WOULD COST ABOUT $130 FOR THEM TO REEXAMINE THE CAR. IT IS ABSOLUTELY UNCONSCIONABLE THAT THE GUNTHER MAZDA LOCATED AT 1800 SOUTH STATE ROAD 7 (441), FORT LAUDERDALE, FLORIDA 33317 WOULD LET ME DRIVE AWAY FROM THEIR DEALERSHIP KNOWING THAT THE FUEL PUMP SEAL WAS FAULTY. MY CAR COULD HAVE BLOWN UP KILLING ME AND MAYBE OTHERS. MY MECHANIC REMOVED THE ASSEMBLY TO REPAIR AND SAID THE INSTALL WAS INCORRECTLY DONE. HE WILL BE SENDING ME ADDITIONAL PICTURES OF WHAT HE FOUND.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024971,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN. I PURCHASE THE CAR ON JULY 21 2017. THE AC HAS NOT BEEN WORKING PROPERLY SINCE I PURCHASED THE CAR. NOW THE MAZDA DEALERSHIP WANTS ME TO PAY FOR THIS TO GET FIX. I WAS WONDERING IF SOME CAN HELP ME OUT WITH THIS. BEFORE I GIVE THIS CAR BACK TO THE DEALER AND THEY CAN KEEP THE CAR. I'M NOT PAYING 1.900.00 TO HAVE THE CAR FIX. THANK YOU PLEASE LET ME KNOW WHAT WE CAN DO TO GET THIS FIX!",
        "vin": "JM1FE173680"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "05/25/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991723,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IS ALL CRACKED AROUND THE PASSENGER DASH SIDE. IS EXACTLY WHERE THE AIR BAD SITS 4 LARGE CRACKS ALL THE WAY AROUND IT ..ALSO THE DRIVER SEAT RIGHT SIDE LOWER LUMBAR IS SHIFT UP AND DOWN...POOR MANUFACTURING",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "10/04/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986337,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD THAT COVERS THE PASSENGER AIRBAG HAS BEEN CRACKING IN THE OUTLINE OF THE AIRBAG SINCE PRIOR TO 10/4/2012.  MAZDA SAID THEY WOULD NOT COVER THE REPLACEMENT.  I'VE ATTACHED MY 10/4/2012 REQUEST FOR AN ESTIMATE OF REPAIR, BUT I DID NOT GET IT REPAIRED.  I BELIEVE THEY SHOULD BE PAYING FOR THIS DEFECT.  I'VE ALSO ATTACHED A PICTURE OF THE DASHBOARD AS OF TODAY.  I AM AFRAID IT IS GOING TO BURST OPEN AND INJURE OR KILL SOMEONE.",
        "vin": "JM1FE173180"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984505,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED AT ONLY 85000 MILES, ALMOST CAUSED ME TO CRASH WITH MY TWO TODDLERS IN THE BACK SEATS!!!  NOW IT IS GOING TO COST ME OVER 2K TO FIX IT, I AM A MILITARY WIFE, IN GERMANY, AND ALMOST CRASHED DUE TO MAZDA'S LACK OF QUALITY!!!!",
        "vin": "JM1FE173080"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898369,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA RX-8. WHILE DRIVING 45 MPH MAKING A LEFT OR RIGHT TURN, THE STEERING WHEEL SEIZED AND BECAME DIFFICULT TO MANEUVER. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE VEHICLE WAS DIAGNOSED, BUT NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.",
        "vin": "JM1FE17N450"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839393,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH COVER FOR THE DEFECTIVE AIRBAGS IS CRACKING AND SHOULD BE REPLACED BY MAZDA.",
        "vin": "JM1FE173X80"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/23/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780493,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PLASTIC CASING ON MY DRIVERS SIDE DASHBOARD THAT ENCASES THE AIR BAG IS PUSHING IT'S WAY THROUGH THE DASHBOARD.  IT IS THE EXACT SHAPE OF A RECTANGLE WHICH THE DEALERSHIP SAYS IS THE PLASTIC CASING.  I FEEL THIS IS A DEFECT IN THE CAR AND ALSO DANGEROUS BUT I WAS TOLD THAT THIS IS NOT A WARRANTY ISSUE.",
        "vin": "JM1FE173980"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "02/20/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714486,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA RX-8.THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V344000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE. THE CONTACT FELT THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACTS VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JM1FE173580"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702886,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MAZDA RX-8. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V344000 (AIR BAGS). THE CONTACT STATED THAT THE PART NEEDED TO REMEDY THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JM1FE173680"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567099,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL COOLER LINES ON THE RX 8 WILL RUST AN CORRODE DUE TO SALT ON THE ROADS IN THE WINTER MONTHS IN THE UPPER STATES.. LINES RUST AND CORRODE CAUSING OIL TO SPRAY OVER THE ENGINE BAY ,TIRES AND BRAKES.  CAUSING A LOSS TRACTION. AND EVEN ENVIRONMENTAL ISSUES.. OIL OVER THE ROAD.THIS  BECOMES A HAZARD TO DRIVERS BEHIND YOU.. MAZDA HAS A RECALL CANADA DUE TO THIS ISSUE.. BUT WILL NOT HONOR THE US AT ALL.. THIS IS SERIOUSLY NEEDS TO BE ADDRESSED IMMEDIATELY..   *TR",
        "vin": "JM1FE173380"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2013",
        "dateOfIncident": "01/19/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493657,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME ON THE HIGHWAY AND THE CAR STARTED TO INTERMITTENTLY PULL SLIGHTLY IN ONE DIRECTION.  AFTER ABOUT 10 MINUTES OF THIS, THE POWER STEERING FAILURE LIGHT CAME ON AND MY POWER STEERING WAS GONE AS I WAS DOING 65MPH ON THE HIGHWAY.  AS I CONTINUED TO DRIVE, THE CAR WOULD RANDOMLY START TO PULL TO ONE DIRECTION.  IT WAS VERY SCARY AND UNSAFE.  I LOWERED MY SPEED TO THE MINIMUM OF 55MPH (IN INDIANA, THE 45MPH IN ILLINOIS) AND STILL HAD THE SAME ISSUES FOR THE REST OF THE DRIVE.  I DID SOME RESEARCH AND THIS PROBLEM IS FAIRLY COMMON IN THE RX-8S.  THIS IS EXTREMELY UNSAFE AND SHOULD BE FIXED BY THE MANUFACTURER.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2012",
        "dateOfIncident": "10/29/2012",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483668,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK  AND  AS I WAS SHIFTING GEARS I FELT THE CAR DID NOT HAVE ANY ACCELERATION. THE TOP SPEED I GOT TO WAS 55MPH. WHEN I WAS ABOUT TO GET OFF THE CAR, I SAW SMOKE COMING FROM UNDER THE HOOD AND FROM INSIDE WHERE THE SHIFT KNOW IS LOCATED. I CHECKED UNDER THE CAR FOR A POSSIBLY FIRE, AND THERE IT WAS. APPARENTLY THE CATALYTIC CONVERTER HAD CLOGGED UP AND THAT'S WHAT STARTED THE FIRE. ITS NOT SAFE TO DRIVE AROUND WITH A CAR THAT BARELY HAS 55,000 AND ALREADY HAS PROBLEMS LIKE A FIRE. WHAT IF I THE CAR CAUGHT IN FIRE WITH MY FAMILY INSIDE. CANT IMAGINE. I CALLED AN AGENCY THAT TOLD ME THE CAR HAD A SAFETY RECALL, AND HAD ASKED ME IF THE DEALER HAD PROVIDED WITH AN INSPECTION STICKER WHICH WAS NOT IN THE WINDSHIELD. I WISH I COULD HAVE MY DOWN PAYMENT I GAVE BACK BECAUSE I WOULD NOT FEEL SECURE AND SAFE DRIVING A CAR (WITH MY CHILD AND WIFE) WITH A CAR THAT TURNED ON FIRE.  *TR",
        "vin": "JM1FE173X80"
    }
]