[
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193740,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL MITSUBISHI LANCER EVOLUTION X FROM YEARS 2008 THROUGH THE CARS FINAL GEAR IN 2015 SUFFER FROM A DESIGN FLAW TO THE S-AWC SYSTEM. THE ACTIVE YAW CONTROL / ACTIVE CENTER DIFFERENTIAL SYSTEM RELIES ON A PUMP IN ORDER TO OPERATE . THE LOCATION IS UNPROTECTED FROM THE ELEMENTS AND THOUSANDS OF THEM HAVE FAILED TO DATE. . MINE FAILED WHICH RENDERED MY CAR TO NO LONGER DRIVE IN A PREDICTABLE OR SAFE MANNER. THE ALL WHEEL DRIVE AND STABILITY CONTROL SYSTEM WAS COMPROMISED AND TRACTION CONTROL NO LONGER FUNCTIONS AS EXPECTED. INSTEAD OF THIS BECOMING A RECALL MITSUBISHI EXTENDED A WARRANTY TO REPLACE THIS EXACT COMPONENT RATHER THAN ADMITTING FAULT FOR AN OBVIOUS DESIGN FLAW. THEY REFUSED TO WARRANTY MINE AS THIS EXCEPTION WAS ONLY MADE AFTER MY WARRANTY HAD ALREADY EXPIRED EVEN THOUGH MY PUMP FAILED BEFORE I HIT 100K MILES. THE ACD / AYC PUMP IS CRITICAL COMPONENT TO THE SAFETY AND STABILITY OF THE LANCER EVOLUTION 10 . EXTENDING THE WARRANTY TO ONLY COVER A SMALL PORTION OF FAILURES IS UNACCEPTABLE AND DISHONEST. THE DESIGN IS UNSAFE AND THE REPAIR AND REPLACEMENT OF THIS AND OTHER AFFECTED COMPONENTS IS EXTREMELY COSTLY. THIS SHOULD BE A RECALL. ALL PUMPS WILL EVENTUALLY FAIL AS THE SEALS EVENTUALLY FAIL AND CORROSION OF THE PUMP OR ELECTRIC MOTOR . THIS EFFECTS ALL EVOLUTION 10S REGARDLESS OF CLIMATE.       HERE ARE OTHERS FACING THE SAME  HTTPS://WWW.EVOLUTIONM.NET/FORUMS/EVO-X-ENGINE-TURBO-DRIVETRAIN/660431-ACD-AYC-PUMP-FAILURE-REPORTS-11.HTML    HERE IS ONE COMPANY SELLING A KIT TO RELOCATE THE PUMP TO THE TRUNK OF THE CAR AS THIS HELPS TO PROTECT THE PUMP FROM THE ELEMENTS AND ULTIMATELY PREMATURE FAILURE     HTTPS://WWW.DRIVEN-FABRICATION.COM/PRODUCTS/EVO-X-ACD-AYC-RELOCATION-KIT-PRE-ORDER    THERE ARE ALSO AFTERMARKET COMPANIES OFFERING UPGRADED O RINGS AND REBUILD KITS SINCE MITSUBISHI ONLY REPLACES PUMPS WITH NEW ONES AND HASN'T ACTUALLY FIXED THE DESIGN",
        "vin": "JA3AW86V58U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "09/08/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142680,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AYE/ HYDRALIC PUMP WAS NEVER CHANGED OUT WAS TOLD WHEN I WENT TO DO A MANUFACTURING RECAL THAT IT WORKED FINE WHEN IT DIDNT AND AFTER WARDS HIT PAST THE 100,000 MILES AND WAS AUTOMATICALLY UNABLE TO GET THE REPLACEMENT.",
        "vin": "JA3AW56V08U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/13/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072777,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MITSUBISHI RECALL 09V077000    IN THE PAST FEW DAYS, I NOTICED THAT WHILE IN MOTION MY BREAKS WERE NOT REACTING WITH THEIR TYPICAL SPEED. WHEN I TOOK MY CAR INTO A MECHANIC, THEY SAID IT WAS AN ISSUE WITH MY CAR'S BRAKE BOOSTER CHECK VALVE AND THAT THERE WAS A SAFETY RECALL REGARDING THIS BACK IN 2009. I WAS CONCERNED AS I HAVE TAKEN MY CAR IN FOR, FRANKLY, MORE RECALLS THAN I CAN EVEN REMEMBER, SO I CALLED MY DEALERSHIP TO SCHEDULE THE MAINTENANCE. AFTER A LOT OF BACK AND FORTH WITH BOTH THE DEALERSHIP AND MITSTUBISHI'S CUSTOMER SERVICE, IT TURNS OUT THAT MY CAR WAS NOT CONSIDERED AS IT WAS MADE \"SIX MONTHS BEFORE.\" THIS IS REALLY ODD AS, FROM ALL THE DESCRIPTIONS OF THE RECALL, NO TIMELINES WERE SPECIFIED, JUST THE MODEL YEARS AFFECTED.     IF MY CAR WAS TRULY NOT IN THE NEED OF THE RECALL, THAT'S COMPLETELY FINE, BUT THE ANSWERS I RECEIVED REGARDING THIS REALLY DIDN'T MAKE SENSE TO ME, AND I'D RATHER REPORT IT IN CASE MORE PEOPLE ARE AFFECTED THAN JUST TAKE IT AT FACE VALUE.",
        "vin": "JA3AU86U48U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2018",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066784,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR INTO THE DEALERSHIP IN 2016 FOR A FLASHING TARAMIC LIGHT AND THEY TOLD THERE WASN'T ANYTHING WRONG. WHICH I LATER FOUND OUT THAT THEY NEGLETED TO LOOK INTO THE ISSUE. I HAD NO IDEA WHAT THIS ISSUE WAS UNTIL 6 MONTHS LATER AND I JUST HAD REACHED 100,500 MILES ON THE CAR. I FOUND ON A FORM IT COULD BE THE A FLUID ISSUE, SO I WENT TO MITSUBISHI TO GET FLUID AND THE SERVICE MANAGER INFORMED ME OF THE 100,000 MILE WARRANTY. I EVENTUALLY TOOK MITSUBISHI TO COURT FOR NEGLIGENCE AND LACK OF CARE AND THE CASE WAS THROWN OUT. I'M SICK OF DEALING WITH THIS ISSUE.",
        "vin": "JA3AW56V98U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967896,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AYC PUMP FAILED CODE C161E. I SEARCHED ONLINE AND FOUND OUT THAT THE PUMP WAS FAILING DUE TO SALT CORROSION. THIS SHOULD OF BEEN A RECALL SINCE NURMEROUS OF OTHER CARS ARE HAVING THE SAME ISSUE.",
        "vin": "JA3AW56V98U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929738,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACD/ACY RECALL. I PURCHASED MY 2008 EVO WITH 95000 MILES ON IT. SHORTLY AFTER I BOUGHT THE VEHICLE I WAS HAVING ISSUES WITH IT RUNNING LEAN AND MY AYC SERVICE LIGHT APPEARED ON THE DASH. I THEN TOOK THE VEHICLE TO THE DEALERSHIP WITH 96000 MILES ON THE CAR  IN HOPES FOR THEM TO HELP ME FIX THESE ISSUES WITH MY CAR AND YET THERE WAS NO HELP AT ALL. SO THEN I WENT ON MY WAY AND I HAD ANOTHER DEALERSHIP FIX MY PROBLEMS AND I WAS GOOD FOR ABOUT 4200 MILES MY CAR THEN HAD 100,200 MILES  ON IT AND I HAD TO GO TO THE DEALERSHIP TO GET A REAR DIFF FLUID CHANGE IN THE TRANSMISSION OIL CHANGE AND THE DEALERSHIP THEN TOLD ME THAT THERE WAS A EXTENDED WARRANTY FOR THESE AYC PUMPS AND  AND NEVER TOLD ME ABOUT THIS ISSUE WHEN I WAS IN SIX MONTHS PRIOR TO THIS I CONTACTED MITSUBISHI THEMSELVES AND THEY SAID THAT THEY WOULD DO ABSOLUTELY NOTHING FOR ME EVEN THOUGH THE DEALERSHIP TOLD THEM THAT I WAS THERE BEFORE HAND WITH THE SAME ISSUE AND  THEY DIDN'T DO ANYTHING ABOUT IT.   I FEEL LIKE I WAS SCAMMED AND IT'S HORRIBLE TO HAVE TO FIGHT WITH MITSUBISHI ABOUT A PUMP THEY CAN RISK MY SAFETY AND THE OTHERS IN MY CAR . I WAS SCREWED OUT OF WARRANTY THAT I WAS NEVER TOLD ABOUT .",
        "vin": "JA3AW56V98U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/19/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851019,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AYC PUMP FAILURE AT 44 THOUSAND MILES.",
        "vin": "JA3AW56V58U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2015",
        "dateOfIncident": "01/05/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789795,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF TRANSMISSION CENTER DIFFERENTIAL PINS IN MANUAL 2008 MODELS. I WAS DRIVING MY CAR AT HIGHWAY SPEEDS WHEN THE CAR POPPED OUT OF GEAR TO NEUTRAL, THEN I SHIFTED TO 4TH AND POPPED OUT AGAIN TO NEUTRAL, I HAD TO QUICKLY SWERVE TO THE SHOULDER AND THE ENTIRE TRANSMISSION LOCKED UP CAUSING THE CAR TO SKID. UPON TOWING IT TO THE DEALER THEY SAID THE CENTER DIFFERENTIAL PINS HAVE BACKED OUT THEY SAID \"IT HAPPENS BUT NOT THAT COMMON.\" I WAS IN DISBELIEF THE PINS HAD CAUSED A CRACK IN THE TRANSMISSION CASING AND ALL THE OIL IN THE TRANSMISSION HAD LEAKED OUT CAUSING THE THE GEARS TO CEASE UP NEARLY CAUSING AN ACCIDENT. SEE PICTURES, UPON RESEARCH I HAVE SEEN MANY SIMILAR SITUATIONS ON THE EVO FORUMS AND IN FACT 2 MAJOR COMPANIES JACKS TRANSMISSION AND SHEPTRANS OFFER \"UPGRADES\" TO PREVENT THIS! UPGRADES? TO CAUSE A TRANSMISSION FROM COMPLETELY FAILING. APPARENTLY MITSUBISHI RECOGNIZED THIS AND UPGRADED THE PINS HEAT COATING IN 2010 TO PREVENT THIS BUT I AM STUCK WITH A 5000 DOLLAR REPAIR BILL AND I AM OUT OF WARRANTY. I TRIED TO REMEDY THIS WITH MITSU USA AND IT HAPPENED A YEAR AGO BUT I AM STILL UPSET NO RECALL HAS BEEN ISSUED AND I STILL DRIVE THIS CAR TO THIS DAY. I WOULD LIKE THIS TO BE REVIEWED IT IS VERY DANGEROUS. 2008 LANCER EVO GSR MODELS",
        "vin": "JA3AW86V88U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "10/14/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672203,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FOR DEFECT, NOTICE OCTOBER 2014.  *TR",
        "vin": "JA3AU26U28U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664740,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACD/ AYC PUMP FAILURE, ONE TIME I WAS DOING FLUID INSPECTION ON MY CAR WHEN I NOTICE THE CARS ATF FLUID RESERVOIR IN THE TRUNK IS LOSING OIL. LOOKED AT THE FLOOR FOUND SOME RED OIL DRIPPING. IT MAY HAVE SEEM THAT PUMP MAY HAVE BEEN FAILING TO HOLD PRESSURE AND LOSE OIL. POSSIBLE GASKET FAILURE OR PUMP CRACK. BEEN SEARCHING ONLINE FOR SIMILAR PROBLEMS, I FOUND OUT IT SEEMED TO BE MOSTLY EVERY OWNERS PROBLEM. IS THIS SUPPOSE TO BE COVERED BY MANUFACTURER? SEEM LIKE POOR MATERIAL BUILD. *TR",
        "vin": "JA3AW86V08U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2014",
        "dateOfIncident": "12/05/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662884,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN COLD WEATHER, AYC SYSTEM LIGHT TURNED ON. I CHECKED THE FORUMS AND FOUND THAT THIS IS A COMMON ISSUE THAT INDICATES THE PUMP IS BAD. THIS IS A VERY COMMON PROBLEM.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659722,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS A COLD WINTER DAY, I STARTED DRIVING MY EVO TO A NEARBY GROCERY STORE. ENROUTE, THE AWD SYSTEM WOULD THROW A WARNING AND A DASHBOARD LIGHT LIT UP. I WAS CONCERNED, STOPPED THE VEHICLE AND FOUND NO LEAKS OR NO WEIRD NOISES. THE VEHICLE WAS UNABLE TO SHIFT INTO SNOW/TARMAC/GRAVEL MODE. FORTUNATELY I WAS NOT STRANDED ON THE ROAD SIDE. UPON FURTHER INVESTIGATION I CAME TO KNOW THAT THE ACD PUMP FAILED AND HENCE IT THREW AN AWD ERROR. ITS COSTING ABOUT 2200 DOLLARS TO FIX THIS ISSUE.  *TR",
        "vin": "JA3AW86V28U"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT ADAPTIVE/MOBILITY,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "09/24/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640971,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING MY 2008 MITSUBISHI LANCER EVOLUTION GSR, I RECEIVED A WARNING MESSAGE ON THE CLUSTER DISPLAY SHOWING A YELLOW-ORANGE SYMBOL THAT SHOWS 4 WHEELS CONNECTED BY AXLES AND THE MIDDLE-SHAFT, WHERE THE FRONT TWO WHEELS ARE FACING AT AN ANGLE TO THE SIDE. THE ERROR CODE READ AS C161E: DTC C161E: ELECTRIC PUMP RELAY CIRCUIT SYSTEM (STUCK). THIS HAS BECOME A VERY COMMON ISSUE WITH THE 2008 MITSUBISHI LANCER EVOLUTION. SO COMMON THAT WHEN YOU SEARCH FOR THE CODE C161E, YOU CAN FIND COUNTLESS FORUM DISCUSSIONS ON MULTIPLE WEBSITES COMMENTING ON THE FREQUENCY OF THIS ISSUE. INCLUDING MYSELF, A SINGLE DISCUSSION IDENTIFIES AT LEAST 48 UNIQUE CARS, 42 OF WHICH ARE THE 2008 MODEL YEAR, WHERE THE ACD PUMP FAILED, ALL OF WHICH HAVING DRIVEN FEWER THAN 75,000 MILES AND NEARLY 60% WITH LESS THAN 50,000 MILES (HTTP://WWW.EVOXFORUMS.COM/FORUMS/SHOWTHREAD.PHP?T=58221&HIGHLIGHT=C161E&PAGE=1). SEVERAL OF THESE VEHICLES REQUIRED MULTIPLE REPLACEMENTS OF THE SAME PART. THIS PROBLEM AFFECTS THE SAFETY AND EFFECTIVENESS OF THE VEHICLE'S ALL-WHEEL-DRIVE SYSTEM, LIKELY INCLUDING THE VEHICLE'S TRACTION CONTROL AND NEEDS TO BE RECALLED IMMEDIATELY.  *TR",
        "vin": "JA3AW86V68U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607970,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF ELECTRONIC STABILITY CONTROL. AYC/ACD PUMP FAILURE  DUE TO POOR ENGINEERING. CAR HAS NO STABILITY CONTROL AND DRIVER IS MORE LIKELY TO LOSE CONTROL IN SEVERE WEATHER CONDITIONS.  *TR",
        "vin": "JA3AW86V58U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/14/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605444,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN THE ONLY OWNER OF THIS CAR AND AM LEARNING MUCH NOW THAT MY WARRANTY HAS EXPIRED.  I TOOK MY CAR TO BE DIAGNOSED AT FITZGERALD MITSUBISHI IN ANNAPOLIS MD, AND WAS TOLD THAT IT WAS AN 800 OR 3100 DOLLAR FIX, DEPENDING ON WHICH JOB NEEDED TO BE DONE.  THE BIG FIX IS THE AYC/ADC HYDRAULIC UNIT THAT PRESSURIZES THE CLUTCHES IN THE DIFFERENTIAL.  WHAT CAUSES THE FAILURE IS CORROSION.  THIS UNIT IS PLACED BEHIND THE RH REAR TIRE AND HAS VERY LITTLE PROTECTION FROM THE ELEMENTS.  THIS UNIT NEEDS TO BE RELOCATED OR BETTER SHIELDING NEEDS TO BE ATTACHED.  READING THE EVOLUTIONM.NET FORUMS, I HAVE FOUND THAT THIS CORROSION IS VERY POPULAR AND THE REPAIRS ARE EXTREMELY PRICEY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT ADAPTIVE/MOBILITY,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595963,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTIVE YAW CONTROL (AYC) AND ACTIVE CENTER DIFFERENTIAL (ACD) PUMP FAILED. NOT COVERED UNDER POWER TRAIN WARRANTY   PUMP WAS CORRODED AND COULD NO LONGER PRODUCE ENOUGH PRESSURE.  PUMP IN LOCATED DIRECTLY BEHIND PASSENGER REAR WHEEL EXPOSED TO WATER, SALT, AND OTHER ROAD DEBRIS.  *TR",
        "vin": "JA3AW56V28U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/03/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594401,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO DEALER FOR TRANSMISSION CHECK AND AFTER A MILE AWC LIGHT CAME ON THEY SAID IT HAD NOTHING TO DO WITH COMPUTER UPDATE THEY DID.MIND YOU MY TRANNY WAS GOING BAD AND DEALER DID NOT WANT NOTHING TO DO WITH IT EVEN UNDER WARRANTY.  *TR",
        "vin": "JA3W56V88U0"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "04/13/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587851,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STABILITY CONTROL / S-AWC (TARMAC/GRAVEL/SNOW) INOPERABLE.  TERRAIN SELECTION CAN BE PERFORMED AT 0MPH HOWEVER WHEN THE CAR IS PLACED IN MOTION: FORWARD / REVERSE, THE INSTRUMENT PANEL INDICATES THERE IS SERVICE REQUIRED IN THE AWD TRACTION CONTROL SYSTEM.  THIS IS APPARENTLY A COMMON PROBLEM, FROM THE MULTITUDE OF COMPLAINTS FOR THIS SPECIFIC ISSUE POSTED HERE.  *TR",
        "vin": "JA3AW86V88U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2014",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586681,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACD (ACTIVE CENTER DIFFERENTIAL) PUMP HAS FAILED AND WITHOUT THIS PUMP PROVIDING PRESSURE TO THE ALL WHEEL DRIVE SYSTEM, THE VEHICLE GETS STUCK ON DRIVEWAYS AT A STOP WHERE THE TIRE AND WHEEL PACKAGES  ARE ON DIFFERENT ELEVATED SURFACES.  THE REASON THE PUMP HAS FAILED IS DUE TO PLACEMENT OF THE PUMP ON THE VEHICLE.  MITSUBISHI HAS DESIGNED THE VEHICLE TO HAVE THE PUMP TO BE LOCATED DIRECTLY BEHIND THE REAR PASSENGER WHEEL.  DUE TO THIS, WHILE DRIVING ON SEVERE WEATHER ROADS (PARTICULARLY SNOW SALTED ROADS), THE DIRT, WATER AND SALT GETS KICKED UP TO THE POSITION OF THE PUMP WHICH CORRODES THE FITTINGS AND THE PUMP ITSELF.  THIS THEN CAUSES THE PUMP TO FAIL OVER TIME.  IT COULD HAVE BEEN EASILY REMEDIED BY RELOCATING THE PUMP OR ANTI-CORROSION PROTECTION AND BETTER SEALING.  BEING LOCATED IN SOUTHERN CALIFORNIA, I WOULD HAVE THOUGHT THAT THIS WOULD HAVE NEVER HAPPENED TO ME, BUT EVEN DRIVING ONLY TWICE THROUGH SNOW ROADS IN THE PAST 3 YEARS HAS CORRODED THE PUMP TO FAILURE.  MITSUBISHI HAS DENIED THAT THIS IS PART OF THE POWER TRAIN WARRANTY, WHICH MEANS IT WILL BE A $2000+ DOLLAR FIX.  *TR",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "10/28/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578875,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACD (ACTIVE CENTER DIFFERENTIAL) PUMP FAILURE AT 43000 MILES.  WAS REPAIRED UNDER WARRANTY BUT FAILED AGAIN 2 MONTHS AGO (LESS THAN 60000 MILES) JANUARY 2014.  SO THE NEW PUMP INSTALLED DID NOT LAST FOR MORE THAN 15000 MILES.    THIS IS A COMMON AND KNOWN ISSUE FOR ALL MITSUBISHI MODELS EQUIPPED WITH THAT ACD STABILITY CONTROL.  *TR",
        "vin": "JA3AW56V98U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578365,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MANY EVOLUTION OWNERS WHO LIVE IN THE MIDWEST CAN ALSO ATTEST, MY EXAMPLE NOW JOINS THE CLUB OF MODELS WITH DEFECTIVE ASC/AYC PUMP FAILURE. THE PUMP FAILS WHEN OUTSIDE TEMPERATURES RUN CLOSE TO FREEZING, ON TOP OF THE UNIT CORRODING, AND EVOLUTION OWNERS ARE BEING FORCED TO SHELL OUT $1800 MINIMUM TO MITSUBISHI FOR THE PUMP ALONE, NOT INCLUDING LABOR. I BELIEVE THIS HAS ONLY OCCURRED TO MY MITSUBISHI AFTER SIX YEARS BECAUSE I'VE BEEN VERY GOOD ABOUT KEEPING THE UNDERBODY CLEAN, AND IT'S NEARLY ALWAYS PARKED IN A HEATED GARAGE.    WITHOUT THE PROPER FUNCTIONING OF THIS INTEGRAL DRIVETRAIN EQUIPMENT, WE AREN'T ABLE TO CONTROL POWER DELIVERY FRONT TO BACK AND THE VEHICLE COMPUTER GOES INTO A TYPE OF LIMP MODE WHERE NO CONTROL OF THE DELIVERY OF POWER TO THE WHEELS IS POSSIBLE. OF COURSE THE BRAKES WORK AND THE THROTTLE WORKS, BUT WHEREAS THE VEHICLE USED TO BE SELECTABLE FOR SNOW OR GRAVEL MODES, GREATLY IMPROVING TRACTION AND THE ABILITY TO LIMIT SLIPPAGE OF THE REAR WHEELS, WE INSTEAD STARE AT A DIGITAL READOUT INSTRUCTING US TO SERVICE THE UNIT THAT'S CORRODED AND THE PUMP HAS OVERHEATED AND ALSO FAILED AS A RESULT.    WWW.EVOXFORUMS.COM AND WWW.EVOLUTIONM.NET HAS PLENTY OF OTHER CUSTOMERS WHO ARE BELONG FRUSTRATED WITH THIS ISSUE THAT MITSUBISHI DOESN'T WANT TO ADDRESS.     NEARLY ALL OF US HAVE SPENT GOOD MONEY ON A VEHICLE WE THOUGHT WOULD BE A SOLID PERFORMER IN BOTH THE DRY, WET, AND SNOW AND INSTEAD, SOME OWNERS HAVE TO PAY NOT ONCE TO REMEDY THIS UNIT THAT'S FAILING ON ALL OUR CARS, BUT I'VE HEARD OF OWNERS HAVING TO DO IT TWO AND EVEN THREE TIMES.  OWNERS ARE TRYING TO SAVE MONEY BY BREAKING DOWN THE UNIT AND REPAIRING THE INTERNAL MOTOR. PEOPLE ARE EXPERIMENTING WITH WAYS TO PREVENT THE UNITS THEY PURCHASE TO PREVENT THEM FROM RUSTING AND CORRODING.    PLEASE PLEASE PLEASE CONTACT MITSUBISHI AND HELP US??  *TR",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574792,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SYSTEMS ACD PUMP SYSTEM HAS FAILED.  *TR",
        "vin": "JA3AW86V88U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567112,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACD PUMP WENT OUT ON MY CAR. NO REAL REASON OTHER THAN THE LIE OF IT BEING COLD.... 20 DEGREES ISN'T TO COLD TO ME. EITHER WAY, WITHOUT THE ACD PUMP THE CARS AWD DOESN'T WORK TO STANDARD. WHAT AWD CAR ISN'T MADE FOR COLD. RIDICULOUS. HAPPENS TO ALOT OF EVOS. NEEDS RECOGNIZED AND RECALLED. ALSO MY TIMING CHAIN WENT AT 36K. NO TIMING CHAIN SHOULD GO OUT THAT EARLY NO MATTER WHAT. THEY TOLD ME ITS BECAUSE I DIDN'T CHANGE THE OIL TILL THEY DROPPED THE OIL PAN AND SAW THAT THEY WERE WRONG. THE CHAIN ISN'T MEANT TO HANDLE THE TORQUE OF THE CAR. THAT'S A MANUFACTURE MESS UP. ANOTHER ONE THAT SHOULD BE A RECALL WITH THE AMOUNT OF PEOPLE THAT HAVE/HAD THE ISSUE. AND ONE MORE, THE P.O.S. FUEL RELAY THAT DIES ON YOU AND COULD POSSIBLY BLOW YOUR MOTOR. THE FUEL PUMP AND TIMING CHAIN HAVE BOTH BEEN UPDATED YET NOT RECALLED. WHY? DOESN'T MAKE SENSE THAT THEY NOTICE THE PROBLEM, MAKE A NEW PART FOR THE PROBLEM, BUT DON'T FIX IT UNDER THEIR MISTAKE.   *TR",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562067,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY COLD DAY OUT, ABOUT -15 F, WARMED UP MY VEHICLE FOR ABOUT 5 MINUTES PLUS.  ONCE I BEGAN DRIVING, ABOUT 10 MPH MY SERVICE REQUIRED LIGHT CAME ON FOR MY AYC PUMP.  DEALER SAID THAT IS WAS NOT COVERED UNDER WARRANTY OF ANY KIND.  MITSUBISHI HAS KNOWN THAT IS A COMMON ISSUE IN COLD CLIMATES THAT USE SALT ON THE ROADS.  THE SALT CORRODES THE PUMP AND MAKES IT FAULTY/MALFUNCTION.  THIS IS A SAFETY ITEM THAT NEEDS TO BE RECALLED DUE TO THE KNOWLEDGE THAT AN EVO DRIVER HANDLES THEIR CAR [THAT THEY PURCHASED AS SUCH] AND LOOSES THAT RIGHT WITH A FAULTY AYC PUMP.  *TR",
        "vin": "JA3AW86V78U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558783,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR AND THE AWC SERVICE LIGHT CAME ON. IT WAS ABOUT 0 DEGREES OUT THAT DAY, WHICH IS A VERY UNUSUAL TEMPERATURE FOR S. INDIANA. WHEN I STARTED THE CAR IT SCREECHED FOR JUST A SECOND AND THEN POPPED UP THE CODE. I RESTARTED THE CAR, JUST AS THE MANUAL HAD SAID AND WHEN I RESTARTED IT THE LIGHT WAS STILL ON. I WAS ABLE TO GET THE CODE READ IT  THREW A C161E CODE WHICH IS AN ACD/AYC PROBLEM. AFTER DOING A LOT OF RESEARCH I FOUND OUT ITS A COMMON PROBLEM AND ITS AN EXPENSIVE PROBLEM, ABOUT $2,000+. I CALLED THE DEALER AND WAS TOLD MY WARRANTY DOES NOT COVER THIS, IT IS NOT PART OF THE POWER TRAIN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/30/2013",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557872,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR AND THE AWC SERVICE LIGHT CAME ON.  I CAME TO A CONTROLLED STOP, AND RESTARTED THE CAR PER THE INSTRUCTIONS IN THE VEHICLE MANUAL.  UPON RESTART, THE SAME SERVICE LIGHT CAME ON.  AFTER THE DEALER RAN A DIAGNOSTIC, IT WAS FOUND THAT THE HIGH PRESSURE PUMP FOR THE ACTIVE STABILITY CONTROL SYSTEM HAD FAILED. I WAS TOLD THAT THIS PART WAS NOT PART OF THE DRIVE TRAIN AND WOULD NOT BE COVERED UNDER WARRANTY.  THE DAY THE PUMP FAILED IT WAS VERY COLD AND THERE WAS PACKED SNOW ON THE ROADWAYS. IF I WAS DRIVING AT HIGHER SPEEDS AND THIS PUMP HAD FAILED, I BELIEVE THE AUTOMOBILE WOULD NOT HAVE BEHAVED AS EXPECTED WITH THE AWC STABILITY ACTIVE.  *TR",
        "vin": "JA3AW86V58U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/24/2013",
        "dateOfIncident": "12/17/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557147,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS REPORT OF A KNOWN FAILURE BY MITSUBISHI MOTOR CORP.    AT 50,800 MILES ON 12/17/2013 MY CARS SUPER-ACTIVE CENTER DIFFERENTIAL (S-ACD) STARTED BLINKING AT ME.  IT WOULD NOT ALLOW CHANGING OF THE SETTINGS ANYMORE FOR TARMAC/GRAVEL/SNOW.  IMMEDIATELY THERE AFTER, THE DRIVER INFORMATION PANEL POPPED UP WITH A YELLOW \"AWD SERVICE REQUIRED\" INDICATOR.  I BROUGHT MY CAR TO NASHUA, NH MITSUBISHI/HYUNDAI FOR DIAGNOSIS ON 12/19/2013.  THERE THEY APPLIED TSB-SC11-002.  THIS UNFORTUNATELY DID NOT RESOLVE THE ISSUE.  I WAS THEN INFORMED THAT THE CAR REQUIRED A REPLACEMENT ACD PUMP AND WAS QUOTED $1,995 FOR THE REPAIR, WHICH CONFUSED ME DUE TO THE FACT THAT MY CAR WAS STILL UNDER MANUFACTURERS POWER TRAIN WARRANTY, AND A PUMP, THAT CONTROLS THE AWD SYSTEM OF A CAR, SEEMS TO BE POWER TRAIN RELATED, AT LEAST IN MY EYES.  THE NORTH EAST REGIONAL REPRESENTATIVE WAS CONTACTED ON MY BEHALF BY THE DEALERSHIP TO REQUEST COVERAGE OF THIS ITEM, WHICH WAS ULTIMATELY DENIED.    THIS IS A SEVERE SAFETY ISSUE, AS THE CAR NO LONG HANDLES PROPERLY IN CONDITIONS IT WAS DESIGNED FOR.  I AM NO LONGER ABLE TO SELECT THE CAR FOR SNOW, LIVING IN THE NORTH EAST, DRIVING A CAR MARKETED IN THE NORTH EAST, THIS IS A HUGE PROBLEM.    TO FURTHER THE ISSUE, THIS PROBLEM IS WELL KNOWN BY MITSUBISHI, IT HAS BEEN DOCUMENTED WELL, TRACING ALL THE WAY BACK TO CARS MANUFACTURED IN 2006.  90% OF ALL PUMP FAILURES COULD BE COMPLETELY ELIMINATED BY ADDING A SEAL TO STOP CORROSION INSIDE THE PUMP WHICH LEADS TO THE UNTIMELY FAILURES.  IF NO RECALL IS ISSUED FOR THIS FAILURE, AT THE VERY LEAST, MITSUBISHI MOTORS SHOULD BE FORCED TO COVER THIS UNDER POWER TRAIN WARRANTY FOR 5YRS/60K MILES.  INSTEAD OF LIMITING IT TO 3YRS/36K BUMPER TO BUMPER.    LINK TO DOCUMENTED CASES - HTTP://FORUMS.EVOLUTIONM.NET/EVO-X-GENERAL/655162-THOSE-YOU-ACD-PUMP-FAILURES-MERGED.HTML.  *TR",
        "vin": "JA3AW86V28U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555812,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO COLD WEATHER HERE IN MN, MY SAWC PUMP HAS FAILED(ALL WHEEL DRIVE CONTROL UNIT, HYDRAULIC PUMP FAILS DUE TO COLD WEATHER). I'VE RESEARCHED AND MANY PEOPLE WITH THE SAME MAKE AND MODEL HAVE HAD ISSUES OF THE SAME. BOUGHT THE CAR IN FEB 2013, USED WITH 38KMILES. IM AFRAID THE DEALER WONT COVER THE EXPENSES OF GETTING THIS REPLACE. IT IS A KNOWN ISSUE AS I'VE RESEARCHED WITH MANY PEOPLE COMPLAINING.  *TR",
        "vin": "JA3AW86V48U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/04/2013",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554876,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING VEHICLE AND WARNING LIGHT \"SERVICE REQUIRED\" AND A SYMBOL INDICATING THE ALL-WHEEL DRIVE SUSPENSION APPEARED.  HAD CODE READ AND MY VEHICLE SUFFERED A ACD PUMP FAILURE.  IT IS A CRUCIAL FEATURE TO THE SOPHISTICATED AWD STABILITY CONTROL SYSTEM THAT MAKES AN EVO \"SPECIAL\".  THIS IS A PART OF THE DRIVE TRAIN THAT IS NOT COVERED IN THE DRIVE TRAIN WARRANTY.  THEY ALL FAIL AND THEY ARE EXPENSIVE AND THEY BECOME CORRODED DUE TO LOCATION, DESIGN, AND LACK OF PROPER PROTECTION FROM THE ELEMENTS AND ROAD SPLATTER.  THIS SHOULD BE A RECALLED ITEM FROM THE MANUFACTURER.  THIS IS NOT CAUSED BY ANYTHING OTHER THAN POOR DESIGN ALLOWING FOR A CORROSION PROBLEM THAT LEADS TO PUMP FAILURE.  *TR",
        "vin": "JA3AW86V68U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2013",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552515,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "(COMPLAINT IS APPLICABLE ONLY TO GSR TRIM EQUIPPED WITH A 5MT TRANSMISSION)    - DIFFICULTY SHIFTING FIRST TO SECOND GEAR, AND SECOND TO THIRD. GEARSHIFT IS NOTCHY AND HARD TO ENGAGE. CAUSES LONGER THAN DESIRABLE TIME-GAP IN POWER TO THE WHEELS, RESULTING IN LOSS OF SPEED DURING ACCELERATION PHASE FROM A STOP.  - GEARSHIFT IS NOT SMOOTH IN GENERAL. KEYWORDS : NOTCHY, GRINDING.  - IT IS A WIDELY REPORTED PROBLEM IN THIS PARTICULAR MODEL AS EVIDENT FROM OWNER SURVEYS ON A PROMINENT INTERNET FORUM (SEE HTTP://FORUMS.EVOLUTIONM.NET/EVO-X-ENGINE-TURBO-DRIVETRAIN/333385-OFFICIAL-EVO-X-NOTCHY-GRINDING-TRANSMISSION-THREAD.HTML).  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551385,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 08 EVO IS GETTING THE \"SERVICE REQUIRED\" LIGHT INDICATING THE S-AWC PUMP HAS FAILED. I HAVE DONE SOME RESEARCH AND A LOT OF THE EVO'S ARE GETTING THIS. ITS B/C THE PUMP LOCATED BEHIND THE PASSENGER SIDE REAR TIRE IS EXPOSED THE ELEMENTS AND GET CORRODED, ALSO THE LIQUID GETS TOO THICK IN THE WINTER AND THE FLUID CANNOT FLOW PROPERLY AND THE PUMP FAILS. MINE FAILED 2 MONTHS OUTSIDE OF THE DRIVE TRAIN WARRANTY IN MIND JUNE IN NEBRASKA SO IT WAS MID 70'S AT LEAST, CALLED THE DEALER AND THEY WANT $120 JUST TO LOOK AT IT THEN $2000+ TO REPLACE THE PUMP. FAULTY PARTS LIKE THIS NEED TO BE COVERED UNDER WARRANTY. MY CAR IS ALSO 100% STOCK.  *TR",
        "vin": "JA3AW86V18U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543666,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BECAUSE OF THE LOCATION (REAR WHEEL WELL) AND DESIGN OF MITSUBISHI'S ACTIVE CENTER DIFFERENTIAL PUMP, THEY ARE PRONE TO FAILURE. SEVERAL FACTORS AID IN THE GALVANIZED CORROSION OF THE PUMP'S INTERNAL PLATE, SOME OF WHICH INCLUDE TEMPERATURE FLUCTUATION AND WEATHER. VEHICLES THAT ARE IN SERVICE THROUGHOUT THE SNOW BELT STATES IN THE US AND WELL INTO CANADA SEEM TO BE THE MOST AFFECTED.     MY VEHICLE WAS JUST OUTSIDE OF THE VEHICLE WARRANTY RANGE FOR TIME BUT VERY WELL INSIDE THE RANGE FOR MILEAGE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/15/2013",
        "dateOfIncident": "12/19/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543685,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS EQUIPPED WITH AN ACTIVE CONTROL DIFFERENTIAL (ACD) WHICH IS ACTUATED BY THE ACD HYDRAULIC PUMP. THE ACD IS A PART OF THE VEHICLE'S ALL WHEEL DRIVE SYSTEM.  AFTER GIVING THE ENGINE AN 8 MINUTE WARM UP ON IDLE, THE VEHICLE WAS BEING DRIVEN ON A 20F OF AMBIENT TEMPERATURE. THE VEHICLE WAS ON A STOP LIGHT, AND UPON GENTLY ACCELERATING THE CAR ON GREEN LIGHT A WARNING LIGHT CAME UP ON THE VEHICLE'S DASH BOARD. THE VEHICLE WAS BROUGHT TO THE NEAREST MITSUBISHI SERVICE SHOP 4 DAYS AFTER THE INCIDENT WITH THE WARNING LIGHT STILL ON THE VEHICLE'S DASH BOARD. AFTER SERVICE TECHNICIAN WORKED ON THE VEHICLE, THE SERVICE MANAGER SAID THAT THE ACD PUMP IS THE PROBLEM WHICH NEEDS TO BE REPLACED AND WILL COST $2100 OF PARTS AND LABOR. 8 MONTHS PRIOR TO THE INCIDENT, THE MITSUBISHI SERVICE SHOP RE-FLASHED MY VEHICLE'S ALL WHEEL DRIVE ECU TO SPECIFICALLY PREVENT THE FAILURE OF THE PUMP ESPECIALLY IN COLD ENVIRONMENTS. MITSUBISHI REPLACED THE ACD PUMP AT MY EXPENSE, AND IT'S BEEN APPROXIMATELY 2 YEARS THAT MY VEHICLE IS ON THE REPLACEMENT PUMP. THE SERVICE MANAGER TOLD ME THAT THE COMBINATION OF THE HYDRAULIC FLUID BECOMING THICK ON COLD WEATHER AND THE CORROSION ON THE HYDRAULIC PUMP THAT THE SALTED WINTER ROADS BRING IS WHAT MAKES THE ACD PUMP FAIL. AFTER RESEARCHING ON THE INTERNET CAR FORUMS, THIS OCCURRENCE WHERE THE ACD PUMP FAILS ON COLDER REGIONS IS NOT UNCOMMON EVEN WITH THE PREVIOUS GENERATIONS OF THIS VEHICLE THAT ARE EQUIPPED WITH THIS ACD SYSTEM.  *TR",
        "vin": "JA3AW86V08U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2013",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524728,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED MY CAR 1N 30 DEGREE WEATHER AND LET IT IDLE FOR A COUPLE MINUTES PULLED OUT ON MY STREET WHERE I LIVE AND MY ACD/AYC  QUIT WORKING I HAD A  PICTURE OF ALL FOR WHEELS ON MY INFO CENTER WITH THE FRONT WHEEL ON AN ANGLE . TOOK IT TO THE DEALER AND THEY SAID MY ALL WHEEL DRIVE PUMP WAS BAD AND THAT SINCE MY CAR IS AN EVO IT WAS NOT COVERED.I PAID TO HAVE IT FIXED AND GOT MY CAR BACK AND MY TIMING CHAIN BROKE DEALER SAID IT WAS NOT COVERED ALSO SINCE IT WAS AN EVO 3500.00 IN 1 MONTH.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2013",
        "dateOfIncident": "07/08/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524005,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE S-AWC OR SUPER ALL WHEEL CONTROL SYSTEM ON THE MITSUBISHI LANCER EVOLUTION HELPS THE ALL WHEEL DRIVE TO ACTUALLY WORK.  I HAD A SERVICE MESSAGE POP UP ON MY CAR WITH THE S-AWC SYSTEM BEING INDICATED.  AFTER REVIEWING THE CAR'S MANUAL AND THE INTERNET TO HELP DIAGNOSE THE ISSUE OF WHY IT WAS CAUSING IT, I'M TOLD THERE IS AN EVER-INCREASING NUMBER OF VEHICLES WITH THIS S-AWC PUMP FAILURE EITHER IN SUPER COLD CONDITIONS OR VERY HOT CONDITIONS.  THIS HAS THE POTENTIAL TO BE VERY DANGEROUS IF THE PUMP ENDS UP GOING OUT WHEN SOMEONE IS MAKING A TURN OR IS RELYING ON THE ALL-WHEEL DRIVE TO ACTUALLY WORK IN ADVERSE CONDITIONS.  THE ONLY NOTABLE CHANGE IS A DIFFERENCE IN STEERING FEEL AND THE SERVICE MESSAGE POPPING UP AFTER SEVERAL MINUTES OF DRIVING, THOUGH DUE TO SAFETY REASONS, I AM TRYING NOT TO PUSH THE CAR TOO HARD UNTIL THE PROBLEM IS ADDRESSED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "05/17/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523311,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AWC PUMP STARTED TO FAIL.  IT IS NOW COMPLETELY FAILED AND NOT WORKING.  AFTER SOME RESEARCH DETERMINED THAT IT IS A COMMON PROBLEM ON THESE VEHICLES DUE TO NOT BEING SEALED PROPERLY AND CORROSION GETTING IN TO DAMAGE THE PUMP MOTOR.   PART SHOULD BE RECALLED/REPLACED UNDER WARRANTY BUT THEY REFUSE TO DO SO.  *TR",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "06/03/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521134,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS DISPLAYING AN S-AWC SERVICE LIGHT, IT HAS YET TO BE DIAGNOSED BY THE DEALERSHIP BUT I HAVE BROUGHT IT IN PREVIOUSLY FOR THE SAME ISSUE. LOOKING ONLINE THERE IS A WHOLE MASS OF FORUMS STATING THAT AT 40,000+ MILES THE AYC PUMP BREAKS. THIS SEEMS RATHER SUSPECT GIVEN SO MANY INDIVIDUALS ARE EXPERIENCING THE SAME PROBLEM WITHIN THE SAME TIME SPAN. MITSUBISHI HAS BEEN REPORTEDLY TURNING DOWN WARRANTY COVERAGE FOR THIS UNDER THEIR POWER-TRAIN WARRANTY, WHILE I AM UNSURE IF THEY WILL DO THE SAME FOR ME, THE ISSUE IS SEEMINGLY PREVALENT ENOUGH THAT THEY SHOULD KNOW ABOUT IT.  *TR",
        "vin": "JA3AW56V98U"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "02/18/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513075,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A VERY COMMON PROBLEM ON THE MITSUBISHI EVO X IF YOU LIVE IN A COLD AREA AND ROADS ARE SALTED FOR SNOW. THE LOCATION OF THE AWC PUMP IS NOT ENCLOSED ENOUGH SO THE SALT, ROAD CRAP GETS TO THE PUMP AND IT FAILS. MITSUBISHI SAID IT WOULD COST $2 GRAND TO REPLACE THE PUMP. YES $2 GRAND FOR A PUMP!!! MITSUBISHI NEEDS TO STEP UP AND DO SOMETHING ABOUT THIS. I KNOW MANY PEOPLE THAT HAVE HAD THIS HAPPEN AND READ ABOUT THOUSANDS OF OTHERS. PLEASE HELP!  *TR",
        "vin": "JA3AW86V68U"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "03/13/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511795,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER (APPROXIMATELY 40 DEGREES OR LESS) DURING THE EVENING, MY SUPER ALL-WHEEL-CONTROL SERVICING LIGHT WAS TRIGGERED DURING A LOW SPEED TURN. THIS INDICATES A FAULTY OR FAILING AWC/AYC PUMP, A MECHANICAL COMPONENT WHICH PROVIDES AYC FLUID TO THE FRONT AND REAR DIFFERENTIAL OF THE VEHICLE, AIDING IN STABILITY CONTROL. WHEN THE PUMP IS INOPERABLE, DECREASED (OR NO) PRESSURE/FLUID IS SENT TO THE DIFFERENTIALS OF THE VEHICLE, WHICH CAN CAUSE SERIOUS DRIVETRAIN DAMAGE AND FAILURE-- THUS THE AYC PUMP IS RECOGNIZED BY MITSUBISHI AS A CRITICAL COMPONENT OF THE DRIVE TRAIN. HOWEVER, IT IS NOT COVERED UNDER MITSUBISHI'S 5 YEAR/60,000 MILE DRIVETRAIN WARRANTY, WHICH I FEEL IS DISINGENUOUS. THIS IS A A SERIOUS SAFETY CONCERN AS A FAULTY OR FAILED PUMP EFFECTIVELY DISABLES THE AWD COMPONENT OF THE VEHICLE AND MAKES THE DRIVE TRAIN MORE LIKELY TOSUFFER CATASTROPHIC DAMAGE DURING USE, WHICH CAN RESULT IN CRASHES AND INJURY. MITSUBISHI IS AWARE OF THIS ISSUE AND THAT THESE PUMPS ARE POORLY-DESIGNED FOR PROVIDING THE AYC FLUID TO THE DIFFERENTIALS DURING COLD WEATHER; THE FLUID BECOMES EXTREMELY VISCOUS AT LOW TEMPERATURES AND THE PUMP IS EITHER UNABLE TO CONTINUE TO FLOW THE FLUID TO NECESSARY COMPONENTS OR THE PUMP COMPLETELY FAILS IN THE ATTEMPT, REQUIRING EXPENSIVE REPLACEMENT AT THE OWNER'S EXPENSE.  *TR",
        "vin": "JA3AW86V38U"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/09/2013",
        "dateOfIncident": "04/22/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511216,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY 2013 APRIL 22 I [XXX] (OWNER OF VEHICLE) WAS GETTING OFF MY SHIFT AT APPROXIMATELY 0700 HOURS FROM BETHEL TWP PD; WHERE I WORK AS A PATROLMAN. THE TEMPERATURE WAS FAIRLY MILD 60-65F, I STARTED MY 2008 MITSUBISHI EVOLUTION 10 TO LET IT WARM UP LIKE I ALWAYS HAVE FOR APPROXIMATELY TEN MINUTES. I PUT MY EVO IN GEAR AND ON THE CENTER L.E.D. SCREEN I RECEIVED THE C161 MESSAGE WHICH INDICATES S-AWC FAILURE OR SUPER ALL WHEEL CONTROL. THIS EFFECTS EVERYTHING WITH THE CARS' SUSPENSION STABILITY, YAW CONTROL, AND THE \"SMART BREAKING\" FEATURE. FOR AN UN-EXPERIENCED DRIVER THIS COULD BE CATASTROPHIC. KNOWING THE IMPORTANCE OF THIS I WAS FORCED TO BRING THE CAR TO SPRINGFIELD MITSUBISHI IN SPRINGFIELD, PA. 1(484)574-8434. NOW I'M STUCK WITH A $2132.00 BILL AND THE CAR IS STILL IN THE LOT BECAUSE I DON'T HAVE THE $2132.00 TO \"SHELL\" OUT.   I WENT TO TWO SEPARATE FORUMS WWW.EVOXFORUMS.COM AND WWW.EVOLUTIONM.NET, AND I DON'T KNOW WHATS SCARIER THE THOUSANDS THAT HAVE THIS PROBLEM AND ARE TOLD BY THEIR LOCAL DEALER ITS SAFE TO OPERATE IN THAT CONDITION OR THE FACT THAT NO BODY IS DOING ANYTHING TO ASSIST OR FIX THE PROBLEM. PLEASE BE THE ONES WHO MAKE THE DIFFERENCE HERE..... THANK YOU     [XXX]    PS I APOLOGIZE I AM WRITING YOU AGAIN, I NEVER RECEIVED ANY RESPONSE THE FIRST TIME.......      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "JA3AW86V68U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "03/14/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510105,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AFTER I PURCHASED MY USED EVO X WITH 30,000 MILES AND A 5 YR/ 60,000 MILE WARRANTY,  I NOTICED A PUDDLE OF FLUID ACCUMULATING WHILE IT WAS PARKED IN THE REAR PASSENGER SIDE OF THE VEHICLE. I SOON DID RESEARCH TO DETERMINE WHERE IT WAS COMING FROM. I LEARNED MY AYC/ACD PUMP IS LEAKING, AFTER FURTHER INVESTIGATING IT TURNS OUT THIS PUMP IS NOTORIOUS FOR LEAKING AND FAILING. THE MITSUBISHI DEALER DENIED MY WARRANTY CLAIM AND I WAS NEVER GIVEN A REASON, EVEN AFTER ASKING WHY. I HAVE SINCE THEN CONTACTED A THIRD PARTY DISPUTE CENTER. THIS PUMPS THE NECESSARY FLUID TO THE FRONT AND REAR OF THE ALL WHEEL DRIVE ASSEMBLIES. IF THIS PUMP FAILS, IT WILL ULTIMATELY DESTROY THE ENTIRE DRIVE TRAIN/ ALL WHEEL DRIVE SYSTEM. RESULTING IN IT LOCKING UP, CAUSING THE DRIVER TO LOOSE CONTROL. AS FAR AS I KNOW, THE DRIVER OF THE VEHICLE IS UNABLE TO CAUSE THIS PART TO BE FAULTY, UNLESS IT IS DAMAGED, THEREFORE IS A DEFECTIVE PART AND SHOULD BE REPLACED OR FIXED TO INSURE THE SAFETY OF ITS DRIVER AND OTHERS ON THE ROAD.  *TR",
        "vin": "JA3AW86V08U"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2013",
        "dateOfIncident": "04/20/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509135,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SATURDAY MORNING I WARMED UP MY CAR FOR 5 MINUTES.  STARTED TO DRIVE MY CAR FOR ABOUT 15 SECONDS, AWD SERVICE REQUIRED POPPED UP ON MY DISPLAY.  I STOPPED THE CAR AND BROUGHT IT BACK HOME.  LOOKED UP WHAT THE ISSUE COULD BE AND FOUND OUT THAT THE ACD PUMP HAS FAILED.  THIS IS A WELL KNOWN PROBLEM FROM MITSUBISHI  FOR THESE CARS AND THEY HAVE NOT ISSUED A RECALL OR REAL FIX.  WITHOUT THE ACD PUMP FUNCTIONING, THERE IS A POSSIBILITY THAT THE CAR CAN LOSE TRACTION IN CERTAIN SITUATIONS OR DAMAGE THE ENTIRE DRIVETRAIN SYSTEM. MITSUBISHI CLAIMS THAT ITS NOT PART OF THE DRIVETRAIN SO THERE IS NO WARRANTY AND IT'S ALSO A \"LUXURY\" SYSTEM. CONTROLLING WHEEL TRACTION IS NOT A LUXURY ITS A SAFETY FEATURE.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2012",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464798,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 72,000 MILES I WAS EXPERIENCING ISSUES THAT HAD TO DO WITH THE IDLING OF MY CAR. AT STOPLIGHTS IT WOULD DIE UNEXPECTEDLY AND/OR JUST IDLE EXTREMELY ROUGH AS THE RPM'S WOULD LOWER. I TOOK IT IN TO GET IT REPAIRED AND IT  WAS DIAGNOSED (BY MITSUBISHI) AS A TIMING BELT THAT WAS STRETCHED. I LOOKED ONLINE AN FOUND SCORES OF 2008 EVO'S WHO HAVE EXPERIENCED SIMILAR ISSUES RIGHT AROUND THE SAME TIMEFRAME (AROUND 70K MILES). CLEARLY THIS IS A COMMON ISSUE, YET OUT OF WARRANTY BY 10K. I ALSO LOOKED ONLINE TO SEE IF THEY HAD YET TO MODIFY THE REPLACEMENT TIMING CHAIN AND MITSUBISHI HAD MANUFACTURED A NEW TIMING CHAIN THAT DOESN'T HAVE THE CERTAIN DEFECTS AS OF JANUARY 2012. SHOULD THIS NOT BE A RECALL ITEM CONSIDERING THAT SO MANY OF US ARE EXPERIENCING THE SAME ISSUE? ESPECIALLY CONSIDERING THAT A REPLACEMENT CHAIN HAD BEEN MADE TO CORRECT THESE THINGS?  *TR",
        "vin": "JA3AW56V58U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2012",
        "dateOfIncident": "09/22/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454451,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A STRONG FUEL SMELL IN THE CABIN WHEN I AM ON THE HIGHWAY DOING 70MPH, I HAVE TRIED TO CHECK IT OUT BUT THERE ARE NO APPARENT FUEL LEAKS, MY MECHANIC SUSPECTS THE EVAPORATOR SYSTEM.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453773,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI LANCER EVOLUTION. THE CONTACT STATED THE AIR BAG LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THE AIR BAG SENSORS WERE CORRODED. THE DEALER ADVISED HIM THAT THERE WAS A RECALL FOR THE AIR BAG SENSOR, BUT THE VEHICLE WAS NOT INCLUDED. THE CONTACT SPOKE WITH THE MANUFACTURER WHO CONFIRMED THE VEHICLE WAS NOT INCLUDED IN NHTSA RECALL CAMPAIGN NUMBER (09V435000) AIR BAG: FRONTAL: SENSOR CONTROL MODULE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 37,000 AND THE CURRENT MILEAGE WAS 39,986.   UPDATED 04/26/12 *BF  UPDATED 05/10/12",
        "vin": "JA3AW86V08U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2011",
        "dateOfIncident": "08/08/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418324,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 MITSUBISHI LANCER EVOLUTION MR CABIN FUEL FUMES / STRONG SMELL. WHEN AIR TEMPERATURES RISE ABOVE 100* THE CAR HAS A STRONG FUEL SMELL, TO THE POINT OF NOT BEING ABLE TO SAFELY DRIVE THE CAR DUE TO THE FUEL SMELL INSIDE THE PASSENGER CABIN.  *TR",
        "vin": "JA3AW56V18U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2011",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417742,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SMELL OF RAW FUEL ENGULFING THE INSIDE OF THE CAR MAKING IT NEAR UNBEARABLE TO DRIVE WITHOUT FEELING DIZZY OR SICK. THIS CAN'T BE SAFE. NO VISIBLE LEAKS AND THE DEALER CANNOT FIGURE OUT WHY THIS IS HAPPENING. THIS IS UNSAFE AND I'M ASSUMING CAN LEAD TO A FIRE. IT CAN ALSO INCAPACITATE THE DRIVER AND PASSENGERS DUE TO THE FUMES WHICH COULD CAUSE AN ACCIDENT IF THIS HAPPENS WHILE THE CAR IS IN MOTION.  *TT",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2011",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396948,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "DUNLOP",
                "productModel": "DIREZZA SPORT ZI",
                "productYear": "9999",
                "size": "P255/35R18",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 MITSUBISHI LANCER EVOLUTION EQUIPPED WITH DUNLOP DIREZZA SPORT ZI TIRES, TIRE SIZE 255/35R18. THE CONTACT WAS DRIVING APPROXIMATELY 65 MPH WHEN A LOUD FLAPPING NOISE WAS HEARD FROM OUTSIDE OF THE VEHICLE. THE CONTACT CONTINUED DRIVING AT A REDUCED SPEED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT TIRE CENTER WHERE THEY INFORMED THAT THE REAR PASSENGER'S SIDE TIRE EXHIBITED SEVERE TREAD SEPARATION AND THE TIRE WAS REPLACED. THE APPROXIMATE FAILURE MILEAGE WAS 39,000. THE DOT NUMBER WAS UNKNOWN.",
        "vin": "JA3AW56V28U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2011",
        "dateOfIncident": "01/23/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384228,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 LANCER EVOLUTION. THE SERVICE REQUIRED LIGHT FOR THE ALL WHEEL DRIVE SYSTEM CAME ON. I ONLY HAD AROUND 59000 MILES ON THE CAR WHEN THIS HAPPEN. I TOOK IT TO THE DEALERSHIP AND THEY SAID IT WAS AN INTERNAL FAULT IN THE AWC PUMP. THEY SAID IT WOULD COST $2250 PLUS TAX TO REPLACE. SO I CALLED MITSUBISHI TO SEE IF THEY WOULD REPLACE THE PUMP FOR FREE SINCE IT IS A SAFETY CONCERN. THEY SAID NO SINCE MY 3 YEAR OR 36000 MILE WARRANTY WAS UP. A LOT OF EVOLUTIONS IN COLDER CLIMATES HAVE BEEN HAVING THIS SAME PROBLEM. THE COLD WEATHER MAKES THE FLUID IN THE AWC PUMP TO THICK AND IT CAUSES IT TO BURN UP. WITHOUT THE PUMP WORKING THE ALL WHEEL DRIVE SYSTEM IS NOT FUNCTIONING RIGHT AND MAY CAUSE A WRECK IF IT LOCKS UP. MITSUBISHI EVEN RELEASED AN AWC ECU REPROGRAMMING FLASH TO TRY TO KEEP THE PUMPS GOING OUT IN COLD WEATHER. I LIVE IN VIRGINIA WHICH WAS ONE OF THE STATES THEY LISTED FOR THE REFLASH. THEY KNOW THIS IS A KNOWN PROBLEM BUT REFUSE TO REPLACE MY PUMP WITH THE NEW MODEL. THIS IS THEIR FAULT. I SHOULDN'T HAVE TO PAY FOR A NEW PUMP.  *TR",
        "vin": "JA3AW86V48U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/26/2010",
        "dateOfIncident": "05/14/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345390,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI EVOLUTION X (N/A). THE CONTACT STATED WHILE DRIVING AT 45 MPH, HE DEPRESSED THE ACCELERATOR PEDAL AND THE PEDAL FRACTURED FROM THE VEHICLE. THE CONTACT STATED THE STUB WAS STILL INTACT AND HE WAS ABLE TO DRIVE BY APPLYING PRESSURE TO THE STUB. THE DEALER WAS CONTACTED AND THEY ADVISED THAT THEY HAD NOT RECEIVED ANY COMPLAINTS SIMILAR TO HIS AND WOULD NOT PROVIDE ANY ASSISTANCE. THE VEHICLE WAS NEITHER DIAGNOSED NOR REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 10,000 AND THE CURRENT MILEAGE WAS 15,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/12/2009",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287130,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MITSUBISHI MOTORS OF AMERICA HAS A AWD ECU SOFTWARE UPDATE FOR VEHICLES SPECIFICALLY DRIVEN IN COLD CONDITIONS. DEALERSHIPS AND MITSUBISHI CORPORATE HAVE DENIED MY CLAIM TO OBTAIN THIS SOFTWARE BECAUSE MY CAR WAS SOLD IN CALIFORNIA AND THEY HAVE SAID IT IS NOT ELIGIBLE. I TAKE MY VEHICLE EVERY YEAR UP IN THE SIERRA NEVADA MOUNTAIN RANGE WHERE TEMPERATURE CONDITIONS ARE SIMILAR TO ANY OF THE NORTHERN STATES WITHIN THE SERVICE BULLETIN. THE MITSUBISHI SERVICE BULLETIN NUMBER IS SC-09-002 ALSO AVAILABLE HERE ON GOOGLE DOCS TO READ ( HTTP://DOCS.GOOGLE.COM/FILEVIEW?ID=0BZNIGP9LGBK8NTU5OTRINJGTZTJHMC00MJY0LWI2NMMTOWZHZJU1NZFKNDCZ&HL=EN)    IT STATES THAT \"THIS REPROGRAMMING PROCEDURE WILL MODIFY THE ALL-WHEEL-CONTROL (AWC) ECU SOFTWARE TO ACCURATELY  MATCH THE OPERATIONS CHECK OF THE AYC/ACD MOTOR WITH CURRENT AMBIENT CONDITIONS. EXTREMELY COLD  WEATHER CAUSES INCREASED EXCESSIVE LOAD ON THE MOTOR, WHICH COULD RESULT IN DAMAGE TO THE MOTOR. THIS  BULLETIN DESCRIBES PROCEDURES TO REPROGRAM THE AWC ECU WITH NEW SOFTWARE PARAMETERS TO PREVENT THIS  CONDITION.\"    THE SAFETY CONCERN IS THAT IF I'M USING MY AWD VEHICLE IN COLD CONDITIONS AND THE CRITICAL AWD COMPONENTS FAIL DUE TO DRIVING IN COLD CONDITIONS AS STATED IN THE SERVICE BULLETIN AND CAUSE ME TO HAVE AN ACCIDENT OR EVEN HURTING OTHERS WHICH CAN BE PREVENTED WITH A 20 MINUTE SOFTWARE UPDATE THAT IS AVAILABLE NOW. *TR",
        "vin": "JA3AW86V28U"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/06/2009",
        "dateOfIncident": "10/06/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286586,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASE MY 2008 MITSUBUSHI EVOLUTION X ABOUT ONE MONTH AGO WITH 2,900MILES. I DON'T DRIVE IT OFTEN SINCE I HAVE A COMPANY CAR. MY CURRENT MILES IS 4,400MILES. I AM BEGINNING TO NOTICE ALOT OF SMALL CHIPS TOWARD THE BACK DOORS BOTTOM CORNER NEAR QUARTER PANEL ON BOTH SIDE OF THE VEHICLE. BEEN ON MANY FORUMS AND ALOT OF EVO X OWNER ARE EXPERIENCING THE SAME PAINT PROBLEM.THE ROAD CONDITION HERE ARE IN GOOD SHAPE, SO I DON'T SEE WHY THE PAINT IS CHIPPING AWAY. IM AFRAID WHEN I REACH 10,000MILES, THE CAR INTERIOR WOULD STILL BE FAIRLY NEW BUT THE EXTERIOR WOULD HAVE PAINT CHIPPED EVERYWHERE. ANOTHER ISSUE ARE THE RECARO SEAT FABRIC ARE COMING OUT NEAR THE HEAD REST PART. THE FABRIC ARE CONING OUT RIGHT WHERE THE FABRIC TUCK UNDER INTO THE CARBON FIBER LOOKING PLASTIC PIECE NEAR THE HEADREST. YOU ARE ABLE TO SEE THE STAPLES THAT ARE COMING OUT. THIS IS HAPPENING TO BOTH SEATS, DRIVER AND PASSENGER. I HAVE READ SEVERAL FORUMS BUT OWNERS WHO HAVE SPOKE TO MITSUBISHI ABOUT THE PAINT ISSUE WERE TURN DOWN.THOSE OWNER SAID MITSUBISHI ARE NOT WILLING TO DO ANYTHING ABOUT THIS ISSUE. *TR",
        "vin": "JA3AW86VX8U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/19/2009",
        "dateOfIncident": "04/16/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265978,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS CHIPPING ON THE BOTTOM SIDE, OF THE BACK REAR DOORS NEXT TO THE FENDER. THIS IS A COMMON PROBLEM. AS TALKED IN THE FORUMS IN EDMUNDS.COM I HAVE A 2008 MITSUBISHI LANCER EVOLUTION, WITH 3,500 MILES ON IT AND THE PAINT IS COMING OFF THIS IS A DESIGN FLAW, AND  MITSUBISHI WONT DO ANYTHING I NEVER DROVE MY CAR IN GRAVEL, I THINK THE DESIGN FLAW HAS SOMETHING TO DO WITH THE AERODYNAMICS OF THE CAR, AND POOR PAINT. *TR",
        "vin": "JA3AW56VX8U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2009",
        "dateOfIncident": "02/15/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260760,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK IN MY MITSUBISHI LANCER EVO TO LOCAL DEALER FOR TRANSMISSION PROBLEM. THIS CAR CURRENTLY HAS 3,300 MILES AND I'M HAVING PROBLEMS IN SHIFTING FROM SECOND GEAR TO THIRD.AT TIMES I NEED TO TAKE CLUTCH PEDAL OUT TWO TO THREE TIMES IN ORDER FOR IT TO ENGAGE. SOME TIMES TRANSMISSION WILL NOT GO INTO REVERSE ALSO. DEALER HAD CAR FOR A COUPLE OF HOURS AND INDICATED ON THEIR WORK ORDER THAT THE CAR HAD NO PROBLEMS WHILE TEST DRIVING? *TR",
        "vin": "JA3AW86V88U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2009",
        "dateOfIncident": "02/11/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259600,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH DISK DRAGGING DURING DISENGAGEMENT, CAUSING HARD SHIFTING AND PREMATURELY WEARING THE TRANSMISSION SYNCHRONIZERS. MULTIPLE COMPLAINTS BROUGHT TO MITUSIBISHI, AND NO FOX OFFERED. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/02/2008",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250468,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT CHIPPING PREMATURELY ON A NEW CAR. THE VEHICLE STARTED GETTING CHIPS ON THE FINISH JUST AFTER A FEW HUNDRED MILES. THIS HAPPENS ON THE LOWER PASSENGER DOOR AREAS. THE CAR IS NOT DRIVEN OFF ROAD. I BELIEVE THIS IS COMING FROM THE TIRES. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "04/20/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242116,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN A WEEK AFTER PURCHASING MY NEW 2008 MITSUBISHI LANCER EVOLUTION GSR I NOTICED ROCK CHIPS IN THE LOWER REAR CORNERS OF THE REAR DOORS, JUST AHEAD OF THE CLEAR PROTECTIVE FILM ALREADY INSTALLED BY THE MANUFACTURER TO PREVENT PAINT CHIPPING. *TR",
        "vin": "JA3AW86V68U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239442,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL KICK UP ANY SMALL ROCKS AND CHIP THE REAR DOORS AND SIDE SKIRTS. I HAVE INSTALLED MUD GUARDS, BUT DOES NOT HELP EITHER. *TR",
        "vin": "JA3AW86V38U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238007,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFTS ARE EXTREMELY NOTCHY AND CAUSE FREQUENT GRINDING WHEN SHIFTING TO GEARS 2 AND 3. IT DOES NOT MATTER IF I AM UPSHIFTING OR DOWNSHIFTING. THE PROBLEM IS PRONOUNCED DURING COLD ENGINE CONDITIONS. GRINDING CONTINUES TO HAPPEN EVEN IN WARM CONDITIONS. THERE HAVE BEEN MANY TIMES WHEN THE CAR LOST POWER AND SLOWED DOWN IN THE MIDDLE OF A ROAD BECAUSE I COULD NOT SHIFT IN TIME DUE TO THE GRINDING.  *TR",
        "vin": "JA3AW86V08U"
    }
]