[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359811,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUSPENSION CROSSMEMBER IS RUSTED THROUGH.",
        "vin": "4A4MN21S08E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329317,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUBFRAME ON THE PASSENGER REAR SIDE BROKE DUE TO RUST. BOTH SUBFRAMES ARE RUSTED FRONT AND BACK BUT THE REST OF THE UNDERNEATH OF THE CAR IS PERFECT.  I NEED IT REPLACED AND THE DEALER SAID THEY CAN NOT EVEN GET THE PART ANYMORE. SO MY CAR IS PRETTY MUCH TOTALED. THE SUV IS ONLY 12 YEARS OLD. THAT IS PATHETIC.  *TR",
        "vin": "4A4MN21SX8E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254752,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI ENDEAVOR. WHILE FUELING THE VEHICLE, THE CONTACT NOTICED FUEL LEAKING AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE CONTACT ALSO NOTICED A STRONG ODOR OF FUEL AROUND THE VEHICLE. THE VEHICLE WAS TAKEN TO BRUCE WALTERS FORD LINCOLN KIA (302 S MAYO TRAIL, PIKEVILLE, KY 41501, (606) 444-2200) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V065000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 160,000.",
        "vin": "4A4MN31S28E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240869,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI ENDEAVOR. WHILE DRIVING 50 MPH, THE AIR CONDITIONER STARTED TO PRODUCE WARMER AIR. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 10V514000 (ELECTRICAL SYSTEM). THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED TO REPLACE THE BATTERY. THE CONTACT REPLACED THE BATTERY, BUT THE FAILURE RECURRED AFTER A COUPLE OF MONTHS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER AND THE MANUFACTURER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS 127,000.",
        "vin": "4A4MN21S68E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192112,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WILL DIE WHEN IDLING OR IF SPEED IS LESS THAN 20 MPH.  IT TAKES NUMEROUS TIMES TO RESTART AND WILL HAVE TO ACCELERATE TO GET IT GOING AGAIN.  THIS CAN HAPPEN ANYWHERE AT ANYTIME.",
        "vin": "4A4MM21S08E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2018",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073558,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER FROM A/C DUMPS INTO THE FLOOR BOARDS OF THE DRIVER AND PASSENGER FLOOR BOARDS. THIS CAUSES BOTTOM OF SHOES TO BECOME SLIPPERY ALLOWING THEM TO SLIP FROM BRAKE AND GAS PEDAL.  THERE IS SO MUCH WATER IT TAKE NUMEROUS TOWELS TO SOAK UP THE WATER.  OVER TIME, THIS MOISTURE IN THE CARPET LEADS TO MOLD AND MILDEW AND AFFECTS THOSE WITH ALLERGIES.  I'M SURE THEY MAY BE SOME RUST GOING ON UNDER THE CARPET DUE TO THE ENORMOUS AMOUNT OF WATER THAT IS DUMPED INTO THE FLOOR BOARDS.  THIS DUMPING OF WATER HAPPENS ANY TIME THE AIR CONDITIONER IS BEING USED.  WHEN THE VEHICLE TURNS, YOU CAN HEAR THE WATER SLOSHING FROM SIDE TO SIDE...IT IS A LOT OF WATER!  WE HAVE TAKEN THIS VEHICLE TO THE DEALERSHIP AND THEY SAID IT WAS \"FIXED\"...ONLY TO HAVE THE SAME THING HAPPEN AGAIN AND AGAIN.  IT IS WAY TOO COSTLY TO CONTINUE TO TAKE THIS IN TO HAVE \"REPAIRED\".  AFTER READING THE NUMEROUS COMPLAINTS ABOUT THIS VERY SAME ISSUE, I FEEL IT IS A FACTORY DEFECT AND MITSUBISHI SHOULD HAVE RECALLED THIS PART/ISSUE.  THIS HAS BEEN HAPPENING SINCE WE BOUGHT THE VEHICLE FOR MY DAUGHTER IN 2015.",
        "vin": "4A4MN31SX8E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010091,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO WEEKS AGO I NOTICED MY DRIVER SIDE FLOOR WAS WET WHICH I ASSUMED WAS FROM THE UMBRELLA WITH ALL THE RAIN. HOWEVER AS OF LAST WEEK IT REMAINED WET TO THE POINT OF SOAKING WHENEVER THE A/C OR DEFROSTER RUNS. IT WAS CHECKED BY CARMAX TECH, WHO ADVISED IT IS DUE TO THE HVAC DRAINAGE DETERIORATING & WATER BUILDING UP IN THE FLOOR BOARD. TO REPAIR THE COST IS OVER $1100.00. THE TECH INFORMED THAT MITSUBISHI IS AWARE OF THE POORLY DESIGN HOWEVER NEVER RECALLED ON ANY OF THE VEHICLES. AFTER INVESTIGATING I FOUND MITSUBISHI TECHNICAL SERVICE BULLETINS INFORMING SERVICE MGRS, WARRANTY PROCESSOR, TECHNICIANS, ETC. OF THE ISSUE & HOW TO REPAIR (BULLETINS DATED SEPTEMBER 2008 & AGAIN AUGUST 2011 EXTENDING THE YEARS OF VEHICLES THAT WOULD EXPERIENCE THE ISSUE). TO DATE I HAVE NEVER RECEIVED ANY LETTER FROM THE MANUFACTURER REGARDING THIS PROBLEM WHICH THEY ARE WELL AWARE THIS COULD CAUSE ELECTRICAL ISSUES IF NOT REPAIRED INCLUDING A FIRE. I HAVE SPOKEN WITH A TECHNICIAN AT THE MITSUBISHI DEALERSHIP WHO INFORMED HE WAS VERY FAMILIAR WITH THE PROBLEM & QUOTED THE SAME PRICE. HE NEVER MENTIONED A RECALL OR BULLETINS THEY HAD RECEIVED ON THE MATTER. I BELIEVE THIS SHOULD BE A RECALL/REPAIR AT THEIR EXPENSE NOT THE CONSUMERS.",
        "vin": "4A4MM31S68E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902007,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" VEHICLE WILL NOT COME OUT OF PARK AND WILL NOT ALLOW ME TO REMOVE THE IGNITION KEY.  FORTUNATELY I WAS PARKING AT A HOUSE, BUT HAD TO DISCONNECT THE BATTERY IN ORDER TO TURN THE VEHICLE OFF.  ALSO, THE AIR CONDITIONING LEAKS INSIDE ON THE DRIVERS SIDE.",
        "vin": "4A4MM31S58E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "09/06/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762554,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI ENDEAVOR. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, THE GEAR SHIFTER FAILED TO SHIFT OUT OF THE PARK POSITION. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4A4MM21S98E"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "01/10/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672325,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE TIME OF PURCHASE THE CAR WILL NOT START AFTER GAS IS PUT INTO IT WHEN THE CAR IS CUT OFF. BY PRESSING THE ACCELERATOR SLIGHTLY IT WILL RESUME NORMAL OPERATION.THE KEY DOES NOT COME OUT OF THE IGNITION AND THE PARKING BRAKE WILL NOT DISENGAGE IT. KEYLESS ENTRY WILL NOT OPEN OR LOCK THE DOORS, WHILE AT LOCAL GAS STATION WENT INSIDE AND CAR WAS NOT THERE WHEN GOT OUTSIDE AS IF IT WAS STOLEN BUT IN FACT HAD ROLLED INTO TRAFFIC AND HIT A CAR AT THE RED LIGHT CAUSING DAMAGE TO BOTH VEHICLES! THE POLICE ARRIVED TO INVESTIGATE. A ACCIDENT REPORT WAS MADE AND DAMAGE AND WELL BEING ASSESSMENT TAKEN. THE DEALER WHO SOLD THIS VEHICLE TO ME A FEW MONTHS AGO SHOULD KNOW WHAT THEY ARE SELLING TO CUSTOMERS PRIOR TO SELL BECAUSE IN THIS CASE SOMEONE COULD HAVE LOST THEIR LIVES. I CALLED THE DEALER AND HE SAID IT IS MY PROBLEM NOW AND DOES NOT WANT TO GIVE ME LICENSE PLATES FROM DEPOSIT OWED WHICH WILL ALL THE ISSUES AND POTENTIAL OUT OF POCKET COSTS PLATES SHOULD BE GIVEN TO ME IN GOOD FAITH.  *TR",
        "vin": "4A4MM21S28E"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "10/04/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671848,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 MITSUBISHI ENDEAVOR. AFTER REFUELING THE VEHICLE, IT FAILED TO START. THE ACCELERATOR PEDAL HAD TO BE DEPRESSED IN ORDER FOR THE VEHICLE TO START. TWO MONTHS LATER, THE KEY BECAME STUCK IN THE IGNITION OFF POSITION AND FAILED TO RELEASE. WHILE IN PARK, THE VEHICLE ROLLED AWAY AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 108,000.",
        "vin": "4A4MM21S28E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/05/2008",
        "dateOfIncident": "06/04/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230028,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED VEHICLE WITH DEFECTIVE FRONT PASSENGER SEAT BELT AS DESCRIBED BY THE NOTICE FROM NHTSA.  WE FOLLOWED UP WITH THE DEALER SINCE MARCH 2008 UNTIL THE PRESENT. THE DEALER STATES THERE'S STILL NO PARTS AVAILABLE UNTIL THIS TIME.  *TR",
        "vin": "4A4MM21S27E"
    }
]