[
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432656,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The gauge can indicate that the vehicle has 1/2 tank of gas 153miles remaining until empty when in fact the tank is nearly empty. While driving on highway my 2 children, my daughter friend and myself the vehicle began to drag, I was like oh my God it feels like it's going to cut off. I immediately had a anxiety attack trying to figure out what was happening because no warning lights came on in which had me panic even more. I tried to calm down and get off to side of roadway at least before it did shut off. As soon as I started to drive off to side it shut off I tried to give it gas nothing and the steering wheel had tighten up(no power)so now we was rolling and I'm trying my hardest to steer so we wouldn't hit anything. It was the most scariest moment of my life and my life flashed in front of me and praying no trucks came flying. I proceeded to call AAA they asked my location and if we was in a safe area, did it run out of gas, etc.... They said they will dispatch a tow truck and also tell them to being gas just in case. I said it's by 1/2 tank and say it's 153 miles til empty, they said sometimes those gauge don't work, I said the digital fuel as well would be off.  Well the tow truck came check fluids, batteries and nothing was wrong he put the gas and it started.  This is very dangerous for this gauge to be broken and not operating correctly because it just shut off and had me and my children and friend was in a deadly accident due to a [XXX] malfunction from a defaulted gas reader. What would you people tell our families oh we sorry. This is a serious serious deadly problem that needs to be addressed immediately.   Another problem is the suspension and tires. I had everything checked and thought I needed a wheel alignment and I still notice when I hit a bump I'm the road the entire truck swerve. The digital tire air pressure gauge inside car on screen is off and not reading either. The either electrical system is off if you ask me.  I hope that someone contact me  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5N1AA08C48N"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425172,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Brought my 2008 Nissan Armada to my dealer for an alignment ahead of a road trip with my family. Was told the vehicle is not safe to drive. The frame was rotted and cracked, and that the rear wheels have shifted. This condition is completely hidden unless on a lift. I have owned this vehicle since new.",
        "vin": "5n1aa08c88n"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414223,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS IN MOTION DURING HIGHWAY TRAVEL AND CITY TRAVEL BRAKE LIGHT ON THE CONTROL PANEL WILL COME RANDOMLY COME ON. WHEN APPLYING BRAKES AFTER LIGHT HAS ILLUMINATED THERE WILL BE SEVERE VIBRATION AND GRINDING WHEN YOU PRESS THE BRAKES. THIS BEHAVIOR IN THE VEHICLE WILL CONTINUE UNTIL THE IGNITION HAS BEEN TURNED OFF AND THEN RESTARTED WHICH SEEMS TO RESET THE BRAKES, DISCONTINUE THE LIGHT AND RESUMES NORMAL OPERATION.  ON SEVERAL OCCASIONS THE LIGHT HAS COME ON WHILE VEHICLE IS PARKED BUT STILL RUNNING.  THIS HAS HAPPENED MANY TIMES.",
        "vin": "5N1BA08D08N"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390004,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IS STAYING ON.  NO CODES READ THIS PROBLEM. IF THE VEHICLE IS RUNNING THE AIRBAG DASH LIGHT REMAINS ON. THE CHECK ENGINE LIGHT IS NOT ON.",
        "vin": "5N1AA08C18N"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378537,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE OUT SMELLING GAS AIR SUSPENSION JUST MAKES NOISE REAR DOOR STOPED WORKINGHORN STOPPED WORKING AIR IS OUT STOPED WORKING THE WHOLE SYSTEM IS OUT THERE IS BRAKE FLUID IN BUT BREAKS STILL NOT WORKING DON'T NEED ANY BREAKERS  GEARS GETS STUCK AIRBAGS NOT WORKING  I WAS DRIVINGWHEN THE BREAKS WENT HAD TO RUN IN A DITCH AN WHEN I MAKE LEFT OR RIGHT TURNS THAT'S WHEN I SMELL GAS AN THE HEAT WORKS BUT THE AIR STOP",
        "vin": "5N1BA08D68N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289130,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHT ON THE CONTROL PANEL LIGHTS UP AND WHEN STEPPING ON THE BRAKE PEDAL THE VEHICLE DOES NOT BRAKE, INSTEAD IS FEELS LIKE IT'S SKIDDING. WHEN THIS HAPPENS I HAVE TO SLOWLY TRY TO PULL OVER AND COME TO A STOP TO THEN TURN THE VEHICLE OFF. WHEN I RESTART THE VEHICLE IS IT USUALLY STARTS PERFORMING NORMALLY AGAIN AND THE BRAKES WORK FINE. THIS IS A HUGE SAFETY CONCERN FOR ME DUE TO THE FACT THAT I NEVER KNOW WHEN THIS IS GOING TO HAPPEN AGAIN. WHAT IF IT HAPPENS WHILE I NEED TO COME TO A QUICK EMERGENCY STOP?! THANKFULLY I AM A SAFE DRIVER AND ALWAYS DRIVE WITHIN THE SPEED LIMITS WHICH HELPS ME BRING THE VEHICLE TO A STOP QUICKER.",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279853,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE AND MILES TO GO ARE BOTH INCORRECT. I'VE THIS VEHICLE ALMOST 2 YEARS! THE MILES TO GO MAY SHOW ANYWHERE FROM 40 TO ESTIMATED 100 THEN ALL OF A SUDDEN THE CAR DIES. I LOSE ALL CONTROL OF STEERING, BRAKES, FLASHER DOES NOT WORK. EVERY TIME THIS HAS HAPPENED I'VE NEARLY GOTTEN HIT AND OF COURSE STRANDED UNTIL SOMEONE CAN HELP ME. I WAS TOLD BY NISSAN THERE WAS A RECALL FOR THIS SAME ISSUE IN 2010 BUT IT EXPIRED! THIS ISSUE IS REALLY DANGEROUS AND WHETHER OR NOT RECALL IS EXPIRED, I'M NOT GONNA BE SO LUCKY IN THE END! I WILL EVENTUALLY GET HIT AND EITHER ME , MY PASSENGERS OR OTHER PARTY WILL BE SERIOUSLY HURT!  PLEASE REACH OUT TO NISSAN ON THIS DANGEROUS ISSUE! I DIDN'T HAVE THE VEHICLE DURING THE RECALL PERIOD 2010.  I PURCHASED IN DECEMBER OF 2017! DURING THIS TIME THIS HAS HAPPENED AT LEAST 10 TIMES! I STILL OWE FOR IT AND I NEED TO FEEL SAFE IN THE VEHICLE FOR ME AND MY PASSENGERS WHICH IS MOSTLY MY GRANDCHILDREN! THANK YOU FOR YOUR ATTENTION TO THIS ISSUE! THE DATE BELOW WAS THE LAST TIME THIS HAPPENED! NOT EXACT ON DAY!",
        "vin": "5N1AA08CX8N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278705,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL INDICATOR LIGHTS HAVE COME ON:  ABS, VDC, SLIP, ETC.  THE NISSAN DEALERSHIP HAS ATTRIBUTED THE ISSUE TO THE ABS ACTUATOR.  THIS, ACCORDING TO MANY NISSAN OWNERS, IS AN ISSUE WITH THE ARMADA BETWEEN 2004 AND 2010.  OUTSIDE OF THE INDICATOR LIGHTS, I DO NOT HAVE A MECHANICAL ISSUE THAT OTHERS HAVE REPORTED.  HOWEVER, THE DESCRIPTIONS OF UNINTENDED BRAKING AS DESCRIBED BY OTHER ARMADA OWNERS IS DISCONCERTING.  NISSAN HAS BEEN ISSUED A RECALL REGARDING PASSENGER CARS FROM 2016-2018 WITH ABS ACTUATOR ISSUES.  THERE IS A HISTORY OF A PROBLEM WITH THE ABS SYSTEMS FOR THE COMPANY.",
        "vin": "5N1BA08C78N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278286,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE BRAKE LIGHT WILL ILLUMINATE AND THE BRAKES WILL FAIL WHILE BEING PRESSED. WHEN THE THE LIGHT COMES ON THE BRAKE BOOSTER FAILS TO OPERATE AND THE WHILE WILL NOT STOP. THERE WAS A LAWSUIT FILED AGAINST NISSAN BACK IN 2014 FOR A DELTA STOKE SENSOR WHICH IS WHAT NISSAN CALLS THE BRAKE BOOSTER. WHEN I LOOKED UP MY VEHICLE WITH NISSAN NO RECALL WAS ISSUED YET MY VEHICLE FALLS WITHIN THE SAME YEAR. THIS IS A MAJOR SAFETY CONCERN THAT NEEDS TO BE LOOKED INTO.",
        "vin": "5N1BA08CX8N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270569,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING MY CHILDREN ON THE HIGHWAY  AT APPROXIMATELY 55MPH AND THE 'BRAKE' ICON SUDDENLY FLASHED RED ON THE DASH. MY WIFE ATTEMPTED TO APPLY THE BRAKES AND THEY DID NOT FUNCTION OR RESPOND OTHER THAN BY MAKING A GRINDING NOISE. THE PEDAL WAS ABLE TO GO TO THE FLOOR BUT WITH NO BRAKING ACCOMPLISHED. TO STOP THE VEHICLE SHE HAD TO DOWNSHIFT AND LET IT COAST TO A STOP IN A PARKING LOT THAT WAS FORTUNATELY ON HER PATH OF TRAVEL. THERE ARE NO LEAKS IN THE BRAKING SYSTEM AND THE NEARBY NISSAN DEALERSHIP SAID IT HAD THROWN A C1179 CODE FOR A BRAKE BOOSTER SENSOR. TURNS OUT THIS IS A COMMON ISSUE WITH THESE MODELS AND NISSAN LOST A CLASS ACTION LAWSUIT ABOUT THE ISSUE IN CALIFORNIA IN 2014. SEVERAL OTHER OWNERS HAVE REPORTED THE EXACT SAME SCENARIO ON VARIOUS NISSAN FORUMS. IT IS A WONDER MY WIFE AND CHILDREN WERE NOT IN AN ACCIDENT.",
        "vin": "5N1AA08C68N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH   INTERIOR OVERHEAD CONSOLES ARE CRACKED AND NOW THE REAR SIDE OVERHEAD CONSOLE COMPLETELY CRACKED AND NOW THE CONSOLE AS WELL IT CRACKED.  THE PLASTIC IS MADE LIKE SAND, IF YOU JUST TOUCH IT, IT WILL BREAK OFF.",
        "vin": "5N1BA08C48N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269376,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND THE KEY WARNING INDICATOR FLASHED CONTINUOUSLY. THE CONTACT HAD TO CONTINUOUSLY ATTEMPT TO TURN THE IGNITION SWITCH IN ORDER FOR THE ENGINE TO START. THE CONTACT CALLED MIDDLETOWN NISSAN (1153 NEWFIELD ST, MIDDLETOWN, CT 06457, (860) 632-6550) AND WAS INFORMED THAT A DIAGNOSTIC TEST WAS NEEDED. THE TEST WOULD COST $160. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "5N1AA08D18N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO PICK UP MY DAUGHTER AT WORK WHEN I CAME TO A STOP AT AN INTERSECTION THE BRAKES SEEMED FINE BUT WHEN THE LIGHT TURNED GREEN I WAS MAKING A LEFT TURN AND AS I WAS TURNING I PUT MY FOOT ON THE BRAKE AND THE BRAKES WENT IN AND I HEARD A VERY LOUD GRINDING SOUND AND I COULD FEEL THE VIBRATION UNDER MY FEET THEN I NOTICED THE BRAKE LIGHT COME ON SO I PULLED OFF THE ROAD BUT REALIZED IT WASN'T A SAFE SPOT SO LUCKILY I WAS NEAR A TURN OFF SO I PULLED INTO A PARKING LOT VERY SLOWLY AND PUT THE CAR IN PARK. THE BRAKE LIGHT REMAINED ON UNTIL I TURNED THE VEHICLE OFF. I CALLED MY HUSBAND AND HE CAME, CHECKED ALL THE BRAKES, THE BRAKE FLUID AND CHECKED TO SEE IF THERE WAS FLUID LEAKING ANYWHERE BUT HE DIDN'T FIND ANYTHING WRONG SO HE STARTED THE VEHICLE AND THE BRAKE LIGHT WAS OFF SO HE DROVE IT HOME WHILE I DROVE HIS CAR BUT IT DIDN'T HAPPEN AGAIN. I'VE READ THAT MANY PEOPLE HAVE HAD THE SAME ISSUE WITH NISSAN ARMADA. I WOULD LIKE TO ADD THAT THIS IS THE FIRST TIME IT HAPPENED BUT IT'S ONE TIME TOO MANY BECAUSE I'M LUCKY I DIDN'T HAVE AN ACCIDENT.",
        "vin": "5N1BA08C08N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230533,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSIDE OVERHEAD FELL DOWN CAUSING MY DAUGHTER AND I TO BE HIT IN THE HEAD.  ACCORDING TO THE NHTSA REPORT'S THERE HAVE BEEN 12 COMPLAINTS WITH MINE, AND ACCORDING TO THE ARFC THERE HAVE BEEN FOURTEEN (14) COMPLAINTS ON THIS SAME OVERHEAD PROBLEM. THIS NEEDS TO HAVE THIS VEHICLE BEEN PUT ON THE RECALL LIST BEFORE SOMEONE WINDS IN THE HOSPITAL.   MY VEHICLE WAS STANTIONARY.",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228618,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVERHEAD ROOF CAVED IN WITHOUT WARNING. THE VEHICLE WAS TAKEN TO MATHEWS NISSAN (185 TN-76, CLARKSVILLE, TN 37043, (866) 617-4808) AND WAS COMPLETELY REPAIRED. THE REPAIRS WERE NOT COVERED BY THE WARRANTY OR THE INSURANCE COMPANY. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 73,178. *BF  *AS",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228581,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT ON WHILE DRIVING, BRAKING NOISE AND POOR BRAKING, VERY SCARY SITUATION. FELT INSECURE. STOOPED ENGINE AND CAR STARTED WORKING FINE AGAIN.",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220680,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE LAST TWO MONTHS THE ABS LIGHT WILL APPEAR ON THE DASH ACCOMPANIED BY A LOUD VIBRATION AND A LOSS OF BRAKING POWER. I HAD THE BRAKES REPLACED AND THAT DID NOT FIX THE PROBLEM. THIS IS DANGEROUS AND COULD LEAD TO A LOSS OF BRAKING ABILITY ON CORNERS AND AT HIGHWAY SPEEDS LEADING TO A CRASH. ALSO WITHIN THE PAST FEW MONTHS THE FUEL GUAGE HAS STARTED TO SHOW MORE FUEL IN THE TANK THAN WHAT IS ACTUALLY IN THE TANK. I CALLED THE DEALERSHIP AND PROVIDED THE VIN AND THEY SAID THAT THE FUEL LEVEL SENSOR RECALL SERVICE HAD ALREADY BEEN PERFORMED ON THIS VIN.",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176399,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT COMES ON WHILE DIVING  ,WHEN I APPLY BRAKES THERE IS A SPONGY FEELING , ITS LIKE WHEN YOU BLEED BRAKES. THEN AN AWFUL GRINDING NOISE COMES FROM UNDER THE VEHICLE. ITS HAPPENED 3 TIMES SINCE I'VE HAD CAR USED AND I'VE ONLY HAD IT 6 MONTHS. LUCKILY NO ONE WAS AROUND AND I WAS ABLE TO PULL OVER. TURNED OFF THE CAR AND IT WAS GONE ON ALL OCCASIONS. I AM VERY SCARED TO DRIVE MY CHILDREN AND GRANDCHILD AROUND THIS IS VERY SCARY AND COULD CAUSE INJURY OR EVEN DEATH IF ON A WINDING ROAD IN SNOW OR RAIN. I DON'T KNOW WHAT TO DO I CANT AFFORD NEW CAR.",
        "vin": "5N1AA08D78N"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165713,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT MISSING FOR REAR BACK SEAT, DELTA SENSOR WENT OUT ON ME IN A PARKING LOT AND I ALMOST HAD AN ACCIDENT BECAUSE MY BRAKES WOULDN'T ENGAGE, AND NOW MY AIRBAG SPIRAL CABLE ARE NOW NOT WORKING.",
        "vin": "5N1AA08D88N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084846,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2008 NISSAN ARMADA LE CENTER OVERHEAD CONSOLE FELL FROM THE ROOF OF THE VEHICLE WHILE PARKED. I CAME AND LOOKED TO SEE IT BROKE IN HALF LYING IN THE SEATS, WIRES HANGING.  IF YOU LOOK, YOU WILL SEE THERE ARE NUMEROUS INCIDENTS OF THESE CONSOLES FALLING OUT OF THE ROOF. THERE HAS NOT BEEN A RECALL ON THIS VEHICLE PART. THERE HAS TO BE A DEFECT WITH THE WEIGHT OF THIS PART AND THE SCREWS THAT SHOULD BE ABLE TO HOLD THIS UP. THE PLASTIC CRUMBLED UP AROUND THE SCREWS.   NISSAN SHOULD REPLACE THE FAULTY PART!!",
        "vin": "5N1AA08C18N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "10/27/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080972,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS DUE TO THAT WHAT IS GOING ON WITH MINE AND I AM SURE IT IS HAPPENING TO OTHERS AS WELL I AM A MOTHER OF THREE YOUNG KIDS (9,10, AND 3) THIS IS MY DAILY DRIVER. ON THREE OCCASIONS SINCE OCTOBER 2017 WHEN I AM ABOUT STOP THE BRAKE LIGHT TURNS ON AND THE BRAKES GET HARD AND SOUND LIKE A STRETCHING SPRING IT'S HAPPENED ON ALL HIGHWAYS AND MAKING LEFT TURNS. ONCE I PULL OVER OR STOP I SHUT IT OFF FOR FIVE SECONDS AND TURN ON CAR AND LIGHT IS GONE AND BRAKES ARE BACK TO NORMAL IT WOULD HAPPEN EVERY TWO MONTHS TO KNOW EVERY THREE WEEKS NOW THIS A VERY SCARY SITUATION WE HAVE CHECK BRAKES AND BOOSTER AND TAKE IT TO MECHANICS AND NOTHING HAPPENS NO CODES NO NOTHING PLEASE HELP I'M STARTING TO FEEL  UNSAFE IN THE VEHICLE.",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061111,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I AM THINKING MY TRUCK MAY BE PART OF THE REECALL. FOR NO REAON AT ALL MY AIRBAG LIGHT CAME ON. WE HAVE NOT HAD ANY ACCIDENTS TO TRIGGER THIS.  THIS IS ON ALL THE TIME.",
        "vin": "5N1AA08C08N"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "11/05/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043202,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 NISSAN ARMADA, BOUGHT IT NEW AND MY WIFE USE TO TELL ME THAT THE BRAKES WOULD GRIND AND THE BRAKE LIGHT WOULD GO ON, I USE TO THINK SHE WAS CRAZY, NOW THAT I DRIVE THE CAR MY SELF I KNEW SHE WAS RIGHT, WHEN WE STEP ON THE BRAKE PETAL THE BRAKES START GRINDING AND THE BRAKE COMES ON WE HAVE 3 CHILDREN AND IS PRETTY SCARY WHEN WE TRY TO STOP AND COMPLETELY LOOSE BRAKE POWER, WHEN MY WIFE FIRST TOLD ME I TOOK IT TO THE DEALER AND THEY COULDN'T CHECK FOR THE PROBLEM SINCE IT HAD TO BE DOING IT WHEN I TOOK IT WELL THEN IT DIDN'T DO IT OFTEN, THEN I TOOK IT ONE TIME WHILE IT WAS DOING IT AND THE DEALER TOLD ME THAT THEY NEW EXACTLY WHAT IT WAS BUT COULDN'T DO ANYTHING ABOUT IT SINCE I WAS OUT OFF WARRANTY. I THINK IS RIDICULOUS THAT THE MANUFACTURER KNOWS EXACTLY WHAT THE PROBLEM IS BUT THEY WON'T DO NOTHING ABOUT IT SINCE THEIR IS NO RECALL, I THINK NHTSA NEEDS TO STEP IN AND ISSUE A RECALL AS WE KNOW THEIR IS A LOT OF PEOPLE WHO HAVE THE SAME PROBLEM, I HAVE 3 CHILDREN AND A WIFE AND DON'T US TO BE THE NEXT VICTIM OF AN ACCIDENT. IS NOT LIKE WE PAID PENNIES FOR THIS CAR, HOPE YOU GUYS CAN DO SOMETHING ABOUT IT BEFORE SOMEONE GETS HURT OR WORSE LOOSE A LOVE ONE",
        "vin": "5N1AA08DX8N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "03/05/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032084,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRANSMISSION IS IN DRIVE, AND PROCEEDING DOWN THE ROAD, HAS HAPPEN AT SPEEDS BETWEEN 10MPH UP TO 70MPH.  THE EMERGENCY BRAKE LIGHT ON THE DASHBOARD GOES ON.  WITHIN 5-10 SECONDS HEARING A GRINDING SOUND COMING FROM THE FRONT OF THE CAR, SOUNDS LIKE COMING FROM BREAKS IN ADDITION TO A SPRING LIKE SOUND AND A REDUCTION OF BREAKING POWER.  THIS CONTINUES UNTIL YOU PULL OFF THE ROAD, AND TURN OFF THE CAR AND TURN IT BACK ON.  ONCE THE CAR IS RESET IT APPEARS TO FIX THE PROBLEMS.  I PURCHASED THE CAR AT WITH APPROXIMATELY 69K MILES ON IT, IT CURRENTLY HAS ROUGHLY 114K MILES ON IT AND HAS HAPPEN APPROXIMATELY 3 TIMES SINCE 95K MILES.    I HAVE TAKEN THE VEHICLE TO A DEALERSHIP AND HAVE EXPLAINED THE ISSUE.  THEY ADVISED THEY HAVE HEARD OF THIS, BUT THERE IS NO RECALL FOR THE VIN NUMBER ON MY ARMADA.  THAT THIS WOULD REQUIRE A TECHNICIAN TO PROVIDE A SOFTWARE UPDATE.  THIS SHOULD BE ABLE TO FIX THE PROBLEM, BUT NOT GUARANTEE.  APPROXIMATELY TAKE 1-2 HOURS FOR A TECHNICIAN TO DO THIS AND I WOULD BE RESPONSIBLE TO PAY.     SPOKE TO NISSAN USA AND THEY VIEW THE SOFTWARE UPGRADE AS REGULAR SERVICE MAINTENANCE.      THIS ISSUE HAS SEEMED TO BE COMMON IN ARMADA'S FROM 2004 TO 2008, BASED ON WHAT HAS BEEN LISTED ON SEVERAL FORUMS.     EXAMPLE:  HTTP://WWW.CLUBARMADA.COM/FORUMS/26-BRAKES/4018-MORE-ABS-NEAR-BRAKE-FAILURE-PROBLEMS.HTML      THIS HAS HAPPEN IN 2016 - 2017.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "09/16/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOES TO THE FLOOR AND PULSATES AND WON'T STOP AT TIMES NEED TO PULL OVER AND RESTART TRUCK !",
        "vin": "5N1AA08C58N"
    },
    {
        "components": "SUSPENSION,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "05/09/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023439,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE SEAT BELTS FAILED TO FUNCTION PROPERLY TO RESTRAIN, BUCKLE, AND RELEASE FROM THE BUCKLE. IN ADDITION, THERE WAS AN ABNORMAL NOISE COMING FROM THE REAR INTERMITTENTLY ASSOCIATED WITH THE REAR SUSPENSION OF THE VEHICLE. THE VEHICLE HAS NOT YET BEEN INSPECTED AND DIAGNOSED BY A DEALER OR AN INDEPENDENT MECHANIC. THE CONTACT WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 07V449000 (SEAT BELTS). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE TO DETERMINE IF THEY MAY BE ABLE TO SCHEDULE THE RECALL REPAIR AND DIAGNOSE THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5N1BA08D08N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2017",
        "dateOfIncident": "09/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022758,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR OVERHEAD CONSOLE BROKE OFF. LUCKILY IT DID NOT OCCUR WHILE WE WERE DRIVING AS IT WOULD HAVE STARTLED US GREATLY AND AN ACCIDENT COULD HAVE EASILY OCCURRED. ALSO IT IS RIGHT ABOVE WHERE MY CHILDREN SIT AND COULD HAVE CAUSED HARM TO THEIR HEAD, NECK OR EYE WHICH ARE ALL VERY CRITICAL AREAS OF THE BODY ESPECIALLY FOR A DEVELOPING CHILD.",
        "vin": "5N1AA08D08N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERHEAD CONSOLE COLLAPSED DURING CRASH.",
        "vin": "5N1AA08X8N6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/25/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010564,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO TIMES IN THE PAST 2 MONTHS I HAVE EXPERIENCED WHILE DRIVING, MY BRAKE LIGHT LIGHTING UP AND MY BRAKES FAILING. MY PEDAL WOULD GO DOWN FARTHER, GRINDING NOISES COULD BE HEARD, AND IT WAS VERY HARD TO STOP MY VEHICLE. I PULLED OVER AS CAREFULLY AS POSSIBLE, STOPPED SLOWLY, AND TURNED MY ENGINE OFF. I THEN RESTARTED AND EVERYTHING WAS FINE, NO BRAKE LIGHT, NO NOISE, NO ISSUE PUSHING THE BRAKE PEDAL. I DIDN'T THINK MUCH ABOUT IT UNTIL IT HAPPENED AGAIN. I KNOW NISSAN WILL NOT DO ANYTHING ABOUT IT BECAUSE THE BRAKE LIGHT IS OFF AND IT IS NOT AN ISSUE RIGHT NOW. I KNOW THEY ARE ALSO AWARE OF THIS PROBLEM WITH MY MAKE, MODEL, AND YEAR OF CAR AND THEY SETTLED A CLASS ACTION LAWSUIT OUT OF COURT THAT I WAS NOT INVOLVED IN BECAUSE I DIDN'T HAVE THE PROBLEM AT THAT POINT. BOTH TIMES IT HAPPENED WHILE TRAVELING ON CITY STREETS, ONCE I WAS GOING ABOUT 35MPH THE OTHER ABOUT 45MPH. I AM MORE THAN AFRAID BECAUSE WE DO OCCASIONALLY TRAVEL ON MOUNTAIN ROADS AND I HAVE NO IDEA HOW I WOULD HANDLE THIS SITUATION IF IT HAPPENED WHILE DRIVING DOWNHILL.",
        "vin": "5N1AA08D58N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY \"BRAKE\" LIGHT IS RANDOMLY COMING ON WHEN I'M BRAKING OR JUST DRIVING ON A CITY ROAD OR ON THE HIGHWAY.  THERE IS A GRINDING NOISE WHEN I BRAKE IN ANY OF THESE DRIVING SITUATIONS.  IT'S BEEN DOING THIS FOR ABOUT 4 YEARS.  I'VE HAD IT LOOKED AT SEVERAL TIMES, BUT NOTHING IS BEING IDENTIFIED.  I'VE BEEN REVIEWING A FORUM THAT IS IDENTIFYING THIS SAME ISSUE WITH MANY OTHER ARMADAS.  IT SEEMS TO BE THE BOOSTER SENSORS, WHICH IS A VERY EXPENSIVE REPAIR.",
        "vin": "5N1BA08CX8N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006783,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERHEAD CONSOLE IN THE BACK AND FRONT HAVE CRACKED AND BROKE. WENT OUT TO MY CAR TODAY TO SEE THE FRONT PIECE JUST HANGING DOWN. THIS IS A SAFETY CONCERN AS I HAVE 4 SMALL KIDS THAT ARE USUALLY RIDING BACK THERE.",
        "vin": "5N1AA08D18N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003196,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN ARMADA 2008: WENT OUT TO GET SOMETHING OUT OF MY TRUCK, FOUND THE WHOLE CENTER ROOF PANEL DOWN HANGING ON BY WIRING. SINCE IT WAS THE HOLIDAY I CALLED NISSAN DEALERSHIP THE FOLLOWING DAY FOR REPLACEMENT PART. I WAS GIVEN COST $2600.00. I TRIED JUST GETTING PLASTIC SHELL, BUT TOLD PLASTIC SHELL ISN'T SOLD SEPARATE. THIS PART WAS MADE WITH A CHEAP PLASTIC CLAMPS THAT BROKE WITH SCREWS STILL IN PLACE.",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002466,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK HEAD CONSOLE JUST CAME DOWN WITHOUT WARNING WIRES HANGING EVERYWHERE. THE PART THAT YOU NEED TO FIX IT COST TOO MUCH. VERY VERY DISAPPOINTED",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "10/13/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965748,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE AND WITHIN THE FIRST 3 DAYS OF HAVING IT NOTICED WHAT SOUNDED LIKE AN EXHAUST LEAK. I WAS ASSURED IT WOULD BE TAKEN CARE OF NOT TO WORRY. FIVE MONTHS LATER IT IS STILL NOT FIXED AND THE PROBLEM IS THAT THE EXHAUST MANIFOLD IS CRACKED. NOT JUST ONE SIDE BUT BOTH SIDES. I AM SURE THAT THE PROBLEM EXISTED WHEN I PURCHASED THE VEHICLE. HOW IS THIS POSSIBLE? AND WHY ISNT THERE A RECALL SEEING AS THERE HAVE BEEN SO MANY COMPLAINTS OF THIS ISSUE.     ALSO, ON SEVERAL OCCASSIONS I HAVE BEEN LOCKED OUT OF THE REAR HATCH OF THE VEHICLE UNABLE TO OPEN IT EVEN THOUGH THE VEHICLE IS UNLOCKED. I EVEN CRAWLED FROM THE FRONT TO THE BACK TO TRY THE EMERGENCY LATCH AND NOTHING WOULD ALLOW IT TO OPEN.   I PURCHASED THIS VEHICLE WITH 138K MILES AND SEEMED TO BE IN EXCELLENT CONDITION...I GUESS THE OLD SAYING \"LOOKS CAN BE DECEIVING\"",
        "vin": "5N1AA08D38N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938512,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OVERHEAD CONSOLE SUDDENLY FELL DOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "10/16/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916361,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT COMES ON, BRAKES PULSATE AND MAKE A GRINDING AND CLUNKING NOISE. THE BRAKES GRAB CAUSING THE VEHICLE TO APPLY TO MUCH BRAKE PRESSURE AT TIMES. OTHER TIMES IT DOESN'T APPLY ENOUGH PRESSURE. THIS OCCURS AS THE VEHICLE IS COMING TO A STOP.",
        "vin": "5N1AA08D88N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914424,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT HEARD A LOUD NOISE WHEN THE VEHICLE WAS STARTED. ONE MECHANIC STATED THAT THE EXHAUST MANIFOLD NEEDED TO BE REPLACED. A SECOND MECHANIC ALSO INSPECTED AND DIAGNOSED THE VEHICLE. THE VEHICLE WAS TO BE TAKEN TO A DEALER FOR FURTHER DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "5N1AA08D78N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT OVERHEAD CONSOLE CRACKED AND FELL DANGLING BY WIRES! AFTER SECURELY TAPING IN PLACE THE CONSOLE CRACKED IN OTHER PLACES LITERALLY DISINTEGRATING. REAR OVERHEAD CONSOLE SHOWING SIGNS OF MALFUNCTION AS DVD SCREEN NO LONGER STOWS INTO PLACE. THE PLASTICS AND BRACING USED FOR THESE COMPONENTS ARE TROUBLING.  DEALERSHIP JUST SHRUGS.",
        "vin": "5N1AA08C78N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904516,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I NOTICED A CRACK IN MY OVERHEAD CONSOLE.  MY INTENTIONS WERE TO TAKE IT TO A NISSAN DEALER AFTER I GOT OFF FROM WORK.  I WAS IN MOTION ON A CITY STREET AS I WAS ON MY WAY TO WORK. I STOPPED AT A STOP LIGHT.  ONCE THE LIGHT TURNED GREEN AND I BEGAN TO DRIVE, THE NEXT THINK I KNOW MY ENTIRE CONSOLE FALLS NEARLY HITTING ME IN THE FACE. IT WAS A SUNNY DAY, NO SPEED BUMPS OR ABNORMAL ROAD CONDITIONS WERE INVOLVED.",
        "vin": "5N1AA08C48N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899530,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING APPROXIMATELY 5 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO OPERATE. THE CONTACT HAD TO APPLY FORCE TO THE BRAKE PEDAL TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ACTIVE BRAKE BOOSTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 189,000.",
        "vin": "5N1AA08C38N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898340,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING APPROXIMATELY 15 MPH, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHEN DEPRESSED. THE BRAKES SCREECHED AND THE VEHICLE FINALLY STOPPED; HOWEVER, THE BRAKE LIGHTS REMAINED ILLUMINATED. THE VEHICLE WAS DRIVEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE BRAKES NEEDED TO BE FLUSHED AND BRAKE FLUID RE-APPLIED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED.  THE VEHICLE WAS TAKEN TO THE DEALER AGAIN WHERE IT WAS DIAGNOSED THAT THE BRAKE BOOSTER WAS COMPLETELY GONE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 137,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "05/27/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872105,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKE CABLE BROKE WHILE DRIVING ON THE HIGHWAY AND CAUSED ALL THE TIRES TO LOCK UP. WHEN THE CABLE BROKE IT WRAPPED AROUND THE LEFT REAR AXLE CAUSING THAT TO BREAK AS WELL AS THE DIFFERENTIAL SEAL. WE NEVER USE THE E BRAKE ON THIS VEHICLE. IT IS VERY ODD THAT THE CABLE WOULD JUST BREAK. I FEEL LIKE THIS IS A MANUFACTURER PROBLEM AND SHOULD BE LOOKED INTO. CABLES BREAKING AND TIRES LOCKING UP COULD BE VERY DANGEROUS/ FATAL.  THE ESTIMATED REPAIR QUOTE TO FIX THIS IS 2325.00",
        "vin": "5N1AA08C98N"
    },
    {
        "components": "AIR BAGS,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "07/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862432,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED NISSAN 2008 ARMADA LE FROM ROYAL NISSAN ON 07/11/2015 AND THE TIRE PRESSURE LIGHT WAS ON AND THEY TOLD ME THE TIRES WERE LOW AND THE SENSORS ARE GONE AND THEY WANT ME TO PAY FOR IT HAD THE TRUCK FOR 3 DAYS AND  TRUCK WOULD NOT START PAID FOR FUEL PUMP AND WRECKER AND THEY SAID IT WAS COMPUTER 400.00 OUT OF POCKET WHEN IT WAS A RECALL ON FUEL SYSTEM BEFORE I HAD TRUCK AND WHEN DRIVING TRUCK AROUND CURVE IT IS LIKE THE TRUCK IS ABOUT TO LOOSE CONTROL FROM THE FRONT AND REAR YOU HAVE TO HOLD STEERING WHEEL TIGHT.BUT I NEED MY 400AND SOMETHING DOLLARS BACK THEY MADE ME PAY FOR A RECALL PART SHAME ON THEM.NOW IN APRIL MY BATTERY WENT OUT AND I CHANGED IT AND THE AIRBAG SEAT BELT LIGHT IS ON BLINKING AND THEY WANT TO CHARGE ME  FOR THIS AND IT IS MAKING A CLICKING NOISE UNDER THE DASHBOARD AND REAR BACK DOOR NOW WHEN YOU START IT UP.",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/18/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861379,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT COMES ON AND BRAKES STOP WORKING PROPERLY. LOUD NOISES AND CRUNCHING SOUNDS FROM UNDER THE HOOD. IF I TURN THE TRUCK OFF AND RESTART, IT FIXES ITSELF FOR A COUPLE OF WEEKS OR SO. NISSAN SAYS MANY THINGS BUT REALLY DONT KNOW. ABS CONTROL MODULE $1600.00 BRAKE BOOSTER$800.00 WHICH I'VE READ DOES NOT WORK . THIS HAPPENS WHILE DRIVING AT ANY SPEED! SO DANGEROUS. I TOW A 24' TRAILER. NOT ANYMORE. I ALSO READ IN S.CAROLINA, NISSAN JUST LOST A LAW SUIT ON THIS SAME SUBJECT. NISSAN.....DO THE RIGHT THING AND RECALL BEFORE SOMEONE DIES!",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "02/04/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING 70 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS OUT OF FUEL, BUT THE INSTRUMENT PANEL FUEL GAUGE DISPLAYED THAT THE VEHICLE STILL HAD ABOUT ONE QUARTER TANK OF FUEL. THE CONTACT MENTIONED THAT THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 10V0740000 (FUEL SYSTEM, OTHER), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS OUT OF WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 194,000.",
        "vin": "5N1AA08C98N"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I OWN A 2008 NISSAN ARMADA. DURING MY WIFE'S COMMUTE HOME THE INSIDE CONTROL PANEL FEEL FROM THE INSIDE OF THE VEHICLE CAUSING HER TO ALMOST COLLIDE WITH ANOTHER VEHICLE. I TOOK THE VEHICLE TO MY LOCAL DEALER AND EXPLAINED TO THEM THAT THE REASON IT FELL WAS DUE TO THE PLASTIC CLIPS THAT HELD IT UP WERE BRITTLE FROM EXTREME HEAT EXPOSURE. THEIR IS NO BARRIER PROTECTION FROM THE ROOF OF THE CAR TO THE PLASTIC CLIPS THAT HOLD IT. THIS CONSOLE WEIGHS ABOUT 25-30 POUNDS, AND COULD HURT ANY PASSENGERS IN THE MIDDLE OR BACK OF THE VEHICLE. IF INSULATION WAS INSTALLED IN BETWEEN THE VEHICLE'S SHELL AND THE INTERIOR OF THE ROOF THIS COULD BE AVOIDED. THIS WOULD AVOID EXTREME HEAT FROM HURTING THE INTEGRITY OF THE PLASTIC CLIPS, OR METAL CLIPS SHOULD BE USED.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763856,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING AT ANY SPEED, THE BRAKE PEDAL PULSATED AND BRAKING POWER SEIZED WHEN THE BRAKE PEDAL WAS DEPRESSED. THE BRAKE LIGHT ILLUMINATED. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 91,000.",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "12/09/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT A SPEED OF APPROXIMATELY 40 MPH I BEGAN TO PRESS ON THE BRAKES WHEN A GRINDING NOISE SUDDENLY OCCURRED AND THE VEHICLE WOULD NOT SLOW DOWN OR COME TO A COMPLETE STOP AS NORMAL. THE BRAKE LIGHTS, T/C LIGHT POPPED UP ON THE DASH BOARD. I ACCELERATED AGAIN TO PULL TO THE SIDE OF THE ROAD, AS  I PRESSED THE BRAKES AGAIN THE GRINDING NOISE OCCURRED AND NO MATTER HOW HARD U PRESS DOWN ON THE BRAKE THE VEHICLE WOULD NOT COME TO A COMPLETE STOP UNTIL IT LOST MOVING MOMENTUM. I TURNED THE VEHICLE OFF AND RESTARTED IT AND ALL LIGHTS WERE OFF AND THE BRAKES OPERATED NORMAL UNTIL A FEW WEEKS LATER IT WOULD REOCCUR  AND NOW HAS BECOME A RANDOMLY REPETITIVE ISSUE.",
        "vin": "5N1BA08C48N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760572,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NUMEROUS TIMES SINCE JANUARY 2013 WHEN WE HAVE BEEN DRIVING ON THE HIGHWAY, ROADWAYS AND PARKING LOTS THE RED BRAKE LIGHT COMES ON AND THE BRAKE PEDAL GOES TO THE FLOOR AND MAKES NOISES.  THE CAR IS VERY HARD TO STOP AND HAS ALMOST CAUSED ACCIDENTS.  ONE OF THE TIMES IT HAPPENED I TOOK THE CAR TO FIRESTONE TO SEE WHAT WAS GOING ON BUT WHEN I TURNED OFF THE CAR IT STOPPED DOING IT BUT THEY DID HAVE CODE C1179/ABS CONTROL UNIT COME UP.  WE CONTACTED NISSAN AND LEFT OUR CAR AT SUNTRUP NISSAN FOR A MONTH.  THEY TOLD US THEY COULD NOT FIND ANYTHING EVEN WHEN I GAVE THEM THE CODE.  WE MET WITH A NISSAN SPECIALIST WHO TOLD US THE PROBLEM WAS THE BRAKE BOOSTER AND GAVE US A PRICE OF JUST OVER $1,000 TO FIX IT.  I HAVE BEEN ONLINE DOING MY OWN RESEARCH AND MANY OTHER PEOPLE HAVE HAD THIS SAME PROBLEM AND CODE AND HAVE ALL SAID THE ABS CONTROL MODULE NEEDS TO BE REPROGRAMMED AND THERE IS A FIRMWARE UPDATE TO FIX A KNOWN BUG.  I AM NOT SURE WHY NISSAN CAN NOT FIND ANYTHING WRONG AND TELL ME IT IS THE BRAKE BOOSTER BUT WHEN I DO RESEARCH I FIND WHAT COULD BE THE PROBLEM AND NOW HAVE TO TAKE MORE TIME OUT AND GO TO A DIFFERENT DEALERSHIP TO GET THE PROBLEM RESOLVED BEFORE MY FAMILY IS IN A HORRIBLE ACCIDENT.  FROM MY RESEARCH THIS IS A COMMON KNOWN PROBLEM THAT CAN BE VERY DANGEROUS IF NOT FIXED RIGHT AWAY AND I THINK NISSAN SHOULD BE RESPONSIBLE.  THE LAST TIME WE TALKED TO NISSAN THEY TOLD US THEY WOULD NOT DO ANYTHING FOR US.  I WANT PEOPLE TO KNOW ABOUT THIS SAFETY PROBLEM AND ALSO THE PROBLEM WITH DEALERSHIPS WHO THINK THEY CAN TAKE ADVANTAGE OF PEOPLE WHO DON'T KNOW ABOUT CARS.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745015,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY 2013, I NOTICED THE FRONT OVERHEAD CENTER CONSOLE STARTED TO CRACK ON BOTH SIDES AT AROUND THE SAME POINTS. I DIDN'T LOOK ANYMORE INTO IT BECAUSE THE APPEARANCE WAS MINIMAL. MY CONCERN CAME ONCE I REALIZED THE CONSOLE WAS LOOSE. I CALLED THE NISSAN DEALERSHIP IN REGARDS TO THE PROBLEM AND WAS TOLD IT WAS A CONSUMER ISSUE WHICH HAD TO BE PAID OUT OF POCKET BECAUSE THERE WASN'T A RECALL ON THE ITEM. AFTER PRICING THE REPLACEMENT PART I WAS NOT ABLE TO PURCHASE DUE TO THE COST WHICH IS ALMOST $1500 TO COMPLETELY REPLACE THE ENTIRE CONSOLE. SINCE THEN THE SMALL CRACKS HAVE SINCE TURNED INTO A COMPLETE CRACK STRAIGHT ACROSS THE CENTER OF THE CONSOLE. EVEN WITH THE CRACK THE CONSOLE CONTINUED TO BE LOOSE BUT WAS STILL SOMEWHAT STABLE. I WENT TO WORK AND AS I CAME OUT TO LEAVE NOTICED IT WAS HANGING BY STREWS. AFTER LOOKING INSIDE WHERE THE CONSOLE WAS BASED THE STREWS WERE STILL STREWED IN ALONG WITH THE PLASTIC FROM THE CONSOLE WHICH HAD BROKEN OFF. AFTER FURTHER RESEARCHING THE ISSUE, I HAVE SINCE REALIZED THIS HAS BEEN A CONTINUOUS AND ONGOING ISSUE WITH THIS PARTICULAR TRUCK.",
        "vin": "5N1AA08D58N"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR OVERHEAD CONSOLE BECAME LOOSE AND FELL WHILE I WAS AT WORK ONE DAY, WHEN I CAME OUT TO MY VEHICLE THE WHOLE CONSOLE WAS HANGING BY ONE OF THE WIRES THAT CONNECTS TO THE AC AND RADIO IN THE CEILING.  I HAVE 3 YOUNG CHILDREN THAT SIT IN THE SECOND SEAT OF MY VEHICLE WHERE THE CONSOLE HAD FALLEN, THANK GOODNESS THEY WERE NOT SITTING THERE THAT DAY! I HAD ASKED MY MECHANIC TO ATTEMPT TO FIX THE CONSOLE, HE WAS NOT ABLE TO AND SUGGESTED THAT I BRING IT TO MY LOCAL NISSAN DEALERSHIP.  FROM THE MULTIPLE COMPLAINTS THAT I HAVE READ ONLINE REGARDING THIS ISSUE, NISSAN IS NOT CONSIDERING IT A RECALL ITEM .... WHY NOT??? IT IS OBVIOUSLY A BAD DESIGN, IT IS TOO BIG, IT IS NOT ATTACHED TO THE CEILING SECURELY ENOUGH FOR SUCH A BIG CONSOLE AND ONCE THE PLASTIC BECOMES OLDER AND BRITTLE .... IT BREAKS! NOW, I DO NOT HAVE AC OR LIGHTS THROUGHOUT MY VEHICLE DUE TO THE VENTS AND LIGHTS BEING IN THE CEILING FOR ANYONE RIDING IN THE SECOND AND THIRD SEATS AKA MY CHILDREN!",
        "vin": "5N1BA08D98N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725004,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR OVERHEAD CONSOLE FELL ONTO MY TWO KIDS WHILE DRIVING. SUB PAR MATERIAL USED IN THE FLIMSY PLASTIC BRACKETS CRACKED AND THE WHOLE THING CAME FALLING DOWN. ONLY THING HOLDING IT UP WAS THE MAIN POWER CABLE.  THIS SHOULD BE A RECALL SINCE THERE A GREAT NUMBER OF THIS SAME EXACT ISSUE.",
        "vin": "5N1BA08D68N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724010,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, FUEL STARTED TO LEAK OUT OF THE VEHICLE WITHOUT ANY WARNING.  THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5N1AA08C28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723348,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT AND ABS LIGHT ILLUMINATED FOLLOWED BY MARKED REDUCTION IN BRAKING POWER.  BRAKING CAUSED A GRINDING AND SPRINGY SOUND.  ONCE CAR WAS TURNED OFF PROBLEM RESOLVED.  THIS HAS HAPPENED ON 3 OCCASIONS.  TWICE EVEN AFTER BRAKE BOOSTER WAS REPLACED (CODE C1179).  THERE IS NO CURRENT RECALL BUT THERE ARE MULTIPLE SIMILAR COMPLAINTS TO FIND ONLINE.  SAFETY IS DEFINITELY IMPACTED.",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS BACKING UP IN THE ARMADA WHEN THE BREAK LIGHT CAME ON FOR NO REAL REASON.  THE BREAKS SOUNDED AS THOUGH THEY WERE GRINDING OR SLIPPING. THE BREAKS DID NOT STOP THE CAR PROPERLY ANYMORE . WE PULLED INTO GAS STATION WHERE WE SHUT THE CAR OFF . WHEN RESTARTING IT THE BREAK LIGHT WAS OFF AND BREAKS WORKED NORMAL AGAIN. 1DAY WHILE DRIVING  THE BREAKS DID IT AGAIN, I COULD BARELY STOP THE ARMADA. ONLY WAY TO FIX IT WAS TO SHUT CAR OFF. I HAVE READ THAT THIS IS A BREAK BOOSTER MALFUNCTION. THIS NEEDS TO BE ADDRESS BY NISSAN BEFORE PEOPLE ARE KILLED FROM LOSS OF BREAKS! THERE ARE MULTIPLE COMPLAINTS FROM PEOPLE ON LINE WITH THE SAME ISSUE AND STORIES OF THE ARMADA BREAKS FAILING.",
        "vin": "5N1BA08D88N"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717663,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE OCCURRENCES - WHILE DRIVING, THE BRAKES BEGIN TO GRIND, STUTTER, AND STOP WORKING. I HAD TO DOWNSHIFT IN ORDER TO SLOW THE VEHICLE, AND PULL OVER.  THE BRAKE LIGHT WILL ILLUMINATE AS THIS OCCURS. AFTER STOPPING THE VEHICLE, IT MUST BE COMPLETELY TURNED OFF FOR A FEW MOMENTS, AND THEN IT WILL GO BACK TO \"NORMAL.\"  THIS HAS ALSO OCCURRED WHILE EXITING THE FREEWAY - NOT SAFE!    AIRBAG LIGHT IS CONSTANTLY ON.      MANY OF THE ELECTRICAL PARTS ARE NOT WORKING. WE THOUGHT NISSAN WOULD BE THE BEST VEHICLE TO BUY. BUT HAVE HAD NOTHING BUT MAJOR PROBLEMS. PLEASE SEND RECALL FOR BRAKES AND AIRBAGS",
        "vin": "5N1AA08D88N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/06/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG AND I HEARD A NOISE IN THE REAR OF THE CAR. I TURNED TO LOOK, BUT COULD NOT SEE ANYTHING THAT COULD HAVE CAUSED THE NOISE AND SO I CONTINUED DRIVING. WITHIN MINUTES THE ENTIRE REAR OVERHEAD CONSOLE FELL BETWEEN THE TWO MIDDLE ROW SEATS AND WAS HANGING SUSPENDED BY THE WIRING. THERE HAD BEEN NO VISIBLE DAMAGE TO THE CONSOLE. I DO NOT HAVE CHILDREN THAT WOULD HAVE BEEN USING THE MONITOR, NOR DO I HAVE BACK SEAT PASSENGERS VERY OFTEN. TOTALLY UNEXPECTED OCCURRENCE. IT SEEMS ALL OF THE MOUNTS, WHICH ARE PLASTIC, BROKE AND THE WHOLE THING CAME TUMBLING DOWN.   *TR",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705958,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PURCHASED OUT, AND OUT OF THE WARRANTY PERIOD.  ON MULTIPLE OCCASIONS, THE BRAKES HAVE HAD NEAR TOTAL FAILURES.  A GRINDING SOUND AND STUTTER OCCUR AND BRAKING POWER IS GREATLY REDUCED.  THE BRAKE LIGHT ILLUMINATES ON THE DASH.  AFTER RESTARTING THE VEHICLE THE PROBLEM IMMEDIATELY GOES AWAY AND HAS DISAPPEARED FOR DAYS OR MONTHS BEFORE RANDOMLY OCCURRING AGAIN.  THE LOCAL DEALER COULD NOT DIAGNOSE THE PROBLEM UNLESS IT WAS DRIVEN TO THEM WITH THE LIGHT ON, HOWEVER, IT IS UNSAFE TO DRIVE WITH THE CONDITION.  BOTH THE DEALER AND NISSAN CONSUMER AFFAIRS CLAIM THEY HAVE NO KNOWLEDGE OF THE ISSUE, OR HAVE OFFERED A FIX FOR THE PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/13/2015",
        "dateOfIncident": "04/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705422,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING AT AN UNKNOWN SPEED, THE BRAKE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD. THE CONTACT MENTIONED THAT A GRINDING SOUND EMITTED FROM THE VEHICLE WHEN THE FAILURE OCCURRED. THE CONTACT WAS ABLE TO STOP THE VEHICLE AND, AFTER RESTARTING IT, THE VEHICLE RESUMED NORMAL OPERATION. THE CONTACT WAS MADE AWARE OF NHTSA CAMPAIGN NUMBER: 10V072000 (SERVICE BRAKES); HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 126,000.",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/07/2015",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO LEVELING SUSPENSION WILL NOT HOLD AIR. SYSTEM DEFLATES AND THE VEHICLE BOUNCES UNCONTROLLABLY.  *TR",
        "vin": "5N1AA08C88N"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/02/2015",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703405,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING AT 5 MPH, THE STEERING WHEEL SEIZED WITHOUT WARNING AND THE BRAKES MADE A GRINDING NOISE. THE VEHICLE HESITATED TO STOP COMPLETELY. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "5N1AA08D58N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "09/29/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701989,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I WERE DRIVING THROUGH ATLANTA, GA (GRADY CURVE) AT 75MPH AND THE FRONT, CENTER CONSOLE FELL AND HIT MY HUSBAND WHO WAS DRIVING.  THE PLASTIC HAD BROKEN AND LITERALLY SHATTERED INTO PIECES BUT THE ELECTRICAL WIRES WERE HOLDING ON TO WHAT WAS LEFT OF THE STRUCTURE.  I TOOK THE CAR TO THE DEALERSHIP AND WAS CHARGED ALMOST $1000 TO FIX IT.  NISSAN AMERICA SAID THERE WAS NO RECALL AND I HAD TO PAY FOR IT IF I WANTED IT FIXED.  A COUPLE MONTHS LATER THE EXACT SAME THING HAPPENED TO THE BACK, CENTER CONSOLE.  THE PLASTIC THAT WAS LEFT WAS SUSPENDED BY THE ELECTRICAL COMPONENTS. WE BROUGHT THE CAR BACK TO THE DEALERSHIP AND THEY REMOVED PART OF IT SO THE KIDS COULD SIT IN THE BACKSEAT WITHOUT THE PLASTIC SPLINTERS FALLING ON THEIR HEADS. I WAS QUOTED OVER $1000 TO FIX IT AND STILL NO RECALL ON THIS FAULTY PLASTIC.   *TR",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693348,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT WORK AND WAS DRIVING DOWN THE HIGHWAY AND ATTEMPTED TO STOP AND THE BRAKE PEDAL BEGAN VIBRATING AND THE BRAKE BOOSTER WAS MAKING A HORRID NOISE AND I HAD TO PUT THE VEHICLE IN LOW GEAR TO GET IT TO SLOW IN BUMPER TO BUMPER TRAFFIC. TODAY 03/10/2015 I RECEIVED A LETTER REGARDING A CLASS ACTION LAWSUIT IN REGARDS TO A SENSOR WITHIN THE BRAKE BOOSTER STATING I NEEDED TO FILE A CLAIM IN ORDER TO RECEIVE COMPENSATION FOR REPAIRS, ALTHOUGH THE CASE HAS NOT BEEN SETTLED AND THE IS NO FINAL COURT DATE UNTIL 05/15/2015 AND WE MAY NOT BE REIMBURSED UNTIL SEPTEMBER OR LATER.. I NEED MY VEHICLE REPAIRED IMMEDIATELY AND DON'T HAVE TIME TO FILE A CLAIM NOR DO I HAVE MONEY TO BE OUT OF POCKET ON A MANUFACTURER DEFECT. NISSAN HAS NOT NOTIFIED THEIR CONSUMERS OF THIS ISSUE AND THIS IS THE FIRST THING I HAVE HEARD OF IT FROM THIS LAW FIRM. I AM POSITIVE THERE HAVE PROBABLY BEEN ACCIDENTS DIRECTLY RELATED TO THIS ISSUE WHICH NISSAN SEEMS TO BE COVERING UP. NISSAN NEEDS TO ISSUE A RECALL AND REPAIR THIS BRAKE BOOSTER IMMEDIATELY AND NISAAN CONSUMERS NEED TO BE NOTIFIED IMMEDIATELY. THIS BRAKE BOOSTER ISSUE INCLUDES 2004-2008 NISSAN TITAN, ARMADA, AND INFINITI QX56 WITH VDC.   *TR",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689702,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF BRAKING POWER IN HEAVY TRAFFIC ON THE FREEWAY. NOISE FROM DASH. HUMMING. BRAKES NOT RESPONDING. SCARY EXPERIENCE FOR ENTIRE FAMILY, INCLUDING 2 CHILDREN (13 AND 6YRS OLD). DOWNSHIFTED TO LOWER GEARS AND PULLED OVER. RESTARTED CAR AND IT RESET.  WE WERE TOLD AT THE DEALERSHIP IT WOULD COST AT LEAST $1000. WE ARE NOW AFRAID TO DRIVE VEHICLE.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660007,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES WILL STOP/START/STOP/START/STOP/START....KIND OF LIKE A GRINDING...THEY STOP WORKING. THE ONLY WAY TO \"SOLVE\" THE ISSUE IS TURN THE CAR OFF, THEN ON AGAIN. THIS HAS HAPPENED ABOUT 12 TIMES SINCE WE BOUGHT THE CAR IN MARCH. OTHERS HAVE COMPLAINED OF THE SAME EXACT ISSUE AS WELL. IT IS VERY DANGEROUS AND I'M APPALLED THAT NISSAN WILL ACTUALLY WAIT UNTIL SOMEONE DIES BEFORE ISSUING A RECALL. I HAVE BEEN DEALING WITH THE NISSAN CORPORATE FOR MONTHS NOW AND MY CAR IS CURRENTLY AT THE DEALERSHIP \"BEING FIXED\". WE WILL BE OUT WELL OVER $2,000 AND THE PROBLEM STILL PERSISTS WITH CUSTOMERS THAT HAVE HAD THIS PREVIOUSLY DONE (DEALERSHIP IS CLAIMING IS A \"BRAKE ACTUATOR ISSUE\"). WE WILL END UP SELLING THIS VEHICLE BECAUSE I CANNOT KEEP PUTTING MYSELF AND MY 13 MONTH OLD DAUGHTER'S LIFE AT RISK. THE THOUGHT OF SELLING IT TO ANOTHER FAMILY WITH THIS ISSUE MAKES MY HEART HURT AND I WILL DO EVERYTHING IN MY POWER TO MAKE SURE NISSAN SEES THIS ISSUE AS LIFE-THREATENING. ONE TIME MY BRAKES WENT OUT ON ME ON THE INTERSTATE IN THE RAIN WITH MY DAUGHTER IN HER CARSEAT. SO PULLING OVER TO TURN MY VEHICLE OFF, THEN ON AGAIN WAS A SECOND TIME WITHIN 5 MINUTES THAT COULD HAVE KILLED US.  *TR",
        "vin": "5N1BA08D48N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653616,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES JUST RANDOMLY START GRINDING AND DON'T WORK. YOU HAVE TO SHUT THE TRUCK OFF AND RESTART FOR IT TO RESET.  I WENT TO A BRAKE SHOP AND SINCE I HAD SHUT IT OFF THEY COULDN'T FIND ANYTHING WRONG. IT HAS DONE THIS 3 TIMES NOW. ALSO MY OVERHEAD COMPARTMENT FELL, ALL THE PLASTIC IS CRUMBLING. IT IS AN OUTRAGEOUS AMOUNT TO REPLACE THIS PART. I LOVE MY NISSAN BUT THIS IS CRAZY THAT THEY WONT DO A RECALL FOR THESE WHEN MOSTLY ALL THE COMPLAINTS ON THIS SITE ARE ABOUT THESE TWO ISSUES.  *TR",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652971,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "9/22/09 - AIRBAG LIGHT STAYING ON - DEALER FOUND CODE B1034 \"CRASH ZONE UNIT FAIL\", FOUND SHORT CIRCUIT INSIDE CRASH ZONE SENSOR, REPLACED CRASH ZONE SENSOR, CLEARED CODE.    9/29/09 - AIRBAG LIGHT ON AGAIN - DEALER FOUND CODE B1034 AGAIN - CRASH ZONE SENSOR FAILED.  FOUND SHORT CIRCUIT IN AIR BAG DIAGNOSTIC UNIT - REMOVED CENTER CONSOLE AND REPLACED AIR BAG DIAGNOSIS CONTROL UNIT, CLEARED CODES.    10/23/09 - AIRBAG LIGHT ON AGAIN - DEALER ONCE AGAIN FOUND CODE B1034 - CALLED NISSAN TECH SUPPORT, SPOKE WITH SOMEONE NAMED MIKE.  WAS ADVISED TO REPLACE BOTH THE ENGINE HARNESS AND THE MAIN HARNESS, REMOVED STEERING WHEEL AND STEERING SHAFT, REMOVED CENTER CONSOLE, REMOVED GLOVE BOX, REMOVED DASH, AND REMOVED CROSSBAR, INSTALLED NEW MAIN HARNESS, INSTALLED NEW ENGINE HARNESS, PERFORMED FRONT END ALIGNMENT BECAUSE STEERING WHEEL AND COLUMN WERE REMOVED.  FOUND OPEN CIRCUIT IN WIRE OF THE MAIN HARNESS, CLEARED CODE.  NOT SURE IF RELATED BUT AT THE SAME TIME THE SUNROOF SWITCHES STARTING WORKING BACKWARDS AND NOT OPENING AUTOMATICALLY SO REINITIALIZED SUNROOF.    1/23/10 - AIRBAG LIGHT ON AGAIN - REPLACED BULB    SEPT 2014 - AIRBAG LIGHT ON AGAIN - DEALER FOUND CODE B1034 AGAIN!!!  SHORT IN CRASH ZONE SENSOR - REPLACED SENSOR - COST $487.72    AT WHAT POINT DOES NISSAN ACCEPT RESPONSIBILITY FOR THE DEFECT???    IN ADDITION TO ABOVE, HAVE HAD ISSUES WITH THE BATTERY NOT LASTING MORE THAN 2.5 YEARS.  I JUST REPLACED IT FOR THE 3RD OR 4TH TIME IN 2012 AND AM TOLD THAT IT IS DRAINED AND I NEED ANOTHER ONE??  RELATED?  I THINK SO.    BRAKES - I'VE SEEN NUMEROUS COMPLAINTS ABOUT PEOPLE PRESSING DOWN THE BRAKES AND HAVING THEM NOT WORK AND THEY MAKE A GRINDING SOUND AND VIBRATE.  I'VE EXPERIENCED THIS TWICE BUT THE DEALER SAYS THEY CAN'T FIND ANYTHING WRONG??  *TR",
        "vin": "5N1AA08C88N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "08/28/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10652813,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 NISSAN ARMADA 'S  INTERIOR ROOF CONSOLE FELL ON TOP OF MY CHILDREN AND THEIR FRIEND'S HEAD WITHOUT WARNING. THIS POSED AN IMMEDIATE SAFETY HAZARD FOR MY CHILDREN AS WELL AS ME.   AFTER PICKING UP MY DAUGHTER AND HER FRIEND FROM PRACTICE, THE INTERIOR ROOF CONSOLE COMPLETELY FELL ON TOP OF THEM. WE WERE ALL SO SCARED. WHEN I HEARD THE LOUD NOISE,  I LOOKED IN THE REAR VIEW MIRROR AND WASN'T SURE WHAT HAPPENED.  AT FIRST I THOUGHT  WE SOMEHOW WERE HIT BUT I QUICKLY REALIZED THAT IT WAS THE CONSOLE THAT FELL. MY REAR VIEW WAS COMPLETELY OBSTRUCTED. THE CONSOLE HIT TWO OF THEM ON TOP OF THE HEAD AND THEY WERE IN THE MIDDLE ROW. IT ALSO HIT MY 6 YEAR OLD ON THE TOP OF THE HEAD  WHO WAS IN THE BACK ROW.  THEY HAD TO HOLD IT UP UNTIL I WAS ABLE TO SAFELY STOP . IT WAS HANGING BY THE ELECTRICAL WIRES FOR THE LIGHTS AND DVD PLAYER.  I TOOK PICTURES AND CALLED THE LOCAL NISSAN DEALERSHIP WHICH NEVER RETURNED ANY OF MY PHONE CALLS. THIS IS A VERY EXPENSIVE REPLACEMENT FOR A POORLY MANUFACTURED CONSOLE. IT'S MADE OUT OF PLASTIC AND SHOULD BE BOLTED TO THE ROOF WITH METAL SCREWS.  THIS IS THE 4TH NISSAN THAT I HAVE OWNED AND SADLY I DOUBT THAT I WILL OWN ANOTHER UNLESS THIS SAFETY ISSUES IS RESOLVED. I HAVE BEEN A LOYAL CUSTOMER FOR 10 YEARS AND INTRODUCED 5 FAMILIES TO THE NISSAN FAMILY AND IF THIS SAFETY ISSUE ISN'T RESOLVED AT NISSAN EXPENSE, I WILL BE LEAVING.  *TR",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648935,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH WILL NOT OPEN IN COOL WEATHER.  THE REAR HATCH ACTUATOR WAS REPLACED IN 2011 AND EVERY AUTUMN WHEN IT STARTS TO GET COOL, THE REAR HATCH WILL NOT UNLOCK AND OPEN.  WE SEND IT TO THE AUTO MECHANIC AND THEY LUBRICATE THE MECHANISM AND IT WILL LAST THROUGH MOST OF THE WINTER SEASON.  SOME WINTERS IT WILL OPEN UNTIL SPRING, SOMETIMES WE HAVE TO DRIVE IT BACK TO THE MECHANIC A SECOND TIME BEFORE THE WEATHER GETS WARM.  *TR",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641667,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR HATCH LOCK ACTUATOR FAILS IN COOL TEMPERATURES.  THIS LEAVES THE REAR HATCH UNABLE TO OPEN.   IN THE EVENT OF AN ACCIDENT OR FIRE, I WOULD BE UNABLE TO GET MY CHILDREN OUT OF THE 3RD ROW SEATING.  THIS HAPPENS EACH YEAR AS SOON AS THE TEMPERATURES DROP BELOW 50.  THERE ARE NUMEROUS ISSUES EXPERIENCED BY OTHER ARMADA OWNERS NOTED AT:  HTTP://WWW.CLUBARMADA.COM/FORUMS/ARCHIVE/INDEX.PHP/T-11055.HTML.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "08/02/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638491,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES EFFECTIVENESS IS SIGNIFICANTLY REDUCED, BY AS MUCH AS 60%, AND IT MAKES A POPPING AND SPRING NOISE. WHEN YOU APPLY THE BRAKES, IT MAKES A GRINDING SOUND. YOU MUST PULL OVER, TURN THE CAR OFF, PUMP THE BREAKS AND THEN RESTART THE CAR. YOU MAY HAVE TO TURN THE CAR OFF/ON SEVERAL TIMES. I'VE PAID THOUSANDS OF DOLLARS TO VARIOUS MECHANICS TO HAVE THIS ISSUE RESOLVED. IT GOES ALONG FINE FOR AWHILE, AND THEN THE PROBLEM REPEATS ITSELF. IT'S INTERMITTENT AND VERY DANGEROUS. ALSO, THE SUSPENSION MAKES A POPPING NOISE WHEN YOU GO OVER A DIP IN THE ROAD OR MAKE A SHARP TURN. THESE ARE EVIDENTLY KNOWN DEFECTS AND ALTHOUGH I DID GET A RECALL NOTICE FROM NISSAN, WHEN I BROUGHT MY VEHICLE IN, THEY SPENT 20 MINUTES LOOKING AT IT AND SAID EVERYTHING WAS FINE. IT CONTINUES TO HAPPEN. I'M RECORDING THIS NOTIFICATION SO IT CAN BE ADDED TO THE MANY COMPLAINTS I'VE FOUND REGARDING BOTH OF THESE KNOWN ISSUES. AT WHAT POINT IS SOMETHING GOING TO BE DONE FOR THE CONSUMERS?? IF THERE'S A CLASS ACTION LAWSUIT, I'M IN!!  *TR",
        "vin": "5N1BA08C78N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630751,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWING DOWN GETTING READY TO ENTER A PARKING LOT. I STARTED TO PRESS THE BRAKES, AND THEN THE BRAKE LIGHT ON THE DASH TURNS ON. I HEARD GRINDING AND THE VEHICLE KEEP MOVING BUT THE BRAKES WOULDN'T WORK. I PLACED THE FLASHERS ON. I THEN TURNED OFF THE ARMADA. I RESTARTED IT AND EVERYTHING SEEMED FINE AFTER THAT.    BUT NOW I'M SCARED, THAT THE VEHICLE IS NOT SAFE FOR ME OR MY FAMILY. WHAT IF THIS HAD HAPPENED TO ME ON A FREEWAY? I CALLED CENTRAL HOUSTON NISSAN (HOUSTON, TX) AND THEY SEEMED TO BE BOTHERED WITH ME CALLING ABOUT THIS COMPLAINT. AND THERE ARE MANY OTHERS WITH THE SAME COMPLAINT. AND NISSAN DOESN'T WANT TO ADMIT ANY FAULT? I HOPE THAT NO ONE GETS INJURED OR WORSE FROM THIS...    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5N1BA08D48N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630831,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED WHILE TRAVELING AT ANY SPEED THE BRAKES SEIZED AND ABRUPTLY STOPPED THE VEHICLE OR THE BRAKE PEDAL WAS SOFT WHICH DID NOT PROVIDE ENOUGH SAFTY TO DEPRESS THE PEDAL TO SLOW DOWN INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO INDICATED THAT THE BRAKE ACTUATOR NEEDED TO BE REPLACED BUT WAS NOT ABLE TO GIVE A DEFINATE DIAGNOSIS INDICATING THAT THE PART SPECIFICALLY NEEDED TO BE REPAIRED. THE VEHICLE WAS ALSO TAKEN TO AN INDEPENDENT MECHANIC WHO INDICATED THAT THERE WAS AN ABS FAILURE AND TO HAVE THE AUTHORIZED DEALER REPAIR THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 10V072000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 72,500. DYD",
        "vin": "5N1AA08C08N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630550,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS AND BRAKE LIGHT CAME ON AND BRAKES WOULD NOT WORK. I COULD FEEL VIBRATIONS AND HEARD GRINDING WHENEVER I ATTEMPTED TO APPLY THE BRAKES. AFTER PULLING OVER AND RESTARTING THE VEHICLE WHILE WAITING FOR ASSISTANCE, I NOTICED THE BRAKE LIGHT DID NOT COME ON. I PULLED OFF TO TEST THE BRAKES AT THIS POINT AND THEY WORKED FINE. THE PROBLEM OCCURRED AGAIN ON SEPTEMBER 1, 2014 WHILE DRIVING AT MINIMAL SPEED, BUT ONLY THE BRAKE LIGHT CAME ON WHEN THE BRAKING SYSTEM FAILED. AGAIN, AFTER COASTING TO THE SIDE OF THE ROAD AND RESTARTING THE VEHICLE, THE BRAKE LIGHT TURNED OFF AND THE BRAKES WERE OPERATIONAL. AFTER HAVING THE BRAKING SYSTEM CHECKED I WAS TOLD THAT THE COMPUTER DIAGNOSTIC SHOWED CODE 1179. I CALLED NISSAN'S CORPORATE NUMBER TO REPORT THE INCIDENT AND WAS OFF HANDEDLY TOLD THAT ALL 2008 NISSAN ARMADAS ARE NOT EXPERIENCING THE PROBLEM. MY VEHICLE IS CURRENTLY BEING INSPECTED BY THE CENTRAL NISSAN DEALERSHIP IN HOUSTON TEXAS, AND I WILL REPORT THE FINDINGS TO THE NORTH AMERICAN NISSAN CORPORATION.   *TR",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630543,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DEPRESSING THE BRAKE PEDAL, PEDAL WENT ALL THE WAY TO THE FLOOR WITH A GRINDING NOISE.  NO BRAKES WHEN THIS HAPPENED, AND BRAKE LIGHT LIT UP ON DASH.  ONCE CAR WAS TURNED OFF AND BACK ON AGAIN, PROBLEM RESET ITSELF AND BRAKES WORKED LIKE THEY WERE SUPPOSE TO.  THIS HAS HAPPENED TWO OTHER TIMES SINCE THEN WITH PROBLEM BEING RESOLVED BY TURNING CAR OFF AND BACK ON TO RESET.  ONLY REMEDY NISSAN GIVES IS TAKE IT TO NEAREST DEALER WHEN THE PROBLEM EXISTS.  THIS IS OVER AN HOUR AWAY FROM WHERE I LIVE, AND ACROSS THE MOUNTAIN.  WITH NO BRAKES, THIS IS SOMETHING I AM NOT WILLING TO RISK.  *TR",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630036,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE FAILED TO STOP WHEN THE BRAKE PEDAL WAS DEPRESSED. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE DEALER STATED THAT THE BRAKE BOOSTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 74,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626388,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING THE VEHICLE HAS A BRAKE LIGHT THAT COMES ON AND THE CAR WILL NOT STOP PROPERLY.  THE ABS IS ACTIVATED AND THE CAR MUST BE RESTARTED TO CLEAR THE BRAKE LIGHT AND FOR THE BRAKES TO WORK PROPERLY.  THIS IS A VERY DANGEROUS SITUATION BECAUSE IT HAPPENS AT RANDOM.    *TR",
        "vin": "5N1AA08C58N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621156,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ROOF CONSOLE CRACKED AND IS HANGING FROM THE ROOF. THIS SEEMS TO BE A COMMON PROBLEM FROM WHAT I HAVE RESEARCHED. I TOOK IT TO THE NISSAN DEALERSHIP AND FOR THEM TO REPLACE IT ITS GOING TO COST ME 3000 THAT IS ABSURD.   I SHOULDN'T HAVE TO PAY FOR SOMETHING THAT IS NISSANS PROBLEM FOR USING CHEAP BRACKETS TO HOLD IT IN PLACE. I WOULD LIKE NISSAN TO DO A RECALL ON THESE AND FIX THEM. I OWN 3 NISSAN CARS AND AFTER THIS NOT SURE I WANT A CAR THAT WILL FALL APART AND NO ONE WANTS TO MAKE THE EFFORT TO FIX IT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "03/17/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615841,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE (ALONG WITH OUR 2 CHILDREN UNDER THE AGE OF 5) WAS ATTEMPTING TO APPLY THE BRAKES AS SHE APPROACHED  AN INTERSECTION TO MAKE A TURN.  THE SUV RESPONDED BY BEGINNING TO SHAKE VIOLENTLY, MAKE VERY LOUD NOISES, & ULTIMATELY THE BRAKES FAILED. SHE OBSERVED THE PARKING BRAKE LIGHT WAS ILLUMINATED ON THE DASH BOARD.  SHE WAS ABLE TO CONTINUE ON THE CURRENT ROAD & DOWNSHIFT TO REDUCE SPEED BEFORE PULLING OVER TO THE SIDE OF THE ROAD.  SHE THEN TURNED THE SUV OFF & BACK ON.  AFTER RE-IGNITION, THE BRAKE LIGHT WAS NO LONGER ILLUMINATED, AND THE BRAKES FUNCTIONED NORMALLY.  WHEN SHE GOT HOME I DID SOME RESEARCH ONLINE ABOUT THIS PROBLEM AND NOTICED THOUSANDS OF OTHER NISSAN OWNERS HAVE EXPERIENCED THIS EXACT SAME ISSUE, TO THE POINT OF A CLASS ACTION LAWSUIT CURRENTLY UNDERWAY IN CALIFORNIA.     THIS IS AT LEAST THE 8TH TIME THIS HAS HAPPENED IN THIS VEHICLE OVER THE COURSE OF 3 YEARS OF OWNING.  THANKFULLY, IT HAS NOT RESULTED IN A CRASH, INJURY OR FATALITY TO DATE.  THE SAME BRAKE FAILURE HAS OCCURRED WHILE DRIVING AT SPEEDS UP TO 70MPH.  EVERY INCIDENT OCCURS SIMILARLY, WITH SHAKING, NOISE, AND PARKING BRAKE LIGHT ILLUMINATION.  TURNING THE VEHICLE OFF AND RESTARTING SEEMS TO TEMPORARILY SOLVE THE PROBLEM, BUT IT HAS CONTINUED TO OCCUR RANDOMLY.  THIS IS A VERY UNSAFE ISSUE AND THAT NEEDS IMMEDIATE ATTENTION!!  *TR",
        "vin": "5N1AA08D08N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10606994,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND COMPLAINT REGARDING THE OVERHEAD CONSOLE IN MY 2008 NISSAN ARMADA. INITIALLY I RAISED CONCERN ABOUT THE CONSOLE BEING LOOSE. THIS MORNING THE OVERHEAD CONSOLE FELL ONTO MY CHILD.I CONTACTED NISSAN ABOUT WHY NO RECALL WAS NEVER ISSUED WHEN THERE ARE NUMEROUS COMPLAINTS ONLINE FOR THE SAME ISSUE. THIS IS A SAFETY HAZARD. I'VE GOTTEN THE RUNAROUND FROM THEM. I TOOK MY ARMADA TO THE DEALERSHIP THIS MORNING TO REPAIR THE CONSOLE. I WAS TOLD THERE IT WAS A KNOWN ISSUE. THE CONSOLE IS SECURED BY PLASTIC BRACKETS THAT EVENTUALLY BREAK. THE CONSOLE CANNOT BE REPAIRED, ONLY REPLACED. TO REPLACE THE CONSOLE IS $2900. WE SHOULD NOT HAVE TO BE RESPONSIBLE FOR NISSAN'S USE OF SUBPAR PARTS. A RECALL NEEDS TO BE ISSUED TO ADDRESS THIS. FORTUNATELY MY CHILD WAS NOT SERIOUSLY INJURED.  *TR",
        "vin": "5N1AA08C08N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/22/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A CROWDED FREEWAY IN HOUSTON.  THE BRAKE LIGHT CAME ON.  WHEN A SLOW DOWN WAS ATTEMPTED, THE BRAKES MADE A LOUD NOISE AND THE PEDAL WAS SOFT.  BRAKING EFFECTIVENESS WAS SEVERELY REDUCED.  WE WERE ABLE TO CONTROL THE VEHICLE, PULL OFF THE FREEWAY AND STOP.  ONCE STOPPED, WE TURNED OFF THE CAR AND THEN RESTARTED IT.  ONCE RESTARTED, THE PROBLEM WAS RESOLVED.  THIS IS APPROXIMATELY THE 5TH TIME THAT THE SAME HAS HAPPENED.  OTHER TIMES, HAVE HAPPENED RARELY, SEVERAL MONTHS APART.  UPON CALLING NISSAN, THEY SUGGESTED THAT THE BRAKE BOOSTER NEEDED TO BE REPLACED, BUT NOT FOR CERTAIN.   *TR",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/05/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596444,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE NOTICED THE VEHICLE STEERING AND BRAKES SHAKING UPON APPLYING WHILE STOPPING FOR SIGNAL LIGHTS OR STOP SIGNS.  IT WILL ALSO HAPPEN AT FREEWAY SPEEDS IF ANOTHER CAR PULLS OVER IN FRONT OF ME AND I APPLY THE BRAKES. THE INCIDENT THAT HAPPENED YESTERDAY - I WAS TRAVELING THROUGH A SCHOOL ZONE AT 35 MPH.  I LOOKED AT MY SPEEDOMETER TO DOUBLE CHECK MY SPEED AND NOTICED THE EMERGENCY BRAKE LIGHT WAS ON.  I LOOKED AT MY ER BRAKE AND IT WAS NOT ENGAGED.  WHEN I APPLIED MY FOOT BRAKE TO STOP AT A SIGNAL LIGHT, THE CAR SHOOK, THE BRAKES MADE A GRINDING NOISE, AND MADE AN ELECTRONIC/SPRING TYPE NOISE.  THE PEDAL LOWERED ITSELF ABOUT ANOTHER 1/3 DISTANCE BEFORE STOPPING.  MY HEART SKIPPED A BEAT.  WHAT IF I COULDN'T HAVE STOP AT THE SCHOOL CROSSING ZONE AND HAD HIT A CHILD?  (WHAT WOULD NISSAN HAVE SAID TO THAT?) I DROVE IT TO MY DAUGHTER'S HOUSE AND PARKED IN FRONT ON LEVEL GROUND.  SINCE I WAS FROM OUT OF TOWN, WE CALLED A TOW TRUCK TO TAKE IT TO A LOCAL FIRESTONE.  THE FIRESTONE DEALER COULD NOT FIND ANYTHING WRONG WITH THE BRAKES OR PADS.  SEEMS LIKE TURNING OFF THE VEHICLE AND RESTARTING IT, RESET IT.  THE FIRESTONE DEALER STATED IT HAD TO BE ELECTRONIC.  I'VE READ THAT THIS WILL HAPPEN AGAIN AND HAS BEEN HAPPENING FOR QUITE SOMETIME.  IF THE POWERS THAT BE CAN GET NISSAN TO RECALL THE GAUGE INSIDE THE FUEL TANK AND THE PIN ON THE BRAKES - THEN WHY CANNOT NISSAN BE FORCED TO CORRECT THIS MORE SERIOUS BRAKE PROBLEM BEFORE MORE ACCIDENTS OR DEATHS HAPPEN.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595579,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING HOME FROM PICKING MY DAUGHTER UP FORM SCHOOL. I HEARD A NOISE THAT SOUNDED LIKE SOMETHING FELL ON THE ROOF OF MY TRUCK. MY DAUGHTER SCREAMED MOMMY! I TURNED AROUND IN A PANIC TO SEE MY OVERHEAD CONSOLE HANGING AND IN PIECES. I IMMEDIATELY PULLED OVER TO MY CRYING DAUGHTER WHO WAS SCRATCHED BY ONE OF THE PIECES THAT  FELL AND BROKE BY HITTING THE MIDDLE CONSOLE. THE PLASTIC CONSOLE WAS SHATTERED AND SOME OF THE PLASTIC STILL REMAINS AROUND THE SCREWS.  I TOOK MY VEHICLE TO THE DEALERSHIP THE FOLLOWING MORNING TO HAVE THEM REPAIR IT BECAUSE I THOUGHT FOR SURE THIS WAS A RECALL ISSUE. TO MY SURPRISE THE DEALER TOLD ME IT'S NOT A RECALL ITEM AND THAT THIS ISSUE HAS NOT REACHED THE RECALL COMPLAINT RATIO. THEY  GAVE ME A QUOTE FOR THE REPLACEMENT AND LABOR COST OF $2,500! I LOOKED ONLINE TO SEE IF THERE WERE ANY OTHER COMPLAINTS AND TO MY SATISFACTION I'M NOT THE ONLY ONE.  IT'S A FACT THAT NISSAN 2008 NISSAN ARMADA AND TITAN VEHICLES HAVE THE SAME PROBLEMS. THIS IS A HAZARD AND CAN CAUSE AN ACCIDENT WHILE DRIVING. THIS MATTER SHOULD BE ADDRESSED BY A RECALL AND REPLACEMENT OF ALL CONSOLES FREE OF CHARGE AND A NOTICE TO ALL OWNERS STATING   (WARNING / CAUTION ADVISORY) POTENTIAL HAZARD / RISK WHILE DRIVING YOUR CONSOLE MAY FALL OR CRACK INTO PIECES WITHOUT REASON!",
        "vin": "5N1BA08D68N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592079,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASE 2008 NEW ARMADA AND HAVING MANY PROBLEMS SINCE PURCHASE OCTOBER2007- THE TOP CONSOLE FELL OFF WHILE DRIVING ABOUT A YEAR AGO WENT TO NISSAN DEALER AND THEY SAID IS NOT COVER WITH WARRANTY ( THIS HAPPEN WITHIN BEFORE MY  60K MILES WARRANTY) THEY TOLD ME I NEED TO PURCHASE THAT IT WAS NOT FACTORY DEFECT. A FEW WEEKS AGO THE OTHER PART OF CONSOLE FRONT DRIVER CRACK AND IS HANGING . I  HAVE NO LIGHTS IN THE BACK OR FRONT. IS A SAFETY HAZARD THIS THING CAN BREAK IN THE MIDDLE OF ME DRIVING AND NISSAN IS NOT TAKING RESPONSIBILITY OF THEIR CHEAP PRODUCTS , I'VE BEEN SEARCHING AND SEEN A LOT OF COMPLAINTS ABOUT THIS ISSUE AND NOTHING IS BEING DONE ABOUT IT. I NEED HELP ON THIS MATTER IS NOT FAIR FOR CUSTOMER TO PAY OUT OF POCKET TO CORRECT A COMPANY ISSUE.. WE ALREADY PAID ENOUGH MONEY ON THE VEHICLE.  NOT ONLY THAT MY CAR HAD AN ENGINE ISSUE WHICH THEY REFUSE TO CHANGE WHEN I FIRST COMPLAINT THEY DID IT AFTER MANY COMPLAINTS AND HAVING A STATE TROOPER TAKE ME TO THE DEALER OR SAFETY HAZARD THE CAR USED TO SMOKE DARK SMOKE EVERY DAY ..GUESS NISSAN WAS AFRAID OF LAWSUIT IF SOMETHING HAPPENED.   PLEASE HELP.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "05/07/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588316,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE FRONT AND REAR CENTER CONSOLES WERE BROKEN. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN DIAGNOSED THAT BOTH CENTERPIECES NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 72,000. THE CURRENT MILEAGE WAS 98,639.",
        "vin": "5N1BA08D88N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "03/31/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME ON THE WAY FROM WORK ON THE INTERSTATE AT ABOUT 60 MILES.  THE BRAKE LIGHT CAME ON ABOUT HALF WAY HOME.  WHEN I TRIED TO SLOW DOWN AT THE EXIT, THE BRAKES STARTED GRINDING AND MAKING A ROUGH SOUND AND SHAKING .  I HAD TO PUMP THE BRAKES TO GET IT TO STOP. I PARKED THE CAR ON A STREET AND TURNED IT OFF. MY HUSBAND CAME TO TAKE A LOOK AT IT, BUT ONCE THE CAR WAS RESTARTED, THE BRAKE LIGHT WAS OFF AND HE COULD NOT DUPLICATE THE PROBLEM.  THIS HAS HAPPENED INTERMITTENTLY BUT I CAN'T SEEM TO GET IT TO DUPLICATE AT THE DEALERSHIP.  I HAVE HAD OTHER ISSUES WITH MY BRAKES AS WELL.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "07/31/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577821,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING I ATTEMPTED TO APPLY THE BRAKES TO MAKE A RIGHT TURN , IRONICALLY INTO AN AUTO PARTS STORE , AND THE BRAKE PEDAL FELT AS IF IT WENT ALL THE WAY TO THE FLOOR.  THE PEDAL VIBRATED AS IF THE ABS WAS KICKING IN BUT ALSO MADE A LOUD GRINDING NOISE. THE ARMADA FINALLY ROLLED TO A COMPLETE STOP , I DIDN'T KNOW WHAT TO DO SO I TURNED IT OFF.  I POPPED THE HOOD CHECKED THE FLUIDS AND DID A VISUAL CHECK OF THE BREAKS AND EVERYTHING SEEMED NORMAL.  I RESTARTED THE VEHICLE AND TO MY SURPRISE IT FIXED ITSELF. THE NEXT MORNING I WENT TO ROBBINS NISSAN WHERE I PURCHASED THE VEHICLE AND I WAS ADVISED NOTHING COULD BE SINCE THE BRAKE LIGHT WAS NOT ON.  EVER SINCE THEN, THIS SAME ISSUE OCCURS AT LEAST ONCE EVERY 3 MONTHS. I TOOK IT IN TWO MORE TIMES BUT NOTHING COULD BE DONE SINCE I DIDN'T TAKE IT IN WITH THE BRAKES NOT WORKING.  SO BASICALLY I'M SUPPOSE TO DRIVE IT IN TO THE DEALER WITH NO BREAKS AND THE BRAKE LIGHT ON WHICH NO IS GOING TO ESPECIALLY IF THEY ARE DRIVING WITH THEIR FAMILY AS I WAS. OR IF YOU'RE TRAVELING AND THERE ISN'T A DEALER AROUND.  *TR",
        "vin": "5N1BA08D88N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577527,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED IN THE CARPOOL LANE AT MY SON'S SCHOOL; IN PARK.  CARPOOL LANE BEGAN TO MOVE SO I PLACED MY CAR IN GEAR.  SLOWLY MOVING UP AND I HEARD A NOISE.  STARTLED, PLACED MY CAR BACK IN PARK.  THEN NOTICED THAT MY EMERGENCY BRAKE LIGHT WAS ON AS WELL AS MY SLIP & VDC LIGHTS.  PICKED-UP MY SON AND I WAS DRIVING AWAY FROM THE SCHOOL AND HEADED TO A STOP LIGHT.  I FOUND THAT I LITERALLY HAD TO STAND ON MY BRAKES TO STOP THE CAR.  IT WAS NOT AN IMMEDIATE STOP, MORE OF A ROLLING STOP AND IT FELT AS THOUGH MY BRAKE WAS BEING PUSHED ALL THE WAY INTO THE ENGINE!!!  NOT THE SAFEST OF SITUATIONS.  NEEDLESS TO SAY, THE CAR IS PARKED IN THE GARAGE UNTIL WE CAN GET SOME AFFIRMATIVE ANSWERS.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2014",
        "dateOfIncident": "09/10/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567567,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL - THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE OVER HEAD CONSOLE FELL AND CRACKED. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 66,000 AND THE CURRENT MILEAGE WAS 67,800. PM   *TR",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2014",
        "dateOfIncident": "10/14/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558502,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME ON THE WAY FROM WORK ON THE BELTWAY AT 65 MILES AND WHEN I SLOWED DOWN, THE BRAKES STARTED GRINDING AND MAKING A ROUGH SOUND. THE BRAKE LIGHT HAD TURNED ON. I HAD TO PULL OVER TO TURN THE TRUCK OFF. WHEN I STARTED THE TRUCK BACK UP, THE BRAKE LIGHT TURNED OFF AND THE BRAKES WERE WORKING AGAIN. THIS HAS HAPPENED INTERMITTENTLY BUT I CAN'T SEEM TO GET IT CHECKED SINCE IT HAPPENS AT RANDOM TIMES.   *TR",
        "vin": "5N1BA08D88N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/24/2013",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553605,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST NIGHT READY TO LEAVE AND LOAD FAMILY INTO VEHICLE. MY HUSBAND OPENS THE BACK DOOR TO LOAD A STROLLER BUT THE DOOR DID NOT OPEN. HE KEPT LOCKING IT AND UNLOCKING WITH THE CONTROL AND DOOR HINGE AND WINDOW HINGE WERE STUCK. IN ORDER TO OPEN DOOR HE HAD TO CLIMB INSIDE VEHICLE PULL THE PLASTIC CAP OF AND PULL LEVER TO MANUALLY OPEN BACK DOOR. WE CAN HEAR IT LOCK BUT IT WONT OPEN. THE LEVELS FEEL ROUGH AND STUCK WHEN YOU PULL TO TRY AND OPEN DOOR AND WINDOW.   *TR",
        "vin": "5N1AA08D88N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/15/2013",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552483,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING I HEARD A NOISE THAT SOUNDED LIKE SOMETHING FELL ON THE ROOF OF MY TRUCK. MY CHILD POINTED TO THE OVERHEAD CONSOLE. IT HAD BROKEN OFF OF WHATEVER WAS SECURING IT AND IS NOW HANGING. I'VE LOOKED ONLINE AND FOUND NUMEROUS PEOPLE EXPERIENCING THIS ISSUE. NISSAN NEEDS TO ADDRESS THIS. AN OVERHEAD CONSOLE THAT CAN FALL AT ANY TIME WITHOUT WARNING IS DANGEROUS. MY CHILD COULD HAVE BEEN INJURED.  *TR",
        "vin": "5N1AA08C08N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "11/02/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550868,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 109,000+ MILES ON MY 2008 NISSAN ARMADA. WHILE DRIVING HOME I NOTICED MY REAR WINDOW HAD CLOUDED AND WITHIN A FEW SECONDS I SAW MY RPMS REV TO OVER 4000. I DISENGAGED THE CRUISE CONTROL TO PREVENT IT FROM TRYING TO MAINTAIN MY SPEED OF 70 MPH. AT THAT POINT I LOST THE DRIVE FROM THE TRANSMISSION. LUCKILY I WAS ABLE TO COAST TO A STOP ON THE SHOULDER OF AN EXIT WITHOUT AN ACCIDENT. ONCE STOPPED I CHECKED TO SEE IF THE TRANSMISSION WOULD ENGAGE ENOUGH FOR ME TO DRIVE IT INTO A SERVICE STATION PARKING LOT; IT DID. I LOOKED AT THE VEHICLE AND HAD TRANSMISSION FLUID FROM THE DRIVER'S SIDE FRONT WHEEL TO THE REAR END OF THE VEHICLE. I FOUND FLUID ACCUMULATED IN THE FRONT SKID PAN.  BEING OUT OF WARRANTY I CONTACTED THE NISSAN DEALER I PURCHASED THE VEHICLE FROM AND A TRANSMISSION SPECIALIST COMPANY TO DISCUSS.  NISSAN DEALER TOLD ME THEY KNOW OF NO PROBLEMS NISSAN IS HAVING LIKE THIS, BUT I WOULD HAVE TO REPLACE THE TRANSMISSION, OIL COOLER, AND RADIATOR.... APPROXIMATELY $7,000.00+. THE TRANSMISSION SPECIALIST I CALLED IMMEDIATELY TOLD ME THE PROBLEM WITH MY VEHICLE AS SOON AS I MENTIONED I LOST DRIVE POWER. HE TOLD ME I HAVE THE SAME PROBLEM WITH THE TRANSMISSION OIL COOLER CRACKING ALLOWING WATER TO ENTER THE TRANSMISSION CAUSING DAMAGE THE TWO NISSAN ARMADAS HE HAD RECENTLY REPAIRED. HE TOLD ME TO CHECK WITH NISSAN BEFORE DOING ANYTHING BECAUSE NISSAN HAD TO EXTEND TRANSMISSION WARRANTIES ON SEVERAL MODELS.  THEY USE THE VIN # FOR LEGIBILITY. I CONTACTED NISSAN (1-800-NISSAN 1). THEY SAID MY VIN # WASN'T IN THE PROGRAM SO IT IS NOT COVERED EVEN THOUGH I HAVE THE SAME PROBLEM THAT THEIR OTHER VEHICLES ARE HAVING. HOW IS THIS POSSIBLE?  OTHER PROBLEMS FROM THE BEGINNING... 4 FUEL SENDING UNITS - STILL INACCURATE, SEVERAL ATTEMPTS TO REPAIR BACK CAMERA SYSTEM INCLUDING REPLACING IT - STILL BLANKING OUT OR SCROLLING OUT OF CONTROL, AND ROOF CONSOLE JUST DROPPING OFF.  *TR",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "10/12/2013",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548831,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE FRONT SEAT ADJUSTER MOTOR CAUGHT THE UNDER SIDE OF THE SEAT ON FIRE WHILE NO ONE TOUCHED THE SEAT ADJUSTER.  FOR SOME REASON THE ADJUSTER MOTOR HEATED UP AND WHEN MY WIFE, CHILD, AND MOTHER HAD TO PULL OFF OF THE INTERSTATE DUE TO SMOKE, I WAS LUCKILY BEHIND THEM AND GOT THE FAMILY OUT OF THE CAR AND THEN LOOKED UNDER THE SEAT AND SAW 3 INCH FLAMES COMING OUT OF ONE OF THE ADJUSTER MOTORS.  I WAS ABLE TO PULL THE MOTOR OUT FROM UNDER THE SEAT AFTER I POURED A WATER BOTTLE OVER THE MOTOR AND USED TWO PAIRS OF GLOVES TO KEEP FROM BURNING MY HANDS.  FROM LOOKING AT THE ADJUSTER MOTOR AFTER PULLED FROM THE VEHICLE ONE END WAS COMPLETELY GONE AS IT MELTED AND BURNED OFF THE PLASTIC COVER.  IT ALSO BURNED A COUPLE OF HOLES IN THE CARPET UNDER THE SEAT.  I CANNOT BELIEVE THAT A MOTOR WOULD JUST CATCH ON FIRE AND AFTER TAKING THE VEHICLE TO RANDY REED NISSAN, THE SERVICE DEPARTMENT STATED THE SEAT ADJUSTER WAS STUCK IN THE \"ON\" POSITION.  THE QUESTION I HAVE IS HOW CAN IT STICK IN THE ON POSITION WHEN WE ARE NOT TOUCHING THE SEAT ADJUSTERS.  LASTLY, SINCE MY WIFE STATED SHE SMELLED A BURNT SMELL WHILE THE VEHICLE WAS IN THE OFF POSITION, WHAT IF THE ADJUSTER CAUGHT FIRE WHILE IN  THE GARAGE AND CAUSE THE VEHICLE TO BURN AND CATCHING THE HOUSE ON FIRE.  I SAY THIS BECAUSE THE ADJUSTOR WOULD HAVE CAUGHT FIRE WHILE THE VEHICLE WAS OFF.  IT HAD NOTHING TO DO WITH HAVING THE VEHICLE ON.  THERE SHOULD BE A SAFETY SWITCH TO KEEP SOMETHING LIKE THAT FROM HAPPENING.  IT ALSO CAUSED $3,600 IN REPAIR WHICH WE HAVE NOT COMPLETED YET.   *TR",
        "vin": "5N1BA08C08N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2013",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548545,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OVERHEAD CONSOLE FELL DOWN WITHOUT WARNING GOING DOWN THE ROAD AT 55 MPH.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2008 NISSAN ARMADA BRAND NEW. AROUND MID SUMMER OF 2011 I NOTICED SMALL GAPS IN MY OVERHEAD REAR OEM CONSOLE. I CAME OUT FROM WORK STILL DURING THIS SAME TIME FRAME AND NOTICED THAT MY ENTIRE OVERHEAD REAR OEM CONSOLE HAD FALLEN. IT WAS ONLY HANGING BY A FRONT SCREW AND A REAR SCREW.  I WENT TO THE NISSAN DEALER IN TOWN ONLY TO BE TOLD LOOKED LIKE SOMEONE HAD BEEN HANGING ON IT AND PULLED IT DOWN. THE NISSAN MECHANICS UNPLUGGED AND UNHOOKED EVERYTHING CONNECTED TO THE CONSOLE AND TOOK IT DOWN.  I CALLED NISSAN CORPORATE AND EXPLAINED THAT THEY HAD USED SUBSTANDARD MATERIALS.  NISSAN TOLD ME THERE WAS NOTHING THAT THEY COULD DO.  I CALLED MY INSURANCE AND WAS TOLD IT WOULD NOT BE COVERED.  MY INSURANCE TOLD ME THAT THEY WOULD RESEARCH IT TO SEE IF ANY OTHER ARMADA OWNERS HAD THE SAME ISSUE.  THEY CLAIMED NOT TO BE ABLE TO FIND ANY.  A FEW WEEKS LATER I STARTED NOTICING CRACKS IN THE FRONT OVERHEAD CONSOLE.  IT ALSO FELL WITHIN A FEW DAYS.  WHEN THE REAR CONSOLE FELL I PRICED THE PART AND IT WAS OVER $900.  I DIDN'T EVEN BOTHER PRICING THE FRONT.  I DID IN TURN DO RESEARCH ONLINE AND FOUND AN ENTIRE SITE DEDICATED TO 2008 AND OTHER ARMADA OWNERS THAT EXPERIENCED THE SAME PROBLEM.  NISSAN SHOULD TAKE RESPONSIBILITY FOR USING SUBSTANDARD MATERIALS WHEN CONSTRUCTING THEIR VEHICLES.  THE PAINT ON THE HOOD IS ALSO STARTING TO WEAR AWAY ON THE HOOD.  AFTER PAYING MY HARD EARNED MONEY FOR THIS VEHICLE I THINK NISSAN SHOULD HAVE RECEIVED A VEHICLE THAT WASN'T GOING TO CRASH IN AROUND ME. I OWN A SECOND 06 NISSAN AND THE PAINT IS WEARING AWAY ON THE TOP OF IT ALSO. I WILL NOT BE BUYING ANOTHER NISSAN UNTIL THEY CAN IMPROVE ON THEIR MATERIALS AND CUSTOMER SATISFACTION.  *TR",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2013",
        "dateOfIncident": "09/12/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE VEHICLE VIBRATED WHEN THE BRAKE PEDAL WAS DEPRESSED. IN ADDITION, THE CONTACT STATED THAT THE BRAKING SYSTEM WAS DELAYED AND FELT AS IF IT WOULD NOT ENGAGE.  THE EMERGENCY BRAKE WARNING LIGHT ILLUMINATED AS THE FAILURE OCCURRED. THE FAILURE WAS RECURRING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE A DIAGNOSTIC WAS PERFORMED, WHICH LOCATED THE FAILURE AT THE BRAKE BOOSTER. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 35,250 AND THE CURRENT MILEAGE WAS 35,475.",
        "vin": "5N1BA08DX8N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2013",
        "dateOfIncident": "01/09/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ENTERING INTO THE VEHICLE WE NOTICED THE FRONT PORTION OF THE CENTER OVERHEAD CONSOLE WAS SAGGING.  WE OPENED THE FIRST COMPARTMENT AND THE PIECE IN WHICH THE SCREW IS PLACED INTO TO CONNECT THE CONSOLE TO THE ROOF OF THE VEHICLE CRACKED OFF AND HAD FALLEN OFF CAUSING THE CONSOLE TO LONGER BE CONNECTED.  HAD THIS OCCURRED WHILE DRIVING, IT COULD HAVE CAUSED AN ACCIDENT.  THIS IS A SAFETY ISSUE.",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2013",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533089,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OVERHEAD CONSOLE OF MY VEHICLE WAS HANGING FROM THE CEILING.  MY CAR WAS PARKED AS IT HAPPENED WHILE I WAS AT WORK.  I THOUGHT SOMEONE HAD BROKEN INTO MY CAR SINCE THERE WAS BROKEN PLASTIC EVERYWHERE.  THE FRONT HALF OF THE OVERHEAD CONSOLE WAS HANGING.  I WAS ABLE TO DISCONNECT THE WIRES SO THAT I COULD DRIVE IT HOME.  I ORDERED THE REPLACEMENT PART FROM THE LOCAL NISSAN DEALERSHIP AND IT CAME IN A WEEK LATER.  WE TIGHTENED THE BACK PART OF THE OVERHEAD CONSOLE BECAUSE AFTER LOOKING IT OVER WE NOTICED THAT IT WAS ALSO LOOSE AND CRACKING.  IT IS ONLY A MATTER OF TIME BEFORE THE BACK PART WILL ALSO BREAK OFF AND FALL.  *TR",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/26/2013",
        "dateOfIncident": "07/24/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521984,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING THE NISSAN TO ILLINOIS FROM OHIO AND WHILE DRIVING ON THE FREEWAY THE BRAKE LIGHT COMES ON AND SHE PROCEEDED TO HIT THE BRAKES WHICH WERE NOT THERE THE PEDAL WENT COMPLETELY TO THE FLOOR AND MADE A GRINDING SOUND AS IF THE BRAKE LINES WERE CUT.  SHE CALLS ME IN A PANIC AND I TELL HER HOW TO DOWN SHIFT THE CAR.  SHE FINALLY GETS IT TO A STOP AND TURNS OFF THE VEHICLE AND WHEN SHE GOES TO START IT AGAIN THE BRAKES ARE COMPLETELY BACK WITH OUT ANY MALFUNCTION.  SHE WAS ABLE TO GET TO HER DESTINATION WERE SHE TOOK IT TO COURTESY NISSAN IN MOLINE ILL.  THEY DIAGNOSED IT AS A RIGHT FRONT WHEEL BEARING GRINDING CAUSING ABS SENSOR TO THINK WHEEL SPEED WAS DIFFERENT, WHICH THEY REPLACED RIGHT FRONT HUB AND SENSOR AND SENT HER ON HER WAY WITH $829.16 BILL.  THAT WAS JULY 25, 2012 SHE DROVE THE VEHICLE FOR A DAY ON JULY 27, 2012 SHE WAS GOING DOWN A HILL WHEN THE BRAKES DECIDED TO FAIL AGAIN SHE DOWN SHIFTED AND CAME TO REST AGAINST A ATM TO STOP FROM GOING INTO BUSY TRAFFIC.  SHE DROVE THE CAR TO THE DEALERSHIP WHILE THE BRAKES WERE STILL IN FAIL MODE WHERE THEY PROMPTLY PLUGGED IT INTO THE COMPUTER AND THE SCAN SHOWED CODE C1179 DELTA SENSOR, THEY SAID THEY PERFORMED TEST TO DETERMINE INTERNAL ABS CONTROLLER FAILURE AND THEN REPLACED ABS CONTROLLER AT A VERY STEEP PRICE.  MY WIFE WAS ABLE TO DRIVE THE NISSAN HOME WITH MY FAMILY INSIDE BECAUSE THEY SAID IT WAS SAFE TO DRIVE AND THEN ON JUNE 14, 2012THE BRAKES FAILED AGAIN WHEN WE TOOK THE VEHICLE TO NISSAN OF MANSFIELD MMG THEY GOT THE CODE BUT ONCE THE CAR WAS TUNED OFF THEY COULD NOT GET THE PROBLEM TO DUPLICATE.  CORPORATE AND THE LOCAL DEALER SAID THAT THEY DON'T KNOW WHAT THEY CAN DO FOR ME SINCE THE PROBLEM WILL NOT DUPLICATE AND IF IT HAPPENS AGAIN TO BRING IT RIGHT OVER WHICH IS A 40 MINUTE DRIVE FOR ME FROM MY HOUSE LET ALONE PUTTING MYSELF AND MY FAMILY'S LIFE AT RISK.  *TR",
        "vin": "5N1AA08CX8N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/09/2013",
        "dateOfIncident": "06/09/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515929,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GOING OVER A SPEED BUMP, MY SON NOTICED THE CEILING CENTER CONSOLE COMING LOOSE. AFTER PARKING THE CAR, THE CONSOLE FELL. LUCKILY MY SON CAUGHT IT, HAD HE NOT NOTICED IT WAS LOOSE THE CONSOLE WOULD'VE FELL IN HIS HEAD. *TR.... UPDATED 02/19/15 *BF",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/11/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511740,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS PARKED AT THE STORE, MY FAMILY AND I RETURNED TO THE ARMADA AND FOUND THE FRONT CONSOLE HAD FELL FROM CEILING OF VEHICLE.. IF YOU LOOK YOU WILL SEE THERE ARE NUMEROUS INCIDENTS OF THESE CONSOLES FALLING OUT OF THE CEILING. I DO NOT KNOW WHY THERE HAS NOT BEEN A RECALL ON THIS VEHICLE. THIS IS VERY DANGEROUS. THERE IS A DEFECT WITH WHERE THE SCREWS GO IN TO HOLD THIS UP. THE PLASTIC JUST CRUMBLES AROUND IT. AFTER THIS HAPPENED I CHECKED THE REAR ONE TO INSPECT THE CONDITION IT IS IN. THE RIGID PLASTIC IS CRACKED AROUND THEM TOO. ANY DAY NOW I AM WAITING FOR THIS ONE TO FALL OUT AS WELL. THESE CONSOLES FALLING COULD CAUSE AN ACCIDENT BECAUSE IT WILL DEFINITELY HIT THE DRIVER IN THE HEAD AND CAUSE A DISTRACTION. WE WILL CHECK TO SEE IF ANY CLASS ACTION SUITS HAVE STARTED OR CAN BE STARTED.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/13/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS APPROACHING INTERSECTION WHEN MY BRAKES FAILED  AND MY TRUCK BEGAN TO SHAKE VERY BAD AND MADE VERY LOUD NOISES. I THEN NOTICED THE BRAKE LIGHT WAS ILLUMINATED ON THE DASH BOARD. I THEN PULLED OVER TO THE SIDE OF THE ROAD AND TURNED VEHICLE OFF AND INSPECTED BRAKE SYSTEM. WHEN I PRECEDED TO TURN VEHICLE BACK ON I NOTICED THE BRAKE LIGHT WAS OFF. THE BRAKES WERE FINE AFTER RESTARTING THE VEHICLE. WHEN I GOT HOME I DID SOME RESEARCH ONLINE ABOUT THIS PROBLEM AND NOTICED THOUSANDS OF OTHER NISSAN OWNERS HAVE EXPERIENCED THIS EXACT SAME ISSUE. THIS IS A VERY UNSAFE ISSUE AND THAT NEEDS IMMEDIATE ATTENTION!! *TR",
        "vin": "5N1BA08D98N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/08/2013",
        "dateOfIncident": "04/24/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10511182,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE CONSOLE IN THE CEILING OF THE VEHICLE BECAME DETACHED, STRIKING THE CONTACT IN THE CRANIUM. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND WAS INFORMED THAT THE CONSOLE WOULD HAVE TO BE RE-ATTACHED BUT NO CAUSE FOR THE FAILURE WAS DETERMINED. ONE WEEK LATER, THE REAR CEILING CONSOLE BECAME DETACHED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 47,500 AND THE CURRENT MILEAGE WAS 52,000.",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/05/2013",
        "dateOfIncident": "05/05/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510717,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST YEAR MY NISSAN ARMADA 2008 HAS HAD NUMEROUS FAILING PARTS THAT ALL INCLUDE ELECTRICAL ISSUES OF SOME SORT.  FIRST THE PASSENGER SIDE WINDOW STOPPED WORKING AND THEN THE AC IS NOW STUCK IN MAX AC.  THIEVES ISSUES ARE NOT SAFETY RELATED BUT MAY CONTRIBUTE TO THE HORRIBLE ELECTRICAL ISSUES THIS MODEL HAS.  THE OTHER DAY MY WIFE WAS PICKING THE KIDS UP FROM SCHOOL WHEN SHE REALIZED THE BRAKE LIGHT CAME ON AND THE BRAKES WERE MAKING A HORRIBLE GRINDING NOISE WITH NO OR LIMITED BRAKING ABILITY.  SHE PULLED OVER AND TURNED THE CAR OFF.  5 MINUTES LATER SHE TURNED THE CAR ON AND THE LIGHT AND BRAKING PROBLEM WENT AWAY.  3 DAYS LATER THIS HAPPENED AGAIN.  TURNED OFF CAR, RESTARTED AND PROBLEM WENT AWAY.  AFTER LOOKING THROUGH NUMEROUS MESSAGE BOARDS AND FORUMS, IT SEEMS THIS PROBLEM HAS BEEN DOCUMENTED IN HUNDREDS OF CASES OR MORE.  NISSAN HAS NOT DONE ANYTHING ABOUT THIS FROM WHAT I UNDERSTAND.  IT SEEMS A FIX OR AT LEAST A FIX THAT COMES BACK IN MANY CASES IS TO REPLACE THE BRAKE BOOSTER AND REPROGRAM THE VDC.  THIS LOOKS LIKE IT HAS BEEN RUNNING ABOUT 800 TO 1000 DOLLARS TO FIX.  MANY OF THE CONSUMERS THAT REPORTED THIS PROBLEM HAVE REPORTED AFTER BEING FIXED, THE PROBLEM COMES BACK WITHIN MONTHS OR A YEAR AFTER BEING FIXED.  A RECALL IS NEEDED AS THIS IS LIFE THREATENING TO FAMILIES DRIVING IN THE SUV AND ALSO TO OTHERS ON THE ROAD.   *TR",
        "vin": "5N1AA08D58N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2013",
        "dateOfIncident": "04/25/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510523,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVERHEAD CENTER CONSOLE FELL FROM THE CEILING. THE CONTACT TOOK THE VEHICLE TO THE DEALER. THE DEALER STATED THAT THE OVERHEAD CONSOLE FAILED DUE TO AN UNKNOWN PART THAT FRACTURED. THE DEALER RECOMMENDED HAVING THE OVERHEAD CONSOLE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505278,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVERHEAD CONSOLE STORAGE COMPARTMENTS WERE BEGINNING TO FRACTURE. ALSO, THE CONTACT MENTIONED THAT THE CONSOLES IN THE REAR OF THE VEHICLE ALSO STARTED TO FAIL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE CENTER CONSOLE NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 55,829.  *TR",
        "vin": "5N1BA08D68N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501279,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE REAR OVERHEAD CONSOLE  FELL FROM ITS HOUSING AND ONTO THE PASSENGER. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN STATED THAT THE REAR CONSOLE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 50,000. THE VIN NUMBER WAS NOT AVAILABLE.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2013",
        "dateOfIncident": "12/21/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491711,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A USED 2008 NISSAN ARMADA LE (48000MILES) WITH TOW PACKAGE AND HOOKED UP TO MY SMALL ENCLOSED TRAILER (1800 GWR). I WENT INTO MY HOUSE FOR LESS THAN 5 MINUTES AND WHEN I RETURNED TO THE TRUCK I SAW IT WAS COMPLETELY BOTTOMED OUT IN THE REAR.  I STARTED THE TRUCK AND THE COMPRESSOR CAME ON AND AUTO LEVELED OUT, BUT WITHIN 15 MINUTES OF DRIVING IT WAS COMPLETELY FLAT AND CAUSED SEVERE HANDLING ISSUES. THIS IS VERY DANGEROUS AND COULD LEAD TO AN ACCIDENT. AFTER DOING SOME RESEARCH ONLINE I SAW THAT THIS IS EXTREMELY COMMON AND NISSAN HAS A SERVICE BULLETIN OUT BUT WILL NOT RECALL THERE FAULTY AIR LINES THAT RUN FROM THE COMPRESSOR TO THE REAR AIR BAGS. PEOPLE ALL OVER HAVE BEEN SHOCKED AT NISSAN'S FAILURE TO ADDRESS THE PROBLEM AND NOT FINDING A PERMANENT FIX. I HAVE SEEN PEOPLE WITH BRAND NEW MODELS CLAIM THE HAVE HAD THE WHOLE SYSTEM REPLACED MULTIPLE TIMES AND THE LEAK STILL RE-OCCURS LEADING TO THE AIR BAG FAILURE. THIS IS WHAT THE LEMON LAWS WERE WRITTEN FOR SO I HOPE SOMEONE PURSUED IT.   I HOPE WRITING THIS HELPS ALL OWNERS GET THIS PROBLEM RESOLVED AND I URGE ANYONE THAT OWNS A NISSAN ARMADA TO LOOK AND LISTEN FOR THE COMPRESSOR RUNNING. IT'S NOT TOO OBVIOUS OF A PROBLEM UNTIL YOU ATTEMPT TO TOW BUT YOU WILL SEE THE REAR SAGGING AND THE COMPRESSOR TURNING ON FREQUENTLY. FOR MORE INFO RESEARCH IT HERE HTTP://WWW.CLUBARMADA.COM/FORUMS/SHOW THREAD.PHP?T=12815  AND THE TECHNICAL SERVICE BULLETIN FOR NISSAN IS NTB10142.  *TR",
        "vin": "5N1AA08C48N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "11/12/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488603,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, HE NOTICED A THUMPING NOISE WHEN TURNING LEFT. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN STATED THAT THE LOWER CONTROL ARM WELDING SEPARATED AND AS A RESULT, THE LOWER CONTROL ARM NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 10E019000 (SUSPENSION:FRONT:CONTROL ARM:LOWER ARM). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 74,398.",
        "vin": "5N1AA08C68N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485214,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE REAR OVERHEAD CONSOLE CRACKED AND FELL ON THE PASSENGER. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 92,500 AND THE CURRENT MILEAGE WAS 93,000.",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/17/2012",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485029,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR UNKNOWN REASONS THE FRONT WINDOWS (DRIVER AND PASSENGER) WILL LET THEMSELVES DOWN. HAVE ASKED NISSAN DEALER ABOUT THIS SEVERAL TIMES AND THEY SAID WE MUST HAVE HIT THE REMOTE KEY. I DON'T BUY THIS AS THIS OCCURRED WHILE KEYS TO THE VEHICLE WAS IN SPOUSES PURSE AND PURSE WAS ON FLOOR SOME 50 YARDS AWAY. THIS IS NOT FIRST TIME THIS HAS OCCURRED. THIS HAS OCCURRED SEVERAL TIMES AND WE HAVE INQUIRED AT DEALER AND ALWAYS GET SAME ANSWER-SOMEONE HIT THE KEY.     ANOTHER PROBLEM IS THE STEERING WHEEL SEEMS TO LOCK UP AND YOU CAN'T START THE AUTO UNLESS YOU WORK WITH THE STEERING WHEEL TURNING FROM 9 TO 3, 3 TO 9, 9 TO 3, 3 TO 9. EVENTUALLY IT WILL FREE ITSELF UP.   *TR",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/14/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484663,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVER HEAD CONSOLE STORAGE COMPARTMENTS STARTED TO FRACTURE. THE CONSOLES IN THE REAR OF THE VEHICLE ALSO STARTED TO FALL. THE VEHICLE WAS NOT INSPECTED BY A DEALER OR AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS CONTACTED AND ADVISED HIM TO TAKE THE VEHICLE TO THE DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000. THE CURRENT MILEAGE WAS APPROXIMATELY 99,200. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2012",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING, THE ENTIRE MOLDING AROUND THE DVD PLAYER, BACKSEAT AIR CONTROLS, AND LIGHT FIXTURES CAME CRASHING DOWN. PIECES OF THE MOLDING FLEW EVERYWHERE.  *TR",
        "vin": "5N1BA08D18N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478543,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUT THE ROAD I CROSSED A RAILROAD TRACK DOING ABOUT 30 MILES PER HOUR.  THE REAR ROOF CONSOLE CAME CRASHING DOWN AND HIT MY WIFE IN THE HEAD AND BROKE IN HALF.  I HAVE CONTACTED THE RAILROAD ABOUT THIS INCIDENT. HOWEVER, IF YOU LOOK YOU WILL SEE THERE ARE NUMEROUS INCIDENTS OF THESE CONSOLES FALLING OUT OF THE CEILING.  AFTER CONTACTING MY ATTORNEY ABOUT THIS PROBLEM HE TOLD ME TO SEND IN A COMPLAINT AND SEE IF THAT HELPS.  I DO NOT KNOW WHY THERE HAS NOT BEEN A RECALL ON THIS VEHICLE.  THIS IS VERY DANGEROUS.  IF MY WIFE HAD NOT BEEN IN THE BACK SEAT WITH MY GRANDCHILD IT WOULD HAVE HIT HER OR MY GREAT NIECE IN THE HEAD.  THERE IS A DEFECT WITH WHERE THE SCREWS GO IN TO HOLD THIS UP.  THE PLASTIC JUST CRUMBLES AROUND IT.  AFTER THIS HAPPENED I CHECKED THE FRONT ONE TO INSPECT THE CONDITION IT IS IN.  WELL WHAT DO YOU KNOW, THE FRIGGIN PLASTIC IS CRACKED AROUND THEM TOO.  ANY DAY NOW I AM WAITING FOR THIS ONE TO FALL OUT AS WELL.  WHEN IT GOES, IT COULD CAUSE AN ACCIDENT BECAUSE IT WILL DEFINITELY HIT THE DRIVER IN THE HEAD AND CAUSE A DISTRACTION.  I WOULD APPRECIATE A RESPONSE BACK WITHIN A FEW DAYS. *TR",
        "vin": "5N1BA08C98N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/28/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477448,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERHEAD CONSOLE AT THE FRONT (SUNGLASSES HOLDER) FELL FROM CONSOLE. THE CLIPS BROKE AND IT FELL WHILE DRIVING. (APPROXIMATELY OCTOBER 2011). WE FIXED THE PROBLEM ON OUR OWN.   ABOUT THE SAME TIME, THE REAR OVERHEAD CONSOLE CAME LOOSE, AND WAS PARTLY HANGING FROM THE CEILING. THE CLIPS WERE BROKEN, AND WE USED BOLTS TO HOLD IT BACK IN PLACE, BUT SUMMER 2012, THE REAR CONSOLE COMPARTMENT FELL WHILE DRIVING AND HIT OUR SON. HE WAS UNINJURED, BUT HE WASN'T SITTING DIRECTLY UNDER IT, WHERE HE COULD HAVE CAUSED MINOR INJURIES. CANNOT FIND A REPLACEMENT PART WITHOUT GOING THROUGH NISSAN AND PAYING $1,000+.   *TR",
        "vin": "5N1BA08C78N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2012",
        "dateOfIncident": "09/10/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE PARKED, THE CONTACT NOTICED THAT THE HOUSING FOR THE REAR OVERHEAD CONSOLE WAS FRACTURED. THE DEALER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT THAT THE CONSOLE ASSEMBLY WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 93,000.",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2012",
        "dateOfIncident": "09/12/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475222,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVERHEAD CONTROLLABLE VARIANCE UNIT SEPARATED FROM THE BASE. THE CONTACT STATED THAT THE FAILURE OCCURRED DUE TO DEFECTIVE MATERIAL THAT CAUSED THE SCREWS SEPARATE. THE VEHICLE WAS NEITHER REPAIRED NOR TAKEN TO THE DEALER FOR INSPECTION. THE FAILURE AND CURRENT MILEAGE WAS 60,650.",
        "vin": "5N1AA08C78N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2012",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474572,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "8/22/12 WHILE DRIVING IN DAYTIME NORMAL CONDITIONS WAS STOPPED AT A RED-LIGHT, TURNED RIGHT ONTO A VERY BUSY 4 LANE DIVIDED ROAD, BRAKE LIGHT ON DASH CAME ON AND BRAKES MADE A GRINDING/SPRING POPPING KIND OF SOUND AND \"GRABBED\" OR STOPPED JERKILY WHEN I PUSHED ON THE BRAKE PEDAL AGAIN TO SLOW TO A STOP AT THE NEXT RED-LIGHT.  TOOK EXTRA DISTANCE TO STOP DUE TO DECREASED BRAKE POWER/STRENGTH, LUCKILY I WAS THE FIRST CAR IN LINE AT THE RED-LIGHT.  TURNED OFF THE ROAD AND INTO A PARKING LOT WITH BRAKES CONTINUING AS NOTED ABOVE, SAT IN PARKING LOT UNTIL MY FATHER IN LAW ARRIVED.  I TURNED ENGINE OFF TO TAKE MY CAR KEY OFF MY KEYRING SO MY F-I-L COULD DRIVE MY CAR HOME OR TO THE SHOP, THE BRAKE LIGHT WAS OFF THEN AND THE BRAKES WORKED NORMALLY.  HAD VEHICLE CHECKED WITH CODE-READER WHICH DIDN'T READ ANY ERRORS, HUSBAND CHANGED BRAKE PADS AND ENSURED FLUIDS WERE AT APPROPRIATE LEVELS, BRAKES CONTINUED TO FUNCTION NORMALLY.   9/10/12  DRIVING IN NORMAL DAYTIME CONDITIONS, STOPPED AT RED-LIGHT ON EXTREMELY BUSY 6 LANE ROAD, TURNED LEFT ONTO ANOTHER STREET, EXPERIENCED SAME PROBLEM DESCRIBED ABOVE, VIDEOED ISSUE WITH IPHONE AS DROVE AROUND EMPTY PARKING LOT.  PARKED AND TURNED ENGINE OFF, HUSBAND CAME AND DROVE CAR TO DEALERSHIP, BRAKES FUNCTIONED NORMALLY.  ONLINE RESEARCH REVEALED HUNDREDS OF OWNERS WITH THIS COMPLAINT, SOME WITH COMPLETE BRAKE FAILURE, IS SAID TO BE ABS SYSTEM ENGAGING FOR NO REASON D/T BRAKE BOOSTER PROBLEM.  DEALERSHIP CHARGED MY HUSBAND $100 TO \"DIAGNOSE\" PROBLEM, DETERMINED TO BE BRAKE BOOSTER ISSUE, STATED NISSAN NOT RESPONSIBLE FOR COST OF REPAIR WHICH COULD BE $500-$1000.  NISSAN NOTIFIED OF ISSUE BY MY HUSBAND, REC'D CASE #, WAITING ON RESPONSE FROM NISSAN AS TO WHAT THEY ARE GOING TO DO.  VERY DANGEROUS SITUATION, COULD'VE EASILY RESULTED IN SEVERE ACCIDENT AND CATASTROPHIC INJURIES TO MYSELF, MY CHILD, AND MY HUSBAND.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2012",
        "dateOfIncident": "08/20/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473790,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS MAKING A NOISE LIKE IT HAD A HOLE IN THE EXHAUST. COME TO FIND OUT, BOTH OF THE EXHAUST MANIFOLDS ARE CRACKED. 3000 PAST THE 80000 MILE WARRANTY AND NISSAN WILL NOT COVER IT. NEEDLESS TO SAY, I SURE WISH THERE COULD BE AN EXTENSION TO THIS WARRANTY AS THERE WAS WITH ANOTHER MANUFACTURER THAT EXTENDED IT TO 100000 MILES. SOMETHING NEEDS TO BE DONE. THIS IS A FAILURE TO PROTECT THE AMERICAN CONSUMER.  *TR",
        "vin": "5N1AA08C68N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2012",
        "dateOfIncident": "06/13/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472638,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE OVERHEAD CONSOLE DETACHED FROM THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE FAILURE WAS A COMMON OCCURRENCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 67,826 AND THE CURRENT MILEAGE WAS 72,019.  UPDATED 10/03/12*LJ    THE CONSUMER STATED THE FRONT OVERHEAD CONSOLE WAS CRACKING AND WOULD SOON FALL. THE MANUFACTURER WAS NOTIFIED AND OFFERED NO ASSISTANCE. UPDATED 10/04/2012 *JS",
        "vin": "5N1BA08D98N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/21/2012",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471768,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE ABS SYSTEM FAILED. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES FOR THE FAILURE. THE DEALER REPLACED THE BRAKE SENSOR AND THE BRAKE ACTUATOR HOWEVER, THE FAILURE WAS NOT CORRECTED. THE BRAKE WARNING LIGHT ILLUMINATED WHENEVER THE BRAKES WERE DEPRESSED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE A DIAGNOSTIC WAS PERFORMED AND LOCATED THE FAILURE AT THE BRAKE BOOSTER. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 56,000 AND THE CURRENT MILEAGE WAS 76,000.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2012",
        "dateOfIncident": "08/18/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471516,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BEING DRIVEN OUT OF GARAGE AT LOW SPEED.  SUDDENLY, THERE WAS A CLUNK AND LOSS OF CONTROL OF THE FRONT PASSENGER WHEEL.  THERE WERE NO PRIOR WARNING SIGNS OR SYMPTOMS.  UPON INSPECTION, THE FRONT PASSENGER TIE ROD HAD DIS-ATTACHED ITSELF FROM THE WHEEL, RESULTING IN NO STEERING CONTROL OF THE FRONT PASSENGER WHEEL.  HAD THIS HAPPENED AT A SPEED GREATER THAN 25 MPH, SERIOUS/FATAL ACCIDENT AND INJURY WOULD HAVE BEEN LIKELY.  THIS IS A SERIOUS MALFUNCTION OF THE SYSTEM WITH NO PRIOR WARNING SIGNS.  NISSAN DEALER HAS CONFIRMED THIS IS A SERIOUS ISSUE THAT IS NOT THE RESULT OF ANY OWNER FAULT.  *TR",
        "vin": "5N1AA08CX8N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2012",
        "dateOfIncident": "08/02/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469544,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 ARMADA AND WHEN I WENT TO STOP AT A RED LIGHT AND  I LOST BRAKE POWER. THERE WAS A HORRIBLE GRINDING SOUND AND THE DASHBOARD BRAKE LIGHT LIT UP. AFTER COASTING INTO A PARKING LOT I SHUT MY CAR OFF. MY HUSBAND CAME AND CHECKED THE CAR AND DROVE AROUND THE PARKING LOT AND EVERYTHING SEEMED FINE. THE WARNING LIGHTS WENT OUT AND THE BRAKES WORKED AGAIN. WE STILL HAVE A WARRANTY AND THE DEALER CAN'T SEEM TO FIND A PROBLEM. UH...WHEN ME AND MY KIDS ARE IN THE CAR AND WE LOSE BRAKE POWER...THAT'S KIND OF A HUGE PROBLEM. THIS HAS BEEN OCCURRING IN ARMADA'S SINCE 2004. PLEASE SOMEONE FIX THIS BECAUSE I NO LONGER FEEL SAFE IN MY CAR AND THE IT THE ENTIRE REASON I BOUGHT THE ARMADA.  *TR",
        "vin": "5N1BA08C08N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "05/10/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465321,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 45 MPH DOWN A STREET WHEN MY BRAKES LOST PRESSURE AND BEGAN THE ABS CAVITATION. LUCKILY I WAS STILL ABLE TO STOP HOWEVER I HAD ZERO BRAKE PRESSURE AND ANY AMOUNT OF PEDAL MOVEMENT INITIATED THE ABS PUMP BRAKE ACTION. TURNING THE VEHICLE OFF THEN STARTING BACK UP RESOLVED THE ISSUE TEMPORARILY. I TOOK IT TO STADIUM NISSAN IN THE CITY OF ORANGE WHO SAID I NEEDED TO REPLACE MY BRAKE BOOSTER AT A COST OF $800. I'VE SEEN DOZENS OF REPORTS OF THIS EXACT ISSUE ON CLUBARMADA.COM. I BELIEVE THIS NEEDS TO BE RECALLED AS IT IS EXTREMELY DANGEROUS FOR ANY CONSUMER WITH THIS VEHICLE.  *TR",
        "vin": "5N1AA08D28N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2012",
        "dateOfIncident": "06/02/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462835,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE FAILURE OCCURED WHILE DRIVING ON A CITY STREET AT 35MPH, IT ACTED LIKE THE ABS SYSTEM FAILED.  THIS HAPPENED ON A SATURDAY. I CALLED THE NISSAN DEALER WE PURCHASED IT FROM THE FOLLOWING MONDAY TO GET AN APPOINTMENT TO HAVE IT CHECKED OUT.  THE DEALER GOT ME IN THE NEXT DAY AND THE TECH SAID THE BRAKE MASTER CYLINDER AND SENSOR WAS DEFECTIVE AND IT NEEDED TO BE REPLACED.  THE SERVICE MANAGER FOR THE DEALER SAID THE PART WAS $700.00 AND LABOR WAS $400.00-500.00 BUT IT WOULD ONLY BE 80 PERCENT FIXED. THE PROBLEM WAS A DEFECTIVE BRAKE MASTER CYLINDER AND NISSAN HAS BEEN AWARE OF THIS SINCE 2004 BUT HAS DONE NOTHING FOR ANYONE WHO OWNS A NISSAN VEHICLE WITH THIS PROBLEM.  IT WAS NOT COVERED UNDER WARRANTY. AFTER I CONTACTED NISSAN CONSUMER RELATIONS THEY STATED A REPLACEMENT OR FIX FOR THIS SAFETY PROBLEM ON MY VEHICLE WAS DECLINED DUE TO EXPIRED WARRANTY. T  HE WARRANTY HAD EXPIRED BY TIME NOT MILES.  THE NISSAN REP SAID IT WAS UNSAFE IF THE BRAKES FAIL ANY TIME THE VEHICLES DRIVEN.   THE NISSAN REP SAID BASED SOLELY ON EXPIRED WARRANTY ANY REPAIR SERVICE WOULD BE AT OUR EXPENCE.  *TT",
        "vin": "5N1BA08C78N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/03/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457433,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHT COMES ON WHEN BRAKES ARE USED, THERE IS A DECREASED BREAKING POWER. THE BRAKES MAKE A CRUNCHING, SPRINGY NOISE WITH THE PEDAL BEING EXTREMELY SOFT UNTIL IT GETS CLOSER TO THE FLOOR AND BEGINS TO GIVE BRAKING POWER. WHEN IGNITION OS TURNED OFF, THE PROBLEM RESOLVES AT LEAST TEMPORARILY. WHEN THE ENGINE HAS TURNED OFF, I HAVE HAD THE PROBLEM REOCCUR AS SOON AS 5 MINUTES AND AS LONG AS 3 MONTHS.  *TR",
        "vin": "5N1BA08D38N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "04/22/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456101,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, SHE APPLIED THE BRAKES AND HEARD A GRINDING NOISE. THE BRAKES DID NOT STOP THE VEHICLE, BUT THE CONTACT WAS ABLE TO SUCCESSFULLY COAST TO A STOP. THE VEHICLE WAS SAFELY DRIVEN TO AN AUTHORIZED DEALER AND WAS IN THE PROCESS OF HAVING THE FAILURE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/03/2012",
        "dateOfIncident": "11/24/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453914,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 NISSAN ARMADA.  I AM HAVING A ISSUE WITH THE BRAKE BOOSTER.  THE BRAKES LOCK AND THERE IS A SCREECHING NOISE.  I TOOK THE VEHICLE TO THE NISSAN STORE AND THEY SAID THIS WAS THE PROBLEM.  IT COST $120.00 FOR THEM TO TELL ME IT WOULD TAKE $900 TO FIX IT.  I KNOW THERE IS A RECALL ON THE 2008 NISSAN ARMADA BUT WHEN I CALLED NISSAN THEY TOLD ME MY VIN NUMBER WAS NOT INCLUDED IN THE RECALL.  THIS A MAJOR SAFETY ISSUE FOR MY FAMILY.  WE WERE DRIVING DOWN THE INTERSTATE.    THIS HAS HAPPEN TWICE PRIOR.  ONCE DURING THANKSGIVING HOLIDAYS 2011 AND ANOTHER TIME IN JANUARY.  IF I KILL THE CAR AND RE-START IT, IT SEEMS TO BE OK.  THOSE TWO TIMES WEREN'T MAJOR BUT THIS LAST TIME WE WERE TRAVELING DOWN THE INTERSTATE.    WHEN I TALK TO THE NISSAN REP, SHE TOLD ME MY VIN NUMBER WAS NOT INCLUDED IN THE RECALL AND THE CASE WAS CLOSED.  I AM FURIOUS WITH NISSAN AND THEIR LACK OF CONCERN FOR OUR SAFETY.  THIS IS THE THIRD NISSAN I HAVE OWNED AND IT WILL BE THE LAST.  I HAD HEARD THAT THEIR CUSTOMER SERVICE WAS TERRIBLE AND NOW I UNDERSTAND WHY.    THERE IS A LAWSUIT IN THE WORKS FOR THIS REASON WHICH I AM ABOUT TO JOIN IF SOMETHING ISN'T DONE.  I JUST WANT MY BREAK BOOSTER FIXED AND FOR NISSAN TO TAKE THE RESPONSIBILITY THAT IT IS A MANUFACTURE DEFECT AND THEY ARE RESPONSIBLE.  THAT IS ALL I AM ASKING.  I WANT MY ARMADA TO BE PART OF THE RECALL.  PLEASE, PLEASE HELP ME IF YOU CAN.  *TR",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/08/2012",
        "dateOfIncident": "02/02/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10447132,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA.  THE CONTACT STATED THAT THE LIFT-GATE STRUTS FAILED AND CAUSED THE LIFT-GATE TO STRIKE THE CONTACT ABRUPTLY ON THE HEAD, CAUSING INJURY. THE DEALER REPLACED THE LIFT GATE BUT THE FAILURE RECURRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT DENIED ANY ASSISTANCE WITH REPAIRS TO THE VEHICLE.  THE VEHICLE WAS REPAIRED.  THE FAILURE MILEAGE WAS 18,000 AND THE CURRENT MILEAGE WAS 25,800.",
        "vin": "5N1BA08D28N"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2011",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440353,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN ARMADA VEHICLES WITH A FACTORY TOW PACKAGE INCLUDE SELF-LEVELING REAR SUSPENSION.  THE SYSTEM IS COMPRISED OF AIR-LEVELED SHOCKS AND AN AIR COMPRESSOR.  THE SYSTEM LEAKS, CAUSING THE AIR PRESSURE TO DROP AT SPEED, WITH OR WITHOUT LOADS, AND WHEN PARKED AND TURNED OFF.  IT CAUSES THE REAR END TO BE SOFT AND HANDLE POORLY, WHICH, WHEN TOWING, IS CLEARLY A SAFETY HAZARD.    *TR",
        "vin": "5N1AA08C78N"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 08 ARMADA IS KEEPING ME LOCKED OUT OF THE BACK. THE HATCH DOOR AND THE WINDOW. THE PROBLEM IS FAULTY ACTUATOR. PART INFORMATION IS;  905507S000  0892068-A  B/D ACTR  03 09 26 12V  THE LATCH ON THE ACTUATOR IS NOT OPERATING 100%. THE LITTLE SWING LATCH, COME SHORT BY 15% THAT CAUSE THE LOCK TO OPEN THE GLASS DOOR AND THE MAIN DOOR. *TR",
        "vin": "5N1BA08D48N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2011",
        "dateOfIncident": "03/30/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434635,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 NISSAN ARMADA. CONSUMER WRITES IN REGARDS TO BRAKE PROBLEM *TGW  THE CONSUMER STATED THE SUV FAILED TO STOP PROPERLY. WITHIN FIVE MINUTES OF LEAVING THE DEALERSHIP, AFTER AN OIL CHANGE SERVICE AND A WARRANTY RELATED BRAKE INSPECTION, THE VEHICLE BEGAN TO SHAKE AND VIBRATE EXCESSIVELY WHEN THE BRAKE PEDAL WAS DEPRESSED AND IT WAS VERY DIFFICULT TO STOP.  THE BRAKES GRABBED AND GRIND AND THERE WAS A VERY LOUD CONTINUAL NOISE AS THE BRAKES WERE APPLIED. THE NOISE WAS COMING FROM THE BRAKES. THE CONSUMER IMMEDIATELY EXITED OFF THE HIGHWAY AND PULLED OVER TO THE SHOULDER. THE CONSUMER PHONED THE DEALERSHIP AND WAS TOLD TO RETURN THE VEHICLE.  THE SERVICE TECHNICIAN DROVE THE VEHICLE, BUT WAS UNABLE TO DETECT A PROBLEM. THE CONSUMER WAS INFORMED TO MAKE ANOTHER APPOINTMENT IF HE EXPERIENCED THE PROBLEM AGAIN, AND ABS SOFTWARE WOULD BE REPROGRAMMED. THE SECOND TIME THE INCIDENT HAPPENED, THE BRAKES STARTED TO GRAB AND GRIND WHEN THE BRAKE PEDAL WAS APPLIED TO SLOW THE VEHICLE DOWN. THE BRAKE LIGHT ILLUMINATED AND THE CONSUMER PULLED OVER AND TURNED THE IGNITION OFF. HE WAITED A COUPLE OF MINUTES BEFORE RESTARTING THE VEHICLE. THE BRAKE LIGHT WENT OFF AND THE BRAKES RETURNED TO PROPER WORKING CONDITION. ANOTHER APPOINTMENT WAS MADE WHERE THE DEALER REPROGRAMMED THE ECM. THE CONSUMER EXPERIENCED THE FAILURE FOR THE FOURTH TIME AND WAS INFORMED THE VEHICLE MAY NEED A BRAKE BOOSTER AND FRONT ROTORS, BECAUSE THEY WERE STARTING TO WARP. *JB",
        "vin": "5N1AA08D68N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/04/2011",
        "dateOfIncident": "11/02/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434272,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT CAME ON AT 35MPH, SEEMS ABS ENGAGED. GRINDING, SHUTTERING, DECREASED BRAKE POWER. TURNED VEHICLE OFF/ON AND BRAKES WERE GOOD. HAPPENED AGAIN WHILE VEHICLE WAS STOPPED AND AGAIN AT 50 MPH. BRAKE BOOSTER BAD.  *TR",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "08/30/2011",
        "dateOfIncident": "08/29/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422579,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK MY BRAKE LIGHT APPEAR ON MY DASH BOARD. I APPROACHED A RED LIGHT WHEN MY I FOUND IT VERY DIFFICULT TO APPLY THE BRAKE. I HEARD A LOUD NOISE AND GRINDING COMING FROM THE FRONT END OF MY 2008 ARMADA. MY SUV STOPPED WITH IN INCHES OF REAR ENDING A CAR VERY SCARY. I PULLED MY TRUCK INTO A PARKING LOT, TURNED IT OFF AND THEN BACK ON AGAIN. THIS SEEMED TO RESET THE LIGHT. I CALLED THE DEALERSHIP TO SEE IF THIS WAS A KNOW PROBLEM AND THEY SAID IT WAS I NEED TO HAVE MY BRAKE BOOSTER REPLACED AT A COST OF 820.00 PLUS TAX. THIS WOULD BE AN OUT OF COST EXPENSE BECAUSE MY TRUCK IS OUT OF WARRANTY. IF THIS IS A KNOW PROBLEM WHY WON'T NISSAN RECALL THIS PART BEFORE SOMEONE GETS KILLED.  *TR",
        "vin": "5N1BA08D98N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/05/2011",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, THE BRAKE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND A GRINDING NOISE WAS HEARD COMING FROM THE BRAKES. THE BRAKE PEDAL WAS THEN DEPRESSED AS THE CONTACT ATTEMPTED TO MAKE A LEFT TURN, BUT THE VEHICLE WOULD NOT STOP AND THE PEDAL DEPRESSED TO THE FLOOR. THE CONTACT APPLIED THE EMERGENCY BRAKE IN ORDER TO STOP THE VEHICLE. AFTER TURNING THE ENGINE OFF AND RESTARTING, THE BRAKES FUNCTIONED AS NORMAL. THE FAILURE OCCURRED ON TWO DIFFERENT OCCASIONS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTICS, WHERE THE TECHNICIAN STATED THAT THE ANTI-LOCK BRAKE SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416246,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS WITH THE LOAD LEVYING SYSTEM ON THE NISSAN ARMADA. I OWN A 2008 ARMADA AND THE REAR SHOCKS WERE REPLACED SHORTLY AFTER THE PURCHASE BECAUSE OF THE LOSE OF AIR. THE AIR LINES HAVE BEEN REPLACED ON 2 DIFFERENT OCCASIONS AT DIFFERENT DEALERS BECAUSE OF LEAKS. IN JAN. OF 2011 ANOTHER AIR LINE WAS REPLACED AND 2 WEEKS LATER I BLEW AN AIR SHOCK 750 MILES FROM HOME. ONCE AGAIN ANOTHER SHOCK WAS REPLACED AND NOW I HAVE THE SAME PROBLEM, THE SYSTEM WILL NOT HOLD AIR AND IS EXTREMELY DANGEROUS WHEN TOWING. PLEASE NOTE THE MILEAGE, MPH AND DATE ARE FOR THE NEXT TO LAST FAILURE. THE LATEST FAILURE HAPPENS ALL THE TIME.  ALSO NOTE THIS IS A COMPANY OWNED UNIT.  *TR",
        "vin": "5N1BA08C18N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/13/2011",
        "dateOfIncident": "07/09/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412112,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE THE VEHICLE WAS PARKED THE CONTACT STATED THE REAR DRIVERS SIDE WINDOW SPONTANEOUSLY SHATTERED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO A DEALER TO BE REPAIRED. THE CONTACT WAS ADVISED THAT HE WOULD BE RESPONSIBLE FOR THE REPAIR COST. THE VEHICLE WAS NOT TAKEN TO THE DEALER BUT THE REPAIR PART WAS ORDERED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.",
        "vin": "5N1BA08D68N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396942,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC",
                "productYear": "9999",
                "size": "P265/70R18",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA EQUIPPED WITH CONTINENTAL CONTI TRAC AS TIRES, TIRE SIZE 265/70/18 (N/A). WHILE THE CONTACT WAS DRIVING APPROXIMATELY 50 MPH, THE VEHICLE BEGAN TO VIBRATE EXCESSIVELY WHICH RESULTED TO POOR ROAD PERFORMANCE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT TIRE CENTER WHERE THEY DETECTED THAT ALL FOUR TIRES EXHIBITED SUBSTANTIAL TREAD SEPARATION. THE FOUR TIRES WERE REPLACED AT THE OWNER'S EXPENSE. THE FAILURE MILEAGE WAS 20,000.  THE DOT NUMBER WAS UNKNOWN.",
        "vin": "5N1BA08D98N"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "06/11/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379749,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING OFF THE INTERSTATE AT RATES OF SPEED VARYING FROM 20 MPH - 45 MPH THE ABS AND VDC LIGHTS COME ON AND YOU HEAR A CRUNCHING AND GRINDING NOISE IN THE FRONT END OF THE CAR. THE BRAKES SEEMS TO SHUDDER AND YOU FEEL IT DIFFICULT TO BRAKE. THIS HAS ALWAYS BEEN ON DRY ROADS. NISSAN HAS BEEN WORKING ON MY VEHICLE FOR MORE THAN 6 MONTHS AND STILL NO RESOLUTION. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371136,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO LEVELING SUSPENSION FAILS/LEAKS. AFTER EVERYTIME THE VEHICLE IS SHUTDOWN THE REAR SUSPENSION SYSTEM LEAKS CAUSING THE BACK END TO RIDE LOWER. AFTER VEHICLE START UP THE COMPRESSOR COMES ON AND RAISES THE BACK END TO LEVEL. AFTER THE COMPRESSOR SHUTS OFF THE BACK END DROPS AGAIN. DURING TOWING IS WHEN THE REAL SAFETY ISSUE HAPPENS. THE BACK END RIDES VERY LOW AND THE COMPRESSOR IS NOT ABLE TO KEEP AHEAD OF THE LEAK, CAUSING THE BACK END TO CONTINUE TO RIDE DANGEROUSLY LOW. THIS CAUSES THE BACK END TO BE VERY UNSTABLE DURING TOWING AND COULD CAUSE AN ACCIDENT. *TR",
        "vin": "5N1AA08C08N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/19/2010",
        "dateOfIncident": "10/24/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 NISSAN ARMADA. THE CONTACT STATED THAT THE VEHICLE'S HEATING SYSTEM DOES NOT WORK. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THEY OFFERED NO ASSISTANCE.  THE MANUFACTURER WAS CONTACTED, BUT THEY ALSO DID NOT OFFER ANY ASSISTANCE.  THE VEHICLE HAD NOT BEEN REPAIRED.  THE CURRENT MILEAGE WAS 46,800.  THE FAILURE MILEAGE WAS 46,000.",
        "vin": "5N1AA08CX8N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE CAME DISCONNECTED FROM 2008 NISSAN ARMADA 3 WEEKS AFTER DEALER COMPLETED FUEL GAUGE RECALL REPAIR ON THIS VEHICLE.  GASOLINE WAS LEAKING ALL OVER THE GROUND CAUSING A VERY DANGEROUS AND POSSIBLY FATAL SITUATION IF THE GASOLINE HAD BEEN IGNITED. *TR",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346111,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE THE VEHICLE WAS  PARKED, THE CONTACT NOTICED THE REAR AUTOMATIC LIFT GATE RELEASED WITHOUT ASSISTANCE. THE IDENTICAL FAILURE WOULD OCCUR WHEN THE  VEHICLE WAS IN MOTION. THE FAILURE OCCURRENCES WERE INTERMITTENT. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON NINE DIFFERENT TIMES FOR THE LIFT GATE FAILURE. THE TECHNICIAN REPLACED THE LIFT GATE LATCH AND COMPUTER SYSTEM WIRING. THE FAILURE CONTINUED AFTER THE REPAIRS. THE FAILURE MILEAGE WAS 40. THE CONTACT NO LONGER OWNS THE VEHICLE DUE TO THE SAFETY HAZARD.  UPDATED 09/28/10 *BF  UPDATED 10/01/10*JB",
        "vin": "5N1BA08D58N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/20/2010",
        "dateOfIncident": "05/19/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331346,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE TRAVELING AT SPEEDS OF 15 MPH, THE BRAKES DID NOT ENGAGE WHILE APPLYING THE BRAKE PEDAL. THE VEHICLE WAS NOT DIAGNOSED AND THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": "5N1BA08C38N"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327578,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 NISSAN ARMADA. WHILE DRIVING 35 MPH, THE VEHICLE SHUT OFF DUE TO A LACK OF GASOLINE ALTHOUGH THE FUEL GAUGE DISPLAYED THAT THERE WAS FUEL IN THE VEHICLE. THE CONTACT ALSO STATED THAT THE FUEL TRIP METER DISPLAYED THAT THE CONTACT COULD DRIVE APPROXIMATELY 100 MILES BEFORE THE FUEL TANK WAS EMPTY.   THE VEHICLE WAS TOWED TO THE CONTACTS RESIDENCE. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY KNEW NOTHING ABOUT THE FAILURE WITH THE FUEL GAUGE ON 2008 NISSAN ARMADA'S. ONE WEEK LATER, THE CONTACT RECEIVED A RECALL NOTICE (10V074000 FUEL SYSTEM, OTHER: STORAGE: FUEL GAUGE SYSTEM) FOR THE FAILURE BUT WAS UNABLE TO GET THE VEHICLE REPAIRED BECAUSE THE PARTS WERE ON BACK ORDER. THE FAILURE MILEAGE WAS APPROXIMATELY 54,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "5N1AA08D38N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "11/12/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317107,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN ARMADA.  THE CONTACT STATED THE KEYLESS ENTRY MALFUNCTIONS CAUSING THE VEHICLE TO LOSE POWER.  THE DEALER REPLACED THE BATTERY IN THE KEYLESS ENTRY REMOTE BUT THAT DID NOT REMEDY THE ISSUE.  THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER AND THE DEALER CAN NOT FIND WHAT IS CAUSING THE VEHICLE TO LOSE POWER.  THE CONTACT STATED THE VEHICLE IS UNSAFE AND COULD LEAVE HIM STRANDED IN THE COLD.  THE FAILURE MILEAGE WAS 40,000.",
        "vin": "5N1BA08D88N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "12/27/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306610,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THE EVENTS LEADING UP TO THE FAILURE:  - I WAS ON A HIGHWAY OVERPASS BRIDGE, BRAKING AS I APPROACHED THE RED STOPLIGHT & PREPARING TO ENTER THE HIGHWAY ON-RAMP. AS I WAS BRAKING, I FELT A LOST OF BRAKE CONTROL, SLIPPING MOMENTARILY FOR 1 SECOND. AT FIRST I BRUSHED OFF THE SENSATION AS DUE TO BRIDGE VIBRATION, POSSIBLY DUE TO MINOR EARTHQUAKE OR VEHICLES/TRUCKS PASSING THROUGH THE BRIDGE.  - ABOUT 3 WEEKS AFTER THE 1ST EVENT, I WAS APPROACHING AN INTERSECTION AND THE TRAFFIC LIGHT WAS RED AND APPLYING LIGHT & CONSTANT PRESSURE, I LOST CONTROL OF THE BRAKE AGAIN FOR LIKE 1S BEFORE REGAINING CONTROL. MY CAR WAS WITHIN INCHES OF HITTING THE CAR IN FRONT OF ME.  - ABOUT 3 DAYS AFTER THE 2ND EVENT, I WAS APPROACHING A RED INTERSECTION, BUT THIS TIME MY CAR IS AHEAD OF EVERYONE. AS I WAS APPLYING THE BRAKE, I AGAIN LOST CONTROL OF THE BRAKE FOR ABOUT A SECOND BEFORE REGAINING CONTROL. MY CAR ENDED UP IN THE MIDDLE OF THE INTERSECTION & OTHER ANGRY DRIVERS ENDED UP HONKING AT ME.    2.THE FAILURE, HOW OFTEN IT OCCURS, ITS CONSEQUENCES:  A MOMENTARY SENSATION OF LOSING BRAKE CONTROL, AS IF I AM DRIVING & SLIPPING ON ICE. ALL 3 EVENTS HAPPENED UNDER 30-40 MPH, WITH LIGHT BUT CONSTANT BRAKING APPLIED. IT IS LIKE THERE IS SOMETHING TRIGGERING/NOT TRIGGERING THE ABS. THE ROAD CONDITION IN ALL 3 EVENTS IS PAVED SMOOTHLY, DRY, NOT RAINING. IT HAPPENED ABOUT 3 OBVIOUS TIMES IN THE PAST 2 MONTHS. AS A RESULT, I HAVE TO GIVE MYSELF MORE DISTANCE WHEN BRAKING AT LOW SPEED. IN ALL 3 EVENTS, THERE WERE 2 OTHER ADULTS IN THE CAR AS WITNESS. I STILL FEEL IT OTHER TIMES, BUT I GAVE MYSELF MORE DISTANCE TO ANTICIPATE THE SENSATION.    3.WHAT WAS DONE TO CORRECT THE FAILURE.  AFTER EVENT 2 & 3, I BROUGHT THE CAR TO THE DEALERSHIP FOR INSPECTION BUT THEY SAID THEY COULDN'T FIND ANYTHING WRONG, NOTHING WAS REPLACED AND ASKED ME TO BRING IT BACK NEXT TIME IT HAPPENED. I TOLD THEM THAT NEXT TIME SOMEONE MIGHT GET KILLED OR I MIGHT BE DEAD AND NOT COMING BACK.    2008 NISSAN ARMADA SE 4X4. *TR",
        "vin": "5N1AA08C78N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2010",
        "dateOfIncident": "01/19/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300277,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NEED TO REPLACE A BATTERY IN A 2008 NISSAN ARMADA. WHY WOULD A MANUFACTURER INSTALL A BATTERY THAT LAST ONLY 1-2 YEARS IN A BRAND NEW VEHICLE? WHY DOES THE WARRANTY NOT INCLUDE VEHICLES WITH MORE THAN 36K MILES BUT LESS THAN 2 YEARS IN THE VEHICLE? *TR",
        "vin": "5N1BA08D78N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/13/2010",
        "dateOfIncident": "12/24/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299583,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2008 NISSAN ARMADA (LE). WE BOUGHT THIS BRAND NEW IN NOV. 2008 FROM NISSAN DEALER IN ILLINOIS.WE HAVE HAD A REAL BAD PROBLEM WITH THE CAR NOT DEFROSTING THE WINDOWS AND WHEN YOU HAVE MORE THAN THREE PEOPLE IN CAR WHEN DRIVING IT IS NOT SAFE TO DRIVE. THIS SUV HAS BEEN IN AND OUT OF DEALERS AND THEY CAN'T SEEM TO FIND THE PROBLEM. THIS IS NOT SAFE TO DRIVE DURING THE WINTER MONTHS, THIS HAS BEEN GOING ON FROM THE FIRST COLD WEATHER DAY FROM WHEN WE BOUGHT IT. I FEEL THIS IS A LIFE SAFETY ISSUE THAT NEEDS TO BE LOOKED INTO. *TR",
        "vin": "5N1BA08CX8N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2008",
        "dateOfIncident": "09/03/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241031,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 NISSAN ARMADA.  THE CONTACT RECEIVED A RECALL NOTICE FOR HER AIR CONDITIONER CONDENSER FAN MOTOR.  SHE TOOK THE VEHICLE TO THE DEALER TO HAVE THE WORK REPAIRED.  THE DEALER SERVICED THE VEHICLE AND STATED THAT THE AIR CONDITIONER CONDENSER FAN MOTOR FAILED.  THE DEALER INSTALLED A NEW ONE, BUT IT WAS STILL NOT WORKING.  THEY KEPT THE VEHICLE OVERNIGHT IN AN ATTEMPT TO TRY TO FIGURE OUT WHY THE NEW FAN MOTOR WAS NOT WORKING.  THE FOLLOWING DAY, THE CONTACT RECEIVED A CALL FROM THE DEALER AND WAS INFORMED THAT THEY COULD NOT REPAIR THE VEHICLE BECAUSE A WIRING HARNESS HAD BEEN REPLACED.  IN ADDITION, AN AFTERMARKET WIRE HAD BEEN INSTALLED AND CAUSED THE FAN MOTOR TO FAIL.  SINCE THE WIRES HAD BEEN TAMPERED WITH, IT VOIDED THE RECALL.  THE DEALER IS NOW REFUSING TO REPAIR THE VEHICLE FOR FREE.  SHE IS THE ORIGINAL OWNER OF THE VEHICLE AND STATED THAT NO WIRES SHOULD HAVE BEEN TAMPERED WITH AND NO INSTALLATIONS MADE.  THE VEHICLE WAS TAKEN TO THE SAME DEALER FOR REPAIRS; THEREFORE, IF ANY WIRES HAD BEEN CHANGED, IT HAD TO BE DONE BY THAT SPECIFIC DEALER.  THE CONTACT FEELS THAT THE VEHICLE SHOULD STILL BE REPAIRED UNDER RECALL.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 38,409.",
        "vin": "5N1AA08B66N"
    }
]