[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274201,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "PETERBILT",
                "productModel": "386",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PETERBILT 386 TRACTOR.  THE CONTACT STATED THAT THE REGENERATION CYCLE RELATED TO THE DIESEL ENGINE (USED TO BURN SOOT FROM THE EXHAUST) WOULD NOT FUNCTION PROPERLY.  AS A RESULT, THE ENGINE WOULD SHUT OFF.  PRIOR TO THE FAILURE, THE ENGINE WARNING LIGHT WOULD ILLUMINATE ON THE INSTRUMENT PANEL.  THE FAILURE OCCURRED EVERYTIME THE VEHICLE WAS OPERATED.  THE CONTACT TOOK THE VEHICLE TO THE DEALER NUMEROUS TIMES, BUT NONE OF THE REMEDIES WERE SUFFICIENT.  THE VEHICLE WAS ALSO REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 08V487000; HOWEVER, THE FAILURE CONTINUED.  THE MANUFACTURER COULD NOT ASSIST.  THE CURRENT MILEAGE WAS 100,680 AND FAILURE MILEAGE WAS APPROXIMATELY 15,000.",
        "vin": "1XPHDB9X78N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2008",
        "dateOfIncident": "05/02/2008",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228784,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "PETERBILT",
                "productModel": "386",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PETERBILT 386 ROAD TRACTOR WITH A CUMMINS ISX 550 HP ENGINE. PURCHASED 9-10-07. ELECTRICAL ISSUES. THE DOOR LOCKS WERE BLOWING FUSES, THE GPS AND RADIO WOULD GO OFF AND ON, THE POWER WINDOWS AND WINDSHIELD WIPERS STOPPED WORKING, THE DASH LIGHTS AND BUZZERS WOULD FLASH AND ALARM WHEN ON ROUGH ROADS, THE LOW COOLANT LIGHT STAYING ON. SOME SENSORS;FUSES REPLACED. IN JANUARY HAVING OIL PRESSURE ISSUES. PRESSURE WOULD DROP TO 0 AND TRUCK WOULD SHUT OFF.   TOLD THIS A CLOGGED OIL FILTER. CHANGED THE FILTER. CONTINUED TO HAVE THE PROBLEM. IN FEBRUARY WE TOOK THE IT IN FOR THIS, AND THE ELECTRICAL; THEY COULD FOUND NOTHING. WE PICKED IT UP, DROVE ABOUT 3 MILES AND THE OIL PRESSURE BEGAN TO FLUCTUATE. TOOK IT BACK, IT WAS KEPT SEVERAL DAYS AND THEY STILL FOUND NOTHING. THEN THE FUEL WAS NOT EQUALIZING BETWEEN TANKS AND THE TRUCK WOULD RUN OUT OF FUEL. WE BROUGHT IT IN ON 4-23-08. WE NOTED THE OIL PRESSURE, THE ELECTRICAL AND THE FUEL NOT EQUALIZING. AFTER 2 DAYS, AGAIN NOTHING WAS FOUND. PICKED IT UP ON 4-25-08, PICKED UP A LOCAL LOAD TO DELIVER ON THE 28TH.  5:30PM THE TRUCK BROKE DOWN. IT WAS TOWED TO THE SHOP. THE MECHANIC SAID IT WAS AN ELECTRICAL ISSUE WITH THE OIL PRESSURE SYSTEM. THE NEXT MORNING A MECHANICAL GAUGE WAS PUT ON THE TRUCK AND SHOWED NO OIL PRESSURE. A GEAR HAD SHEARED OFF THE OIL PUMP. IT WAS REPLACED. WE PICK UP THE TRUCK ON 5-2-08, WOULD NOT START AND HAD TO BE JUMP STARTED. DROVE APPROXIMATELY 30 MILES THE ENGINE THREW A ROD THROUGH THE SIDE. IT IS STILL IN THE SHOP. CUMMINS OPTED TO REBUILD THE ENGINE RATHER THAN REPLACE IT. THE TRUCK IS EQUIPPED WITH A SLEEPER WHICH WE ARE AFRAID TO USE BECAUSE OF THE WIRING.  WE HAVE BEEN TOLD THAT OUR TRUCK IS NOT THE ONLY ONE WITH OIL PUMP FAILURES. THEREFORE WE WOULD LIKE TO REQUEST A FULL INVESTIGATION INTO THIS MATTER.  *TR",
        "vin": "1XPHD49X88D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218735,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "PETERBILT",
                "productModel": "386",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL PARTICULATE FILTER LEAKS VANADIUM PENTOXIDE FUMES AND/OR LIQUID RESIDUE.  PETERBUILT AND CUMMINS ARE FIGHTING OVER WHO IS RESPONSIBLE.  PETERBILT SAYS THERE IS NO SOLUTION TO THIS PROBLEMS NOW, ALTHOUGH THEY CLAIM A TEAM OF ENGINEERS IS WORKING ON IT.  IT CONCERNS ME THAT THEY SEE NO PROBLEM WITH ALLOWING A CANCEROUS SUBSTANCE TO COME IN CONTACT WITH UNSUSPECTING PEOPLE, MYSELF INCLUDED.  *TR",
        "vin": "1XPHD49XX8D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/06/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217082,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "PETERBILT",
                "productModel": "386",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL PARTICULATE FILTER LEAKS VANADIUM PENTOXIDE FUMES AND/OR LIQUID RESIDUE. PETERBILT AND CUMMINS ARE FIGHTING OVER WHO IS RESPONSIBLE. PETERBILT SAYS THERE IS NO SOLUTION TO THIS PROBLEM NOW, ALTHOUGH THEY CLAIM A TEAM OF ENGINEERS IS WORKING ON IT. IT CONCERNS ME THAT THEY SEE NO PROBLEM WITH ALLOWING A CANCEROUS SUBSTANCE TO COME IN CONTACT WITH UNSUSPECTING PEOPLE, MYSELF INCLUDED.  *TR",
        "vin": "1XPHD49XX8D"
    }
]