[
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444535,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Nissan Xterra. The contact stated while driving 30 MPH and making a right turn, she heard an abnormal sound while depressing on the brake pedal. The contact stated that the Anti-Lock Braking System (ABS) & the Vehicle Dynamic Control (VDC) warning lights were illuminated. The contact took the vehicle to the local dealer however, the mechanic was unable to duplicate the failure. The vehicle was not repaired but was pending repairs. A dealer was not contacted. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 07E105000 (Service Brakes, Air) however, the VIN was not included. The manufacturer had not been informed of the failure. The failure mileage was approximately 140,000.",
        "vin": "5N1AN08U38C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436359,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The brake master cylinder failed multiple times, leaving the system in bypass mode. The resulting delay in braking led to potential collision on multiple occasions.",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426321,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Total transmission and radiator failure. a dealership \"fixed\" the coolant contamination problem when nissan offered the warrantied coverage for what's known as SMOD. all the dealership did was flush the transmission and radiator. they did not repair or replace any components even after being berated by my husband to do so and to do it under the covered warranty.($5k for tranny replacement that we couldn't afford) they claimed the flush had fixed the xterra. less than 3,000 miles later I was driving on the highway with my 2 children in the car and the vehicle just shut off. no warning lights or behaviors just shut off at 70+mph on the highway. while sitting broke down [pulled off highway edge as far as I could after vehicle died and before it coasted to a complete stop] we were then rear-ended and my 2 kids spent 2 days being monitored in a children's hospital. 1 of which had a concussion.  although the xterra only needed a new rear hatch and bumper and etc insurance didn't consider it totalled so it was cosmetically repaired. after reaching out to nissan about the incident they refused to even offer us any sort of discounted repair costs on tranny replacement[car was still under extended coverage warranty] nor would they offer any kind of anything regarding a discount on a replacement vehicle. so here we were still paying on a car loan for a car that was still under warranty, but could not be drove. or even starred for that matter. it ended up wrecking us financially. the car never showed any signs of any mechanical problems prior to dealer flushing trans. the car didn't show any signs of anything afterwards until that day on the highway. the problem ended up being metal pieces from coolant contamination shorted out something in transmission and I guess shorted so strong that it blew the trans fuse and blew fuse links on positive terminal which caused car to just shut off. nissan needs to take responsibility for their bullcrap.",
        "vin": "5N1AN08WX8C"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR HAS TAKEN IN FLUIDS FROM THE TRANSMISSION OR? THE RADIATOR FLUID APPEARS MILKY AND LOTION LIKE CONSISTENCY FROM THE RADIATOR AND OVERFLOW TANK  IT HAS BEEN SHIFTING VERY LOUD AND HARD..",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267822,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 08 XTERRA AND WHEN I WAS DRIVING IT ONE DAY IT FELT LIKE IT WAS HAVING A HARD TIME GETTING UP HILLS AND ALMOST FELT LIKE IT WOULDNT DOWNSHIFT.  THEN FINALLY WHEN AT A LIGHT HAD TO REALLY GAS IT TO GET THE CAR GOING. LIMPED THE CAR TO A FAMILY MEMBERS HOUSE TO LET IT SIT UNTIL I FIGURED OUT WHAT WAS WRONG WITH IT.  AFTER RESEARCH FIGURED THE CAR PUT ITSELF INTO LIMP MODE SO I DISCONNECTED THE BATTERY TO DO A FULL RESET ON THE COMPUTER. WAS ABLE TO GET IT HOME  25 MILES AFTER RESET. WE HAVE A SPARE/COMMUTER CAR SO I WAS ABLE TO LET IT SIT IN MY GARAGE FOR A FEW MONTHS WHILE I TRIED TO FIGURE OUT WHAT WAS WRONG WITH IT WHEN I HAD TIME. FINALLY AFTER NARROWING IT DOWN TO THINGS THAT I HAD NEVER DONE BEFORE, I DECIDED TO TAKE IT TO NISSAN. THEY TOLD ME THE NEXT DAY THAT IT WAS THE RADIATOR FAILURE AND PROCEEDED TO QUOTE ME $7000 FOR THE REPAIRS........OUCH ON A CAR THAT WAS NOW 11 YEARS OLD WHICH I HAD PURCHASED FROM THAT DEALERSHIP BRAND NEW.  I DECIDED TO TAKE IT HOME BECAUSE IT WAS A BIG DECISION TO MAKE RIGHT AWAY.  SO HERE I AM WITH A CAR THAT MISSED THE LAWSUIT AS I HAVE AN XTERRA THAT IS 11 YEARS OLD [!@#$%] NEAR 200000 MILES. I DID MY OWN MAINTENANCE, WHEN REPLACING MY HEAD GASKET I NOTICED I HAD THE NO CARBON BUILD UP ON THE HEAD, BASICALLY LOOKED LIKE A CAR THAT HAD 20000 MILES ON IT.  SHAME ON NISSAN FOR NOT DOING A RECALL OR NOTIFYING OWNERS OF THIS ISSUE.  I LOVE MY XTERRA BUT I'M SURE THE COST OF THE FIX IS ROUGHLY WHAT THE CAR IS WORTH.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243511,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. WHILE OPERATING THE VEHICLE, THE FUEL GAUGE DISPLAYED FALSE READINGS. THE GAUGE SHOWED THAT THE FUEL TANK HAD LESS FUEL THAN WHAT WAS ACTUALLY PRESENT. ALSO, ON SEVERAL OCCASIONS, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHEN IT WAS DEPRESSED AND THE VEHICLE DID NOT IMMEDIATELY STOP. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT NO FAILURES WERE FOUND. LATER, WHILE DRIVING, THE VEHICLE STALLED AFTER DEPRESSING THE BRAKE PEDAL. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 73,000.",
        "vin": "5N1AN08U68C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233020,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAKING INTO TRANSMISSION CAUSING THE TRANSMISSION TO FAIL",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231088,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. WHILE DRIVING 50 MPH, THE VEHICLE DECELERATED. THE CONTACT COASTED THE VEHICLE TO THE SHOULDER AND HAD THE VEHICLE TOWED TO HIS HOME. IN ADDITION, THE CHECK ENGINE AND 4WD WARNING INDICATORS ILLUMINATED. AN INDEPENDENT MECHANIC CAME TO THE CONTACT'S HOME AND DIAGNOSED THAT THE VEHICLE NEEDED A NEW TRANSMISSION AND RADIATOR. THE CONTACT INSTALLED THE RADIATOR. THE TRANSMISSION WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 133,316.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229702,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT IS BLINKING. I'VE RESET THE ALERT AND THEN AFTER DRIVING FOR A FEW MINUTES, IT RETURNED. DEALERSHIP WAS UNSURE IF THERE WAS A RECALL OR IF NISSAN WOULD REPLACE THE AIRBAGS. I FOUND THIS SITE AS I WAS LOOKING FOR INFORMATION. THE AIRBAG LIGHT BLINKS WHEN THE VEHICLE IS IN PARK OR IS RUNNING.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208462,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNS OFF. BLINKS. DOESN'T TURN ON UNLESS CAR IS RESTARTED.",
        "vin": "5N1AN08W08C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206257,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE SURGES AND SPUTTERS AND RPMS SKYROCKET AND THE VEHICLE LOSES POWER AND SHUTS DOWN. THIS HAPPENS AT VARIOUS SPEEDS ON INTERSTATE HIGHWAY, TOWN STREETS AND COUNTY ROADS. THE VEHICLE WILL ALSO LOSE POWER AND SHUT DOWN WHILE IDLING AT A STOP SIGN OR TRAFFIC LIGHT. THERE IS NO WAY TO STEER OR RESTART WHEN THIS HAPPENS AND I HAVE DEPENDED ON HAZARD FLASHERS TO WARN OTHER DRIVERS OF DISABLED VEHICLE UNTIL I CAN GET ASSISTANCE TO GET VEHICLE OFF OF HIGHWAY. AFTER 20 MINUTES OF BEING DEAD, VEHICLE WILL SOMETIMES RESTART AND GO A FEW MORE MILES BEFORE SAME THING HAPPENS AGAIN. AFTER 3 WEEKS AT A DEALERSHIP AND A COST SO FAR OF $3,000, THE PROBLEM HAS NOT BEEN PINPOINTED AND FIXED. DEALERSHIP HAS CONTACTED NISSAN CUSTOMER SERVICE WHO HAS TWO OPEN CASES OF THE SAME ISSUE WITH THE SAME MODEL VEHICLE. I HAVE FOUND NUMEROUS OTHER COMPLAINTS IN ONLINE FORUMS OF THE SAME ISSUE SAME MODEL AND STILL NO FIX FOUND FOR THE ISSUE. I HAVE NOW OPENED MY OWN CASE WITH NISSAN NORTH AMERICA CUSTOMER CARE AND AM AWAITING FURTHER INVESTIGATION FROM THEM. MAJOR SAFETY HAZARD.",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203214,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE KEEPS STALLING AND RUNNING ROUGH WHILE DRIVING AFTER NUMEROUS REPAIRS AND SEVERAL TRIPS TO THE DEALERSHIPS THE PROBLEM CONTINUES TO PERSISTENT. THE MECHANICS SEEM NOT TO UNDERSTAND THE NATURE OF THE ISSUE ANY ASSISTANCE WOULD BE APPRECIATED",
        "vin": "5N1AN08U28C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION (HIGHWAY DRIVING). I BEGAN TO HEAR A WHINNING SOUND AT ANY RATE OF SPEED.THE SOUND NEVER WENT AWAY. IT BECAME LOUDER DURING ACCELERATION. I CHECKED ANY RECALLS ON THE XTERRA MODELS AND FOUND OUT THAT IT HAS A FAULTY TIMMING CHAIN ISSUE. I HAD THE VEHICLE SERVICED AND INDEED, THE PROBLEM WAS THE TIMING CHAIN.",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187083,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT FLASHES-DEALER SAID NEEDS NEW AIRBAG MODULE",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184807,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  PASSENGER FRONT SEAT SENSOR FAILED SINCE ONE YEAR OLD  DISABLING AIRBAG, FLASHING DASH LIGHT AT ALL TIMES",
        "vin": "5N1ANO8W88C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "03/12/2014",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175076,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. WHILE DRIVING 70 MPH, THE VEHICLE BEGAN TO LOSE POWER AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD WHERE IT BEGAN TO SMOKE UNDER THE HOOD. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE HEAD GASKET FAILED AND THE ENGINE NEEDED TO BE REPLACED. THE CONTACT CALLED ROYAL NISSAN AT (225) 924-0400 (LOCATED AT 9325 AIRLINE HWY, BATON ROUGE, LA 70815) AND WAS INFORMED THAT THE VEHICLE WAS OUT OF WARRANTY. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 34416631. THE APPROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": "5N1AN08U18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162517,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE FAILURE OF TRANSMISSION DURING RUSH HOUR.  VEHICLE NEEDS A NEW TRANSMISSION AND RADIATOR AT A COST OF $5,500.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162518,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE FAILURE OF TRANSMISSION DURING RUSH HOUR.  VEHICLE NEEDS A NEW TRANSMISSION AND RADIATOR AT A COST OF $5,500.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109630,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STOPPED ON A HIGHWAY.  THE TRANSMISSION/RADIATOR FAILED ON 5/25/2018.  THE CAR HAS 130,000 MILES ON IT.  THE FAILURE WAS SUDDEN AND THERE WERE NO WARNING SIGNS OF A PROBLEM.",
        "vin": "5N1AN08U28C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099985,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN NOISE UPON STARTING ENGINE  GETTING VIBRATIONS AND NOISE--SIMILAR TO SPEED BUMPS ON ROADWAY-- IN VEHICLE DRIVE TRAIN AROUND 40 TO 50 MPH (TRANSMISSION?)",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081405,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN 45,000 MILES ON THE VEHICLE, NO ENGINE LIGHTS WERE ON AND NO OTHER ISSUES PRIOR TO THE INCIDENT. TRAVELING ON I75 AT ABOUT 65MPH WHEN THE VEHICLE SUDDENLY AND RAPIDLY SLOWS DOWN AND ALMOST CAUSED AN ACCIDENT. GOT TO THE SIDE OF THE ROAD AND TRIED TO ACCELERATE, THE VEHICLE WOULD ONLY GO ABOUT 25-30MPH SO I HAD IT TOWED HOME. I LATER HAD IT TOWED TO THE DEALER AND PAID FOR A DIAGNOSIS, THE SERVICE TECH SAID AN AFTERMARKET MASS AIRFLOW SENSOR CAUSED THE ALL THE CATALYTIC CONVERTERS TO GO BAD AND THEY WANTED $3,500 TO REPLACE THE CATALYTIC CONVERTERS AND EXHAUST MANIFOLDS BEFORE THEY WOULD CONTINUE DIAGNOSING THE VEHICLE. I CALLED MY SAE CERTIFIED MECHANIC AND HAD IT TOWED TO HIM. HE SAID THE MASS AIRFLOW SENSOR WAS THE FACTORY SENSOR THAT CAME ON THE CAR, AND SHOULDN'T HAVE CAUSED A FAILURE IN THE CATALYTIC CONVERTERS ESPECIALLY WITHOUT A CHECK ENGINE LIGHT. HE SAID THAT NISSAN HAS HAD PROBLEMS WITH CATALYTIC CONVERTERS GOING BAD AND CAUSING ENGINE FAILURE, SO UPON FURTHER INSPECTION THE ENGINE HAS DAMAGE TO THE CYLINDERS AND VALVES AND WILL NEED REPLACED OR AT LEAST OVERHAULED. I DON'T BELIEVE I SHOULD HAVE TO PAY FOR AN ENGINE AND CATALYTIC CONVERTERS THAT COULD HAVE BEEN REPLACED WITH A RECALL AND PREVENTED THE ENTIRE ISSUE. NISSAN HAS AN INTERNAL BULLETIN ABOUT THE CATALYTIC CONVERTER FAILURES AND ENGINE DAMAGE PROVING THEY HAD PRIOR KNOWLEDGE OF THE ISSUES INCLUDING ISSUES WITH THE TIMING CHAINS THAT FAIL WHICH IS ANOTHER ISSUE WITH THIS ENGINE THAT I HAVEN'T COME ACROSS YET.",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075312,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT RECEIVED AN UNKNOWN MANUFACTURER RECALL NOTIFICATION. THE VEHICLE WAS TAKEN TO BILL ROBERTSON NISSAN (928 N 28TH AVE, PASCO, WA 99301, (509) 545-3000) WHERE THE CONTACT WAS PROVIDED A RENTAL. THE CONTACT THEN RECEIVED A CALL FROM THE DEALER STATING THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR AND HE NEEDED TO RETURN THE RENTAL. TWO WEEKS LATER, WHILE DRIVING, THE TRANSMISSION FAILED AND THE RADIATOR OVERHEATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION AND RADIATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER STATED THAT THE VEHICLE HAD TO BE REPAIRED AT A NISSAN DEALER RATHER THAN AN INDEPENDENT MECHANIC. THE CONTACT WAS PROVIDED CASE NUMBER: 29163686. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064781,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING TRANSMISSION PROBLEMS DUE TO THE KNOWN DESIGN FLAW IN THE 2008 XTERRA RADIATORS THAT CAUSES COOLANT TO MIX WITH TRANSMISSION FLUID.  NISSAN ADMITTED THE FLAW AND YET THE NHTSA, WHO IS SUPPOSED TO HELP PROTECT US, HAS CONCLUDED THAT NISSAN ISN'T LIABLE FOR THESE PROBLEMS.  WHAT PROTECTION DOES A CONSUMER HAVE BESIDES TRYING TO TAKE A MULTI-NATIONAL COMPANY TO COURT IF THE GOVERNMENT BODY WHO LOOKS INTO THIS WON'T ACT?  PLEASE REVISIT THIS \"RADIATOR INTERMIX\" PROBLEM!",
        "vin": "5N1AN08WX8C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2018",
        "dateOfIncident": "12/01/2017",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED SHUDDERING AT FIRST, THEN A STUMBLING UPON HITTING GAS 120000 MILES  TOOK TRUCK IN AND HAD EXT. COOLER PUT ON, FLUSHED OUT TRANNY FLUID, NEW RADIATOR, NEW GASKETS AND FILTERS IN TRANNY $1,100.00 JOB.  1 MONTH LATER SERVICE ENGINE SOON LIGHT CAME ON AND TRUCK WOULDN'T START.  TCM MODULE IN TRANNY STARTED BLOWING FUSE, TRUCK SMELLED LIKE IT WAS BURNING UP AND WOULDN'T ALLOW TRUCK TO START. 2,000.00 TO REPLACE MODULE AND SECONDARY BREACH.  ITS NOT JUST IN RADIATOR, THERE IS ANOTHER BREACH PROBLEM  THAT PUTS THE TRANSMISSION AND COOLANT TOGETHER.  2ND BREACH.  SHOP WONT GUARANTEE 2000.00 JOB, NEW TRANSMISSION 5800.00.  MY BEAUTIFUL TRUCK LEFT ON A FLATBED TO SALVAGE YARD.  SINGLE MOM OF 4.  THANKS NISSAN, YOU SUCK.  ALSO ISSUES WITH AIRBAG COIL.  600.00 FOR THAT.  NISSAN I LOVE MY XTERRA AND ITS SO SAD WE HAD TO PART WAYS TODAY, I WATCHED MY 18000.00 VEHICLE LEAVE WITH NO JUSTICE BUT TEARS AND HOPING THE ZERO DEGREE WEATHER BREAKS, WALKING THE KIDS TO SCHOOL, ONE WITH DISABILITIES IS JUST ROTTEN.  NISSAN GET A CONSCIENCE.   BECAUSE MY XTERRA SAT ON A DEALERSHIPS USED LOT, NO ONE WAS NOTIFIED OF CLASS ACTION AND WARRANTY ISSUED.  I GOT DOUBLED F**CKED.",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057316,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT MIXED INTO TRANSMISSION CAUSING ELECTRONIC MODULE TO BURN OUT. THIS CAUSED VEHICLE TO STOP OPERATING CORRECTLY  AND WOULD NOT ALLOW ENGINE TO RESTART.",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054036,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIFFERENTIAL BROKE IN THE MIDDLE OF THE ROAD AWAY FROM MY HOUSE BUT FIRST IN WEIGHT WITH THE LIGHT OF THE TIRES I WENT TO CHECK IT AND NOTHING AFTER THE MUFFLER TILL THE LAST ONE BROKE THE DIFFERENTIAL AND NOW I DO NOT KNOW HOW TO FIX IT.",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/09/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053679,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BREAKS IS PRESSED IN AN EMERGENCY TO STOP IT PUSHES THE VEHICLE FORWARD AND DOES NOT STOP WHEN IT SHOULD.",
        "vin": "3N1AB61E18L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048304,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD REACH MY DESTINATION TO WORK AND FOUND THAT MY XTERRA WILL NOT GO IN REVERSE. I HAD NO PREVIOUS WARNING OF THIS OR RECALL NOTICE FROM NISSAN. I HAVE 2 NISSAN XTERRA'S AFTER I PAY FOR THIS $4000.00 REPAIR I PLAN ON SELLING THEM BOTH AS THEY ARE NOT RELIABLE WITH THIS TRANSMISSION DEFECT.",
        "vin": "5N1AN08W58C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033160,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2008 NISSAN XTERRA X  VIN [XXX] MILEAGE 77107 ON JUNE 6, 2015. AFTER OWNING THIS VEHICLE FOR JUST OVER 2 YEARS WE HAD VERY BAD EXPERIENCE MY WIFE WAS DOING HER DAILY ERRANDS AS SHE WAS RETURNING HOME WITH OUR CHILD IN THE BACK SEAT HERE VEHICLE BEGAN TO ACCELERATE AND LOOSE ACCELERATION POTENTIALLY CAUSING HER TO BE ACCIDENT. WHEN SHE RETURNED HOME THE VEHICLE WOULDN'T EVEN TURN OVER I HAD IT TOWED TO MY MECHANIC AND HE INFORMED ME THAT THIS HAS A DEFECTIVE RADIATOR COOLER TANK THAT RUPTURES AND FORCES COOLANT INTO THE TRANSMISSION THROUGH THE COOLER LINES AND SUBSEQUENTLY I WAS LOOKING AT OVER $3500 DOLLARS IN REPAIRS. FOR A KNOW PROBLEM REPORTED NISSAN HAS BEEN AWARE OF. ITS VERY DISHEARTENING $3500 IN REPAIRS FOR A KNOW PROBLEM IT HURTS IN FACT ITS AFFECTED EVEN MY SURROUNDING FAMILY MEMBERS, MY MOTHER IS OR WAS PROUD OWNER OF NISSAN ALTIMA 2015. I JUST DON'T UNDERSTAND I DON'T HAVE PROBLEM MAINTAINING A VEHICLE OR SPENDING MONEY FOR REPAIRS THAT ARE STANDARD THAT COMES WITH OWNING ANY VEHICLE BUT THIS IS JUST OUTRAGEOUS. HOW DOES START UP FAMILY...1ST FAMILY CAR END UP IN THIS POSITION. IS THERE ANYTHING NISSAN CAN DO TO HELP ME AND MY FAMILY.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5N1AN08U98C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994190,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY XTERRA IS CURRENTLY UN-DRIVEABLE DUE TO THE FACT THAT THE RADIATOR FLUID LEAKED INTO THE TRANSMISSION, WHICH CAUSED ME THE BLOW MY TRANSMISSION WHILE I WAS MERGING ON TO THE HIGHWAY, WHICH ALMOST CAUSED AN ACCIDENT DUE TO AN EXTREME LOST OF POWER. AFTER THIS HAPPENED TO ME, THAT IS WHEN I FOUND OUT THAT THIS IS A VERY COMMON PROBLEM WITH MAKE MODEL AND YEAR OF MY VEHICLE. NISSAN HAS DONE NOTHING TO HELP.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979731,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS LOOSING FLUID FROM RADIATOR, NO LEAKAGE ON GROUND.THEN THE NEXT THING THAT HAPPENED WAS, IT WASN'T SHIFTING CORRECTLY.  I WENT TO A TRANSMISSION SHOP AND THEY TOLD ME I NEEDED A NEW TRANSMISSION I THEN CALLED AROUND TO GET A SECOND OPINION,  WENT TO A DIFFERENT SHOP, AT THAT SHOP AFTER I PARKED THE CAR, IT WOULDN'T EVEN START BACK UP, CAR HAS REPAIRED AT THAT LOCATION . RADIATOR LEAKED FLUID IN MY TRANSMISSION AND RUINED IT!",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2017",
        "dateOfIncident": "02/13/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978505,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A ROUTINE OIL CHANGE AT FORT LAUDERDALE NISSAN I WAS TOLD THE RADIATOR SOMEHOW CRACKED WAS LEAKING AROUND THE VEHICLE, BUT NO MORE INFO WAS COVERED OR DISCUSSED. AS IT WAS ALREADY IN THE SHOP WHO WAS TO ARGUE THIS, AS I WAS TOLD I WOULDN'T BE ABLE TO DRIVE THE VEHICLE. I HAD DRIVEN THE VEHICLE MANY MILE SINCE MY PRIOR SERVICE AND NOT ONCE HAD THIS VEHICLE OVERHEATED. A MONTH LATER WHEN I WAS GETTING TIRES I RECEIVED AN INSPECTION AT A DIFFERENT SHOP AND THEIR CLAIM WAS MY TRANSMISSION FLUID WAS VERY DIRTY AND FROTHY AND IT NEEDED CHANGING, SO I DID THIS. NOW, IN 2017 AFTER A FEW ODD TRANSMISSION ISSUES THAT WENT UNEXPLAINABLE BESIDES REGULAR SERVICE, AT 135,000 I HAVE TRANSMISSION FAILURE AND HAVE LEARNED WHY: DUE TO FAULTY RADIATOR LEAKAGE AT ONE POINT. I WASN'T INFORMED OF ANYTHING OF THIS NATURE NOW I AM PAYING FOR IT. THE TOTAL FAILURE HAPPENED WHILE DRIVING.",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "03/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10967293,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. WHILE DRIVING 20 MPH, THE CONTACT ENCOUNTERED BLACK ICE ROAD CONDITIONS. AS A RESULT, THE CONTACT LOST CONTROL OF THE VEHICLE AND ATTEMPTED TO REGAIN CONTROL; HOWEVER, THE VEHICLE LEFT THE ROADWAY, CRASHED INTO A DITCH, AND OVERTURNED. THE CONTACT STATED THAT THE VEHICLE LANDED ON THE DRIVER'S SIDE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED MINOR INJURIES AND BRUISES TO THE HANDS; HOWEVER, MEDICAL ATTENTION WAS NOT REQUIRED. THE VEHICLE WAS TOWED TO AN INDEPENDENT FACILITY. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "5N1AN08W48C"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2017",
        "dateOfIncident": "03/05/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959797,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2008 NISSAN XTERRA ABOUT 3 YEARS AGO AND DID NOT KNOW ABOUT ALL THE DEFECTS THE TRANSMISSION AND RADIATOR HAD.   I AM HIGHLY DISAPPOINTED WITH THIS NISSAN. IT LEFT ME STALLED IN THE MIDDLE OF THE ROAD JUST SUDDENLY WITH NO WARNING. WORST PART WAS THAT IT WAS IN THE MIDDLE OF THE NIGHT WITH A PARTY OF 5. THE CONDITIONS WERE UNSAFE AND HAD TO WAIT FOR DAYLIGHT TO BE ABLE TO BE TOWED.  ITS IS VERY UNFORTUNATE THAT I CAN NOT DO ANYTHING ABOUT THIS BAD VEHICLE AND IT WILL COST ME CLOSE TO 4K TO HAVE MY VEHICLE REPAIRED. AT THIS POINT IM JUST STILL IN DEBT SINCE I HAVE NOT FINISHED PAYING THIS OFF AND CAR LESS. ITS VERY UNFORTUNATE THAT NISSAN WILL NOT TAKE ANY RESPONSIBILITY FOR THE HORRIBLE AND UNSTABLE VEHICLE THEY CREATED.",
        "vin": "5N1AN08U25C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956457,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTION REQUESTED: 2008 NISSAN XTERRA FUEL GAUGE FAILS TO OPERATE PROPERLY AND IS SAFETY CONCERN.  ISSUE: 2008 NISSAN XTERRA FUEL GAUGE READING IS ERRATIC, INACCURATE AND, AT TIMES, INOPERATIVE. WHEN FUNCTIONING, FUEL GAUGE IS INCONSISTENT.  THE PROBLEM BEGAN AT APPROXIMATELY 65,000 MILES AND HAS PERSISTED.  THE VEHICLE CURRENTLY HAS APPROXIMATELY 70,400 MILES. THUS FAR, NISSAN STATED THAT THE VEHICLE IS NOT PART OF A RECALL. YET, LETTER FROM NISSAN'S SENIOR MANAGER FOR TECHNICAL COMPLIANCE ACKNOWLEDGES DEFECT IN THE FUEL GAUGE SYSTEM (SEE ATTCH 3) AND A RECALL INITIATED IN MAY 2010 (ATTCH 5) AND SUBSEQUENT BULLETINS (ATTCH 4).  I'VE ENCLOSED A PROOF OF OWNERSHIP THAT I'VE PROVIDED TO NISSAN (ATTCH 1) AS WELL AS A PHOTO CONTAINING THE MANUFACTURERS' DETAILS. WILL CONTINUE TO ENGAGE NISSAN AND RESPECTFULLY REQUEST YOUR ASSISTANCE IN ADDRESSING THIS SAFETY CONCERN BY ADDING THE VEHICLE TO THE RECALL AND ENABLING NISSAN TO REPLACE DEFECTIVE PART. PLEASE ADVISE IF FURTHER INFORMATION IS NEEDED OR REQUIRED.",
        "vin": "5N1AN08U38C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY XTERRA BACK IN OCTOBER OF 2008. IT HASN'T GIVEN ME ANY SIGNIFICANT PROBLEMS UNTIL NOW. I HAVE TAKEN IT TO THE SAME CERTIFIED NISSAN DEALER/SERVICE CENTER FOR JUST ABOUT ALL OF THE SCHEDULED MAINTENANCE AND SO ON. EVEN THOUGH THIS ISSUE WAS KNOWN BY NISSAN, NOT ONCE IN ALL OF MY MANY VISITS TO THIS SERVICE PROVIDER, WAS I WARNED OR NOTIFIED OF THIS CONDITION OR THE CLASS ACTION LAWSUIT THAT WAS IN PROGRESS WHICH HAS SINCE BEEN CLOSED (OCTOBER 2016). ALSO, BEING THAT MY VEHICLE IS JUST OVER THE LAWSUITS AGREED UPON MILEAGE ALLOWED FOR ANY COMPENSATION FROM NISSAN, I WOULDN'T QUALIFY TO RECEIVE ANYTHING AT THIS POINT. SO NOW, HERE I AM WITH A VEHICLE, THAT I PLANNED TO KEEP FOR MANY MORE YEARS, EITHER HAVING TO BASICALLY JUNK IT, OR PAY UPWARDS OF $7000 IN REPAIRS (ACCORDING TO THE NISSAN SERVICE CENTER) TO REPLACE THE TRANSMISSION AND RADIATOR. I AM BETWEEN A ROCK AND A HARD PLACE. I FEEL THAT I SHOULD BE COMPENSATED IN SOME WAY FOR THIS. IF I WERE NOTIFIED OF THIS PROBLEM AROUND THE TIME THAT IT FIRST CAME TO LIGHT, I WOULD HAVE AT LEAST HAD THE CHANCE TO TRADE THE VEHICLE IN, INSTEAD OF BEING STUCK HERE WITH A VEHICLE THAT IS ESSENTIALLY WORTHLESS. NOT ONLY COULD THEY HAVE BEEN CONSIDERATE ENOUGH TO NOTIFY ME AS 1 OF MANY PURCHASERS OF A NISSAN VEHICLE WITH THIS ISSUE, BUT YOU WOULD THINK THAT DURING SERVICE VISITS THEY WOULD KEEP AN EYE OUT FOR AN IMPENDING ISSUE SUCH AS THIS. AFTER RESEARCH OF THIS PROBLEM, I FOUND THAT MY VEHICLE WAS DISPLAYING SYMPTOMS OF THIS CONDITION ARISING MONTHS AGO (IE: THE HEAT NOT REMAINING WARM WHEN IN IDOL POSITION). ALSO, I JUST HAD A OIL CHANGE 2 WEEKS PRIOR TO HAVING THEM CHECK THIS PROBLEM OUT. I DO KNOW THAT THIS ISSUE WAS ALREADY PRESENT THEN, BECAUSE I HAD A COUPLE OF INSTANCES WHERE IT SEEMED THAT MY TRANSMISSION WAS SLIPPING, AND NOT ONLY THAT, BUT THE ENGINE LIGHT WAS ON.  *TR",
        "vin": "5N1AN08W28C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934442,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P0717 THE SPEED SENSOR IS RUINED DUE TO A FALTY RADIATOR LEEK INTO THE TRANSMISSION CAUSING DETERIORATION OF PARTS AND TRANSMISSION FAILURE.",
        "vin": "5N1AN08U48C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN TENSIONERS IN THE ENGINE OF THIS CAR BEGAN MAKING A LOUD WHINING SOUND, WHICH IS A TYPICAL PROBLEM WITH THESE ENGINES. NISSAN WAS AWARE OF THESE FAULTY TENSIONERS BACK IN 2004, WHEN THEY ISSUES A TECHNICAL SERVICE BULLETIN. HTTP://WWW.NISSANPROBLEMS.COM/TRENDS/TIMING-CHAIN/",
        "vin": "5N1AN08W58C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "12/20/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897128,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 XTERRA THAT HAS SUFFERED A TRANSMISSION FAILURE DUE TO THE WELL KNOWN PROBLEM WITH THESE MODELS - NAMELY THAT THE RADIATOR CRACKED, TRANSMISSION FLUID AND COOLANT MIXED, THUS DESTROYING THE TRANSMISSION.",
        "vin": "5N1AN08W87C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR FLUID LEAKED INTO THE TRANSMISSION WHICH RESULTED IN UNREPAIRABLE DAMAGE TO THE TRANSMISSION WHICH REQUIRE THE ENTIRE TRANMISSION TO BE REPLACED AT A SIGNIFICANT COST.    NOT SURE WHEN THE RADIATOR BEGAN LEAKING FLUID INTO THE TRANSMISSION THERE WERE NO WARNING SIGNS INCIDATING THAT SOMETHING WAS WRONG UNTIL THE DAMAGE HAD BEEN DONE.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883008,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD THE TIMING BELT TENSIONERS NEEDED TO BE REPLACED. IT ONLY HAS 60,800 MILES ON IT. THE DEALER QUOTED ME 1400.00.   THERE IS A HIGH PITCHED WHINE FROM THE ENGINE, MOST NOTICEABLE AT LOW SPEEDS. THE VEHICLE RUNS OK BUT I'M AFRAID IF THE TENSIONERS FAIL, SO WILL THE TIMING BELT AND SO WILL THE ENGINE.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "06/05/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872825,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED RADIATOR LEAKED COOLANT INTO THE TRANSMISSION COOLER DESTROYING THE TRANSMISSION, TRANSMISSION COOLER, AND RADIATOR AT ABOUT 109,000 MILES IN TRAFFIC.  APPARENTLY, THIS IS A KNOW ISSUE WITH 2005-2010 NISSAN XTERRAS, FRONTIERS, AND PATHFINDERS.  AS PART OF A SETTLEMENT TO A CLASS-ACTION LAWSUIT, NISSAN OFFERED AN EXTENDED WARRANTY UP TO 10 YEARS / 100,000 MILES, WHICHEVER COMES FIRST (ALTHOUGH AN INTERNET SEARCH SAYS THE AVERAGE MILEAGE AT WHICH THIS PROBLEM OCCURS IS 95,000 MILES).  NISSAN NOR ITS DEALERSHIP NEVER NOTIFIED ME OF THE DEFECT OR THE EXTENDED WARRANTY SO NOW I'M TRYING TO DECIDE IF I FORK OUT $6100 FOR THE REPAIRS OR TRADE-IN THE VEHICLE.",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/25/2016",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870846,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED RADIATOR LEAKING FLUID INTO TRANSMISSION. I WAS DRIVING WHEN I FELT A SLIP I PARKED THE CAR AND WITH IN MINUTES A CREME COLORED FLUID WAS LEAKING FROM UNDERNEATH THE VEHICLE. TOOK CAR TO MECHANIC WHO TOLD ME IT WAS A GOOD THING I TOOK IT THEN BECAUSE IF IT WOULD HAVE CONTINUED TO LEAK IT WOULD HAVE DAMAGED MY TRANSMISSION. I NOW HAVE TO HAVE NEW RADIATOR PUT IN THERMOSTAT PUT IN AND ENGINE FLUSHED THIS DOES NOT GUARANTEE I WILL NOT HAVE ANY MORE PROBLEMS. VOICING THIS COMPLAINT BECAUSE THERE HAVE BEEN SO MANY PEOPLE WITH THIS ISSUE AND DEALER SHIPS AND MANUFACTURERS DO NOT DO MUCH ABOUT IT. THEY TAKE OUR MONEY BUT DON'T CARE WHAT HAPPENS AFTER THE FACT. I LOVE THIS VEHICLE BUT WILL NEVER BUY A NISSAN AGAIN VERY SAD.",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2016",
        "dateOfIncident": "02/07/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861499,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK OUR 2008 XTERRA INTO A LOCAL SHOP TO HAVE THE ALL THE FLUIDS EXCEPT THE OIL SERVICED (ALREADY HAD IT CHANGED AT A NISSAN DEALER) ON FEB 7 2015. WHEN THE SHOP CALLED, THEY TOLD ME THERE WAS OIL IN THE RADIATOR AND WHAT THEY SUSPECTED AND TOLD ME I SHOULD TAKE IT TO A DEALER. WHEN I LOOKED AT THE RADIATOR FLUID IT HAD WHAT LOOKED LIKE OIL AND THE OVERFLOW TANK LOOKED LIKE A CHOCOLATE SHAKE WAS IN IT. I TOOK IT TO THE DEALER ON FEB 9TH 2015 AND WAITED FOR 1/2 DAY TO FIND OUT THAT IT NEEDED THE RADIATOR AND TRANNY REPLACED, BUT THEY COULDN'T DO IT THAT DAY. HAVING RESEARCHED THE PROBLEM ONLINE I HAD SEEN THE STORIES ABOUT THE VEHICLE SEIZING UP ON THE HIGHWAYS/ROADS. I EXPRESSED MY CONCERN AND ASKED THAT THEY CONTACT THE AFTERMARKET WARRANTY INSURANCE AND DISCUSS WHAT NISSAN WOULD COVER AND WHAT MAXCARE WOULD COVER. I WAS THEN PUT INTO A RENTAL FOR ALMOST 2 WEEKS WHILE IT GOT REPAIRED. NOW LESS THAN 2 WEEKS AFTER GETTING IT BACK IT HAS A SMELL, IS LEAKING FROM THE FRONT RIGHT CORNER UNDER THE HOOD, AND HAS A CLANGING NOISE FROM THE SAME AREA. UPON POPPING THE HOOD AND I FOUND A DARK OILY SUBSTANCE IN THE RADIATOR AND FOAMY 'STUFF' ON THE RADIATOR OVERFLOW CAP AGAIN. IT APPEARS THE PROBLEM IS NOT FIXED OR BAD REMANUFACTURED PARTS WERE USED, OR IT WASN'T COMPLETELY CLEANED OUT PRIOR TO PUTTING IT BACK TOGETHER. I DON'T UNDERSTAND HOW AN ISSUE THAT CAN MAKE A VEHICLE SEIZE UP ON THE ROADS CAN NOT BE CONSIDERED A SAFETY ISSUE. ALL OF THIS AFTER PURCHASING THE XTERRA OCT 31 2014 AT OUR LOCAL CARMAX FACILITY. CARMAX SUPPOSEDLY DOES A THOROUGH JOB OF CHECKING OVER THE VEHICLES THEY SELL BUT THEY SURE DROPPED THE BALL ON THIS ONE.   NOW JUST AFTER THE 12 MONTH 12000 WARRANTY ON THE REPLACED PARTS, THE TRANSMISSION FAILS AGAIN, 5 DAYS WITHOUT THE XTERRA AND STILL WAITING FOR MAXCARE TO APPROVE THE REPAIRS.  WONDERING ABOUT KEEPING IT AFTER THIS REPAIR IS DONE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "01/16/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849911,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT BLINKS AND HORN DOES NOT WORK. I CONTACTS NISSAN AMERICA CASE # 21920897.  BECAUSE VEHICLE OUT OF WARRANTY NISSAN DOES NOT ANT TO COVER ANY COST INCLUDING THE DIAGONIST TEST THAT IS A MINIMUM CHARGE OF 300 DOLLARS.  THE REPAIR CAN ONLY BE MADE BY NISAN.",
        "vin": "5N1AN08U88C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "02/04/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LEFT DOOR DOES NOT OPEN FROM INSIDE OR OUTSIDE. THIS COULD BE A MAJOR SAFETY ISSUE IF THE CAR WAS TO BE INVOLVED IN AN ACCIDENT AND AN OCCUPANT NEEDED TO GET OUT VERY QUICKLY.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "12/28/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823315,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG BLINKING, NISSAN DEALER CHECK BUT BLINKING CAME BACK.   TIRE PRESSURE INDICATOR ON EVEN AFTER TIRE PRESSURE IS CHECK AND CORRECTED.",
        "vin": "5N1AN08WX8C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816726,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT FLASHED AND REMAINED ILLUMINATED. THE DEALER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS TO BE INSPECTED AND DIAGNOSED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 08V690000 (AIR BAGS). THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE APPROXIMATE FAILURE MILEAGE WAS 163,000.   UPDATED 05/24/16*LJ  *TR",
        "vin": "5N1AN08U38C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809246,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS TURNING LEFT ONTO A HIGHWAY AND IN THE INTERSECTION, MY VEHICLE DIED. HAD TO BE PUSHED THROUGH THE INTERSECTION WHILE TRAFFIC WAS BEING HELD BACK IN 5 LANES. THE GAS TANK REGISTERED AN EIGHTH TANK OF GAS BUT IT WAS, IN FACT, OUT OF GAS. I HAD TO HAVE THIS REPAIRED AT A REPAIR SHOP BECAUSE I WAS NOT NEAR A DEALER. I NEVER RECEIVED A RECALL NOTICE(CAMPAIGN ID# PC 042, NHTSA# 10V-075) BUT FOUND OUT LATER THERE WAS ONE ON CERTAIN VIN NUMBERS WITH MY MAKE AND MODEL VEHICLE. THE DEALER CLAIMS IT SHOULD BE COVERED BUT NISSAN SAYS THIS VIN # IS NOT COVERED. REGARDLESS, I HAD THE DESCRIBED PROBLEM WITH THE MAKE AND MODEL VEHICLE THAT HAS THIS PROBLEM AND I COULD HAVE BEEN KILLED. PERHAPS THEY NEED TO ADD MORE VIN #'S TO THEIR RECALL LIST AND GET ON THE SAME PAGE AS THEIR DEALERS. THIS WAS AN EXPENSIVE REPAIR FOR ME TO ABSORB. I WAS TO LEAVE ON A ROAD TRIP IN 2 DAYS. THANKFULLY IT HAPPENED BEFORE I WAS TRAVELING.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816110,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 NISSAN XTERRA.  CONSUMER WRITES IN REGARDS TO VEHICLE FUEL GAUGE INACCURACY ISSUES.  *SMD  THE CONSUMER STATED SHE RAN OUT OF GAS ON THE HIGHWAY, EVEN THOUGH THE TANK READ A QUARTER TANK REMAINING. *JB",
        "vin": "5N1AN08W08C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790758,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FRONT BRAKES OVERHEAT. WHEN DRIVING DOWNHILL AT ANY RATE BRAKES WILL SOFTEN CONTINUOUSLY UNTIL HAVING TO PULL OVER FOR FEAR OF SAFETY. WHEN BRAKES WERE CHECKED BY DEALER THEY STATED THAT THEY WERE AT 75% AND SHOULD BE WORKING FINE. EVERY TIME I BRAKE GOING DOWN HILL I FEEL SOFTNESS IN BRAKES. BRAKES ALSO WILL START TO SMELL AFTER BRAKING DOWNHILL.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/09/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789410,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OVER HEATED BECAUSE OF COOLANT LOST, WITH POSSIBLE TRANS DAMAGE, THE VEHICLE WS BEING DRIVEN WHEN THE HEATING PROBLEM OCCURED.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "09/17/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR ON THE NISSAN XTERRA HAS A CRACK, FOUND COMMONLY I GUESS AND IT LEAKS INTO THE TRANSMISSION DESTROYING THE TRANSMISSION",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/14/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764056,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CONSTANTLY BLINKING AFTER TURN ON THE VEHICLE AND DOES NOT GO OFF. NOT SURE IF AIRBAGS INSTALLED ARE FROM TAKATA. AT LEAST, I REVIEW IF THERE IS ANY RECALL BASED ON VIN # AND THERE IS NO APPARENTLY RECALL IN THIS UNIT. VERY CONCERNED DUE TO THE FACT LAST YEARS A MAIN CABLE THAT CONNECT THE HORN AND OTHER COMPONENTS WAS INSTALLED.",
        "vin": "5N1AN08U88C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/14/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CONSTANTLY BLINKING AFTER TURN ON THE VEHICLE AND DOES NOT GO OFF. NOT SURE IF AIRBAGS INSTALLED ARE FROM TAKATA. AT LEAST, I REVIEW IF THERE IS ANY RECALL BASED ON VIN # AND THERE IS NO APPARENTLY RECALL IN THIS UNIT. VERY CONCERNED DUE TO THE FACT LAST YEARS A MAIN CABLE THAT CONNECT THE HORN AND OTHER RELATED COMPONENTS WAS INSTALLED.",
        "vin": "5N1AN08U88C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/06/2015",
        "dateOfIncident": "08/04/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746793,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT WHILE AT THE DEALER HAVING A TIRE ROTATION PERFORMED, THE TECHNICIAN NOTICED THAT THE REAR PASSENGER AXLE BEARING SHAFT AND SEAL WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 37,000.",
        "vin": "5N1AN08WX8C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731144,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY HAVE A 2008 NISSAN XTERRA WITH 146K MILES.  I TOOK MY CAR INTO SUTHERLIN NISSAN AT THE MALL OF GEORGIA AS THE SERVICE ENGINE SOON LIGHT WAS ON AND WAS TOLD THAT THE RADIATOR WAS CRACKED AND LEAKING FLUID INTO THE TRANSMISSION THAT BOTH WOULD NEED TO BE REPLACED.  THE DEALER INFORMED ME THAT THE COST WOULD BE OVER $4K TO REPLACE BOTH.  I TOOK IT SOMEWHERE ELSE AND HAD THE RADIATOR REPLACED.  HOWEVER, IM STILL EXPERIENCING PROBLEMS WITH THE TRANSMISSION.  I TOOK IT TO A KOREAN SHOP VOTECH WHERE THE OWNER VO IS VERY FAMILIAR WITH ALL TYPES OF CARDS.  I EXPLAINED TO VO WHAT THE ISSUE WAS AND HE SAID THAT OVER 90% OF THE NISSAN REAR WHEEL DRIVE TRUCKS THAT COME IN HAVE THE SAME PROBLEM AND THAT NISSAN SHOULD BE IN A LAWSUIT OR ISSUING A RECALL REAL SOON ON THESE VEHICLES.  IM A SINGLE MOTHER OF TWO AND IM UNEMPLOYED, SO OF COURSE I CANT AFFORD TO PAY $4K TO REPLACE A TRANSMISSION.  I HAVE PAID NISSAN ALL OF THIS MONEY TO PURCHASE THE VEHICLE AND THEY ARE AWARE OF THIS ISSUE, THEN THEY SHOULD BE HELD ACCOUNTABLE FOR FAULTY PARTS IN THEIR VEHICLES REGARDLESS OF HOW MANY MILES ARE ON THE VEHICLE.  IM VOICING MY CONCERN AS A CUSTOMER AND I WANT PEOPLE TO KNOW NOT TO BUY NISSAN IF THEY ARE NOT GOING TO TREAT THEIR CUSTOMERS UNFAIRLY",
        "vin": "5N1AN08U88C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "06/20/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726980,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER NOTING A REPEATED NOISE THAT SOUNDED LIKE DRIVING OVER RUMBLE STRIPS, WE DISCOVERED FROM OUR MECHANIC THAT WE WERE FACING A $6,400 REPAIR FOR A ISSUE THAT WAS WELL KNOWN AND DOCUMENTED BUT ONLY COVERED BY NISSAN UP TO 80,000 MILES, WHICH OUR CAR HAS EXCEEDED.  THE ENTIRE TRANSMISSION, RADIATOR, TRANSFER CASE AND OTHER PARTS ARE DESTROYED BY A LEAK OF THE RADIATOR INTO THE TRANSMISSION.  WE WERE NEVER ALERTED TO THIS MAJOR DEFECT AND NOW HAVE NO RECOURSE BACK TO NISSAN TO COVER THE REPAIR. WHAT A TREMENDOUS LACK OF ACCOUNTABILITY AND DISREGARD FOR POTENTIAL SAFETY OF DRIVERS BY NISSAN.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "06/11/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725493,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CONSTANTLY BLINKING AND WILL NOT GO OFF.  DEALERSHIP TRIED AND TO NO AVAIL.  NOT SURE IF IT WILL GO OFF ON OWN OR ON ACCIDENT.  VERY CONCERNED.    UPDATED 8/31/15*CN     THE CONSUMER STATED THE DEALER COULD NOT DETERMINE THE CAUSE OF THE FAILURE.  UPDATED 10/14/2015*JS",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE FUEL GAUGE DISPLAYED THAT THE FUEL TANK WAS EMPTY WHEN THERE WAS FUEL PRESENT IN THE TANK. THE DEALER DIAGNOSED THAT THE FUEL TANK SHELLS MALFUNCTIONED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "5N1AN08U18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716785,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 NISSAN XTERRA STARTING SHIFTING ROUGH OVER THE PAST COUPLE WEEKS. I DROPPED IT OFF TO THE NISSAN DEALER THIS MORNING AND RECEVIED A CALL STATING RADIATOR AND TRANSMISSION NEEDS TO BE REPLACED DUE TO ENGINE COOLANT LEAKING INTO TRANSMISSION. WAS TOLD THIS WAS A FAMILIAR ISSUE SO I RESEARCHED AND SEE THERE IS PENDING CLAIM OPEN SINCE JUNE 11 2012: HOW MANY VEHICHLES ARE NEEDED BEFORE THE RECALL IS PASSED. I WAS JUST QUOTED $10,000 TO REPLACE RADIATOR AND TRANSMISSION. I DO NOT HAVE 10K AND I RELY ON MY VEHICLE FOR WORK AS I AM A HOSPICE NURSE. THIS IS CAUSING ME SERIOUS STRESS AS I NEED MY VEHICLE FOR WORK. SEE BELOW :   NHTSA DEFECT INVESTIGATIONS FOR THE 2008 NISSAN XTERRA    THE OFFICE OF DEFECTS INVESTIGATIONS (ODI) IS AN OFFICE WITHIN THE NHTSA WHICH INVESTIGATES SERIOUS SAFETY PROBLEMS IN THE DESIGN, CONSTRUCTION OR PERFORMANCE OF VEHICLES. THE NHTSA IS AUTHORIZED TO ORDER MANUFACTURERS TO RECALL AND REPAIR VEHICLES, IF THE ODI FINDS A SAFETY ISSUE. NHTSA INVESTIGATIONS FOR THE 2008 NISSAN XTERRA, BOTH ONGOING AND CLOSED, ARE LISTED BELOW:     TRANSMISSION FAILURE (ATF CONTAMINATION)NHTSA DEFECT INVESTIGATION #DP12004  STATUS:  OPEN    DATE OPENED:JUNE 11, 2012  DATE CLOSED:PENDING  RECALL:POSSIBLE RECALL    COMPONENT(S): POWER TRAIN  POWER TRAIN:AUTOMATIC TRANSMISSION  POWER TRAIN:AUTOMATIC TRANSMISSION:CONTROL MODULE (TCM, PCM)  POWER TRAIN:AUTOMATIC TRANSMISSION:COOLING UNIT AND LINES  POWER TRAIN:AUTOMATIC TRANSMISSION:TORQUE CONVERTER    SUMMARY: ODI RECEIVED A PETITION REQUESTING INVESTIGATION OF TRANSMISSION DAMAGE ATTRIBUTED TO CONTAMINATION BY ENGINE COOLANT.THE SOURCE OF THE CONTAMINATION IS A CRACKED ATF LINE THAT RUNS THROUGH AN ENGINE COOLANT CHAMBER IN THE RADIATOR.ODI HAS RECEIVED (512) FIVE-HUNDRED-TWELVE CONSUMER COMPLAINTS BETWEEN AUGUST 2005 TO MAY 2012 REGARDING TRANSMISSION PROBLEMS.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715576,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "4WD AND BRAKE LIGHT COMES ON FEELS LIKE AIR IN THE LINE. PEDAL GOES TO FLOOR",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT THE BRAKE PEDAL TRAVELED TO THE FLOOR WITHOUT ANY WARNING. THE CONTACT HAD TO CAUTIOUSLY RELEASE THE BRAKE PEDAL FOR THE VEHICLE TO COME TO A COMPLETE STOP. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR FURTHER INSPECTION. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBERS: 07E105000 (SERVICE BRAKES, AIR) AND 07V528000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "5N1AN08W08C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING XTERRA 4X4 ON THE STREET WHEN ALL OF A SUDDEN THE VEHICLE SHUT ITSELF OFF. WAS ABLE TO LUCKILY TURN THE VEHICLE BACK ON BUT WHEN WE ARRIVED HOME THE VEHICLE WOULD NO LONGER START. HAD IT TOWED TO NISSAN WHO DISCOVERED THE CAR HAS A DEFECTIVE ECM UNIT. THIS COULD HAVE BEEN VERY VERY DANGEROUS AND I BELIEVE MANY OTHER NISSAN XTERRA/FRONTIERS/PATHFINDERS HAVE BEEN AFFECTED AS EVIDENT BY SEARCHING GOOGLE REGARDING THIS ISSUE. NISSAN WOULD NOT REPAIR THE VEHICLE FREE OF CHARGE AND WANTED 1400 DOLLARS TO REPLACE ECM. THIS DAY AND AGE AN ECM SHOULD LAST MUCH MUCH LONGER AND SHOULD NOT SHUT DOWN THE VEHICLE NOR, IMPAIR ITS ABILITY TO DRIVE.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "02/07/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691944,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK OUR 2008 XTERRA INTO A LOCAL SHOP TO HAVE THE ALL THE FLUIDS EXCEPT THE OIL SERVICED (ALREADY HAD IT CHANGED AT A NISSAN DEALER) ON FEB 7 2015.  WHEN THE SHOP CALLED, THEY TOLD ME THERE WAS OIL IN THE RADIATOR AND WHAT THEY SUSPECTED AND TOLD ME I SHOULD TAKE IT TO A DEALER.  WHEN I LOOKED AT THE RADIATOR FLUID IT HAD WHAT LOOKED LIKE OIL AND THE OVERFLOW TANK LOOKED LIKE A CHOCOLATE SHAKE WAS IN IT.  I TOOK IT TO THE DEALER ON FEB 9TH 2015 AND WAITED FOR 1/2 DAY TO FIND OUT THAT IT NEEDED THE RADIATOR AND TRANNY REPLACED, BUT THEY COULDN'T DO IT THAT DAY.  HAVING RESEARCHED THE PROBLEM ONLINE I HAD SEEN THE STORIES ABOUT THE VEHICLE SEIZING UP ON THE HIGHWAYS/ROADS.  I EXPRESSED MY CONCERN AND ASKED THAT THEY CONTACT THE AFTERMARKET WARRANTY INSURANCE AND DISCUSS WHAT NISSAN WOULD COVER AND WHAT MAXCARE WOULD COVER.   I WAS THEN PUT INTO A RENTAL FOR ALMOST 2 WEEKS WHILE IT GOT REPAIRED.  NOW LESS THAN 2 WEEKS AFTER GETTING IT BACK IT HAS A SMELL, IS LEAKING FROM THE FRONT RIGHT CORNER UNDER THE HOOD, AND HAS A CLANGING NOISE FROM THE SAME AREA.  UPON POPPING THE HOOD AND I FOUND A DARK OILY SUBSTANCE IN THE RADIATOR AND FOAMY 'STUFF' ON THE RADIATOR OVERFLOW CAP AGAIN.  IT APPEARS THE PROBLEM IS NOT FIXED OR BAD REMANUFACTURED PARTS WERE USED, OR IT WASN'T COMPLETELY CLEANED OUT PRIOR TO PUTTING IT BACK TOGETHER.  I DON'T UNDERSTAND HOW AN ISSUE THAT CAN MAKE A VEHICLE SEIZE UP ON THE ROADS CAN NOT BE CONSIDERED A SAFETY ISSUE.  ALL OF THIS AFTER PURCHASING THE XTERRA OCT 31 2014 AT OUR LOCAL CARMAX FACILITY.  CARMAX SUPPOSEDLY DOES A THOROUGH JOB OF CHECKING OVER THE VEHICLES THEY SELL BUT THEY SURE DROPPED THE BALL ON THIS ONE.  I'M NOT SURE WHO I AM MORE UPSET WITH, NISSAN FOR NOT TAKING CARE OF THEIR CUSTOMERS BY VOLUNTARILY DOING A RECALL, OR CARMAX FOR SELLING SOMETHING THAT CERTAINLY WASN'T CHECKED OVER VERY WELL OR THEY WOULD HAVE NOTICED THE FLUIDS.  *TR",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682050,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS GAUGE NO LONGER WORKS. I HAD IT CONNECTED TO DIAGNOSTICS AND WAS TOLD THE SENDING UNIT IS BAD(NO LONGER WORKS).  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "05/25/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672427,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT WHILE DRIVING AT A LOW SPEED, THE TRANSMISSION HESITATED TO SHIFT INTO GEAR. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE TRANSMISSION AND RADIATOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THERE WAS TRANSMISSION FLUID IN THE RADIATOR, AND THE RADIATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. HOWEVER, THE FAILURE RECURRED AND THE SERVICE ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO ANOTHER INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE VALVE BODY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 95,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654136,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN PREPARING TO TRAVEL, I WENT TO FILL UP MY GAS TANK. UPON GETTING BACK INTO MY VEHICLE AND TURNING IT ON MY GAS GAGE DROPPED TO \"0\" AND THE FUEL LIGHT AND CHECK ENGINE LIGHT WENT ON , INDICATING THAT THE TANK WAS EMPTY, AND WHO KNOWS WHAT ELSE WAS WRONG.  I CONTACTED NISSAN AND WAS ISSUED A CASE NUMBER, AND MADE AN APPOINTMENT WITH THE NISSAN DEALERSHIP NEAR MY HOME.  ON 10/1/14, I BROUGHT MY VEHICLE IN, DESCRIBED INCIDENT TO SERVICE CLERK. THEY EXPLAINED THAT THEY THOUGHT IT WAS THE FUEL SENDER FLOAT AND WOULD DO A DIAGNOSTIC TEST.  THEY CONFIRMED THAT  WAS INDEED THE ISSUE.  I WAS CHARGED FOR THE DIAGNOSTIC TESTING AND QUOTED OVER $400 TO REPLACE THE PART.   SINCE I HAD NO CHOICE, I PAID FOR THE TESTING, BUT DID NOT HAVE THE PART REPLACED. OVER A MONTH LATER, I'M STILL DEALING WITH THIS ISSUE.  I FOUND THAT THE USDOT HAD ISSUE A RECALL IN 2010 FOR 2006 -2008 NISSAN XTERRA'S. MY VEHICLE IS A 2008 MODEL, PURCHASED IN OCTOBER 2007.    *TR",
        "vin": "5N1AN08U18C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618918,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT THE ABS AND VDC WARNING INDICATORS REMAINED ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/09/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564628,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A WARRANTY NOTIFICATION LETTER AROUND 2011 , STATING THAT NISSAN WAS PROVIDING THE HIGHEST LEVELS OF PRODUCT QUALITY AND CUSTOMER SATISFACTION. THIS LETTER STATED THAT NISSAN WAS EXTENDING THE WARRANTY FOR THE FUEL SENDING SENSOR THAT CAN MALFUNCTION AND INCORRECTLY GIVE A WRONG READING ON THE FUEL LEVEL. THEY WHERE EXTENDING THE NEW VEHICLE LIMITED WARRANTY FOR 36 MONTHS/ 36,000 MILES TO 72 MONTHS 72,000 MILES. SO I PUT THE STICKER AND LETTER IN MY WARRANTY BOOKLET. I CALLED THE NISSAN DEALERSHIP AND GAVE THEM MY VIN NUMBER AND THEY STATED THAT MY VEHICLE WAS NOT PART OF THE \"CAMPAIGN RECALL\"  AND YOU DONT NEED TO DO ANYTHING FURTHER. SO IT IS NOW 2014, 3 YEARS LATER AND WHAT HAPPENS ........ THE FUEL SENDING SENSOR IS BROKEN, I SPOKE TO THE DEALER AGAIN ON 2-17-2014, AND AGAIN THEY STATED TO ME THAT MY VIN NUMBER WAS NOT PART OF THE CAMPAIGN RECALL AND WHEN I SHOWED THEM MY LETTER , THEY STATED TO ME THAT YES IT WAS UNDER WARRANTY AT THE TIME OF RECEIVING THE LETTER.....BUT THEY SAID TO ME IN 2011 THAT NO NEED IF YOU DONT HAVE A PROBLEM YOUR VEHICLE DOESNT NEED TO HAVE THIS REPLACED ....... SO I GOT TOLD WRONG TWICE ONCE WHEN YOU GET THE LETTER UNLESS IT IS BROKEN THEN THEY WONT FIX IT.....AND NOW THAT IT IS BROKEN MY VIN NUMBER IS NOT PART OF THE \"CAMPAIGN RECALL\" SAD THAT NISSAN DOES THIS .....THEY SHOULD HONOR THIS RECALL FOR ALL VIN NUMBERS THAT SHOW THIS PROBLEM. I BOUGHT THIS VEHICLE NEW FROM THE DEALER AND WILL NOT GIVE OUT 600.00 FOR THEM TO REPLACE AN 80.00 PART. I WISH MORE PEOPLE COMPLAIN SO THIS GOES TO RECALL. WITHOUT FIXING THIS YOU CANNOT PASS INSPECTION FOR YOUR CAR. AT THE TIME OF RECEIVING THE LETTER THEY SHOULD HAVE FIXED IT BUT IT WASNT BROKEN. 3 YEARS LATER THEY WONT FIX IT MY VIN IS NOT PART OF CAMPAIGN RECALL?????  *TR",
        "vin": "5N1AN08W28C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "02/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563940,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING THE TRANSMISSION FAILED AND CAR WAS SMOKING (OVERHEATED) DUE TO A RADIATOR LEAK INTO THE TRANSMISSION. I WAS NEARLY KILLED ON THE JAMES RIVER BRIDGE. I BOUGHT THE CAR BRAND NEW AND HAVE KEPT THE MAINTENANCE SCHEDULE.  *TR",
        "vin": "5N1AN08U78C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563370,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 NISSAN XTERRA THAT I PURCHASED A YEAR AND A MONTH AGO.  I STARTED NOTICING A FAINT BURNING SMELL IN THE CABIN IN THE CAR. I LOOK UNDER THE HOOD AND NOTICE THE SMELL ALOT MORE AND THAT IT SMELLED LIKE CLUTCH FLUID.  I MADE AN APPOINTMENT WITH THE DEALER, AUTO NATION. AS I WAS MAKING MY WAY THERE THE TRUCK STOP ON ME.  I WAS STRANDED ON THE INTERSTATE, I CALLED THE DEALER AND THEY DIDN'T HAVE THE MEANS TO TRANSPORT ME TO THE DEALERSHIP. I HAD TO PROVIDE MY OWN TOW SERVICE.  AFTER I HAD GOTTEN IT TOWED AND THE MECHANIC THERE TOOK A LOOK AT IT HE SAID THAT THE CLUTCH WENT OUT ON IT AS WELL AS THE FLY WHEEL. THE ESTIMATED COST OF THE REPAIR WOULD BE AROUND 3K.  I WAS APPALLED.  HE ALSO SAID THAT NONE OF THE REPAIRS IS COVERED UNDER WARRANTY. AS OF NOW I AM LOOKING FOR A MECHANIC THAT WOULD CHARGE ME LESS AND ALSO GOING TO TRADE THE TRUCK IN BECAUSE I'VE READ ALOT OF REPORTS OF THIS HAPPENING AND NO LONGER WANT TO POUR MONEY INTO A FAIRLY KNOW TRUCK.  I WOULD ADVISE NOONE PURCHASE THESE TRUCKS AND THAT ALL OF THE 2008 MODEL NISSAN XTERRA'S NEED TO BE RECALLED.  *TR",
        "vin": "5N1AN08U48C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2014",
        "dateOfIncident": "01/05/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR'S HEATER BLOWS COLD AIR WHEN CAR IS IDLING. NISSAN SERVICE TECHNICIAN ADVISED THAT THIS WAS CAUSED \"BY AN AIR POCKET\" FORMING IN THE COOLING SYSTEM? THE AIR POCKET HAS TO BE REMOVED - WHICH OF COURSE COSTS MONEY.  WE OWN TWO 2008 XTERRAS. THIS ALSO HAPPENED WITH OUR OTHER 2008 XTERRA.  *TR",
        "vin": "5N1AN08W28C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "10/22/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555786,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN.I WOULD LIKE TO SEND OUT A LETTER OF COMPLAINT ON MY 2008 XTERRA. I'M ONE OF THE HUNDREDS WITH THE PREMATURE WEAR OF THE TIMING CHAIN SHOE AND TENSIONERS MENTIONED IN YOUR 2009 SERVICE BULLETIN EM09-007; NTB09-128; NOV. 16, 2009. SUBSTANDARD PARTS.  YOUR CUSTOMER SERVICE WAS NO CUSTOMER SERVICE.   *TR",
        "vin": "5N1AN08W58C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555827,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THROUGH THE INTERSECTION, MY VEHICLE SUDDENLY LOST POWER CAUSING ME TO GET REAR ENDED.  VERY MINIMAL DAMAGE TO MY VEHICLE BUT MY DAUGHTER WAS IN THE CAR WITH ME.  UPON FURTHER INSPECTION AT A SHOP IT WAS CONCLUDED THAT THE CAUSE OF THE LOSS OF POWER WAS DUE TO A FAILURE IN THE TEAMS FLUID COOLER CAUSING RADIATOR FLUID TO ENTER THE TRANSMISSION.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "04/07/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514375,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT THE VEHICLE SHIFTED OUT OF GEAR INDEPENDENTLY. THE VEHICLE WAS TAKEN TO A DEALER FOR A DIAGNOSTICS, WHO STATED THAT THERE WAS A COOLING FLUID LEAK AND A TRANSMISSION FLUID LEAK, WHICH CAUSED CONTAMINATION OF THE TRANSMISSION. THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE FAILURE MILEAGE WAS 82,000. THE CURRENT MILEAGE WAS 83,000.",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "04/13/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514376,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CROSS CONTAMINATION ON TRANSMISSION/RADIATOR COOLANT CAUSING TRANSMISSION SLIPPAGE.  I WILL JOIN  THE CLASS ACTION SUIT CURRENTLY ON GOING....I HOPE NISSAN GETS HIT WITH A HUGE PENALTY FOR THIS TRAVESTY.  *TR",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2013",
        "dateOfIncident": "03/25/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513919,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN X-TERRA. THE CONTACT STATED THAT THE TRANSMISSION SHIFTED OUT OF GEAR INDEPENDENTLY. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC, WHO FOUND A COOLING FLUID LEAK IN THE RADIATOR AND A TRANSMISSION FLUID LEAK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS NOT REPORTED TO THE MANUFACTURER. THE FAILURE MILEAGE WAS 105,000. THE CURRENT MILEAGE WAS 105,357.   UPDATED 7/1/13 *CN UPDATED 07/17/2013 *JS",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "04/11/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511611,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLING RADIATOR FLUID AND NOW THE TRANSMISSION IS NOT WORKING CORRECTLY. *TR",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2013",
        "dateOfIncident": "04/24/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510390,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN XTERRA IS A VICTIM OF THE MANUFACTURING DEFECT WHERE THE COOLANT IN THE RADIATOR MIXES WITH THE AUTOMATIC TRANSMISSION FLUID, DUE TO A LEAK IN THE TRANSMISSION COOLER, CAUSING COMPLETE TRANSMISSION FAILURE.  MY TRANSMISSION SLIPS AND DRIVING IS ERRATIC, CAUSING UNSAFE DRIVING CONDITIONS.  THE REPAIR IS QUOTED AT $6,000 DOLLARS AND IS NOT CONSIDERED A RECALL ITEM.  NISSAN HAS EXTENDED COVERAGE ON VEHICLES UP TO 100,00 MILES ONLY, BUT THIS IS STARTING TO HAPPEN TO NEWER VEHICLES OVER 100,00 MILES. A RADIATOR REPLACEMENT WOULD HAVE PREVENTED THIS PROBLEM.  THIS IS A SERIOUS PROBLEM THAT NEEDS TO BE ADDRESSED SOON!  *TR",
        "vin": "5N1AN08W58C"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "04/23/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509285,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE SENSOR LEAKS AND DOES NOT WORK PROPERLY.  *TR",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2013",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502009,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DRIVE IN HWY MY LIGHT FUEL ON WHEN I SURE WE HAVE GAS  MANY TIMES HAPPEN AFTER.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/29/2012",
        "dateOfIncident": "11/17/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10486416,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT A VEHICLE FAILED TO YIELD AT THE RED LIGHT AND PROCEEDED TO CRASH INTO THE CONTACTS DRIVERS DOOR. THE DRIVER FRONTAL AIR BAG FAILED TO DEPLOYED; HOWEVER, THE DRIVERS FRONTAL AIR BAG LIGHT INDICATED THAT THE AIR BAG DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE LEFT SHOULD, ELBOW, BACK AND HIP. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 60,000.",
        "vin": "5N1AN08W08C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "10/29/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485231,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 NISSAN XTERRA (4X4 4.0L 6CYL 5 SPEED AUTOMATIC TRANSMISSION) WITH VEHICLE MILEAGE OF 114K. IM THE SOLE OWN OF THE VEHICLE. IN LATE OCTOBER OF 2012 I HAD TO HAVE THE RADIATOR REPLACED ALONG WITH THE TRANSMISSION, DUE TO THE A INTERIOR CRACK IN THE RADIATOR CAUSING THE COOLANT TO LEAK INTO THE LINES OF THE TRANSMISSION FLUID. THIS RESULTED INTO COMPLETE DISASTER, AS MY VEHICLE WAS  NOT SHIFTING PROPERLY, THE TRANSMISSION BEGAN TO SLIP IN WHICH THE TRANSMISSION HAD TO BE REPLACED ALONG WITH THE RADIATOR . THE TWO MIXED FLUIDS INSIDE THE TRANSMISSION APPEARED COFFEE MIXED WITH CREAM LIKE, THE COLOR WAS A CREAMY/LIGHT BROWNISH INSIDE THE TRANSMISSION. I'M WRITING TO YOU IN HOPES THIS CAN ASSIST TOWARDS THE ON GOING INVESTIGATION AND IN HOPES OF A REIMBURSEMENT WITH MY TOTAL REPAIR COSTS& RENTAL COSTS, OR A VEHICLE REPLACEMENT. I HOPE MY STORY HELPS THE HUNDREDS OF OTHERS WHO HAVE SIMILARLY BEEN AFFECTED IN THE COSTLY MATTER.  THANKS  *TR",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466002,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 NISSAN XTERRA. THE CONTACT STATED THAT HE NOTICED A FILM OF OIL ON THE  REAR BRAKE SHIELDS. LATER WHILE UTILIZING THE EMERGENCY BRAKE, THE BRAKE FAILED TO ENGAGE AND THE VEHICLE ROLLED DOWN A HILL. THE CONTACT THEN ATTEMPTED TO LOCK THE BRAKES BY DRIVING THE VEHICLE AT 10 MPH AND PUTTING THE VEHICLE IN NEUTRAL, THEN PULLING THE EMERGENCY BRAKES BUT TO NO AVAIL. THE CONTACT NOTIFIED TWO SEPARATE DEALERS AND NEITHER OFFERED ANY ASSISTANCE. THE CONTACT BELIEVED THAT THE  REAR AXLE ASSEMBLY WAS LEAKING GEAR OIL FROM THE RIGHT AND LEFT HAND AXLE SEALS. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 88,600.",
        "vin": "5N1AN08W78C"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465292,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 65 MILES PH AND SUDDENLY MY CAR SLOWED DOWN TO 40 MILES PH AND I WAS VERY LUCKY NOBODAY WAS RIDING MY BUTT I HAD TO EXIT THE HWY AND PULL OVER.  *TR",
        "vin": "5N1AN08U98C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "02/09/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446868,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COOLING SYSTEM IS CONTAMINATED W/OILY SUBSTANCE, TRANSMISSION FLUID. TRANS. IS MAKING LOUD NOISES, JUMPS OUT OF GEAR @ HWY SPEEDS, DRIVE TRAIN MAKING A 'RUMBLY' GRINDING SOUND, CAR DANGEROUSLY PULLS DOWN VERY QUICKLY TO MUCH LOWER SPEED WHEN PRESSURE RELEASED FROM ACCELERATOR. *TR",
        "vin": "CAR NOT AVA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2011",
        "dateOfIncident": "10/25/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434866,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE SOON LIGHT CAME ON WHILE DRIVING ON RESIDENTIAL STREETS. HAD CODE CHECKED. CODE LISTED AS P0462. CLEARED CODE THEN RESTARTED CAR. UPON STARTING CAR NONE OF THE GAUGES WORKED ONLY THE TACHOMETER AND SPEEDOMETER WORKED. FUEL, TEMPERATURE, OIL, ODOMETER, TRIP ODOMETER AND ALL WARNING LIGHTS TO INCLUDE TURN SIGNAL INDICATORS DID NOT WORK. UPON DRIVING GAUGES WOULD REGAIN POWER, BUT THE FUEL GAUGE DID NOT FUNCTION PROPERLY. TOOK VEHICLE TO DEALER. SEEMS THAT MY VIN WAS NOT INCLUDED IN THE RECALL # 10V075000, EVEN THOUGH THE EXACT RECALL REPAIR WAS DONE TO MY CAR TO FIX THIS ISSUE. WHILE THE FUEL GAUGE NOW WORKS, NONE OF MY OTHER GAUGES WORK. I WAS TOLD THE COMBO METER THAT CONTROLS MY CLUSTER OF GAUGES WOULD NEED TO BE REPLACED. THERE WERE NO ISSUES WITH MY VEHICLE UNTIL THE SERVICE ENGINE SOON LIGHT CAME ON. MY VEHICLE SHOULD HAVE BEEN INCLUDED IN THE RECALL STATED ABOVE, AND I FIND IT HIGHLY SUSPECT THAT ALL OF MY GAUGES GO OUT AT THE EXACT SAME TIME, BUT ACCORDING TO NISSAN THESE ARE TWO SEPARATE UNRELATED ISSUES. I HAVE HAD TO PAY $488 TO REPAIR WHAT SHOULD HAVE BEEN COVERED UNDER THE RECALL, AND NOW NEED TO PAY AN ADDITIONAL $590 TO REPAIR MY GAUGES. MY VEHICLE SHOULD HAVE BEEN INCLUDED IN THE RECALL FOR OTHER 08 NISSAN XTERRAS.  *TR",
        "vin": "5N1AN08U08C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/01/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 08 NISSAN XTERRA THE VDC/SLIP/ENGINE/TIRE PRESSURE/ AND AIR BAG LIGHTS ARE ON. THE ENGINE SEEMS TO BE STALLING AT TAKE OFF. THE FUEL INDICATOR IS NO LONGER WORKING AND HAD MADE ATTEMPTS TO GET THIS FIXED AND THE DEALERSHIP SAID IT WASN'T ON MY VEHICLE. I DON'T THINK THE NISSAN DEALERSHIP IS HANDLING THEIR RESPONSIBILITY TO FIX THESE VEHICLE. THERE IS SO MUCH GOING WRONG WITH MY VEHICLE FOR IT TO BE THREE YEARS OLD. THE ENGINE STALLING SEEMS TO BE AT LOW SPEEDS AND IS POTENTIALLY THE MOST DANGEROUS. *TR",
        "vin": "5N1AN08UX8C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/09/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389666,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, WITH JUST OVER 19,000 MILES ON MY 2008 XTERRA , I HAD TO REPLACE MY FRONT BRAKE PADS AND ROTORS. BOTH ROTORS WERE BADLY GROOVED ESPECIALLY ON THE INSIDE SURFACE AND THE INSIDE PADS WERE NEARLY COMPLETELY WORN. I HAD JUST HAD THE VEHICLE INSPECTED 2 MONTHS AGO AT MY NISSAN DEALERSHIP AND THEY REPORTED NO PROBLEMS. IT MAKES ME WONDER HOW MY INSPECTION WAS REALLY DONE AND ALSO THE QUALITY OF THE PARTS THAT NISSAN IS USING IN IT CARS, AS I HAVE OWNED SEVERAL CARS AND HAVE NEVER HAD TO REPLACE BREAK PADS MUCH LESS ROTORS UNDER 20,000 MILES. I ALSO EXPERIENCED THE DIFFICULTIES WITH THE TIRE PRESSURE SENSORS. TWO OF THEM HAD TO BE REPLACED DUE TO LEAKING AIR. I ALSO HAD READINGS OF LOW PRESSURE WHEN THE TIRES HAD JUST BEEN INFLATED TO THE PROPER SETTING AND THE LIGHT REFUSED TO TURN OFF. AFTER SEVERAL DAYS I TOOK IT TO THE DEALERSHIP AND THEY SAID MY TIRES WERE JUST UNDER INFLATED. I DID NOT BELIEVE THEIR EXPLANATION.  *TR",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378060,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 4 TIRE PRESSURE MONITORING SYSTEM VALVES (TPMS) FAILED ON THE SAME DAY ACCORDING TO THE DEALER. THE DEALER STATED THE FAILURE OF THE TPMS VALVES IS A KNOWN PROBLEM WITH 2008 NISSAN XTERRAS. THE FAILURE OF THE TPMS VALVE POSES A SIGNIFICANT SAFETY ISSUE EITHER BY MISLEADING SOMEONE TO BELIEVE A TIRE IS GOING FLAT OR BY NOT ALERTING THE DRIVER A TIRE IS GOING FLAT.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,EQUIPMENT,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2010",
        "dateOfIncident": "12/16/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370994,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VDC AND SLIP LIGHT ARE CONSTANTLY ON WHEN THE BATTERY HAS EITHER DIED, OR HAS BEEN DISCONNECTED.  ONCE THE BATTERY IS DISCONNECTED THE VDC IS OFF AND THE SLIP SYSTEM IS OFF AS WELL.  AFTER THE BATTERY WAS DISCONNECTED ONCE AGAIN THE VDC, SLIP SYSTEM, AND NOW MY AIR BAG LIGHT IS NOW CONSTANTLY FLASHING AND ILLUMINATED.  I'VE RESEARCHED THIS PROBLEM AND THERE ARE HUNDREDS OR THOUSANDS THAT HAVE THIS SAME PROBLEM.  IN THE OWNERS MANUAL IT GIVES YOU A VERY VAGUE DESCRIPTION OF HOW TO RESET THIS LIGHT.  I'VE TAKEN IT TO THE MANUFACTURE TO BE RESET, THEY SAY IT'S THE VEHICLE'S STEERING ANGLE SENSOR THAT HAS TO BE RESET, EVERYTIME YOU DISCONNECT THE BATTERY, BATTERY DIES, ALTERNATOR GOES OUT, ETC.  IT'S $100+ EVERYTIME YOU HAVE TO HAVE IT RESET.  SURELY THIS MALFUNCTION IN THEIR ELECTRICAL SYSTEM IS NOT SAFE, ESPECIALLY IF IT MEANS NOW MY AIRBAGS WON'T DEPLOY.  *TR",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2010",
        "dateOfIncident": "03/02/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367189,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR NISSAN XTERRA WAS RECALLED FOR THE FUEL GAUGE DEFECT IN MARCH 2010. IT IS NOW NOVEMBER 2010 AND NEITHER THE DEALER NOR NISSAN USA HAVE BEEN RESPONSIVE TO OUR RESPONSE TO THEIR RECALL.  WE HAVE CONTACTED THE DEALER THREE TIMES, AND NISSAN USA ONCE WITHOUT ANY RESULTS. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/20/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357061,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER AIR BAG ACTIVATION LIGHT IS INTERMITTENTLY SIGNALLY OFF WHEN PASSENGER IS SEATED.  USUALLY OCCURS ON RESTART DURING LONG DISTANCE TRIPS.  NISSAN REPAIR CAN NOT DUPLICATE.  CUSTOMER SERVICE IS PURPOSELY TIME CONSUMING, PLAYS DUMB AND GENERALLY RUDE.  THIS FAILURE OCCURS ON 30% OF OUR LONG TRIPS.  THIS IS A SAFETY ISSUE, MY NISSAN IS NOT MEETING MINIMUM SAFETY REGULATIONS A LARGE PART OF THE TIME.  THIS ALSO HAPPENED IN A NISSAN RENTAL PROVIDED  RECENTLY.  NISSAN EMPLOYEES TRY TO INSTRUCT CUSTOMERS ON HOW TO SIT DURING DISCUSSIONS.....TRULY FRUSTRATING... *TR",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2010",
        "dateOfIncident": "06/20/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENDING UNIT FAILURE HIGH LEVEL SENSOR HIGH CURRENT. *TR",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "03/20/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENSOR ON MY 2008 NISSAN XTERRA IS BROKEN.  I HAVE NO WAY OF KNOWING HOW MUCH GAS IS IN MY TANK.  IT HAS OCCURRED OVER THE PAST FEW MONTHS.  SOMETIMES THE TANK WILL READ EMPTY OR OTHER VALUE.      THE DEALER WILL NOT REPAIR UNDER A WARRANTY, EVEN THOUGH THE CAR IS LESS THAN 3 YEARS OLD!  I AM PAYING OUT OF POCKET TO REPAIR THE VEHICLE AT THE DEALER. *TR",
        "vin": "5N1AN08W58C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "04/07/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325056,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65 MPH, THE ENGINE SUDDENLY STOPPED.  NO WARNING LIGHTS WERE ILLUMINATED PRIOR TO THE FAILURE.  GAS, TEMP., AND OIL PRESSURE WERE ALL NORMAL.  A PRIVATE GARAGE DIAGNOSED THE PROBLEM AS A FAILURE IN THE INTELLIGENT POWER DISTRIBUTOR MODULE (IPDM), AND ALSO THE MASS AIR FLOW SENSOR.  BOTH PARTS WERE REPLACED (AT MY EXPENSE) AND THE CAR NOW RUNS WELL. *TR",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "02/18/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317238,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AN '08 NISSAN XTERRA S WITH ONLY 17,000 MILES, THE RIGHT FRONT INNER BRAKE PAD WAS COMPLETELY WORN DOWN AND MADE METAL TO METAL CONTACT WITH ROTOR, RUINING THE ROTOR. THE VEHICLE WAS PULLING BADLY TO THE RIGHT WHEN THE BRAKES WERE APPLIED. ONLY THE INNER PADS WERE AFFECTED,THE OUTER BRAKE PADS LOOKED LIKE NEW, SHOWING THAT THE BRAKE CALIPER WAS STUCK ON THE BRACKET. TOOK TO DEALER AND THEY TOLD ME THAT THE 2 INNER PADS, LEFT AND RIGHT,  WERE STUCK IN THE BRACKET, WHICH STOPS THE CALIPER FROM FLOATING OR MOVING. AT 17,000 MILES THIS SHOULD NOT HAPPEN AND IS A POTENTIALLY DANGEROUS PROBLEM. NISSAN HAS REFUSED TO REPAIR UNDER WARRANTY AND REFUSES TO ACKNOWLEDGE THAT MY INVOICE SAYS \"BOTH INNER PADS STUCK IN CALIPERS\". *TR",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2010",
        "dateOfIncident": "02/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312320,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A 2008 NISSAN XTERRA. IT WAS FEBRUARY 15,2010 AND I WAS LETTING MY WIFE OUT OF THE CAR NEAR THE STORE, THE CAR WAS IN DRIVE AND MY FOOT WAS ON THE BREAK. SUDDENLY BEFORE MY WIFE WAS TOTALLY OUT OF  THE  CAR IT LUNGED FORWARD AND THE ACCELERATOR ON ITS OWN STARTED REVVING UP AND THE CAR WAS MOVING FORWARD. I PUT THE CAR IN NEUTRAL AND IT WAS REVVING AT A VERY HIGH RPM. I PUT THE CAR IN PARK AND IT SHUT IT OFF.    I TOOK THE CAR TO THE DEALER BUT THEY COULD NOT FIND ANY PROBLEM. THEY SAID THERE WERE NO RECALLS OR MEMO'S ABOUT THE PROBLEM.  MY SON SAID SOMETHING LIKE THAT HAPPENED TO HIM ONCE BEFORE BUY NOT AS SERIOUS.    IT WAS THE FIRST TIME IT EVER HAPPENED TO ME. *TR",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "10/29/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308567,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 NISSAN XTERRA WITH 8,000 MILES. CLUTCH BURNED OUT WHILE DRIVING.  CLUTCH REPLACED. NISSAN CLAIMS NOT UNDER WARRANTY. *TR",
        "vin": "5N1AN08W38C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2010",
        "dateOfIncident": "02/28/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299832,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE CLUTCH FAILURE AT 21K MILES WHICH STRANDED MY FAMILY. WEB SEARCH SHOWS MANY NISSAN XTERRA AND PICKUP OWNERS WITH 6 SPEED MANUAL TRANS EXPERIENCING SAME FAILURE AT AN AVG OF 18K TO 25K MILES. CLUTCH/TRANS IS ADAPTED FROM THE 350Z AND CLEARLY UNDER-DESIGNED FOR THE MUCH HEAVIER XTERRA AND P/U. DEALER AND NISSAN WON'T COVER REPLACEMENT OR OFFER UPGRADE. HAVE BEEN DRIVING OTHER MANUAL TRANS CARS AND TRUCKS FOR MANY YEARS WITH ZERO CLUTCH FAILURES AFTER 150K MILES AND MORE. WE ARE CLOSE TO 40K MILES AND EXPECT ANOTHER CLUTCH FAILURE SOON, AND CANNOT RISK TAKING A TRIP AND BEING STRANDED OR AFFORD $3K TO FIX IT AGAIN. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/28/2009",
        "dateOfIncident": "12/13/2009",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297108,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC TRAY THAT THE BATTERY SITS ON BROKE, CAUSING THE BAR THAT HOLDS THE BATTERY IN PLACE TO ARCH OVER AND SET THE PLASTIC FUSE HOLDER ON THE BATTERY TO CATCH FIRE.  THE VEHICLE STALLED THE DIED. I SAW WHAT I THOUGHT WAS \"STEAM\" COMING FROM UNDER THE HOOD. I POPPED TO HOOD FROM INSIDE AND SAW FLAMES.  I GOT OUT AND TRIED TO OPEN THE HOOD, WHICH IS VERY DIFFICULT SINCE THE LATCH IS SMALL AND BLACK.  I GOT MY GRANDKIDS OUT OF THE CAR AND TRIED ONCE MORE TO OPEN THE HOOD.  I FINALLY GOT IT OPENED AND REALIZED THE BATTERY WAS ON FIRE.  I POURED THE ONLY LIQUID I HAD ON IT, \"A&W CREAM SODA\" AND PUT OUT THE FIRE.  IT TOTALLY MELTED PART OF THE BATTERY AND THE BATTERY CONNECTOR.  AMAZING ENOUGH THE VEHICLE STARTED AND I WAS ABLE TO DRIVE HOME.  HAD I NOT BEEN ABLE TO OPEN THE HOOD, THE VEHICLE WOULD HAVE BURNT TO THE GROUND ALL BECAUSE OF THE CHEAP PLASTIC BATTERY HOLDER BROKE. *TR",
        "vin": "5N1AN08U08C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/18/2009",
        "dateOfIncident": "10/15/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288848,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 NISSAN XTERRA CLUTCH FAILURE.    2008 NISSAN XTERRA, NEVER TAKEN OFF ROAD AND EXPERIENCED MANUAL TRANSMISSION DRIVER BEHIND THE WHEEL. THE 6SPD MANUAL CLUTCH OF THIS VEHICLE HAS FAILED AT 29,000 MILES AND 2 YEARS OF ON THE ROAD DRIVING. THIS HAPPENED GOING UP A SNOWY HILL AND I WAS STRANDED ALMOST SLIDING DOWN OFF A RAVINE. AFTER RESEARCH IT IS VERY APPARENT THAT THIS IS A MAJOR ISSUE WITH THIS MODEL ALL DRIVERS REPORTING EXACT SAME PROBLEMS. NISSAN WILL NOT ASSUME RESPONSIBILITY FOR A DEFECTIVE OR UNDER DESIGNED COMPONENT OF THE MAJOR DRIVE TRAIN. NISSAN WILL NOT RECALL OR WARRANTY THIS COMMON AND DANGEROUS FAILURE. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285891,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS IN MY SUV DIDN'T DEPLOY WHEN I GOT IN ACCIDENT DRIVING @45MPH FRONT IN WRECK TWICE AND NEITHER TIME IT CAME OUT. *TR",
        "vin": "5N1AN08U38C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "10/08/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284163,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE NISSAN DEALERS ARE UNABLE TO REPAIR A SAFETY PROBLEM ON MY CAR AFTER 4 ATTEMPTS.  VEHICLE DYNAMIC CONTROL AND ABS FAIL WARNING LIGHTS CONTINUE TO COME ON RANDOMLY.  OCCASIONALLY THEY GO OFF FOR A PERIOD OF TIME BUT THE FIRST 4 EVENTS LIGHTS REMAINED ON UNTIL THE DEALER WORKED ON THE CAR.  NISSAN IS STALLING IN ADDRESSING VEHICLE BUYBACK OR ANY SOLID RESOLUTION.  I AM STUCK WITH A CAR I CANNOT DRIVE SAFELY AT THIS TIME, AND HAVE ASKED NISSAN TO TAKE IT BACK SINCE THEY CANNOT FIX IT IN OVER A YEAR.  *TR",
        "vin": "5N1AN08W68C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/28/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282173,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 NISSAN XTERRA. HE RECEIVED RECALL NOTICE # 08V690000 FOR THE AIR BAGS: FRONTAL. A TECHNICIAN STATED THAT BECAUSE OWNERSHIP CHANGED THEY WOULD NOT BE ABLE TO REPAIR THE VEHICLE FOR SIX WEEKS. A DELAY IN HAVING THE VEHICLE REPAIRED HAS INCREASED HIS RISK IF THE AIR BAGS FAIL TO DEPLOY. HE ATTEMPTED TO SCHEDULE AN APPOINTMENT WITH ANOTHER DEALER; HOWEVER, THEY ARE TOO FAR AWAY AND HIS MEDICAL CONDITION MAKES IT DIFFICULT TO TRAVEL. THE MANUFACTURER HAS NOT PROVIDED HIM WITH ANY ASSISTANCE. THE FAILURE AND CURRENT MILEAGES WERE 30,000.",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/18/2009",
        "dateOfIncident": "08/17/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10280920,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE THAT MY AIRBAG DEPLOYED ON IT'S OWN FOR NO APPARENT REASON RESULTING IN KNOCKING ME UNCONSCIOUS THEREBY CAUSING AN ACCIDENT. *TR",
        "vin": "5N1AN08U08C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275467,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOME OF THE SCREWS THAT HOLD THE WIND DEFLECTOR AND ROOF RACK ON THE ROOF JUST SPIN. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/07/2009",
        "dateOfIncident": "04/18/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267918,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SIDE CURTAIN AIRBAGS DEPLOYED AND DRIVER AND FRONT PASSENGER SEATBELTS LOCKED UP. VEHICLE WAS TRAVELING OVER A GRAVEL ROAD. IT WAS LOADED UP BUT NOT HEAVILY WEIGHTED. SPEED WAS ABOUT 5MPH. *TR",
        "vin": "5N1AN08W88C"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES, ELECTRIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2009",
        "dateOfIncident": "08/29/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259477,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 NISSAN XTERRA, CHRONIC FAILURES OF THE VDC TRACTION CONTROL SYSTEM, ALSO CAUSING FAILURES IN ABS AND AIR BAGS  7 REPAIR ATTEMPTS SINCE PURCHASED NEW 6 MONTHS AGO INCLUDING COMPUTER REPROGRAMMING, BATTERY REPLACEMENT, STEERING ANGLE SENSOR ADJUSTMENTS, REPLACEMENT OF AIR BAG CONTROL MODULE AND REPLACEMENT OF ABS CONTROL MODULE.    THESE FAILURES CAUSE TOTAL FAILURE IN MULTIPLE ELECTRONIC SAFETY SYSTEMS REPRESENTING A SERIOUS THREAT TO LIFE OR BODILY HARM.    MULTIPLE INCIDENTS - THE DATE BELOW REPRESENTS DATE OF BRAND NEW PURCHASE WHICH WAS THE DAY OF THE FIRST MALFUNCTION FOR ME.  THE DEALERSHIP NOTICED A MALFUNCTION AT THE TIME OF THE PDI (BUT DID NOT DISCLOSE THIS AT THE TIME OF SALE TO MY GREAT OUTRAGE). *TR",
        "vin": "5N1AN08W18C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236898,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS GAUGE READS ABOUT 1/8 OF A TANK AND MY TRUCK RUNS OUT OF GAS BEFORE THE LOW FUEL LIGHT COMES ON. THEY FIXED THE PROBLEM EACH TIME BUT THEN A FEW WEEKS LATER I ENDED UP HAVING THE SAME PROBLEM, THE DIAGNOSIS WAS THE FUEL SENDING UNIT THEY REPLACED THAT AND THEY ALSO REPLACED THE FUEL PUMP ON THE LAST 2 OCCASIONS. I HAVE HAD THIS PROBLEM 3 TIMES SINCE 06/13/08 THE MOST RECENT TIME WAS ON 07/23/08. *TR",
        "vin": "5N1AN08W98C"
    },
    {
        "components": "EQUIPMENT,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2008",
        "dateOfIncident": "01/09/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I WAS DRIVING MY CAR AND THE VDC/AIRBAGS/SLIP LIGHTS CAME ON IN MY 2008 NISSAN XTERRA SE.  I TOOK THE VEHICLE TO NISSAN DEALERSHIP AND THEY ADVISED THAT THE HUB SENSOR WAS BAD AND NEEDED REPLACED.  *TR",
        "vin": ""
    }
]