[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362577,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKY FUEL LINES TOWARD THE LEFT REAR WHEEL WELL. LARGE PUDDLES OF GASOLINE UNDER THE CAR WHEN PARKED. VISIBLE GAS LEAK",
        "vin": "1G2AN18B287"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323239,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LEAKS GAS TOWARD FRONT OF CAR DRIVER SIDE AFTER IT HAS BEEN RUNNING. IT ALSO HAS AN ODOR OF GAS RADIATING AROUND THE CAR AFTER IT HAS BEEN RUN. THIS CAR HAS BEEN RECALLED FOR THIS PROBLEM IN REGIONALLY HOT STATES. GM ALAN ADLER SAID THEY WOULD REPAIR CARS THAT HAS THE PROBLEM OUTSIDE OF THE DESIGNATED STATES, BUT PONTIAC REFUSES. SEE ATT.",
        "vin": "1G2AL18F487"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "04/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11322036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN TOWN AROUND OTHER VEHICLES NAMELY THOSE WITH BRIGHT LIGHTS AND AT STOP LIGHTS. IT FELT AS THOUGH THERE WAS A TON OF PRESSURE INSIDE MY VEHICLE ALMOST LIKE THE THE WINDOWS WERE GOING TO EXPLODE. IM NOT SURE HOW TO EXPLAIN IT MAYBE A GRAVATAIONAL DOWNWARD PULL? ALMOST LIKE A CHEMICAL BURN FROM THE BRIGHTNESS OF OTHER HEADILGHTS AND THE VEHICLE MIRRORS MIXED CHEMICAL NOMENCLATURE WERE HAVING A BAD REACTION. THIS CAUSED ME TO BECOME AWARE OF AN ISSUE. I TOOK THE VEHICLE IN AND HAD THE BATTERY TESTED NOTICING THE BATTERY WAS LOCATED IN THE TRUNK WITH NO PROTECTION SURROUNDING THE BATTERY AND WIRES SEMI EXPOSED PLACED NEXT TO FUSES AND SHEET METAL. WHO DESIGNES THINGS LIKE THAT? THATS A DISASTER WAITING TO HAPPEN. TODAY MY HEAD STILL HURTS AND I WILL BE SEEKING A MEDICAL PROFESSIONAL.",
        "vin": "1G2AL18F087"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315825,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING CUT OUT WHEN TURNING A CORNER. WHEN DRIVING STRAIGHT AHEAD, THE STEERING SEEMS FINE. WHEN TURNING RIGHT OR LEFT TO GO AROUND A CORNER, THE STEERING WHEEL DOES NOT EASILY TURN BACK TO THE STRAIGHT AHEAD POSITION. I WAS DRIVING ON A CITY STREET AT 30 MPH AND SLOWED TO MAKE A RIGHT HAND TURN, AND WHILE TURNING L FELT THE POWER STEERING GIVE OUT WHEN TRYING TO COME OUT OF THE TURN.",
        "vin": "1G2AL18F587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD RECALL FOR THE IGNITION SWITCH. GOT IT REPLACED NOW THE KEY BROKE OFF IN IT",
        "vin": "1G2AL18F887"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257928,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAGS SHOWS ON DASH ON STARTUP, BOUGHT THIS WAY FROM HOLZ CHEVY IN HALES CORNERS, WI. WAS TOLD IT WAS A NON ISSUE. ELECTRICAL- CHANGES FROM RADIO TO AUX RANDOMLY, THE BACK SPEAKERS WORK CONSTANTLY, THE DRIVER SIDE NEVER WORKS AND THE PASSENGER SIDE WORKS ON OCCASION (IF YOU HIT A POT HOLE HARD ENOUGH IT'LL GO ON/OFF). FUEL- FUEL LINE WAS LEAKING FROM DRIVER SIDE, IN FRONT OF REAR WHEEL. RIGHT BY THE HEAT SHIELD.",
        "vin": "1G2AL18F287"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 G5 HAS A STRONG GAS SMELL BOTH INSIDE AND OUTSIDE THE CAR. I CHECKED FOR RECALLS AND SAW THAT 2008 G5'S HAVE BEEN RECALLED FOR A FUEL LEAK DUE TO A DEFECTIVE FUEL PUMP MODULE BUT ONLY IN HOTTER STATES. I'M IN SC AND WE CERTAINLY SHOULD QUALIFY AS A HOTTER STATE WITH TEMPS IN THE UPPER 90'S IN THE SPRING. GM RECALLED THE '06 AND '07 G5'S IN SC FOR FUEL LEAKS SO THEY SHOULD RECALL THE '08 MODEL TOO SINCE IT HAS THE SAME PROBLEM (RECALL 09V-419) MY CAR HAS ONLY 31,903 MILES ON IT SO I SHOULD NOT BE STUCK WITH THE COST OF REPAIRING AN ONGOING FUEL LEAK PROBLEM THAT GM HAS HAD WITH '06-'08 MODELS. MY MOTHER BOUGHT THIS CAR NEW FROM THE DEALERSHIP AND IT HAS BEEN GARAGE KEPT AND DRIVEN VERY LITTLE. GM SHOULD REPAIR ALL THE 2008 G5'S THAT ARE LEAKING FUEL, NOT JUST THE ONES IN A SELECT FEW STATES. FUEL LEAKS ARE DANGEROUS AND COULD RESULT IN A FIRE IN ANY STATE.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED TO SMELL A STRONG FUEL ODOR IN GARAGE. NOTICED ABOUT A FOOT IN FRONT OF THE DRIVER SIDE REAR TIRE DRIPPING GASOLINE FROM FUEL LINE NEXT TO THE PLASTIC CLIP THERE. THIS IS VERY CLOSE TO THE EXHAUST PIPE AND VERY DANGEROUS. WENT ONLINE AND SAW SEVERAL SIMILAR COMPLAINTS ABOUT THIS ISSUE AND HOW THERE WAS AN ASSOCIATED RECALL BUT ONLY FOR 5-6 STATES. NOT SURE WHY ONLY THESE STATES WERE LISTED BUT IN LINE WITH MANY OF THE OTHER COMPLAINTS THE PLASTIC CLIP HOLDING THOSE FUEL LINES WAS HOLDING SALT AND BRINE OF THE WINTER MONTHS AND CAUSING CORROSION AT THAT SPOT. TAKING THE CAR IN TO A DEALER TO HAVE IT LOOKED AT AND AM FULLY EXPECTING TO HAVE TO REPLACE THE WHOLE FUEL LINE AT $600-1000 SIMILARLY TO THE OTHER COMPLAINTS I SAW. IF THIS ISSUE WAS ALREADY RECALLED FOR SOME STATES THEN IT NEEDS TO BE RECALLED FOR ALL OF THEM AS IT IS CLEARLY AN ONGOING AND PERSISTENT ISSUE.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN PASSENGER SIDE SEATBELT RETRACTOR.  BROKEN SEATBELT RETRACTOR= AIRBAG NOT WORKING=DEATHTRAP.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. PERIODICALLY, THE CONTACT NOTICED AN ODOR OF FUEL INSIDE THE VEHICLE AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE ODOR WENT AWAY. WHEN THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR ROUTINE SERVICE, THE TECHNICIAN DIAGNOSED A FUEL LEAK IN AN UNKNOWN PART OF THE VEHICLE AND RECOMMENDED THAT THE FUEL LINES BE REPLACED. THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 90,915.",
        "vin": "1G2AL18F687"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SPEEDS UP WITHOUT PRESSING THE GAS PETAL AND IT'S HARD TO STOP IT WHEN IN MOTION  ON INTERSTATE IT STOPPED OUT OF NOWHERE AND TURNED OFF WITH AN 18 WHEELER BEHIND ME LIKE TO HAVE KILLED ME GOT CAR IN NEUTRAL FINALLY FORCEFULLY PRAYING THAT JESUS PROTECT ME BECAUSE IT WOULD NOT SHIFT INTO GEAR AND PULLED OVER TO SIDE OF ROAD. I'M SCARED TO DRIVE MY CAR.   DRIVING DOWN ROAD STEERING WHEEL LOCKS UP CAUSES ENGINE TO SHAKE WHOLE CAR AND BACKFIRES MY CAR RIDES REALLY ROUGH. MESSED UP POWER STEERING HAS CAUSED MY BLINKERS NOT TO WORK NOW. I'M REALLY SAD. THE ENGINE LIGHT COMES ON EVERY TIME I PUT GAS IN MY CAR. THE TRANSMISSION ACTS UP AND WHEN DRIVING MY CAR IT'S LIKE IT DOESN'T KNOW WHAT GEAR IT SHOULD BE IN SO IT JERKS REALLY BAD.",
        "vin": "1G2AL18F687"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE26TH OF JUNE 2018 I WAS LEAVING WORK WHEN ALL IF A SUDDEN WHEN I STARTED IT UP THERE WAS BAD KNOCKING COMING FROM ENGINE WHEN INCREASING RPM'S. I TOOK IT TO MECHANIC AND REQUESTED MY OIL TO BE CHANGED AND TO CHECK WHY IT WAS KNOCKING. AT THAT POINT I WAS TOLD THERE WAS METAL SHAVINGS IN THE OLD OIL AS WELL AS FILTER. I WAS SHOWN THIS BY THE MECHANIC. HE STATED BERRINGS WERE GOING AND I WOULD HAVE TO REBUILD OR REPLACE THE ENGINE. CONFIRMED BY ANOTHER MECHANIC. UPON RETURNING HOME ABOUT 30 MIN LATER I NOTICED FRESH OIL UNDER MY CAR. I TOOK IT BACK AND WAS SHOWN A MAJOR OIL LEAK AT THE TIMING CHAIN COVER. TURNS OUT THE BOLT CAME LOOSE. HE TIGHTENED AND OIL STOPPED LEAKING. THIS WAS PROBABLY THE CAUSE OF BEARINGS GOING OUT. THIS WAS A SUDDEN ISSUE AND NOT OVER A PERIOD OF TIME. THE CAR HAS 45K ORIGINAL MILES ON IT. HOW CAN THIS BE? 10 YEARS OLD BUT ONLY 45K MILES.",
        "vin": "1G2AL18F287"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS LEAKING G FUEL BY DRIVERS DOOR AND TIRE.MY CAR WAS IN THE RECALL BUT NOT MY STATE. MAKES NO SENSE. MY CAR WAS A RENTAL FOR MANY YEARS BEFORE I BOUGHT IT . WHY IS MY VIN# NOT IN RECALL.. IF I BLOW UP SOMEONE WILL LET YOU KNOW. THANKS.",
        "vin": "1G2AL18F487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIRBAG LIGHT COMES ON RANDOMLY IN THE DIC WHILE DRIVING ON CITY STREETS AND HIGHWAYS.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HI! I NOTICED VERY STRONG GAS FUMES AFTER FILLING MY CAR WITH GAS. I TOOK THE CAR TO THE DEALER ON FRIDAY, SEPTEMBER 22, 2017 AND HAD THE FUEL PUMP REPLACED, AFTER FILLING MY CAR WITH A TANK OF GAS, I NOTICED STRONG FUMES IN THE CAR. I NOTICED THE FUEL NEEDLE WENT FROM 401 MILES TO 388.  I DROVE HOME PARKED MY CAR IN THE GARAGE MOMENTS LATER MY DAUGHTER ARRIVED HOME AND BEGAN COMPLAINING ABOUT THE STRONG GAS FUMES IN THE GARAGE AND GAS LEAKING UNDERNEATH MY CAR.  I GOT OUT OF BED WENT INTO THE GARAGE, THEN I SMELT HEAVY GAS FUMES AND SAW THE GAS ON MY GARAGE FLOOR.  I BACKED THE CAR OUT OF THE GARAGE AND LEFT THE GARAGE DOOR OPEN.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992865,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHILE ATTEMPTING TO SHUT OFF THE VEHICLE, THE KEY COULD NOT BE REMOVED FROM THE IGNITION SWITCH. THE CONTACT INDICATED THAT THE KEY TURNED ENOUGH TO SHUT THE ENGINE OFF, BUT DID NOT TURN ENOUGH TO SHUT OFF THE ELECTRONICS AND LIGHTS. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHERE IT WAS DIAGNOSED THAT THE IGNITION SWITCH WAS FAULTY. THE IGNITION SWITCH WAS REPLACED, BUT THE FAILURE RECURRED TWO MONTHS LATER. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND OIL WAS APPLIED TO THE IGNITION SWITCH. AFTER RETRIEVING THE VEHICLE, THE CONTACT DISCOVERED THAT THE FAILURE WAS STILL PRESENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1G2AL18F487"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/11/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971799,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT THE DAUGHTER STOPPED AT A STOP SIGN AND ATTEMPTED TO ACCELERATE THE VEHICLE FORWARD, THE VEHICLE THEN VIOLENTLY ACCELERATED CAUSING THE RPMS TO INCREASE EXCESSIVELY. THE DRIVER STEERED THE VEHICLE INTO A MEDIUM AND CRASHED HEAD ON IN ORDER TO AVOID CRASHING INTO OTHER VEHICLES. THE AIR BAGS DID NOT DEPLOY.  THE VEHICLE WAS TOWED TO A DEALER. THE CONTACT WAS UNABLE TO VERIFY IF A POLICE REPORT WAS FILED. THE DRIVER DID NOT RECEIVE ANY INJURIES. THE VEHICLE WAS CLEARED SAFE TO DRIVE BY THE DEALER HOWEVER THE FAILURE RECURRED AND IN ORDER TO STOP THE VEHICLE IT WOULD HAVE TO BE TURNED OFF. THE CONTACT TOOK THE VEHICLE TO THE DEALER AGAIN HOWEVER FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 143,000.",
        "vin": "1G2AL18F087"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE RUSTED OUT CAUSING FUEL LEAKAGE. THE BRACKET THAT HOLDS FUEL LINES ALSO RETAINS SALT AND BRINE DEPOSITS AND IS OF POOR DESIGN CAUSING FUEL LINES TO RUST THROUGH ONE SPOT ONLY. IT IS LOCATED A FOOT IN FRONT OF REAR DRIVER SIDE TIRE UNDERNEATH. ABOUT A INCH AWAY FROM EXHAUST. FUEL POURS OUT A STEADY DROP AND PUDDLES UNDERNEATH HOT EXHAUST. THIS IS NOT THE FUEL PUMP RECALL PROBLEM ALREADY LISTED. REPAIR COSTS $951.87 AT DEALERSHIP. LOOKING UNDERNEATH CAR ALL THE LINE WAS RUST FREE EXCEPT THIS FUEL BRACKET AREA. THIS IS VERY DANGEROUS TO HAVE FUEL LEAKING ON TO PAVEMENT AND UNDER HOT EXHAUST. AS GAS EVAPORATES ITS FUMES COULD START A FIRE. A PERSON MAY DRIVE FOR MANY MILES WITHOUT NOTICING THE FUEL LEAKING. THE GAS FUMES ENTER THE INSIDE OF CAR. IF A PERSON SMOKES THIS COULD ALSO CAUSE EXPLOSION ALL FROM POOR DESIGN AND NO RECALL TO REPLACE FUEL LINE AND BRACKET. THE FUEL LEAK IS CONSTANT STATIONARY, IN MOTION ON STREET AND HIGHWAY. THIS IS VERY DANGEROUS.",
        "vin": "1G2AL18F687"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC G5, APPROX. 77,000 MILES. FAILED ANNUAL INSPECTION DUE TO FUEL LEAK IN FUEL LINE, DRIVERS SIDE, REAR, JUST IN FRONT OF TIRE. CLOSE INSPECTION OF FUEL LINE, SHOWED IT TO BE THE FUEL RETURN LINE, THAT HAD RUSTED A SMALL HOLE DUE TO SHIELDING THAT WAS AROUND THE LINE IN THAT AREA RETAINING MOISTURE (SHIELDING WAS FIBERGLASS LOOKING IN APPEARANCE AND COVERED IN SILVER COVERING AND MOST LIKELY IS A HEAT SHIELD AS LIKE ARE ABOUT A FOOT FROM THE EXHAUST PIPE. THIS IS A POOR DESIGN AS IT RETAINS MOISTURE AROUND THE LINE CAUSING IT TO RUST. DEALER ESTIMATE TO REPAIR (REPLACING ENTIRE FUEL LINE WAS $700+. THIS APPEARS TO BE A COMMON ISSUE WITH THESE CARS (CHEVY AND SATURN VERSIONS TOO) SUGGEST DEALERS RECALL THESE CARS AND REPLACE WITH STAINLESS FUEL LINES IF LINES ARE RUSTY.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THIS USED CAR LAST YEAR AND I WAS NOT AWARE OF THE RECALL SYSTEM. RECENTLY I CHECKED THE NHTSA WEBSITE AND I SAW THE RECALL NUMBER 14E021000 FOR ELECTRICAL SYSTEM:IGNITION:SWITCH. I GOT THAT ONE FIXED BUT MY AIRBAG SYSTEM IS ALSO HAVE PROBLEM.   AS IT IS MENTIONED IN THE SUMMARY OF RECALL NUMBER 14E021000, THE ISSUE WITH SYSTEM:IGNITION:SWITCH CAN CAUSE AIR BAG ISSUES. I WAS WONDERING HOW CAN I TELL THE DEALER TO TAKE CARE OF THE AIRBAG SYSTEM FOR FREE BECAUSE THE SOURCE OF AIR BAG ISSUE SEEMS TO BE INITIATED FROM THE IGNITION PROBLEM.  (FOR WHEN DID THIS HAPPEN, I INSERTED 08/02/2015, THE APPROX TIME THAT I BOUGHT THE CAR. BECAUSE IT WAS LIKE THIS WHEN I GOT THE CAR.)",
        "vin": "1G2AL55F287"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHETHER DRIVING OR PARKED, THE VEHICLE LEAKED FUEL FROM THE TOP OF THE FUEL TANK.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 12V459000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT AIRBAG SENSOR IS FAULTY CAUSING THE AIRBAG LIGHT TO BE ILLUMINATED ON THE DASHBOARD & DOESN'T GO OFF. SENSOR WILLNOT DETECT SOMEONE SEATED, CAUSING THE AIRBAG NOT TO DEPLOY IF IN AN ACCIDENT. NOTHING CAUSED THIS TO HAPPEN & THEY WANT ABOUT $400 TO FIX IT. WE WERE SITTING STILL & A PASSENGER SAT ON THE SEAT. PUT SEATBELT ON & CK AIRBAG CAME ON & ON EVER SINCE.",
        "vin": "1G2AN18B887"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE NHTSA ID NUMBER10850549--LOSS OF LEFT FRONT SPEAKER CHIMES AND RADIO SOUND --OK AFTER BOTH SPEAKERS WERE REPLACED--AFTER A WHILE PROBLEM RETURNED INTERMITTENTLY ON THE LEFT FRONT SPEAKER AGAIN-- FINALLY HAD AN \"EPIPHANY\" AND REMOVED CORROSION ON THE HARNESS PIGTAIL CONNECTOR WHICH PUSHES ONTO THE LEFT  FRONT SPEAKER LUGS USING Q TIPS, SMALL SCREWDRIVER AND GREAT CARE USING CONTACT CLEANER LIQUID FROM A SMALL 2 OUNCE SPRAY CAN OF DEOXIT-D100 MADE BY CAIG LAB INC OF  POWAY, CAL.--WEBSITE WWW.CAIG.COM--I GOT MY CAN FROM YOU-DO-IT ELECTRONICS IN NEEDHAM MASS.-TEL:781-449-1005--SUGGESTION-AFTER REMOVING THE PIGTAIL CONNECTOR FROM THE SPEAKER PLACE AN OLD TOWEL BETWEEN THE PIGTAIL CONNECTOR AND  THE SPEAKER TO PREVENT OVERSPRAY FROM LANDING ON ANYTHING BUT THE PIGTAIL CONNECTOR--FORTUNATELY THE CAN HAS A METERED \"ONE SHOT\" TYPE SPRAY EVERY TIME YOU PRESS THE BUTTON ON THE CAN--AFTER WETTING THE HARNESS PIGTAIL CONNECTOR THOROUGHLY I PUSHED IT ONTO THE  LEFT SPEAKER CONNECTOR AND REMOVED IT AFTER WAITING SEVERAL MINUTES--THEN REPEATED THIS PROCEDURE SEVERAL TIMES----THAT WAS THE END OF THE PROBLEM!!  THE BIGGEST PROBLEM WAS THE NEED TO REMOVE THE LEFT FRONT DOOR PANEL TO GAIN ACCESS TO THE SPEAKER BUT IT WAS WELL WORTH IT SINCE I LISTEN TO THE RADIO A LOT. MOSTLY JAZZ!! GOOD LUCK",
        "vin": "1G2AL18F187"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT AFTER REFUELING THE VEHICLE, IT WOULD NOT START. AFTER SEVERAL ATTEMPTS FOR APPROXIMATELY 20 MINUTES, THE VEHICLE WAS ABLE TO START. THE CONTACT MENTIONED THAT THE IGNITION SWITCH WAS REPLACED IN 2014. THE FAILURE OCCURRED ON APPROXIMATELY SIX OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 122,000.",
        "vin": "1G2AL18F687"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "10/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL CHIMES HAVE STOPPED WORKING. FRONT SPEAKERS OUT AS WELL. NOTICED FOR THE LAST YEAR OR SO THAT WHEN THE SPEAKERS KICK OUT (MAKES NO DIFFERENCE IF DRIVING OR STATIONARY), THE CHIMES STOP WORKING. NO \"KEY IN THE IGNITION\" ALARM, NO TURN SIGNAL CLICKING, NO SEAT BELT ALARM, ETC. WHEN IT DOES WORK, EVERYTHING WORKS. WHEN IT GOES OUT, IT ALL GOES OUT AT ONCE. NOW I HAVE TO REPLACE THE TURN SIGNAL ASSY. BECAUSE THE INTERNAL WHITE PLASTIC PIECE THAT KICKS OFF THE TURN SIGNAL LIGHTS IS BROKEN.  I HAVE SEEN MANY POSTS FOR THE ALARM CHIME ISSUE FROM DIFFERENT BLOGS, BUT GM STILL INSISTS THEY HAVE NEVER HEARD OF THE PROBLEM. I AM NOW AT 99,765 MILES ON A 10 YEAR OLD CAR. I WOULD LIKE TO GET THIS FIXED.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE STEERING WHEEL SEIZED AND BECAME DIFFICULT TO MANEUVER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V073000 (STEERING). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 89,000.",
        "vin": "1G2AL18F787"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING SEEMS TO STALL OR STICK AFTER TURNING THE WHEEL. I HAVE TO STEER THE CAR BACK TO THE FRONT OR IT JUST STAYS TURNING POSITION. THE STEERING DOES NOT COME BACK TO THE FRONTAL POSITION.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "12/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A STRONG FUEL SMELL COMING FROM REAR OF VEHICLE AFTER RETURNING FROM A TRIP TO THE STORE. LOOKED UNDER VEHICLE AND SAW A PUDDLE OF FUEL FORMING ON DRIVERS SIDE IN FRONT OF REAR TIRE. LOOKED AT THE UNDERCARRIAGE AND SAW A STEADY FUEL LEAK COMING FROM THE FUEL LINE BENEATH THE SILVER HEAT SHIELD WRAP. I REMOVED THE WRAP TO FIND THAT THE FUEL LINE HAD RUSTED THROUGH AROUND THE PLASTIC MOUNTING CLIP. THIS IS A SERIOUS SAFETY DEFECT AS THE FUEL LINE RUN INCHES FROM THE EXHAUST PIPE HENCE THE MANUFACTURERS HEAT SHIELD WRAP ATTEMPTING TO SHIELD THE FUEL LINES FROM THE EXHAUST PIPE. THIS IS A POOR DESIGN AS IT IS LOCATED JUST IN FRONT OF THE DRIVER SIDE REAR TIRE. THE HEAT SHIELD WRAP GETS SATURATED FROM WATER FROM THE TIRE THEN HAS NO PLACE TO GO, ACCELERATING CORROSION. MY VEHICLE ONLY HAS 63,000 MILES. THIS SHOULD NEVER HAD HAPPENED. REQUEST GM CORRECT THE DESIGN AND REPAIR MY VEHICLE THUS ELIMINATING FUTURE OCCURRENCES.",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2015",
        "dateOfIncident": "12/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER NOTICING A GASOLINE SMELL AND A PUDDLE COLLECTING UNDERNEATH MY VEHICLE WHILE IT WAS IN PARK, I TOOK IT TO THE DEALER TO SEE WHAT WAS GOING ON WITH MY VEHICLE. THE DEALERSHIP THEN INFORMED ME THAT MY VEHICLE WAS SERIOUSLY LEAKING FUEL. THEY TOLD ME THAT THE FUEL LINE FROM THE TANK TO THE ENGINE WAS COMPLETELY RUSTED THROUGH. THE PRICE TO REPLACE THIS PART IS COMPLETELY RIDICULOUS AND I AM HIGHLY UPSET THAT NO ONE HAS TOLD ME THAT THIS PART WAS STARTING TO RUST FOR THE LAST YEAR. MY CAR IS ONLY 9 YEARS OLD AND DOESN'T EVEN HAVE 100,000 MILES ON IT. THIS IS A HIGHLY UNSAFE ISSUE THAT REQUIRES THE COMPANY TO DO A RECALL ON BECAUSE NO ONE SHOULD BE DRIVING THEIR VEHICLE WHEN THERE IS A FUEL LEAK!!!!   *JS",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816694,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHILE DRIVING AT VARIOUS SPEEDS, THE CONTACT SMELLED FUEL INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V459000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT AIRBAG SENSOR IS FAULTY, CAUSING THE AIRBAG LIGHT TO BE ILLUMINATED ON THE DASHBOARD.  SENSOR WILL NOT DETECT SOMEONE SEATED, CAUSING THE AIRBAG NOT TO DEPLOY IF IN AN ACCIDENT.",
        "vin": "1G2AL18F087"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "10/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC G5.  CONSUMER WRITES IN REGARDS TO RECALL NOTICE 12V-459 ISSUES.  *SMD  THE CONSUMER STATED HE NEVER RECEIVED A RECALL NOTICE REGARDING THE ABOVE RECALL. HOWEVER, HE DID RECEIVE RECALL NOTICES 14V047000 AND 14V171000.  AFTER SMELLING FAINT GASOLINE FUMES OVER A PERIOD OF SEVERAL MONTHS, THE CONSUMER BEGAN TO NOTICE A SMALL GASOLINE PUDDLE UNDER THE VEHICLE WHEN IT WAS PARKED.  ON OCTOBER 21, 2015, HE TOOK THE VEHICLE TO A NON-GM DEALER REPAIR SHOP AND HAD THE DEFECTIVE FUEL PUMP REPLACED. THE REPLACEMENT COST OF THE FUEL PUMP AND FILTER WAS $ 630.42. IT WAS THE REPAIR SHOP WHO INFORMED THE CONSUMER ABOUT THE RECALL.  GM INFORMED THE CONSUMER, THEY WOULD ONLY HONOR REIMBURSEMENT REQUEST UNDER THIS RECALL THAT WERE RECEIVED NO LATER THAN JUNE 30, 2014.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A FUEL SMELL IN THE CAR, THEN HAD TROUBLE STARTING THE CAR.  AFTER A FEW DAYS THERE WAS A PUDDLE OF LIQUID UNDER MY CAR AS I LEFT THE GROCERY STORE.  FUEL SMELL WAS EXTREMELY STRONG.  GOT HOME AND LOOKED UNDER CAR AND FOUND A FUEL HOSE LEAKING GAS.  TOOK INTO A MECHANIC WHO FOUND THE WHOLE FUEL LINE TO BE ROTTED!  ITS A 7 YEAR OLD CAR WITH SLIGHTLY OVER 100,000 MILES ON IT.  MECHANIC SAID HE HAS NEVER SEEN ANYTHING LIKE THIS AND CAN'T BELIEVE THEIR ISN'T A RECALL ISSUED ON THIS.  THIS IS VERY UNSAFE AND COULD HAVE SERIOUSLY HARMED MYSELF AND MY CHILDREN HAD A FIRE STARTED.",
        "vin": "1G2AL15F177"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "08/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10774790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE STALLED CAUSING THE DRIVER TO LOSE CONTROL OF THE VEHICLE AND CRASH INTO A DITCH. DURING THE CRASH, THE SEAT BELTS FAILED TO RETRACT AND THE AIR BAGS DID NOT DEPLOY. THE DRIVER SUSTAINED A CONCUSSION AND UPPER TORSO TRAUMA AND THE FRONT PASSENGER SUFFERED A FRACTURED NECK, VERTEBRAE, AND A CONCUSSION. BOTH OCCUPANTS REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1G2AL18F787"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "07/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733640,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHILE MERGING TO THE RIGHT AT APPROXIMATELY 55 MPH, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 10V073000 (STEERING). THE FAILURE RECURRED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 113,000.",
        "vin": "1G2AL18F587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V171000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "05/31/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. WHILE DRIVING AT 50 MPH, THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. ALL WARNING LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V171000 (ELECTRICAL SYSTEM). THE VEHICLE WAS TAKEN TO A DEALER WHO REPAIRED THE VEHICLE UNDER THE RECALL; HOWEVER, THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G2AL18F787"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC G5.  CONSUMER WRITES IN REGARDS TO IGNITION RECALL ISSUES.  *SMD  THE CONSUMER STATED THE ORIGINAL IGNITION RECALL WAS FIXED IN EARLY NOVEMBER 2014, AFTER THE KEY WOULD NOT COME OUT OF THE IGNITION AND THE VEHICLE HAD TO BE TOWED.  THE CONSUMER EXPERIENCED ANOTHER FAILURE ON JANUARY 20, 2015. IT WAS TOWED THE DEALER.  THE DEALER INFORMED THE CONSUMER A SHIFTER ASSEMBLY WAS NEEDED. HOWEVER, THE PART WAS ON NATIONAL BACK ORDER. *JB",
        "vin": "1G2AL18F687"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER IS A COLLAGE STUDENT, SHE WAS DRIVING HOME, WHICH IS 180 MILES FROM HOME, SHE WAS DRIVING ON THE HIGHWAY, POWERSTEERING GAVE OUT, ALMOST HAD A WRECK 3 TIMES WITH SAME SITUATION, HAD TO MUSCLE IT TO PULL OVER......... I KNOW THERE IS A RECALL ON THIS BUT I HAVE NOT RECEIVED A NOTICE TO HAVE IT FIXED. THIS ALSO HAS HAPPENED SEVERAL TIMES WHEN SHE STARTS HER CAR.  HAS LEFT HER SITTING IN A PARKING LOT LATE AT NIGHT, HAD TO KEEP TURNING CAR ON AND OFF SEVERAL TIMES BEFORE IT WOULD ACT RIGHT!! SHE HAS ONLY HAD THIS CAR ALMOST 2-YEARS!!!  DEALERSHIP CAN NOT FIX THIS TILL I GET THE NOTICE!!  *TR",
        "vin": "1G2AL18F287"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. AFTER REFUELING THE VEHICLE, FUEL FUMES EMITTED IN AND AROUND THE VEHICLE. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE FUEL TANK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AT A COST OF $900. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.   UPDATED 6/18/15*CN",
        "vin": "1G2AL18F487"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690480,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE FILL UP THE FUEL TANK THE CAR HAS A VERY STRONG SMELL OF GAS INSIDE THE CAR AND SEVERAL FEET AWAY FROM THE CAR AND FOUND A PUDDLE OF GAS UNDER THE CAR.  ONCE THE TANK IS 1/2 DOWN THE SMELL SUBSIDES.  WE TOOK IT TO THE DEALER AND THEY SAID WE NEEDED A NEW GAS TANK, LINES AND PUMP.AND SEAL.  THE CAR IS ONLY 7 YEARS OLD WITH 40,000 MILES ON IT.  THERE ISN'T ANY PHYSICAL DAMAGE TO THE TANK AND WE FEEL THAT IT AHOULD BE TAKEN CARE OF BY THE MANUFACTURER AS IT SEEMS TO BE AN ERROR IN THE ASSEMBLY OF THE TANK.    THANK YOU FOR YOUR TIME.    *JS",
        "vin": "1G2AL18F487"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10678238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A MOTOR VEHICLE ACCIDENT, MY VEHICLE WAS TOTALED AND THE AIR BAG DID NOT DEPLOY. I WAS CUT OFF BY ANOTHER VEHICLE THAT THEN SLAMMED THEIR BRAKES, I HIT THE REAR OF THAT VEHICLE IT WAS A 2011 FORD FOCUS THAT VEHICLE WAS NOT DAMAGED AND THE DRIVER WAS NOT HURT. MY VEHICLE WAS DEEMED A TOTAL LOSS AND I SUFFERED A NECK/BACK/SHOULDER INJURY.",
        "vin": "IG2AL18F387"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "11/06/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10663368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 PONTIAC G5. WHILE DRIVING APPROXIMATELY 20 MPH, ANOTHER VEHICLE CRASHED INTO THE DRIVER SIDE OF THE VEHICLE AND THE AIR BAGS FAILED TO DEPLOY. IN ADDITION, THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE FAILED TO RESPOND. THE DRIVER SUSTAINED A NECK AND HEAD INJURY THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED ABOVE VEHICLE USED 2 WEEKS AGO   HAS THE FOLLOWING RECALLS   CAMPAIGN NUMBER: 12V459000  CAMPAIGN NUMBER: 14V047000  CAMPAIGN NUMBER: 14E021000  CAR HAS ISSUES DYING ON THE FREEWAY WHEN BUMPS ARE HIT AND REEKS OF GASOLINE WHEN DECELERATING OR OPERATED FOR SHORT PERIODS OF TIME   GM WAS CONTACTED ON THEIR 1-800 LINE TODAY 11/17/14   THEY HAVE REFUSED TO PERFORM THE RECALL ON THIS AUTO MOBILE   STATING ITS A \"BRANDED TITLE\" FROM OKLAHOMA IF I WANTED IT ADDRESSED TO CALL THE STATE OF OK????  ALLOWING CORPORATES TO DEFY REGULATIONS IS NOT THE WAY TO PROTECT THE PUBLIC!!!!!!!  VEHICLE WILL NOT PASS REQUIRED EMISSIONS TESTING WITH THE FUEL PUMP PUKING GASOLINE IT IS UNUSABLE UNTIL REPAIRED.  *TR",
        "vin": "1G2AL18F587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SPEAKERS OF THE RADIO SYSTEM INTERMITTENTLY FAIL TO WORK. AT THE SAME TIME, THE TURN SIGNALS STOPPED MAKING THE BLINKING SOUND--BOTH RANDOMLY RETURN THEN DISAPPEAR AGAIN. ALSO, THE CABIN AIR FILTER MAKES A CLICKING SOUND AS IT GOES FROM RECYCLED AIR TO LETTING OUTSIDE AIR IN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED MULTIPLE \"IMPORTANT SAFETY RECALL\" LETTERS AND POST CARDS FROM GM AND PONTIAC URGING ME TO HAVE THE DEFECTIVE IGNITION & START SWITCH THAT WAS INSTALLED IN MY VEHICLE REPLACED.  I RECEIVED LETTERS WHEN THEY FIRST ACKNOWLEDGED THE ISSUE, LETTERS SAYING THAT PARTS WOULD BE AVAILABLE SOON, LETTERS WHEN PARTS STARTED TO BECOME AVAILABLE, ETC.    A MONTH AGO I CONTACTED MY LOCAL GM DEALERSHIP SO THEY COULD ORDER THE PARTS AS INSTRUCTED AND WAS TOLD I WOULD BE CONTACTED WHEN THEY ARRIVED.  I WAS INFORMED LAST WEEK THAT THE PARTS HAD ARRIVED AND WAS GIVEN A 10AM SERVICE TIME FOR TODAY (9/4/14).  I ARRIVED TO GET THE WORK DONE, SIGNED THE PAPER TO ALLOW THEM TO DO THE WORK, AND HAD A SEAT IN THE WAITING ROOM.    APPROXIMATELY 50 MINUTES LATER I WAS APPROACHED AND INFORMED THAT GM WOULD NOT AUTHORIZE THE WORK TO BE DONE BECAUSE MY CAR HAS AN \"ALTERED\" TITLE (IT HAD SOME FRONT END DAMAGE 50,000 MILES AGO THAT WAS FIXED 100% WITH ORIGINAL GM PARTS).  NO WHERE IN ANY OF THE NOTIFICATIONS THAT I RECEIVED DID IT MENTION THIS.  I ASKED HOW THAT COULD BE CONSIDERING AS OF FEBRUARY OF THIS YEAR 13 DEATHS STEMMING FROM THIS FATAL DESIGN FLAW HAD ALREADY BEEN ADMITTED TO BY GM...I WAS TOLD IT WAS GM POLICY AND THERE WAS NOTHING THE DEALERSHIP COULD DO ABOUT.  I ASKED WHAT FRONT END DAMAGE HAD TO DO WITH A FATAL DESIGN FLAW IN ANOTHER AREA OF THE CAR...I WAS TOLD  IT WAS GM POLICY AND THERE WAS NOTHING THE DEALERSHIP COULD DO ABOUT.    HOW IN THIS DAY CAN A COMPANY, THAT HAS ADMITTED THAT THEY HAVE INSTALLED A FAULTY PART IN NUMEROUS VEHICLES THAT HAS LEAD TO THE LOSS OF HUMAN LIFE, WIPE THEIR HANDS OF THE SITUATION BECAUSE A VEHICLE HAS AND \"ALTERED\" TITLE??  I HAVE BEEN WAITING TO SELL MY G5 FOR OVER A MONTH NOW, WANTING TO MAKE SURE THE NEXT OWNER WAS SAFE AND THE VEHICLE WAS IN THE BEST POSSIBLE SHAPE...BUT HOW DO I DO THAT NOW WHEN GM WILL NOT HONOR THEIR OWN RECALLS?  *TR",
        "vin": "1G2AN18B687"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT FUEL FUMES WERE EMITTED IN AND AROUND THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN DIAGNOSED THAT THE FUEL PUMP WAS CRACKED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 70,000.",
        "vin": "1G2AL18F287"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10598705,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, THE STEERING WENT HAY WIRE TO WHERE WE LOST CONTROL OF THE CAR AND CRASHED. WE WERE UNABLE TO CONTROL THE CAR AND IT VEERED OFF INTO SOMEBODY ELSE'S LANE AND HIT THEIR VEHICLE. THE AIR BAGS NEVER DEPLOYED LIKE THEY SHOULD HAVE. WE ARE UNSURE OF WHAT HAPPENED AND ARE STRUGGLING TO PAY FOR THE REPAIRS.  *TR",
        "vin": "1G2ZG57N984"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "04/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2008 PONTIAC G5.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER: 14V047000 (ELECTRICAL SYSTEM).  THE DEALER STATED THAT THE PARTS FOR THE REPAIR WERE UNAVAILABLE.  THE DEALER AND MANUFACTURER DID NOT KNOW WHEN THE PARTS WOULD ARRIVE.  THE VEHICLE HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G2AL18F687"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHEN ATTEMPTING TO STOP, THE VEHICLE SUDDENLY STALLED AS THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE ENGINE WAS RESTARTED AND THE VEHICLE OPERATED AS NORMAL. THE FAILURE RECURRED ON MULTIPLE OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 90,325.",
        "vin": "1G2AL18F587"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "05/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DAYTIME RUNNING LAMPS STOPPED WORKING ON MY VEHICLE. TOOK MY CAR TO A MECHANIC AND HE NOTED THAT THE WIRING HARNESS FOR THE DAYTIME RUNNING LIGHTS AND HEADLIGHTS WAS BURNT TO A CRISP. COULD NOT BELIEVE MY EYES. MY CAR IS FACTORY ORIGINAL AND NEVER BEEN IN A WRECK SO THERE IS NO EXCUSE FOR THIS ELECTRICAL FAILURE. DAYTIME RUNNING LIGHTS ARE A SAFETY FEATURE ACCORDING TO GENERAL MOTORS AND NOW I FEEL LIKE MY CAR IS LESS SAFE BECAUSE OF THIS PROBLEM! HELP!  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LEFT DRIVER DOOR SPEAKER IN MY CAR WILL STOP WORKING WHEN IT RAINS AND HAS TO BE REPLACED. THERE IS A DESIGN FLAW WITH THIS CAR BECAUSE THE DOOR HAS A DRAIN TUBE THAT IS RIGHT OVER THE SPEAKER CONNECTION AND WILL CAUSE THE SPEAKER TO SHORT CIRCUIT. I NORMALLY WOULDN'T COMPLAIN ABOUT THIS DEFECT BUT THE FRONT DRIVER DOOR SPEAKER IS WHAT IS USED FOR THE WARNING AND SAFETY CHIMES THAT THE CAR IS SUPPOSED TO MAKE WHEN YOU START YOUR VEHICLE AND WHILE YOU USE IT. NOW THAT MY SPEAKER NEEDS TO BE REPLACED, I HAVE NO TURN SIGNAL SOUNDS, NO WARNING CHIMES WHEN I START MY CAR TO REMIND ME TO PUT ON MY SEATBELT, NO WARNING SOUND THAT I'VE LEFT MY KEY IN THE IGNITION, AND IF MY POWER STEERING WERE TO GO OUT I'D HAVE NO AUDIBLE WARNING TONE. VERY UNSAFE!    *JS",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10579570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO OPEN THE DOOR TO GET OUT OF MY VEHICLE AND WAS CUT BUT THE INSIDE DOOR HANDLE. WASN'T SURE WHAT HAD HAPPENED BUT UPON INSPECTION OF THE HANDLE, I NOTICED THAT THE CHROME COATING IS COMING OFF AND HAS SHARP EDGES. I'M GLAD I DIDN'T CUT MYSELF DEEPER.  *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED NOTICING THAT MY AIR BAG LIGHTS WOULD SAY THEY WERE OFF SOMETIMES, BUT NOW THEY ARE ALWAYS OFF. THESE CARS ARE NOT SAFE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "02/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS TURNING ONTO THE HIGHWAY, ON MY WAY TO DROP MY SON OFF AT DAYCARE BEFORE WORK, EARLY MARCH 27TH, 2014, MY CAR WOULD NOT MOVE FROM THE STOP SIGN I WAS STOPPED AT. IT WAS EXTREMELY SCARY, ESPECIALLY WITH MY YOUNG SON IN THE BACK SEAT. MY CAR IS A MANUAL, AND THE STICK SHIFT WOULD SLIP INTO EACH SLOT BUT NOT ENGAGE THE GEAR, WHICH LEAD ME TO ASSUME THAT THE TRANSMISSION HAD GONE OUT. MY CAR REMAINED RUNNING, EVEN WITH MY FOOT OFF THE CLUTCH, AND IN ANY GEAR, INCLUDING REVERSE. I ENDED UP HAVING TO PUSH MY CAR OFF TO THE SIDE OF THE ROAD AND HIGHWAY, WITH MY SON STILL INSIDE. ALTHOUGH I FELT THAT THIS WAS NOT THE SAFEST SITUATION FOR MY SON TO BE IN, I FELT THAT THE ALTERNATIVE OF REMAINING IMMOBILE IN THE FLOW OF TRAFFIC MAY GET US IN A REAR-END COLLISION, OR HAVING MY SON STANDING ON THE SIDE OF THE HIGHWAY WHILE I PUSHED THE CAR MAY GET HIM HURT. I WAS ABLE TO GET MY CAR TOWED TO MY HOUSE, BUT THE COST TO REPAIR OR REPLACE THE TRANSMISSION AT A SHOP IS AN OUTRAGEOUS PRICE, AND I AM NOT ABLE TO FIND A TRANSMISSION FOR SALE AT ANY AUTO PARTS STORE BECAUSE IT SEEMS THAT THEY ARE NO LONGER ABLE TO ACQUIRE THE PART. MOST OF THE MECHANICS I HAVE SPOKE WITH HAVE STATED THAT THEY HAVE REPAIRED MULTIPLE PONTIAC G5 TRANSMISSIONS IN THE RECENT MONTHS. AFTER ALL THE NEWS ABOUT GM VEHICLES, I FEEL THAT I MAY HAVE MADE A BAD INVESTMENT WHEN PURCHASING MY CAR BRAND NEW AND HAVING SUCH A MAJOR ISSUE OCCUR THIS SOON. MORE SO, I AM CONCERNED BY THE WAY MY CAR BROKE DOWN. IT WAS VERY DANGEROUS TO HAVE MY CAR UNEXPECTEDLY STOP MOVING AS I WAS TURNING ONTO THE HIGHWAY AND IN THE FLOW OF TRAFFIC, BUT ALL I COULD THINK IS WHAT I WOULD HAVE DONE IF MY TRANSMISSION HAD GONE OUT WHILE TRAVELING AT HIGH SPEED OR IN AN AREA WITHOUT A PLACE TO PULL OFF, IT IS A SCARY THOUGHT.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "07/13/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE DRIVING 25 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. NO REPAIRS WERE PERFOMRED. THE MANUFACTURE WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 17,000 AND THE CURRENT MILEAGE WAS 42,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2014",
        "dateOfIncident": "02/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD LIGHTS WENT AWRY. GAUGE NEEDLES FLOATED ABOUT GIVING FALSE READINGS ON SPEED AND GAS TANK GAS LEVEL. LOST POWER STEERING. DEALER REPLACED IGNITION SWITCH & RESET THE COMPUTER FOR $390.73. SAME PROBLEM RECURRED WEEKS LATER.  03/18/2014, ANOTHER GM DEALER INSPECTED FOR $158.00 & FOUND WE NEED TO REPLACE THE STEERING MODULE AND COLUMN FOR $1055.00. I AM EXPECTING A RECALL LETTER IN MID-APRIL. I LIVE IN A SMALL TOWN AND NEED TO DRIVE MY ONLY VEHICLE ALTHOUGH THE DEALER WARNED ME THAT THE CAR IS IN DANGEROUS CONDITION. I HOPE THE RECALL INCLUDES MY NEEDED REPAIRS AND REIMBURSES ME FOR DOCUMENTED RELATED COSTS.    *TR",
        "vin": "1G2AN18B087"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M EXPERIENCING ISSUES WITH MY AIRBAG LIGHT. IT KEEPS COMING ON AND OFF AT RANDOM TIMES. AFTER MUCH RESEARCH I HAVE FOUND THAT MANY PEOPLE WITH THE PONTIAC G5'S HAVE THE SAME ISSUE THAT I AM HAVING AND THIS IS DUE TO IMPROPER WIRING UNDER THE PASSENGER SIDE SEAT OF THE CAR. I HAVE CONTACTED THE PONTIAC DEALERSHIP AND THE GM DEALERSHIP AND THEY BOTH CLAIM THAT THEY DO NOT KNOW WHAT WOULD BE CAUSING MY AIRBAG LIGHT TO BE GOING ON AND OFF AND THE ONLY WAY TO DIAGNOSE THE ISSUE IS TO PAY $100.00 JUST TO TELL ME WHETHER OR NOT FAULTY WIRING IS THE ISSUE. I'M PARANOID TO DRIVE MY CAR BECAUSE I'M AFRAID THAT THERE COULD BE SOMETHING WRONG WITH MY AIRBAG OR MAYBE IT IS JUST FAULTY WIRING. I THINK THIS IS SOMETHING THAT SHOULD BE RECALLED SINCE THERE ARE SO MANY PEOPLE WITH THIS SAME EXACT ISSUE. AS A MATTER OF FACT THERE IS AN ENTIRE WEBSITE DEVOTED FOR PEOPLE WHO HAVE THIS ISSUE. I CAN'T GET MY INSPECTION DONE BECAUSE THE LIGHT JUST POPS ON RANDOMLY. IF THIS IS A WIRING ISSUE THAT SO MANY PEOPLE ARE HAVING, WHY ISN'T GM BEING HELD LIABLE FOR THE ISSUE? WHY IS THE AIRBAG ONLY COVERED IF IT IS DEPLOYED? THIS HAS BEEN GOING ON FOR A COUPLE WEEKS ON AND OFF AND I WOULD REALLY APPRECIATE SOME KIND OF RESPONSE OR JUST A WAY TO HANDLE THIS. I AM A FULL TIME STUDENT AND I DO NOT HAVE $100 LYING AROUND TO HAVE SOMEONE RUN A DIAGNOSTIC AND THEN PAY EVEN MORE JUST TO FIX A WIRE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/10/2013",
        "dateOfIncident": "10/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547489,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT THE STEERING WHEEL LOCKED, WHILE MAKING A LEFT OR RIGHT TURN OR DRIVING IN REVERSE. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION. THE MANUFACTURER ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED THE VOLUNTARY RECALL (ELECTRIC POWER STEERING MOTOR). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 90,000.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/27/2013",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, THE BRAKE FAILED TO ENGAGE AS THE STEERING WHEEL SEIZED. THE CONTACT PROCEEDED TO LOSE CONTROL OF THE VEHICLE AND CRASHED INTO ANOTHER VEHICLE. THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE. THE BRAKE SYSTEM WAS CLEANED HOWEVER, THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS CONTACTED AND DENIED ANY ASSISTANCE WITH THE BRAKE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 71,000. KMJ  UPDATED 10/17/13*LJ",
        "vin": "1G2AL18F587"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH AND MAKING A LEFT TURN, THE DRIVER LOST CONTROL OF THE STEERING AND CRASHED INTO ANOTHER VEHICLE. THERE WERE NO INJURIES. THE POLICE REPORTED TO THE SCENE AND A REPORT WAS FILED. THE VEHICLE WAS TOWED TO A BODY SHOP FOR BODY REPAIR. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED A WAS FUSE FROM THE ELECTRONIC POWER STEERING CONTROL MODULE HAD BLOWN AND WOULD HAVE TO BE REPLACED. THE VEHICLE WAS A INCLUDED AND REPAIRED PRIOR TO THE FAILURE UNDER NHTSA CAMPAIGN NUMBER: 10V073000 (STEERING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.   *TR",
        "vin": "1G2AL18F387"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/16/2013",
        "dateOfIncident": "03/03/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503246,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED PONTIAC 2008 G5 COUPE BRAND NEW IN 2008. IN 2011 I WAS INFORMED BY A COWORKER THAT I WAS DRIVING INTO WORK WITH MY BRAKE LIGHTS ON ALL THE WAY. HE ALSO MENTIONED THAT WHEN IT LOOKED LIKE I TRIED TO APPLY THE BRAKES I WOULD HAVE NO BRAKE LIGHTS ON AT ALL. IT SEEMED THAT MY BRAKE LIGHTS WORKED IN REVERSE. THIS WAS AN INTERMITTENT ELECTRONIC PROBLEM THAT WAS HARD FOR THE DEALERSHIP TO REPLICATE. EVENTUALLY, THEY REPLACED THE BRAKE LIGHT SWITCH. HOWEVER, NO ONE EVER STOPPED TO MENTION TO ME THAT MY PONTIAC G5 2008 WAS STILL HAVING THE PROBLEM. IN 2012 ONCE AGAIN A DIFFERENT CO WORKER INFORMED ME OF THE SAME PROBLEM AS THEY TRAVELED BEHIND ME INTO WORK. THE DEALERSHIP DECIDED THAT THEY INSTALLED AN DEFECTED BRAKE LIGHT SWITCH AND REPLACED IT. A YEAR LATER THE SAME PROBLEM IN 2013 BY ANOTHER CO WORKER THAT MY BRAKE LIGHTS STAY ON AND WHEN I APPLY MY BRAKES I HAVE NO BRAKE LIGHTS AT ALL. I HAVE SCHEDULED ANOTHER APPOINTMENT TO GET ANOTHER BRAKE LIGHT SWITCH INSTALLED AGAIN FOR MARCH 19, 2013. THIS IS A SERIOUS SAFETY ISSUE THAT NEEDS TO BE ADDRESSED ALONG WITH A RECALL IT ALSO SEEMS TO SHOW UP IN PONTIAC G6 AS WELL. I DON'T WANT TO BE BLINDING PEOPLE WITH MY BRAKE LIGHTS OR CONFUSING THEM ESPECIALLY IN BAD WEATHER. THE PONTIAC G5 SHOULD BE ABLE TO HAVE A OPERATING FEATURE SUCH AS BRAKE LIGHTS WHEN BRAKES ARE BEING APPLIED. I DO NOT WISH TO BE KILLED IN AN ACCIDENT OR CAUSE ONE BECAUSE OF THIS ISSUE, MY BRAKE LIGHTS SHOULD BE WORKING PROPERLY SO THAT PEOPLE BEHIND ME KNOW THAT I'M SLOWING DOWN OR STOPPING BEFORE THEY REAR END ME. IT SEEMS THAT REPLACING THE BRAKE LIGHT WHICH MAY NOT BE HELPING AT ALL. BY HUMAN NATURE NOT TO MANY PEOPLE WILL PUT FORTH THE EXTRA EFFORT TO CONFRONT AN INDIVIDUAL TO INFORM THEM THAT THERE VEHICLE HAS A MALFUNCTION THEY JUST WANT TO GO ABOUT THERE OWN BUSY SCHEDULES SO WHO KNOWS HOW LONG THIS BRAKE LIGHT ISSUE HAS REALLY BEEN GOING ON.  *TR",
        "vin": "1G2AL18F687"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2013",
        "dateOfIncident": "02/09/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE SMELLED A STRONG ODOR OF GASOLINE AFTER PARKING THE CAR. WE CONTINUED RUNNING ERRANDS (STOP AND GO DRIVING) AND THE SMELL CONTINUED. WE THEN PARKED THE CAR UNTIL THE FOLLOWING WEEK BECAUSE WE WERE AFRAID TO DRIVE IT. UPON TAKING IT TO A MECHANIC, HE INFORMED US THAT THE PLASTIC RETURN LINE FROM THE FUEL SENDING UNIT/FUEL PUMP WAS SEVERELY CRACKED AND LEAKING GASOLINE ON TOP OF THE FUEL TANK UNDERNEATH THE CAR. HE REMOVED THE FUEL TANK AND REPLACED THE ENTIRE SENDING UNIT/PUMP WITH A NEW UNIT FROM GM. HE STATED SEVERAL TIMES THAT THE CAR WAS NOT SAFE TO DRIVE BEFORE THE REPAIR DUE TO THE LEAKAGE OF RAW GASOLINE ON TOP OF THE TANK AROUND MANY ELECTRICAL COMPONENTS.  *TR",
        "vin": "1G2AN18B087"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2013",
        "dateOfIncident": "02/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE TRAVELING 40 MPH, THE HESITATED THEN STALLED. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO A PRIVATE MECHANIC WHERE IT WAS FOUND THAT THE FUEL PUMP HAD FAILED. THE DEALER ALSO INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 12V459000 (FUEL SYSTEM: GASOLINE). THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 91,000.",
        "vin": "1G2AL18F287"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WOULD NOT START CLEANLY.  WHEN IT DID THERE WAS A VERY STRONG SMELL OF GAS AND YOU COULD SEE GAS LEAKING ONTO THE GROUND.  AFTER HAVING IT CHECKED THE LOCAL REPAIR SHOP REPLACED THE FUEL ASSEMBLY FOR A COST OF $889.06.  MECHANIC SAID HE HAD PERFORMED THE SAME REPAIR TO SEVERAL OTHER GM VEHICLES.  AFTER CHECKING THE WEB, I FOUND MANY OTHER G5 OWNERS HAVE REPORTED SAME PROBLEMS.  THERE IS A REPAIR BULLETIN OUT FOR THIS CAR, BUT GM HAS DONE NOTHING TO NOTIFY ME ABOUT A RECALL.  I AM THE ORIGINAL OWNER.  *TR",
        "vin": "1G2AL18F087"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "11/14/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT SHE SMELLED FUEL INSIDE AND OUTSIDE THE CABIN OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS BUT THE FAILURE COULD NOT BE REPLICATED. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V459000 (FUEL SYSTEM, GASOLINE). THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 95,000.",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2012",
        "dateOfIncident": "11/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED SMELLING WITH HEAVY GAS FUMES BOTH INSIDE AND OUTSIDE. IT WAS SO BAD YOU COULDN'T DRIVE THE CAR. CHECKED ALL COMMON AREAS FOR LEAKS, NOTHING WOULD SHOW ON THE GROUND AND NO OTHER AREAS SHOWED ANY SIGNS OF LEAKAGE. TOOK THE CAR TO THE LOCAL DEALERSHIP AND THEY FOUND THAT THE GAS SMELL WAS COMING FROM THE FUEL PUMP MODULE LOCATED ON TOP OF THE GAS TANK BETWEEN THE TANK AND THE FLOOR IN THE BACK SEAT. THEY EXPLAINED TO ME THAT THE MODULE WAS DEFECTIVE AS IT IS LOCATED IN SUCH A CONFINED PLACE THAT NOTHING COULD HAVE GOT UP THERE TO BREAK THE PLASTIC 90% LINE COUPLER. SO TO REPAIR IT THEY HAD TO REPLACE THE ENTIRE FUEL PUMP MODULE AS THE LITTLE 50 CENT PIECE OF PLASTIC WAS ATTACHED AND COULD NOT JUST REPLACE IT.  THE REPAIR COST ME A TOTAL OF $691.03 FOR A SMALL PIECE OF PLASTIC THAT WAS DEFECTIVE. THIS IS TOTALLY UNCALLED FOR, IT'S POOR ENGINEERING AN DESIGN AND IT'S ANOTHER WAY THE AUTO MANUFACTURES ROB THE PUBLIC TO SUPPORT THEIR DEALERSHIPS. VERY DISAPPOINTED IN THIS PROBLEM AND I JUST GET STONED WALLED FROM GM.  I'M JUST GLAD THAT IT HAPPENED WHEN WE WERE IN TOWN.IF WE WERE ON INTERSTATE THIS WOULD HAVE COST US A SMALL FORTUNE AS WE COULD NOT HAVE DRIVEN THE CAR HOME AND WOULD HAVE HAD TO HAVE IT TOWED.   *TR",
        "vin": "1G2AL18F487"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/19/2012",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE TRAVELING 65 MPH, AN UNKNOWN WARNING LIGHT ILLUMINATED AS THE VEHICLE BECAME DIFFICULT TO STEER. THE CONTACT WAS ABLE TO MERGE TO THE SIDE OF THE ROAD. THE VEHICLE WAS RESTARTED AND BEGAN TO FUNCTION NORMALLY. THE VEHICLE WAS ABLE TO BE DRIVEN TO THE CONTACT'S HOME BUT WAS NOT TAKEN TO A MECHANIC OR THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 10V073000 (STEERING:ELECTRIC POWER ASSIST SYSTEM). THE FAILURE AND CURRENT MILEAGES WERE 189,000.",
        "vin": "1G2AL18F387"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "10/16/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480653,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE INTERSTATE AND MY ANTI THEFT LIGHT CAME ON IN MY CAR. THEY CAR WOULD NO LONGER LET ME ACCELERATE. I HAD TO PULL OVER ON THE SIDE OF THE INTERSTATE. I TURNED OFF MY CAR AND RESTARTED IT. IT CONTINUED FINE UNTIL ABOUT A WEEK LATER WHEN IT BEGAN TO SMELL LIKE GAS. THE PLASTIC PART ON THE HOSE FROM THE FUEL PUMP WAS BROKEN AND LEAKING. I HAD READ THAT GM HAD RECALLED THIS IN THE 5 HOT STATES OF ARIZONA CALIFORNIA FLORIDA NEVADA AND TEXAS. BUT HAVE NOT RECALLED IT IN TN EVEN THOUGH IT IS THE SAME PROBLEM?  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2012",
        "dateOfIncident": "09/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT THE SMELL OF GASOLINE WAS PRESENT INSIDE AND OUTSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 12V459000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP) BECAUSE HE LIVED IN THE STATE OF TEXAS. THE FAILURE MILEAGE WAS 63,862.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2012",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING IN AUGUST OF 2012, I STARTED TO NOTICE A FAINT GAS SMELL WHILE DRIVING MY CAR. I THOUGHT IT WAS COMING FROM OTHER CARS ON THE ROAD BUT AFTER A FEW DAYS I REALIZED IT MUST BE MY CAR. I TOOK IT TO A REPAIR SHOP AND THEY SAID THE FUEL PUMP NEEDS TO BE REPLACED BECAUSE THERE IS A CRACK IN ONE OF THE HOSES. HE ADVISED ME THAT MY CAR IS NOT SAFE TO DRIVE DUE TO RISK OF FIRE. I CALLED MY LOCAL DEALERSHIP TO ORDER A FUEL PUMP AND TOLD THEM I WAS UPSET THAT A LATE MODEL CAR WOULD HAVE THIS PROBLEM. HE STATED THAT THERE WAS A RECALL FOR CERTAIN 2006-2007 COBALTS/G5'S BUT NOTHING FOR THE 2008 MODEL YEAR. I'M UPSET THAT GM KNOWS ABOUT THIS ISSUE BUT WILL NOT COVER REPAIRS ($700 WORTH) FOR THEIR CUSTOMERS. I VALUE MY SAFETY, APPARENTLY GENERAL MOTORS DOES NOT.  *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE SEEMS TO BE A COMMON ISSUE OF THE \"SERVICE AIR BAG\" LIGHT GOING OFF FOR G5S AND COBALTS. IT IS CLEARLY A DEFECTIVE PART ISSUE, AS MANY PEOPLE ARE HAVING THE SAME ISSUE, AT APPROXIMATELY THE SAME MILEAGE, AND ONLY GM KNOWS HOW TO FIX THIS ISSUE FOR A LARGE SUM OF CASH. FAILED OBSOLESCENCE AT ITS FINEST.  *TR",
        "vin": "1G2AL18F887"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/08/2012",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A WHILE BACK THAT MY DAYTIME RUNNING LIGHTS WERE NOT ON. I CHECKED TO MAKE SURE I HAD NOT TURNED THEM OFF BY ACCIDENTALLY TURNING THEM OFF ON THE HEADLIGHT SWITCH, BUT THAT WAS NOT THE PROBLEM. I THEN CHECKED ALL MY FUSES IN THE FUSE BOX, INCLUDING THE DAYTIME RUNNING LAMP FUSE, AND THEY WERE ALL GOOD. TOOK MY CAR TO A DEALERSHIP TO HAVE THEM TELL ME WHAT'S WRONG AND I WAS INFORMED THAT MANY 2007+ YEAR COBALTS/G5'S HAVE FAULTY WIRING WITH THE DAYTIME RUNNING LAMPS AND THE WIRING WILL MELT. THE SERVICE ADVISOR SAID THAT THIS HAPPENS ALL THE TIME AND IT IS VERY EXPENSIVE TO FIX BECAUSE TO DO IT PROPERLY THE WHOLE WIRING HARNESS FOR THE LIGHTING SYSTEM ON THE FRONT OF THE CAR HAS TO BE REPLACED. I WAS QUOTED OVER $500 AT THE DEALERSHIP (OUT OF WARRANTY) TO HAVE MY DAYTIME RUNNING LIGHTS FIXED. $500 TO FIX A SAFETY FEATURE THAT MY CAR CAME AND GM KNOWS ABOUT THE PROBLEM BUT APPARENTLY ISN'T DOING ANYTHING TO HELP.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/31/2012",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUSPENSION BUSHINGS ON THE PONTIAC G5 AND PROBABLY CHEVROLET COBALT WEAR OUT RAPIDLY.  ON MY VEHICLE THE DRIVER'S SIDE BUSHING FAILED AT 31,350 MILES AND THE PASSENGER SIDE AT 42,850 MILES.  THE FACTORY REPLACEMENT ON THE DRIVERS SIDE IS STARTING TO FAIL AGAIN AT 44,500 MILES.  FAILURE IS DEFINED AS A CLUNKING NOISE WHILE GOING OVER ROAD IMPERFECTIONS.  THE DESIGN IS EITHER FAULTY OR THE PART IS PRODUCED BADLY AS NEITHER PART SHOWED EFFECTS OF THE RUBBER BEING BONDED TO THE METAL.  ALL SUSPENSION BUSHINGS SHOULD HAVE THE RUBBER BONDED TO BOTH THE OUTER AND INNER METAL SLEEVE.  WITHOUT BONDING, THE SUSPENSION BUSHING WILL MAKE NOISE IN THE SHORT TERM, BUT OVER TIME AS THE RUBBER DEGRADES, LARGE AMOUNTS OF SUSPENSION MOVEMENT THEN CAN CAUSE THE BOLT TO FAIL AND CAN LEAD TO LOSS OF VEHICLE CONTROL.  GM SHOULD CORRECT THE DESIGN AND THEN PROVIDE REPLACEMENT PARTS AS NEEDED. *TR",
        "vin": "1G2AL18F887"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2012",
        "dateOfIncident": "06/20/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467937,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I SMELL FUEL AND SURE ENOUGH, I HAVE A FUEL LEAK WHICH IS A PROB/RECALL FOR THE MAKE, MODEL AND YR. HOWEVER I HAVE CALLED THE DEALER AND DEALER SAID ITS NOT ON NHTSA RECALL LIST.  FROM 15 FEET AWAY WE SMELL GAS!   IT HAS 93014 MILES AND THE INSIDE OF DRIVER DOOR STATES 8/07 MANUF DATE BUT HOWEVER IT ALSO SAYS 2008.  I NEED TO HAVE THIS DOCUMENTED IN CASE OF FIRE, DUE TO AGAIN, 15 FT OR CLOSER THEIR IS STRONG GAS SMELL AND NO ONE WILL HELP ME FIGURE OUT THE REAL DATE OF THIS CAR.  THANK YOU IN ADVANCE FOR YOUR ASSISTANCE.  *TR",
        "vin": "1G2AL18F687"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/20/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST FEW DAYS THE INSIDE OF MY CAR REEKS OF GAS.  IT SMELLS BAD AROUND THE OUTSIDE OF MY CAR AS WELL.  THE CAR DRIVES FINE BUT IT IS SLOW TO START FOR THE FIRST CRANK OF THE DAY.    I TOOK THE CAR FOR AN OIL CHANGE TODAY AND WAS INFORMED THAT GAS WAS ON TOP OF THE GAS TANK AND COULD POSSIBLY CAUSE THE CAR TO CATCH FIRE.  I CALLED MY LOCAL GM DEALERSHIP AND WAS INFORMED THERE WAS NO RECALL ON THE PART, BUT HAVE SEARCHED THE WEB AND FOUND NUMEROUS FUEL/PROPULSION SYSTEM PROBLEMS WITH THE PONTIAC G5.  NEED INFORMATION ON HOW/WHEN GM IS GOING TO FIX THE ISSUE.  *TR",
        "vin": "1G2AL18F587"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "06/04/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462249,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING WRONG WITH THE STEERING IN THESE CARS. STEERING WILL STILL LOCK UP, AT LOW VEHICLE SPEEDS. THE RECALL TWO YEARS AGO HAS NOT HELPED THE SITUATION. THERE IS SOMETHING WRONG WITH THE STEERING COLUMN AND STEERING RACK WITH THESE CARS. SUSPENSION/STEERING CLUNKS AND RATTLES LIKE IT IS ABOUT TO FALL OFF! VERY UNSAFE!     *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2012",
        "dateOfIncident": "04/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT THE AIR BAG SYSTEM FAILED AND THE WARNING LIGHT WAS PERMANENTLY ILLUMINATED.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DISCOVERED THAT THERE WERE FAULTY GROUND WIRES IN THE STEERING WHEEL. THE WIRING WAS REPLACED BUT THE FAILURE RECURRED. THE DEALER REPLACED THE DRIVER AND PASSENGER SIDE AIR BAGS. THE FAILURE RECURRED AND THE DEALER HAD TO REPLACE THE MASTER CONTROL MODULE. THE CONTACT STATED THAT THE DEALER COULD NOT GUARANTEE THAT THE REPAIR WOULD REMEDY THE ISSUE. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 42,000.",
        "vin": "1G2AL18F587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2011",
        "dateOfIncident": "12/09/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE COMPARTMENT OF MY SONS 2008 PONTIAC G5 BURNT UP TODAY. IT WAS PARKED OUTSIDE OUR HOME. THE FIRE DEPARTMENT SAID IT WAS ELECTRICAL IN NATURE AND THAT IT APPEARED TO START IN AN AREA NEAR THE DRIVERS SIDE WHEEL. IT APPEARS TO BE A TOTAL LOSS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2011",
        "dateOfIncident": "02/19/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439048,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NO STEERING, CRASHED INTO A POLE.  *TR",
        "vin": "1G2AL18F687"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "09/20/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BEING DRIVIN ON A TWO LANE HIGHWAY AND ALL OF THE SUDDEN THE FRONT RIGHT FELL TO THE GROUND AND THE CAR SPUN OUT AND SLID INTO A DITCH. THE FRONT RIGHT BALL JOINT FAILED AND BROKE APART. MY MECHANIC SAYS HE REPLACES BALL JOINTS ON THESE CARS AT THE RATE OF FIVE CARS PER MONTH. WHILE BEING REPAIRED, I HAD THE CONTROL ARM BUSHINGS, TIE RODS, AND SWAY BAR ENDLINKS REPLACED AGAIN BECAUSE THERE WERE RATTLING AND CLUNKING AGAIN. MY BROTHER WORKS AT A CHEVY DEALER AND HE SAYS THAT COBALT'S/G5'S/HHR'S COME IN ALL THE TIME FOR FRONT SUSPENSION PROBLEMS. GM KNOWS OF THESE ISSUES BUT DOES NOT WANT TO DO ANYTHING FOR IT'S CUSTOMERS WHEN THE WARRANTY RUNS OUT. A CRASH CAN VERY WELL HAPPEN IF ONE OF THESE COMPONENTS FAILS WHEN DRIVING AND THAT IS WHAT HAPPENED TO ME. EVERY SUSPENSION PART ON THESE CARS IS FAULTY. PLEASE LOOK INTO THE SUSPENSION PROBLEMS ON THESE CARS FURTHER. THANK YOU.  *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTING MAKING CLUNKING AND RATTLING SOUNDS IN FRONT SUSPENSION. HAD TO HAVE LOWER CONTROL ARM BUSHINGS REPLACED, NEW TIE RODS, AND SWAY BAR LINKS INSTALLED. BEFORE THE REPAIRS, THE STEERING HAD BECOME EXTREMELY LOOSE AND WAS HARD TO HANDLE ON THE HIGHWAY.    *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT HE WAS UNABLE TO REMOVE THE KEY FROM THE IGNITION. THE CONTACT ALSO STATED THAT IN ORDER TO REMOVE THE KEY FROM THE IGNITION HE WOULD HAVE TO WAIT A LONG PERIOD OF TIME, WHICH SOMETIMES DRAINED THE BATTERY. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSITANCE. THE FAILURE MILEAGE WAS 35,000 AND CURRENT MILEAGE WAS 46,486.",
        "vin": "1G2AL18F487"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/04/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT THE DRIVER AND PASSENGER DOORS SEEMED TO UNLOCK AND LOCK ON THEIR OWN. ONCE EXITING THE VEHICLE WITH THE KEYS IN THE IGNITION, THE DOORS WOULD ALSO LOCK. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC WHO ADVISED HER THAT THERE WAS A ELECTRICAL FAILURE AND THE DOORS NEEDED TO REWIRED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 58,000.",
        "vin": "1G2AL18F787"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/29/2011",
        "dateOfIncident": "04/29/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2008 PONTIAC G5 THE LOWER CONTROL ARM BUSHINGS ARE WEARING OUT AT OR NEAR 18000 MI/ 30000 KM'S, MANY OWNERS OF THESE CARS HAVE NO IDEA OF THIS FAULT.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "03/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "P195/60R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5 EQUIPPED WITH CONTINENTAL TOURING CONTACT A/S TIRES, LINE SIZE P195/60R15. THE CONTACT WAS DRIVING APPROXIMATELY 65-70 MPH WHEN THE DRIVER SIDE REAR TIRE EXPERIENCED TREAD SEPARATION AND CAUSED SLIGHT DAMAGE TO THE VEHICLE. THE CONTACT PULLED OVER AND INSTALLED THE SPARE TIRE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THAT THEY WOULD REPAIR THE VEHICLE FOR COSMETIC DAMAGE DUE TO THE SEPARATION AND REPLACE THE TIRE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CURRENT AND FAILURE MILEAGE WAS 27,729.",
        "vin": "1G2AL18F087"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL *THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE DEALER WHO STATED THAT THE WATER PUMP COLLECTED DUST AND THE VEHICLE OVERHEATED AS A RESULT. THE MANUFACTURER WAS CONTACTED WHO ADVISED TO CONTINUE TO TAKE THE VEHICLE BACK TO THE DEALER FOR REPAIRS SINCE IT WAS COVERED BY THE WARRANTY. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 14,000 AND THE CURRENT MILEAGE WAS 22,000.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "10/07/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ACCELERATION ISSUES SEVERAL TIMES WITH THE G5.  ONE INCIDENT HAPPENED WHILE TRYING TO PULL ONTO A BUSY HIGHWAY.  AS I WAS TRYING TO ACCELERATE TO MERGE THE CAR STARTED JERKING ALMOST AS IF IT WERE OUT OF GAS, YET I HAD A FULL TANK.  IT HAS HAPPENED MANY TIMES OTHER THAN THAT, BUT THAT PARTICULAR TIME FRIGHTENED ME AND MY PASSENGERS.  I NOTICE IT MOST OFTEN WHILE DRIVING AND ATTEMPTING TO ACCELERATE TO GO UP HILLS.  WHEN IT HAPPENS GOING UP HILLS, IT IS ALMOST LIKE I LOSE POWER.  THIS PROBLEM SEEMS TO BE EXTREMELY DANGEROUS IN HEAVY TRAFFIC SITUATIONS.  IT DOES NOT MATTER HOW HARD OR SOFT YOU HIT THE ACCELERATOR DURING THIS TIME, IT WILL STILL DO IT.  *TR",
        "vin": "1G2AL18F887"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC G5.  THE CONTACT WAS UNABLE TO TURN THE VEHICLE OFF AND REMOVE THE KEY FROM THE IGNITION.  IN ORDER TO SHUT THE VEHICLE OFF THE CONTACT HAD TO DISCONNECT THE BATTERY.  A MECHANIC FROM AN AUTHORIZED DEALER WAS ABLE TO ASSIST THE CONTACT WITH RESTARTING THE VEHICLE. THE VEHICLE WAS THEN TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THAT  THE MECHANISMS WITHIN THE STEERING COLUMN FRACTURED, LEADING TO THE FAILURE.  THE VEHICLE WAS IN THE PROCESS OF HAVING THE MECHANISMS WITHIN THE STEERING COLUMN REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 44,000.",
        "vin": "1G2AL18F787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "11/26/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10369939,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH WHEN THE PASSENGER SIDE AIR BAG DEPLOYED INDEPENDENTLY. THE PASSENGER WAS STRUCK BY THE AIR BAG AND SUSTAINED A BRUISED EYE. THE VEHICLE HEADLINER WAS DAMAGED DURING THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS AWAITING THE REPAIRS, AS THE PARTS NEEDED FOR REPAIRS WERE NOT READILY AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURE WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGE WAS 25,175.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2008 PONTIAC G6. WHILE TRAVELING 15 MPH THE CONTACT HEARD A HISSING SOUND COMING FROM THE FRONT END OF THE VEHICLE, SECONDS LATER THE POWER STEERING HAD SUDDENLY STOP FUNCTIONING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE FAILURE COULD NOT BE DETERMINED. THE CURRENT AND FAILURE MILEAGES WERE 69000.",
        "vin": "1G2AL18F187"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT WAS ON. I TOOK IT TO FIND OUT WHY IT WAS ON AND WAS TOLD THAT IT WAS PROBABLY BECAUSE OF THE GAS CAP NOT BEING TIGHT ENOUGH. ABOUT 3 DAYS LATER, I FIND A PUDDLE OF GASOLINE UNDERNEATH MY CAR. IT WAS DRIPPING FROM THE TANK. THEN, I TOOK IT IN TO A NEARBY SHOP AND THEY CALLED ME THIS MORNING AND TOLD ME THAT THE SEAL ON MY GAS TANK IS BAD. SO, I'M HAVING TO PAY TO GET THE WHOLE GAS TANK REPLACED. I LOOKED UP RECALLS, AND I NOTICE THAT THEY HAD THIS PROBLEM WITH THE 2007 MODEL OF MY VEHICLE (ONE YEAR OLDER THAN MY CAR). *TR",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "06/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER NORMAL DRIVING CONDITIONS FRONT ROTORS WARPED AT 17,000 MILES AND FIXED UNDER WARRANTY AFTER SHOWING SERVICE MANAGER VEHICLE WARRANTY BOOK.  ROTORS WARPED AGAIN AT 24,000 MILES AND FIXED AGAIN AFTER DISCUSSION WITH SERVICE MANAGER. ROTORS WERE TURNED IN BOTH CASES BY DEALER.  ROTORS ARE WARPING AGAIN , AT 30,000 MILES, FOR THE THIRD TIME AND DEALER REFUSES TO ADDRESS ROTOR WARPING CAUSES BUT BLAMES DRIVER RATHER THAN ROTOR MATERIAL.  DRIVER HAS HAD NO ISSUES WITH BRAKE PADS WHICH LEADS TO ROTORS WARPING TO EXCESSIVE HEAT DO TO POSSIBLE ROTOR MATERIAL DEFECTS. *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "07/21/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC G5. THE CONTACT STATED THERE WAS WATER LEAKING INTO THE VEHICLE FROM AN INTERIOR BOLT UNDER THE STEERING WHEEL AND ONTO ELECTRICAL WIRES. THE DEALER ADVISED THE CONTACT THAT HIS WARRANTY WOULD NOT COVER THE COST OF REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 38,500 AND THE CURRENT MILEAGE WAS APPROXIMATELY  39,000.",
        "vin": "1G2AL18F887"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "06/14/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO PARK MY 2008 PONTIAC G5, THE STEERING WILL LOCK UP. NO WARNING LIGHT OR WARNING MESSAGES COME ON. THE STEERING LITERALLY LOCKS FOR A SECOND AND THEN GOES BACK TO NORMAL. THIS BEGAN HAPPENING AT ABOUT 20,000 MILES. IT WILL DO THIS OCCASIONALLY WITHOUT WARNING. *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "04/05/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTROL ARM BUSHINGS IN A 2008 PONTIAC G5 (CHEVY COBALT TWIN) NEEDED REPLACING AT 34,000 MILES. STEERING WOULD MAKE LOUD NOISES WHEN HITTING BUMPS AND WAS TOLD THAT THE STEERING CAN FALL APART IF NOT REPAIRED.  *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "04/05/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT AND RIGHT REAR AXLE BUSHINGS NEEDED TO BE REPLACED IN A 2008 PONTIAC G5 WITH 34,000 MILES. VEHICLE WOULD MAKE A LOUD METAL TO METAL SOUND WHEN GOING OVER SPEED BUMPS. REAR SHOCKS WERE ALSO REPLACED DUE TO RUBBER MOUNTING BUSHINGS THAT HAD CRACKED AND FALLEN APART. *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMEDIATE SHAFT ON A 2008 PONTIAC G5 WAS REPLACED DUE TO CLUNKING WHEN TURNING THE STEERING WHEEL WHILE VEHICLE IS TRAVELING AT A LOW SPEED. THE PROBLEM STARTED AROUND 15,000 MILES AND THE PART WAS REPLACED BY THE DEALER AT 29,000 MILES. *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "06/22/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 5,
        "numberOfInjuries": 6,
        "odiNumber": 10318887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROACHING A BUSY INTERSECTION, MY PONTIAC G5'S BRAKES FAILED TO WORK. I COULD TELL THE HYDRAULICS SYSTEMS WAS WORKING AS I COULD HEAR METAL ON METAL BUT IT DID NOTHING TO SLOW DOWN THE VEHICLE. THE VEHICLE'S CDR SHOWED THE VEHICLE ACCELERATING AT FULL THROTTLE ALTHOUGH I KNOW MY FOOT WAS ON THE BRAKE PEDAL AS EVIDENCED BY THE METAL ON METAL SOUND. PLUS A WITNESS SAW SMOKE COMING FROM MY VEHICLE. I WAS ABLE TO TURN PRIOR TO GOING THROUGH THE INTERSECTION AND AIMED FOR A FIRE HYDRANT TO TRY TO SLOW DOWN. IT DID NOTHING TO SLOW THE VEHICLE, I TRIED TO TURN RIGHT TO JOIN THE TRAFFIC DIRECTION, BUT THE STEERING DID NOT WORK. I THEN HIT ANOTHER VEHICLE. *TR",
        "vin": "1G2AL18F687"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC G5 COUPE.  WHILE DRIVING APPROXIMATELY 8 MPH IN A PARKING LOT THE CONTACT TRIED TO TURN THE STEERING WHEEL; HOWEVER, IT FAILED TO TURN CAUSING HIM TO CRASH INTO A CONCRETE POST. THE DEALER CONFIRMED THAT THE FAILURE WAS CAUSED BY THE STEERING COLUMN. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10316055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    FALL OF 2009 IN A 2008 PONTIAC G5 [XXX]TRAVELING NORTH ON RT 119 TOWARD INDIANA PA, SLOWING DOWN TO EXIT CAR STEERING FAILED CAR WENT DIRECTLY INTO THE GUARD CAUSING MY MOTHER , SISTER AND HER FRIEND TO BE BROUGHT TO THE HOSPITAL WITH INJURIES. NO AIR BAG DEPLOYMENT AT ALL. *TR",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "07/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE. THE TRANSMISSION BEGAN ACTING UP AND IT FELT LIKE THE TRANSMISSION DIDN'T KNOW WHAT GEAR TO BE IN. DEALERSHIP REPLACED CLUTCHES THAT WERE BINDING AND REPLACED MANY OTHER PARTS. THE TRANSMISSION TO THIS DAY STILL ACTS UP AND HAS A VERY NOTICEABLE JOLT WHEN LETTING OFF THE GAS PEDAL. IT'S ONLY A MATTER OF TIME BEFORE THIS CAR BREAKS DOWN AGAIN. *TR",
        "vin": "1G2AL18F187"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "09/17/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10306978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I  HIT AN OIL SPOT ON I-24 WHICH RESULTED IN A TOTAL LOST OF A 2008 G5 IN 9/09 ; THE CARS FRONT HIT HEAD ON @ 55 MILES AN HR.THE OUTSIDE GUARD RAIL , THEN THE CAR TURN SERVERAL TIMES HITTING THE INSIDE CONCRETE WALL ON BOTH SIDES AND REAR , THE CAR HAD SIDE AND FRONT AIR BAGS WHICH DID NOT DEPLOY, THE STATE TROOPER SAID THAT I WAS LUCKY TO BE ALIVE. MY WIFE CALLED THE PONTIAC DEALER WERE THE CAR WAS TOWED TO. MY WIFE WAS ASKED  HOW BAD WAS I HURT SINCE THE AIR BAGS DIDN'T DEPLOY,WE WERE TOLD WE NEEDED TO FILE A COMPLAINT SOMEONE ELSE MAY NOT BE SO LUCKY.  *CN",
        "vin": "1G2AL18F587"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/30/2009",
        "dateOfIncident": "06/15/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10275325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PAUL MUTERSBAUGH'S 2008 PONTIAC G-5  WAS T-BONED.  HE REMEMBERS TRYING TO STOP THE CAR BY PRESSING THE BRAKE, TO NO AVAIL.  THE AIR BAGS IN THE BACK SEAT DID NOT DEPLOY.  AFTER IMPACT, THE CAR CAUGHT ON FIRE.   THE FIRE SPREAD SO QUICKLY THAT THERE WAS ONLY ENOUGH TIME TO GET THE OCCUPANTS FROM THE BACK SEAT OUT.  NOT EVEN ENOUGH TIME TO SAVE ANYTHING IN THE CAR.  THE CAR BURNT TO THE GROUND.  NOTHING BUT A SHELL IS LEFT.  I MET A GENTLEMAN AT THE LAS VEGAS TRUCK SHOW ON JUNE 25TH.  HE SAID YOU COULD SEND SOMEONE OUT TO LOOK AT THE CAR TO SEE WHAT HAPPENED.  THE INSURANCE CARRIER IS KEEPING THE CAR AT: COPART SALVAGE YARD, LOT 13749849, 1475 BLUFF CITY BLVD., ELGIN, IL.  60120.  WE WOULD GREATLY APPRECIATE SOMEONE VERIFYING THAT THE AIR BAGS DID NOT DEPLOY, THE CAR SHOULD NEVER HAVE BURNT TO THE GROUND WITH OUT SOMETHING BEING DEFECTIVE WITH THE CAR AND TO SEE IF THE BRAKES FAILED. THANK YOU IN ADVANCE FOR YOUR ASSISTANCE IN THIS MATTER. *TR",
        "vin": "1G2AL18F387"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2008",
        "dateOfIncident": "09/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244322,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC G5 GT TRUNK MOUNTED REAR SPOILER IS MOUNTED SO HIGH THAT IT SIGNIFICANTLY OBSTRUCTS THE VIEW IN THE REAR VIEW MIRROR.  I CONSIDER THIS TO BE A VALID SAFETY FACTOR AND THE SPOILER SHOULD BE REMOVED. *TR",
        "vin": "1G2AN18B387"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/25/2008",
        "dateOfIncident": "07/22/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10239696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2008 PONTIAC G5, SHE WAS INVOLVED IN A 3 VEHICLE ACCIDENT.  A CAR IMPACTED A MINI VAN ON THE SIDE CAUSING THE CAR TO BOUNCE OFF THE MINIVAN AND TRAVELING SIDEWAY INTO OUR PONTIAC G5.  THE G5 WAS STRUCK ON THE DRIVER DOOR SENDING THE G5 SIDEWAYS AND ALMOST TURNING OVER.  A TREE STOPPED THE VEHICLE FROM TURNING OVER.  WE PURCHASED THE CAR BECAUSE THE DEALER AND GM STATED THE VEHICLE HAD FRONT, SIDE AND CURTAIN AIRBAGS.  THE VEHICLE DID NOT HAVE SIDE AIRBAGS AND THE CURTAIN AIRBAGS DID NOT DEPLOY.  GM STATED THAT THEY ONLY DEPLOY IN ROLLOVERS, BUT THAT'S NOT WHAT THERE BROCHURES, WEBSITE AND OTHER ITEMS I HAVE SAID.  ALSO THEY STATE THAT ALL 2008 PONTIAC'S HAVE ONSTAR AND THIS CAR DOES NOT.  GM SENT A INDEPENDENT ENGINEER TO CHECK THE VEHICLE'S RECORDER AND NOW THEY STATE THAT EVERYTHING IS OK.  THEIR ENGINEER CANNOT BE IMPARTIAL DUE TO THE FACT THAT HE WORK FOR GM AND IS RETIRED AND RECEIVING A PENSION!!  MY WIFE AND MOTHER IN LAW WAS INJURED AS WELL AS CAUSING OVER $6100.00 WITH THE VALUE OF THE VEHICLE BEING $17,400 OR 35% OF THE VALUE.  CAN YOU HELP  THANK YOU HOWARD BERKOWITZ.  *TR",
        "vin": "1G2AL18FX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2008",
        "dateOfIncident": "05/21/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC G5  PASSENGER AIR BAG SYSTEM WILL NOT ARM WHEN WIFE SITS ON PASSENGER SIDE.  *TR",
        "vin": "1G2AL18F087"
    }
]