[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353835,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT HER AIR BAG WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT TOOK THE VEHICLE TO WUERFLEIN CHEVROLET BUICK GMC (2527 BRIDGE AVE, ALBERT LEA, MN 56007) TO BE REPAIRED UNDER THE RECALL. UPON RETURN OF THE VEHICLE, THE CONTACT DISCOVERED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED DESPITE THE REPAIR. THE CONTACT CALLED THE SAME DEALER BACK AND WAS INFORMED SHE HAD TO PAY A DIAGNOSTIC FEE TO HAVE THE VEHICLE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS PROVIDED A CASE NUMBER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.  *BF  *TR",
        "vin": "5Y2SL65858Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. HONOLULU BUICK GMC LOCATED AT 2945 N NIMITZ HWY, HONOLULU, HI 96819, WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *BF  *JS",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337716,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL LETTER FROM PONTIAC IN MILWAUKEE, WISCONSIN DATED OCTOBER 2019 STATING THAT THE FRONT PASSENGER AIR BAG ASSEMBLY CONTAINING AN INFLATOR IS DEFECTIVE. THE AIR BAG MAY NOT UNFOLD AS DESIGNED DURING INFLATION DURING HIGH TEMPERATURE CONDITIONS .WHAT COULD HAPPEN IS THAT A PORTION OF THE AIR BAG MATERIAL COULD BE TORN DURING DEPLOYMENT, OR THE BAG PLATE COULD BE DAMAGED. SUCH DAMAGE DURING DEPLOYMENT COULD CAUSE THE AIR BAG NOT TO PROPERLY INFLATE, AND THIS COULD INCREASE THE RISK OF OCCUPANT INJURY IN THE EVENT OF A CRASH. THE LETTER FURTHER STATES THAT PARTS ARE NOT CURRENTLY AVAILABLE. A RECENT CALL TO THE PONTIAC CUSTOMER ASSISTANCE CENTER CONFIRMED THAT THE PARTS ARE STILL NOT AVAILABLE TO REPAIR THIS VEHICLE. DUE TO THIS POTENTIAL HAZARD I HAVE NOT HAD ANYONE SIT IN THE PASSENGER SIDE OF MY VEHICLE SINCE THE SAFELY RECALL LETTER WAS SENT TO ME ALMOST NINE MONTHS AGO. IN FACT THERE WAS ALREADY ONE OTHER SAFETY RECALL ON THIS SAME AIRBAG SOME TIME AGO THAT I HAD REPLACED AT MY LOCAL GM DEALER IN KINGMAN, AZ. I AM REPORTING THIS TO YOU BECAUSE I FEEL THAT WAY TOO MUCH TIME HAS GONE BY WITHOUT ANY PART REPLACEMENT AVAILABLE FOR THIS AIRBAG .SINCE THIS DEFECT COULD INCREASE THE RISK OF OCCUPANT INJURY IN THE EVENT OF A CRASH, I FEEL THAT THIS COMPANY HAS BEEN UNDULY NEGLIGENT IN NOT PROVIDING A REPLACEMENT PART SINCE THE SAFETY RECALL NOTICE WAS SENT TO ME IN OCTOBER 2019. CAN ANYTHING BE DONE ABOUT THIS? THE GM SAFETY RECALL # IS N192273760.",
        "vin": "5Y2SL67898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "08/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIRBAG) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE.  THE CONTACT CALLED THE DEALER KINGMAN CHEVROLET BUICK  (ADDRESS: 3730 STOCKTON HILL RD, KINGMAN, AZ 86409; PHONE: (928) 757-4041) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL67898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER :19V627000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL67808Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/23/2020",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED GM ABOUT THE RECALL AND THEY TOLD ME THAT THEY DON'T HAVE THE PART YET AND WHEN THE GET THE PART IN THEY WOULD CONTACT ME TO REPLACE IT BUT THAT WAS IN 2019 AND NEVER HERD FROM THEM THIS VERY DAY.  *TR",
        "vin": "5Y2SL658X8Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325366,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED LETTER FROM PONTIAC DATED OCT 2019 THAT FRONT PASSENGER AIRBAG IS DEFECTIVE AND MIGHT NOT INFLATE AND COULD INJURE PERSON IN A CAR CRASH.  REPAIR PARTS WERE NOT READY IN OCT 2019.      IT IS NOW SEVEN MONTHS LATER.  ARE THE PARTS STILL NOT READY?  WHEN WILL THEY BE READY?    NOTHING HAS HAPPENED YET, BUT THIS IS WORRISOME.      I RECEIVED THE LETTER 10/21/2019.  THE DEALER HAS NO REPAIR PARTS.  IT IS SEVEN MONTHS LATER.  *TR",
        "vin": "5Y2SL67868Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SULLIVAN BUICK GMC, INC (777 W DUNDEE RD, ARLINGTON HEIGHTS, IL 60004, (847) 505-0435) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *JS",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321952,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PART WOULD BE AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *BF*JB",
        "vin": "5Y2SL67838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT MADE AWARE OF THE ISSUE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DT*JB",
        "vin": "5Y2SL65878Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000(AIR BAGS) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SCHUKEI CHEVROLET INC LOCATED AT (721 S MONROE AVE, MASON CITY, IA 50401) WAS CONTACTED AND CONFIRMED PARTS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT EXPERIENCED THE AIR BAG WARNING LIGHT BEING ILLUMINATED BRIEFLY. THE FAILURE MILEAGE WAS 99,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65868Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCE A FAILURE.",
        "vin": "5Y2SL65848Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED MULTIPLE NOTICES TELLING US THE CAR HAS A RECALL ON THE AIRBAG. WE TOOK IT TO A DEALER, THAT THE RECALL NAMED, AND THEY TOLD US THAT RECALL # N150815 IS PENDING THROUGH GENERAL MOTORS AND THERE IS NO REMEDY AT THIS TIME. WHEN I SPOKE TO GENERAL MOTORS THEY SAID THEY WOULD CONTACT US WHEN A FIX IS READY, AND NO ONE SHOULD RIDE IN THE PASSENGER SIDE OF THE CAR.",
        "vin": "5Y2SL65828Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED A NOTIFICATION IN THE MAIL FOR NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS). THE CONTACT SPOKE WITH LUTHER HUDSON CHEVROLET GMC (1220 CREST VIEW DR, HUDSON, WI 54016, (715) 690-1809) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE PART WAS NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65808Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280096,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC VIBE. CONSUMER WRITES IN REGARDS TO FRONT PASSENGER SIDE AIRBAG SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME COMPLETING THE RECALL REPAIR. *JS",
        "vin": "5Y2SL67808Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED A RECALL NOTIFICATION IN THE MAIL FOR NHTSA CAMPAIGN NUMBER: 19V627000 (AIR BAGS). THE CONTACT SPOKE WITH TURNER CHEVROLET (21001 CROSBY FWY, CROSBY, TX 77532 (281) 328-4377) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. WHILE OPERATING THE VEHICLE, THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. SHELDON BUICK (855 ROCHESTER RD, ROCHESTER HILLS, MI) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "5Y2SL65828Z"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11015216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A DRIVEWAY THE VEHICLE ACCELERATED ON ITS OWN CONTINUING FORWARD WITH BRAKE APPLIED EVEN LEAVING SKID MARKS UNTIL RUNNING INTO A STONE COLUMN. WOULD HAVE CRASHED INTO THE HOUSE INSTEAD THE COLUMN IF HADN'T STEERED HARD TO THE RIGHT.",
        "vin": "5Y2SL65888Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS). THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE DEALER (IDAHO CENTER AUTO MALL IN CALDWELL, ID, (208)467-7000) AND WAS INFORMED THAT THE REMEDY PART FOR THE REPAIR WAS BEING ORDERED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5Y2SL65828Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V006000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL  DEALER (STYKEMAIN CHEVROLET PONTIAC LOCATED AT 211 E PERRY ST PAULDING, OH 419- 399- 2071) WAS CONTACTED AND CONFIRMED THAT THE REMEDY PARTS WERE ON BACKORDER. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SP67099Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  MY PONTIAC VIBE IS PART OF THE AIRBAG RECALL THROUGH GM. MY FIRST APPOINTMENT WITH KING O'ROURKE IN SMITHTOWN, NY, WAS JULY 28, 2016. AFTER WAITING 90 MINUTES, I WAS TOLD THEY DID NOT HAVE THE RIGHT PART. I DO NOT KNOW WHY THEY DID NOT KNOW THIS WHEN THEY MADE THE APPOINTMENT OR WHEN I CHECKED IN (THE KING O'ROURKE CHECK-IN PROCESS CAN TAKE UP TO 20 MINUTES).  THEY SAID THEY WOULD ORDER THE PART AND CALL ME WHEN IT WAS AVAILABLE. THEY NEVER CALLED ME. I CALLED THEM IN EARLY NOVEMBER 2016 AND THEY SAID THEY HAD THE PART AND SET UP AN APPOINTMENT FOR NOV. 30, 2016.  I ARRIVED AT 7:45 A.M. AND WENT THROUGH CHECK-IN AND WAS TOLD AT 8:45 THAT THEY DID NOT HAVE THE PART. AGAIN, I DON'T KNOW WHY THEY WOULD NOT KNOW THIS WHEN THEY MADE THE APPOINTMENT OR WHEN I FIRST CHECKED IN.  SO THE LATET PLAN IS THEY SAY THEY HAVE TO REORDER THE PROPER PART AND THEY WILL CONTACT ME WHEN IT ARRIVES.  I HAVE NOT HAD ANY PROBLEMS WITH MY AIRBAGS. JUST A BIG PROBLEM GETTING THE RECALL COMPLETED WITH KING O'ROURKE.",
        "vin": "5Y2SL67828Z"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/24/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING WOULD RANDOMLY QUIT WHILE DRIVING.  NEEDED TO REPLACE POWER STEERING CONTROL MODULE.",
        "vin": "5Y2SM67079Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR.  THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5Y2SL65848Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V127000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5Y2SL65808Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. WE RECEIVED A LETTER IN JUNE THAT THE PARTS FOR THIS RECALL WERE AVAILABLE. WE MADE AN APPOINTMENT WITH THE DEALER FOR JULY 7TH TO HAVE THE REPAIRS MADE. WHEN WE ARRIVED THEY SAID THEY ONLY SOME OF THE PARTS. IT IS NOW AUG 15 AND THEY STILL DO NOT HAVE THE PARTS. WHAT IS THE DEAL? PONTIAC WAS NO HELP IN SOLVING THIS MATTER. WE CALLED THEM TODAY AND TOLD US PARTS WERE ON BACK ORDER. SOME ONE NEEDS TO CLEAR THIS UP. WE WILL BE LEAVING THE AREA IN ABOUT 6 WEEKS. WHY THE LETTER IF YOU DON'T HAVE THE PARTS?",
        "vin": "5Y2SL65888Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000  (AIR BAGS)  HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG  RECALL,THEY KEEP SENDING ME PAPERS TO GET IT FIXED AND WHEN I CALL MY DEALER THEY DON'T HAVE ANY TO FIX IT...SO I CAN'T EVEN LET ANYONE SIT IN MY PASSENGER SEAT.FOR SIX MONTHS NOW?",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - RECEIVED RECALL NOTICE ABOUT 3 MONTHS AGO.  SEVERAL WEEKS AGO RECEIVED LETTER THAT PARTS WERE IN AND TO CALL LOCAL DEALERSHIP FOR REPAIR.  I DID THIS AND THE DEALERSHIP (STROSNIDER CHEVROLET) SCHEDULED AN APPOINTMENT FOR THE RECALL REPAIR.  WHEN I SHOWED UP AT THE DEALERSHIP THEY HAD NO PARTS FOR THE RECALL REPAIR AND COULD NOT EXPLAIN WHY THEY SCHEDULED THE REPAIR FOR ME.",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS) WAS RECEIVED. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS) WAS RECEIVED. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65868Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "04/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V127000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5Y2SL67868Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873362,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65818Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS) WAS RECEIVED IN MARCH OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5Y2SL65828Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT THE REPAIR FOR NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN APRIL OF 2016. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10869924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC VIBE.  CONSUMER WRITES IN REGARDS TO NO CURRENT REMEDY OR TIME FRAME TO REPAIR RECALL NOTICE 16V-127.  *SMD",
        "vin": "5Y2SL67878Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS). THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL658X8Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "04/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864647,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65888Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V128000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL65818Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - GM REPEATEDLY FAILING TO RESPOND OR COMMIT TO REPAIR RECALLED VEHICLE. RECEIVED LETTER ABOUT RECALL 15815 LAST WEEK. REPRESENTATIVE AT PONTIAC (REF #[XXX], 4/21/16) CONFIRMED THAT THE VEHICLE, WHICH IS MY PRIMARY SOURCE OF INCOME (STUDENT AND RIDESHARE DRIVER) IS UNDER RECALL AND THAT NO ONE SHOULD OCCUPY PASSENGER SEATS UNTIL REPAIR IS MADE. MANUFACTURER IS UNABLE TO PROVIDE EVEN AN ESTIMATE OF DATE FOR PARTS AVAILABILITY AND CURRENTLY HAS LOWEST COMPLETION OF REPAIRS ACCORDING TO NHTSA. I HAVE CONTACTED THE DEALER (CHAPMAN CHEVROLET, TEMPE, AZ) IN PERSON, WAS TOLD BY SERVICE CONSULTANT [XXX] TO CONTACT [XXX] PARENT FOR RECALL SCHEDULING, BUT THAT SHE WAS OUT OF THE OFFICE AT THAT TIME. I CONTACTED [XXX] BY PHONE AND LEFT MESSAGES WHICH WERE NOT RETURNED ON TWO CONSECUTIVE DAYS. I WENT TO DEALERSHIP AND MADE CONTACT WITH HER IN PERSON ON 4/22/16. I WAS BROUGHT BACK TO HER OFFICE, WHERE HER COWORKERS WERE JUST BROWSING HUFFINGTON POST ARTICLES. SHE AGREED DEALERSHIP WOULD CALL ON MONDAY 4/25/16 TO PROVIDE AN UPDATE AFTER SPEAKING WITH AREA GM REP \"[XXX]\" TO SEE IF A LOANER OR DEALER PURCHASE OF THE VEHICLE WERE POSSIBLE. AS OF THE END OF WORK 4/25/16 [XXX] HAS AGAIN NOT RETURNED THE CALL. I ATTEMPTED TO CONTACT HER ONCE AGAIN AND LEFT A MESSAGE. I HAVE LOST CONFIDENCE THAT GM IS TAKING CARE OF THEIR CONSUMERS IN THIS RECALL. WHILE THEY STALL AND FAIL TO PROVIDE TIMELY REPAIR OR RESPONSE, I AM LEFT WITH AN UNSAFE CAR, NO INCOME, AND NO COMMITMENT THAT EITHER WILL CHANGE. I AM UNWILLING TO SELL THE CAR TO ANOTHER PRIVATE PARTY WHO WOULD BE ENDANGERED BY THE UNREPAIRED CAR. PLEASE HELP - THANK YOU!!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5Y2SL65878Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "04/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I RECEIVED A RECALL FOR MY AIRBAG. NEITHER THE DEALER OR GM CAN EVEN GIVE ME AN ESTIMATE AS TO WHEN REPAIR PARTS WILL BE RECEIVED. ON TOP OF THAT, THE RECALL STATES THAT \"\"UNTIL THE REPAIR IS PERFORMED, THE FRONT PASSENGER SEAT SHOULD NOT BE OCCUPIED \". I REGULARLY USE THIS VEHICLE TO CARPOOL WITH FOUR ADULTS. THIS RENDERS MY CAR AS UNUSABLE! NEITHER THE DEALER OR GM HAD EVEN A TEMPORARY SOLUTION. I AM AT A LOSS AS WHAT TO DO NEXT.",
        "vin": "5Y2SL658X8Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I RECEIVED A RECALL NOTICE FROM PONTIAC.  WHEN I CONTACTED THEM ABOUT THE RECALL I WAS TOLD THEY HAD NO IDEA WHEN PARTS WOULD BE AVAILABLE TO FIX IT AND THAT UNTIL THE REPAIR IS PERFORMED, THE FRONT PASSENGER SEAT SHOULD NOT BE OCCUPIED.  THIS IS IMPOSSIBLE GIVEN THE SIZE OF MY FAMILY NOT TO USE THE FRONT PASSENGER SEAT.  WHEN I ASKED ABOUT A RESOLUTION TO THIS SITUATION THEY SAID IT WAS NOT THEIR PROBLEM AND REFUSED TO DIRECT MY CONCERN TO A SUPERVISOR OR MANAGER.  I REQUESTED THE EMAIL ADDRESS OF THE VP OF GLOBAL VEHICLE SAFETY ([XXX] ) WHO SENT ME THE LETTER AND THEY INFORMED ME THAT IT WAS NOT AVAILABLE.  SO GM IS TELLING ME THAT I CAN'T SAFELY USE THE CAR FOR WHAT I PURCHASED FOR.  THIS IS UNACCEPTABLE AND I WANT TO KNOW WHAT RECOURSE I HAVE IN THIS SITUATION.  THANK YOU FOR YOUR ASSISTANCE WITH THIS MATTER.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2016",
        "dateOfIncident": "04/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V127000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT MENTIONED THAT THE DEALER REFUSED TO PROVIDE A LOANER VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5Y2SL67898Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2014",
        "dateOfIncident": "01/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SENT THE NHTSA COMPLAINTS TWICE-ON 11/10/13 #10551685 AND ON 7/23/14#10615814 ABOUT AIRBAG LIGHT ON WHICH THE AUTO MECHANICS TOLD ME THE AIRBAGS MIGHT NOT WORK IN THE EVENT OF AN ACCIDENT!SINCE THERE HAVE BEEN NUMEROUS RECALLS BECAUSE OF FAULTY AIRBAGS I DO NOT UNDERSTAND WHY MY VEHICLE HAS NOT BEEN RECALLED!  *TR",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I  ORIGINALLY SENT THIS COMPLAINT IN NOV.2013,ODI#10551685. AIRBAG LIGHT IS STILL ON AND WITH ALL THE GM RECALLS WONDERING WHY THIS ISN'T ONE OF THEM.ONE WEBSITE I CHECKED SAID SOMETHING ABOUT A CABLE CAUSING THIS PROBLEM BUT IT ONLY COVERED 2009-2010 MODELS. WHY AREN'T THE 2008 MODELS INCLUDED SINCE THIS SEEMS TO BE THE PROBLEM WITH MY CAR.  *TR",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615835,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOT HAD AN ACCIDENT, HOWEVER WHEN THE STREETS ARE WET, MY ENGINE LIGHT GOES ON AND THE POWER STEERING GOES OFF.  THIS HAS HAPPENED TWICE THIS WEEK AND HAVE HAD TO LEAVE THE ROAD BECAUSE I COULD NOT STEER.  I TOOK THE CAR TO RON NORRIS DEALERSHIP IN TITUSVILLE, FLORIDA AND WAS TOLD THERE WAS NOTHING THEY COULD DO.  I WOULD HATE TO GET HURT MYSELF OR KILL SOMEONE ELSE.  WHAT CAN I DO?  *TR",
        "vin": "5Y2SL65818Z"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ON-NO CRASH OF ANY KIND-DEALER SAID WAS DEFECTIVE SENSOR CONNECTED TO SEAT WOULD COST OVER $600 JUST FOR THE SEAT-THEN AROUND SEPTEMBER 2013 OVERDRIVE ENGAGES EVERY TIME IS PUT IN DRIVE AND WILL ONLY DISENGAGE BY PUTTING INTO NEUTRAL THEN DRIVE.  *TR",
        "vin": "5Y2SL65838Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2013",
        "dateOfIncident": "08/24/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE MILE INTO COMMUTE, THE ACCELERATOR PEDAL DIDN'T RESPOND AFTER STOPPING, THEN SUDDENLY RESPONDED CAUSING CAR TO ACCELERATE RAPIDLY. REPEATED TWICE BEFORE THE CHECK ENGINE LIGHT CAME ON. STOPPED CAR, SHUT THE CAR OFF, CHECKED GAS CAP WAS FASTENED SECURELY. RESTARTED CAR. THE CHECK ENGINE LIGHT REMAINED ILLUMINATED. TURNED AROUND AND PROCEEDED THE ONE MILE HOME. COASTED INTO THE PARKING GARAGE AND STOPPED THE CAR TO WAIT FOR THE GARAGE DOOR TO CLOSE. WHILE COMPLETELY STOPPED THE CAR TRIED TO ACCELERATE WITHOUT ANY INPUT TO THE GAS PEDAL. THE RPM'S INCREASED AND THE CAR TRIED TO DRIVE FORWARD. THE RPM'S DIDN'T DECREASE UNTIL THE CAR WAS PLACED IN NEUTRAL. THE SUDDEN RPM INCREASE WHILE STOPPED CAUSED THE TIRES TO SQUEAL AGAINST THE SMOOTH PAVEMENT IN THE PARKING GARAGE. SHUT THE CAR OFF, PLACED IN PARK, RESTARTED THE CAR AND PULLED INTO MY PARKING SPOT. THE NEXT DAY STARTED THE CAR AND THE CHECK ENGINE LIGHT WAS STILL ILLUMINATED. DROVE THE CAR APPROXIMATELY 5 MILES TO THE DEALER WITHOUT INCIDENT.  DEALER INITIALLY REFUSED TO PROVIDE A COPY OF THE ORDER AND AFTER INSISTING ON HAVING A COPY THE SERVICE MANAGER NEGLECTED TO INDICATE ON THE WORK ORDER THAT THE CAR SUDDENLY ACCELERATED WITHOUT INPUT TO THE ACCELERATOR PEDAL. DEALER REFUSED TO COVER THE COST OF REPLACING THE ACCELERATOR PEDAL POSITION SENSOR UNDER WARRANTY AND ARGUED THAT THE SUDDEN ACCELERATION WITHOUT INPUT OR RANDOM INCREASED RPM VIOLATES THE 8/80K EPA WARRANTY OR MODERN SAFETY STANDARDS.  CONTACTED GM WARRANTY WHO ALSO REFUSED TO COVER THE REPLACEMENT COST UNDER EPA OR SAFETY WARRANTY.  *TR",
        "vin": "5Y2SL65888Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2011",
        "dateOfIncident": "07/05/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC VIBE. CONSUMER WRITES IN REGARDS TO SAFETY RECALL CONCERNING ENGINE STALLING WHILE DRIVING *TGW  THE CONSUMER STATED HE TOOK THE VEHICLE TO A REPAIR FACILITY THINKING THE VEHICLE WOULD BE REPAIRED. HOWEVER, THEY INFORMED HIM, THE VEHICLE NEEDED A NEW PART AND THEY WOULD CALL HIM ONCE THE PART ARRIVED. THE CONSUMER STATED HE NEVER HEARD FROM THEM AGAIN. THE CONSUMER STATED HE CALLED FOR OVER A MONTH, ONLY TO BE TRANSFERRED SEVERAL TIMES TO DIFFERENT PEOPLE WITHIN THE COMPANY. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2011",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT WAS DRIVING APPROXIMATELY 65 MPH, AND SUDDENLY THERE WAS A REDUCTION IN THE ENGINE POWER. WHEN AT A COMPLETE STOP THE ENGINE WOULD STALL WHILE THE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL AND WITHIN A FEW MINUTES THE ENGINE WOULD RESTART. NHTSA RECALL CAMPAIGN ID NUMBER 10V387000 (ENGINE AND ENGINE COOLING) WAS RELATED TO THE FAILURE.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY STATED THE PART DID NOT REQUIRE REPLACEMENT AND REFUSED TO REPAIR THE VEHICLE, EVEN THOUGH THE CONTACT EXPERIENCED THE CONSEQUENCE MENTIONED IN THE RECALL. THE CONTACT WILL NOTIFY THE MANUFACTURER OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "5Y2SL65878Z"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/13/2011",
        "dateOfIncident": "03/11/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389994,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 3 YEAR OLD SON RIDES IN A CARSEAT THAT IS INSTALLED USING THE LATCH SYSTEM, 2 DAYS AGO HE GOT THE CAR'S SEATBELT AND MANAGED TO GET IT WRAPPED AROUND HIS NECK WHEN HE LET GO OF THE SEATBELT THE SEATBELT  LOCKED. WHEN I REALIZED WHAT HAD HAPPENED I WAS ABLE TO PULL OVER AND AFTER ATTEMPTING TO GET THE SEATBELT TO UNLOCK WITHOUT ANY SUCCESS THE SEATBELT HAD TO BE CUT TO GET IT FROM AROUND HIS NECK. MY SON LUCKILY CAME THROUGH WITHOUT ANY PERMANENT INJURY.  *TR",
        "vin": "5Y2SL65808Z"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/08/2011",
        "dateOfIncident": "02/03/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FEB 3, 2011 WAS THE FIRST OCCURRENCE.  I PUT THE CAR IN REVERSE THEN PULLED FORWARD, TURNING THE WHEEL TO THE RIGHT TO GIVE MYSELF ROOM TO BACK UP AND TURN MY CAR SO I COULD PULL OUT ONTO A BUSY STREET GOING FORWARD RATHER THAN BACKING OUT INTO TRAFFIC.  I WAS GOING VERY SLOWLY AND APPLIED THE BRAKES WHEN THE CAR SUDDENLY ACCELERATED VERY FAST.  IT RAN UP AN 18\" ROCK WALL, PUSHING THE BRAKE DID NOTHING, I TURNED THE WHEEL TO THE RIGHT TO AVOID A TREE WHILE STILL TRYING TO BRAKE.  THE BRAKE FINALLY HELD.  A TIRE WAS DESTROYED, IT WAS REPLACED AND TAKEN TO MY MECHANIC WHO FOUND NO FURTHER DAMAGE AND NO REASON FOR THE ACCELERATION.  AFTER LEAVING THE MECHANIC I NOTICED THAT IT SEEMED A BIT JERKY.  TWO DAYS LATER I TURNED THE CAR ON WHILE SITTING IN A PARKING LOT WITH MY FOOT ON THE BRAKE, I WAS STILL IN PARK SO THE CAR DID NOT MOVE, BUT IT DID ACCELERATE.  IT SEEMED OK AFTER THAT, MONDAY WHEN I RETURNED TO TOWN I DISCUSSED IT WITH MY MECHANIC AND NOTICED A REPORT ON BLOOMBERG ABOUT THE ISSUE WITH TOYOTA ACCELERATION PROBLEMS AND THAT THE PROBLEM WAS ALSO WITH 2009 AND 2010 PONTIAC VIBES..  I CHECKED THIS SITE AND FOUND 2 COMPLAINTS ABOUT MY SAME ISSUE WITH THE 2008 PONTIAC VIBE. *TR",
        "vin": "5Y2SL67838Z"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2010",
        "dateOfIncident": "09/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT THE SWAY BAR LINK FRACTURED FROM THE VEHICLE. THE CONTACT HAD AN INDEPENDENT CERTIFIED MECHANIC AND A WELDER INSPECT THE VEHICLE AND BOTH FOUND THAT COMPONENT WAS NOT ORIGINALLY WELDED ONTO THE VEHICLE PROPERLY. THE CONTACT STATED THAT VEHICLE WAS NEVER INVOLVED IN A CRASH. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 60,000.    UPDATED 12/30/10  *BF   UPDATED 01/10/11*JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC VIBE. THE CONTACT STATED THAT WHILE DRIVING FOR 2 MILES WITHOUT TOUCHING THE ACCELERATOR; SHE SLOWLY APPLIED THE BRAKES AND THEY MADE A LOUD CLANKING NOISE. WHILE DRIVING UP HILL IN HER DRIVEWAY THE VEHICLE WAS TRAVELING ABOUT 20 MPH ON IT'S OWN. THE VEHICLE WAS NOT REPAIRED. DIAGNOSTIC TEST HAVE BEEN PERFORMED ON THE VEHICLE SEVERAL TIMES FOR VARIOUS REASONS. THE FAILURE AND CURRENT MILEAGES WERE 18,500.",
        "vin": "5Y2SL65868Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 PONTIAC VIBE ACCELERATED WITHOUT WARNING. CONSUMER SLAMMED ON THE BRAKES BUT IT DIDN'T STOP THE VEHICLE.  *KB  THE CONSUMER STATED THE VEHICLE FINALLY RESUMED NORMAL OPERATION. THE CONSUMER DISCOVERED THERE WAS A RECALL, BUT WHEN SHE WENT TO THE DEALER, SHE WAS INFORMED ONLY THE 2009 AND 2010 VEHICLES WERE BEING REPAIRED UNDER THE RECALL. *JB",
        "vin": "5Y2SL65848Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/14/2010",
        "dateOfIncident": "09/02/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE MONITOR DEVICES ON OUR 2008 PONTIAC VIBE (WITH 23000 MILE) HAD TO BE BROKEN OFF TO REPLACE TWO TIRES NEEDED ON THE VEHICLE.    PONTIAC WOULD NOT COVER THE REPLACEMENT OF THE TPMS (EVENTHOUGH THE VEHICLE WAS UNDER THE 36,000 MILE/3YR WARRANTY) BECAUSE THAT CLAIM I HAD CHANGED THE VALVE COVERS ON THE VALVE STEMS WITH STEEL CAPS.    NEITHER I NOR THE PREVIOUS OWNER HAD REPLACED THE VALVE COVERS BUT THE VEHICLE CAME FROM THE  PONTIAC DEALERSHIP THAT WAY. *TR",
        "vin": "5Y2SL65858Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2009",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10260194,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC VIBE.  WHILE DRIVING 50 MPH, THE CONTACT WAS INVOLVED IN A HEAD ON CRASH WITH A SEMI TRUCK.  THE AIR BAGS FAILED TO DEPLOY.  PRIOR TO THE CRASH, THE VEHICLE WAS TAKEN TO THE DEALER ON FOUR OCCASIONS REGARDING THE ABS.  WHEN THE VEHICLE WAS RETRIEVED, THE CONTACT HEARD A SQUEAKY NOISE AND TOOK THE VEHICLE BACK TO THE DEALER.  NEW BRAKES PADS WERE PLACED ON THE VEHICLE AT THAT TIME.  AFTER THE CRASH, THE VEHICLE WAS TOWED AND TAKEN IN FOR A DIAGNOSTIC.  A POLICE REPORT WAS FILED.  THE CONTACT SUSTAINED MAJOR INJURIES TO THE KNEES AND HEAD, INCLUDING A BROKEN WRIST AND BACK PAINS.  THE FAILURE AND CURRENT MILEAGES WERE 50,000.",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "04/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC VIBE.  WHILE DRIVING 55 MPH, THE CONTACT NOTICED A VIBRATION IN THE STEERING WHEEL.  HE PULLED THE VEHICLE OVER AND NOTICED THAT THE FRONT PASSENGER SIDE TIRE WAS FLAT.  THE TIRE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE VALVE STEM WAS FAULTY.  THE CONTACT DOES NOT KNOW THE MANUFACTURER OF THE VALVE STEM.  THE CURRENT AND FAILURE MILEAGES WERE 38,900.   UPDATED 09/15/08 *BF  THE CONSUMER HAS EXPERIENCED 3 VALVE STEM FAILURES. UPDATED 09/17/08. *JB",
        "vin": "5Y2SL62824Z"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/13/2008",
        "dateOfIncident": "04/22/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10227641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 PONTIAC VIBE.  ON APRIL 22, 2008, WHILE DRIVING 35 MPH, THE CONTACT'S VEHICLE WAS STRUCK ON THE FRONT PASSENGER DOOR BY ANOTHER VEHICLE.  THE DRIVER'S SIDE SEAT BELT FAILED TO RESTRAIN THE CONTACT, CAUSING HER TO STRIKE AND INJURE HER HEAD AGAINST THE DASHBOARD.  THE PASSENGER RECEIVED INJURIES TO HER LEGS.  THE INSURANCE COMPANY INVESTIGATION DISCOVERED THAT THE DRIVER'S SIDE SEAT BELT BOLT FAILED, WHICH CAUSED THE SEAT BELT TO FAIL.  THE INSURANCE COMPANY DECLARED THE VEHICLE TO BE DESTROYED.  THE FRONT DRIVER AND PASSENGER SIDE AIR BAGS FAILED TO DEPLOY.  THE FAILURE MILEAGE WAS 2,000.",
        "vin": "5Y2SL65898Z"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2008",
        "dateOfIncident": "02/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224635,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RENTED A 2008 PONTIAC VIBE ON 2-9-08 FROM THE FT. LAUDERDALE AIRPORT AND WE WERE DRIVING ABOUT 115 MILES TO ISLAMORADA FL.  ABOUT 1 MILE FROM OUR DESTINATION WE HEARD A TREMENDOUS NOISE FROM THE BACK SEAT AREA THAT SOUNDED LIKE AN EXPLOSION.  WE NOTICED THAT THE WINDOW IN THE BACK HAD SHATTERED.  WE HAD NO IDEA WHY IT HAD SHATTERED.  SINCE THAT TIME WE HAVE READ NEWS ACCOUNTS ABOUT CERTAIN PONTIAC VIBES EXPERIENCING SPONTANEOUS SHATTERING OF PASSENGER DOOR WINDOWS.  JUST WANTED TO PASS THIS ALONG IN THE NAME OF SAFETY.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "03/29/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "VIBE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DESCRIPTION OF MALFUNCTION: ENGINE ACCELERATED WHEN BRAKE WAS APPLIED.    THIS CONDITION OCCURRED ONCE, BUT COULD HAVE CAUSE AN ACCIDENT.  ON SATURDAY 3/29/08 (NO RAIN; TEMP 35 DEG F) , I WAS DRIVING ON A WINDING RURAL ROAD AND GOING AROUND 30 MPH. THE CRUISE CONTROL WAS OFF.  I STARTED BRAKING SINCE I WAS GOING DOWN A SLIGHT GRADE AND GETTING CLOSE TO A RED TRAFFIC LIGHT.  SUDDENLY THE CAR STARTED SPEEDING UP, EVEN WITH MY FOOT ON THE BRAKE.  I NOTICED THAT THE IDLE WAS AROUND 3,000 RPM.  I MANUALLY THREW THE AUTOMATIC GEAR SHIFT INTO NEUTRAL AND THE CAR STARTED RACING TO AROUND 4500 RPM.  I STOPPED THE VEHICLE, TURNED OFF THE KEY, PUT THE CAR INTO PARK, AND APPLIED THE PARKING BRAKE.  I PUT MY 4 WAYS ON AND CHECKED UNDER THE HOOD.  OF COURSE, EVERYTHING LOOKED IN ORDER AND I COULD NOT LOCATE THE THROTTLE.  I SHUT THE HOOD AND GOT BACK INTO THE CAR.  I PUSHED THE ACCELERATOR PEDAL THREE TIMES DOWN TO THE FLOOR.  I WAITED A MINUTE AND THEN STARTED THE CAR.  THE IDLE WAS BACK TO NORMAL AND THE CAR RAN NORMAL.      I TOOK IT TO THE DEALER TO GET CHECKED OUT ON WEDNESDAY 4/2/08.  NO TROUBLE FOUND.     NO OTHER OCCURRENCES OF THIS NATURE TO REPORT.  THIS CONDITION IS EXTREMELY UNSAFE; NEEDS TO BE CORRECTED ASAP.  MY VIBE ONLY HAS 3,000 MILES AND WAS PURCHASED NEW FROM A DEALER IN DECEMBER, 2007.    BASED UPON YOUR SITE'S COMPLAINTS THAT I HAVE REVIEWED, THERE ARE OTHER PONTIAC VIBES, TOYOTA MATRIXS AND TOYOTA COROLLAS THAT HAVE EXPERIENCED THIS CONDITION.  FORTUNATELY THERE AREN'T THAT MANY THAT HAVE REPORTED THIS CONDITION, THERE ARE ENOUGH THAT SUPPORT THE FACT THAT SOMETHING IS WRONG AND NEEDS TO BE FIXED BEFORE SOMEONE GETS HURT. I UNDERSTAND THAT THESE MODELS DO NOT  HAVE A CABLE THAT CONNECTS THE GAS PEDAL TO THE THROTTLE.  THESE CARS HAVE AN ELECTRONIC THROTTLE.  THERE APPEARS TO BE AN ELECTRICAL MALFUNCTION THAT IS OCCURRING. THERE MUST BE A COMPUTER MALFUNCTION, WIRING CONNECTOR PROBLEM, A SENSOR OR THROTTLE ACTUATOR THAT IS MALFUNCTIONING.   *TR",
        "vin": "5Y2SL65848Z"
    }
]