[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452597,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Porsche Cayenne. The contact stated while driving at various speeds, he smelled a strong gasoline odor inside the vehicle. The contact stated that others had also informed him that the vehicle had a strong gasoline odor. The contact stated that the gasoline odor was coming from the rear passenger's side and rear driver's side seats. The dealer was notified of the failure. The manufacturer was notified of the failure via email. The vehicle was not diagnosed or repaired. The failure mileage was approximately 101,000.",
        "vin": "WP1AA29P48L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384227,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HAS CUTOFF ON 3 OCCURRENCES: (1) OPERATING THE VEHICLE ON THE FREEWAY AT 70 MPH  AND EXPERIENCED IMMEDIATE LOSS OF POWER. I WAS ABLE TO MANUEVER THE VEHICLE TO THE SHOULDER WHILE COASTING WITHOUT ENGINE POWER. I WAS ABLE TO START THE ENGINE BUT IT CUTOFF A FEW SECONDS AFTER. THE VEHICLE HAD TO BE TOWED TO AN INDEPENDENT PORSCHE REPAIR SHOP WHERE THE HIGH PRESSURE FUEL PUMP WAS REPLACED. (2) THE ENGINE CUTOFF WHILE OPERATING ON CITY STREET AT 40 MPH. I WAS ABLE TO MANUEVER THE VEHICLE WHILE COASTING WITHOUT POWER OR POWER STEERING INTO A PARKING LOT. THE ENGINE WOULD START BUT CUTOFF A FEW SECONDS LATER ON MULTIPLE ATTEMPTS. THE VEHICLE HAS TO BE TOWED TO THE SAME INDEPENDENT PORSCHE REPAIR SHOP WHERE THE HIGH PRESSURE FUEL SENSOR WAS REPLACED. THIS OCCURRENCE WAS THE FIRST TIME OPERATING THE VEHICLE AFTER RETURNING HOME FROM THE HIGH PRESSURE FUEL PUMP REPLACEMENT SERVICE. (3) OPERATING THE VEHICLE WHILE STOPPED AT AN INTERSECTION AT A RED LIGHT. WHEN ATTEMPTING TO ACCELERATE THE ENGINE CUTOFF AND I WAS STALLED FOR ABOUT 1 MINUTE BLOCKING TRAFFIC. I WAS ABLE TO RESTART THE ENGINE AFTER A FEW ATTEMPTS AND DRIVE THE VEHICLE THE REMAINING 2 MILES HOME WITHOUT INCIDENT.    ALL 3 OCCURENCES INVOLVED ABRUPT ENGINE CUTOFF AND LOSS OF POWER STEERING. THE PORSCHE INDEPENDENT REPAIR SHOP IS UNABLE TO PINPOINT THE ISSUE. THE RISK EXPOSURE TO ACCIDENT IS HIGH WHEN ENGINE CUTOFF OCCURS WHILE THE VEHICLE IS IN MOTION.",
        "vin": "WP1AA29P88L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/19/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365216,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A STRONG ODOR OF FUEL COMING FROM THE DRIVER'S REAR WHEEL WELL. A RECALL EXISTS FOR 03-06 MODELS, BUT MY 08 IS SUFFERING THE FROM THE SAME ISSUE.",
        "vin": "WP1AA29P78L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363504,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT DISTRIBUTOR BARB CAME UNGLUED CAUSING LOSS OF COOLANT ON HIGHWAY. CAR WAS IN MOTION ON THE HIGHWAY. THIS IS A COMMON ISSUE AND PORSCHE HAS UPDATED THE PART HOWEVER WILL NOT WARRANTY THE DEFECTIVE PARTS STILL ON VEHICLES.",
        "vin": "WP1AC29P08L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353049,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE ROUGH IDLING WHICH DEALER CANNOT DIAGNOSE",
        "vin": "WP1AB29P08L"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350359,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PORSCHE CAYENNE HAVE WATER DRAIN DESIGN ISSUE.  WHEN RAINING OR WASH THE CAR, THE WATER DRAIN CLOG WILL MAKE WATER FLOOD THE INSIDE OF THE VEHICLES, AND DAMAGE THE WIRES UNDER THE DRIVER'S SIDE AND PASSENGER SIDE.  THIS IS A COMMON ISSUE, PORSCHE KNOW THIS, BUT NOT FIX IT.",
        "vin": "WP1AB29P58L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318783,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE BACKSIDE OF THIS V8 ENGINE THERE IS A COOLANT DISTRIBUTION TUBE THAT HAS COOLANT BARB PRESSED INTO THE CAST ALUMINUM DISTRIBUTION TUBE WITH ADHESIVE. WHILE DRIVING FROM WOR TO HOME, THE ADHESIVE FAILED 19MAR20 CAUSING THE BARB TO SLIP OUT OF THE TUBE ALLOWING LARGE AMOUNTS OF COOLANT TO GUSH OVER THE HOT EXHAUST AND OUT FROM UNDER THE CAYENNE. THE ENGINE CONTROL UNIT RECOGNIZED LOW COOLANT LEVEL THE DASH PANEL FLAGGED \"LOW COOLANT\" AND THE VEHICLE WAS PULLED OVER BEFORE OVERHEATING THE ENGINE. FORTUNATELY DUE TO THE TELEWORKING STATUS OF WHERE I WORK THERE WAS NO TRAFFIC BEHIND ME AND THANKFULLY NO MOTORCYCLIST.   I WOULD EXPECT MORE A $71,145 VEHICLE FROM PORSCHE EVEN AFTER 12 YEARS AND 140K MI.",
        "vin": "WP1AB29P48L"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209077,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED VEHICLE AND ATTEMPTED TO TURN OFF GOT A RED ALERT STEERING FAULTY,EVERYTHING LOCKED UP INCLUDING TRANSMISSION AND WINDOW SWITCHES..HAD TO BE FLAT BEDDED TO A PORSCHE DEALERSHIP TOOK A WEEK FOR THEM TO FIGURE OUT,HAD TO REPLACE STEERING COLUMN.CONCERN IS WHAT WOULD HAVE HAPPENED IF DRIVING AT THE TIME..GOT NO ANSWER",
        "vin": "WP1AA29P48L"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208042,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A PORSCHE CAYANNE 2008. THE WINDSHIELD WIPERS ON MY VEHICLE WILL SUDDENLY STOP WORKING. THIS ISSUE CAN HAPPEN IF THE CAR IS IN MOTION OR STATIONARY, STREET OR HIGHWAY DRIVING. IT IS VERY UNPREDICTABLE. THE WIPERS CAN STOP OPERATION FOR A VARIABLE AMOUNT OF TIME. AT TIMES I HAVE TO TURN OFF THE CAR TO GET THEM TO WORK AGAIN. SOMETIMES THEY WILL REMAIN INOPERABLE FROM SECONDS TO 15-20 MINUTES, AND RESTART ON THEIR OWN. AT TIMES IF I AM DRIVING IN THE RAIN THE WINDSHIELD WIPERS WILL CUT OFF AND NOT RESTART OR RESTART AFTER A PERIOD OF TIME, PREVENTING PROPER VISIBILITY.",
        "vin": "WP1AB29P78L"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152891,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A START IGNITION WON'T START AND  I HAVE TO PLUG  THE KEY IN ORDER TO STARTED THE VEHICLE",
        "vin": "WP1AB29PX8L"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129569,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PORSCHE CAYENNE S. WHILE DRIVING VARIOUS SPEEDS, THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL, HIGH PRESSURE, AND PRESSURE PUMPS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED BY A DEALER DUE TO THE COST. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE CONTACT WAS REFERRED TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "WP1AA29P38L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122147,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE RUNNING INCREASINGLY ROUGH ON ACCELERATION. MECHANIC FOUND DRIVESHAFT FAILURE DUE TO EXCESSIVE AXIAL PLAY FROM CENTER DRIVESHAFT SUPPORT BEARING. DRIVESHAFT REPLACED. MORE THAN 50 SIMILAR FAILURES ARE DOCUMENTED ON GOTACLASSACTION.COM.   I'VE ATTACHED COMPLAINT TO PORSCHE, THEIR RESPONSE AND REPAIR INVOICE. *TT*JB  CONSUMER STATED PARTS WAS ORDERED. *JB",
        "vin": "WP1AA29P38L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119534,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PORSCHE CAYENNE. WHILE THE VEHICLE WAS IDLING, AN ABNORMAL SOUND WAS HEARD. THE CONTACT INSPECTED THE VEHICLE AND FOUND THAT THE AIR SUSPENSION TANK WAS DETACHED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO PORSCHE OF SOUTH SHORE (185 W SUNRISE HWY, FREEPORT, NY) WHERE THE FAILURE WAS CONFIRMED, BUT THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 125,000.",
        "vin": "WP1AC29P28L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101936,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE GTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 PORSCHE CAYENNE ON 3/14/18.  HERE WE ARE 3 MONTHS LATER AND I NOTICED A STRONG GAS SMELL COMING FROM THE DRIVER REAR TIRE.  I USED GOOGLE TO DIAGNOSE MY CONCERNS AND FOUND THIS: SEPTEMBER 25, 2017 ' PORSCHE IS RECALLING MORE THAN 50,000 CAYENNE SUVS BECAUSE THE FUEL PUMP FILTER FLANGES COULD LEAK GAS AND AT THE LEAST CREATE AN ODOR OF FUEL, AND AT THE MOST CREATE A FIRE HAZARD IF FUEL HITS A HOT IGNITION SOURCE.    THE RECALLED GAS-POWERED VEHICLES INCLUDE THE 2003-2006 CAYENNE S AND CAYENNE TURBO, 2004-2006 CAYENNE AND 2006 CAYENNE S \"TITANIUM\" EDITION VEHICLES.    SO, I TOOK MY CAR TO GET DIAGNOSED AT DEAN MCREARY PORSCHE IN MOBILE, AL AND WAS ADVISED THAT I HAVE A FLANGE AND SEALING RING LEAK AND THAT IT WOULD BE 1124.00 TO REPAIR. I AM HAVING THE SAME PROBLEMS DESCRIBED IN THIS RECALL. THIS IS A HAZARD. SOMEONE COULD DIE.  I THEN CALLED PORSCHE NORTH AMERICAN AND THEY INFORMED ME THAT THE RECALL IS VIN SPECIFIC AND I DO NOT QUALIFY.  THIS MAKES NO SENSE AND THEY SHOULD BE HELD RESPONSIBLE FOR REPAIRS.  PORSCHE IS CONSTANTLY MAKING CARS THAT ARE UNSAFE AND WHEN A PROBLEMS OCCURS, THEY DO NOT WANT TO FIX IT.",
        "vin": "WP1AD29P08L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072224,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CUT OUT AS I WAS CROSSING A INTERSECTION WHILE IN MOTION LEAVING THE CAR DISABLED IN THE MIDDLE OF A BUSY INTERSECTION, LUCKILY OTHER DRIVERS SAW THE PROBLEM AND WENT AROUND ME.   ALL WARNING LIGHTS CAME ON INCLUDING THE IGNITION LOCK FAULT. I TURNED IT OFF AND AFTER 2 MINUTES IT RESTARTED.   THE NEXT DAY THE CAR WOULD NOT START, THE IGNITION LOCK FAULT CAME ON, AND THEN ALL OF THE OTHER WARNING LIGHTS CAME ON AND THE ENGINE WOULD NOT TURN OVER AND WAS LOCKED IN PARK. THIS HAPPENED ONCE BEFORE IN FEB 2017 WHEN A CORRODED WIRES WERE FOUND IN A MAIN BUNDLE OF WIRES IN THE DRIVERS FOOTWELL.  THERE WAS NO WATER ON THAT AREA AND NOR HAS THERE BEEN ANY WATER ON THE CAR OR THE FOOTWELL.   I HAVE HAD WEATHERTECH MATS IN PLACE HTE WHOLE TIME TO PREVENT THAT.   THIS IS A SAFETY CONCERN THAT IT COULD GO DEAD IN THE MIDDLE OF OPERATION NOT JUST A STARTING ISSUE. I HAVE REVIEWED TECHNICAL BULLETIN NHTSA 10056337 WHICH DOES NOT PROVIDE ANY EXPLANATION FOR IMPLYING THAT THE LACK OF FEEDBACK HAS LEAD TO THE FACTORY NOT KNOWING TO FIX THE PROBLEM.   PORSCHE NEED TO FIX THIS PROBLEM THE IMPROPERLY SPLICED WIRES AND THE BUNDLE NEED TO BE RETROFITTED IN A WAY TO PROTECT THEM FROM ONGOING CORROSION THAT IN MY CASE HAPPENED HAPPENED TWICE THE SECOND TIME ON 6,000 MILES AFTER THE LAST IN A CAR THAT IS KEPT IN A GARAGE.",
        "vin": "WP1AA29P48L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064243,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT DISTRIBUTOR BOLTED TO THE BACK OF ENGINE BLOCK HAS A GLUED -IN PIPE THAT CONNECTS TO A HOSE. THE GLUED-IN PIPE IS LEAKING AND HALF WAY PUSHED OUT OF THE DISTRIBUTOR. THE IMMINENT FAILURE OF THIS PART COULD HAVE CAUSED IMMEDIATE OVERHEAT AND FIRE DUE TO CATASTROPHIC COOLANT SYSTEM FAILURE. THE REPAIR IS EXTREMELY EXPENSIVE. PORSCHE HAS A NEW PART THAT HAS THE PIPE THREADED IN INSTEAD OF GLUED. PORSCHE SHOULD RECALL THIS AND PAY FOR THE REPAIR. THIS IS AN OBVIOUS DESIGN FLAW AND SAFETY ISSUE. IMAGINE 8 GALLONS OF HOT COOLANT DISCHARGING ALL OVER, SAY A MOTORCYCLIST GOING 70 MPH.  THIS ISSUE WAS NOTICED WHILE DOING OTHER COOLANT SYSTEM MAINTENANCE THAT WAS ALSO NECESSITATED BY POOR DESIGN OF THE VEHICLE.",
        "vin": "WP1AB29P98L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048790,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS GARAGE KEPT AND VERY LOW MILES (70K+) SINCE I WORK MOSTLY FROM HOME. I SUDDENLY STARTED TO HEAR A BAD NOISE COMING FROM THE BOTTOM OF THE CAR AND COULD FEEL THE CAR SHAKING WHENEVER STARTED TO ACCELERATE. TOOK TO A PORSCHE SPECIALIZED MECHANIC THAT TOLD ME IT IS A RECURRING ISSUE ON THE CAYENNE. LONG STORE SHORT, SPENT TWO THOUSAND DOLLARS TO FIX THE ISSUE.",
        "vin": "WP1AA29P98L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014093,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY MY TEMP GAUGE STARTED CLIMBING AND THE LOW COOLANT LIGHT CAME ON. I IMMEDIATELY PULLED OFF OF THE FREEWAY AND HAD THE CAR TOWED TO A PORSCHE MECHANIC. HE LATER IDENTIFIED THE PROBLEM AS THE PIPE OR TUBE THAT CONNECTS TO THE WATER/COOLANT DISTRIBUTOR CAME LOOSE SPILLING ALL OF THE COOLANT OUT, WHICH COULD OF LED TO A CATASTROPHIC ENGINE FAILURE WHILE ON THE FREEWAY. NOT SURE WHAT THE COST IS GOING TO BE YET. MY MECHANIC SAID HE'S SEEN THIS FAILURE ON 957 CAYENNE V8S MANY TIMES. THIS IS A DANGEROUS THING TO HAVE HAPPEN ON THE FREEWAY.",
        "vin": "WP1AC29P68L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004687,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH PRESSURE FUEL PUMP, CAR DROVE WITH VERY LITTLE ABILITY TO SPEED UP. IT SPUTTERS WHEN TRYING TO ACCELERATE. IT WON'T START RIGHT AWAY, BUILDING UP FUEL PRESSURE. I WAS DRIVING AND IT JUST BECAME UNRESPONSIVE TO THE GAS PEDDLE. I SLOWED AND STOPPED, RESTARTED AND JUST HAD A VERY WEAK CAR. IT TAKES SOME TIME TO REACH 50MPH. DANGEROUS IF ON THE HWY.",
        "vin": "WP1AB29P28L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993665,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire America Corp.",
                "productMake": "HANKOOK",
                "productModel": "VENTUS S1 NOBLE 2",
                "productYear": "9999",
                "size": "275/35R19 96W",
                "type": "Tire"
            }
        ],
        "summary": "ON JUNE 3, 2017, I HAD A WARNING LITE FOR LOW AIR PRESSURE EMIT ON MY DASHBOARD. I PULLED OVER TO THE NEXT SERVICE STATION AND APPLIED AIR TO MY TIRE. ONLY UNTIL THEN DID I NOTICE THE SEVERE CRACKING AND ROTTING OF THESE TIRES THESE TIRES HANKOOK VENTOUS S1 WERE PURCHASED ON APRIL 1, 2016 AND HAVE LESS THAN 10K MILES ON THEM. IN FACT, AFTER FURTHER REVIEW THE DRY ROT AND CRACKING IS EXPERIENCED ON ALL 4 TIRES CAUSING SEVERE SEPARATION OF THE TREAD FROM THE TIRE ITSELF.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917294,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY. ACCELERATING AS I WAS MERGING INTO THE HIGHWAY. I SAW SMOKE COMING OUT THE BACK. CHECK COOLANT LIGHT CAME ON. WHEN I STOPPED I SAW COOLANT EVERYWHERE UNDERNEATH THE CAR. THE DEALERSHIP DETERMINED THE GLUE FROM THE COOLANT TUBES FAILED AND NEEDS TO INSTALL NEW COOLANT PIPES.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898245,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PORSCHE CAYENNE. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. IT WAS DIAGNOSED THAT THE AIR CONDITIONER CONDENSATION DRAIN LINE WAS PLUGGED, WHICH CAUSED THE ELECTRICAL ISSUE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 72,340.",
        "vin": "WP1AA29PX8L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "01/18/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823724,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DISTRIBUTOR COLLECTOR COOLANT SYSTEMS INCLUDING THE PIPES HAS FAILED. HOWEVER, I HAVE BEEN INFORMED BY THE PORSCHE CORPORATE OFFICE THERE ARE NO COMPLAINTS OR RECALLS ON FILE.  UNFORTUNATELY, THEY WERE UNABLE TO PROVIDE THE NUMBER OF COMPLAINTS FOR THIS MAKE/MODEL/YEAR.  ON THE DATE OF THE INCIDENT I WAS DRIVING THE VEHICLE AND THE COOLANT LIGHT APPEARED (NO OTHER SYMPTOMS), I DID NOT HIT A BUMP, IT WAS ALL OF A SUDDEN WHEN MY VEHICLE BEGAN TO SMOKE AS IF IT WAS ON FIRE.",
        "vin": "WP1AB29P78L"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "05/26/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730234,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE LEAVING MY HOME IN MY 2008 PORSCHE CAYENNE TURBO, THE CAR STARTED HESITATING AND THEN STALLED OUT WITH A PDC ERROR.  AFTER TAKING IT IN TO THE LOCAL PORSCHE DEALERSHIP THEY REPORTED FINDING NOTHING.  THE ISSUE WOULD OCCUR 2 MORE TIMES AND I TOOK IT TO A LOCAL MECHANIC SPECIALIZING IN PORSCHES WHO STATED IT WAS THE THROTTLE BODY. THIS WAS REPLACED HOWEVER THE ISSUE IS REOCCURRING WITH SUPPLEMENT ERRORS SUCH AS CHASSIS AND CHECK ENGINE.  MY ISSUE ISN'T UNCOMMON PLEASE SEE PROVIDED LINKS WHERE OTHERS HAVE HAD THE SAME PROBLEMS WITH THEIR PDCC SYSTEM.    HTTP://WWW.6SPEEDONLINE.COM/FORUMS/CAYENNE-955-957/200781-3RD-REPAIR-ATTEMPT-WARNING-CHASSIS-SYSTEM.HTML    HTTP://RENNLIST.COM/FORUMS/PORSCHE-CAYENNE-FORUM/699011-PDCC-MAJOR-PROBLEMS.HTML    HTTP://WWW.RENNTECH.ORG/FORUMS/TOPIC/45581-WARNING-CHASSIS-SYSTEM-ON-2008-CAYENNE-TURBO/",
        "vin": "WP1AC29P28L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "05/09/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717427,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M WRITING THIS COMPLAINT TO YOUR AGENCY AND URGING YOU TO INVESTIGATE 2008 PORSCHE CAYENNES THE SAFETY QUALITY OF CARDAN DRIVE SHAFT. ON MAY 9, 2015, IN THE EVENING, I WAS DRIVING MY CAYENNE HEADING HOME AT THE SPEED OF LESS THAN 55 MILES PER HOUR AS I JUST GOT ON THE HIGHWAY. I SUDDENLY HEARD A LOUD NOISE AS AN EXPLOSION FROM THE UNDERNEATH OF MY CAR. THEN, I HEARD THE METAL GRINDING NOISE. I WAS SO SCARED. I DIDNT KNOW WHAT HAPPENED TO MY CAR. THE CAR WAS STILL DRIVING FINE, AND THERE WAS NO INDICATION ON THE DASHBOARD THAT MY CAR WAS IN TROUBLE. LUCKILY, THERE WAS NO TRAFFIC BEHIND ME, SO I REDUCED MY SPEED TO LESS THAN 30 MILES ON THE HIGHWAY AND GOT OFF THE NEXT EXIT.     I STOPPED BY AT THE NEAREST GAS STATION. I WAS CHECKING THE UNDERNEATH OF MY SUV. I THOUGHT PERHAPS, THE MUFFLER WAS FALLING OFF. WELL, NOTHING WAS FALLING OFF MY CAR. SO, I DROVE IT VERY SLOWLY TO HOME BECAUSE AS THE CAR CLIMBING THE HILL, THE METAL GRINDING NOISE WAS GETTING LOUDER. NEXT DAY, I HAD AN AUTO MECHANIC TO CHECK MY CAR, AND HE TOLD ME THAT THE CENTER BEARING TO THE DRIVE SHAFT WAS LOOSENING. HE TOLD ME THAT I CANNOT DRIVE THE CAR BECAUSE IN ANY MINUTE THE BEARING COULD BE SNAPPED. HE ADVISED ME TO TOW MY CAR TO A PORSCHE DEALER'S SERVICES SHOP. AND, I DID IT. AT A PORSCHE DEALERS SERVICE DEPARTMENT, THEY TOLD ME THAT THE CARDAN DRIVE SHAFT WAS BROKEN. I COULDNT BELIEVE THAT MY CAR ONLY HAD 51,871 MILES, AND THE CENTER BEARING WAS BROKEN ON THE HIGHWAY SUDDENLY. PER INTERNET RESEARCH, THE AVERAGE DRIVE SHIFT COULD BE LAST FOR 160,000 MILES. I REALLY DIDNT EXPECT THIS KIND OF POOR SAFETY QUALITY FROM A PORSCHE CAYENNE.     IF YOU SEARCH THE CENTER BEARING ISSUE OF PORSCHE CAYENNE ON THE INTERNET, YOU CAN FIND A LOT OF SIMILAR STORIES POSTED ONLINE. PORSCHE CAYENNE HAS A POWERFUL ENGINE. HOWEVER, FROM MY INCIDENT, I BELIEVE THE CENTER BEARING IS THE WEAKEST LINK OF THE SUV.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651059,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER MODERATE ACCELERATION A COOLANT DISTRIBUTOR PIPE FAILED WITHOUT WARNING AND SPRAYED/LEAKED COOLANT ALL OVER THE ENGINE BAY AND UNDERNEATH THE CAR.  THE FAILURE OCCURRED AT THE BACK OF THE ENGINE WHERE A PRESSED IN PIPE FITTING CAME LOOSE FROM THE ENGINE CASTING.  REPAIR REQUIRED REMOVAL OF THE ENGINE AT A COST IN EXCESS OF $3.500. ALL THE COOLANT WAS LOST FROM THE ENGINE AND LUCKILY I WAS ON A SIDE STREET AND NOT THE HIGHWAY.  *TR",
        "vin": "WP1AC29PX8L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "10/05/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630271,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2010, I BOUGHT A '08 CAYENNE TURBO AT 40K MILES. PRIOR TO DELIVERY, I HAD PORSCHE DEALERSHIP RUN A SYSTEM CHECK TO CONFIRM THE VEHICLE WAS MECHANICALLY SOLID & FREE OF DEFECTS. SUBSEQUENTLY, THEY PERFORMED A REPAIR ON THE COOLANT PIPES (STILL UNDER FACTORY WARRANTY) AND ASSURED ME IT WAS IN EXCELLENT CONDITION TO PURCHASE.  105K MILES: CAYENNE'S STARTER WAS MAKING NOISES AND NOT FUNCTIONING 100% OF TIME, SO I BROUGHT VEHICLE TO THE SAME PORSCHE DEALERSHIP WHO HAD BEEN SERVICING IT SINCE 2010. THE STARTER WAS IMMERSED IN COOLANT.  I WAS INFORMED THAT MY (PREVIOUSLY \"REPAIRED\") COOLANT PIPES HAD A LEAK & REQUIRED REPAIR. I REVIEWED MY PREVIOUS INVOICE FROM ORIGINAL \"REPAIR\" UNDER WARRANTY AT 40K MILES & IT APPEARED TO BE THE SAME ISSUE, SAME PART #S, ETC.  I RECEIVED ANOTHER CALL A FEW DAYS LATER INFORMING ME THAT MY CAYENNE NOW HAD A SECOND COOLANT LEAK AT THE CROSSOVER PIPE TOWARD THE BACK OF THE ENGINE NEAR FIREWALL (REQUIRED REMOVAL OF THE ENGINE IN ORDER TO REPAIR). THE SERVICE GUY & PORSCHE TECH TOLD ME THE SECOND LEAK OCCURRED BECAUSE THE \"FIRST\" REPAIR (ACTUALLY THE SECOND, IF YOU CONSIDER IT WAS ALREADY REPAIRED UNDER WARRANTY AT 40K MILES) THEN PROPERLY PRESSURIZED MY COOLANT SYSTEM, CAUSING THE NEXT LEAK, REQUIRING THE \"NEXT\" REPAIR.  APPARENTLY THE INITIAL REPAIR DONE AT 40K MILES WAS ONLY ENOUGH TO HOLD OUT UNTIL THE VEHICLE WAS OUT OF WARRANTY.  PORSCHE MADE THE REPAIRS & REPLACED PLASTIC PIPES WITH ALUMINUM ONES THIS TIME, ON MY DOLLAR.    I HAD TO PAY FOR TWO COOLANT REPAIRS, + A NEW STARTER, SOLENOID, & BATTERY, ALL COLLATERAL DAMAGE DUE TO THE PIPE LEAKS.   '03-'06 CAYENNES HAVE WELL KNOWN AND DOCUMENTED COOLANT PIPE DEFECTS RESULTING IN A CLASS ACTION LAWSUIT AGAINST PCNA (SEE: CAYENNECLASSACTION.COM). '08S + ARE SURE TO FOLLOW.  I CONFIRMED DUPLICATE PART #S/LABOR FOR WARRANTY REPAIR (NO COST) AND THIS REPAIR ($$$).   $5,000.00+ REPAIR. NOT A TYPO.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2014",
        "dateOfIncident": "06/22/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608435,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ALL OF THE SUDDEN FELT A STRONG COOLANT SMELL, SLOWED DOWN IMMEDIATELY AND DROVE HOME. UPON FURTHER INVESTIGATION IT WAS DISCOVERED THAT THE COUPLING PIPE THAT INSERTS INTO THE WATER DISTRIBUTOR WAS COMING OUT. THE GLUE THAT HELD THE PIPE IN PLACE FAILED AND THE PIPE WAS 60% OUT! I STOPPED IN TIME BEFORE THE PIPE COMPLETELY BLEW OUT AND SUDDEN LOSS OF COOLANT OCCURRED, THE PIPE WAS LITERALLY FINGER TIGHT, NOTHING HELD IT IN PLACE ANYMORE. PORSCHE QUOTES $3500 TO REPAIR!!!!  THIS NEEDS TO BE A SERVICE ACTION CLEAR AS DAY.   *JS",
        "vin": "WP1AC29P18L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "05/04/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588252,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE FOUND  A HUGE LEAK IN THE COOLANT SYSTEM WHILE THE CAR WAS PARKED, A PORSHE TECHNICIAN IDENTIFIED THAT ON THE COOLANT DISTRIBUTOR BEHIND THE ENGINE THERE IS A COUPLER WHICH WAS GLUED ONTO THE DISTRIBUTOR. THE GLUE DETACHED AND THE COOLANT PIPE BLEW OUT CAUSING THE ENTIRE ENGINE TO LOSE COOLANT. I BELIEVE THAT IT IS A PURE DESIGN ISSUE AND PORSCHE DID NOT ISSUE A RECALL ON IT. IT WAS VERY EXPENSIVE TO FIX THAT PROBLEM DUE TO BAD DESIGN. *TR",
        "vin": "WP1AB29P38L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "04/03/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585641,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PORSCE CAYENNE S.  THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE FRONT PASSENGER'S SIDE HEADLIGHT BECAME DETACHED APPROXIMATELY SIX TO EIGHT INCHES FROM THE LIGHT SOCKET.  THE HEADLIGHT WARNING LIGHT ILLUMINATED ON SEVERAL OCCASIONS PRIOR TO THE FAILURE. THE VEHICLE WAS TAKEN TO A MECHANIC FOR DIAGNOSTIC TESTING BUT WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WERE NOT FAMILIAR WITH THE FAILURE.  THE FAILURE MILEAGE WAS 55,500. THE CURRENT MILEAGE WAS 57,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2014",
        "dateOfIncident": "04/06/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583235,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SUDDENLY DEVELOPED A HUGE LEAK IN COOLANT.  AFTER DIAGNOSE, IT WAS IDENTIFIED THAT ON THE COOLANT DISTRIBUTOR BEHIND THE ENGINE THERE IS A COUPLER WHICH WAS GLUED ONTO THE DISTRIBUTOR.  THE GLUE WILL BREAK DOWN OVER A FEW YEARS AND THE COOLANT PIPE BE BLOWN OUT CAUSING THE ENTIRE ENGINE TO LOSE COOLANT, WHICH IS EXTREMELY DANGEROUS.   THIS IS A PURE DESIGN ISSUE AND PORSCHE DID NOT ISSUE A RECALL ON.  THE MOST RIDICULOUS THING IS THAT IN ORDER TO FIX IT, THE ENTIRE ENGINE AND TRANSMISSION HAS TO COME OUT, WHICH WILL COST MOST THAN 5000 TO 6000 DOLLARS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "10/06/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547588,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN AND TOTAL COOLANT LOSS WHEN COOLANT DISTRIBUTION HOUSING PIPE CAME APART WHILE DRIVING ON A PUBLIC ROADWAY RESULTING IN DISABLED VEHICLE. PART # 948-106-061-06 DISTRIBUTOR TUBE FAILURE AT BOTTOM CONNECTION. REQUIRED TO REMOVE ENGINE AND REPLACE COOLANT DISTRIBUTION HOUSING.  *TR",
        "vin": "WP1AC29P88L"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "03/03/2009",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510020,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE TURBO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2008 PORSCHE CAYENNE TURBO AS A SECOND OWNER BUT BEFORE THE PURCHASE WAS COMPLETED THE COOLANT HOSE RUPTURE FAILURE OCCURRED. THE REPAIR WAS AT A COST WELL NORTH OF $2000 AT THE MOTOR WERKS PORSCHE OF BARRINGTON. I ALSO HAVE A 2002 PORSCHE 996 TURBO WHICH JUST RECENTLY RUPTURED THE COOLANT HOSE. THE COST IS ONCE AGAIN RIGHT AROUND TWO THOUSAND DOLLARS. I'M JUST FED UP THAT THIS EPOXY FAILURE WITHIN THE COOLANT SYSTEM WHICH HAS AFFECTED SO MANY PORSCHE OWNERS. I'M VERY DISAPPOINTED THAT THIS ISSUE IS NOT FIXED EVEN IN THEIR LATER MODELS BUT VERY HAPPY TO FIND OUT THAT MAYBE SOMETHING WILL ARISE WITH THESE COMPLAINTS. *TR",
        "vin": "WP1AC29P98L"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "03/23/2009",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502550,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE EXPERIENCED ONGOING ELECTRICAL SYSTEM MIRROR PROBLEMS, WITH MY 2008 PORSCHE CAYENNE, WHERE THE OUTSIDE MIRRORS MOVED ON THEIR OWN WHILE DRIVING AND PARKING.  FIRST EXPERIENCED THIS ELECTRICAL SYSTEM MIRROR PROBLEM ON (3/23/09) AT 12,391 MILES, AS THIS CAR WAS TAKEN TO SAME DEALERSHIP WHERE I HAD PURCHASED IT (INSKIP PENSKE PORSCHE IN WARWICK, RI (12) SEPARATE TIMES FOR UNSUCCESSFUL ATTEMPTS AT REPAIR. THE REPAIR INVOICES ARE AVAILABLE FOR THE FOLLOWING VISITS: 3-23-09 = 12,391 /  3-31-09 = 12,592  /  4-2-09 = 12,992  /  9-13-10 = 25,668  /   9-28-2010 = 26,186  /  12-16-10 = 28,179  /  8-24-11 = 38,186  /  9-13-11 = 38,664  /  9-30-11 = 39,249  /  12-19-12 = 47,715  /  1-24-13 = 47,973  /  3-7-13 = 48,199.  PURCHASED THE CAR BRAND NEW ON (2/4/08) WITH ONLY 24 MILES ON THE ODOMETER.  COMPUTER CONTROL UNIT WAS REPLACED AT LEAST 10 SEPARATE TIMES, AS THIS CAR MAY HAVE HAD SOFTWARE VIRUS & OR AN ELECTRICAL SHORTAGE.  THE DEALERSHIP SEEMS NOT TO NOT KNOW HOW TO PROPERLY PROGRAM THIS CAR, AS THEY CLAIMED THAT THE CAR WAS READY TO BE PICKED UP ON (3/7/13) AFTER BEING IN THEIR SHOP FOR 37 DAYS SINCE THE 11TH VISIT BEGINNING ON (1/24/13).  LESS THAN 12 MILES LATER, I HAD TO RETURN THE CAR BACK TO THE DEALER FOR THE 12TH TIME ON (3/7/13), BECAUSE THE SPARE KEY WHICH THEY HAD PROGRAMMED WE SUSPECT MAY HAVE HAD OLD SOFTWARE WHICH CORRUPTED THE COMPUTER SYSTEM.  THIS PROBLEM AGAIN CAUSED THE MIRRORS TO MOVE IN ALL KIND OF DIFFERENT DIRECTIONS, THUS CAUSING A MAJOR SAFETY ISSUE WHEN DRIVING OR OPERATING THE VEHICLE.  THEY FINALLY ORDERED ANOTHER COMPUTER REPLACEMENT & 2 NEW KEYS WHICH THEY PROGRAMMED SUCCESSFULLY WITHOUT FURTHER PROBLEMS.  PRIOR TO THIS 12TH REPAIR, I CAME CLOSE TO BEING INVOLVED IN AT LEAST 4 NEAR MIS ACCIDENTS, AS CARS WERE NOT VISIBLE IN MY BLIND SPOT, ESPECIALLY WHEN THE MIRRORS MOVE ON THEIR OWN.  HAVE GONE THROUGH TWO ARBITRATIONS.       UPDATED 03/15/13*LJ",
        "vin": "WP1AA29P48L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501801,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "S10 DIRECT REPLY LETTER TO THE SECRETARY FROM REGARDING HAVING PROBLEMS WITH HIS 2008 PORSCHE CAYENNE. *TGW  THE CONSUMER STATED HE EXPERIENCED NUMEROUS SAFETY PROBLEMS WITH THE ELECTRICAL SYSTEM AND BRAKES. THE CONSUMER STATED HE FILED TWO SEPARATE ARBITRATION AGAINST THE DEALER AND THE MANUFACTURER. THE FIRST ARBITRATION CASE WAS SETTLED IN 2009, WITH THE EXPECTATION ALL OF THE PROBLEMS WITH THE VEHICLE, CURRENT, PAST AND PRESENT WOULD BE PROPERLY IDENTIFIED AND RESOLVED. SINCE THE INITIAL ARBITRATION CASE, THE CONSUMER HAD TO TAKE THE VEHICLE BACK TO THE DEALER 11 TIMES FOR THE SAME ELECTRICAL/SOFTWARE PROBLEM. THE ON-GOING PROBLEM UNCONTROLLABLY AFFECTED THE PROPER POSITIONING OF THE OUTSIDE MIRRORS AND THE OVERALL SAFETY ASPECT WHEN OPERATING THE VEHICLE. THE DEALER REPLACED THE ONBOARD COMPUTER CONTROL MODULE SEVEN TIMES, AS THEIR FIELD TECHNICAL EXPERT SUSPECTED THERE WAS AN UNIDENTIFIABLE ELECTRICAL SHORTAGE OR A COMPUTER RELATED SOFTWARE VIRUS SOMEWHERE WITHIN THE ELECTRICAL SYSTEM. THE CONSUMER BELIEVED THE DEALER HAD NO IDEA HOW TO RESOLVE THE PROBLEM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2012",
        "dateOfIncident": "09/11/2012",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475265,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN MINUTES OF DRIVING MY SON TO SCHOOL, I HEARD A GRINDING SOUND FROM UNDERNEATH MY CAYENNE, THEN A SQUEALING, AND THE CAR BEGAN TO VIBRATE VIOLENTLY DURING ACCELERATION. THIS HAPPENED VERY QUICKLY AND WAS FRIGHTENING BECAUSE I WAS CROSSING A BRIDGE IN MORNING TRAFFIC. THE SERVICE MAN AT THE PORSCHE DEALERSHIP TOLD ME THAT THIS IS AN ONGOING PROBLEM WITH THESE VEHICLES AND THAT MY DRIVE SHAFT HAD COME APART. I AM A VERY CAREFUL DRIVER AND MY CAR HAS LOW MILES. I BELIEVE THAT THERE SHOULD BE A RECALL AND THIS IS SAFETY ISSUE BECAUSE OF HOW QUICKLY THIS HAPPENED WHILE DRIVING. *TR",
        "vin": "WP1AA29P78L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/14/2010",
        "dateOfIncident": "08/05/2008",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355537,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 PORSCHE CAYENNE. WHILE THE CONTACT WAS DRIVING AT AN UNKNOWN SPEED, THE TIRE PRESSURE SYSTEM WARNING INDICATOR ILLUMINATED WITH A FALSE LOW PRESSURE ALERT. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND FOUR WHEEL SENSORS WERE REPLACED. ON A SEPARATE OCCASION, THE CONTROL MODULE WAS REPLACED. THE VEHICLE WAS TAKEN TO THE DEALER FIVE TIMES AND THEY ADVISED THE CONTACT THAT THE TIRE PRESSURE STICKER INFORMATION PERTAINING TO THE TIRE PRESSURE SETTING SHOULD BE IGNORED. THE FAILURE PERSISTED WITH NO RESOLUTION. THE FAILURE MILEAGE WAS 4,000.  UPDATED 12/20/10 *BF  THE CONSUMER STATED THE TPMS HAS NEVER FUNCTIONED PROPERLY. ON MANY OCCASIONS, BUT ONLY DURING HOT WEATHER, IT ISSUED FALSE LOW TIRE PRESSURE WARNINGS ON THE DASH. UPDATED 12/27/10",
        "vin": "WP0AA29838U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "01/04/2008",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313724,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2008 PORSCHE CAYENNE S ( PURCHASED IN MARCH 2007)  I HAVE AT LEAST 3 TIMES EXPERIENCED A INCORRECT DOWNSHIFT INITIATED BY THE AUTOMOBILE  IN ALL CASES THE CAR/COMPUTER OBVIOUSLY WANTED TO SHIFT DOWN TO A LOWER GEAR ( GOING UP A STEEP HILL AT HIGHWAY SPEED, TRAVERSING A STEEP PARKING LOT AT LOW SPEED) ETC RATHER THAN SHIFTING ONE GEAR THE CAR SEEMS TO HAVE SHIFTED 2 OR 3 GEARS AT ONE TIME   THE ENGINE REVVED TO ABOUT 5000 RPM WITHIN THE RED LINE LIMITS- VERY NOISY AND DISCONCERTING  I EXITED THE PROBLEM BY MANUALLY SHIFTING TO NEUTRAL  WHICH CLEARED THE PROBLEM  THEN BACK TO DRIVE  I REPORTED THE ISSUE TO MY DEALER WHO OBVIOUSLY COULD NOT REPRODUCE THE VERY INTERMITTENT PROBLEM, HE ALSO SAYS HE CHECKED THE COMPUTER LOG AND COULD NOT FIND ANY REPORT AND THAT THERE NO SERVICE BULLETINS RELATING    I THINK THAT THIS COULD BE A SERIOUS SAFETY ISSUE BEING POTENTIALLY  A MAJOR DRIVER DISTRACTION. *TR",
        "vin": "WP1AB29P58L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2009",
        "dateOfIncident": "10/27/2009",
        "fire": true,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297649,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE GTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING LOW SPEED DRIVING (ROUGHLY 20MPH) IN CONGESTED HIGHWAY TRAFFIC, I ATTEMPTED TO SHIFT GEARS ON THE MANUAL TRANSMISSION IN MY 2008 PORSCHE CAYENNE GTS.  UPON DOING SO, THE CLUTCH PEDAL LOST ALL RESISTANCE AND PINNED DIRECTLY ON THE FLOORBOARD.  AS I BEGAN NAVIGATING TOWARD THE SHOULDER, SMOKE BEGAN POURING INTO THE CABIN.  AS I REACHED THE SHOULDER, THE CAR CAUGHT ON FIRE.  I ESCAPED UNHARMED BUT THE ENTIRE CAR BURNED AND WAS TOTALED.  PORSHCE HAS SINCE BEEN EXCEPTIONALLY RELUCTANT TO SPEAK WITH ME.  THIS EVENT HAPPENED IN OCTOBER (2009).  MY INSURANCE COMPANY (STATE FARM) HAS SUBROGATED ON MY BEHALF AND THREE MONTHS LATER, PORSCHE IS STILL NOT DISCLOSING THE FINDINGS OF THEIR INVESTIGATION NOR HAS ANYONE FROM PORSCHE BEEN IN CONTACT WITH ME SINCE EARLY NOVEMEBER.  THIS WAS A LOW MILEAGE VEHICLE (ROUGHLY 12,000 MILES) AND MAINTENANCE WAS PERFORMED ACCORDINGLY TO THE MANUFACTURER'S RECOMMENDATION.  AS PORSCHE'S FIRST MODEL OF THEIR POPULAR FAMILY SUV TO HAVE A MANUAL TRANSMISSION - I FEAR FOR THE SAFETY OF OTHER OWNERS AND THEIR CHILDREN. *TR",
        "vin": "WP1AD29P48L"
    }
]