[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "12/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426755,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver seat belt fails to retract.  When retraction failure occurs, it is obvious to  the seat occupant immediately.  If a crash were to occur with a seat belt in this condition,  the result could increase the risk of injury to the driver. The seat belt retraction failure has been reproduced and confirmed. No warning lamps but, the seat belt showed earlier symptoms of not working properly, by not engaging when hard braking occurred. I will have the tensioner replaced.",
        "vin": "YS3FB46Y581"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "08/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG MALFUNCTION CONTACT SERVICE",
        "vin": "YS3FB79Y586"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO HAVE VALVE JOB DONE DUE TO BAD /DEFECTIVE/INFERIOR INTAKE VALVES, FROM MANUFACTURER.  HAD TO HAVE ALL INTAKE VALVES REPLACED, WITH MODIFIED/UPGRADED INTAKE VALVES.  OBTAINED PO300 - RANDOM MISFIRE CODES, HAD ROUGH IDLE, CHECKED ENGINE COMPRESSION, HAD 45PSIG IN CYLINDER NUMBER 4.  ENGINE HAD 72862MILES, ON IT, THIS SHOULD BE COVERED UNDER WARRANTY BY SAAB/GM.",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE DOESN'T START/IDLE WELL IN THE COLD DUE TO THE AIR INTAKE MANIFOLD BOLTS SLOWLY BECOMING LOOSE. **WHEN DRIVING AND SHIFTING** THE VEHICLE CANNOT HANDLE THE EXTRA UNCLEAN AIR ENTERING THE SYSTEM AND WILL STALL OUT WHILE GOING ANYWHERES FROM 0-60+ MPH, ONCE THE ENGINE SHUTS OFF ALL POWER STEERING ALSO SHUTS DOWN.     THE SECONDARY ISSUE IS AN ACCELERATION PROBLEM BECAUSE THE SEALS ON THE AIR INTAKE VALVES INTO THE COMBUSTION CHAMBER HAVE BECOME FAULTY RESULTING IN CYLINDER MISFIRES AND A HIGH AMOUNT OF VIBRATION INTERMITTENTLY WHILE DRIVING, THE SYMPTOMS COME AND GO WITH INCREASING FREQUENCY AS TIME GOES ON. THIS SECONDARY ISSUE TIES INTO THE FIRST ISSUE BECAUSE OF SHIFTING WITH A STANDARD MY VEHICLE TODAY (12/3/2020) SHUT OFF WHILE DRIVING 7 TIMES TO AND FROM MY JOB.",
        "vin": "YS3FB46Y681"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WOULDN'T START SO I REPLACED THE BATTERY AND THE CRANKSHAFT SENSOR. IT DROVE FINE AND THEN I PARKED IT AND WENT OUT A LITTLE LATER AND IT WOULD JERK AND TRY TO STALL WHILE I WAS DRIVING, SPUTTERING LIKE I WAS RUNNING OUT OF GAS. IF I PRESSED THE ACCELERATOR, IT WOULDN'T ACCELERATE AND THEN IT WOULD SURGE FORWARD. I RAN SOME ERRANDS AND IT DROVE FINE. AFTER MY FINAL ERRAND, THE CAR STRUGGLED TO START BUT DID AND IDLED REALLY ROUGHLY. I PUT IT INTO GEAR AND IT DIED. I COULDN'T GET IT STARTED AGAIN. AFTER READING OTHER POSTS, THIS SEEMS LIKE AN ISSUE WITH THESE YEARS AND VEEY DANGEROUS.",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY 08 SAAB 9-3 TO A SHOP FOR A COMPRESSION TEST CAUSE IT KEPT STALLING WHEN I WOULD GO TO START IT, IT'S AN AUTOMATIC. I WAS TOLD MY INTAKE VALVES WERE WEARING DOWN AND IT'S DUE TO GMS FAULTY VALVES. YESTERDAY MY CAR STARTED TICKING WHILE I WAS DRIVING AND I LOST ALMOST ALL MY POWER, COME TO FIND OUT MY VALVES WERE ABOUT TO SNAP. NOW I'M MAKING PAYMENTS ON A CAR I CAN'T DRIVE AND GM REFUSES TO FIX THIS ISSUE AND THERE ARE MULTIPLE CASES OF THIS HAPPENING TO 08-10 SAAB 9-3 WITH THE GM FACTORY VALVES.  *TR",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED HARD STARTING IN COLD WEATHER IN THE PACIFIC NORTHWEST THE PAST FEW YEARS.  DID RESEARCH AND FOUND A TSB REGARDING THE INTAKE VALVES FOR 2.0 ECOTEC 4 CYLINDER.  HAD A COMPRESSION TEST FOLLOWING SEVERAL CHECK ENGINE LIGHTS AND MULTIPLE READINGS DIAGNOSE A P0300 ENGINE CODE .  COLD AND WARM COMPRESSION TEST SHOWED CYLINDER 2 COMPRESSION WELL OUT OF SPECIFICATION.  DOCUMENTS AVAILABLE UPON REQUEST.  QUOTED $4000 FOR ENGINE REBUILD.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310390,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VALVES ON THESE CARS ARE DEFECTIVE AND START FAILING AROUND 60K MILES.  THIS IS A WIDELY KNOW ISSUE AFFECTING THE 2008 SAAB 9-3 2.0L ENGINES.  GM NEEDS TO TAKE RESPONSIBILITY FOR THESE REPAIRS GIVEN THE KNOWN MANUFACTURING DEFECTS.  CAR WILL NOT START WHEN COLD AND THERE IS NOTHING THE DEALER CAN DO OTHER THAN PERFORM A MAJOR VALVE JOB (+$2300) =>  HTTPS://WWW.SAABCENTRAL.COM/THREADS/08-SAAB-COLD-START-ROUGH-IDLE.327778/",
        "vin": "YS3FB56YX81"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SIGNIFICANT DECREASE IN AVERAGE MPG (PROBLEM FROM RESEARCH ONLINE SUGGESTS IT IS FROM LOWERED COMPRESSION FROM INTAKE VALVE DESIGN/MATERIAL USED).  109700 MILES ON ENGINE. METICULOUSLY MAINTAINED BY US NAVY SUBMARINER. HAVEN'T CONTACTED GM OR SAAB AFFILIATE YET. FORUMS USED INFER THIS PROBLEM IS WIDESPREAD FOR 2007-2009 SAAB 9-3 2.0T WITH B207 ENGINE.  SUMMER TIME MPG IS AROUND 32-33, WINTER MPG IS 30-31 IN THE PACIFIC NORTHWEST.  LAST 3 FILL UPS, AVERAGE MPG HAS DROPPED STEADILY FROM 30.5 TO 26 ON THE MOST RECENT FILL UP. RESPECTFULLY REQUEST TO KNOW IF A RECALL OR FINANCIAL COMPENSATION BY THE MANUFACTURER TO CONSUMERS HAS BEEN ORDAINED?",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLE AND START ON COLD STARTS. THIS ISSUE IS WELL KNOWN IN THE SAAB COMMUNITY DUE TO GM PUTTING WEAK MATERIAL IN FACTORY FUEL INJECTOR VALVES. ENGINE LOSES COMPRESSION UNTIL CAR IS WARM, BUT MAY RESULT IN STALLS OR LIMP MODE",
        "vin": "YS3FB49Y381"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174994,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXHIBITS ALL SIGNS OF PREMATURE INTAKE VALVE WEAR CAUSING LOSS OF COMPRESSION AND/OR HARD START/NO START WHEN AMBIENT AIR TEMP IS BELOW 40 DEGREES. SEE ALL PREVIOUS COMPLAINTS OF THE SAME ISSUE!",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160594,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASE VEHICLE FROM A  FRIEND  2008 SAAB  9-3 2.0T CONVERTIBLE . WHEN I FIRST START UP THE VEHICLE (IT  IS NOW COLD OUTSIDE) THE ENGINE IS RUNNING RUFF UNTIL IT WARMS UP. I UNDERSTAND MANY OTHER SAAB 2008 OWNERS HAVE THE SAME COMPLAINT AND HAVE READ THAT THE INTAKE VALUES USED BY GM ARE FAULTY.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099432,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT COIL SPRINGS WHILE DRIVING, SNAPPED IN HALF, AND DISLOCATED FROM VEHICLE, 6 MONTHS APART. WAS DRIVING AT 30 MPH, AND THE PASSENGER FRONT SPRING SNAPPED IN TWO. HAD NO FOREWARNING, BEFORE IT EXPLODED APART. THE PASSENGER-SIDE COIL-SPRING SNAPPED OFF THE VEHICLE, IN TWO+ PLACES, AND WAS RETRIEVED FROM THE HIGHWAY. METAL SHOWED A CLEAR SNAP. THE METAL APPEARED CORRODED AND AS IF THE METAL WAS NOT STRONG ENOUGH TO WORK LONG-TERM. SIX MONTHS LATER, THE DRIVER SIDE FRONT-COIL-SPRING SNAPPED AND DISLODGED IN THE EXACT SAME MANNER, AND WHEN THE FAILED PIECE WAS RETRIEVED FROM THE HIGHWAY, IT SHOWED THE SAME CLEAR SNAP LINES, AS ITS PREDECESSOR. BOTH INSTANCES CAUSED THE CAR TO LOSE CONTROL. CLEARLY A MANUFACTURING DEFECT WITH SUB-PAR METALLOIDS THAT LIKELY WILL KILL SOMEONE IF THEY ARE TRAVELING FAST. PLEASE RECALL AS ITS THE SAME DEFECT THAT APPEARS IN 2003 - 2006 SAAB MODELS. IN 2010, GENERAL MOTORS OFFERED AN EXTENDED WARRANTY ON ABOUT 66,000 2003 - 2006 SAAB 9-3 VEHICLES TO COVER THE COST OF REPLACING FRONT SPRINGS THAT BREAK DUE TO CORROSION. THE MECHANIC STATED THAT THIS WAS A COMMON OCCURRENCE ON FOR SAAB 9-3 MODELS, BUT IS NOT COVERED BY GM SPECIAL COVERAGE #15917 BECAUSE THAT EXTENDED WARRANTY ONLY APPLIES TO 2003-2006 VEHICLES.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "07/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11099428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCIDENT HAPPENED AFTER HEADLIGHT LOW-BEAM FAILED.WAS TOLD AND SHOWN A MELTED HEADLIGHT MODULE THAT OVERHEATED AND CAUSED THE LOW-BEAM HEADLIGHTS  TO GO OUT. THE ENTIRE HEADLAMP ASSEMBLY WAS REPLACED. AS WERE OTHER CRASH INVOLVED PARTS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CONCERN 1 AS A FEMALE IT IS A SAFETY ISSUE TO BE STRANDED IN MY VEHICLE, RECENTLY WHAT I THOUGHT WAS A BATTERY ISSUE TURNED OUT TO BE A KEY FOB ISSUE. I HAVE BEEN STRANDED WITH A WELL CARED FOR VEHICLE THAT HAS KEYS THAT START AND GET TO DESTINATION, BUT HAVE GOTTEN BACK IN MY VEHICLE AND THE CAR DOES NOT RECOGNIZE THE FOB.      CONCERN 2 I HAVE NOTICED THAT THE CRUISE CONTROL IS AUTOMATICALLY COMING ON, AND I HAVE TO MANUALLY TURN IT OFF, THERE HAVE BEEN TIMES WHEN I WAS NOT AWARE UNTIL UNTIL I TOOK FOOT OFF ACCELERATOR AND THE CAR STILL TRAVELED AT THE CRUISE SPEED, TAPPING THE BRAKE DID NOT DISENGAGE THE CRUISE SETTING.",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STRUGGLED TO START WHEN THE TEMPERATURE WAS BELOW 40 DEGREES.  AFTER A NUMBER OF TRIPS TO THE SHOP THAT MAINTAINS MY CAR THEY RESEARCHED ONLINE THAT THIS WAS A COMMON PROBLEM FOR SAAB WITH THIS ENGINE AND GM ISN'T WILLING TO DO ANYTHING ABOUT IT. PLEASE DO SOMETHING!",
        "vin": "YS3FB49Y881"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "12/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD STARTING COLD WITH ENGINE MISFIRE AND LOW COMPRESSION, VEHICLE STARTS AND RUNS NORMALLY WHEN HOT 2007-11 9-3 B207 & 2011 9-5 A20NFT  ______________________________________________    THIS IS A RE-ISSUE OF A PREVIOUSLY PUBLISHED DOCUMENT WITH UPDATED INFORMATION HIGHLIGHTED INRED.    MODELS:   2007-2008 SAAB 9-3 B207R (THIS PI DOES NOT APPLY TO THE B284 ENGINE)  UPDATE: THIS CONDITION COULD ALSO OCCUR ON 2009-11 B207 OR 2011 9-5 A20NFT   CONDITION/CONCERN:   A TECHNICIAN MAY COMMENT OF HARD OR NO STARTING WHEN COLD. THEY MAY ALSO FIND ENGINE MISFIRES WITH DTC'S P0300, P0301, P0302, P0303 OR P0304. THE VEHICLE WILL START AND RUN NORMALLY WHEN HOT.   RECOMMENDATIONS/INSTRUCTIONS:   THIS CONDITION MAY BE CAUSED BY A WORN INTAKE VALVE AND IS TYPICALLY FOUND ON VEHICLES WITH 50,000 OR MORE MILES. DUE TO THE NATURE OF THIS ISSUE IT CAN BE MORE FREQUENT IN COLD CLIMATES AND COULD EXHIBIT THE CONDITION AT A LOWER MILEAGE; INVERSELY IN WARMER CLIMATES IT MAY OCCUR AT A HIGHER MILEAGE.   TAC HAS FOUND INTAKE VALVE WEAR OF THE VALVE SEAT FACE WILL CAUSE SIGNIFICANT COMPRESSION LOSS IN COLD TEMPERATURES THAT WILL NOT BE READILY APPARENT WHEN HOT.   TO PROPERLY DIAGNOSE THIS CONDITION PERFORM A COLD (AFTER AN OVERNIGHT STAY IS BEST) COMPRESSION AND LEAK DOWN TEST. AS AN EXAMPLE, AN ENGINE WITH A 150-175 PSI HOT CRANKING COMPRESSION READING MAY ONLY SHOW 75 TO 90 PSI WHEN COLD.   ONCE A TECHNICIAN HAS DETERMINED HE HAS THE ABOVE DESCRIBED CONCERN HE MUST INITIATE A TECHNICAL ASSISTANCE CENTER (TAC) CASE BY EMAIL AT XXXX OR BY PHONE AT XXXXX PROMPT #3. TAC WILL PROVIDE THE FULL INFORMATION ON THE PARTS/REPAIR PROCEDURE WHEN THE CASE IS SET.   PARTS REQUIRED: INLET VALVE 2007 TO 2011, BIOPOWER 55563529 (8 REQUIRED)",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062707,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2008 9-3 SAAB THAT HAS APPROXIMATELY 120,000 MILES ON IT. WHEN IT IS COLD OUTSIDE (50 DEGREES AND BELOW), OUR CAR STARTS VERY ROUGHLY AFTER 2-3+ MINUTES OF CONTINUOUS CRANKING.  ONCE THE CAR STARTS AND HAS WARMED UP, IT RUNS QUITE SMOOTHLY. HOWEVER, IT CURRENTLY ISN'T STARTING AT ALL NOW AND IS IN THE SHOP. WE HAVE BEEN DOING RESEARCH ONLINE TO SEE IF THIS IS A COMMON PROBLEM AMONG OTHER 2008 SAAB OWNERS. SO FAR WE HAVE SEEN A LARGE AMOUNT OF OTHER OWNERS OF 2008 SAABS EXPRESSING THE SAME CONCERNS/PROBLEMS AND HAVE EXPERIENCED A $2,00-$3,000 EXPENSE TO FIX IT. OUR DIAGNOSIS IS THAT THERE ISN'T ANY COMPRESSION AND IT IS ASSUMED THAT THE LOWER INTAKE VALVES ARE FAULTY AND WILL NEED TO BE REPLACED FOR AN ESTIMATED COST OF $2,000-$3,000. I HAVE CONTACTED GM AND AM AWAITING THEIR RESPONSE AS TO WHETHER THERE ARE ENOUGH OTHER COMPLAINTS TO WARRANT A RECALL OR RECEIVE ANY FINANCIAL ASSISTANCE TO COMPLETE THE REPAIRS. IT APPEARS THAT THE ORIGINAL GM PARTS ARE FAULTY AND BECOME WORN, WHICH RESULTS IN DIFFICULTY IN COLDER TEMPERATURES. WE PREVIOUSLY OWNED A 2003 SAAB, WHICH WAS BUILT BY SAAB, AND WE NEVER EXPERIENCED ANY OF THESE SAID PROBLEMS.",
        "vin": "YS3FB49YX81"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058136,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED VICTORY CHEVROLET CADILLAC AT (707) 776-6385 (1360 AUTO CENTER DR, PETALUMA, CA). THE CONTACT ALSO CALLED MARIN MAZDA AT (415) 454-7000 (807 FRANCISCO BLVD, SAN RAPHAEL, CA). BOTH DEALERS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FB79Y886"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS IS THE CASE WITH MANY OTHER SAAB 9-3 BUILT AFTER 2006, MY DEALER'S SERVICE DEPARTMENT RECENTLY IDENTIFIED A PROBLEM WITH THE INTAKE VALVES IN MY VEHICLES ENGINE, WHICH HAS EXPERIENCED PREMATURE FAILURE AT 77,000 MILES.  OTHER POSTINGS ON LINE LEAD ME TO BELIEVE THAT THIS IS MAJOR ISSUE AFFECTING THOUSANDS OF THESE VEHICLES BUILT BY GM IN YEARS 2007 AND LATER.  THE CAUSE IS WIDELY KNOWN AND IS A MANUFACTURERS DEFECT RESULTING IN FAILURE OF THE VEHICLE TO START IN COLD WEATHER.  THE FIX REQUIRED IS A REPLACEMENT OF ALL OF THE ENGINE INTAKE VALVES.  THIS IS COSTLY FIX IN THE RANGE OF $3,000 PER VEHICLE.  WHETHER GM KNEW IT WAS USING INFERIOR PARTS PRONE TO FAILURE OR NOT, THEY ARE STILL RESPONSIBLE AND SHOULD BE REQUIRED TO PERFORM THE REPAIRS AT THEIR COST, OR TO AT A MINIMUM PARTICIPATE IN SOME WAY IN THE COST OF THE REPAIRS.",
        "vin": "YS3FB49YX81"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS IN MY VEHICLE STARTED FLICKERING AND SHUT OFF WHILE DRIVING IN THE DARK A FEW DAYS AGO.  AFTER SAFELY PARKING THE CAR, I INVESTIGATED AND FOUND THAT THE HOUSINGS ARE DESIGNED TO BE UNSERVICABLE BUT I WAS ABLE TO INVESTIGATE AND FOUND THAT NEARLY ALL OF THE INTERNAL WIRING SHIELDING HAD CRACKED AND FALLEN OFF (PLEASE SEE ATTACHED PHOTOS, I APPOLOGIZE ABOUT THE QUALITY).  THE HEADLIGHTS FAILING WITHOUT NOTICE CREATED A VERY DANGEROUS BLACKOUT SCENARIO WHICH COULD HAVE VERY EASILY RESULTED IN SERIOUS INJURY AND/OR DEATH DUE TO MANUFACTURING DEFECT AND BY NO FAULT BY OR PRIOR WARNING TO THE OPERATOR.   I WAS LUCKY!",
        "vin": "YS3FH56U281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE WEBSITE FOR REPORTING YOUR REPAIR AND RECEIVING YOUR $25 MASTERCARD IS NONEXISTENT.",
        "vin": "YS3FB79Y586"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, WHILE STARTING THE CAR IT STARTED UP VERY ROUGH.  A FEW WEEKS AGO THE CHECK ENGINE LIGHT ALSO CAME ON AND THE MECHANIC TOLD ME THERE WAS AN ISSUE IN CYLINDER 2.  WE REPLACED ALL SPARK PLUGS AND COILS, AND THE ISSUE DID NOT GO AWAY.  IN ADDITION, THE CAR HAS ALSO STARTED STALLING RANDOMLY.  LUCKILY, I HAVEN'T BEEN DRIVING AT HIGH SPEEDS WHEN THIS HAS HAPPENED BUT IT'S NOW SHUT OFF ABOUT 7 OR 8 TIMES IN THE LAST MONTH.  BEEN WONDERING IF ITS INTAKE VALVES, FUEL PUMP, POWERTRAIN CONTROL MODULE, CAMSHAFT TIMING... SOUNDS LIKE LOTS OF OTHER PEOPLE HAVE EXPERIENCED SIMILAR ISSUES AND HOPING MINES NOT BECAUSE OF THE INTAKE VALVES.  PLEASE EMAIL [XXX]@HOTMAIL.COM IF YOU HAVE EXPERIENCED SIMILAR ISSUES AND KNOW THE FIX.  CAR IS A MANUAL TRANSMISSION.*JB",
        "vin": "YS3FB46Y681"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTS AND SHUTS OFF.",
        "vin": "YS3FB79Y586"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY AIRBAGS REPAIRED AND RECEIVED A LETTER SAYING I WOULD RECEIVE A $25 MASTERCARD FOR GETTING THE REPAIR DONE. I TRIED TO GO TO THE WEBSITE AND IT IS NOT A FUNCTIONING WEBSITE. AFTER TAKING HOURS TO GET THE REPAIR DONE, NOW THIS. THE WEBSITE LISTED WAS WWW.TAKATAREPAIR.COM/SAAB. I JUST WANTED YOU TO BE AWARE OF THIS WITH EVERYTHING ELSE GOING ON. PLEASE ADVISE.",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A NOTICE REFERENCING MY 2008 SAAB 9-3, INDICATING PARTS WERE AVAILABLE AND I WOULD BE ABLE TO SET AN APPOINTMENT FOR THE TAKATA AIRBAG TO BE REPLACED.  I CALLED MURDOCK CHEVROLET BUICK GMC, THE AGENCY LISTED ON THE NOTICE, AND THEY SET UP AN APPOINTMENT FOR ME THIS MORNING.  WHEN I ARRIVED, THEY SAID THEY DID NOT HAVE PARTS AND SHOWED ME IN THEIR SYSTEM THAT BASED ON MY VIN NO PARTS WERE CURRENTLY AVAILABLE.    THE FACT THEY SET THE APPOINTMENT IS THEIR MISTAKE, BUT IT SEEMED REASONABLY CLEAR THAT THIS CADILLAC DEALERSHIP DID NOT HAVE ACCESS TO THE PARTS NEEDED.  SO THE STATEMENT THAT 'AIRBAG INFLATOR PARTS ARE READY '' WAS INCORRECT.  PLEASE CLARIFY HOW I CAN REASONABLY GET MY SAAB FIXED.  I LIVE IN NORTHERN UTAH SO DEALERSHIPS THAT CAN PROVIDE THIS SERVICE ARE LIMITED.  THE NOTICED CARRIED A COPYRIGHT MARKING FROM GENERAL MOTORS, AND THE LOGOS OF THE NHTSA AND THE USDOT",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2017",
        "dateOfIncident": "09/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED JEFF WYLER FAIRFIELD CADILLAC KIA NISSAN (5815 DIXIE HWY, FAIRFIELD, OH 45014; 513-682-2500) WHO INFORMED THE CONTACT THAT, DESPITE THE NOTICE HE RECEIVED STATING THAT CADILLAC WOULD PERFORM THE RECALL REPAIR, THEY WOULD NOT REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FB59Y181"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP IS DEFAULTING TO CHECK ENGINE LIGHT , ERROR CODE FOR FUEL PUMP , WHILE DRIVING THE FUEL PUMP INTERMITTENTLY DOES NOT SEND ENOUGH FUEL TO MOTOR RESULTING IN NOT ENOUGH POWER STALLING WHILE DRIVING.",
        "vin": "YS3FH71U686"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REACHED 100K MILES, AND CAR BEGAN RUNNING VERY ROUGH.  ENGINE LIGHT CAME ON AND DIAGNOSED AS BAD IGNITION COIL.  PAID FOR TUNE-UP, IGNITION COIL, AND AND FUEL SERVICE.  LESS THAN A MONTH LATER, SAME ISSUE.  CAR RUNNING FINE, THEN SUDDENLY ALMOST STALLS AND ENGINE LIGHT BLINKS THEN STAYS ON - CAR RUNS VERY ROUGH AT IDLE AND ACCELERATION.  REPLACED 2 MORE COILS.  LESS THAN ONE MONTH ISSUE, SAME ISSUE - CAR RUNNING OK, THEN JUST ALMOST STALLS AND RUNS ROUGH - ENGINE LIGHT BLINKS THEN STAYS ON - RELACED #5 COIL.  WHEN DIAGNOSING, SERVICE TECH ADVISED THAT ISSUE WAS LIKELY WORSE, NOT MAINTAINING COMPRESSION - LIKELY REQUIRED VALVE JOB.  HAVE ALREADY PAID SEVERAL THOUSANDS OF DOLLARS ON IGNITION COILS AND OTHER SERVICE TO DEALERSHIP FOR THIS ISSUE, NOW FACING LARGE BILL FOR VALVE JOB.",
        "vin": "YS3FH41U981"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010203,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIRS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED SEVERAL MONTHS AGO WHOM CONFIRMED THAT PARTS WERE NOT AVAILABLE BUT A SECOND NOTICE WOULD BE SENT TO OWNERS WHEN REMEDY PARTS BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FH41U581"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS CONTACTED (DIRITO BROTHERS SAAB, 2020 NORTH MAIN STREET, WALNUT, CALIFORNIA) AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FH41U681"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA  RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. WHILE DRIVING AT ANY SPEED  THE AIR BAG INDICATOR ILLUMINATED WITHOUT WARNING. THE CONTACT RECEIVED A RECALL NOTICE FOR THE AIR BAG AND TOOK THE VEHICLE TO A DEALER WHERE THE AIR BAG WAS REPLACED. THE NHTSA CAMPAIGN NUMBER WAS NOT PROVIDED. THE FAILURE RECURRED, BUT THE DEALER STATED THAT THE AIR BAG INDICATOR WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 41,000. ..UPDATED 06/06/17 *BF  UPDATED 06/07/17*LJ    UPDATED 08/09/2017*JS  TH CONSUMER REQUESTED AN UPDATE. UPDATED 09/1/2017*JS",
        "vin": "YS3FB79Y186"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE PARTS WERE DISTRIBUTED TO THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FB79Y086"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10982966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING THIS PROBLEM WITH MY CAR FOR A WHILE NOW AND COULDN'T FIGUREOUT WHAT THE PROBLEM WAS. WHEN STARTED FROM A COLD START WOULD TAKE 2 OR 3 TIMES TO GET THE CAR RUNNING IT WOULD STALL OUT AND RUN REALLY ROUGH. AFTER A NUMBER OF TRIPS TO THE SHOP THAT MAINTAINS MY CAR THEY RESEARCHED ONLINE THAT THIS WAS A COMMON PROBLEM FOR SAABS WITH THIS ENGINE AND GM ISN'T WILLING TO DO ANYTHING ABOUT IT. I HAD TO SPEND JUST UNDER 2000.00 TO GET THIS ISSUE FIXED. I SEE THERE ARE A  BUNCH OF PEOPLE POSTING ABOUT THIS SAME PROBLEM THE INTAKE VALVE ISSUE IS A KNOWN ISSUE WITH GM SUPPLIED INTAVE VALVES ON 2007-20011 SAABS WITH THE B207 MOTOR.",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.     MY SAAB WAS RECALLED. THIS VEHICLE WAS BUILT BY GM. I WAS TOLD BY SAAB THE ONLY PLACES THAT COULD FULFILL THE RECALL WERE >100 MILES AWAY. I CALLED THE FACILITY ON THE OTHER SIDE OF THE STATE ~5 TIMES WITHOUT A RETURN CALL. I'D LIKE THE GET THIS FIXED AND I'M WORRIED ABOUT DRIVING THE CAR WITH THE DEFECTIVE AIRBAGS.",
        "vin": "YS3FB46Y881"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGHT A 2008 SAAB 9-3 AND THE FUEL READER LIGHTS UP AND SAYS IT'S EMPTY, EVEN WHEN THE TANK IT FULL. ALSO, THE DOOR LOCKS DOESN'T WORK WHEN UNLOCKING OR LOCKING THEM. THIS HAPPENS WHEN TRYING TO LOCK OR UNLOCK WITH REMOTE KEY AND WHEN YOUR LOCK OR UNLOCK IT FORM THE SINCE. YOU HAVE TO LOCK OR UNLOCK IT MANUALLY BY PULLING UP OR PUSHING DOWN WITH YOUR HAND. I HAVE DONE SOME RESEARCH ONLINE AND I CAME ACROSS A LOT OF OTHER SAAB 9-3 OWNERS THAT HAVE CAME ACROSS THE SAME PROBLEM. I THINK IT SHOULD BE RECALL SINCE I THINK IT SHOULD BE FAIR ENOUGH FOR SAAB TO FIX THE SITUATION.",
        "vin": "YS3FB49Y381"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FH41U881"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "12/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FH41U081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE VALVE ISSUE IS A KNOWN ISSUE WITH GM SUPPLIED INTAVE VALVES ON 2007-20011 SAABS WITH THE B207 MOTOR.  CAR STRUGGLED TO START WHEN THE TEMPERATURE WAS BELOW 40 DEGREES.  WHEN IT FINALLY STARTED, THE CAR IDLED ROUGHLY.  IN ADDITION CAR STALLED A COUPLE OF TIMES WHILE BEING DRIVEN ON THE HIGHWAY.  TOOK IT TO THE SERVICE CENTER AND THEY PERFORMED A COLD BLOCK COMPRESSION TEST.  VALUES WERE WELL BELOW 100 ON 2 OF THE VALVES.  THE OTHER TWO TESTED ABOUT 20% BELOW NORMAL.  66K MILES, SERVICED REGULARLY, AND PREMIUM FUEL WAS USED EXCLUSIVELY.  ALSO, SOUTHERN CARE FROM DAY 1.",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  RECEIVED NOTICE IN MARCH 2016 THAT PARTS WERE NOT AVAILABLE TO FIX, AND TO DATE HAVE STILL RECEIVED NO NOTIFICATION OF HOW TO GET THIS CORRECTED.  ALSO, RECEIVED NOTICE OF SAFETY BELT RECALL BUT AGAIN NO NOTIFICATION OF WHERE AND WHEN PARTS WOULD BE AVAILABLE.",
        "vin": "YS3FB79Y786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  NO REMEDY YET AT ALMOST A YEAR?  I SEE THERE WAS ANOTHER DEATH AND WOULD LIKE THIS REMEDIED.",
        "vin": "YS3FB59YX81"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY 2008 SAAB 9-3 FOR ABOUT A YEAR NOW AND I HAVE HAD AN ONGOING ROUGH RUNNING ISSUE THAT SEEMS TO BE GETTING WORSE.  WHEN I START MY CAR UP IN THE MORNING IT RUNS VERY ROUGH AND RECENTLY THE CHECK ENGINE LIGHT HAS BEEN TURNING ON AND OFF WITH CYLINDER MISFIRE CODES. I HAVE DONE SOME RESEARCH AND HAD THIS PROBLEM DIAGNOSED, SEVERAL TIMES, AS HAVING BAD INTAKE VALVES.  AFTER DOING MORE RESEARCH ON THIS PROBLEM, I HAVE COME TO FIND THIS IS A RATHER COMMON ISSUE WITH THIS SPECIFIC YEAR MAKE AND MODEL.  THIS IS CONCERNING BECAUSE I HAVE HAD THIS REPAIR QUOTED AT OVER $2000.00.  I AM VERY FAMILIAR WITH MANUFACTURER RECALLS AND HAVE BEEN TOLD BY MULTIPLE DEALERSHIPS TO SUBMIT A COMPLAINT IN ORDER FOR THIS PROBLEM TO BE COVERED UNDER A MANUFACTURER RECALL DUE TO FAULTY PARTS.  *TR",
        "vin": "YS3FB49Y581"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10937189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT-BELT IS NOT RETRACTING, AND OPERATED DEFECTIVELY SIMILAR TO RECALLED SAAB CONVERTIBLES AND OTHER RECALLED GM MODELS. DRIVER THEREFORE HAS NO WORKING SEATBELT AND WAS TOLD BY THE DEALERSHIP THAT IT WAS NOT COVERED UNDER WARRANTY. GM INSTALLED THE DEFECTIVE SEAT BELT IN MULTIPLE VEHICLES THAT HAVE ALREADY BEEN RECALLED. THANK YOU FOR YOUR CONSIDERATION. HAS BEEN AN ISSUE SINCE 2015.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT COIL SPRINGS WHILE DRIVING, SNAPPED IN HALF, AND DISLOCATED FROM VEHICLE, 6 MONTHS APART. WAS DRIVING AT 30 MPH, AND THE PASSENGER FRONT SPRING SNAPPED IN TWO. HAD NO FOREWARNING, BEFORE IT EXPLODED APART. THE PASSENGER-SIDE COIL-SPRING SNAPPED OFF THE VEHICLE, IN TWO+ PLACES, AND WAS RETRIEVED FROM THE HIGHWAY. METAL SHOWED A CLEAR SNAP. THE METAL APPEARED CORRODED AND AS IF THE METAL WAS NOT STRONG ENOUGH TO WORK LONG-TERM. SIX MONTHS LATER, THE DRIVER SIDE FRONT-COIL-SPRING SNAPPED AND DISLODGED IN THE EXACT SAME MANNER, AND WHEN THE FAILED PIECE WAS RETRIEVED FROM THE HIGHWAY, IT SHOWED THE SAME CLEAR SNAP LINES, AS ITS PREDECESSOR. BOTH INSTANCES CAUSED THE CAR TO LOSE CONTROL. CLEARLY A MANUFACTURING DEFECT WITH SUB-PAR METALLOIDS THAT LIKELY WILL KILL SOMEONE IF THEY ARE TRAVELING FAST. PLEASE RECALL AS ITS THE SAME DEFECT THAT APPEARS IN 2003 - 2006 SAAB MODELS. IN 2010, GENERAL MOTORS OFFERED AN EXTENDED WARRANTY ON ABOUT 66,000 2003 - 2006 SAAB 9-3 VEHICLES TO COVER THE COST OF REPLACING FRONT SPRINGS THAT BREAK DUE TO CORROSION. THE MECHANIC STATED THAT THIS WAS A COMMON OCCURRENCE ON FOR SAAB 9-3 MODELS, BUT IS NOT COVERED BY GM SPECIAL COVERAGE #15917 BECAUSE THAT EXTENDED WARRANTY ONLY APPLIES TO 2003-2006 VEHICLES.    HTTP://WHEELS.BLOGS.NYTIMES.COM/2010/04/02/PROBLEMS-SPRING-UP-FOR-2003-6-SAAB-9-3S/?_R=0.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937193,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SIDE DOOR WINDOW HAS HAD ALL OF THE FOLLOWING ISSUES, WHICH LED UP TO ITS CURRENT STATE - THE WINDOW IS INOPERATIVE. I HAVE NOT HAD IT REPAIRED BECAUSE IT IS LIKELY TO RE-OCCUR, DUE TO POOR FIT, AND FAULTY ALIGNMENT.  ' WINDOW RATTLES OR SQUEAKS.  ' WINDOW BINDS.  ' WINDOW HAS SLOW OPERATION.  ' WINDOW FITS POORLY OR IS MISALIGNED.    CURRENTLY, REAR DRIVER SIDE WINDOW INOPERABLE, AND FITS THE FOLLOWING GM COMMUNICATION (NHTSA ID NUMBER: 10054243 MANUFACTURER COMMUNICATION NUMBER: PI-0018-B   GENERAL MOTORS: THE WINDOWS, FRONT AND REAR, WOULD BIND, POOR FIT, MISALIGNMENT, MAKES RATTLE OR SQUEAKING NOISES, MOVES SLOWLY AND IS INOPERATIVE. MODEL 2008-2014 VEHICLES AND TRUCKS.  IS THERE A RECALL FOR THIS DEFECT?",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  RECEIVED THE RECALL NOTICE IN MARCH 2016 FROM GM AND STILL HAVE NOT BEEN ABLE TO REPLACE.  THIS IS AN UNACCEPTABLE SAFETY RISK FOR ME AND MY PASSENGER.",
        "vin": "YS3FB76Y686"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "12/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FH41U581"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. IT HAS BEEN 10 MONTHS SINCE THE RECALL ON MY VEHICLE AND EVERY INQUIRY I MAKE IS MET WITH \"NO PARTS AVAILABLE\". THIS IS A SERIOUS SAFETY ISSUE AND I LIVE IN SC WHICH, TO MY UNDERSTANDING, IS A PART OF THE COUNTRY WITH A HIGHER CAUSE FOR CONCERN.",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL NUMBER:16V063 RECALL DATE: MAY 11, 2016  MANUFACTURER RECALL NUMBER: 15043 RECALL STATUS: RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE . NO SERVICE CENTER WITHIN 150 MILES. CLOSEST SERVICE CENTER STATED THAT LAST RECALL TOOK 2 YEARS. I AM IN A HIGH RISK AREA, HIGH RISK CAR- OLDER THAN 5 YRS, HIGH HEAT &  HUMIDITY LOCATION (LIVE ON THE BEACH), AND AIRBAG IS DRIVER SIDE. I TRANSPORT 2 YOUNG CHILDREN DAILY. NEED IMMEDIATE RESOLUTION.",
        "vin": "YS3FB56Y781"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FB79Y986"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - HEARD NOTHING FROM ANYONE ON HOW TO GET THIS FIXED.  MY HUSBAND IS ON ANTICOAGULANTS - IF IN AN ACCIDENT WITH THESE AIRBAGS HE COULD BLEED TO DEATH.  WE NEED THIS FIXED IMMEDIATELY.  WHO DO WE CONTACT AND HOW CAN WE ENSURE THIS IS DONE QUICKLY?",
        "vin": "YS3FB79Y486"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934356,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-STILL NO REPAIR OR TIMELINE AFTER WAITING FOR ALMOST A YEAR.",
        "vin": "YS3FH46U181"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIR BAG - DRIVER SIDE",
        "vin": "YS3FB56YX81"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2016 I RECEIVED A SAFETY RECALL NOTIFICATION FROM SAAB, VIA USPS. THE LETTER STATED:    *YOUR VEHICLE IS INVOLVED IN GM SAFETY RECALL 28810/SAAB SAFETY RECALL 15041. PARTS ARE NOT CURRENTLY AVAILABLE, BUT WHEN THEY ARE, SAAB OFFICIAL SERVICE CENTER WILL REPLACE THE AIR BAG INFLATOR AT NO CHARGE. ALSO, WHEN PARTS ARE AVAILABLE, YOU WILL RECEIVED ANOTHER LETTER ASKING ME TO TAKE MY VEHICLE TO BE SERVICED.     IT HAS NOW BEEN OVER NINE MONTHS AND I STILL HAVE NOT HEARD BACK FROM THEM!",
        "vin": "YS3FB49YX81"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FH41U981"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT THE VEHICLE OVERHEATED AND STALLED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE EXTENSION TANK WAS REPLACED THREE TIMES. THE INNER HOSE DETACHED INTERNALLY AND THE DEALER PROVIDED NO SOLUTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE CONTACT WAS UNCERTAIN IF THE PART WAS REPLACED A FOURTH TIME AND IF THE FAILURE WOULD RECUR. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "YS3FH71U186"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y381"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB79Y886"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y581"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 02/07/2017*CT  UPDATED 02/08/17.*JB",
        "vin": "YS3FB79Y586"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG RECALL WITH NO FIX.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "11/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FM52R081"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y581"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 01/05/2017*CT",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB SAAB 9-3. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) WAS RECEIVED IN MARCH. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL REMEDY TAKING TOO LONG AS THERE HAVE BEEN DEATHS RESULTING FROM THIS ISSUE, EVEN IN MINOR ACCIDENTS. NOT ACCEPTABLE!",
        "vin": "YS3FB79YX86"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE WHAT I'VE SEARCHED IS THE \"COLD START PROBLEM\". WHEN STARTING THE ENGINE IN COLD WEATHER, IT TAKES IT A TRY OR TWO TO START, BUT UPON IGNITION, IT SPUTTERS FOR A MINUTE OR TWO AND ONCE IT WARMS, IT RUNS PERFECTLY FINE. FROM READING REVIEWS ONLINE, IT SOUNDS LIKE MANY OTHERS HAVE HAD THIS AND IT IS THE RESULT OF THE VALVES GOING BAD, MEANING I NEED A WHOLE NEW REBUILD DONE. CAR ONLY HAS 127K MILES ON IT AND IS IN MINT CONDITION. PER THE NUMBER OF CASES I'VE READ ONLINE ABOUT THIS, IT SOUNDS LIKE THE '07-'08 MODELS WERE THE ONE'S THAT WERE DEFECTIVE IN MY CASE. BOUGHT THE CAR RECENTLY FROM A FRIEND WHO THOUGHT IT WAS JUST A FUEL PUMP ISSUE NEEDING TO BE REPLACED, WHICH I'D PAY THE FEW HUNDRED DOLLARS FOR THAT, NO PROBLEM. BUT NOW LOOKING AT CLOSE TO $3,000 TO HAVE FIXED??",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.    I FEEL VERY UNSAFE DRIVING THIS VEHICLE, AND THE ONLY INFORMATION I HAVE RIGHT NOW IS THAT THERE IS NO REMEDY AVAILABLE.",
        "vin": "YS3FB49Y181"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FB79Y486"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL 7 MONTHS AND COUNTING NO RESPONSE, NO REPAIR. HOW MUCH LONGER AND WILL I HAVE TO WAIT AGAIN FOR THE PASSENGER SIDE REPAIR? WILL I HAVE TO DRIVE MY SAAB TO FLORIDA LIKE I HAD TO DO WITH MY FORD TO GET IT FIXED?",
        "vin": "YS3FB59Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "10/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY VEHICLE IS AFFECTED BY THE CURRENT TAKATA RECALL. I HAVE RECEIVED NOTICE FROM SAAB MONTHS AND MONTHS AGO AND THERE IS STILL NO FIX AVAILABLE. I HAVE A POTENTIALLY LIFE THREATENING PROJECTILE IN FRONT OF ME WHILE I DRIVE AND A REMEDY NEEDS TO COME SOONER THAN LATER. I DRIVE ABOUT 50,000 MILES A YEAR, I AM ALWAYS ON THE ROAD. WHEN I CONTACTED MY SAAB DEALER THEY TOLD ME THEY WON'T PUT ME IN A LOANER, THERE IS NO FIX, AND THEY THINK IT WILL BE A LONG TIME BEFORE WE HAVE ONE. BASED ON PREVIOUS RECALLS, I TEND TO BELIEVE THEM. I WOULD LIKE A LOANER CAR UNTIL THIS GETS SORTED OUT. I'M SURE REPLACEMENT PARTS FOR MY SAAB ARE ON THE BOTTOM OF THE PRIORITY LIST AS ITS A LOW VOLUME MODEL IN THIS GIANT MESS.",
        "vin": "YS3FB76Y386"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN 6MO SO FAR SINCE THE RECALL AND STILL NO REPAIR AVAILABLE. THIS IS A POTENTIALLY FATAL DEFECT.",
        "vin": "YS3FB46Y381"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 55 MILES PER HOUR ON THE LODGE FREEWAY IN METRO DETROIT, I WAS IN THE LEFT LANE AND THERE IS NO EMERGENCY LANE ON THE LEFT, AND MY ENGINE TURNED OFF ON ITSELF (SCARY!). AS WE ARE AWARE, BRAKES PRETTY MUCH STOP WORKING WHEN THE ENGINE IS OFF AND I WAS DRIVING WITH 55 MPH WITH MANY VEHICLES AROUND ME. I MANAGED TO PULL OVER TO THE RIGHT WITHOUT GETTING HIT. WHEN I STOPPED, I TRIED TO START THE CAR, IT WOULD START FOR 5 SECONDS AND IT WILL STALL AND I HAD ABOUT 10 GALLONS OF GASOLINE IN THE TANK. I HAD TO GET THE VEHICLES TOWED TO MY HOUSE.     NEXT DAY I STARTED READING THE BLOGS ONLINE TO FIGURE OUT HOW IT IS POSSIBLE FOR THE ENGINE TO STALL LIKE THAT WITHOUT ANY WARNINGS, ESPECIALLY ONE IS GOING AT HIGHWAY SPEED. IT TURNED SAME THING HAPPENED TO A LOT OF SAAB OWNERS AS WELL - ENGINE STALLED WITHOUT ANY WARNINGS WHEN THEY WERE DRIVING.     I HOOKED UP THE VEHICLES TO A DIAGNOSTIC COMPUTER AND IT SHOWED THAT THE CRANKSHAFT SENSOR STOPPED WORKING. IF THERE ARE OTHER SAAB OWNERS WITH THE SAME PROBLEMS, WE SHOULD DO SOMETHING TO PREVENT ANY INJURIES - HAPPY TO DISCUSS IT WITH ANYBODY.",
        "vin": "YS3FB46Y081"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899449,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I WAS NOTIFIED IN MAY THAT THE AIRBAGS NEEDED TO BE REPLACED BUT WERE NOT YET AVAILABLE  I AM STILL WAITING",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  RECALL WAS ISSUED IN FEBRUARY 2016, SIX MONTHS AGO, AND PARTS ARE NOT AVAILABLE TO HAVE IT FIXED.",
        "vin": "YS3FB79Y986"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED BY GM/SAAB PHONE REPRESENTATIVE (800-955-9007) STEPHANIE LONG THAT BECAUSE IT IS GM'S POSITION THAT THE CAR IS SAFE (AND BY IMPLICATION THE RECALL IS A MISTAKE), GM WILL NOT PROVIDE A RENTAL CAR UNTIL PARTS ARE AVAILABLE. GM IS OBVIOUSLY PLAYING THE ODDS BY DECIDING THAT ONE OR TWO FUTURE DEATH CLAIMS WILL BE LESS EXPENSIVE THAN PROVIDING REPLACEMENT VEHICLES.",
        "vin": "YS3FB79Y686"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897989,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED AN INTERMITTENT LOSS OF BRAKE ASSIST POWER. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC AND THE TECHNICIAN DIAGNOSED THAT THE VACUUM ASSIST PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED THE FAILURE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 05V236000 (SERVICE BRAKES, HYDRAULIC), BUT THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 53,000.",
        "vin": "YS3FH42R681"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB A 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE REMEDY WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. UPDATED 10/13/16 *BF    THE CONSUMER WAS ADVISED THERE WAS NO KNOWN REPAIR AND TO OPERATE THE VEHICLE AS NORMAL. UPDATED 8/25/2017*JS",
        "vin": "YS3FH52R081"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894402,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG RECALL WAS ISSUED FEBRUARY 3RD, 2016. IT HAS BEEN SIX MONTHS NOW AND THERE IS STILL NO REMEDY PER THE SAFERCAR.GOV WEBSITE. PLEASE REVIEW THE STATUS OF THE RECALL ON THIS MODEL AND ESCALATE IT SO THERE IS SOME RECOURSE FOR CAR OWNERS.",
        "vin": "YS3FB79Y886"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"   THIS HAS BEEN GOING ON FOR MONTH'S THAT THEY HAVE NOT GOTTEN THE PARTS TO FIX THE RECALL ON MY AIR BAG AND ITS TO THE POINT MY HORN DOESN'T WORK ANYMORE AND THE LIGHTS ON MY WHEEL DO NOT WORK TO CONTROL MY SETTINGS.",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SAAB 9-3.  CONSUMER WRITES IN REGARDS TO NO CORRECTIVE ACTION AVAILABLE FOR AIRBAG RECALL 16V-063.  *SMD",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I WAS NOTIFIED OF THE RECALL AND I HAVE CONTACTED MY CERTIFIED DEALER AND THE SAAB HOTLINE AND THERE IS STILL NOT A RESOLUTION NOR CAN THEY GIVE ME A TIME FRAME AS TO WHEN THEY WILL RECEIVE THE PARTS.  THIS IS A DANGEROUS SITUATION AND THEY HAVE GONE BEYOND A REASONABLE TIME FRAME.  I DRIVE A LOT OF MILES DAILY AND NERVOUS.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 08/17/16*LJ  UPDATED 08/22/16.*JB",
        "vin": "YS3FB46YX81"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874207,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STOCK INTAKE VALVES ARE BAD, NOTICED PROBLEM AT 75,000 MILES AND BOUGHT THE CAR AT 74,000. THIS IS A VERY COMMON PROBLEM FOR THIS YEAR INCLUDING ENGINE FAILURE. OVER A 3,000$ FIX.",
        "vin": "YS3FB42Y381"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3 CONVERTIBLE. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB79Y786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/26/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB79Y886"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864133,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I RECENTLY PURCHASED THIS CAR; I NOTED THAT THIS VEHICLE IS PART OF THE DRIVER AB RECALL BUT CAN FIND NO INFORMATION ON WHEN THE AB WILL BE AVAILABLE FOR REPLACEMENT. CAN YOUR PROVIDE ANY MORE INFORMATION ABOUT TIMING AND AVAILABILITY? I DO NOT FEEL THE VEHICLE IS SAFE TO DRIVE AFTER VIEWING HOW THE INFLATOR CAN RESPOND. BY THE WAY, THIS VEHICLE SPENT TIME IN FL AND VA AREA'S SO WOULD BE SUSPECT. PLEASE ADVISE.",
        "vin": "YS3FH71U786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURES. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS UNAVAILABLE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SAAB IS NO LONGER IN BUSINESS, SO WHERE DO I TAKE MY CAR IN TO GET THE AIRBAGS REPLACED OR DISABLED?",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000(AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR.  THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. THE VIN WAS NOT AVAILABE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SAAB 9-3.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "YS3FB59Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "04/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860702,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIR BAG AND THE DEALER DOES NOT HAVE THE PART TO FIX IT",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "YS3FH41U081"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "04/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I RECEIVED THE LETTER STATING MY CAR WAS INCLUDED IN THE TAKATA RECALL BUT THE PARTS TO FIX THE RECALL WERE UNAVAILABLE AT THIS TIME. HOW AM I SUPPOSE TO FEEL SAFE DRIVING MY CAR KNOWING IN THE BACK OF MY HEAD THAT I MAY POTENTIALLY DIE IF SOME LUNATIC RUNS INTO ME? I CAN NOT AFFORD TO BUY A NEW CAR BUT I ALSO CANT AFFORD TO BE CARLESS. ARE THERE ANY OTHER OPTIONS AT THIS POINT? MY LIFE SHOULD NOT BE IN DANGER BECAUSE THERE ARE NO PARTS. THIS IS NOT MY FAULT AND I BELIEVE THE MANUFACTURER SHOULD BE COMPENSATING US BY AT LEAST GIVING US A RENTAL CAR UNTIL THE FATAL RECALL CAN BE FIXED.",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853822,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FB49Y181"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS MANUFACTURED WITH A BAD SET OF INTAKE VALVES WHICH IS NOTED ON MANY SAAB OWNER THREADS.  VALVES BREAK DOWN IN COLD WEATHER AROUND 50K MILES.  CAR STARTS AND BOTTOMS OUT SOMETIMES AND HAS ROUGH IDLE UNTIL WARMED.  ACCELERATING WHILE ENGINE IS COLD CAN CAUSE SAFETY ISSUE.  QUOTED REPAIRS RUN $2000-3000.",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-I HAVE CALLED EVERY NUMBER PROVIDED ON THE RECALL NOTICE ONLY TO BE PLACED ON HOLD, AND THEN SENT TO A VOICEMAIL.  I CALLED MY DEALERSHIP PERRINE AUTO GROUP OF CRANBURY NJ, WHO TOLD ME THE AIRBAG WARNING/RECALL WAS NOT A BIG DEAL AND THEY HAD NO IDEA WHEN A PART WILL BE AVAILABLE.  THE RECALL STATES THAT DEPLOYMENT CAN RELEASE METAL FRAGMENTS AND LEAD TO SEVERE BODILY INJURY OR DEATH.  I ASKED FOR A LOAN VEHICLE AND WAS TOLD THAT THEY WILL NOT ALLOW A LOAN BECAUSE GM HAS NOT AUTHORIZED THIS.",
        "vin": "YS3FB59Y381"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V063000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "YS3FH71U586"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852956,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE NO PARTS AVAILABLE TO FIX THE PROBLEM EVEN THOUGH MY CAR WAS RECALLED AND I  RECEIVED NOTIFICATION,",
        "vin": "YS3FB49Y181"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE INTAKE VALVES.  REPAIR CENTER SPECIALIZING IN SAAB PERFORMED COLD COMPRESSION TEST ON CYLINDERS AND FOUND THAT 2 OF 4 HAD LOW COMPRESSION.  INFORMED ME THAT THEY HAVE FOUND 90% OF THE SAABS THEY TEST FROM 2007-08 HAVE THIS PROBLEM FROM CHEAP VALVES USED SPECIFIED BY GM.",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE VALVE ISSUE - CAR WILL NOT START ON A COLD DAY AND, SOMETIMES AT A STOP SIGN /LIGHT, WILL STALL  - HAD TO TWO MECHANICS DEPICT THE ISSUE AND IT IS THE INTAKE VALVE ISSUE  - MANY SAAB'S HAVE REPORTED THIS ISSUE AND NOTHING WAS DONE BY GM - I CALLED GM AND THEY SAID THAT THEY ARE NOT RESPONSIBLE  - THIS ISSUE HAS BEEN REPORTED SEVERAL TIMES AND THERE ARE SEVERAL THREADS AS WELL.",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I DIDN'T HAVE A PROBLEM WITH THE CAR IN SOUTHERN CALIFORNIA, BUT I MOVED TO NEW YORK AT ABOUT 75K MILES - AND I NOTICED A PROBLEM RIGHT AWAY. ROUGH IDLING STARTED, AND WOULD EVEN TURN ON, THEN RIGHT BACK OFF. THE PROBLEM WAS NOT AN ISSUE AGAIN DURING THE SUMMER MONTHS, SO I WAS ABLE TO DRIVE IT TO 83K MILES. NOW THAT IT IS WINTER TIME, EVEN THOUGH IT IS GARAGED IT WILL NOT START IF IT IS UNDER 45 DEGREES. I HAD IT CHECKED OUT WITH A CERTIFIED SAAB MECHANIC AND HE CONFIRMED BY WAY OF COMPRESSION TEST THAT IT IS INDEED THE DREADED INTAKE VALVE PROBLEM. THE ESTIMATE FOR REPAIR IS $2,230!",
        "vin": "YS3FB79Y686"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. WHILE STARTING THE VEHICLE, IT IDLED ROUGHLY. ADDITIONALLY, THE VEHICLE WOULD SOMETIMES TAKE A LONG TIME TO START. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD/ROUGH START ESPECIALLY IN COLD TEMPERATURES. MECHANIC SAID #4 CYLINDER IS MISFIRING. CONFIRMED TO BE LOW COMPRESSION DUE TO PREMATURELY WORN INTAKE VALVES. #1 CYLINDER/INTAKE VALVE IS NOT FAR BEHIND #4. BECAME A SERIOUS PROBLEM WHEN ENGINE STALLS WHEN SITTING IN TRAFFIC. ALSO VEHICLE ENGINE HAS STALLED/SHUT OFF WHILE DRIVING AT LOW SPEEDS, FOR EXAMPLE, IN PARKING LOTS, REDLIGHTS, 4 WAY STOPS.",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH COLD START. COMPRESSION ON CYLINDER  4 TO LOW.INTAKE VALVE PROBLEM.",
        "vin": "YS3FB49Y381"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT THE SEAT BELT FAILED TO RELEASE WHEN FASTENED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V318000 (SEAT BELTS) AND STATED THAT THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 80,023. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YS3FB79Y086"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "79,000 MILES BEGAN WITH SLUGGISH COLD STARTS UNTIL WARMED THAN BEGAN TO RUN O.K UNTIL STOPPED TURNING OVER. ANOTHER OWNER OF GM SCREWING THE PUBLIC WITH CRAPPY VALVES INSTALLED IN THESE ENGINES. WHEN WILL THERE BE ENOUGH COMPLAINTS TO CREATE A RECALL. ORDERING PARTS FROM EAST COAST SAAB PARTS STORE AND LOOKING FOR REASONABLE AND KNOWLEDGEABLE CALIFORNIA BASED MECHANIC. EXPECTING TO PAY APPROXIMATELY $2K.  WILL UPDATE THIS COMPLAINT WHEN JOB COMPLETE.  ANOTHER GM DISAPPOINTMENT IN CAR OWNERSHIP!",
        "vin": "YS3FB79Y086"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A NOTICE ABOUT GM RECALL 14222/15027, THAT WE NEED TO TAKE OUR CAR TO A SAAB OFFICIAL SERVICE CENTER TO HAVE THE DRIVER'S SIDE SEATBELT REPLACED. WE LIVE IN BIRMINGHAM, ALABAMA, AND THERE IS NO SAAB OSC IN OUR STATE. I CONTACTED SAAB, AND WAS TOLD WE CAN ONLY TAKE THE CAR TO A SAAB OSC \"AS THEY ARE THE ONLY ONES THAT HAVE ACCESS TO THIS PART AND CAN INSTALL, THEN COVER THE REPAIR AND THEN CLOSE OUT THE RECALL.\" THE NEAREST SAAB OSCS ARE IN CHATTANOOGA, TN (ABOUT 150 MILES AWAY) AND MARIETTA, GA (ABOUT 159 MILES). BEING FORCED TO DRIVE THIS DISTANCE, ESPECIALLY WITH AN UNSAFE SEATBELT, SEEMS LIKE AN ONEROUS BURDEN THAT SHOULD NOT BE PLACED ON THE OWNER. DO I HAVE ANY RIGHTS TO BE ABLE TO HAVE THE REPAIR DONE WITHIN A REASONABLE DISTANCE OF MY HOME?",
        "vin": "YS3FB79Y686"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LOST TOTAL COMPRESSION DUE TO WHAT THE MECHANIC SAID WAS A WELL-DOCUMENTED CASE OF INTAKE VALVE FAILURE, HAPPENED IN NORTHERN CALIFORNIA.  THE ENGINE CUT OUT WHILE I WAS IN TRAFFIC ON THE FREEWAY, THE CAR STOPPED, AND THE CAR WAS GRAZED FROM BEHIND.  NOT MUCH OF A PROBLEM DUE TO DAMAGE, JUST A QUICK RE-PAINT OF THE BACK BUMPER, AND PAID OUT OF POCKET.  THE ENGINE WAS GONE.  THE SAAB SPECIALIST TOLD ME THAT SO MANY 9-3'S,ESPECIALLY ON THE EAST COAST, HAVE EXPERIENCED TOTAL INTAKE VALVE FAILURE LIKE MINE.  I CONTACTED SAAB AND THEY ESSENTIALLY SAID TO GO SCREW MYSELF.  SAAB AND A SUBSEQUENT CALL TO GM CLAIMED THEY HAD \"NEVER HEARD OF THE ISSUE\" WHICH MY MECHANIC SPECIALIST SAID WAS A \"BOLD LIE\" BECAUSE THERE'S AN ONLINE HISTORY OF THIS THAT I FOUND, AND THEY DENIED ME ANY HELP IN GETTING IT FIXED.  SINCE THE CAR WAS WORTH MORE THAN THE $2,900 COST I HAD TO PAY TO HAVE THE ENGINE REBUILT, WITH THE SAME FAULTY VALVES THAT WILL CAUSE SOMEONE ELSE TROUBLE LATER AS I TRADED IN MY CAR, I DECIDED TO REPAIR IT, AND THEN GET $1,200 MORE OUT OF IT ONCE I TRADED IN MY CAR.  YOU NEED TO INVESTIGATE THIS.  IT IS NOT FAIR TO OWNERS WHO ARE OUT OF POCKET.  THERE WAS A SAFETY CONCERN WITH MY INCIDENT.  IF THE CAR BEHIND ME HAD NOT BEEN AWARE ONCE THE FREEWAY STARTED MOVING AGAIN, I COULD HAVE BEEN HURT.  SAAB AND GM DENY THIS, YET SEARCH GOOGLE---\"INTAKE VALVE PROBLEMS SAAB 9-3\" AND YOU'LL SEE FOR YOURSELF.  MAKE GM PAY FOR THIS.  PEOPLE HAVE LOST A TON OF MONEY ON DEPRECIATION ALONE, AND NOW THE ENGINES FAIL, ALMOST ALL OF THEM,ACCORDING TO THE SHOP WHO FIXED MY CAR AND TO WHAT I'VE READ ONLINE.  PLEASE ISSUE A RECALL.  SAAB AND GM WERE BOTH ESPECIALLY ARROGANT TO ME.  THEY SHOULD PAY FOR THIS PROBLEM, AND REIMBURSE ME WHAT I WAS OUT EVEN THOUGH I SOLD MY CAR.  I HAVE THE RECEIPTS IF YOU NEED THEM.  THANK YOU FOR LISTENING! PLEASE EMAIL ONLY.  *TR",
        "vin": "YS3FB49Y881"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE SAME ISSUE THAT OTHERS HAVE TALKED ABOUT. GM PUT CHEAP VALVES IN ENGINE--THEY HAVE NOW FAILED FOR A NUMBER OF US.  COLD STARTING, ROUGH IDLE, SMELL OF GAS, ULTIMATELY WILL NOT START.  EXPENSIVE REPAIR ON CAR WITHOUT MUCH MILEAGE  60K  REPAIR IS 2500-3000   GM SHOULD FIX THESE FOR FREE OR REDUCED COST.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V318000 (SEAT BELT) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 09/18/15*LJ  UPDATED 09/22/15*JB",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A BRITTLE BREAKING SOUND AND ASSUMED IT WAS MY FRONT BRAKES.  HAD NEW BRAKES PUT ON THE CAR BUT STILL HAD RUBBING AND ROTATIONAL TICKING SOUNDS COMING FROM THE FRONT WHEELS.   TOOK IT TO THE DEALER WHERE I BOUGHT THE CAR NEW AND THEY TOLD ME THE FRONT COIL SPRINGS WERE BOTH BROKEN AND NEEDED REPLACED WITH THE MANUFACTURERS RECOMMENDED REPAIR WHICH WAS AUTHORIZED FOR 2003-2006 MODEL YEAR 9-3 SAAB.  AND THAT MY 2008 SAAB (CURRENT VEHICLE) WAS NOT COVERED UNDER THIS DEFECT REPAIR ORDER FROM GM.  THIS INCIDENTALLY NOW HAS HAPPENED ON BOTH OF MY LAST TWO SAABS, THE 2004 9-3 I HAD BEFORE THIS CURRENT 2008 9-3 MODEL SAAB.  I AM AMAZED THAT THIS ISSUE HAS CONTINUED TO OCCUR AND NOT BE COVERED BY ANY RECALL BEYOND THE 2006 MODEL YEAR AS DESCRIBED TO ME.  ADDITIONALLY IT IS EXTREMELY COINCIDENTAL THAT THESE LAST TWO SAAB I'VE OWNED HAVE HAD THE SAME PROBLEM BUT NOW I HAVE TO BEAR THE BURDEN OF THE OVER $600 REPAIR AND PARTS FOR THIS CURRENT VEHICLE WHEN THE 2004 MODEL WAS COVERED.",
        "vin": "YS3FM52R481"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2015",
        "dateOfIncident": "05/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT START ON COLD DAYS. FOUND CYLINDERS 1 AND OR WITH LOW COMPRESSION.INTAKE VALVES NEED REPLACEMENT.",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2015",
        "dateOfIncident": "11/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I FIRST NOTICED A DIFFERENCE IN HOW MY CAR WORKED ABOUT A YEAR AND A HALF AGO.  I PURCHASED IT CERTIFIED PRE-OWED FROM A CERTIFIED SAAB DEALER AT THE TIME.  WHEN I FIRST NOTICED THE \"COLD-STARTS\" I THOUGHT IT WAS JUST NORMAL WEAR AND TEAR AND MAYBE NEEDED AN OIL CHANGE.  I ALWAYS USE PREMIUM GASOLINE AND GET THE VEHICLE SERVICED REGULARLY BY THE DEALER.  WHEN I TOOK IT TO THE DEALER IN THE BEGINNING OF 2014, THE TECHNICIAN SAID HE'S FAMILIAR WITH THE PROBLEM THAT I WAS HAVING.  HE SAYS THE ISSUE IS WITH THE COMPRESSION VALVE.  HE TOLD ME THAT I WAS \"UNLUCKY\" THAT I PURCHASED THIS CAR BECAUSE SAAB MANUFACTURED 2007-2009 9-3 MODEL ENGINES WHERE THE VALVES WERE MADE OF WEAKER METALS THAT WHEN SURROUNDING METALS.  AS THE EDGES OF THE VALVES IMPACT THE ENGINE WALLS, THEIR ORIGINAL CONVEX DESIGNED BECAME CONCAVE, THUS CAUSING A LOSS IN PRESSURE AND COMBUSTION.  (I'M NOT AN ENGINE SAVVY GUY, SO PLEASE EXCUSE MY LACT OF TERMINOLOGY).  SO, HE QUOTED ME ABOUT $3,000 FOR A VALVE REPLACEMENT.  THAT'S REDICULOUSNESS! HOW CAN GM PRODUCE A VEHICLE WHOSE VALVES WILL DETERIORATE AFTER NORMAL WEAR AND TEAR?  THIS HAS LED TO NOT ONLY COLD STARTS BUT ALSO DECREASED RESPONSIVENESS ON THE HIGHWAY.  SOMETIMES WHEN DRIVING, I WOULD APPLY THE ACCELERATOR AND MY CAR SHAKES FOR A FEW SECONDS.  WHEN GIVING A RIDE TO OTHERS THEY LOOK AT ME LIKE, \"THAT'S NOT SUPPOSED TO HAPPEN.\"  MY CAR HASN'T STALLED OR SHUT OFF WHILE DRIVING, BUT I'M GUESSING IF I DON'T GET THIS FIXED SOON IT MAY HAPPEN.  THERE IS A SAFETY ISSUE THAT I'M SURE GM IS AWARE OF; ACCORDINGLY, THERE NEEDS TO BE A RECALL TO GET THIS ISSUE RESOLVED.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2015",
        "dateOfIncident": "10/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 70,000 MILES THE CAR BEGAN TO START ROUGH ON COLD MORNINGS THIS CONTINUED ON UNTIL THIS YEAR  2014-2015 IT WOULD BARELY START ON ALL ON A COLD MORNING, AFTER LESS THEN A MINUTE OF RUNNING IT WOULD BE SMOOTH WITH NO APPARENT LOSE OF POWER. ALL PLUGS AND PLUG IGNITION COILS WE REPLACED WITH NO EFFECT.  FINALLY I DID A WEB SEARCH AND FOUND OUT A NUMBER OF 9-3 SAAB'S 2006-2008 HAD BAD METAL IN SOME OF VALVES   CAUSING THEM TO WEAR PAPER THIN.ONCE THE ENGINE WAS WARM THE METAL EXPANDED GIVING NORMAL  COMPRESSION. A COMPRESSION CHECK ON MINE  CAME BACK CYCL 1,3,4 50LBS  CYCL 2 200LBS. THIS STARTING PROBLEM WAS FIRST NOTICED AT 70,000 I GOT THE MOTOR FIXED AT 92,000 MILES.    OF COURSE THE FIX WAS A VALVE JOB AND A COST TO ME OF $2088.02.  I FEEL SAAB (GM) SHOULD SHARE A LARGE PORTION  OF THIS COST. THIS PROBLEM WAS VERY WELL DOCUMENTED ON ALL THE SAAB FORUMS.  I HOPE ANYONE READING THIS  AND HAS THE SAME PROBLEM PLEASE FILE A COMPLAINT  THIS IS NOT RIGHT.  *TR",
        "vin": "YS3FB59Y181"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SAAB 93 2.0T HAS INTAKE VALVE FAILURES. IN THE MORNING IT IDLES ROUGH UNTIL IT WARMS UP; THIS HAS BEEN VERIFIED BY A SAAB SPECIALIST. MY ENGINE IS NOT MOLDED OR ALTERED IN ANYWAY OTHER THAN THE CONSUMABLES OVER TIME (BELTS AND SUCH). A QUICK CHECK FOR 2008 SAAB VALVE PROBLEM LEADS TO FORUMS CHALK FULL OF OTHER OWNERS WITH THE SAME ISSUE. GM SHOULD FOOT THE BILL FOR THIS $2500+ REBUILD OF THE ENGINE THAT THEY POORLY MANUFACTURED IN THE FIRST PLACE.  *TR",
        "vin": "YS3FB79Y686"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "03/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I  RECEIVED  THE  RECALL   NOTICE  FOR  THE  SEATBELT  TENSIONER   FOR  THE  DRIVERS  SIDE   OVER  7  MONTHS  AGO   BUT  TO THIS  DAY  NO ONE  HAS  OR  IS  MAKING  THE  PART.       WHO   WILL  BE  RESPONSIBLE  IF  SOMETHING  OCCURS  ?   I  HAVE  CHECKED  WITH  MY  DEALER  REGULARLY  AND  STILL   NO  PART  AVAILABLE     IT  IS  ALSO  MADE  BY  THE  TAKATA  COMPANY.        THE  AIRBAG  PROBLEM  PEOPLE.    *TR",
        "vin": "YS3FH71U986"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 2007-2011 SAAB 9-39-3 THERE IS A COMMON ISSUE WITH THE INTAKE VALVE SEALS GOING BAD CAUSING A ROUGH IDLE AND/OR MISFIRE ON COLD STARTS. MINE EXHIBITS THIS BEHAVIOR BUT IS NOT STILL UNDER WARRANTY. THIS IS NOT JUST WEAR AND TEAR IT IS A BAD PART OR BAD DESIGN THAT IS BASICALLY DESIGNED TO FAIL. TO FIX THIS IT COSTS $1500+ AND GM SHOULD BE RESPONSIBLE FOR A FLAW IN THE VEHICLE REGARDLESS OF THE 5 YEAR/100,000 MILE WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE FAILED TO ACCELERATE WITHOUT WARNING. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE INTAKE VALVE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "01/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683665,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ON.. SHOP FOUND MULTIPLE ENGINE MISFIRES.. CHECKED ENGINE COMPRESSION.. COMPRESSION BELOW MANUFACTURERS SPECS.. NEEDED COMPLETE VALVE JOB PER SAAB RECOMMENDATION.. PARTS SENT TO MACHINE SHOP FOR REPAIRS AND RE-CONDITION.. RE-INSTALL OF CYLINDER HEAD ASSEMBLY WITH NEW HEAD GASKET AND ALL OTHER NEEDED GASKET AND SEALS.. FLUSHED AND REFILLED ALL ENGINE TRANSMISSION FLUIDS.. COMPLETE VALVE JOB WITH INTAKE AND EXHAUST VALVES.. DEFECTIVE VALVE IS REPORTED ISSUE ON SAAB 9-3 2008..  *TR",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2008 SAAB 9-3 IN 3/2011 WITH 34,000 MILES.  AS OF 2/2015 THE VEHICLE HAS 104,000 MILES.  LAST MONTH THE VEHICLE BARELY STARTED AFTER SITTING OVERNIGHT AND WOULD TAKE SEVERAL MINUTES TO REACH A NORMAL IDLE.  IT WOULD THEN START THE REST OF THE DAY, SOMETIMES AFTER A \"HARD\" START.  THE CHECK ENGINE LIGHT CAME ON AND THE MECHANIC SAID THE CODE READ AS A \"CYLINDER MISFIRE\" CODE.  8 DAYS AGO THE CAR WOULD NOT START AND IS NOW SITTING IN MY DRIVEWAY.  I CALLED A SAAB SPECIALIST ABOUT 2 HOURS AWAY FROM ME WHO KNEW EXACTLY WHAT THE PROBLEM WAS.  HE EXPLAINED THE INTAKE VALVE PROBLEM THAT A LOT OF SAAB OWNERS ARE EXPERIENCING DUE TO DEFECTIVE MATERIALS USED BY GM AND/OR SUPPLIERS.  HE SAID THE COST WILL BE AT LEAST $2,200 BUT COULD EASILY BE MORE DEPENDING ON THE SEVERITY.  THIS IS A KNOWN DEFECT (A SERVICE BULLETIN HAS BEEN ISSUED DETAILING THIS ISSUE) THAT SHOULD BE SUBJECT TO A RECALL.   WE CANNOT AFFORD TO FIX AN ENGINE THAT DOES NOT WORK DUE TO SUBSTANDARD VALVES.  THIS IS NOT A NORMAL \"WEAR AND TEAR\" ISSUE, BUT AN ISSUE DEALING WITH PARTS THAT WERE DOOMED FROM THE BEGINNING.    *TR",
        "vin": "YS3FB49Y881"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/12/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. WHILE DRIVING APPROXIMATELY 35 MPH, THE HOOD INADVERTENTLY UNLATCHED AND FLEW UP. THE CONTACT MERGED THE VEHICLE OVER AND MANAGED TO TUCK THE STRUT IN AND FORCE THE PRIMARY LATCH TO SECURE THE HOOD. AN INDEPENDENT MECHANIC STATED THAT THE SECONDARY HOOD LATCH STRIKER FAILED DUE TO CORROSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "YS3FB79Y186"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT WHILE DRIVING AT 60-70 MPH, THE CRUISE CONTROL ACTIVATED INDEPENDENTLY. THE CONTACT MENTIONED THAT THE BRAKE PEDAL WAS APPLIED TO DEACTIVATE THE CRUISE CONTROL. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "02/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT CAME ON WHILE TRAVELING ACROSS THE STATE OF TN AND I NOTICED THAT MY VEHICLE BEGAN STALLING WHEN I ACCELERATED QUICKLY.  I IMMEDIATELY TOOK MY VEHICLE TO GET CHECKED OUT AND WAS TOLD THAT THE CODE YIELDED \"LEAN AT IDLE\".  THE MECHANIC ADJUSTED A VACUUM HOSE AND SAID I WAS GOOD TO GO...I PULLED OUT OF THE PARKING LOT AND NOTICED MY GAS GAUGE SHOWED LESS THAN 35 MILES BUT NO GAS LIGHT INDICATOR WAS LIT.  I TRIED TO TEST MY CAR BY QUICKLY ACCELERATING AND MY CHECK ENGINE LIGHT CAME BACK ON.  I TOOK IT RIGHT BACK TO THE MECHANIC AND THEY REPLACED THE VACUUM HOSE.  WHEN I LEFT THE MECHANIC ON 8FEB2015, I FILLED UP MY GAS TANK BUT NOTICED MY GAUGE ONLY SHOWED HALF FULL.  I DROVE IT 1 MILE AND PARKED IT FOR THE EVENING.  THIS MORNING I STARTED THE VEHICLE BACK UP AND NOTICED THAT THERE WAS A LITTLE HESITANCY AND KICKBACK WHEN ACCELERATING...I DROVE BACK HOME 225 MILES AND LESS THAN 20 MILES FROM HOME MY ENGINE LIGHT COMES BACK ON.  THE CODE IS NOW INDICATING A FUEL PRESSURE REGULATOR ISSUE...HENCE THE REASON FOR THE STALLING HESITANCY AND THE INCORRECT FUEL GAUGE/INDICATOR LIGHT.  UPON RESEARCHING ONLINE, THERE IS NOT A NOTED RECALL FOR THE FUEL PUMP ON MY CAR, BUT I DID NOTICE A SPECIAL BULLETIN GM FAILED FUEL SYSTEM PROGRAM...LISTED BELOW:SERVICE BULLETIN NUMBER:   SB-10054  REPLACEMENT SERVICE BULLETIN NUMBER:   SB-10054D  NHTSA ID #:   10041526  BULLETIN DATE:   THU, 09/01/2011  FAILING COMPONENT(S):   091200 FUEL SYSTEM, OTHER:STORAGE:FUEL GAUGE SYSTEM  WHY IS MY CAR NOT SHOWING AS COVERED WHEN THE CLASSIC PREMATURE SYSTEM FAILURE IS OCCURRING AT ONLY 82K MILES WHEREAS I RUN THE RISK OF MY FUEL PUMP COMPLETELY FAILING AND COULD LEAD TO A CAR FIRE IF I WAS UNKNOWLEDGEABLE ON THE SUBJECT MATTER????  PLEASE ASSIST WITH EXPLAINING HOW MY CAR IS NOT SHOWING UP AS COVERED VIA THE VIN INFORMATION SYSTEM WITH NHTSA.  *TR",
        "vin": "YS3FH71U486"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "01/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING MY VEHICLE IT HAD A ROUGH IDLE, I WENT AHEAD AND PUT IT IN GEAR AND BEGAN TO LEAVE MY GARAGE, THEN MY CHECK ENGINE LIGHT STARTED BLINKING AND THERE WAS A BURNING SMELL. I THEN PUT IT BACK IN PARK AND GOT MY HUSBAND TO CHECK IT OUT WHEN HE OPENED THE HOOD SMOKE WAS COMING FROM THE FIRST CYLINDER ON THE ENGINE. HE QUICKLY UNHOOKED THE BATTERY AND REMOVED THE OEM BOSCH COIL PACK WITH GLOVES ON BECAUSE IT WAS EXTREMELY HOT (TOOK OVER AN HOUR TO COOL DOWN AFTER REMOVED FROM THE CAR), SO HOT THAT THE COIL PACK CAME APART, HAD SPLIT OPEN AND MELTED. I HAVE PICTURES AND KEPT THE PACK FOR EVIDENCE. I DO BELIEVE HAD HE NOT GOT THE PACK OUT IT COULD HAVE VERY QUICKLY BEEN AN ELECTRICAL/ENGINE FIRE. PART NUMBER FROM COIL PACK #12613057.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPRESSION IN CYLINDER ONE IS NOT FIRING AT A FULL PSI PER MFG STANDARDS. IT'S CAUSING A COLD START ISSUE AND THE CAR BARELY TURNS OVER TO START WHEN IT'S NOT WARMED UP.  *JS",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "12/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DOESN'T START DUE TO LOW COMPRESSION ON COLD DAYS. CAR WILL LEAVE YOU STRANDED IN EXTREME TEMPS.   *TR",
        "vin": "YS3FB76Y386"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SPRINGS WERE CORRODED AND BOTH SNAPPED EFFECTING HANDLING.  *TR",
        "vin": "YS3FB46Y881"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661960,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME AS PROBLEM BELOW:  SINCE I NEED THE CAR BADLY, I'VE INSTRUCTED MY MECHANIC TO START WORKING ON THE FIX.    OVER TIME THE VALVES IN THE 2.0T ENGINE WILL WEAR CAUSING DRAMATIC LOSS IN COMPRESSION. PROBLEM STARTS WITH ROUGH IDLING AND TROUBLE TURNING OVER AT COLD START BUT ESCALATES TO A POINT WHERE THE CAR WILL NOT START WHAT SO EVER. IT APPEARS THAT WHEN MANUFACTURING THE ENGINE GM PUT VALVES MADE OF A SOFTER THAN USUAL METAL. THESE VALVES GET ESSENTIALLY HAMMERED AGAINST THE CYLINDER HEAD TO A POINT WHERE THE EDGES BECOME SO THIN THEY ARE RAZOR SHARP. A SERVICE BULLETIN WAS SENT OUT TO DEALERS FROM SPNA (SAAB PARTS NORTH AMERICA), WHICH MEANS THAT GM IS WELL AWARE OF THIS ISSUE. A SAAB MECHANIC WARNED ME THAT THE PROBLEM COULD GET WORSE AT ANY TIME REGARDLESS OF MILEAGE AND THAT SOONER OF LATER MY CAR WOULD NOT START. TO FIX THIS ISSUE ALL 16 VALVES WOULD NEED TO BE REPLACED. THIS INVOLVES SERIOUS TIME AND EFFORT AND I WAS QUOTED A PRICE OF UP TO $3,000 FOR A REPAIR. PLEASE BE ADVISED THAT THIS PROBLEM EFFECTS EVERY SAAB 9-3 WITH THE 2.0T FROM 2007 TO 2011. GM SHOULD BE HELD ACCOUNTABLE FOR THESE FAULTY PARTS AND ISSUE A RECALL.   *JS",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/26/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT THE DRIVERS SEATBELT FAILED TO RETRACT. THE CONTACT WAS ABLE TO SECURE THE SEATBELT BUT THE FAILURE WAS GETTING PROGRESSIVELY WORSE. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER: 14V318000 (SEATBELTS) AND STATED THAT THE PARTS NEEDED WERE NOT AVAILABLE FOR SEVERAL MONTHS. THE DEALER WAS UNABLE TO PROVIDE A SPECIFIC DATE WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIRS. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "YS3FB79Y686"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND YEAR IN A ROW, WITH TEMPERATURE IN THE TEENS, THE CAR WILL NOT START DUE TO BAD INTAKE VALVES.  AS NOTED BY MANY CONSUMERS ON SEVERAL SAAB FORUMS, THIS ENGINE LOSES SIGNIFICANT COMPRESSION IN THE CYLINDERS CAUSING DIFFICULT STARTING, A VERY ROUGH IDLE AND ULTIMATELY RESULTING IN A VALVE JOB.   *TR",
        "vin": "YS3FB49Y081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE REFUSED TO START IN COLD WEATHER. SAAB TECHNICIAN CONFIRMED AN ISSUE WITH INTAKE VALVES BEING DEFECTIVE.  THE INTAKE VALVES WOULD NOT SEAL CAUSE COMPRESSION TO GET AS LOW AS 40 PSI CAUSING NO START CONDITION.  SAAB REFUSED TO COVER IT UNDER WARRANTY ON THE 61ST MONTH OF OWNERSHIP VEHICLE CAME WITH 60 MONTH ENGINE WARRANTY AND THE COST OF REPAIR OUT OF POCKET WAS OVER $2500.  THERE WERE DAYS THE CAR WOULDN'T START AWAY FROM HOME AFTER SITTING JUST ONE DAY, LEAVING ME STRANDED IN EXTREME COLD WEATHER WITH NO HEAT.  GM AND SAAB KNOW ABOUT THIS ISSUE AS THEY GOT POOR QUALITY INTAKE VALVES FROM A SUPPLIER.  GM HAS NOT YET CAMPAIGNED/RECALLED THESE VEHICLE, AS YOU KNOW GM CULTURE LACKS ETHICS AND HAVE COVERED UP DEATHS IN THE PAST TO SAVE MONEY.  AS A GOVERNMENT AGENCY YOUR RESPONSIBILITY IS TO PROTECT CONSUMERS AND BE PROACTIVE AND NOT ACT AFTER SOMETHING HORRIBLE HAS HAPPENED.  THERE ARE MORE THEN ENOUGH COMPLAINTS ON THIS WEBSITE FOR THIS ISSUE.  ARE YOU WAITING FOR A DEATH TO OCCUR BEFORE ANYTHING IS DONE ?  GM NEW OR OLD SHOULD BE HELD ACCOUNTABLE FOR THIS ISSUE.  ITS A GM ECOTEC ENGINE, CAR WAS PRODUCED ON A GM PLATFORM. PROFITS FROM THE VEHICLE ALSO WENT TO GM.     THIS ISSUE ALSO CAUSES AN INCREASE IN EMISSIONS. AS THERE IS LOSS OF COMPRESSION, CYLINDER MISFIRE OR HAS INCOMPLETE COMBUSTION CAUSING AN INCREASE IN HYDROCARBONS AND CARBON MONOXIDE IN THE TAIL PIPE.  *TR",
        "vin": "YS3FB46Y881"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE P0008 ENGINE CODE OCCURRED, CAR WAS TAKEN TO AN INDEPENDENT MECHANIC, MECHANIC STATED ENGINE CODE WAS INDICATED BY CAMSHAFT SENSOR, AND COULD POSSIBLY BE A WORN TIMING CHAIN. THIS IS A COMMON ISSUE ON GM 2.8 AND 3.6 ENGINES AND GM HAS ISSUED A TSB TO EXTEND THE WARRANTY FOR THE TIMING CHAIN TO 120K MILES OR TEN YEARS. THIS TSB DID NOT INCLUDE THE TIMING CHAIN FOR THE 2.8 LITER ENGINE IN THE SAAB.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER-SIDE TAILLIGHT BULBS HAVE BECOME SO DIM THAT THEY ARE VISIBLE ONLY UPON VERY CLOSE INSPECTION. THE TAILLIGHT BULBS ALSO SERVE AS THE BRAKE LIGHTS, EMITTING A BRIGHTER LIGHT WHEN THE BRAKE IS DEPRESSED. BECAUSE OF THIS MALFUNCTION, FOLLOWING CARS MAY NOT HAVE SUFFICIENT VISUAL NOTICE THAT THE CAR IN FRONT OF THEM IS BRAKING, RESULTING IN A TRAFFIC COLLISION.    I UNDERSTAND THAT THIS IS A RELATIVELY COMMON PROBLEM AND WAS ABLE TO HAVE THE CONNECTOR FOR THE MALFUNCTIONING TAILLIGHT REPLACED. THIS WAS AN EXERCISE IN FUTILITY AS, ALMOST IMMEDIATELY, THE TAILLIGHT BECAME AS DIM AS IT HAD BEEN PRIOR TO THE CONNECTOR REPLACEMENT.    THIS ISSUE, WHICH EVIDENTLY CANNOT BE EASILY REMEDIED, CREATES A HAZARD TO VEHICLE OCCUPANTS, AND THOSE IN CARS FOLLOWING THE AFFECTED VEHICLE.  *TR",
        "vin": "YS3FB46Y481"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606072,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT BRAKE FAILURE AT START.  DEPRESS BRAKES, EITHER FROM DRIVEWAY IN REVERSE OR STARTING FORWARD AFTER LEAVING DRIVEWAY, AND BRAKES DO NOT WORK.  DEPRESSING BRAKES FEELS LIKE POWER BRAKING SYSTEM IS NOT ENGAGING.  HAVE TO PULL OVER TO SIDE OF ROAD, AND AFTER A FEW MINUTES, BRAKES RETURN.  THIS HAS HAPPENED PERIODICALLY OVER THE PERIOD SINCE I BOUGHT THE CAR NEW, DECEMBER 2009.  THE CONSUMER EXPERIENCED AN INTERMITTENT BRAKE ISSUE THAT WAS EVIDENT FROM THE FIRST YEAR OF OWNERSHIP. UPON STARTING THE VEHICLE IN THE MORNING, THERE WAS BRAKE FAILURE UNTIL THE VEHICLE WARMED UP SUFFICIENTLY FOR THE PROBLEM TO BE RESOLVED. HE WOULD GENERALLY CATCH THE PROBLEM BEFORE EXITING HIS DRIVEWAY, BUT THERE WERE TIMES THE PROBLEM PERSISTED UPON SHIFTING INTO FORWARD GEAR. THE CONSUMER HAD THE VACUUM PIPE REPLACED.  THE CONSUMER REFERENCED NHTSA ACTION NUMBER PE08005, IN WHICH HE BELIEVED WAS CLOSED PREMATURELY. UPDATED 08/27/14",
        "vin": "YS3FM57R381"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "12/20/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT WENT ON BEGINNING OF WINTER 2011, AND CODE INDICATED FAILED FUEL PUMP.  GM (THIS IS A GM CAR) AND SAAB INDICATED FAULTY PART, AND CONTINUED TO INDICATE BACK ORDER OF PART, AND THEN METHOD TO REBUILD AVAILABLE FUEL PUMP, WHICH APPARENTLY IS ALSO ON BACK ORDER.  ENGINE LIGHT GOES OFF AFTER SEVERAL MONTHS, BUT REAPPEARS THE NEXT YEAR, AND HAS OCCURRED EACH YEAR SINCE.  PART WAS COVERED UNDER WARRANTY AT TIME OF COMPLAINT, BUT IS NOW OFF OF WARRANTY.  SAAB NORTH AMERICA HAS INDICATED IN RESPONSE TO COMPLAINT THAT REPLACEMENT PART PLUS REBUILD WOULD WORK, BUT THE PART HAS NEVER BEEN AVAILABLE FOR REBUILDING, AND SAAB DEALERSHIP (KEN GAARF) CLAIMS IT HAS BEEN ON BACK ORDER FOR CLOSE TO 3 YEARS.  CAR BOUGHT NEW IN DECEMBER 2009 WITH 3 YEAR GM FULL WARRANTY IN PLACE.  *TR",
        "vin": "YS3FM57R381"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2014",
        "dateOfIncident": "12/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILS TO START WHEN COLD AND WHEN IT DOES, THE CAR RUNS EXTREMELY ROUGH. CAR HESITATES AND DRIVES POORLY UNTIL ENGINE IS FINALLY WARM. COLD COMPRESSION TEST CONFIRMS THAT THERE IS LOW COMPRESSION AND THAT THERE ARE DEFECTIVE INTAKE VALVES. THIS IS A SERIOUS PROBLEM FOR A VEHICLE THAT IS NOT OLD AT ALL.   *TR",
        "vin": "YS3FB49Y481"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3.  THE CONTACT STATED THAT THE SEAT BELT RETRACTORS FOR THE DRIVER AND FRONT PASSENGER SEATS STOPPED WORKING. THE CONTACT WAS ABLE TO SECURE THE SEAT BELT INTO THE LATCH; HOWEVER, WHEN THE BRAKES WERE APPLIED THE PASSENGER AND DRIVER MOVED FORWARD BECAUSE THE SEAT BELT FAILED TO SECURE THEM.   NONE OF THE WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL.   THE MANUFACTURER WAS NOTIFIED AND DID NOT OFFER A REMEDY. A LOCAL MECHANIC DIAGNOSED THE FAILURE AND CONFIRMED THAT THE SEAT BELT RETRACTOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED.    THE FAILURE MILEAGE WAS 70,000. THE CURRENT MILEAGE WAS 70,100.  UPDATED 08/27/14*LJ      THE CONSUMER STATED THE SEAT BELTS WERE BOTH REPLACED WITH NO ASSISTANCE OFFERED FROM THE MANUFACTURER. UPDATED 9/5/2014   *JS",
        "vin": "YS3F846U581"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COLD START PROBLEM CAUSED BY LOW COMPRESSION / DEFECTIVE VALVES WHEN COLD.  RUNS FINE AFTER IT WARMS UP.  GETTING WORSE OVER TIME.  *TR",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER SIDE SPRING BROKE WHILE DRIVING.  LOUD BANG AND SUDDEN DROP IN RIDE HEIGHT.  SOME LOSS OF STEERING CONTROL.  THIS IS A RECALLED ISSUE UP TO 2006, IT SHOULD BE EXTENDED TO COVER 2008 MODELS.  THIS IS A SERIOUS SAFETY RISK. *TR",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598072,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "READ OVER THE POSTED PROBLEMS WITH SAAB 9-3.  THREE MAIN ISSUES ARE FRONT COILS, FUEL GAUGE, AND FAULTY VALVES.  I HAVE HAD ALL THREE OF THESE ISSUES.  COILS REPLACED 18 MONTHS AGO  (GM WOULD NOT PAY).  GAS GAUGE DOES NOT WORK (GM WON'T PAY).  JUST HAD THE ENGINE REBUILT TO FIX THE EXHAUST VALVE PROBLEM (OUT OF LUCK AGAIN).  OBAMA WAIVED GM OF THEIR HISTORY OF FAULTS (HE NEEDED THE VOTES FOR RE-ELECTION) AND NOW CONSUMERS ARE STUCK.  SAAB WAS A QUALITY PRODUCT BEFORE GM GOT A HOLD OF IT.    *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER TIME THE VALVES IN THE 2.0T ENGINE WILL WEAR CAUSING DRAMATIC LOSS IN COMPRESSION. PROBLEM STARTS WITH ROUGH IDLING AND TROUBLE TURNING OVER AT COLD START BUT ESCALATES TO A POINT WHERE THE CAR WILL NOT START WHAT SO EVER. IT APPEARS THAT WHEN MANUFACTURING THE ENGINE GM PUT VALVES MADE OF A SOFTER THAN USUAL METAL. THESE VALVES GET ESSENTIALLY HAMMERED AGAINST THE CYLINDER HEAD TO A POINT WHERE THE EDGES BECOME SO THIN THEY ARE RAZOR SHARP. A SERVICE BULLETIN WAS SENT OUT TO DEALERS FROM SPNA (SAAB PARTS NORTH AMERICA), WHICH MEANS THAT GM IS WELL AWARE OF THIS ISSUE. A SAAB MECHANIC WARNED ME THAT THE PROBLEM COULD GET WORSE AT ANY TIME REGARDLESS OF MILEAGE AND THAT SOONER OF LATER MY CAR WOULD NOT START. TO FIX THIS ISSUE ALL 16 VALVES WOULD NEED TO BE REPLACED. THIS INVOLVES SERIOUS TIME AND EFFORT AND I WAS QUOTED A PRICE OF UP TO $3,000 FOR A REPAIR. PLEASE BE ADVISED THAT THIS PROBLEM EFFECTS EVERY SAAB 9-3 WITH THE 2.0T FROM 2007 TO 2011. GM SHOULD BE HELD ACCOUNTABLE FOR THESE FAULTY PARTS AND ISSUE A RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE'S CAR IS A 2008 SAAB 93 SEDAN.  IT HAD APPROXIMATELY 48,000 MILES ON IT WHEN THE ENGINE CONTROL MODULE FAILED AT HIGHWAY SPEED.  THIS CAUSED LOSS OF POWER-BRAKES, POWER-STEERING AND ABILITY TO CONTINUE DRIVING.  FORTUNATELY, WE WERE ABLE TO COAST OVER TO THE SIDE OF THE ROAD.  THE ENGINE WOULD NOT RE-START.  WE WERE ABLE TO RESTART IT AFTER FIGURING OUT WHICH FUSE CONTROL THE \"ECM\" AND PULLING/RESETTING THE FUSE.  THE PROBLEM RE-APPEARED MULTIPLE TIMES ON APPROXIMATELY 100-MILE INTERVALS.  WE FINALLY HAD THE ECM REPLACED WITH A USED ONE BY AN INDEPENDENT MECHANIC.  THE LOCAL SAAB DEALER QUOTED ~$1000 FOR A NEW ECM.  THE USED UNIT COST ~$350 AND REQUIRED THE SHOP TO \"MARRY\" THE UNIT WITH THE CAR'S VIN.  THERE WAS NO WARRANTY ON THIS CAR AS SAAB WENT BANKRUPT.  THIS IS A SERIOUS SAFETY CONCERN.  FORTUNATELY I WAS DRIVING AND THE KIDS WERE NOT IN THE CAR.  *TR",
        "vin": "YS3FB49Y181"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586294,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURELY WORN INTAKE VALVES RESULTING IN LOW COMPRESSION AND EXCESSIVELY ROUGH RUNNING MOTOR.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/21/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S FRONT PASSENGER SIDE COIL SPRING HAS FRACTURED AS A RESULT OF POOR DESIGN.   *TR",
        "vin": "YS3FB46Y181"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566511,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM OF A COLD START ROUGH IDLE INITIALLY STARTED LAST YEAR AROUND FEBRUARY 2013. THE CHECK ENGINE LIGHT DID COME ON EVERY SO OFTEN AND WOULD EVENTUALLY RESET ITSELF. I HAD THE CODE CHECKED OUT, AND I WAS TOLD IT WAS MISFIRING OF THE SPARK PLUGS. I HAD THE SPARK PLUGS REPLACED, BUT UNFORTUNATELY THIS DID NOT SOLVE THE PROBLEM. I DID NOT HAVE THE CAR LOOKED AT AGAIN TILL THIS YEAR, FEBRUARY 2014, AS I WANTED TO MAKE SURE I DIDN'T HAVE BAD GAS, OR IT WASN'T CARBON BUILDUP IN THE ENGINE. AFTER INFORMING THE DEALER OF THE PROBLEM I WAS HAVING, THEY SUGGESTED I LEAVE IT OVERNIGHT SO THEY COULD TEST IT OUT THE NEXT MORNING. THAT MORNING THEY CALLED AND TOLD ME THE PROBLEM WAS WITH THE INTAKE VALVES GOING BAD. THEY ARE IN THE PROCESS OF ORDERING THE PARTS AND I WILL HAVE THE WORK COMPLETED IN MARCH 2014.    I HAVE CONTACTED SAAB PARTS NORTH AMERICA TO SEE IF THEY WOULD BE WILLING TO HELP IN ANYWAY SINCE MY CAR WAS JUST OUT OF WARRANTY, AND I WAS TOLD THEY WOULD NOT AND THAT GM PROBABLY WOULDN'T EITHER DUE TO THE BANKRUPTCY. I WILL BE ATTEMPTING TO CALL GM AND SEE IF THEY ARE WILLING TO HELP IN ANYWAY SINCE MY VEHICLE WAS MANUFACTURED WHILE SAAB WAS STILL OWNED BY GM. I HAVE ALSO FOUND OUT AT SAAB CENTRAL FORUMS THERE ARE NUMEROUS OWNERS OF THE 07-11 YEARS THAT ARE EXPERIENCING THE SAME PROBLEM AT ABOUT THE SAME MILEAGE. I HAVE ALSO LEARNED THERE IS A SPNA BULLETIN THAT HAS BEEN SENT TO DEALERS, SO THEY KNOW ABOUT THIS PROBLEM AND HAVE CHOSEN NOT TO STAND BEHIND THEIR PRODUCT BY ISSUING A RECALL.  *TR",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SAAB 9-3 2.0T HAD A SIMILAR ISSUE TO THE SAAB'S AFFECTED BY THE 2003-2006 WARRANTY EXTENSION FOR THE FRONT COIL SPRINGS. I AM IN A SALT BELT STATE, MASSACHUSETTS, AND MY FRONT COIL SPRINGS FAILED AT 64,500 MILES. IT WAS FOUND DURING A ROUTINE INSPECTION. CLEARLY THE DESIGN CHANGES MADE AFTER THE 03-06 ISSUE WERE NOT ENOUGH TO STOP THE FRONT COIL SPRING FRACTURES AND THE ENGINEERING ANALYSIS DONE WAS NOT ADEQUATE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M NOT CERTAIN IF THIS IS A SAFETY ISSUE BUT IT CERTAINLY QUALIFIES AS AN EMISSIONS ISSUE AND A MANUFACTURER'S DEFECT. ON EVERY COLD START, THE ENGINE WOULD RUN ROUGH UNTIL I PUT IT IN DRIVE AND WOULD RUN FINE AFTER A FEW MINUTES. I LET IT SIT AND IDLE FOR A WHILE ONCE AND THE CHECK ENGINE LIGHT CAME ON AS A RESULT. A LOCAL DEALERSHIP FOUND LOW COMPRESSION ACROSS 2 CYLINDERS AND INFORMED ME IT WAS THE DREADED VALVE ISSUE (INTAKE VALVE CUPPING THEY CALLED IT). THE DEALERSHIP HAD FIXED A NUMBER OF THESE AND FROM VARIOUS ONLINE FORUMS, I SEE THAT A NUMBER OF 2007 AND 2008 SAAB 9-3 OWNERS SEEM TO HAVE EXPERIENCED THE SAME PROBLEM. THE REPAIR CONSISTED OF REMOVING AND REPLACING ALL 8 INTAKE VALVES, HAND LAPPING THEM, REMOVING AND REPLACING ALL VALVE SEALS, AND REFINISHING THE HEAD MATING SURFACE. THE REPAIR WAS VERY EXPENSIVE, SEVERAL THOUSAND DOLLARS.  I'VE HAD THE CAR BACK FOR A COUPLE OF WEEKS AND THE PROBLEM IS GONE. I WAS TOLD THIS ISSUE SEEMS TO HAPPEN AROUND THIS AMOUNT OF MILEAGE AND IN COLD WEATHER STATES. OF COURSE MY WARRANTY HAD EXPIRED 6 MONTHS EARLIER AND I IMAGINE THIS IS THE CASE WITH MANY OTHER SAAB 9-3 OWNERS WITH '07 AND '08 VEHICLES. WITH THE NEW PARTS, I WAS TOLD I SHOULDN'T RUN INTO THIS PROBLEM AGAIN.   *TR",
        "vin": "YS3FB79Y586"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2014",
        "dateOfIncident": "11/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS VERY ROUGH START EVERY MORNING WHEN IT'S COLD. FROM SAAB FORUM (HTTP://WWW.SAABCENTRAL.COM/) THERE ARE NUMBERS OF PEOPLE THAT IS HAVING THE SAME ISSUE FOR NEWER SAAB 9-3'S. THE PROBLEM IS INTAKE VALVES OF ENGINE BECOMING REALLY THIN AND FAILING OVER TIME..  THE ENGINE SHAKES THE WHOLE CAR AND SOMETIME THE CAR DOESN'T EVEN WANT TO START..  I WOULDN'T BE SURPRISE IF ONE DAY I CANT START THE CAR..  *TR",
        "vin": "YS3FB46Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS EXHIBITING A HARD START AND MISFIRES FROM 90,000 AND UP. IT WAS MORE PRESENT IN COLD WEATHER. IT FINALLY FAILED TO TURN OVER IN -15 DEGREE WEATHER (-40 WIND CHILL), HAD I BEEN IN A REMOTE AREA THERE WOULD HAVE BEEN A VERY REAL DANGER OF HYPOTHERMIA AND FROSTBITE. AFTER SOME ONLINE INVESTIGATION I FOUND THAT NUMEROUS PEOPLE ARE EXPERIENCING THE SAME PROBLEM WITH ANY SAAB 9-3 2.0T (B207 ENGINE) OVER 75,000 MILES. THE PROBLEM IS RELATED TO BAD INTAKE VALVES THAT BECOME RAZOR SHARP AND CANNOT HOLD COMPRESSION ESPECIALLY IN COLDER CLIMATES.  *TR",
        "vin": "YS3FB49Y981"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NO START/COLD CLIMATE FOR 2008 SAAB 9-3 2.0T. TOWED TO SAAB DEALERSHIP AFTER COLD NO START YESTERDAY 01/07/2014. SAAB TECHNICIAN DIAGNOSIS(01/08/2014): INTAKE/INLET VALVES WORN CAUSING LOW ENGINE COMPRESSION, HENCE; FAILED START ATTEMPTS. ENGINE COMPRESSION AND LEAK DOWN TESTS PERFORMED TO PINPOINT EXACT PROBLEM.",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "11/26/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED  WHILE PARKED IN COLD TEMPERATURES THE VEHICLE WOULD NOT START. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "02/06/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558676,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLE AND LOW COMPRESSION WHEN COLD, SYMPTOM DID NOT APPEAR AFTER THE ENGINE IS WARM. INTAKE VALVES FAILED AND COST $1,700 TO REBUILD THE HEAD.  *TR",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2014",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED OUR 2008 SAAB 9-3 2.0 HAS BEEN STARTING AND IDLING ROUGH IN COULD WEATHER.  ONCE THE CAR WARMS UP TO OPERATING REGULAR OPERATING TEMPERATURE, THE CAR IDLES SMOOTHLY.  PERFORMED A COMPRESSION TEST ON THE COLD ENGINE AND FOUND LOW COMPRESSION ON TWO OF THE FOUR CYLINDERS.  APPARENTLY, THE INTAKE VALVES IN THE CYLINDER ON THIS MODEL ARE WEARING BADLY NOT SEATING CORRECTLY WHEN THE ENGINE IS COLD.  ONCE THE ENGINE WARMS UP AND EXPANDS, THE VALVES SEAT CORRECTLY AND ENGINES RUNS NORMALLY.  THIS IS A CATASTROPHIC ENGINE FAILURE AND GM SHOULD RECALL THESE CARS TO REPAIR ENGINE WITH THE PROPER VALVES.  I HAVE REQUESTED QUOTED FROM TWO INDEPENDENT SHOPS AND THEY WE $2100 AND $2300 RESPECTIVELY.  WE HAVEN'T BEEN ABLE TO START THE CAR IN A WEEK.  *TR",
        "vin": "YS3FB49Y181"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE FRONT COIL SPRING HAS BROKEN CAUSING IT TO BECOME DETACHED. AUTO REPAIR SHOP STATED THAT BOTH SPRINGS MUST BE REPLACED TO GIVE THE SUSPENSION SAFE STABILITY.  *TR",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2013",
        "dateOfIncident": "11/29/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE WOULD NOT TURN OVER WHEN TRYING TO START THE ENGINE FROM A COLD START.  IF THE TEMPERATURES WOULD LOWER CLOSE TO FREEZING THE CAR WILL JUST CRANK AND NEVER TURN OVER.  IF I WERE ABLE TO GET THE CAR STARTED, ONCE IT WARMED UP, IT RAN JUST FINE.  READING ONLINE, IT SEEMS TO BE A KNOWN ISSUE WITH THE 2007 & 2008 SAAB 9-3'S.  IT'S A FAULTY INTAKE VALVE AND BEGINS HAPPENING ANYWHERE BETWEEN 60,000 TO 80,000 MILES.  I BELIEVE SAAB SHOULD LOOK INTO THIS AS IT SEEMS TO BE HAPPENING TO A LOT OF 2007 & 2008 SAAB 9-3'S.  THERE SHOULD BE A RECALL.  THE COST TO GET IT FIXED IS OVER $2000.   *TR",
        "vin": "YS3FB49Y281"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2013",
        "dateOfIncident": "04/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT HE ENTERED THE VEHICLE AND NOTICED  THAT THE FLOOR MAT HOLDER WAS FRACTURED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 33,786.",
        "vin": "YS3FB79Y386"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2013",
        "dateOfIncident": "04/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT AFTER REFUELING, THE FUEL WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE FUEL GAUGE WOULD FLUCTUATE, CAUSING INACCURATE READINGS OF FUEL LEVELS AND AS A RESULT, THE CONTACT WAS UNABLE TO DETERMINE HOW MUCH FUEL WAS IN THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL LEVEL SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 84,000 AND THE CURRENT MILEAGE WAS 84,068.",
        "vin": "YS3FB49Y781"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/19/2013",
        "dateOfIncident": "12/31/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 4,
        "odiNumber": 10512690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 65 MPH, THE GEAR SHIFT KNOB, SHIFT COVER AND ASSEMBLY SEPARATED FROM THE CAR - THE BASE-METAL STICK SHIFT WAS ALL THAT REMAINED, AND THUS THE SAFETY LATCH THAT PREVENTS CAR FROM BEING SHIFTED INTO REVERSE, INSTEAD OF A FORWARD MOVING GEAR, NORMALLY ATTACHED TO THE EXTERIOR, WAS NOW MISSING. ALAS, SAFELY SHIFTING INTO ANY OF ITS 6 GEARS, WAS NOT AN OPTION ... IT'S ODD, BUT PER ITS ORIGINAL MANUFACTURING SPECS, THE ENTIRE TRANSMISSION SYSTEM IN THE 9-3, HAS ZERO LOCKING MECHANISM TO KEEP THE KNOB AND COSMETIC HOUSING FROM SEPARATING.     NUMEROUS OTHER REPORTS HAVE BEEN REPORTED TO DEALERSHIPS AND ACROSS THE INTERNET. GM STILL COVERS 9-3, 2008, UNDER ITS WARRANTY POLICIES.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SAAB 9-3S HAVE WELL DOCUMENTED ISSUE WITH THE FRONT STRUT SPRINGS BREAKING DUE TO CORROSION CAUSED BY ROAD GRIT AND PARTICULATE SCRAPING AWAY ANTI-CORROSION PAINT.  GM OWNED 100% OF SAAB FROM 2000 THROUGH 2010.  GM OFFERED TO COVER COST OF REPAIRS FOR MODEL YEARS 2003-2006, BUT HAS DECLINED TO COVER COSTS FOR 2007 AND BEYOND.  MY 2008 9-3 HAS THE FAULTY SPRINGS, AND ONE OF THEM JUST BROKE.   REPAIRS COSTS ARE SUBSTANTIAL ($700-$1500) AND THE ISSUE PRESENTS A POTENTIALLY SIGNIFICANT SAFETY ISSUE AS WELL.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "12/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DECEMBER 2012 (6 MONTHS AGO) MY CAR HAS BEEN RUNNING ON A BAD FUEL PUMP INDICATED BY CEL AND DIAGNOSTIC TESTS RUN BY AN AUTHORIZED SERVICE DEPARTMENT. THIS IS FOR AN XWD CAR WHICH HAS A DIFFERENT FUEL PUMP ASSEMBLY THAN THE FWD VERSION. THE PART HAS BEEN ON BACK ORDER BY SAAB PARTS (UNDER WARRANTY BY GM) AND HAS NO EXPECTED DELIVERY DATE.  PER MY KNOWLEDGE THERE ARE OVER 75 PEOPLE IN FRONT ME WAITING FOR THE SAME PART.    I AM CONCERNED THE FUEL PUMP WILL FAIL DURING POSSIBLE DANGEROUS SITUATIONS SUCH AS HIGH SPEED DRIVING AND MANEUVERING. SAAB PARTS INFORMED ME THAT A TSB HAS BEEN ISSUED IN REGARDS TO THIS MATTER. HOWEVER I DO NOT SEE IT AVAILABLE ON DOT WEBSITE AND SAAB PARTS IS UNWILLING TO PASS THE INFORMATION ON DIRECTLY TO ME THE CONSUMER. THE AUTHORIZED SERVICE DEPARTMENT ARE UNWILLING TO DO THE FIX STATED IN THE TSB AND REFUSE TO SHOW ME THE TSB OR TELL ME ANY DETAILS.  *TR",
        "vin": "YS3FH47R781"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "02/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON TURNPIKE AND CAR HESITATED VERY BADLY AT 1/2 THROTTLE IN 3RD-5TH GEAR AT 50-70MPH. CAR STUTTERED SO BADLY I BACKED OFF THEN ENGINE MALFUNCTION LIGHT COMES ON FOR 10 SECS, GOES OFF AND CAR THEN IN A DRIVING VERY POOR - ALMOST LIKE ITS IN LIMP MODE. I BELIVE IT WAS LIMP HOME MODE.    CAR FELT LIKE IT WAS RUNNING ON 3 CYLINDERS WITH A HOSE BLOWN OFF (NOT THAT I KNOW WHAT A HOSE IS !!). I BASICALLY COULDN'T ACCELERATE WITHOUT THE CAR FEELING LIKE IT WAS GOING TO FALL APART. YOU COULD FEEL THE CAR VIBRATING.    I DROVE HOME VERY STEADY AT 50 MPH, BEING PASSED BY ALL OTHER VEHICLES.    THERE ARE MANY PROBLEMS WITH THIS MODEL SAAB TURBOX 9-3 2.8L V6 AND FAULTY IGNITION COILS. I KNOW OF SCORES OF OTHERS HAVING THE SAME ISSUE, WITH ONLY 600 OF THIS MODEL PRODUCED.  HTTPS://WWW.FACEBOOK.COM/NOTES/SAAB-TURBO-X/DEFECT-OF-IGNITION-COIL/104750332952290.  *TR",
        "vin": "YS3FM42R781"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A NORMAL HIGHWAY SPEED, THE CHECK ENGINE LIGHT CAME ON AND STAYED ON.  THIS IS THE 4TH TIME SINCE NOVEMBER 2012.  FOR THE FIRST TWO TIMES, THE DEALER REPLACED THE FUEL PUMP.  THE LAST TIME THEY WERE NOT ABLE TO DIAGNOSE OR FIND A PROBLEM.  TODAY, I AM TOLD THAT I NEED ALL 6 IGNITION COILS REPLACED AS WELL AS ALL 6 SPARK PLUGS.  I DON'T THINK THIS IS NECESSARY AND THAT THE DEALER JUST WANTS TO MAKE SOME MONEY.  THE CAR SHUDDERS AND VIBRATES LIKE CRAZY, EVEN AT IDLE BUT THIS IS WORSE WHEN ACCELERATING.  ALSO, THE POWER IS MUCH LOWER THAN NORMAL.  HAS ANYONE WITH THIS MODEL HAD A SIMILAR EXPERIENCE OR PROBLEM?  *TR",
        "vin": "YS3FH41U481"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/22/2012",
        "dateOfIncident": "05/22/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS TAKING A ONE DAY BUSINESS TRIP THAT WAS ABOUT 250 MILES AWAY. THE DAY I LEFT THE TPMS SAID THAT MY FRONT PASSENGER TIRE WAS LOW, SO I CHECKED AND IT CAME IN ABOUT 10 PSI LOWER THAN ALL THE OTHER TIRES. I GOT DOWN THERE AND SETTLED IN FOR THE NIGHT. THE NEXT MORNING IT WAS UNDER 10 PSI. I FILLED IT UP AGAIN AND LEFT FOR HOME. ABOUT HALF WAY THROUGH THE TRIP I STOPPED FOR SOME LUNCH. I GOT BACK TO THE CAR, AND THE TPMS LIT UP AGAIN. THIS TIME IT WAS HALF WHAT ALL THE OTHER TIRES WERE. UPON MY RETURN HOME, I TOOK THE CAR TO MY MECHANIC AND HE SAID THAT THERE WAS A HOLE ON THE INSIDE SIDEWALL. THE TIRES ONLY HAVE ABOUT 33,500 MILES ON THEM.  *TT",
        "vin": "YS3FB49Y681"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2012",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING UP TO HIGHWAY SPEEDS ENGINE WILL SLIP, STUTTER, AND MISFIRE REDUCING POWER AND CAUSING UNSAFE AND UNPREDICTABLE MERGING MANEUVERS.  HAVE HAD 3 OR MORE VISITS TO DEALER CONCERNING THIS WITH REPAIRS THAT NEVER FULLY RESOLVING ISSUE OF BAD IGNITION COILS OR ENGINE RESOLVE.  VEHICLE IS 2008 SAAB 9-3 TURBO X, A LIMITED RUN OF 600.      *JS",
        "vin": "YS3FM57R681"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/14/2012",
        "dateOfIncident": "05/11/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458286,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SAAB 9-3. THE CONTACT STATED THAT THE REAR TAIL LIGHT FAILED. THE DEALER WAS CONTACTED AND ADVISED THAT THE FAILURE WAS COMMON FOR THE YEAR, MAKE AND MODEL BUT UNFORTUNATELY, THE MANUFACTURER WAS NO LONGER ALLOWING THE PART TO BE AVAILABLE IN THE UNITED STATES. THE VIN WAS NOT AVAILABLE. THE CURRENT MILEAGE WAS 42,000 AND THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2012",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SAAB IS A 2008 9-3 AERO WITH A 6 SPEED AUTOMATIC TRANSMISSION.  EVER SINCE I BOUGHT IT IN OCTOBER 2010, WHEN I TRY TO ACCELERATE WHILE ALREADY AT SPEED (I.E., PASSING MANEUVER) THE ENGINE/TRANSMISSION SPUTTERS AND DOES NOT IMMEDIATELY ACCELERATE.  THE STUTTERING MAKES PASSING IN TRAFFIC A RISKY/DANGEROUS MOVE.  I HAVE MADE SEVERAL TRIPS TO THE DEALER FOR INVESTIGATION AND AM REPEATEDLY TOLD THAT THIS IS THE NORMAL BEHAVIOR FOR THE AUTOMATIC TRANSMISSION. (I HAVE NEVER HAD AN AUTOMATIC TRANSMISSION CAR ACT LIKE THIS.)   NEARLY TWO YEARS LATER, I STILL HAVE THE SAME THING OCCURRING.           *JS",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/13/2012",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED BOTH FRONT COIL SPRINGS AT RECOMMENDATION OF DEALER.  ONE SPRING WAS BROKEN COMPLETELY AT BOTTOM (ON DRIVER'S SIDE), AND THE OTHER WAS CRACKED (ON PASSENGER SIDE).  SPACER LEAFS WERE REPLACED ALSO.  I'VE RETAINED THE PARTS.  EXPENSE WAS NOT COVERED UNDER WARRANTY ALTHOUGH THE CAR HAS ONLY 47,500 MILES.  IT IS 4 YEARS, 5 MONTHS OLD.  I AM THE ORIGINAL OWNER.  CAR HAS NEVER BEEN IN AN ACCIDENT.  *TR",
        "vin": "YS3FB46Y881"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2011",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SAAB 9-3, 2008, CLUTCH FAILED AT 22,000 MILES. SAAB SAID IT WAS NOT WARRANTIED AND IT WAS DUE TO DRIVER. WE PAID $1,300 FOR THE REPAIR. CLUTCH FAILED AGAIN AT 33,000 MILES. THIS TIME SAAB PAID FOR THE REPAIR AND DEALER SAID IT WAS DUE TO FAULTY PARTS IN THE ENTIRE CLUTCH SYSTEM. WE WANT REIMBURSEMENT FOR THE FIRST CLUTCH REPAIR.  *TR",
        "vin": "YS3FB56Y181"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "06/30/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SAAB 9-3 TURBO X.  I HAD A ENGINE MISFIRE WITH FLASHING CHECK ENGINE LIGHT UNDER HEAVY ACCELERATION.  CAUSED THE CAR TO RUN REALLY ROUGH WITH REDUCED POWER.  WOULD HAVE BEEN VERY UNSAFE HAD IT HAPPENED WHILE PASSING SOMEONE.  TOOK TO THE DEALERSHIP AND IT WAS DIAGNOSED AS A BAD IGNITION COIL.  ONE COIL WAS REPLACED BUT THE CAR STILL WAS RUNNING ROUGH AT THE DEALERSHIP SO THEY ARE STILL TRYING TO FIX IT.  FROM RESEARCHING ONLINE, IT SEEMS TO BE A PROBLEM WITH 2008 SAAB TURBO X.  LOTS OF COMPLAINTS ON FAULTY IGNITION COILS. *TR",
        "vin": "YS3FM42R181"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER TURBO BOOST IS ENGAGED IN MY SAAB TURBO X (2008), RISK OF MISFIRE, CHECK ENGINE LIGHT BEGINS TO BLINK, CAR SHUDDERS, \"LIMP HOME MODE\" ENGAGES (CAR LOSES POWER), AND HAVE TO MOVE TO SIDE OF ROAD AND RESTART THE CAR.  THIS HAS HAPPENED BOTH IN SECOND GEAR, AND IN FIFTH GEAR WHILE TRYING TO BOOST ON THE HIGHWAY.   THERE HAVE BEEN SEVERAL SIMILAR REPORTS ON THE WEB BY OTHER OWNERS RELATED TO BAD IGNITION COILS IN THE VEHICLES.   CAR IS BRAND NEW. TOOK THIS INTO DEALER ONCE AND THEY SAY NO CODES WERE ON THE COMPUTER, BUT THEY HAVE OFFERED ANOTHER VISIT TO INSPECT.  NOTE: THIS IS NOT YOUR EVERYDAY 9-3, BUT A LIMITED EDITION SAAB (TURBO X), WITH ONLY 600 TOTAL SHIPPED TO THE US.  *TR",
        "vin": "YS3FM57R381"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING ON A FREEWAY ON RAMP, THE ENGINE BEGAN TO MISFIRE AND STUTTER.  TRYING TO MERGE WITH THE FLOW OF TRAFFIC, POWER WAS UNAVAILABLE.  THE ENGINE OPERATED NORMALLY WHEN NOT ACCELERATING.  THE CAR WAS UNABLE TO KEEP UP WITH THE FLOW OF TRAFFIC AND WOULD ONLY MAINTAIN A SPEED OF APPROXIMATELY 50 MPH.  PRESSING THE ACCELERATOR MORE CAUSES MORE STUTTERING.  THE CHECK ENGINE LIGHT FLASHED ON BRIEFLY AND THEN WENT AWAY.   THE PROBLEM RESOLVED ITSELF AFTER PULLING OVER AND SHUTTING DOWN AND RESTARTING THE ENGINE.  THE PROBLEM OCCURRED AGAIN THE NEXT DAY UNDER THE SAME CONDITIONS... NORMAL OPERATING TEMPERATURE AND MODERATE TO HEAVY ENGINE LOAD FOR ACCELERATING.  TOOK THE CAR TO DEALER WHO REPLACED THE COIL PACK FOR CYLINDER #6.  THE PROBLEM WAS RESOLVED, BUT THERE ARE STILL OCCASIONAL STUTTERS, JUST NOT CONSTANT STUTTERS THAT CAUSED THE LOSS OF POWER.  I HAVE RESEARCHED THIS ISSUE ON MESSAGE BOARDS AND THE PROBLEM IS NOT UNIQUE TO MY CAR.  MANY OTHERS HAVE HAD ISSUES WITH THE COIL PACKS AND SOME REPORTING THE SAME CYLINDER #6. *TR",
        "vin": "YS3FM57R581"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SAAB 93 2.0T SEDAN STALLED (NO SPUTTER OR BUCK, BUT JUST A LOSS OF POWER) WHILE DRIVING.  RESULTED IN A COLLISION.  INITIAL DEALERSHIP MECHANICS HAVE \"NO FINDINGS\" - THEY WILL HAVE A FIELD ENGINEER INVESTIGATE TOMORROW. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/16/2008",
        "dateOfIncident": "04/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SAAB 9-3 CONVERTIBLE.  WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT NOTICED A GAP BETWEEN THE ROOF AND THE VEHICLE.  HE DROVE THE VEHICLE TO THE DEALER AND THEY STATED THAT THE ROOF OF THE 2008 SAABS WERE REDESIGNED.  TWO ATTEMPTS WERE MADE TO REPAIR THE VEHICLE.  THE MANUFACTURER STATED THAT THE VEHICLE WAS STILL UNDER WARRANTY AND NOTHING ELSE COULD BE DONE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT MILEAGE WAS 7,500 AND FAILURE MILEAGE WAS 400.",
        "vin": "YS3FH71U086"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/10/2008",
        "dateOfIncident": "03/23/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241667,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNSAFE TO KNOW THAT MY NEW CAR HAS DOOR LOCKS THAT DO NOT UNLOCK FROM WITHIN THE CAR CABIN WHEN THE DOOR HANDLE IS PULLED.  UNLIKE MY PREVIOUS CAR (VW) WHEREBY THE DOOR IS UNLOCKED WHEN THE DRIVER DOOR (FOR EXAMPLE) IS PULLED - DOOR OPENS OR MY BMW WHEREBY THE DOOR IS UNLOCKED BY PULLING THE HANDLE TWICE. IN A SAAB, THE DOORS CAN NOT BE OPENED UNLESS THE \"UNLOCK\" BUTTON IS PRESSED. THIS IS A SAFETY ISSUE SINCE EGRESS CAN NOT BE DONE QUICKLY IN THE EVENT OF AN ACCIDENT OR OTHER EMERGENCY NEED FOR IMMEDIATE EGRESS. *TR",
        "vin": "YS3FB49Y781"
    }
]