[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454414,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Forester. The contact stated that while driving at an undisclosed speed, the lower control arm detached. The contact became aware that there was rust on the control arm. The vehicle was towed to the local dealer. The vehicle was not diagnosed or repaired. The manufacturer was notified of the failure however, no further assistance was provided. The approximate failure mileage was 141,000.",
        "vin": "JF1SG66638G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442453,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Right front lower control arm failed due to rust (safety recall WVX34 and NHTSA campaign 11v464000). Part of arm completely detached from connection to frame. Dealer states the recall is closed and there is nothing they will do. I notified Subaru by Email last night on the day it occurred -1 Dec 2021. Have not had reply as yet. This caused uncontrollable steering as it was not controllable by the steering wheel. Fortunately this failed as I was backing out of a parking spot and not at speed on the highway. Car was not drivable.  I inspected the left front control arm and it too seems to be also affected by rust.",
        "vin": "JF1SG63658G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436596,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Forester. The contact stated that while driving at various speeds, an abnormal grinding noise would emit from the vehicle without warning. The contact then stated that upon turning into a driveway, the front lower control arm detached from the vehicle without warning. Due to the failure, the contact had the vehicle towed to his home where he began to repair the vehicle himself. The dealer and the manufacturer were both notified of the failure but offered no assistance. Upon investigation, the contact discovered NHTSA campaign number: 11V464000 (Suspension) which he linked to the failure. The vehicle was not repaired. The failure mileage was 97,000",
        "vin": "jf1sg676x8h"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435345,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Forester. The contact stated while driving approximately 30 MPH, the vehicle was shaking. Additionally, the passenger’s side front wheel was shaking, and the vehicle was drifting to the right. The contact who is an independent mechanic noticed that the front lower control arm was fractured. The dealer was not contacted. The vehicle was not repaired. The manufacturer was notified of the failure and informed the contact that the vehicle was previously repaired under NHTSA Campaign Number: 11V464000 (Suspension). The approximate failure mileage was 180,000.",
        "vin": "jf1sg676x8h"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422196,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I was getting on the highway in Minnesota doing 55-60 mph when the car started violently shaking and I lost steering with cars whizzing by me at 65-70+ mph.  I was finally able to get the car just off the road and called for roadside assist.  Once the car was left at my house I examined the right front wheel which was cockeyed to discover the lower control arm steel body had disintegrated (see photos).  Looking online I discovered there had been a  recall on these arms 9 years ago.  I sent a message to Subaru Customer Care and received no reply.  I sent a tweet on twitter to Subaru of America and received no reply.  I finally called their 800 number and was told the recall had been completed on this vehicle in 2012 by putting some \"rust-proofing\" on the arms.  They did not go through the effort to replace with the upgraded replacement part. SOA said they would not cover any repair or replacement of the lower control arms. There have to be 10s of thousands of these vehicles on the roads with arms rotting from the inside out because SOA did the recall on the cheap.  The bushings and balljoint was still intact and no clunking or judder prior to the catastrophic failure.  Is it going to take a death(s) to get this corrected.  SOA know they should have replaced these arms and will sell you the upgraded one for around $300.  No aftermarket companies are making these arms as far as I can find.  Subaru admits on their own parts site the arms \"do not often fail\" i.e the body and instead the bushings wear out.  The body of the car has very minimal rust and no signs the arm(s) would have deteriorated. I have asked SOA to replace the arms with ones that are structurally sound but think a second recall on cars that didn't get new arms may be required.",
        "vin": "JF1SG63648G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419667,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving to work and my Subaru stalled at an intersection.  I restarted the car and continued to work.  It is raining heavily.  I arrived at work and the parking lot is full of water.  I was slowly pulling up forward in the parking spot.  I had my foot on the brake trying to get as far forward in the spot to avoid as much of the huge puddle in the lot as I could when suddenly the vehicle lurched forward over the concrete stop in the parking spot, onto a raised concrete sidewalk and then smashed into my work's building.  It happened in a split second and I can hardly believe what has happened myself.  After searching on the internet, I can see that newer models are having this problem so I came here to let someone know that at least a 2008 model had this problem too.",
        "vin": "jf1sg63668h"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363012,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPTEMBER 19, 2020, I WAS DRIVING ON THE INTERSTATE, AT 10:30 PM, GOING 75MPH AND AL OF A SUDDEN I HEARD A LOUD POP. I HAD LOST ALL CONTROL OF MY CAR AND MY FRONT PASSENGER SIDE FELT LIKE IT COMPLETELY GAVE OUT ON ME. I SLAMMED ON THE BREAKS AND TRIED TO GET IT ON THE RIGHT SIDE OF THE ROAD BUT I COULDN'T.  IT SENT ME ON THE LEFT HAND SIDE, THE FAST LANE, RIGHT UP AGAINST THE INTERSTATE DIVIDER WALL, MY CAME TO A STOP INA COUPLE SECONDS.   I WAS SITTING FLUSH WITH THE WALL, I COULDN'T OPEN MY DOOR, AND I DIDN'T WANT MY PASSENGER IN THE CAR TO OPEN HIS DOOR ONTO ONCOMING TRAFFIC, I TURNED MY EMERGENCY BLINKERS ON AND PROCESSED TO CLIMB OUT OF MY WINDOW ONTO THE CONCRETE WALL.  I STARTING LOOKING AT THE FRONT END OF MY CAR TO SEE WHAT HAD HAPPENED. I SAW BOTH OF MY FRONT TIRES HAD POPPED, THE PASSENGER SIDE HAD BLEW OUT AND HAD HOLES IN THE SIDE WALL OF THE TIRE. IT WAS DRIVING ON THE WHEEL OF THE CAR BECAUSE THE WHEEL WAS ALL CURBED AND SCRAPED.  I NOTICED IT WAS LEANING LOWER ON THE GROUND ON THE FRONT PASSENGER SIDE THAN DRIVER SIDE. I WASN'T SURE WHAT IT WAS BECAUSE I COULDN'T SEE ALL THAT GREAT WITH THE WHEELS TURNED THE WAY THEY WAS. I STARTED LOOKING FURTHER AT THE CAR, GOT ON THE GROUND TO LOOK UNDER IT AND NOTICED AN EXTREME AMOUNT OF GREASE THAT WAS COVERING THE MAJORITY OF MY STEERING COLUMN AND MY EXHAUST.  SO ONCE COPS CAME, FILED A REPORT AND HAD A FLAT BED TRUCK BRING IT TO MY HOUSE I WAS ABLE TO LOOK MORE IN DEPTH TO IT IN THE DAY LIGHT. IT HAD: SNAPPED MY CONTROL ARM INTO 2 PIECES ,BENT MY OUTER TIE ROD, SNAPPED MY CV AXLE, WHICH CAUSED ALL THE GREASE TO GET OUT, THE BALL JOINT BOOT WAS LEAKING LUBRICANT, POSSIBLY MESSED UP THE FRONT STRUT TOWER, AND SO ON WHAT I COULDN'T SEE OR TELL WAS BROKEN. THE FRONT DRIVER SIDE SEEMS AND LOOKS INTACT. I'VE BEEN HAVING TO REPLACE THE WHOLE PASSENGER SIDE. I AM THE THIRD OWNER OF THIS CAR, I BOUGHT IT FEB, 12, 2019",
        "vin": "JF1SG66638H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282975,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE STARTED FAILING. THE COMPRESSION STARTED RAPIDLY DECLINING THESE LAST FEW WEEKS.  MY ENGINE WAS SLUGGISH AND JERKY.  I PREVIOUSLY HAD THE CAR SERVICED WITH A NEW ALTERNATOR AND HAD MY EMISSIONS TESTING DONE FOR MY REGISTRATION. THE NEXT DAY THE ENGINE LIGHT CAME ON TO ALERT FOR THE PROBLEM. I BROUGHT IT BACK IN AND AFTER SOME TESTING WAS TOLD IT WAS THE COMPRESSION TO THE ENGINE THAT WAS NOT WORKING PROPERLY.  IT IS IN THE SHOP NOW. AFTER FURTHER TESTING  DECOMPRESSION WAS EVEN WORSE THAN PREVIOUSLY DIAGNOSED AT OTHER MECHANIC AND THE ENGINE WAS DECLARED TO BE FAILING. I AM HAVING TO GET A COMPLETE ENGINE REMAKE. $8,000.",
        "vin": "JF1SG69698H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182786,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE ATTEMPTING TO EXIT THE DRIVEWAY, THE DRIVER'S SIDE LOWER CONTROL ARM FRACTURED AND THE WHEELS SEPARATED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE CONTROL ARM FRACTURED AND THE PASSENGER SIDE SHOWED EVIDENCE OF SEVERE RUST. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). VOLKSWAGEN SUBARU FORT WALTON BEACH (LOCATED AT 130 HOLLYWOOD BLVD SW, FORT WALTON BEACH, FL 32548, (850) 243-3171) WAS CONTACTED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "JF1SG63658H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175703,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE THE VEHICLE WAS UNDERGOING ROUTINE MAINTENANCE AT GOLICK MOTOR COMPANY (600 7TH ST, PITCAIRN, PA 15140, (412) 372-7420), THE CONTACT WAS INFORMED THAT THE HEAD GASKET WAS BLOWN AND THERE WAS AN OIL LEAK. THE DEALER REPAIRED THE TIMING BELT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120628,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE DRIVING APPROXIMATELY 50 MPH, THE LOWER CONTROL ARM FRACTURED ON THE FRONT PASSENGER SIDE OF THE VEHICLE. THE DEALER (GARY LANG SUBARU, 1121 STATE RTE 31 BUILDING 3, MCHENRY, IL 60050, (815) 788-6506) INDICATED THAT THE VEHICLE WAS ALREADY REPAIRED PER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). THE MANUFACTURER REFUSED TO AUTHORIZE THE DEALER TO REPAIR THE VEHICLE; THEREFORE, THE CONTACT HAD TO PAY OUT OF POCKET FOR THE DIAGNOSTIC TEST AND REPAIR. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR FURTHER DIAGNOSTIC TESTING. THE VEHICLE WAS NOT INCLUDED IN NHTSA ACTION NUMBER: PE11011 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 88,900.",
        "vin": "WBAPH7G5XAN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11075763,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 SUBARU FORESTER 2.5X, VIN. [XXX], WHICH WAS PURCHASED NEW AT BROWN'S SUBARU, 960 HILTON HEIGHTS ROAD, CHARLOTTESVILLE, VA. ALL FACTORY RECOMMENDED MAINTENANCE SCHEDULES WERE METICULOUSLY UPHELD.    VEHICLE MALFUNCTIONS EXPERIENCED DURING ACCIDENT:  1. RAPID RPM SURGE WITHOUT OPERATOR ACTIVATION FROM IDLE TO APPROXIMATELY 5,000+ RPMS  2. RAPID UNCONTROLLABLE VEHICLE ACCELERATION, PLOWING THE VEHICLE THROUGH MULTIPLE LOAD-BEARING STRUCTURES  3. FAILURE OF DEPLOYMENT OF DRIVER AND PASSENGER AIRBAGS AFTER MULTIPLE HEAVY IMPACTS, LAST OF WHICH AN EXTREMELY HARD IMPACT WHICH COMPLETELY STOPPED AND DISABLED VEHICLE, RESULTING IN INJURIES TO THE DRIVER AND PASSENGER.    ACCIDENT DESCRIPTION:  I HAD A MAJOR MALFUNCTION OF MY SUBARU FORESTER, WHICH RESULTED IN A VERY SEVERE AND POTENTIALLY LETHAL CAR ACCIDENT.  IN THE PROCESS OF PULLING SLOWLY INTO A HANDICAPPED PARKING SPACE, WITH ONE FOOT APPLIED TO THE BRAKE ALMOST TO A COMPLETE STOP, THE VEHICLE'S RPMS SURGED AHEAD RACING OUT OF CONTROL. AT THAT TIME, I APPLIED BOTH FEET TO THE BRAKES. THE CAR RAPIDLY ACCELERATED INTO A BUSINESS, THROWING US BACK IN OUR SEATS AND COMPLETELY DEMOLISHING MULTIPLE EXTERIOR LOAD BEARING STRUCTURES AS WELL AS INTERIOR STRUCTURES. IT WASN'T UNTIL THE CAR BECAME LODGED AGAINST A KIOSK COMPLETELY INSIDE THE BUILDING, THAT IT STOPPED, ALTHOUGH BRAKES WERE APPLIED FIRMLY FOR THE DURATION OF THE ACCIDENT. PLEASE INVESTIGATE THIS MATTER, AS THIS WAS A SERIOUS INCIDENT COMPLETELY OUT OF MY CONTROL, THAT COULD HAVE RESULTED IN SERIOUS INJURY OR DEATH.    THIS WAS A TERRIFYING UNCONTROLLABLE EVENT THAT COULD HAVE RESULTED IN TRAGEDY.   THANK YOU FOR YOUR TIME AND YOUR SERVICES. PLEASE CONTACT ME FOR ANY ADDITIONAL INFORMATION NEEDED. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JF1SG63678H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073311,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SECONDARY AIR PUMP MALFUNCTION.  I HAVE READ THAT THIS HAPPENS ALL THE TIME AND IT COSTS $2,000 TO GET IT REPLACED.  CHECK ENGINE LIGHT IS ON ALL THE TIME AND IT CANCELS OUT TRACTION CONTROL AND CRUISE CONTROL.  I CAN HEAR IT TRYING TO WORK AND HOPE IT DOES NOT CAUSE A FIRE RISK.",
        "vin": "JF1SG69628H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/21/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11063938,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A HIGH-SPEED CRASH ON I-35 IN DENTON TX.  THE CAR WAS REAR-ENDED.  BOTH CARS WERE TRAVELLING AT HIGHWAY SPEEDS (50-60 MPH).  THE DRIVER AND THE FRONT SEAT PASSENGERS WERE RESTRAINED AND BOTH SUSTAINED HEAD INJURIES AND LOST CONSCIOUSNESS.  THEY WERE TAKEN FROM THE SCENE IN AN AMBULANCE.  THE AIRBAGS DID NOT DEPLOY AND WE ARE CONCERNED THAT THEY SHOULD HAVE.",
        "vin": "JF1SG656X8H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055018,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR AS BEEN SEEN BY SUBARU DEALERSHIP SINCE THE DAY I BOUGHT IT IN 2012. I PAID FOR 5 YEARS. AFTER I FINISHED PAYING IN JULY, I JUST DISCOVERED THAT IS AN OIL LEAK , ALL MY ENGINE FROM FRONT TO BACK IS DIRTY WITH OIL, A SECOND OPINION MECHANIC STATED THAT HE DOES NOT KNOW HOW I AM USING THIS CAR FOR YEARS LIKE THAT. BUT THE CAR JUST HAD LAST YEAR A HEAD GASKET CHANGED \"BY CHARITY\" , OFFER OF SUBARU FACTORY TO ME AND THE DEALERSHIP IN MOLINE, IL DID THE CHANGE. HOW AFTER PULLING DOWN THE ENGINE THEY NEVER NOTICED THE OIL LEAK AND SMOKING. I ONCE WAS THERE WITH MY SON, CHANGED OIL, SMOKE CAME UP, DROVE BACK TO THEM AND THEY TOLD ME THAT WAS AN OIL SPILL PROBABLY. I PAID 283 DOLLARS FOR 5 YEARS FOR A 2008 SUBARU FROM THE DEALERSHIP GLAZMAN, PA WITH 60,000 MILES, I HAD TO MANY EXPENSES THAT I CAN'T IMAGINE A CAR MADE LIKE THAT TO BE SOLD. I JUST FINISHED PAYING THE CAR AND NOW I HAVE A JUNK CAR. I CAN'T AFFORD ANOTHER CAR IT HAS ONLY 114, 000 MILES. IT IS VERY UPSETTING WHAT THEY DO TO COSTUMERS. I HAVE NO WORDS.",
        "vin": "JF1SG63638H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048788,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN OIL LEAK FROM THE CAM SHAFT, ONLY NOTICED AFTER I FINISHED PAYING THE CAR, 60 MONTHS PAYING 283 DOLLARS, NOW THERE IS A PROBLEM. MY CAR IS FULL WITH SMOKING UNDER THE HOOD DUE TO THIS OIL LEAK, APPARENTLY ALL SUBARU CARS HAVE THE SAME ISSUE. NOW I AM LEFT WITH A PAID CAR THAT BASICALLY DOES NOT HAVE VALUE AND OVER THOUSANDS OF DOLLARS TO FIX IT, OR MY CAR CAN BURN DOWN.",
        "vin": "JF1SG63638H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "09/27/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030515,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE DRIVING 30 MPH, THE CONTACT HEARD A KNOCKING SOUND COMING FROM THE ENGINE AND THE VEHICLE RAN OUT OF OIL. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THEY COULD NOT ASSIST BECAUSE THERE WAS NO RECALL ON THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.",
        "vin": "JF1SG63648H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/27/2015",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928747,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE ATTEMPTING TO HAVE THE VEHICLE INSPECTED, IT WOULD NOT PASS THE SMOG TEST DUE TO A SECONDARY AIR INJECTION PUMP BEING STUCK OPEN. WHILE DRIVING VARIOUS SPEEDS, THE SECONDARY AIR PUMP CAUGHT FIRE. THE VEHICLE WAS PULLED OVER AND THE KEY WAS REMOVED FROM THE IGNITION. THE CONTACT STATED THAT THE FIRE BURNED OUT ON ITS OWN. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT INCLUDED IN THE MANUFACTURER'S SATISFACTION CAMPAIGN TO ADDRESS THE ISSUE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000. ..UPDATED 01/04/17 *BF   ...UPDATED 01/23/17 *BF    THE CONSUMER STATED THE VEHICLE WAS NOT INCLUDED THE RECALL, BUT THE FAILURE WAS IDENTICAL. UPDATED 12/5/2017*JS  UPDATED 7/11/18*JB *TR",
        "vin": "JF1SG66628G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "08/03/2016",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 2008 SUBARU FORESTER LL BEAN PULLING INTO PARKING PARK. VEHICLE STARTED RUNNING ROUGH, PARKED, ENGINE STOPPED RUNNING. ATTEMPTED TO RESTART SOUNDED LIKE A LOW BATTERY TURNED OFF ALL ELECTRICAL DEVICES ATTEMPTED TO START AGAIN, ENGINE STARTED RAN NORMALLY NO CAUTION LIGHTS. STARTED TO DRIVE HOME, ENTERED THE ON RAMP OF HIGHWAY. NOTICED WHITE SMOKE IN REVIEW MIRROR PULLED OFF OF HIGHWAY STOPPED VEHICLE TURNED OFF, SMOKE COMING FROM ENGINE COMPARTMENT SAW FLAMES UNDER CAR CALLED 911 FIRE DEPARTMENT. FIRE DEPARTMENT ARRIVED EXTINGUISHED FIRE.",
        "vin": "JF1SG67678H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892768,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P2441 - SECONDARY AIR INJECTION SYSTEM SOLENOID MALFUNCTION. PROBLEM OCCURED AT 87K MILES.",
        "vin": "JF1SG69618H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/29/2016",
        "dateOfIncident": "04/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862207,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS CLEANING INTERIOR OF CAR AND THE DRIVERS SEAT LIFTED UP.  CAR WAS IN MY DRIVEWAY, THE INTERIOR WELD BROKE. I TOOK IT TO LOCAL SUBARU DEALER.  NOW 5 DAYS LATER, AFTER NEW SEAT CAME IN I AM TOLD THE TRACK IS BROKEN.  A COST OF $600 PLUST LABOR TO FIX.  I HAD AN EXTENDED WARRANTY THAT COVERED THE SEAT AND WELD.  I HAVE CONTACTED SUBARU OF AMERICA AS WELL. THE VEHICLE HAS 90,700 MILES ON IT.  I AM 6 FT 2\" @ 240#'S  SOLO OWNER AND DON'T ABUSE MY VEHICLE.  I THOUGHT SUBARU'S WERE BETTER BUILT. IN 2014 I HAD TO REPLACE THE CYLINDER HEAD (GASKET)  WHEEL BEARINGS AND BRAKES.  2015 THE COMPETE SUSPENSION WAS REPLACED  IN 2010 UNDER ORIGINAL WARRANTY THE SWITCH FOR MOON ROOF AND THEN 2 MONTHS LATER THE MOTOR FOR THE MOON ROOF WAS REPLACED. THAT IS WHY I BOUGHT AN EXTENDED WARRANTY.   THE SEAT ISSUE I HAVE SEEN  ON LINE HAS HAPPENED TO OTHERS WHO OWN FORESTER'S.",
        "vin": "JF1SG65678G"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845807,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE ATTEMPTING TO UNLOCK THE DRIVER SIDE DOOR, THE KEYLESS LOCKING MECHANISM MALFUNCTIONED AND THE CONTACT COULD NOT UNLOCK THE DOOR. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2015",
        "dateOfIncident": "01/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761874,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENED WHILE DRIVING ON A FREEWAY.  WEATHER WAS SUNNY,  IN THE 20S, PAVEMENT WAS DRY BUT THERE WERE SHORT ICY PATCHES UNDER BRIDGES.   EVERY TIME I PASSED OVER ONE OF THESE PATCHES I EXPERIENCED SEVERE FISHTAILING.   I HAD TO REDUCE SPEED TO UNDER 30MPH TO RETAIN CONTROL OF THE CAR WHILE TRAFFIC WAS PASSING ME AT 60+ MPH.  TIRES WERE NEW GOODYEAR ASSURANCE.    THIS IS EXTREMELY NERVE WRACKING AND IS A FREQUENTLY  REPORTED PROBLEM ON THE SUBARU ONLINE USER FORUMS SUCH AS:  HTTP://WWW.ULTIMATESUBARU.ORG/FORUM/TOPIC/127473-GHOST-WALKING/  THE PROBLEM IS NOT EVIDENT WHEN DRIVING ON DRY OR ON SNOWY ROADS.",
        "vin": "JF1SG65668H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "04/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713138,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION) AND THE TECHNICIAN ONLY APPLIED A RUSTPROOF COATING ON THE FRONT LOWER CONTROL ARMS SINCE THEY DID NOT NEED TO BE REPLACED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO FOUND THAT THE CONTROL ARMS WERE COMPLETED RUSTED THROUGH. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JF1SG63678H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664469,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN ONE MILES TIME CRUSE LIGHT WHEN ON THEN ENGINE LIGHT THEN DIED. GOT EXTREMELY HOT.. BLEW GASKETS AND POSSIBLE ENGINE. I HAVE NEVER MISSED OIL CHANGES AND HAVE TAKEN VERY GOOD CARE OF CAR.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652111,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT WENT ON - FLASHING. I DROVE IMMEDIATELY TO MY LOCAL GARAGE.  WHEN I TURNED OFF THE ENGINE, I SMELLED A STRONG BURNING OIL SMELL, AS DID THE MECHANIC.  THE OIL WAS CHECKED AND I WAS DOWN 2 QUARTS EVEN THOUGH I HAD  A RECENT OIL CHANGE AT THAT SAME FACILITY. THERE HAD BEEN NO OIL LEAKS, AND NO STAIN IN MY DRIVEWAY PREVIOUS TO THIS. THE MECHANIC SAW NO ABNORMAL OIL FLOW OR LEAK WHEN HE CHECKED.  *TR",
        "vin": "JF1 SG6361 "
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608120,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST LIKE THE JUST RECENT RECALL OF SUBARU'S 2009-2013 FORESTER, MY 1998 FORESTER STEERING RACK AND PINION SYSTEM HAD RUSTED OUT TUBING THAT LEAKED AND NEEDED REPLACEMENT AFTER STEERING JUST WENT OUT.    HOW YOUR ORGANIZATION CAN CONTINUE TO ALLOW CAR MANUFACTURES TO USE REGULAR STEEL FOR MANY OF THE PARTS UNDER A CAR (LIKE THE RACK AND PINION, BRAKES, ETC) IS BEYOND ME. THAT SHOULD BE A CRIME BUT OH NO, THE POLITICIAN WILL BUREAUCRATS WILL ALLOW THIS TO GO ON UNTIL A BUNCH OF YOUNG PEOPLE ARE KILLED. THEN YOU MIGHT DO SOMETHING.   *TR",
        "vin": "JF1SF6350WH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/18/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532301,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED 4 NEW KUMHO SOLUS KR21 P215/60R16 TIRES ON JULY 18, 2013, FROM TIRESOUTH IN ATLANTA, GA. WHEN I TRIED TO REGISTER THEM ON THE COMPANY'S WEBSITE, I FOUND THAT 2 OF THEM DO NOT HAVE DATE CODES (ONLY 8 CHARACTERS AFTER ?DOT? INSTEAD OF 12).  DOES THIS MEAN THAT THE TIRES ARE INAUTHENTIC OR DEFECTIVE?  I HAVE ATTEMPTED TO CONTACT KUMHO MULTIPLE TIMES, BUT HAVE NOT RECEIVED A RESPONSE.  *TR",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "07/17/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525494,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "RECARO NORTH AMERICA, INC.",
                "productMake": "RECARO",
                "productModel": "SIGNO",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "I OWN A RECARO SIGNO CONVERTIBLE CAR SEAT THAT WAS MANUFACTURED IN NOVEMBER OF 2008.  I AM HAVING ISSUES WITH THE CENTER PULL STRAP THAT TIGHTENS THE SHOULDER STRAPS OF THE CAR SEAT.  SINCE BUYING THIS SEAT NEW, I HAVE HAD TO REPLACE THIS CENTER STRAP 3 TIMES DUE TO IT FRAYING AND EITHER RIPPING OFF, OR LOCKING UP AND NOT ALLOWING THE SEAT TO BE FULLY TIGHTENED AGAINST MY CHILD.  RECARO HAS ALWAYS BEEN QUICK TO REPLACE THE STRAP, BUT I FEEL LIKE THERE IS A DEFECT IN THE DESIGN THAT KEEPS CAUSING THIS STRAP TO FRAY AFTER NORMAL USE.  (RELATED VEHICLE INFORMATION: MODEL YEAR=2008, MAKE=SUBARU, MODEL=FORESTER)  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2013",
        "dateOfIncident": "07/15/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524491,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY OF 2012 WHILE DRIVING ON THE HIGHWAY MY CHECK ENGINE LIGHT CAME ON, CANCELING MY CRUISE CONTROL.  I TOOK THE CAR TO REPAIR GARAGE I WAS USING AND THE EVAP CODE INDICATED A LEAK OF .002. THE CAR WAS SMOKE TESTED AND THE GARAGE RECOMMENDED TO CHANGE GAS CAP, WHICH I DID WITH GENERIC CAP.  THE AGAIN IN NOVEMBER OF 2012 THE CHECK ENGINE LIGHT CAME ON AGAIN WHILE DRIVING ON THE HIGHWAY AT 70 MPH,  AGAIN THE CODE WAS POSSIBLE EVAP LEAK.   IN JAN 2013 CHECK ENGINE LIGHT CAME ON AGAIN ON THE HIGHWAY, HAD IT SMOKE TESTED FOR 3 HOURS AT THE GARAGE, NO LEAK WAS DETECTED.  CHANGED GAS CAP AGAIN.  THEN IN MAY  2013 AGAIN ON THE HIGHWAY, CHECK ENGINE LIGHT CAME ON.  AGAIN POSSIBLE EVAP LEAK, SUGGESTED TO GET \"SUBARU\" GAS CAP.  SUBARU PARTS PERSONAL SAID THE ROLL OVER VALVE ON THE TOP OF THE GAS TANK WAS USUALLY THE PROBLEM MOST OF THE TIME.  IF THE CHECK ENGINE LIGHT COMES ON AGAIN, WILL PROBABLY NEED TO REPLACE.  SO IN JUNE AFTER COMING OFF THE HIGHWAY, THE CHECK ENGINE COMES ON.  TOOK CAR TO SUBARU AND SAID COULD NOT BE CERTAIN IT WAS ROLL OVER VALVE, HOWEVER SUGGESTED TO REPLACE.  CODE WAS P0456, WHICH WAS SAME CODE THAT APPEARED BEFORE IN MAY.  IF THE SUBARU FORESTER HAS THIS PROBLEM ON THESE MODELS, SHOULDN'T THIS PART BE A \"MAINTENANCE\" ITEM TO PREVENT ENGINE TROUBLES?  MY QUESTION FOR YOU IS HOW MANY SUBARU FORESTER'S HAVE HAD THIS PROBLEM?    IS THERE A WAY TO ASK SUBARU FOR HOW MANY SUBARU FORESTER'S HAVE HAD THIS PART REPLACED ON ALL SUBARU FORESTER'S TO EVALUATE IF MANUFACTURE DEFECT?  TO CHANGE THIS PART, I WAS CHARGED $418.14 + TAX TO FIX PROBLEM I HAVE NO \"SCHEDULED\" MAINTENANCE FOR .  THANK YOU.  *TR",
        "vin": "JF1SG63618H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/22/2013",
        "dateOfIncident": "03/16/2013",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504069,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A FIRE BROKE OUT IN THE INTERIOR OF OUR CAR WHILE PARKED. THE PASSENGER DOOR WAS DESTROYED AND THE INTERIOR OF THE CAR WAS RUINED WITH SMOKE DAMAGE. INSURANCE DECLARED IT A TOTAL LOSS AND BOTH THE ADJUSTER AND FIRE DEPARTMENT SUSPECT IT WAS A WIRING ISSUE. WHILE ARSON WAS NOT RULED OUT, THERE WAS NO OTHER DAMAGE TO THE CAR TO SUGGEST A BREAK-IN, AND NO PERSONAL BELONGINGS IN THE CAR WERE TAMPERED WITH.  *TR",
        "vin": "JF1SG63658G"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/24/2012",
        "dateOfIncident": "11/23/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485893,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A SUBARU FORESTER 2008 IN THE FALL OF 2007.  AT ABOUT 4 YEARS, OR 40,000 MILES THE PLASTIC HEADLIGHT LENSES FOGGED OVER, REDUCING LIGHT OUTPUT AND DISPERSING, NOT FOCUSING THE HEADLIGHT BEAM MAKING IT DIFFICULT TO SEE THE ROAD AT NIGHT.  MY HUSBAND SPENT TIME USING PLASTIC POLISH TO REMOVE THE APPARENT FOG ON THE PLASTIC-HEADLIGHT COVER.  AT THIS POINT THE LENSES WERE CLEAR AND UN-FOGGED.  AFTER LESS THAN TWO MONTHS THE FOG ON THE PLASTIC-HEADLIGHT LENS REAPPEARED.  I BELIEVE THIS TO BE A MANUFACTURER'S DEFECT.  SUBARU USES SOME SORT OF PLASTIC THAT IS EXTREMELY SENSITIVE TO ROAD-DUST ABRASION.  THIS CREATES AN UNSAFE DRIVING CONDITION WHEN THE HEAD-LIGHT BEAM IS DISPERSED RATHER THAN FOCUSED ON THE ROAD-NECESSARY FOR NIGHT TIME VISIBILITY.  SUBARU HAS DENIED THIS IS A MANUFACTURER'S DEFECT.  THEY WOULD BE THE LAST TO ADMIT THIS.  THEY HAVE SAID I COULD REPLACE THE HEADLIGHT LENSES AT A COST OF $750 WITH NO GUARANTEE THAT IT WOULD NOT HAPPEN AGAIN OR THEY COULD REFER ME TO A PLASTIC-LENS POLISHING SHOP.  THIS CONDITION CREATES A POTENTIAL HAZARD.  THE HEADLIGHT SHOULD NOT FOG OVER WITHIN A TWO MONTH PERIOD OF BEING FIXED.  MOREOVER, IT SHOULD NEVER HAVE FOGGED OVER AT ALL IN A FOUR-YEAR OLD VEHICLE.  *TR",
        "vin": "JF1SG66698G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/16/2012",
        "dateOfIncident": "11/16/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484974,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A CHECK ENGINE LIGHT COME ON. PULLED THE CODE AND RAN IT BY A FRIEND WHO IS A SUBARU MECHANIC. AFTER REALIZING THIS IS A SMOG ISSUE CONTACTED DEALER WHO SAID ITS NOT COVERED UNDER EMISSIONS WARRANTY. I KNOW THIS IS FALSE AS PARTS ARE TO BE COVERED BY LAW UP TO 100K MILES. NOW IT'S GOING TO COST $1600+ TO REPAIR THIS ISSUE IN ORDER TO PASS SMOG. ON A 5 YEAR OLD CAR. BELOW IS A POSTING FROM MECHANIC NOTIFYING FORUMS, FACEBOOK, AND ANYONE ELSE WHO WILL LISTEN OF THE ISSUE (THERE ARE GOOD MECHANICS OUT THERE).     ONE OF THE ISSUES WE HAVE BEEN HEARING A LOT ABOUT, GETTING CALLS ON, AND PERSONALLY SEEING FOR OURSELVES IS THESE AIR INJECTION SOLENOIDS HAVING ISSUES ON THE 06+ MODEL VEHICLES. REMEMBER THE AIR PUMP IS SUPPOSE TO ONLY RUN FOR A SHORT MOMENT UNDER START UP (IT INJECTS OXYGEN INTO THE EXHAUST TO BURN OFF THE EXCESS FUELING AT THE CATALYTIC CONVERTERS SO THEY WILL LITE OFF).    HERE YOU CAN SEE BOTH OF THESE BAD SOLENOIDS AND HOW GUMMED UP THEY'RE GETTING FROM EXHAUST GASES AND MOISTURE. THE CHECK VALVE GETS DAMAGED FORCING IT TO BE STUCK OPEN, WHICH CAUSES CONSTANT HOT EXHAUST GASES TO RUN THROUGH THESE PARTS, YOU CAN SEE THE SEAL ON THE PLUNGER IS LITERALLY DESTROYED FROM THE HEAT.    I REALLY HOPE SOA REALIZES THIS IS NOT AN ISSUE THAT'S GOING TO GO AWAY. IN THE LAST WEEK WE HAVE TAKEN 5 PHONE CALLS IN REGARDS TO THIS AND TODAY WE ARE FIXING A CUSTOMERS...WHICH IN TIME WILL HAVE THE SAME FATE AS HIS LAST ONES UNFORTUNATELY. HOPEFULLY SOA STEPS UP AND HAS A REVISION AND/OR COMPENSATION (WARRANTY) IN PLACE FOR THIS ISSUE IN NEAR FUTURE. SUBARU CURRENT WARRANTY REBUTTAL IS THEY CLAIM THESE PARTS ARE NOT AN \"EMISSIONS\" RELATED COMPONENT BUT IT CLEARLY IS AND THEY NEED TO ADMIT TO IT AND FIX THIS ISSUE.    SUBARU OWNERS NEED HELP AND SHOULD GET REFUNDS FOR THE COSTS OF REPAIRS THUS FAR!  *TR",
        "vin": "JF1SG69638G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455558,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU FORESTER. THE CONTACT STATED THAT THE VEHICLE EXHIBITED AN ABNORMALLY STRONG GASOLINE FUEL ODOR WHILE PARKED.  THE CONTACT HAD NOT NOTICED A LEAK. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE FUEL PUMP HOUSING GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 25,300 AND THE CURRENT MILEAGE WAS 34,399... UPDATED 05/09/12 *BF    THE DEALER REPLACED THE FUEL PUMP HOUSING GASKET AND EVAP CANISTER. UPDATED 05/31/12",
        "vin": "JF1SG63618H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2012",
        "dateOfIncident": "02/29/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453285,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR IN MAY OF 2008. ON FEB. 29, THE CHECK ENGINE LIGHT AND THE TRACTION CONTROL LIGHT CAME ON, AS WELL AS THE CRUISE CONTROL LIGHT STARTED FLASHING.  I THOUGHT, WHY? I'VE ONLY HAD IT FOR ALMOST 4 YEARS AND LESS THAN 50K MILES.  I CHECKED MY OWNER'S MANUAL, AND THE COVERED WARRANTY IS 5 YRS/ 50K MILES, WHICHEVER COMES FIRST.  I BROUGHT IT TO  THE DEALERSHIP WHERE I HAD BOUGHT THE CAR FROM AND AN EMPLOYEE SAID THAT IT IS MORE THAN LIKELY COVERED BY WARRANTY.  ON MARCH 7TH, 2012, I LEFT MY CAR AT THE DEALERSHIP FOR DIAGNOSIS.  THEY CALLED ME BACK, AND INFORMED ME THAT IT IS NOT COVERED UNDER WARRANTY, BECAUSE CA EMISSION WARRANTY IS 3 YRS/50K MILES WHICHEVER COMES FIRST.  I TOLD THEM THAT THE OWNER'S MANUAL SUGGESTS THAT THE WARRANTY IS 5 YRS/50K MILES.  THE DIAGNOSIS CODES WERE P2441 AND THAT NOT ONLY I SPENT $138 ON DIAGNOSIS, THE TOTAL COST TO REPAIR IT IS $1305.  I DECLINED THE REPAIR, BECAUSE I, FOR ONE CANNOT AFFORD IT AT THIS TIME, BECAUSE I AM ON DISABILITY.  I THOUGHT THAT THEY SHOULD HONOR SUBARU'S WARRANTY.  I CHECKED VARIOUS SUBARU MESSAGE BOARDS, AND I AM NOT THE ONLY ONE WITH THE SAME PROBLEM.  A KNOWN SUBARU SPECIALIST IN OUR AREA ALSO POSTED ON A MESSAGE BOARD THAT THEY'VE GOTTEN NUMEROUS CALLS ABOUT THE SAME PROBLEM.  THEY TOOK PICTURES AND SENT IT TO SUBARU.  AS OF RIGHT NOW, WE HAVEN'T HEARD ANYTHING FROM SUBARU ABOUT ANY RECALLS. I THINK IT SHOULD BE RECALLED. THANK YOU FOR YOUR TIME. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374789,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE THE CONTACT WAS SEATED IN THE FRONT PASSENGER SEAT THE AIR BAG DEACTIVATION  LIGHT ON THE DASHBOARD ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN CHECKED THE SENSORS AND STATED THAT IT WAS SET TO THE APPROPRIATE WEIGHT ACCORDING TO MANUFACTURERS SPECIFICATIONS. THE DEALER INFORMED THE CONTACT THAT THERE WAS NOTHING THEY COULD DO AND SUGGESTED THAT THE CONTACT SIT IN THE BACK SEAT. THE CONTACT STATED THAT SHE HAD TO PLACE WEIGHTS ON THE SEAT IN ORDER FOR THE AIR BAG TO BE ACTIVATED WHENEVER SHE RIDES IN THE VEHICLE. THE MANUFACTURER WAS CONTACTED AND STATED THAT THEY COULD NOT OFFER ANY ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 13,000.",
        "vin": "JF1SG66648H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/31/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323377,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE DRIVING 7 MPH, THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT ENGAGED THE BRAKES BUT THE VEHICLE WOULD NOT SLOW DOWN. HE SHIFTED INTO NEUTRAL AND ALTHOUGH THE RPMS INCREASED, IT EVENTUALLY IDLED BACK TO NORMAL. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THERE WERE NO FAILURES FOUND WHEN THE VEHICLE WAS INSPECTED. THE CONTACT HAD NOT CALLED THE MANUFACTURER DIRECTLY WHEN THE COMPLAINT WAS FILED. HE STATED THAT THE DEALER CALLED THE MANUFACTURER REGARDING THE FAILURE. THE DEALER LATER FOUND THAT THE FLOOR MATS WERE NOT ANCHORED TO THE HOOKS. THE CURRENT AND FAILURE MILEAGES WERE 16,228.     UPDATED 06/03/10*BF  THE CONSUMER HE WAS STARTING TO TRAVEL A STEEP, NARROW ROAD WHEN THE ENGINE STARTED TO RACE WITHOUT STEPPING ON THE GAS PEDAL. HE STEPPED ON THE BRAKE, BUT NOTHING HAPPENED. HE PUT THE GEAR IN NEUTRAL AND IT RACED FOR A WHILE, THEN RETURNED TO NORMAL. UPDATED 06/09/10.*JB",
        "vin": "JF1SG63698H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "03/23/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306523,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE DRIVING APPROXIMATELY 5 MPH OUT OF A PARKING SPACE THE CONTACT NOTICED THAT THE VEHICLE SUDDENLY ACCELERATED AND THE BRAKES FAILED. IN ORDER TO STOP THE VEHICLE THE CONTACT WAS FORCED TO SHIFT INTO NEUTRAL GEAR. THE DEALERSHIP INFORMED THE CONTACT THAT THE FAILURE COULD NOT BE REPRODUCED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 37959.  UPDATED 03/10/10. *LJ  UPDATED 07/07/10",
        "vin": "JF1SG63688H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305487,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU FORESTER  THE DRIVE BY WIRE ACCELERATOR SYSTEM SURGES BETWEEN ACCELERATION AND DECELERATION WHEN ONE TRIES TO HOLD A STEADY HIGHWAY SPEED. THIS IS TRUE WHETHER IT IS BEING CONTROLLED MANUALLY OR IF CRUISE CONTROL IS ENGAGED. IT ALSO ACCELERATES IN CRUISE CONTROL WHEN GOING DOWNHILL. SUBARU HAS MADE AN IMPROVEMENT IN THE COMPUTER ENGINE CONTROL MECHANISM FOR THE LEGACY MODEL BUT HAVE IGNORED THE FORESTER CUSTOMERS. ALL DEALERSHIPS ARE AWARE OF THE PROBLEM FROM CUSTOMER COMPLAINTS BUT DO NOT HAVE A REMEDY FROM SUBARU. *TR",
        "vin": "JF1SG65668H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/15/2010",
        "dateOfIncident": "12/25/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299881,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU FORESTER. WHILE BACKING INTO A DRIVEWAY AT 5 MPH IN REVERSE THE VEHICLE ACCELERATED AND CRASHED INTO ANOTHER VEHICLE. THE VEHICLE WAS ABLE TO BE DRIVEN. NO ONE WAS INJURED AND THE POLICE WERE NOT NOTIFIED. THERE WAS DAMAGE TO THE REAR BUMPER. THE VEHICLE WAS TAKEN TO THE DEALER; HOWEVER, AFTER A DIAGNOSTIC TEST THEY WERE UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. A CLAIM WAS FILED WITH THE SUBARU MANUFACTURER WHO STATED THAT THEY WOULD SEND A FIELD AGENT TO INSPECT THE VEHICLE.  THE FAILURE MILEAGE WAS 13,838.  UPDATED 2/17/10 *CN  UPDATED 02/22/10.",
        "vin": "JF1SG63688H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/18/2009",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288826,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"FLOATING AROUND\" FLOOR MAT PROBLEM ON MY  2008 SUBARU FORESTER.    I BOUGHT MY FORESTER IN DECEMBER OF 2007. WITHIN A COUPLE OF WEEKS THE MATS STARTED TO SLIDE AROUND THE FLOOR AND HAVE BUNCHED-UP UNDER THE PEDAL CLUSTER. I AM CAREFUL TO REPOSITION THEM.     WHAT HAPPENED IS THAT THE HUNDREDS OF RUBBER TABS ON THE BOTTOM OF THE 4 MATS STARTED TO FALL OFF. THIS IS ON ALL FOUR MATS. SUBARU TOLD ME THIS WAS NOT COVERED BY WARRANTY.     I READ ABOUT A SIMILAR PROBLEM WITH TOYOTA AND I UNDERSTAND THAT TOYOTA HAS AN OWNERSHIP INTEREST IN SUBARU. PERHAPS THEY USE THE SAME VENDOR TO SUPPLY FLOOR MATES IN THE USA.    I KNOW THIS IS DANGEROUS. MY CAR IS STILL UNDER THE NEW CAR WARRANTY, SO I AM NOT LOOKING FOR SOMETHING FOR NOTHING. MY BET IS OTHERS HAVE THIS PROBLEM TOO.    LIKE I SAID IT AFFECTS ALL FOUR MATS, AND MY BACK SEATS ARE RARELY USED, SO IT MUST BE THE MATS.    MY CAR HAS 22,000 MILES.    THANK YOU *TR",
        "vin": "JF1SG63688H"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "09/15/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284208,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BEARINGS AND HUB ASSEMBLY  -  ROAD NOISE FROM REAR OF AUTO 65K MILES, CHANGED TO NEW TIRES 70.5K ROAD NOISE CONTINUED FROM REAR, HAD THE CAR EXAMINE BY SUBARU TECHNICIAN 71K AND ESTIMATE BEARINGS AND HUB ASSEMBLY LIKELY PITTED OR SCORNED. *TR",
        "vin": "JF1SG63698H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2009",
        "dateOfIncident": "08/27/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282835,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE PROBLEM WITH MY 2008 SUBARU FORESTER. WHEN I QUICKLY TURN STEER WHEEL FOR CHANGING LANE, THE CAR SEEMS LOST CONTROL AND CAN ONLY GO ALL THE WAY TO THE LEFT. THEN WHEN YOU HAVE TO TURN THE STEER WHEEL TO THE RIGHT TO RETURN STRAIGHT, THE CAR WOULD GO ALL THE WAY TO THE RIGHT. I HAVE TO KEEP THIS BALANCE UNTIL THE CAR TURN ITSELF OFF. IT HAPPENS TO ME TWICE. ONE TIME IS ON A BRIDGE, ONE TIME IS ON THE BUSIEST INTERSTATE HIGHWAY 95. I FEEL EXTREMLY LUCKY EITHER TIME. I AM STILL ALIVE AND DID NOT KILL ANYBODY. BUT IS THAT NORMAL FOR A SUBURA ALL WHEEL DRIVE? *TR",
        "vin": "JF1SG676X8H"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/15/2008",
        "dateOfIncident": "11/13/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224601,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU FORESTER.  THE VEHICLE DOES NOT HAVE A KEY HOLE ON THE LIFTGATE OR PASSENGER SIDE DOOR.  IN THE EVENT OF AN ELECTRICAL SYSTEM FAILURE, THERE IS NO WAY TO OPEN THE TRUNK.  THERE HAD BEEN NO FAILURE TO DATE.  THE VIN AND POWERTRAIN WERE UNKNOWN.  THE CURRENT MILEAGE WAS 2,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "02/22/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218920,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED FACING DOWNWARDS ON A STEEP HILL .  AFTER ABOUT 1 1/2 HRS. RETURNED TO MY NEW 2008 SUBARU FORESTER LL BEAN WITH LESS THAN 610 MILES AND FELT SOMETHING WRONG WITH THE BRAKE--IT WAS FLAT ON THE FLOOR.  THE CAR PICKED UP SPEED (TWO SUCCESSIVE 15% GRADE HILLS); I BRAKED, DOWN SHIFTED AND COULD NOT SLOW THE CAR DOWN.  TO AVOID HITTING A CAR IN FRONT OF ME, I DROVE INTO THE ONCOMING TRAFFIC LANE.  LUCKILY THERE WAS NO ONCOMING TRAFFIC.   AFTER A TERRIFYING RIDE FOR OVER HALF A MILE, ENDED UP HITTING TWO CURBS,  STREET SIGN, FIRE HYDRANT  & ENDED UP IN A SOGGY MEADOW.  LOTS OF DAMAGE TO CAR BUT MY PASSENGER AND I GOT AWAY WITHOUT A SCRATCH.   AFTER THE CRASH THE BRAKE WAS NO LONGER ON THE FLOOR.   HOWEVER, THE CAR HASN'T BEEN DRIVEN FOR A ROAD TEST BECAUSE WE ARE STILL AWAITING PARTS TO COME FROM JAPAN.   HAVE YOU HEARD OF ANY RECENT INCIDENTS INVOLVING TOTAL BRAKE FAILURES ON LATE MODEL SUBARUS?  *TR",
        "vin": "JF1SG67658H"
    }
]