[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/07/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455554,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "PT. Multistrada Arah Sarana, Tbk",
                "productMake": "MILESTAR",
                "productModel": "MS932 ALL-SEASON RADIAL",
                "productYear": "9999",
                "size": "255/55R18 109V",
                "type": "Tire"
            }
        ],
        "summary": "255/55R18 After 2 weeks of driving on new tires my tire light would not turn off. I have taken my vehicle back to dealer to repair issue multiple times only to have the same thing happen. After 1 year of driving on this tire the sidewalls are cracked to the point the DOT# is illegible. Tires should last longer than 7500 miles and 1 year. I have attempted to have the place of business I made the purchase from fix the issue with no luck. They said if the tire is not on the \"Recall\" list they would do nothing.",
        "vin": "4S4WX92D684"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455185,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru B9 Tribeca. The contact stated that while driving approximately 70 MPH, the front hood erroneously opened and slammed into the front windshield causing the windshield to shatter. The cause of the failure was not determined. The manufacturer was notified of the failure and the contact was informed that the vehicle was not included in the NHTSA Campaign Number: 16V060000 (Structure, Latches/Locks/Linkages). The contact indicated that the vehicle had experienced the failure listed in the recall. The local dealer was not notified of the failure. The failure mileage was 93,507.",
        "vin": "4S4WX97DX84"
    },
    {
        "components": "AIR BAGS,STRUCTURE,LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184706,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH ON THE FRONT HOOD IS BROKEN IT WILL NOT CLOSE AND WHEN I DRIVE ON THE INTERSTATE GOING TO WORK I FEEL LIKE THE HOOD IS GOING TO FLY OPEN.  ALSO THE GAS DOOR LATCH IS BROKEN AS WELL IT WILL NOT OPEN WHEN YOU PULL THE GAS DOOR LATCH.  I WAS TOLD BY CREDIT KARMA THAT THE DRIVER AND PASSENGER AIR BAG ARE BOTH DEFECTIVE IN MOTION ON CITY AND HIGHWAY STREET",
        "vin": "4S4WX98D084"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "06/09/2018",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101199,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU TRIBECA. WHILE THE VEHICLE WAS PARKED, THE CONTACT OBSERVED SMOKE COMING FROM THE FRONT DRIVER'S SIDE OF THE VEHICLE. THERE WERE NO FLAMES VISIBLE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE, BUT WAS UNABLE TO DETERMINE THE SOURCE OF THE FAILURE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC AND IT WAS DIAGNOSED THAT THE WIRING TO THE DRIVER'S SIDE PUDDLE LIGHT HAD OVERHEATED AND WAS BURNT. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V602000 (EXTERIOR LIGHTING), ALTHOUGH THE CONTACT INDICATED THAT THE VEHICLE HAD EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 134,000.",
        "vin": "4S4WX92D484"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2018",
        "dateOfIncident": "06/09/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100802,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND WENT TO PARK MY CAR, NOTICE THERE WAS SMOKE COMING FROM THE PASSENGER SIDE WHERE THE SEAT IS. I LOOKED UP FOR ANY RECALLS AND THERE WAS A RECALL FOR MY CAR 2008 SUBARU TRIBECA FOR EXTERIOR PUDDLE LIGHT THAT MAY CAUSE SMOKE OR FIRE IF THE WIRING IS EXPOSED TO CERTAIN MOISTURE. I ENTERED MY VIN NUMBER IN THE RECALL AND IT'S NOT LISTED. COULD MY CAR STILL HAVE THIS RECALL?",
        "vin": "4S4WX92D484"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "01/21/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003850,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS SHAKING AT A SPEED OF 60 MILES. AFTER TAKING IT TO CHECK IN SEATTLE'S CARTER SUBARU WASHINGTON FIVE TIMES, THE CAR BECAME VIBRATING AT A SPEED OF 40 MILES. A DAY AFTER IT DEPARTURE, IT WAS SHIPPED TO TAMPA FLORIDA BECAUSE OF MY UNIVERSITY. UPON RECEIPT THE CAR WAS OIL-FREE, AND ALL THE SAFETY LIGHTS WERE CAUGHT. THE CAR STARTED TO VIBRATE, AND THERE WAS NO LONGER ENOUGH CAPACITY TO PUSH AND THE TIRES BEGAN TO FALL. MASTRO SUBARU REFUSED TO FIX THE PROBLEM EXCEPT BY PAYING MONEY. AFTER RESEARCH, I DISCOVERED THAT THIS CAR IS NOT THE ONLY ONE AND THAT THIS IS A COMMON PROBLEM IN ALL CARS OF THIS TYPE. THE PROBLEM IS THAT THERE IS MANY RECALLS IN THIS CAR ONE OF THEM IT IS (VDC) VEHICLE DYNAMIC CONTROL. NOW THE CAR SO DANGEROUS TO DRIVE, I PARKED THE CAR AND NO MONEY TO DO ANYTHING. PLEASE I NEED HELP , I HAVE THREE KIDS.",
        "vin": "4S4WX92D984"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000895,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU TRIBECA. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V358000 (AIR BAGS) WAS RECEIVED IN JUNE OF 2016. AFTER CONTACTING THE DEALER (PALM SPRINGS SUBARU IN PALM SPRINGS, CALIFORNIA) AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4WX93D084"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967903,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "4S4WX92D584"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2017",
        "dateOfIncident": "03/05/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959075,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE 95 APPROXIMATELY 65 MPH, THE HOOD SUDDENLY OPENED CAUSING DAMAGE TO THE HOOD, ROOF AND SHATTERING THE WINDSHIELD COVERING MYSELF WIFE AND KIDS WITH GLASS.  I COULD NOT SEE, BUT WAS ABLE TO BRING THE CAR TO A CONTROLLED STOP IN THE BREAK DOWN LANE.  I SUBSEQUENTLY FOUND OUT ABOUT THE HOOD LATCH RECALL.  I HAVE BEEN IN CONTACT WITH SUBARU AND MY INSURANCE COMPANY.",
        "vin": "4S4WX97D684"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954493,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I RECEIVED NOTICE AUGUST 2016 THAT MY PASSENGER SIDE TAKATA AIRBAG WAS BEING RECALLED. IN THE EVENT OF A CRASH NECESSITATING DEPLOYMENT OF THE FRONT AIR BAGS, THESE INFLATORS MAY RUPTURE DUE TO PROPELLANT DEGRADATION OCCURRING AFTER LONG-TERM EXPOSURE TO ABSOLUTE HUMIDITY AND TEMPERATURE CYCLING. AN INFLATOR RUPTURE MAY RESULT IN METAL FRAGMENTS STRIKING THE VEHICLE OCCUPANTS RESULTING IN SERIOUS INJURY OR DEATH. . . . I HAVE NOT BEEN ABLE TO HAVE A FRONT PASSENGER IN MY FAMILY VEHICLE SINCE THIS NOTICE AND IT HAS NOW BEEN 7 MONTHS!! I NEED THIS VEHICLE FIXED FOR A FAMILY VACATION THIS YEAR. THIS LONG OF A WAIT IS COMPLETELY RIDICULOUS AND I AM BEYOND DISAPPOINTED AS TO HOW THIS RECALL HAS BEEN DEALT WITH!!",
        "vin": "4S4WX92D884"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937962,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU TRIBECA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V359000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4WX92D984"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/02/2016",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929653,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU B9 TRIBECA. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V358000 (AIR BAGS) WAS RECEIVED. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PART NEEDED FOR THE RECALL REMEDY WAS STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4WX90D784"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894356,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU TRIBECA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V359000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4WX92D984"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892487,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU B9 TRIBECA. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V359000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4WX93D984"
    },
    {
        "components": "AIR BAGS,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892646,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU TRIBECA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V359000 (AIR BAGS) AND 16V060000 (LATCHES/LOCKS/LINKAGES, STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4WX91D084"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823097,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED, THE HOOD SPONTANEOUSLY OPENED, SMASHING THE WINDSHIELD AND COMPLETELY OBSTRUCTING MY VIEW.  THE MAIN LATCH AND SECONDARY SAFETY LATCH APPEAR TO HAVE BEEN STUCK, KEEPING THE HOOD CLOSED BUT NOT SECURELY LOCKED.",
        "vin": "4S4WX97D184"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568359,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE OUTSIDE TEMPERATURE DIPS BELOW 20 DEGREES F, THE BRAKES FAIL TO WORK. THIS HAS HAPPENED 5 TIMES NOW IN THE YEAR 2014.   THIS HAS HAPPENED EACH TIME MY CAR HAS SAT OUT IN THE COLD TEMPERATURES (<20 DEGREES) FOR 8 HOURS (WHILE AT WORK).  WHEN PULLING OUT OF MY SPACE IN THE OUTDOOR PARKING GARAGE, MY BRAKE PEDAL BECOMES HARD AND I AM UNABLE TO DEPRESS IT.  MY CAR WILL NOT STOP.  APPLYING HARD PRESSURE SLOWS IT DOWN.  THIS HAS HAPPENED ON DRY PAVEMENT.  I ONCE HAD TO USE THE EMERGENCY BRAKE TO STOP.  IT HAS ALSO OCCURRED ONCE AFTER I WAS OPERATING THE CAR FOR AT LEAST 15 MINUTES.  I HAVE HAD THE CAR TO THE DEALERSHIP TWICE IN THE LAST 3 MONTHS SINCE THIS STARTED.  EACH TIME THEY ARE UNABLE TO DUPLICATE THE PROBLEM AND CANNOT FIND ANYTHING WRONG.  I HAVE ALSO EMAILED SUBARU CUSTOMER SERVICE AND THEY STATED THE DEALERSHIP WOULD HAVE TO DUPLICATE THE BRAKE PROBLEM IN ORDER TO FIX IT.  THIS IS A HUGE SAFETY CONCERN; NOT TO MENION I HAVE 2 SMALL CHILDREN TRAVELING IN THE CAR WITH ME.  NO ONE SEEMS THAT WORRIED ABOUT IT BUT ME.  IT IS ALL OVER INTERNET CAR FORUMS THAT THIS HAPPENS WITH SUBARU BRAKES WHEN THE TEMPERATURES DIP.   THE DEALERSHIP AND SUBARU CLAIM THEY HAVE NOT HEARD OF THIS PROBLEM.  I AM EXTREMELY FRUSTRATED WITH SUBARU.",
        "vin": "4S4WX91D284"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493805,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING OUT OF GARAGE DURING COLD WEATHER BELOW FREEZING, STEPPED ON BRAKE PEDAL AND NO RESPONSE FROM THE BRAKE SYSTEM.  WAS UNABLE TO STOP CAR UNTIL I PUMPED BRAKES FRANTICALLY MANY TIMES.    LEFT CAR OUT DURING BELOW FREEZING WEATHER 2 MORE TIMES, SAME PROBLEM--NO BRAKES.  VACUUM ASSIST FOR BRAKES WOULD NOT WORK IN BELOW FREEZING WEATHER.    TOOK CAR TO SUBARU DEALER, ALL 3 VACUUM HOSE BRAKES REPLACED.  DEALER STATES THAT EACH HOSE HAS A CHECK VALVE IN IT FOR THE VACUUM SYSTEM.  FORTUNATELY WE DISCOVERED THIS PROBLEM AT A VERY LOW RATE OF SPEED.  NO VACUUM ASSIST FOR THE BRAKES MAKES THIS CAR VIRTUALLY UNSTOPPABLE AT ALMOST ANY SPEED.  WHAT IF IT WOULD HAVE BEEN ON A MOUNTAIN ROAD??  DEATH WOULD BE EMINENT.  I FEEL THIS SHOULD BE UNDER RECALL BEFORE SOMEONE IS KILLED OR MAIMED.  *TR",
        "vin": "4S4WX90D084"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2013",
        "dateOfIncident": "01/04/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491510,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STARTED TO MAKE WEIRD NOISES THEN WE LOST POWER STEERING.  *TR",
        "vin": "4S4WX97D284"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2012",
        "dateOfIncident": "12/25/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490097,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 SUBARU TRIBECA WITH MY FAMILY IN THE CAR ON I-70 EAST NEAR BALTIMORE IN THE MIDDLE LANE WHEN THE HOOD OF THE CAR OPENED SMASHING INTO THE WINDSHIELD. BOTH THE HOOD AND THE WINDSHIELD WERE DAMAGED. THE INCIDENT HAPPENED 35 MINUTES AFTER THE START OF THE TRIP.  THERE WERE NO BUMPS ON THE ROAD AND NO OTHER VEHICLES WERE INVOLVED IN THE INCIDENT. THE HOOD WAS LAST OPENED BY A SUBARU MECHANIC DURING AN OIL CHANGE ABOUT 2 MONTHS PRIOR TO THE INCIDENT. NO SIMILAR PROBLEMS OCCURRED PRIOR TO THE INCIDENT. THERE WAS NO INDICATION THAT THE HOOD WAS NOT PROPERLY CLOSED. FURTHERMORE, THE SECOND SAFETY LATCH DIDN'T APPEAR TO HAVE WORKED EVEN IF THE FIRST GAVE WAY. SUBARU WAS CONTACTED AND I WAS TOLD THIS WAS AN INSURANCE ISSUE AS THEY CLAIMED THERE WERE NO RECALLS (EVEN THOUGH I INSISTED THAT NO RECALLS WAS NO INDICATION THAT THIS WAS NOT EITHER A MANUFACTURING OR A DESIGN DEFECT.  *TR",
        "vin": "4S4WX93D584"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/2012",
        "dateOfIncident": "06/30/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464831,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ACCIDENT OCCURS IN QUERETARO, MX.  I WAS DRIVEN IN A SECONDARY ROAD AND SUDDENLY MY SUBARU TRIBECA 2008 TURNED RIGHT AND FOR A WHILE I LOSE THE CONTROL.  AFTER FEW SECONDS I COULD DRIVE MY CAR FORWARD AND STOPPED IT OUTROAD.  THE SPECIALIZED ANALYSIS DETERMINED THAT THE LEFT  LATERAL LINK WAS BROKEN.   THIS LATERAL LINK WAS REPLACED IN MARCH 2012 BECAUSE ANOTHER ACCIDENT IN WHICH THE REAR LEFT SUSPENSION WAS BROKEN AND ALL PIECES THAT COMPOUND THE REAR SUSPENSION WERE REPLACED TOO.    THE AGENCY IS WAITING FOR A NEW LATERAR LINK AND I'M WORRIED ABOUT THE QUALITY OF THE PIECE.  FORTUNATELY THIS ACCIDENT DON'T PRODUCE FATAL VICTIMS.  BUT IT COULD... *TR",
        "vin": "4S4WX99DX84"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/18/2012",
        "dateOfIncident": "06/15/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462031,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS AROUND 8:00PM. I WAS DRIVING IN LIGHT TRAFFIC AROUND 25 MPH HEADING WEST ON ALONDRA BL CROSSING DOWNEY AVE IN THE CITY OF PARAMOUNT, WHEN ALL OF A SUDDEN I HEARD SCREECHING AND THE REAR OF THE CAR STARTED SWAYING SIDE TO SIDE. I STEPPED ON THE BREAKS AND THE REAR END OF THE CAR STARTED TURNING TO THE LEFT GOING IN TO THE LEFT LANE. CARS ON THE LEFT LANE HAD TO SLAM ON THE BREAKS TO AVOID COLLIDING WITH ME. I WAS ABLE TO SLOWLY PULL OVER TO THE SIDE OF THE ROAD. I CALLED A MECHANIC, AFTER INSPECTING THE CAR HE INFORMED ME THAT THE SUSPENSION CONTROL ARM ON THE REAR DRIVER SIDE BROKE. HE ALSO SAID IT COULD HAVE BEEN A LOT WORST IF I WAS GOING FASTER, I CAN ONLY IMAGINE WHAT THE CONSEQUENCES COULD HAVE BEEN IF I WAS DRIVING ON THE FREEWAY. I GOOGLED RECALL 20250XA060 (PART NUMBER). I DON'T SPEAK PORTUGUESE BUT IT LOOKS TO ME LIKE THAT PART HAS BEEN RECALLED IN BRAZIL. *TR",
        "vin": "4S4WX97D584"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/23/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323319,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU TRIBECA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, THE VEHICLE BEGAN TO SHAKE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE SHE WAS INFORMED THAT THE WHEEL BEARINGS NEEDED TO BE REPLACED. THE FAILURE HAS NOT RECURRED SINCE THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 13,524. THE CURRENT MILEAGE WAS APPROXIMATELY 13,800.",
        "vin": "4S4WX97D784"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/23/2009",
        "dateOfIncident": "01/28/2009",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266469,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU TRIBECA. WHILE DRIVING APPROXIMATELY 45 MPH ON A ROAD COVERED WITH SNOW AN EXCESSIVE AMOUNT OF STEAM EXPELLED FROM THE FRONT END OF THE VEHICLE. THE STEAM MADE IT DIFFICULT TO SEE AND THERE WAS A STRONG BURNING SMELL INSIDE OF THE VEHICLE. THE DRIVER WAS ABLE TO SHUT THE ENGINE OFF FOR A FEW MOMENTS, RESTART AND RESUME NORMAL OPERATION WITH CAUTION. UPON REACHING HIS DESTINATION AND INSPECTING UNDER THE HOOD HE OBSERVED THAT THE ENGINE COMPARTMENT EXHIBITED MASSIVE SNOW,THE BELTS AND RUBBER HOSES WERE BURNED. THE VEHICLE WAS NOT DRIVEN FOR THE REMAINDER OF THE WINTER MONTHS; YET, THE OWNER'S MANUAL INDICATED THE VEHICLE SHOULD NOT BE DRIVEN IN THE SNOW DUE TO THE SNOW ENTERING THE ENGINE COMPARTMENT. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION; HOWEVER, THERE WAS NO RESOLUTION. THE CONTACT IS AWARE OF THE SAFETY RISK. THE FAILURE MILEAGE WAS 4,700 AND THE CURRENT MILEAGE WAS 5,066.  UPDATED 05/11/09.  *LJ  UPDATED 05/11/09.*JB",
        "vin": "4S4WX92DX84"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250404,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE WRITING YOU OUT OF DESPERATION AS WE RECENTLY PURCHASED A 2008 SUBARU TRIBECA FROM CENTER SUBARU THAT WE CANNOT USE FOR FAMILY USE BECAUSE THE VEHICLE MAKES US ILL WHEN WE ARE IN IT.     TO GIVE YOU SOME BACKGROUND, WE NOTICED UPON TEST DRIVING THE VEHICLE THAT IT PRODUCED A  PRESSURE SENSATION IN OUR EARS WHILE DRIVING, BUT WE ATTRIBUTED IT TO THE WEATHER CONDITIONS THAT DAY AS IT WAS RAINING AND WE OFTEN EXPERIENCE ALLERGIES ON RAINY DAYS.  WE BROUGHT THIS FEELING WE WERE HAVING TO THE ATTENTION OF THE SALESMAN AND SALES MANAGER AT CENTER SUBARU AND THEY BOTH SAID THEY HAD NEVER HEARD OF THIS BEFORE AND THAT IT MIGHT BE CAUSED BY THE WRAPPING ON THE NEW VEHICLE.  SO CONVINCED THIS WAS NOT SOMETHING THAT COULD POSSIBLY BE BROUGHT ON BY A VEHICLE, WE PURCHASED THE VEHICLE AND THAT WAS THE BEGINNING OF OUR PROBLEMS.    UPON DRIVING THE VEHICLE THE FIRST WEEK OF OWNING IT OUR EARS CONTINUED TO WORSEN LEAVING US WITH A CONSTANT PRESSURE FEELING REDUCING OUR ABILITY TO HEAR AND FUNCTION PROPERLY.   WE BOTH NEEDED TO GET SOME RELIEF FROM THIS FEELING SO WE VISITED OUR DOCTOR WHO EXAMINED BOTH OUR NOSE AND EARS AND SAID THAT OUR EARS WERE INDEED BLOCKED AND WE WERE SUFFERING FROM EUSTACHIAN TUBE DYSFUNCTION BROUGHT ON BY AN ALLERGIC REACTION FROM SOMETHING WE HAD INHALED.  HE PRESCRIBED US BOTH NASAL SPRAYS TO HELP CLEAR THE CONGESTION OUT OF THE EARS AND TOLD US THAT THE ONLY WAY THE NASAL SPRAY WOULD TRULY HELP US WAS IF WE AVOIDED CONTACT WITH THE ALLERGEN.  FOR MYSELF THE PROBLEM HAS SUBSIDED AS I HAVE STAYED OUT OF THE VEHICLE SINCE PURCHASING IT, BUT FOR MY HUSBAND HE IS STILL SUFFERING AS HE HAS HAD TO DRIVE THIS VEHICLE TO AND FROM WORK SINCE WE ONLY HAVE TWO VEHICLES IN OUR HOUSEHOLD.  THIS THUS PROVING THAT THE VEHICLE IS THE SOURCE OF THE ALLERGEN.      DEALER & SUBARU ARE NOT HELPING CAN YOU PLEASE HELP US? *TR",
        "vin": "4S4WX92D584"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/15/2008",
        "dateOfIncident": "05/14/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242362,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 SUBARU TRIBECA. BOUGHT BRAND NEW AND NOW HAS APPX. 7500 MILES ON IT. FROM ABOUT THE 1,600 MILE MARK ON THE VEHICLE, IT HAS BEEN BURNING  1 QT. OF OIL EVERY 1,000 MILES. ENGINE PROBLEMS BECAUSE THERE ARE NO LEAKS UNDER THE CAR. *TR",
        "vin": "4S4WX92D684"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/12/2008",
        "dateOfIncident": "01/20/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217781,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE VEHICLE IS A 2008 SUBARU TRIBECA LIMITED 5-PASSENGER WITH REMOTE START.  THE VEHICLE WAS PURCHASE AT A PRIMARY SUBARU DEALER IN OUR LOCAL AREA, AS A DEMO WITH 1,500 MILES ON IT (MANAGER AT THE DEALER WAS DRIVING IT AT THE TIME).  THE VEHICLE AT FIRST DIDN'T MAKE ANY NOTICEABLE NOISES OR VIBRATIONS (SEEMED FACTORY NEW, FLAWLESS).  AFTER A MONTH OF NORMAL DRIVING A NOISE FROM THE PASSENGER SIDE SUSPENSION COMPONENTS OR UNDERCARRIAGE AREA WOULD MAKE A RUMBLING OR LOW SQUEAKING/RUBBING.  SHORTLY AFTER, I MADE IT CLEAR ON OUR 4,500 MILE OIL CHANGE SERVICE THAT THIS ISSUE WAS PRESENT AND WAS AFFECTING ME AS A CONSUMER TO ENJOY MY NEW CAR.  THE PROBLEM WAS ORIGINALLY OVERLOOKED BY ALL THE PERSONS I HAD ASKED TO TAKE A LOOK AT IT (DEALER MANAGER, USED CAR SPECIALIST AND SHOP MECHANIC) AFTER A SECOND ATTEMPT OF LEAVING THE VEHICLE AT THE DEALERSHIP FOR 2 DAYS, THEY DISCOVERED THE ISSUE I WAS TRYING TO EXPLAIN TO BE THE PROBLEM AND CAME BACK SAYING THE FOLLOWING.  THAT A NEW(WITH ZERO MILES) TRIBECA WITH SIMILAR TRIM AND PACKAGE WOULD MAKE THE SAME NOISE AS MY VEHICLE AS WELL AS ANOTHER USED TRIBECA THAT WAS ON THE LOT THAT THE MANAGER WAS DRIVING AS ANOTHER DEMO MODEL FOR THE DEALERSHIP.  THE NOISE WOULD OCCUR AT ANY SPEED AND ESPECIALLY WHEN THE BODY OF THE CAR WOULD MOVE OR SHIFT WEIGHT AND THE SUSPENSION COMPONENTS WERE DEMANDED.  TIMES AT WHICH THE NOISE WOULD OCCUR WERE THE FOLLOWING: SPEED BUMPS, TAKING TURNS, BACKING UP, PULLING AWAY FROM AN INTERSECTION ON A GREEN LIGHT WITH OR WITHOUT AGGRESSIVENESS.  AT THE TIME, NOTHING WAS DONE TO ELIMINATE THE NOISE OR THE CAUSE AND SOURCE OF THE ISSUE, OTHER THAN  LUBRICATE THE STRUT.  HOWEVER, WHEN IT RAINS, DUE TO THE MOISTURE WHICH CAUSES THE DAMPNESS IN THE PART(S) MAKING THE NOISE FOR SOME TIME UNTIL IT DRIES UP AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/20/2008",
        "dateOfIncident": "09/26/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215460,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 70 MPH ON THE RIGHT MOST NORTHBOUND LANE OF I-75 AT MILE MARKER 452 IN FLORIDA.  THE ROAD HAD BECOME WET FROM RECENT RAIN.  THE REAR OF MY CAR SUDDENLY STARTED FISHTAILING TO THE RIGHT.  THE FISHTAIL EVOLVED INTO FULL-BLOWN COUNTERCLOCKWISE SPINS WHICH TOOK THE CAR ALL THE WAY TO THE GUARDRAIL IN THE MIDDLE SHOULDER.  THE IMPACT RESULTED IN THE CAR BEING TOTALED.    I BELIEVE A DEFECT WITH THE ABS, ELECTRONIC STABILITY CONTROL SYSTEM OR THE ALL WHEEL DRIVE CAUSED THE ACCIDENT.  THE ROAD WAS PERFECTLY STRAIGHT, AND I DIDN'T APPLY THE BRAKES OR MAKE ANY SUDDEN STEERING CHANGES.      I REPORTED THE INCIDENT TO SUBARU AND ASKED FOR AN INVESTIGATION OF THE WRECKED CAR.  DESPITE THREE LETTERS AND A COMPLETE REPORT, THE COMPANY REFUSED TO INSPECT THE CAR.  *TR",
        "vin": "4S4WX92D184"
    }
]