[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441690,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a great suspicion that Kia has not only sold bad engined vehicles that are their own make and models but I believe they are selling used cars they buy like that as well. The car I bought has major engine problems that were hid from me at the time of the sales leading to a $5000 repair bill for a 7200$ car. I only had it for a couple weeks before it became un-drivable.  Not only did they hide and lie about fact in the sales of their own cars , I have evidence showing that they are doing the same to used cars they're selling. They are barely doing the bare minimum to fix anything. They have lied to AUTOCAP on record about facts as well when I have recordings or them telling me other wise.",
        "vin": "4S3BL616087"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434020,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU LEGACY. CONSUMER WRITES IN REGARDS TO ISSUES WITH FUEL PUMP.  THE CONSUMER STATED THAT THE VEHICLE WOULD TURN OVER, BUT WOULD NOT START. THE VEHICLE WAS TOWED TO THE DEALER WHO STATED THE  THE METAL OF THE PUMP HARNESS WAS SEVERLY BURNED AND MELTED DUE TO EXTREME HEAT. THE VEHICLE WAS REPAIRED. *JS",
        "vin": "99999999999"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/28/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430867,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a parasitic drain on my car battery. I have replaced the alternator and battery twice, and the car can’t hold a charge.",
        "vin": "4s3bl616287"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/08/2021",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420204,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The CV axle on the passenger side caught on fire.  It was the rubber boot on the inner side over the catalytic converter.  There were no warnings other than the smell of smoke.  Fortunately, I caught it early and put out the fire with a fire extinguisher.  I had been driving 25 to 40 MPH on city streets for about 5 miles before the incident.",
        "vin": "4S3BL856684"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/23/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418809,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Legacy. The contact stated while driving approximately 30-35 mph, the brake pedal went to the floorboard while depressed. The contact was concerned that the brake was failing with her husband and four-month-old baby in the vehicle. The contact veered to the shoulder and turned off the vehicle. The contact’s husband inspected the vehicle and saw that there was fluid dripping near the rear passenger’s side tire, below the fuel tank. The contact’s husband then drove the vehicle back to the residence. The manufacturer was made aware of the failure and informed the contact that the dealer had performed a recall repair on the brakes on January 22, 2021. The contact was informed that anti-corrosion wax was sprayed onto the brake line connectors as part of the remedy. The manufacturer referred the contact back to the same dealer where the vehicle was repaired under recall, to have the vehicle diagnosed. The vehicle was taken to the dealer and diagnosed that rodents had chewed the brake line and the brake line was not part of the recall repair. The vehicle was not repaired. The manufacturer was contacted and informed the contact that the vehicle was not repairable. The manufacturer offered a $ 1,000 voucher for a newer vehicle. The failure mileage was 76,877.",
        "vin": "4S3BL626487"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372899,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT STATED WHILE INSPECTING THE VEHICLE, HE BECAME AWARE OF CORROSION AROUND THE BRAKE LINE. THERE WAS FLUID LEAKING FROM THE BRAKE LINE. THE CONTACT STATED THAT WHILE DRIVING, THE BRAKE PEDAL FELT SOFT WHEN DEPRESSED. A DEALER WAS NOT CONTACTED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE HOWEVER, INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 14V311000 (SERVICE BRAKES, HYDRAULIC) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 183,000.",
        "vin": "4S3BL696X83"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366814,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AND TRYING TO BRAKE IT LOST THE ABILITY TO APPLY THE BRAKES ALMOST CAUSING AN ACCIDENT. AFTER FURTHER INSPECTION FOUND THIS WAS A RECALL FOR THIS VEHICLE. I CALLED THE MANUFACTURER AND THEY SAID IT WAS PERFORMED AND THEY COULD NOT DO ANYTHING FURTHER. THE EXACT AREA PERTAINING TO THE BRAKE LINES FAILING AS DESCRIBED IN THE RECALL IS WHERE IT HAS FAILED. THEIR IS NO EVIDENCE OF THE RECALL BEING PERFORMED AS THE REPAIR INDICATED SPRAYING THE VEHICLE WITH ANTI CORROSION SPRAY. IT DOES NOT APPEAR THAT WAS EVER DONE. THIS IS FOR THE BRAKE LINES IN THE PASSENGER REAR OF THE VEHICLE NEXT TO THE GAS TANK. RECALL NUMBER THEY SAY WAS COMPLETED IS WQK-47. RESEARCH SHOWS MANY OTHER PEOPLE HAVE THIS ISSUE STILL AND SUBARU HAS NOT REPAIRED THE VEHICLE AS IT SHOULD HAVE BEEN. THANK YOU",
        "vin": "4S3BL616386"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350930,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I SAW THE BRAKE LIGHT COME ON WHILE DRIVING ON CITY STREET, I TAPPED THE BRAKES LIGHTLY AND CHECKED IF MY EBRAKE WAS UP A FEW TIMES AND THE LIGHT WENT AWAY FOR A BIT BEFORE IT FINALLY STAYED ON WHILE DRIVING AFTER DOING THAT. I THOUGHT MAYBE IT WAS A SENSOR SINCE LIGHT TAPS AND BRAKING SEEMED FINE. I GUESS WHEN I WAS TAPPING AND TESTING THE BRAKES OVER AND OVER, I WAS JUST PUMPING ALL THE BRAKE FLUID OUT OF THE CORRODED BRAKE LINE IN THE BACK AND COULD BARELY STOP WHEN I ACTUALLY HAD TO USE THE BRAKES TO COME TO A COMPLETE STOP. THE BRAKE PEDAL WENT ALL THE WAY TO FLOOR AND I HAD TO ASSIST IN BRAKING WITH MY E-BRAKE AND ENGINE BRAKING INTO 1ST GEAR. WHEN I GOT UNDER THE CAR AND HAD SOMEONE PUMP THE BRAKES, I CAN SEE FLUID COME OUT OF A CORRODED HARD BRAKE LINE NEXT TO THE GAS TANK.  LOOKING ONLINE THIS IS ONE OF THE SPOTS WHERE 2 PREVIOUS RECALLS WERE ISSUED FOR BRAKE LINE CORROSION.  THE RECALLS WERE TAKEN CARE OF IN 11/2013 @~89K MILES AND 09/2014 @~97K MILES BY THE DEALER.  MY CAR IS CURRENTLY AT ~125K MILES AND HAS ONLY BEEN DRIVEN IN THE SUMMER FOR PAST FEW YEARS. IT LOOKS LIKE THE RECALL DOES NOT FIX THE ISSUE AND STILL CREATES A DANGEROUS DRIVING SITUATION.",
        "vin": "4S3BL676886"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331442,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR AND HAD COMPLETE LOSS OF BRAKES. VEHICLE HAS HAD ISSUES OR RANDOM CONSUMPTION OF BRAKE FLUID. PASSENGER REAR BRAKE PIPE BURST OPEN AND FAILED DUE TO CORROSION NOT ADDRESSED BY PREVIOUS RECALLS. SUBARU OF AMERICA WILL NOT HONOR REPLACEMENT AND SERVICES COST BECAUSE THE LEGACY MODEL IS NOT SPECIFIC TO THE RECALL AND OUT OF WARRANTY. SOA DID HONOR $350 CREDIT FOR REPAIRS THAT COST $1100.  *TR",
        "vin": "4S3BL696683"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298303,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RED AIRBAG INDICATOR IN INSTRUMENT CLUSTER BEGUN COMING ON/OFF ONCE OR TWICE A WEEK THEN BECAME CONSTANT. OBSERVED PASSENGER AIRBAG INDICATOR HAD NO LIGHTS ON(NO ILLUMINATION AT ALL) SEARCHED FORUMS AND FOUND MULTIPLE SIMILAR CASES WITH NO RESOLVE FROM THE DEALERSHIP.    AS A MECHANIC MYSELF I BEGAN MY OWN DIAGNOSIS,   CAUSE: REMOVED OVERHEAD CONTROL PANEL AND PERFORMED ELECTRICAL TESTING ON PASSENGER AIRBAG CIRCUIT. FOUND OPEN CIRCUITS BETWEEN COMPONENT CONTACTS.    CORRECTION: RETINNED CONTACTS AND ADDED SOLDER.    HAVEN'T HAD AN AIRBAG LIGHT SINCE THE REPAIR.. I HAVE HEARD THE DEALER WANTS 300+$ TO REPAIR. THIS IS SUCH A COMMON AND SERIOUS ISSUE THAT IT SHOULD BE CONSIDERED FOR A RECALL... I HAVE SEEN AND PERFORMED FAR MORE TRIVIAL RECALLS.    THAT SAID; IF YOU TAKE YOUR CAR TO A DECENT SUBARU OR INDEPENDENT SHOP THEY SHOULD BE ABLE TO DIAGNOSE THIS AND FIX IT FOR ALOT LESS THAN THE DEALER",
        "vin": "4S3BL696283"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297718,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 25 MPH AND WHEN ATTEMPTING TO PRESS THE BRAKE PEDAL, BRAKE FLUID BEGAN TO LEAK FROM THE VEHICLE. THE CONTACT STATED THEY WERE ABLE TO PARK THE VEHICLE SAFELY. THE CONTACT REFERRED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 14V311000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT TAKEN TO A LOCAL MECHANIC OR A DEALER FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 133,000.",
        "vin": "4S3BL676686"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290436,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH HAS MELTED LEAVING IT HARD TO SEE OUT OF THE WINDSHIELD. THE DASH IS ALSO EXTREMELY STICKY AND SHINY. I THOUGHT IT JUST NEEDED TO BE CLEANED BUT REALIZED SHORTLY AFTER THAT WAS NOT THE CASE AND HAVE SINCE FOUND THIS IS AN ISSUE WITH MY MAKE AND MODEL PER SUBARU.",
        "vin": "4S3BL616787"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289575,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS IN REFERENCE TO SUBARU RECALL WQK-47:    WHILE DRIVING VEHICLE, BRAKE INDICATOR ON DASHBOARD ILLUMINATED AND WITHIN A FEW MINUTES OF DRIVING, I COULD FEEL SOMETHING WAS A BIT DIFFERENT WITH THE BRAKE PRESSURE. WITHIN A FEW MOMENTS OF THAT WHILE ATTEMPTING TO STOP, I NOTICED THE PEDAL WENT ALL THE WAY DOWN TO THE FLOOR AND ON SUBSEQUENT PUMPS OF THE BRAKES I GOT SOME PRESSURE.  ATTEMPTING TO DRIVE THE VEHICLE FURTHER (SLOWLY), RESULTED IN VERY LITTLE, IF ANY, BRAKING POWER.  I CHECKED BRAKE FLUID RESERVOIR AND NOTICED IT WAS BELOW THE MIN MARK.  I HAD SOME BRAKE FLUID IN THE TRUNK AND FILLED IT.  I ATTEMPTED TO DRIVE THE VEHICLE A BIT FURTHER AND WAS ABLE TO RECOVER BRAKE FUNCTIONALITY FOR A FEW MORE MINUTES BEFORE THE SAME ISSUE OCCURRED.    THANKFULLY THIS WAS DONE WHILE ON A ROAD THAT HAD A LOW SPEED LIMIT AND THERE WEREN'T MANY VEHICLES AROUND.  LOSING BRAKE POWER WHILE ON A HIGHWAY FOR INSTANCE ON A TURN WOULD NOT HAVE BEEN AS GOOD.    I TOOK THE VEHICLE TO A DEALERSHIP WHERE THEY FOUND THAT THE RIGHT REAR LINE WAS LEAKING. I WENT IN TO LOOK AT THE VEHICLE AND INSPECTED THE FOUR-WAY CONNECTOR MENTIONED IN THE RECALL AS WELL AS THE LINE THAT RUNS NEAR THE FUEL TANK WHERE THE CLIP HOLDS ON TO IT.  THIS PART OF THE LINE IS EXPOSED JUST AS THE RECALL MENTIONS.    I NOTICED THAT THE 4-WAY CONNECTOR WAS COVERED SUFFICIENTLY IN THE WAX COMPONENT THAT THE RECALL MENTIONED SHOULD BE USED BUT THE AREA WHERE THE LEAK WAS DOES NOT APPEAR TO HAVE ANY WAX AT ALL    THE WORK FOR THE RECALL WAS PERFORMED IN OCTOBER 2018, SO A LITTLE OVER A YEAR LATER AND THE BRAKE LINE CORRODED THROUGH WHERE THE RECALL WORDING INDICATED IT COULD. IF THE LINES HAD BEEN SEALED AS INDICATED, PERHAPS THIS ISSUE WOULD NOT HAVE OCCURRED.    THE DEALERSHIP QUOTED $1300 TO REPLACE A SINGLE BRAKE LINE. ANOTHER CONCERN IS THAT IF THAT ONE LINE WAS CORRODED ENOUGH TO LEAK, THEN THE OTHERS COULD TOO.",
        "vin": "4S3BL676186"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232581,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DIES. I KNOW THERE IS A RECALL OUT THERE FOR THIS REASON BUT I'M TOLD THAT MY CAR IS NOT PART OF THIS RECALL BUT MY CAR IS DOING  EXACTLY WHAT THE RECAL IS TALKING ABOUT",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190972,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ON THE DASHBOARD COMES ON INTERMITTENTLY , BUT NOW STAYS ON THE MAJORITY OF THE TIME. TOOK CAR TO DEALER FOR PASSENGER AIRBAG RECALL AND THEY TOLD ME THE AIRBAG LIGHT ON THE DASH IS FAULT CODE 26. MANY OTHER SUBARU OWNERS REPORTING THIS EXACT SAME ISSUE, WHICH IS RELATED TO FAULTY SOLDERING OF COMPONENTS IN THE OVERHEAD MAP LIGHT CONSOLE. AS THIS IS A CRITICAL SAFETY ISSUE (PASSENGER AIRBAG MAY NOT DEPLOY IN AN ACCIDENT), SUBARU SHOULD ISSUE A RECALL TO REPAIR OR REPLACE THE FAULTY COMPONENT(S). BEWARE- SERIOUS SAFETY ISSUE. ALSO FEEL THAT THE TAKATA INFLATORS IS RELATED TO THEIS ISSUSE. I HAVE HAD THIS AIRBAG ISSUE SINCE I OWENED THE SUBARU COMPLAINED TO THE DEALERSHIP BUT I WOULD HAVE TO PAY FOR THE FIX WHEN I NO THAT THERE IS FAULT IN THE WAY THE COMPONENTS WERE WELDED.",
        "vin": "4S3BL626687"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183796,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD THE RECALL FOR BRAKES DONE & RECALL FOR AIR BAG, & CATALYTIC CONVERTER. NEVER RECIEVED POST CARD FOR ELECTRICL RECALL , HAD ALL KINDS OF WORK DONE & THE ENGINE LIGHT, CRUISE CONTROL,ETC WILL NOT TURN OFF. WHY HAVENT I RECIEVED RECALL NOTICE SO THAT I CAN BRING IT TO SUBARU DEALER,  THANK YOU   [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "4S3BL616587"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170679,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE REAR WINDOW DEFROST IS TURNED ON THE RADIO NO LONGER WORKS. I BELIEVE THIS TO BE A SAFETY CONCERN IN THE EVENT OF TRYING TO HEAR IMPORTANT BROADCASTS IN POOR WEATHER. THIS IS A WELL KNOWN ISSUE, BUT HAS BEEN POORLY ADDRESSED BY SUBARU. THIS AFFECTS MANY MODELS IN THIS YEAR RANGE. LEAVING THE CONSUMER TO PAY TO REPLACE A POORLY MADE PART TO REPEATEDLY OCCUR EVEN AFTER REPLACEMENT IN SOME CASES.",
        "vin": "4S3BL676284"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099062,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF MY DASH LIGHTS ARE ON (STATIONARY & IN MOTION) CRUISE CONTROL LIGHTS BLINKS CONSISTENTLY (STATIONARY & IN MOTION), MY CAR CRUISE CONTROL ALSO FEELS LIKE IT GOES ON AND OFF CONSTANTLY (IN MOTION), AND MY CRUISE CONTROLS ON MY STEERING DO NOT WORK (STATIONARY & IN MOTION) . ALSO MY RADIO IS CONSISTENTLY GOING ON/OFF, CHANGING STATIONS, VOLUME CONTROLS GO IN/OUT (STATIONARY & IN MOTION).  ALSO MY REVIEW MIRROR DISPLAYS THE WRONG DIRECTION ON THE COMPASS, AND THE AUTO DIM AND COMPASS FEATURE IT'S SELF GOES ON/OFF CONSISTENTLY (STATIONARY & IN MOTION). UNDER THE HOOD WILL SMOKE AFTER I'VE DRIVEN AT HIGHWAY SPEEDS, OR GONE UP STEEP HILLS.I READ ONLINE WHERE OTHER PEOPLE ARE HAVING THESE ISSUES WITH THEIR SUBARU LEGACY'S AND OUTBACKS AS WELL.  NOTE: THESE ISSUES HAPPEN CONSISTENTLY WITHOUT REGARD TO THE TYPE OF ROAD ON WITH THE EXCEPTION OF UNDER THE HOOD SMOKING. THAT ONLY HAPPENS AS DESCRIBED ABOVE.",
        "vin": "4S3BL626X87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "4S3BL696083"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034212,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"",
        "vin": "4S3BL856384"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032890,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SUBURBAN SUBARU (14 HARTFORD TURNPIKE, VERNON, CT) DIAGNOSED THAT AN AIR BAG SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND PROVIDED CASE NUMBER: 1-27240483127. THE FAILURE MILEAGE WAS 110,099.",
        "vin": "4S3BL616387"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969734,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A NOTICE IN DECEMBER 2016 THAT MY PASSENGER AIRBAG HAD A RECALL AND THAT THERE WERE PLENTY OF PARTS SO I COULD CALL MY SUBARU DEALER AND HAVE THEM FIX IT. I DID CALL THEM AND THEY SAID THAT THEY DID NOT HAVE PARTS YET AND THAT IT WOULD BE A FEW WEEKS AND THEY WOULD CALL ME TO MAKE AN APPOINTMENT. I CALLED AGAN TODAY, 3/31/17 AND I GOT THE SAME STORY THAT THEY WON'T HAVE PARTS FOR A FEW WEEKS AND THAT THEY WILL CALL ME. I MENTIONED THAT I HAD ALREADY HEARD THAT THREE MONTHS AGO AND SHE SAID THAT IT WAS BECAUSE OF TAKATA AND THERE WAS NOTHING THEY COULD DO. THIS IS A RIDICULOUS AMOUNT OF TIME FOR ME TO BE EXPECTED TO NOT BE ABLE TO USE MY CAR, OR TO DRIVE A POTENTIALLY DANGEROUS VEHICLE. THE FIRST TIME I CALLED THEY SAID I MIGHT BE PROVIDED WITH A RENTAL CAR BUT EVERY ONE I TALKED TO SAID IT WAS FINE TO DRIVE MY CAR. IT IS ONLY FINE TO DRIVE IT IF I DO NOT END UP IN A WRECK THAT CAUSES THE AIRBAGS TO GO OFF, WHICH IS NOT SOMETHING THAT A PERSON CAN REALLY PLAN FOR. SUBARU HAS NOT BEEN ABLE TO FIX THIS PROBLEM IN A TIMELY MANNER LIKE THEY SAID THEY WOULD.",
        "vin": "4S3BL616687"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875808,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ON THE DASHBOARD COMES ON INTERMITTENTLY , BUT NOW STAYS ON THE MAJORITY OF THE TIME.  TOOK CAR TO DEALER FOR PASSENGER AIRBAG RECALL AND THEY TOLD ME THE AIRBAG LIGHT ON THE DASH IS FAULT CODE 26. MANY OTHER SUBARU OWNERS REPORTING THIS EXACT SAME ISSUE, WHICH IS RELATED TO FAULTY SOLDERING OF COMPONENTS IN THE OVERHEAD MAP LIGHT CONSOLE. AS THIS IS A CRITICAL SAFETY ISSUE (PASSENGER AIRBAG MAY NOT DEPLOY IN AN ACCIDENT), SUBARU SHOULD ISSUE A RECALL TO REPAIR OR REPLACE THE FAULTY COMPONENT(S).  BEWARE- SERIOUS SAFETY ISSUE.",
        "vin": "4S3BL616187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873409,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY, I RECEIVED A RECALL NOTICE REGARDING THE PASSENGER SIDE AIR BAG. THE NOTICE MENTIONED A PARTS SHORTAGE, AND THAT I WOULD BE NOTIFIED WHEN THE SUPPLY IMPROVED. I HAVE NOT YET RECEIVED THAT SECOND LETTER. IN THE MEANTIME, I AM NOT ABLE TO ALLOW PASSENGERS IN THE FRONT PASSENGER SEAT WHICH IS A SIGNIFICANT INCONVENIENCE.",
        "vin": "4S3BL616787"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2016",
        "dateOfIncident": "11/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865325,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ON THE DASHBOARD COMES ON INTERMITTENTLY WHEN STARTING THE VEHICLE (FAULT CODE 26 - PASSENGER AIR BAG INDICATOR FAILURE)  MANY OTHER SUBARU OWNERS REPORTING THIS EXACT SAME ISSUE, WHICH IS RELATED TO FAULTY SOLDERING OF COMPONENTS IN THE OVERHEAD MAP LIGHT CONSOLE.  AS THIS IS A CRITICAL SAFETY ISSUE (PASSENGER AIRBAG MAY NOT DEPLOY IN AN ACCIDENT), SUBARU SHOULD ISSUE A RECALL TO REPAIR OR REPLACE THE FAULTY COMPONENT(S).",
        "vin": "4S3BL696883"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "02/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850432,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DASHBOARD LIGHT LIGHTS UP INTERMITTENTLY WHEN STARTING AND DRIVING. PROBLEM HAS BEEN OCCURRING SINCE 2013. SUBARU DEALER SAID PROBLEM IS FAULTY SOLDERING IN THE OVERHEAD CONSOLE THAT CONTROLS AIRBAG OPERATION. MANY INTERNET COMPLAINTS  ABOUT THIS SUBARU PROBLEM. AIRBAGS WON'T WORK WHEN DASH AIRBAG LIGHT IS ON. SUBARU WON'T TAKE RESPONSIBILITY FOR THIS SAFETY ISSUE. CHARGES $300+ TO REPLACE DEFECTIVE CONSOLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837461,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V323000 (AIR BAGS) AND 14V311000 (SERVICE BRAKES, HYDRAULICS) HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4S3BL616587"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "12/22/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823324,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL COOLER DISINTEGRATED DURING A TRIP WITHOUT ANY WARNING, NO LIGHTS OR ANYTHING.  ACCORDING TO THE MECHANIC WHO DID THE REPAIRS, WHEN IT DISINTEGRATED, IT DESTROYED THE TRANSMISSION. THE CAR SLOWED DOWN, BUT CONTINUED TO CRAWL ALONG AT ABOUT 20 MPH, SO THAT WE COULD REACH HELP. THIS RESULTED IN A $3800 REPAIR, STRANDING US 1,000 MILES FROM HOME AND RESULTING IN SEVERAL WEEKS OF MISSED WORK.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783407,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SUBARU LEGACY 2.5 I, HAS A PROBLEM WITH THE DRIVE-BY-WIRE. WHEN I START THE CAR AFTER DRIVING IT JUST FINE, THE CAR GAS PEDAL WILL NO ACCELERATE. THIS HAPPENS IN MOTION OR STATIONARY. THE CAR JUST REVS UP TO 2200 RPM'S. THIS CAN ALSO HAPPEN WHEN YOUR DRIVING. THE CAR CHECK ENGINE LIGHT AND CRUISE CONTROL LIGHT FLASHES. THE CAR WILL NOT ACCELERATE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2015",
        "dateOfIncident": "08/16/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749012,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON COLD START, VEHICLE ENGINE RAN EXTREMELY ROUGH, PLACED TRANSMISSION IN DRIVE WHILE APPLYING BRAKE, VEHICLE LUNGED FORWARD WHILE APPLYING BRAKE WITH BOTH FEET INITIALLY HAD LITTLE EFFECT.",
        "vin": "4S4BP62C987"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746298,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH WARNING LIGHT HAS COME ON AND GONE OFF ON A REGULAR BASIS SINCE I PURCHASED THE CAR A LITTLE OVER 2 YEARS AGO.  IT SEEMS TO HAPPEN MORE IN THE WINTER.  IF I LOOK ONLINE IT APPEARS AS IF THERE ARE MANY COMPLAINTS ABOUT THIS PART AND THE AVERAGE COST SEEMS TO BE 300-400 DOLLARS TO FIX IT.  IF AN AIRBAG IS NOT WORKING BECAUSE OF A FAULTY PART I BELIEVE THIS TO BE A HUGE SAFETY RISK TO ANYONE IN THE VEHICLE.  WITH THE RECALL ON THE BRAKE LINES IN MY CAR FAILING WHAT WOULD I DO IF I LOST MY BRAKES WHILE DRIVING AND THE AIR BAG WAS NOT WORKING?",
        "vin": "4S3BL626687"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "07/13/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734347,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR TO THE LOCAL REPAIR SHOP WHEN MY AIRBAG LIGHT ON THE DASHBOARD WAS COMING ON INTERMITTENTLY.  UNFORTUNATELY I HAD TO TAKE THE CAR TO THE DEALERSHIP FOR THEM TO DIAGNOSE THE PROBLEM.     WHEN I CALLED BERTERA SUBARU I MADE THE FIRST APPOINTMENT THEY HAD AVAILABLE, WHICH WAS TWO WEEKS FROM WHEN I WAS CALLING.  I DROPPED MY CAR OFF ON MY SCHEDULED APPOINTMENT ON JULY 10TH AT 10:30 AM. BERTERA INFORMED ME THAT MY CAR SHOULD BE READY FOR THE END OF THE DAY.  AT 4:00 PM BERTERA CALLED TO TELL ME THAT THEY WERE UNABLE TO TAKE A LOOK AT MY CAR AND WOULD NOT GET TO IT FOR THE REST OF THE DAY. DISAPPOINTED WITH THE CUSTOMER SERVICE, AND STILL WONDERING WHAT WAS WRONG WITH MY AIR BAG I HAD TO MAKE ANOTHER APPOINTMENT FOR MONDAY JULY 13TH.     ON MONDAY BERTERA INFORMED ME THAT MY CAR WAS \"CLEARED OF ALL RECALLS\" YET MY AIRBAG SENSOR NEEDED TO BE REPLACED FOR $384 AND IF I DIDN'T REPLACE IT I WILL STILL HAVE TO PAY $120 FOR THE DIAGNOSIS AND THAT IT IS A SAFETY HAZARD TO CONTINUE DRIVING  BECAUSE IF I GOT IN AN ACCIDENT THE AIRBAGS WOULD NOT DEPLOY.  I INSTANTLY LOOKED ONLINE WHERE I SAW HUNDREDS OF COMPLAINTS FROM SUBARU OWNERS WITH AIRBAG PROBLEMS.  WHEN I RECEIVED THE COPY OF MY SERVICE THE AIRBAG LIGHT ERROR WAS CODE 26. THERE WAS POWER AND GROUND ON INPUT SIDE, BUT THE INDICATOR \"INTERNALLY SHORTED\".  SINCE THE AIRBAG DOES NOT WORK WHEN THE LIGHT ISN'T WORKING PROPERLY THIS IS EXTREMELY DANGEROUS.  I URGE THE NHTSA TO LET ALL POTENTIALLY AFFECTED OWNERS KNOW ABOUT IT.     PLEASE CONSIDER THIS COMPLAINT TO FURTHER INVESTIGATE SUBARU AND ADD THIS TO THE EXISTING PROBLEM OF TAKATA DEFECTIVE INFLATER AND PROPELLANT DEVICES AIRBAG RECALLS.  THIS \"INTERNAL SHORTCUT\" IS ALSO CONTRIBUTING TO THE DEFECT IN AIRBAG DEPLOYMENT.      THANK YOU FOR YOUR TIME,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).?  *JB",
        "vin": "4S3BL616087"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2015",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733498,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 17 AIRBAG LIGHT WENT ON AT STARTUP AND STAYED ON UNTIL I ARRIVED AT WORK. WHEN LEAVING AFTER 9HRS THE LIGHT WAS OFF AT STARTUP. SINCE THEN THE LIGHT COMES ON AT LEAST TWICE A WEEK AND STAYS ON FOR TWO OR THREE DAYS  THEN GOES OFF. I AM EXTREMELY CONCERNED ABOUT THEIR DEPLOYMENT IN THE EVENT OF AN ACCIDENT.  I DO PLAN ON TAKING THE VEHICLE TO THE DEALER .",
        "vin": "4S3BL626987"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726140,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG PROBLEM LIGHT IS ON CONSTANTLY WHENEVER IT'S COOL AND HUMID, OR COLD OUTSIDE. I'VE SCANNED FOR TROUBLE CODES, BUT NO CODES ARE PRESENT. A NON-SUBARU GARAGE DID TROUBLESHOOTING BUT WAS UNABLE TO FIND ANY CAUSE. GIVEN OTHER COMPLAINTS, I'M DISTRESSED THAT THIS IS A PERVASIVE ISSUE WITH THE POTENTIAL FOR SERIOUS INJURY OR DEATH. SUBARU NEEDS TO DO THE RIGHT THING AND FIX THESE ISSUES BEFORE ANYONE LOSES THEIR LIVES.",
        "vin": "4S3BL856784"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723101,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ON. CODE READ ON/OFF SWITCH ABOVE REAR VIEW MIRROR DEFECTIVE. WITH AIRBAG LIGHT ON  THE AIRBAGS ARE DISABLE. THIS IS A KNOWN ISSUE AND THE VEHICLE NEEDS TO BE RECALLED TO FIX PROBLEM.",
        "vin": "4S4BP61C887"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10671992,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT HAD BEEN TURNING ON INTERMITTENTLY AS IS DESCRIBED BY MANY 2008 SUBARU LEGACY AND OUTBACK OWNERS ABOUT A YEAR PRIOR TO MY ACCIDENT.  ON OCTOBER 15TH, 2014, I LOST CONSCIOUSNESS WHILE DRIVING AND WENT OFF THE ROAD AND STRUCK TWO TREES.  MY VEHICLE WAS TOTALED WITH A CRACKED FRAME AND IT TOOK TWO TOW TRUCKS AND A WINCH TO PULL MY CAR OFF OF THE TREES.  IN THIS ACCIDENT MY AIRBAGS DID NOT DEPLOY AND I SUFFERED A FRACTURED VERTEBRA, A TRAUMATIC BRAIN INJURY, KNEE INJURIES, AND SHOULDER INJURIES.  THIS IS BEYOND WRONG AND SUBARU KNOW THERE ARE DEFECTIVE PARTS IN THESE LEGACY'S AND OUTBACK'S AS IS OUTLINED BY ALL OF THE COMPLAINTS OUT THERE ONLINE AND WITH THE NHTSA.  I WILL NOT STOP PURSUING THIS UNTIL SUBARU IS HELD ACCOUNTABLE ETHICALLY, AS WELL AS FINANCIALLY FOR THE PROBLEMS I HAVE SUFFERED AS A RESULT OF THEIR DEFECTIVE PRODUCT.  *TR",
        "vin": "4S3BL626587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648605,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT KEEPS COMING ON AND OFF. I TOOK IT TO THE DEALERSHIP IN JANUARY AND SPENT OVER $100 TO HAVE THEM TELL ME NOTHING WAS WRONG. NOW IT KEEPS COMING ON AND OFF ALL THE TIME AS OF JULY 2014 UNTIL NOW. THIS IS A COMMON PROBLEM AND IS SOMETHING THAT SHOULD BE COVERED BECAUSE IT IS A SAFETY REQUIREMENT BY LAW LIKES SEATBELT.   *TR",
        "vin": "4S3BL626587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622166,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RED AIRBAG LIGHT IN DASHBOARD GOES OFF INTERMITTENTLY, REGARDLESS OF WHETHER OR NOT THERE IS A OCCUPANT IN THE PASSENGER FRONT SEAT. ACCORDING TO THE SUBARU DEALERSHIP SERVICE (GLENDALE, CA), PASSENGER AIRBAG CENSOR IN THE PASSENGER SEAT IS MOST LIKELY THE CULPRIT, AND PASSENGER SIDE AIR BAG MAY NOT GO OFF DURING A COLLISION.  OTHERS SUBARU OWNERS HAVE REPORTED SIMILAR ISSUE ON LEGACYGT.COM, FORUMS.NASIOC.COM, SUBARUOUTBACK.ORG, AND SUBARUFORESTER.ORG.  *TR",
        "vin": "4S3BL856984"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "04/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593669,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT ON THE DASH CAME ON WHILE MY DAUGHTER WAS DRIVING THIS VEHICLE. BECAUSE THE LIGHT HAD NEVER COME ON WHILE DRIVING BEFORE AND I HAD THE SAME PROBLEM APPROXIMATELY TWO MONTHS EARLIER WITH MY 2009 SUBARU OUTBACK (VEHICLE SAFETY COMPLAINT ON FILE), I TOLD HER TO FIND A SAFE AREA AND STOP AND TURN THE CAR OFF AND THEN TURN IT BACK ON. AFTER DOING SO SHE TOLD ME THE LIGHT WAS NOW OFF. I TOLD HER TO COME HOME (SHE WAS JUST A FEW MILES AWAY) AND WATCH TO SEE IF THE LIGHT CAME BACK ON AGAIN, BECAUSE AS I HAD EARLIER BEEN TOLD BY A SUBARU TECHNICIAN THAT WHEN THE DASH \"AIRBAG\" LIGHT WAS ON THAT NONE OF THE VEHICLE'S  AIR BAGS WOULD WORK IN A COLLISION. I TOOK THE VEHICLE TO THE DEALER AND TOLD THEM THE PROBLEM. THEY CHECKED THE COMPUTER CODES AND FOUND THE SAME CODE AS IN MY 2009 OUTBACK (CODE # 26-PASSENGER FRONT SEAT SYSTEM HAD FAILED) THE MAP LIGHT/PASSENGER SEATBELT LAMP ASSEMBLY (PART # 84621AG51A) WHICH IS LOCATED ON THE INTERIOR ROOF DIRECTLY NEXT TO THE REAR VIEW MIRROR HAD TO BE REPLACED. I WAS AGAIN TOLD THAT BECAUSE THE AIR BAGS ARE A \"SUPPLEMENTAL SYSTEM\" THEY ARE NOT COVERED BY ANY WARRANTIES. BUT SEAT BELTS BEING THE \"PRIMARY SYSTEM\" ARE COVERED. SINCE I HAD THE SAME PROBLEM WITH MY 2009 OUTBACK AND THE PART WAS AN IN STOCK ITEM AND THEN IT HAPPENED AGAIN WITH MY 2008 LEGACY, IT SEEMS A BIT STRANGE TO ME THAT SUBARU DOES NOT KNOW THAT THEY HAVE A PROBLEM WITH A PART THAT CONTROLS THE AIRBAGS IN THEIR CARS. \"LOVE\" (PUN IS INTENDED) TO KNOW WHEN THE RECALL WILL HAPPEN! I HAD TO PAY ANOTHER $200 TO FIX A PROBLEM THAT WILL ALLOW MY VEHICLE'S AIRBAGS TO WORK IN THE EVENT OF A COLLISION BECAUSE THE AIRBAGS ARE CONSIDERED A \"SUPPLEMENTAL SYSTEM\" IN A VEHICLE THAT IS ADVERTISED AS A VERY SAFE VEHICLE. THE MAIN REASON I PURCHASED TWO OF THEM.  *TR",
        "vin": "4S3BL626287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576331,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD AIRBAG LIGHT WILL COME ON INDICATING THERE IS A MALFUNCTION WITH THE AIRBAG SYSTEM.  IT USED TO GO OUT ON ITS OWN BUT NOW IT STAYS ON FOR DAYS.  SUBARU HAS DIAGNOSED AND TRACED THE PROBLEM TO THE OVERHEAD CONSOLE COMPONENT.  WHEN THE DASHBOARD AIRBAG LIGHT IS ON, THE AIRBAGS WILL NOT DEPLOY IN THE EVENT OF A CRASH.   *TR",
        "vin": "4S3BL616486"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574801,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT STATED THAT THE SURFACE OF THE DASHBOARD HAD BECOME VERY SHINY AND THE GLARE FROM THE SUN LIGHT CAUSED A VISIBILITY HAZARD.  THE VEHICLE WAS DIAGNOSED AT THE DEALER BUT NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 15,000.",
        "vin": "4S3BL616287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "04/08/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521115,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SUBARU LEGACY WITH 59K MILES WAS HAVING INTERMITTENT AIR BAG WARNING LIGHT ISSUES.  THE AIR BAG LIGHT WOULD TURN OFF AND ON AT RANDOM TIMES WITH NO PATTERN OR REASONS.  THE MANUAL ADVISES TO HAVE THE AIR BAG SYSTEM IMMEDIATELY CHECKED OUT TO FIND REASONS THAT WOULD ILLUMINATE THE WARNING LIGHT.   TOOK THE CAR TO THE DEALER TODAY AND THE PROBLEM WAS DIAGNOSED AS A FAULTY OVER HEAD MAP CONSOLE LIGHT CLUSTER NEAR THE SUNROOF CONTROLS.  THE OFFICIAL PART THAT HAS A SHORT OR FAULTY WIRING IS PART # 84621AG51A.  I ONLY NEED THE AIRBAG WIRING BUT UNFORTUNATELY THE ENTIRE OVERHEAD CLUSTER IS NECESSARY BECAUSE THEY DON'T HAVE JUST AN AIRBAG WIRING REPLACEMENT PART.  THE TOTAL COST TO HAVE THE AIR BAG SYSTEM BACK TO WORKING ORDER WAS $294.00 COMPLETE.    I HAVE RAN AN INTERNET SEARCH ENGINE AND THIS ISSUE IS VERY COMMON.  IT SEEMS IRRESPONSIBLE FOR SUBARU TO HAVE SUCH AN IMPORTANT SAFETY SYSTEM BE DISABLED BY A FAULTY CRAPPY SOLDERING JOB IN THE OVER HEAD MAP LIGHT CONSOLE.  *TR",
        "vin": "4S3BL616187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "05/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512268,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE  DRIVER'S SIDE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT REPAIRED OR TAKEN TO THE DEALER FOR DIAGNOSIS. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.  *TR",
        "vin": "4S3BL616286"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2013",
        "dateOfIncident": "10/07/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498331,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM HAS BEEN OCCURRING FOR A  LONG TIME NOW. I AM FINALLY REPORTING THIS AFTER GIVING UP ON SUBARU AND ITS SERVICE NETWORK. CAR EXHIBITS SURGE AND DIP IN ACCELERATION AT CONSTANT THROTTLE, ESPECIALLY AT LOWER SPEEDS. TAKING FOOT OFF THROTTLE ALSO CAUSES SURGE WHEN GENTLY APPLYING THE BRAKES; THIS HAPPENS WHEN THE TRANSMISSION DOWNSHIFTS TO A LOWER GEAR. ALSO, THE CHANGE FROM 2ND-3RD GEAR IS VERY ABRUPT; THE ENGINE RPMS RISE BY 200 IN BETWEEN SHIFTS AND THEN SLAMS INTO 3RD GEAR. IT HAPPENS EVERY TIME. DEALER EITHER SAYS THAT IT CANNOT BE REPRODUCED, OR THAT IT IS NORMAL. ANOTHER PROBLEM WITH THE CAR IS THAT IT ALMOST STALLS WHEN STARTING OFF FROM STANDSTILL AND IN INTELLIGENT MODE. THESE PROBLEMS ARE NOT ACCEPTABLE FROM A CAR THAT IS CERTIFIED PRE-OWNED. THIS MIGHT BE MY FIRST AND LAST SUBARU.  *TR",
        "vin": "4S3BL676884"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2013",
        "dateOfIncident": "01/08/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497584,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN AN 08 SUBARU LEGACY 2.5I SEDAN WITH APPROXIMATELY 77000 MILES ON IT. AT APPROX. 76000 MILES, THE \"AIRBAG\" WARNING LIGHT CAME ON IN THE MAIN DASH CLUSTER. REFERRING TO THE OWNER'S MANUAL, ALL IT SAID WAS THAT THIS LIGHT INDICATES A PROBLEM WITH THE AIRBAG SYSTEM AND THAT THE SYSTEM MAY NOT ALLOW THE AIRBAGS TO DEPLOY AT ALL DURING A COLLISION, OR MAY DEPLOY WITH EVEN A LIGHT COLLISION. IT RECOMMENDED TO TAKE THE VEHICLE TO THE DEALER IMMEDIATELY. I TOOK THE CAR TO THE SUBARU DEALER I HAVE ALWAYS HAD SERVICE DONE, AND THEY TOLD ME THE \"LAMP ASSEMBLY - MAP\" HAD AN ELECTRICAL SHORT IN IT AND NEEDED REPLACED. AN \"ELECTRICAL SHORT\"? THAT SOUNDS VERY SERIOUS. WITH PARTS AND LABOR, THE COST CAME IN AT $389.30, WHICH SEEMED QUITE EXCESSIVE. AS CRITICAL AS AIRBAG SYSTEMS ARE, IT WOULD BE REASONABLE TO THINK THAT THIS TYPE OF PROBLEM SHOULD WARRANT A SAFETY RECALL, ESPECIALLY GIVEN THE WARNING IN THE OWNER'S MANUAL THAT THE SYSTEM MAY NOT FUNCTION AT ALL IF NOT TAKEN CARE OF. ALSO, THE SERVICE AGENT I SPOKE WITH AT THE DEALER SAID THERE HAVE BEEN A \"HANDFUL\" OF THIS TYPE OF PROBLEM, AND TREATED THE SITUATION AS ROUTINE....LIKE AN OIL CHANGE OR FILTER REPLACEMENT.     I ALSO OWN A 07 TOYOTA RAV 4, WHICH HAS HAD SEVERAL RECALLS ISSUED FOR SEEMINGLY MUCH LESS CRITICAL ISSUES. ALL OF THEM WERE TAKEN CARE OF BY TOYOTA. I WROTE A SIMILAR LETTER TO SUBARU AMERICA, EXPLAINING THAT, GIVEN THIS ISSUE, I WOULD HAVE TO THINK TWICE ABOUT PURCHASING ANOTHER SUBARU VEHICLE IN THE FUTURE.    THANK YOU  *TR",
        "vin": "4S3BL626887"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/22/2012",
        "dateOfIncident": "10/13/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485792,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT CAR NEW & IT DEVELOPED ISSUE @ 3 1/2 YRS. I ALSO HAVE THE SUBARU EXTENDED WARRANTY.CAR HAS ONLY BEEN SERVICED BY SUBARU, INCLUDING TIRE CHANGES.  10/11 @ 38,000 NOTICED FRONT & REAR PASSENGER TIRES WERE LOSING AIR. I HAVE TPMS W/ METAL VALVE STEMS. BROUGHT CAR TO DEALER, THEY FOUND NOTHING WRONG. I HAVE TWO SETS OF TIRES SO I BROUGHT CAR IN 11/11 TO PUT ON SNOWS. MONITORED TIRE PRESSURE EVERY FEW DAYS AND WAS STILL LOSING AIR. 10/12, I SPRAY SOAP/WATER MIXTURE ON TIRES, BUBBLES FORM AT THE BASE OF THE TIRE VALVE. FOUR VALVES SHOULD NOT BE FAILING PREMATURELY.   OVER TIME, THE BOTH DRIVERS SIDE TIRES DEVELOPED SLOW LEAKS AS WELL. 10/12, I CALLED SUBARU WARRANTY DEPARTMENT & EXPLAIN THAT I'M LOSING AIR FROM THE VALVE. I ASK IF TPMS FAILURE IS COVERED & WAS TOLD IT IS. 11/12 45,044 BRING CAR IN TO PUT ON SNOWS. TELL DEALER THAT ALL FOUR VALVES ARE LEAKING. I'M TOLD IT MAY BE CORROSION & THAT'S NOT COVERED UNDER WARRANTY. I EXPLAIN THAT FOR ALL FOUR TO BE LEAKING IS PREMATURE. TECH CONFIRMS THAT THREE ARE LEAKING & REPLACES THEM. DEALER STATES THAT THERE ISN'T A WARRANTY CODE FOR AIR LEAKING BUT WILL FIND A WAY TO MAKE SURE IT'S COVERED. THE TPMS UNIT IS ONE PIECE SO IF THE VALVE STEM FAILS OR A RUBBER SEALING GASKET THE WHOLE UNIT NEEDS TO BE REPLACED. I DON'T KNOW IF THIS IS A DESIGN FLAW AND CORROSION CAN CAUSE THE METAL VALVE STEMS TO FAIL PREMATURELY. I CHECK MY TIRE PRESSURE EVERY TWO WEEKS BY RULE & DON'T WAIT TILL THE TPMS LIGHT COMES ON.  *TR",
        "vin": "4S3BL626472"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/15/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485195,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU LEGACY.  THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT PANEL.  THE WARNING LIGHT WOULD MOSTLY ILLUMINATE WHEN THE WEATHER WAS COLDER. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN ADVISED THAT THE OCCUPANCY AIR BAG MODULE WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.  UPDATED 12/13/12*LJ  UPDATED 12/13/12",
        "vin": "4S3BL616987"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2012",
        "dateOfIncident": "10/11/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480062,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS BEEN HAPPENING FOR SEVERAL WEEKS.  WHEN DRIVING WITH MY FOOT ON THE ACCELERATOR AND WHEN I TAKE MY FOOT OFF AND START TO BRAKE, THERE IS A SLIGHT ACCELERATION JUST AS I START APPLYING THE BRAKE.  IT HAPPENS QUITE OFTEN AND I HAD GOTTEN USED TO IT BUT ONE DAY WHEN I WAS A PASSENGER AND MY WIFE WAS DRIVING AND NOTICED IT.  THE NEXT TIME I DROVE IT, I NOTICED IT.  IT SEEMS TO BE DOING IT MOST OF THE TIME.  IT MAY BE A PRECURSOR TO UNINTENDED ACCELERATION.    *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/07/2012",
        "dateOfIncident": "07/07/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464562,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER (DRIVER SIDE) SEATBELT FAILED TO BUCKLE/LOCK.  *TR",
        "vin": "4S3BL856984"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/03/2012",
        "dateOfIncident": "07/03/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464139,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS GRADUALLY PULLING OUT OF A DRIVE UP WINDOW AT A BANK, WHERE THERE IS @ 30 FEET BEFORE SHE GOT TO THE ROAD AND THE CAR IMMEDIATELY ACCELERATED AT A HIGH RATE OF SPEED, NEEDING TO SLAM ON THE BRAKES WITH ALL HER STRENGTH,  SLIDING SIDEWAYS INTO THE ROAD. THE ACCELERATING DISCONTINUED WHEN SHE  SLAMMED ON THE BRAKES. SHE THEN HAD TO PUT THE CAR IN REVERSE TO GET OUT OF ONCOMING TRAFFIC. SHE THEN DROVE HOME @ 1MILE AND IS AFRAID TO DRIVE THE CAR AGAIN. I CHECKED AND THE FLOOR MATS ARE NOT IN THE WAY OF THE ACCELERATED (THEY ARE FASTENED TO THE FLOOR). I DID NOT SEE ANYTHING ELSE THAT WOULD BIND THE ACCELERATOR.         *JS",
        "vin": "4S3BL626887"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "04/30/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399661,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY, APRIL 30TH, I WAS TURNING AROUND IN A DRIVEWAY, WHEN ALL OF THE SUDDEN MY CAR TOOK OFF.  I HAD NO TIME TO REACT, EXCEPT TO TRY TO USE MY BRAKE.  WHAT STOPPED ME WAS HITTING A TREE.  MY CAR IS A 2008 SUBARU LEGACY WITH OVER $5,000 IN DAMAGES.  THE POLICE INVESTIGATED AND I WAS NOT CITED.  WHEN I RETURNED HOME, I LOOKED ON THE INTERNET TO SEE IF ACCELERATION PROBLEMS WERE COMMON IN SUBARU'S.  I DID FIND THAT FORESTERS HAS PROBLEMS; BUT I ALSO FOUND THAT SOME LEGACY'S ALSO HAS ACCELERATION PROBLEMS, IN PARTICULAR I FOUND A 2008 SUBARU LEGACY WITH THIS PROBLEM.  I REPORTED MY FINDINGS TO MY INSURANCE COMPANY AND TO SUBARU.  SUBARU DID NOT GET BACK TO ME; MY INSURANCE COMPANY GAVE ME YOUR WEBSITE TO FILE A COMPLAINT.  MY LOGIC IS,  WHY SHOULD I OR MY INSURANCE COMPANY PAY FOR SOMETHING THAT WAS OUT OF MY CONTROL AND WAS THE FAULT OF THE CAR.  EVIDENTLY, THERE ARE NO RECALLS FOR SUBARU'S FOR THIS PROBLEM.  I JUST HOPE IT DOES NOT HAPPEN AGAIN - NEXT TIME I MIGHT NOT BE AS LUCKY.  *TR",
        "vin": "4S3BL616X87"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/16/2010",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A SUBSTANDARD POORLY FUNCTIONING AIR CONDITIONING SYSTEM.  IT HAS A DEFECT WHEREBY IT CYCLES ERRATICALLY AND THEREBY CREATES WARM/COLD/WARM/COLD AIR CYCLES.  ON HOT HUMID DAYS, THE PROBLEM IS SO BAD, THE CABIN CANNOT COOL.  THE MANUFACTURER, SUBARU OF AMERICA HAS DETERMINED THIS IS A \"NORMAL CHARACTERISTIC OF THE VEHICLE\" ALTHOUGH IT TOOK THEM OVER A MONTH TO COME TO THIS CONCLUSION.  MANY OTHER SUBARU LEGACY OWNERS REPORT THIS SAME PROBLEM ONLINE, HOWEVER NO FIX SEEMS TO BE COMING.  THE MANUFACTURER NEEDS TO CORRECT THIS PROBLEM. *TR",
        "vin": "4S3BL676486"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/11/2010",
        "dateOfIncident": "06/21/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342478,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/31/09 @ 13,454 MILES IS WHEN THE DRIVER'S FRONT LEFT TIRE STARTED MAKING A ROTATIONAL METAL CLICKING/SQUEALING SOUND. IT CAN BE HEARD UNDER 25MPH AND THE SOUND WAS INTERMITTENT. I TOLD DEALER I THOUGHT IT WAS THE WHEEL BEARING. SEVERAL TIMES, I BROUGHT IT TO THE DEALER ONLY TO BE TOLD THAT BECAUSE IT WASN'T MAKING A NOISE THERE WAS NOTHING TO FIX. THEY CHECKED ALL COMPONENTS, BALL JOINTS, STEERING ETC. AND CHECKED THE BEARINGS SAID CAR WAS SAFE TO DRIVE. I NOTICED THERE WERE OTHER OWNERS W/2005-06 SUBARU ISSUED A RECALL FOR WHEEL BEARING. IF YOU LOOK AT 08 LEGACY A FEW OTHERS HAVE WHEEL BEARING FAILURE. ON 6/21/10 @26,351 A TECH RODE W/ ME TO CONFIRM THE NOISE I HAVE DEALT W/ FOR OVER A YEAR. MY SERVICE INVOICE STATES TECHNICIAN FOUND INTERNAL FAILURE OF LEFT FRONT WHEEL BEARING ASSEMBLY. REPLACED HUB UNIT. IT'S DANGEROUS TO DRIVE ON A FAILED BEARING, TIRE CAN SEIZE AND LOSE CONTROL OF CAR AND DAMAGE OTHER PARTS OF CAR SUCH AS AXLE. I DROVE FOR A YEAR LIKE THIS AND WAS LUCKY NOTHING HAPPENED. THOUGH, I DON'T KNOW THE LONG TERM DAMAGE DONE TO  MY VEHICLE. I CONTACTED SUBARU TO TELL THEM OF MY ISSUE AND EXPLAIN THAT PERHAPS THEY NEED TO LOOK INTO THE MFG. WHO MAKES THE BEARINGS AND STUDY WHY THEIR BEARINGS ARE FAILING PREMATURELY. THIS IS DEFINITELY A SAFETY ISSUE AND RECALL. I HOPE THAT THIS IS THE LAST TIME I HAVE TO HAVE IT REPLACED, SINCE IT COULD GET QUITE EXPENSIVE TO FIX EACH TIME. I TAKE EXCELLENT CARE OF MY VEHICLE AND WANT IT TO LAST. I DIDN'T PAY $24,000 TO HAVE IT FALL APART. *TR",
        "vin": "4S3BL626487"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/15/2010",
        "dateOfIncident": "04/14/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325792,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WHEEL BEARING ON MY SUBARU LEGACY 2008 FAILED AT 31,000 MILES. *TR",
        "vin": "4S3BL676886"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "12/16/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324194,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU LEGACY. WHILE APPROACHING A STOP LIGHT AT A SPEED OF APPROXIMATELY 20 MPH, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO THE REAR END OF ANOTHER VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER COULD NOT DUPLICATE THE FAILURE. THE DEALER REPAIRED THE STRUCTURE BODY OF THE VEHICLE. THE WEATHER WAS NOT A FACTOR. THE APPROXIMATE FAILURE MILEAGE WAS 11,000. THE APPROXIMATE CURRENT MILEAGE WAS 11,000.  UPDATED 07/09/10. *LJ  UPDATED 07/13/10.*JB",
        "vin": "4S4BP61C287"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318429,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT OFF THE HIGHWAY ON A SECONDARY ROAD ON MY WAY HOME, WHEN AFTER THE SECOND STOP SIGN TRYING TO CROSS THE INTERSECTION THE CAR STALLED ,LOSING ITS GEARS WITH THE ENGINE RUNNING, BUT NO ACCELERATION. THE CHECK ENGINE LIGHT WENT ON,THE MODE DRIVING LIGHT AND THE CRUISE LIGHTS BLINKING. I TURNED THE ENGINE OFF ,THEN ON AND I PROCEEDED WITH THE ONLY GEAR LEFT TO A SAFE LOCATION. LUCKILY I WAS ON A SECONDARY ROAD OR I COULD HAVE BEEN REAR ENDED AND HURT OR WORSE. THE CAR WAS TOWED TO THE DEALER WHO IS TELLING ME THAT IT HAS TO BE REPROGRAMMED DUE TO A SLIPPAGE(TIME GAP BETWEEN THE 2ND & 3RD GEAR) ; HE ALSO TELLS ME THAT THE BRAKES ARE VIBRATING SHOULD I WORRY ABOUT  DAMAGE TO MY GEAR BOX? AT THIS POINT I AM WORRIED ABOUT DRIVING THE CAR EVEN WHEN IT'S FIXED  *TR",
        "vin": "4S3BL676884"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/29/2009",
        "dateOfIncident": "11/14/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293804,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU LEGACY GT WITH MOISTURE/CONDENSATION BUILDUP IN HEADLIGHT.  AUTOMOBILE WAS TAKEN TO DEALERSHIP FOR 15K SERVICING AND WAS TOLD THAT CONDENSATION BUILDUP IS NORMAL DURING TRANSITIONAL SEASONS (SPRING/FALL).  HOWEVER I PRESUME THAT THE MOISTURE IS CAUSING TEMPORARY DISRUPTION OF THE ELECTRICAL SYSTEM AS THE LIGHTS FUNCTION INTERMITTENTLY.  OFTEN WHEN THE CAR IS STARTED AND THE LIGHTS ARE TURNED ON, ONLY ONE OF THE LIGHTS WILL COME ON.  AFTER TURNING THE LIGHTS ON AND OFF SEVERAL TIMES THEY WILL BOTH WORK.  I AM AFRAID THAT I WILL BE IN A POSITION WHERE BOTH LIGHTS STAY OFF AND WILL NOT COME ON FORCING ME TO DRIVE WITHOUT HEADLIGHTS. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/28/2009",
        "dateOfIncident": "04/28/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267077,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SUBARU LEGACY HAS NO MANUAL RESET BUTTON FOR THE TIRE PRESSURE MONITORING SYSTEM. WE CHANGE OUT TIRES UP HERE 2 TIMES A YEAR AND THE DEALER CHARGES US $50.00 EACH TIME TO RESET THIS SYSTEM. WHEN THIS WAS PASSED IN TO LAW,WHY DIDN'T IT HAVE A RESET ON IT FOR THIS TYPE OF THING. I CAN SEE WHERE A LOT OF THE DRIVERS WILL JUST IGNORE IT AND LET THE LIGHT GLOW OR BURN OUT. ALSO THE TIRE VALVE STEMS ARE EXPENSIVE(35.00 EACH)  I CAN SEE A LOT OF PEOPLE NOT REPLACING THEM OR TAKING THEM OUT OF THE RIMS IN THE FUTURE. THIS IS A BAD LAW WITH MONETARY LOSS TO THE CONSUMER AS USUAL.... *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/29/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250245,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU LEGACY.  WHILE DRIVING LESS THAN 35 MPH, THE TRANSMISSION SHIFTED ON ITS OWN FROM DRIVE INTO NEUTRAL.  THE RPM'S ALSO REVVED.  THE CONTACT ATTEMPTED TO SHIFT BACK INTO DRIVE, BUT IT WAS STUCK IN NEUTRAL.  THE ABS, CRUISE CONTROL, OIL, AND SPORT INDICATORS WERE FLASHING ON THE INSTRUMENT PANEL.  THE GEAR DISPLAY ONLY DISPLAYED A WHITE DASHED HORIZONTAL LINE.  IT DID NOT DISPLAY A RED BOX AROUND THE GEAR THAT THE VEHICLE SHOULD HAVE BEEN PLACED.  THE CONTACT DEPRESSED THE ACCELERATOR PEDAL, BUT THIS ONLY CAUSED THE ENGINE TO REV.  THE CONTACT APPLIED THE BRAKES AND WAS ABLE TO COME TO A COMPLETE STOP.  HE SHUT OFF THE VEHICLE AND, ONCE IT WAS RESTARTED, IT DROVE NORMALLY.  HOWEVER, MOST OF THE INDICATORS ON THE INSTRUMENT PANEL REMAINED LIT.  THE VEHICLE HAS NOT BEEN TAKEN BACK TO THE SHOP, BUT WILL BE TOWED.  THE MANUFACTURER STATED THAT THEY HAD NEVER BEFORE EXPERIENCED THIS TYPE OF FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE 26,542.",
        "vin": "4S3BL676384"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/17/2008",
        "dateOfIncident": "12/27/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215253,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING THIS VEHICLE (THE DAY THE CAR WAS DELIVERED TO ME) BOTH HEADLIGHT ENCLOSURES CONTAIN VISIBLE SIGNS OF MOISTURE THAT NEVER GOES AWAY.  DEALERSHIP PROMISED TO REPLACE BOTH HEADLIGHT ENCLOSURES WHEN I NOTICED THIS PROBLEM THE DAY I TOOK DELIVERY OF THE VEHICLE.  DEALERSHIP HANDED ME A TSB THAT DESCRIBES A SIMILAR CONDITION WITH MY CAR THAT DISAPPEARS AFTER 20 MINUTES OF DRIVING WITH THE LIGHTS ON.  MY PROBLEM NEVER GOES AWAY AFTER ANY AMOUNT OF DRIVING.  ESCALATED TO SUBARU OF AMERICA.  THEY REFUSE TO ADDRESS THE PROBLEM STATING \"THIS IS A NORMAL CONDITION\"  SO, THERE HAS BEEN NO ACTION TAKEN TO REPAIR THIS PROBLEM TO DATE BY THE DEALERSHIP OR THE MANUFACTURER.  *TR",
        "vin": "423BL616286"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/12/2007",
        "dateOfIncident": "09/30/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE JUST PURCHASED A NEW 2008 SUBARU OUTBACK.  WHEN WE BROUGHT IT HOME AND TOOK IT FOR A RIDE WE DISCOVERED THAT AT NIGHT WHEN GOING DOWN HILL YOU CAN'T SEE MORE THAN 20 FEET AHEAD OF THE CAR WE IMMEDIATELY STOPPED FOR FEAR OF HITTING SOMETHING IN THE ROAD AND NOT BEING ABLE TO SEE IF THE ROAD STAYED STRAIGHT OR TURNED.  I FIRST CONTACTED THE DEALER WHO SAID THE LIGHTS MEET STATE SPECIFICATIONS HOWEVER THEY DON'T CHECK THE LIGHTS GOING DOWN HILL.  I THEN CONTACTED SUBARU WHO PUT ME BACK IN TOUCH WITH THE DEALER WHO STATED THAT THE PROBLEM WAS A DESIGN ISSUE AND NOT A DEFECTIVE PART.  THIS CAR HAS THE NEW PROJECTOR LIGHTS AND EVEN ON LEVEL ROAD YOU CAN SEE A VERY DEFINITIVE LINE OF DEMARCATION WHEN DRIVING AT NIGHT.  WE ARE VERY CONCERNED THAT WHEN DRIVING THIS CAR AT NIGHT WITH THESE NEW HEADLIGHTS THAT WE CANNOT ADEQUATELY SEE THE ROAD WHEN DRIVING DOWN HILLS.  *JB",
        "vin": "4S4BP61C887"
    }
]