[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/19/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458672,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake pedal became less firm, and less effective, and Brake warning light came on. I was able to park my Outback, and saw evidence of brake fluid leaking from under the right rear passenger seat. After pulling the lower rear seat cushion off, and pulling the brake line grommet out of the body, I saw, through the hole the brake lines go through, a fitting that had bare rusty brake lines attached to it, covered in brake fluid, with plastic sheathing that started about an inch from the fitting. After I discovered that there have been a lot of outbacks with the same problem, I found out that there was a recall years ago, so I called a local dealership. The person I spoke with said that the previous owner of my vehicle had neglected to have the brake lines serviced during the recall and that the recall expired years ago, so I would have to pay for replacing the defective line myself.",
        "vin": "4S4BP61CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450384,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag dashboard warning light stayed on while driving on 1/31/2022 and 2/1/2022. Dealer (Autofair Subaru in Haverhill Massachusetts) confirmed there was a problem in the overhead console. Researching the problem, I came across https://www.subaruoutback.org/threads/2006-obw-airbag-light-on-my-fix.42574/ which identified a loose component on the printed circuit board caused by a crack in the solder. Cold weather seems to exacerbate the crack and cause the component to fail intermittently. Many have reported this problem with their Subaru and have made repairs by touching up the solder.  Subaru states that the collision system may not function when this condition causes the Airbag Warning Light to remain on.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429731,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Outback. The contact stated while driving at 40 MPH and attempting to make a turn downhill, the brake pedal was depressed but failed to respond, causing the vehicle to crash into a ditch. There were no warning lights illuminated. The contact stated he did not sustain any injuries. The contact was unsure whether a police report was filed. The vehicle was towed to a tow lot, then it was towed to the contact's residence. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact stated he repaired the vehicle himself. The contact referenced NHTSA Campaign Number: 14V311000 (SERVICE BRAKES, HYDRAULIC). The dealer and the manufacturer were not made aware of the failure. The approximate failure mileage was 160,000.",
        "vin": "4s4bp86c384"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428692,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake line ruptured suddenly.  Thankfully it happened at slow speed.  Had just enough braking power to make it to the shop.  If it would have happened on the highway, it could have been catastrophic.  There is a known recall on brake lines.  Unfortunately Subaru merely sprayed brake lines with wax-like substance. This only delays problem, it does not fix it.  Confounding factor is the brake line is hidden under the undercarriage substructure, so it can not be inspected.  I did have it fixed and it was pricey, as expected as they had to remove substructure.",
        "vin": "4S4BP62C887"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422452,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The Rear Gate Harness wires that are in the grommet wear and break from the rear gate going up and down. This issue has  many issues. Rear lighting and break light, rear wiper, also rear locking mechanism and other unknown issues.",
        "vin": "4s4bp61c887"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Subaru Outback. The contact stated while driving 30 mph, the check engine warning light illuminated. The contact took the vehicle to a local dealer, where it was diagnosed with needing unknown repairs to be completed. The vehicle was repaired however, after the repairs she started to hear an abnormal sound coming from the rear of the vehicle. The vehicle was taken back to the local dealer, where it was diagnosed with needing unknown repairs to be performed. The vehicle was repaired however, the failure persisted. The vehicle was taken to an independent mechanic and was informed that the front passenger’s side ball joint and power steering rack needed to be replaced. Additionally, the rear differential fill plug and the transmission needed to be repaired. The vehicle was repaired however, the transmission was not replaced. The contact called the local dealer and made them aware of the failure of the transmission. The vehicle was not diagnosed nor repaired. The contact stated recently the air bag warning light illuminated. The dealer and independent mechanic were made aware of the failure. The manufacturer had not been informed of the failure. The failure mileage was approximately 139,000.",
        "vin": "4S4BP61C186"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415892,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK. CONSUMER WRITES IN REGARDS TO AIRBAG SAFETY RECALL. *LD    THE CONSUMER STATED THERE WERE DIFFICULTIES SCHEDULING THE RECALL REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415826,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD RECALL IN 2014 DUE TO CORRODED BRAKE LINES.  THEY COULD EITHER SPRAY IT WITH ANTI CORROSIVE SPRAY OR REPLACE THE LINES.  THEY OPTED TO JUST SPRAY THEM.  TWO WEEKS AGO CAR WAS BEING DRIVEN AND LOST BRAKE PRESSURE.  THANKFULLY NO ACCIDENT OCCURRED.  CONTACTED SUBARUS RECALL NUMBER.  THEY TOLD ME THIS IS A WEAR ITEM SIMILAR TO TIRES.  THIS IS NOT A VALID ARGUMENT.  THE LINES ARE UNDERNEATH AND ARE PARTIALLY OBSTRUCTED BY GAS TANK.  NO WAY THESE CAN BE INSPECTED BY AVERAGE DRIVER.  THIS IS A KNOWN PROBLEM AND IS REFERENCED IN RECALL WQK-47.  THEY SIMPLY PUT A BANDAID ON A SERIOUS ISSUE.  BRAKE LINES ARE SUPPOSED TO BE MADE WITH METALLURGY THAT DOES NOT FALL APART IN SALTY CONDITIONS.  THE FIX IS ABOUT 3,000 DOLLARS AS THEY NEED TO DROP GAS TANK AND SUBSTRUCTURE ON REAR OF CAR TO REPLACE THE BRAKE LINES.  AS YOU CAN SEE THIS IS BOTH RISK TO DRIVERS AND THEIR WALLETS.  ALL THIS BECAUSE THEY ENGINEERED SOME BAD BRAKE LINES WITH POOR METALLURGY AND/OR POOR PLACEMENT IN THE CAR.  IF WHAT I AM SAYING IS NOT TRUE, THEN THE FRONT BRAKE LINES SHOULD HAVE SAME ISSUE.    ANY HELP IS APPRECIATED",
        "vin": "4S4BP62C887"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408245,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I EASED INTO A PARKING SPOT, STEPPED ON THE BRAKE, AND PUT THE GEARSHIFT INTO PARK.  AS SOON AS I SHIFTED THE CAR LUNGED FORWARD, PICKED UP SPEED, AND DROVE INTO THE BUILDING.  I NEVER TOOK MY FOOT OFF THE BRAKE AND HAD TO MOVE THE GEARSHIFT DOWN TO REVERSE (NOT UP) TO GET OUT OF THE BUILDING, WHICH VERIFIES THAT THE VEHICLE WAS IN PARK WHEN IT ACCELERATED.  THE BRAKE AND ACCELERATOR ARE NOT CLOSE ENOUGH FOR ME TO ACCIDENTALLY HAVE MY FOOT ON BOTH.",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "05/21/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390985,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "[2008 SUBARU OUTBACK WITH 82,000 MILES, TAKADA AIRBAG REPLACEMENT JULY 2020].  AIRBAG WARNING LIGHT (RED) ILLUMINATED ON THE DASHBOARD INSTRUMENT PANEL AS SOON AS THE CAR IS TURNED ON AND REMAINS ON AS LONG AS THE ENGINE IS RUNNING WHETHER MOVING OR STATIONARY.  THIS IS NOTIFYING THE DRIVER THAT THE AIRBAG SYSTEM IS INOPERABLE AS STATED BY MULTIPLE MECHANICS, SUBARU MECHANICS AND SUBARU SERVICE MANAGERS OVER DOZENS OF BLOGS AND EVEN THE SUBARU WEBSITE. OVERHEAD CONSOLE (IN MAP LIGHT GROUP) SHOWS PROPER NOTIFICATION OF SEATBELT NEED AND AIRBAG ACTIVATION WHEN WEIGHT IS EXERTED ON PASSENGER SEAT SURFACE, BUT WITH THE AIRBAG RED WARNING LIGHT LIT ON THE DASHBOARD, THE PASSENGER, AND POSSIBLY DRIVER AIRBAG, IS TOTALLY INOPERATIVE. THIS IS A SERIOUS SAFETY ISSUE AND NEGLECT BY SUBARU IN ADDRESSING THIS SAFETY PROBLEM IS OF IMMEDIATE CONCERN. HUNDREDS OF SUBARU OWNERS, MANY NOT DIRECTLY REPORTING TO NHTSA, HAVE COMPLAINED ABOUT THIS SERIOUS SAFETY ISSUE, BUT NOTHING HAS BEEN DONE.",
        "vin": "4S4BP62C887"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388236,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SUBARU OUTBACK IS ON ITS SECOND AUTOMATIC CLIMATE CONTROL UNIT/CD PLAYER (IT IS AN INTEGRATED SYSTEM). A FEW WEEKS AGO, THE SECOND FACTORY REPLACEMENT UNIT STARTED FLASHING AGAIN WHILE DRIVING (SEE ATTACHED IMAGES). WHEN THIS OCCURS, THE CLIMATE CONTROL BUTTONS (INCLUDING THE FRONT AND REAR DEFROSTER BUTTONS) ARE COMPLETELY INOPERABLE. THE UNIT FLASHES WHILE DRIVING AND WHEN STATIONARY.    I DO HAVE A SHORT VIDEO SHOWING THE PROBLEM, BUT AM UNABLE TO ATTACH IT TO THIS WEB FORM. HAPPY TO SHARE IF THERE IS A WAY TO DO SO.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374141,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP OVER HEAT.",
        "vin": "4S4BP62C487"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "05/20/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354169,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD  IS MELTING",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "06/09/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353628,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RUST AND CORROSION HAS RESULTED IN A BRAKE LINE FAILURE AND LOSS OF BRAKING POWER.THIS HAPPENED AT LOW SPEED IN A PARKING LOT AND DID NOT RESULT IN AN ACCIDENT",
        "vin": "4S4BP63C186"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353789,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LINES SHOW EVIDENCE OF CORROSION WITH ONE LEAKING FLUID.  MY DTR WAS DRIVING TO FL AND NOTED EXCESS BRAKE PEDAL TRAVEL UPON ARRIVAL AND BROUGHT IT TO A REPAIR SHOP FOR DIAGNOSIS.  THE MEC.H INFORMED HER OF PROBLEM AND SENT PHOTOS OF CORRODED BRAKE LINES.  I'LL FORWARD WITH ADDTL. CORRESPONDENCE IF NEEDED.",
        "vin": "4S4BP61C586"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353002,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRODED BRAKE LINE FAILURE. VEHICLE WAS TRAVELING AT 20 MPH EXITING HIGHWAY RIGHT SIDE REAR AT JUNCTION BLOCK ABOVE GAS TANK COVER",
        "vin": "4S4BP61C987"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343703,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN BLOOMINGTON, THE BRAKE LINES FAILED. MANAGED TO PULL OVER INTO A MALL PARKING LOT. BRAKE FLUID POURED OUT FROM THE BRAKE LINES WHICH HAD RUSTED THROUGH NEAR THE GAS TANK. MY VEHICLE HAD BEEN REPAIRED BASED ON RECALL WQK47, BUT IT WAS THIS AREA THAT HAD CORRODED, LEAVING THE BRAKES USELESS.",
        "vin": "4S4BP61C687"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "09/21/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326368,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG LIGHT ABOVE MAP LIGHT COMES ON INTERMITTENTLY. TOOK VEHICLE TO DEALER IN SEPTEMBER 2012 TWICE FOR THIS ISSUE (STILL ONGOING). SERVICE WRITER SAID COMPONENT NEEDED TO BE REPLACED BECAUSE IT WAS FAULTY. HE INDICATED THE AIRBAG WOULD STILL DEPLOY IN THE EVENT OF A CRASH, BUT THE SENSOR IN THE SEAT IS NOT ABLE TO READ THE WEIGHT OF THE PASSENGER AND IF I HAD A SMALLER AND SHORTER ADULT IN THE FRONT SEAT, THEY COULD BE INJURED BECAUSE THE AIRBAG WOULD DEPLOY AT A HIGHER RATE OF SPEED AND WITH GREATER FORCE POSSIBLY INJURING THE PASSENGER. THIS APPEARS TO BE AN ONGOING AND PREVALENT ISSUE WITH THIS MAKE AND MODEL. THE AIRBAG LIGHT WILL GO ON AND OFF REGARDLESS OF TEMPERATURE, DRIVING OR PARKED, AND IF THERE IS OR IS NOT A PASSENGER. THIS IS CLEARLY AN ISSUE THAT WARRANTS A RECALL.  *TR *BF*JB",
        "vin": "4S4BP60C887"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322692,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING BELT FAILED PREMATURELY. IT HAD BEEN REPLACED AT 70K MILES AND FAILED AT 140K MILES ON THE SECOND BELT WHICH ONLY HAD 70K MILES ON IT VERSUS THE MANUFACTURE RECOMMENDED 100K MILES REPLACEMENT INTERVAL. THIS HAPPENED DURING HIGHWAY TRAVEL AND THE VEHICLE IMMEDIATELY LOST ALL POWER AND ONLY HAD 5 SECONDS TO FIND A SAFE PLACE TO PULL OFF THE HIGHWAY. ADDITIONALLY, THE VEHICLE HAS AN AIRBAG RECALL FOR THE SECOND TIME, CITING DEATH DUE TO METAL PROJECTILE AND I AM HAVING A VERY HARD TIME HAVING THAT REPLACED AS THE CAR IS NOW BEING DRIVEN IN CANADA AND SUBARU DEALERS IN CANADA WON'T HONOR THE REQUIRED RECALL.",
        "vin": "4S4BP61C286"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306337,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS GIRLFRIEND WHO OWNS A 2008 SUBARU OUTBACK. WHILE DRIVING AT 20 MPH, THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO FUNCTION AS INTENDED. THE BRAKE FAILURE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE VEHICLE WAS DIAGNOSED WITH RUSTED BRAKE LINES ON THE REAR AND FRONT OF THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256936,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR IN 2016 THERE WAS A RECALL ON AIRBAGS, THEY FIXED IT BEFORE I BOUGHT IT, BUT MY AIRBAG LIGHT HAS BEEN GOING ON AND OFF FOR OVER A YEAR NOW, I HAD MY MECHANIC RESET IT , BUT IT COMES BACK ON, IS IT UNDER WARRANTY STILL OR NOT ?",
        "vin": "4S4BP86C984"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234288,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 70 MILES AN HOUR ON I95 IN PROVIDENCE RHODE ISLAND, TAPPED THE BREAK TO KEEP KEEP SAFE DISTANCE FROM CAR IN FRONT, PEDAL SEEMED A BIT SOFT. THEN HAD TO PREFORM A HARD STOP AS THE ENTIRE 3 LANES HAD STOPPED DUE TO AN ACCIDENT. PEDAL WENT CLEAR TO THE FLOOR, NO STOPPING POWER WHAT SO EVER. FORTUNATE ENOUGH TO HAVE BEEN ABLE TO SWERVE LEFT INTO THE HIGH SPEED BREAKDOWN LANE AND DOWNSHIFT TO SLOW THE CAR. UPON COMING TO A ROLLING STOP WITH USE OF THE EMERGENCY BRAKE IT WAS NOTED THAT BRAKE FLUID WAS SPEWING FROM UNDER THE CAR,  THIS CAR NEARLY KILLED MYSELF AND MY 13 YEAR OLD DAUGHTER. CONTACTED SUBARU REGARDING THE RECALL WQK-47 WHICH THEY STATED WAS COMPLETED IN SEPT 2015 WITH THE PREVIOUS OWNER. I INQUIRED AS TO THE EXTENT OF THE WORK AND THEY WERE UNABLE TO PROVIDE THE INFORMATION. THEY ALSO STATED THAT THIS FAILURE WAS BEYOND THE SCOPE OF THE ORIGINAL RECALL, AND A RESULT OF WEAR AND TEAR. THEY COULD NOT PROVIDE INFORMATION IF THE BRAKE LINES WERE COATED, OR REPLACED FOR MY PARTICULAR CAR, THEY COULDN'T COMMENT IF THE ANTI- CORROSIVE AGENT WAS APPLIED TO THE ENTIRE BRAKE LINE SYSTEM, NOR THE MILEAGE ON THE CAR AT  THE TIME OF THE  REPLACEMENT. THE BRAKE LINES USED BY SUBARU AR CLEARLY SUBSTANDARD AND UNSAFE. IF ONE AREA IS ABLE TO CORRODE AND LEAK, WHAT SAYS ANOTHER AREA WONT DO THE SAME. MY DAUGHTER AND MYSELF WERE PLACED IN HARMS WAY AND COULD HAVE POTENTIAL BEEN SEVERELY HARMED, AND EVEN WORSE HARMED SOMEONE ELSE OR ANOTHER FAMILY HAD I NOT BEEN ABLE TO USE THE HIGH SPEED BRAKE DOWN LANE. SUBSTANDARD PARTS  NEARLY KILLED MYSELF AND MY DAUGHTER",
        "vin": "4S4BP60C286"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209527,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS TRAVELING AT HIGHWAY SPEED WHEN I EXPERIENCED A SUDDEN AND COMPLETE LOSS OF BRAKING WITHOUT ANY PRIOR WARNING. THE CAUSE IS A RUPTURED, CORRODED BRAKE LINE AS OUTLINED IN RECALL WQK-47 FOR MY MAKE, MODEL, AND YEAR.  I STRONGLY FEEL THAT THIS ISSUE IS A PUBLIC SAFETY ISSUE AND THE RECALL SHOULD COVER ANY REPAIRS FOR THE MODELS OUTLINED IN THIS RECALL. IT IS A KNOWN SAFETY DEFECT THAT SUBARU REFUSES TO REMEDY FOR ACTIVE CARS STILL ON THE ROAD.",
        "vin": "4S4BP62C387"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION GOING 45 MPH. I SLOWED DOWN TO STOP AT A STOP LIGHT AND THE ABS LIGHT BEGAN TO FLASH ON AND OFF. AS I GOT CLOSER TO THE STOP LIGHT TO COMPLETELY STOP THE CHECK ENGINE LIGHT CAME ON, THE ABS LIGHT CAME ON, THE AIRBAG LIGHT CAME ON, THE BRAKE LIGHT CAME ON, THE CRUISE CONTROL LIGHT WAS ON AND FLASHING AND THE STEERING WHEEL COMPLETELY LOCKED UP AND THE ENGINE WAS OFF. I TURNED THE CAR BACK ON AND EVERYTHING WAS FINE. THE ABS LIGHT, CHECK ENGINE LIGHT, CRUISE CONTROL LIGHT, AIR BAG LIGHT AND BRAKE LIGHT ARE STILL ON. I AM AFRAID TO DRIVE THIS VEHICLE FOR FEAR THAT IT WILL TURN OFF AGAIN. I AM UNCERTAIN OF WHAT COULD BE CAUSING THIS BUT IT SEEMS TO BE AN ELECTRICAL SYSTEM PROBLEM. THIS PROBLEM ALSO HAPPENED TO ME AS I WAS SLOWING DOWN TO TURN OFF OF THE HIGHWAY. I AM GLAD THERE WAS NO ONE BEHIND ME BECAUSE MY CAR COMPLETELY DIED AFTER I TURNED OFF THE HIGHWAY WITH THE SAME LIGHTS AND SAME THING HAPPENING AS STATED ABOVE.",
        "vin": "4S4BP63C386"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208836,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVER SINCE I PURCHASED MY CAR FROM CARMAX THERE HAVE BEEN PROBLEMS WITH THE IGNITION SWITCH. THERE HAVE BEEN ABOUT 10+ TIMES SINCE I PURCHASED THE VEHICLE IN DEC. 2016 THAT I WILL PUT THE KEY IN THE IGNITION, (WHILE THE CAR IS PARKED AND TURNED OFF, IN ORDER TO TURN IT ON) AND THE ENGINE WON'T TURN OVER. I HAVE TO TOGGLE THE GEAR SHIFTER IN ORDER TO GET THE CAR TO RESPOND AND THEN THE CAR WILL TURN ON. (ONLY AFTER I AGITATE THE GEAR SHIFTER WILL THE IGNITION THEN RESPOND). I RECEIVED AN EMAIL THAT THERE MAY BE A RECALL FOR SUBARU OUTBACK 2008 FOR IGNITION-RELATED ISSUES BUT WHEN I LOOKED UP MY SPECIFIC VIN NUMBER, MY VEHICLE DOES NOT APPEAR TO BE A PART OF THE THE RECALL. PLEASE LET ME KNOW HOW I CAN HAVE MY CAR BE CONSIDERED IN THIS RECALL, I KNOW THIS IS A RELATED PROBLEM.",
        "vin": "4S4BP60C087"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207106,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - THE CAR WAS RECALLED 3 TIMES. THE MECHANIC SAID AS LONG AS THE AIRBAG LIGHT WAS ON, THE AIRBAG WOULD NOT WORK. HE SAID THE FIX WAS NOT INCLUDED IN THE RECALL.",
        "vin": "4S4BP60C187"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194124,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS A PROBLEM WITH AN INTERMITTENT AIRBAG LIGHT ILLUMINATING, INDICATING AN ISSUE WITH THE AIRBAG SYSTEM. SPECIFICALLY IN MY CASE, IT INDICATES THAT THE OVERHEAD AIRBAG INDICATOR SYSTEM IS IN A FAULT STATE. THIS IS EXTREMELY COMMON IN THIS VEHICLE AND AGE, WITH MANY OTHER OWNERS REPORTING THE SAME ISSUE WITH NO RECALL ACTION FROM SUBARU. THIS IS A MAJOR SAFETY ISSUE WITH THIS CAR IF NOT ADDRESSED AND CAN RESULT IN THE AIRBAGS NOT DEPLOYING IN THE EVENT OF A CRASH. COST FOR AN OWNER TO REPAIR (AND IN MY CASE) IS $300+ AND SHOULD BE COVERED BY SUBARU.",
        "vin": "4S4BP61C087"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192674,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK SPORT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS MELTED AND TOO STICKY TO WASH UP IT SHINES BRIGHT CAUSING REFLECTION AGAINST VISUAL TO DRIVE, IT'S A SAFELY ISSUE.",
        "vin": "4S4BP62C787"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190660,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET WHEN I LOST BRAKING POWER.  I WAS ABLE TO SLOW THE CAR DOWN TO A STOP AND GET IT TOWED TO A MECHANIC WITHOUT DAMAGE TO MY CAR OR SOMEONE ELSE'S VEHICLE.  THE MECHANIC REPLACED BOTH REAR BRAKE LINES BECAUSE THEY HAD RUSTED TO THE POINT WHERE THEY LEAKED BRAKE FLUID.  I CALLED SUBARU.  THEY TOLD ME THAT THEY WERE NOT LIABLE FOR THE PROBLEM.",
        "vin": "4S4BP61C386"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190523,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE IS ON THE TOPIC OF A RECALL:  \"BRAKE PIPE CORROSION\"  NHTSA CAMPAIGN: 14V311000  SUBARU SERVICE CAMPAIGN: WQK47    SUBARU OF AMERICA IS REFUSING TO PROPERLY HONOR THIS RECALL, AS THEY WILL ONLY COVER THE REPLACEMENT OF CORRODED BRAKE LINES IF THEY ARE ACTUALLY LEAKING. THIS IS AN UNACCEPTABLE CRITERION FOR BRAKE LINE REPLACEMENT, AS IT IS AN EXTREMELY UNSAFE FAILURE MODE WITH POTENTIALLY-LETHAL CONSEQUENCES.    I HAVE ATTACHED A PICTURE OF A CORRODED AREA OF THE BRAKE LINES ON MY 2008 OUTBACK, AN AREA UNDER THE FUEL TANK WHICH IS EXPLICITLY COVERED BY THIS RECALL. AS CAN BE SEEN, THEY ARE TERRIFYINGLY CORRODED AS A DIRECT RESULT OF SUBARU'S IMPROPER RUST-PROOFING OF THIS AREA. THEY WILL START LEAKING AT ANY MOMENT.    INCLUDED IN THE RECALL IS A PRELIMINARY MEASURE TO APPLY SOME RUST-PROOFING COATING TO THE AREAS IN QUESTION. IF THAT ACTION IS TAKEN, THE RECALL IS CONSIDERED 100% RESOLVED PERMANENTLY. THIS RESOLUTION CRITERION IS ABSOLUTELY UNACCEPTABLE, AS THE RECALL MAY NOT BE DONE BY A VEHICLE OWNER UNTIL THE BRAKE LINES ARE SIGNIFICANTLY CORRODED BUT JUST BEFORE THEY START LEAKING DUE TO CORROSION. THE ONLY ACCEPTABLE RESOLUTION TO A RECALL FOR CORRODED BRAKE LINES IS THE REPLACEMENT OF THOSE BRAKE LINES, NOT SOME MEAGER BAND-AID THAT SUBARU IS EFFECTIVELY CLAIMING IS A PERMANENT FIX TO THE ISSUE. THAT IS NOT TRUE AT ALL, AS BRAKE LINES WILL CONTINUE TO CORRODE TO A DEGREE EVEN IF THEY HAVE SOME COATING ON THEM, ESPECIALLY SINCE THE COATING CAN WEAR OFF.    THIS RECALL WAS SUPPOSEDLY ADDRESSED ON MY PARTICULAR VEHICLE BY CITYSIDE SUBARU OF BELMONT, MA. HOWEVER, 2.5 YEARS LATER, THERE IS OBVIOUSLY NO RUST-PROOFING COATING REMAINING. EITHER THE DEALERSHIP DIDN'T DO THE RECALL PROPERLY (OUT OF SCOPE OF THIS ISSUE SUMBISSION TO THE NHTSA), OR THE COATING WORE AWAY COMPLETELY. HOWEVER, IT LOOKS LIKE IT'S THE FORMER OF THOSE TWO.",
        "vin": "4S4BP63C486"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185797,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING HOME, BRAKES WENT TO FLOOR THEN LIGHT CAME ON.  TRIED BRAKE FLUID AND GUSHED OUT.  INCHED TO NEARBY MIDAS WHO RAISED CAR AND FOUND MAJOR LEAK BY GAS TANK.  RECALL ON THAT AREA WAS TREATED WITH WAX IN 2014.  CALLED SUBARU WHO DID NOT GUARANTEE HELPING BY WANTED US TO BRING CAR TO A SUBARU SERVICE CENTER.",
        "vin": "4S4BP61C486"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173250,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINES CORRODED, FAILED STATE INSPECTION.  BRAKE LINES HAD BEEN SERVICE UNDER SUBARU RECALL TWICE AND SPRAYED WITH A COATING.  TREATING INFERIOR, CORRODED BRAKE LINES DOES NOT FIX THE PROBLEM.  BRAKE LINES SHOULD HAVE BEEN REPLACED UNDER THE RECALL.  I HAVE GOTTEN NO SATISFACTION FROM EITHER THE DEALER OR SUBARU AMERICA.  THIS IS NOT AN UNCOMMON ISSUE FOR SUBARU.",
        "vin": "4S4BP86C484"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "01/30/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156024,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES THE AIRBAG LIGHT COMES ON EITHER WHEN THE CAR IS STARTED OR ONCE IT'S DRIVING. IT'S VERY SPORADIC.",
        "vin": "4S4BP62C187"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154261,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. WHILE DRIVING 40 MPH, THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD. THE VEHICLE FAILED TO STOP. THE VEHICLE WAS TAKEN TO GLANZMANN SUBARU (95 OLD YORK RD, JENKINTOWN, PA 19046, 215-885-8282) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 14V311000 (SERVICE BRAKES, HYDRAULIC), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE RECALL HAD BEEN PERFORMED ONCE AND COULD NOT BE DONE AGAIN. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142465,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STICKY, MELTING DASHBOARD, SHINY AND REFLECTIVE IN DIRECT SUNLIGHT CREATING VISIBILITY PROBLEMS, UNSURE HOW IT WILL REACT IF PASSENGER AIRBAG MUST BE DEPLOYED THRU DETERIORATING DASHBOARD, AFFECTING RESALE VALUE.  DASHBOARD LITERALLY COMES OFF ON HANDS OR WIPING RAGS, POSSIBLE RELEASE OF CHEMICALS INTO INTERIOR?  SUBARU WILL ONLY ADDRESS 1/3 OF THE DEFECT REPAIR COST.  TOTAL AVERAGE COST FOR REPLACEMENT IS APPROX  $1500-1600.00,  ACTUAL DASHBOARD ITSELF RETAILS FOR $502.50 FROM DEALERS AND IS APARENTLY AVAILABLE WITHIN A FEW DAYS WHEN ORDERED.  SUBARU GAVE CREDIT FOR $500.00, ALMOST COVERING THE COST OF THE DASHBOARD / COVER ONLY*** APPROX. $1000 .00 IN LABOR MUST BE PAID BY CUSTOMER.  CAR IS IN OTHERWISE IMMACULENT CONDITION. THIS IS A DEFECT AFFECTING SAFETY, AND IS A KNOWN PROBLEM WITH SUBARU EFFECTING ALL OF THIS MODEL AND SIMILAR MODELS WITH HIGH SUN EXPOSURE.  IT IS ALSO CROSS MANUFACTURER AFFECTED, IE; TOYOTA, NISSAN, ETC.  THEY HAVE TAKEN THE ROLE OF RECALL AND REPLACE.  SUBARU HAS NOT TO DATE. SUBARU IS AWARE THAT THIS IS A SERIOUS PROBLEM YET REFUSES TO ACCEPT FULL RESPONSIBILITY FOR.",
        "vin": "4S4BP63C884"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128199,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE FOR BRAKE LINE, TOOK TO DEALER AND THEY APPLIED ANTI CORRESIVE. APPROX 16 MONTHS LATER BRAKE LINE BLEW WHILE DRIVING HOME FROM ON A CITY STREET. TOWED TO DEALERSHIP AND THEY ASKED SUBARU TO COVER UNDER RECALL BUT WAS DENIED DUE TO HIGH MILAGE. BRAKE LINE WAS LEAKING WHERE ANTI CORRESIVE WAS APPLIED. HAVE HEARD IF OTHERS HAVING SAME PROBLEM. WE IN 3 OTHER SUBARUS ARE UNDER THE SAME RECALL AND HAVE CONCERNS.",
        "vin": "4S4BP61C387"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114370,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CHECK ENGINE LIGHT ON, ALONG WITH TRACTION LIGHT ON, CRUISE LIGHT ON. CAN'T SHUT ANY OFF. CAR ACTUALLY GETS VERY HOT TO THE TOUCH DRIVERS SIDE NEAR FENDER HEADLIGHT. COULD START ON FIRE! DANGEROUS! THINK THERE IS A RECALL ON FRONT OXYGEN SENSOR, ONLY IF TURBO? REDICULOUS! SHOULD BE ALL NOT JUST TURBO MODEL! ALSO HAD TO REPLACE HEAD COVER GASKET AND EVERYTHING THAT GOES WITH THAT 5/17/2017 108,900 MILES. THAT SHOULD BE A RECALL ALSO.",
        "vin": "4S4BP62C687"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102340,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S SEEMS TO BE A COMMON ISSUE WITH THE WIRING ON 2005-2009 SUBARU OUTBACK/LEGACY MODELS THAT AFFECTS BOTH THE AIRBAG AND THE LOCKING MECHANISM. I HAVE SEEN MULTIPLE THREADS ONLINE WHERE THE AIRBAG INDICATOR LIGHT COMES ON SPECIFICALLY INDICATING THAT THE PASSENGER AIRBAG MAY BE AFFECTED AND SENSORS MAY BE FAULTY? THERE IS ALSO A COMMON ERROR IN THE ELECTRICAL SYSTEM IN WHICH WHEN YOU LOCK THE CAR - ALL LOCKS ACTIVATE WITH THE EXCEPTION OF THE REAR TAILGATE WHICH POSES A SAFETY RISK OR TOTAL THEFT  OF THE CAR. THESE PROBLEMS OCCUR UPON VEHICLE IGNITION AND WHEN THE CAR IS ON OR OFF (FOR THE LOCKING)",
        "vin": "4S4BP61C587"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2018",
        "dateOfIncident": "06/17/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11102231,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED ON A SIDE STREET, WAITING FOR A TRAFFIC LIGHTTIP CHANGE AROUND 9:50AM ON SUNDAY, JUNE 17, IN DENVER, CO. THERE WERE CARS IN FRONT OF ME AND ONE IN BACK BUT NONE OF US WERE MOVING. SUDDENLY, AND WITHOUT WARNING, MY DRIVER'S SIDE WINDOW COMPLETELY SHATTERED. IT HAD BEEN HALF OPEN BEFORE THIS HAPPENED WITH NO MECHANICAL ISSUES. GLASS SPRAYED IN AND OUT OF THE CAR. I HAD SEVERAL SMALL CUTS. THERE WAS NO EVIDENCE OF ANYTHING HITTING OR BEING THROWN AT THE WINDOW.",
        "vin": "4S4BP61CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099819,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PASSENGER AIR BAG REPLACEMENT AIRBAG LIGHT WOULD COME ON INTERMITTENTLY. NOW AIRBAG LIGHT STAYS ON. ALSO FOUND MOISTURE FROM A/C BEING ON UNDER THE DASHBOARD AFTER PASSENGER AIR BAG WAS REPLACED. AIRBAG LIGHT STAYS ON ALL THE TIME UNTIL CAR IS TURNED OFF. MOISTURE FROM A/C  IS WHEN A/C IS ON ANYTIME.",
        "vin": "4S4BP86C384"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "04/29/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097428,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK. CONSUMER WRITES IN REGARDS TO PASSENGER SIDE AIRBAG RECALL. CONSUMER STATES THAT VEHICLE WAS TOTALED AND WOULD LIKE FOR THEIR CONTACT INFORMATION TO BE REMOVED FROM DATABASE. *LD  *JS",
        "vin": "4S4BP61C487"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "03/31/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088584,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED AT A STOPLIGHT WHILE BRAKING FOR A RED LIGHT. BRAKES FAILED AT APPROXIMATELY 10MPH. BRAKE PEDAL DEPRESSED DOWN TO THE FLOOR, A POPPING SOUND WAS HEARD FROM THE BACK OF THE CAR AND THE BRAKES COMPLETELY STOPPED WORKING. NEEDED TO USE HAND BRAKE TO SAFELY STOP CAR. MECHANICS SAID THE BRAKE LINE ON THE REAR PASSENGER SIDE HAD CORRODED THROUGH AND BROKE. BRAKING FLUID WAS LEAKING OUT OF THE CAR AROUND THE BROKEN HOSE. THE BROKEN PORTION OF THE CABLE WAS INSIDE THE THE CAR, AND NOT DIRECTLY EXPOSED TO THE ROAD OR OUTSIDE. CAR WAS PREVIOUSLY SERVICED FOR RECALL 14V311000 INVOLVING BRAKE LINE CORROSION, BUT THEY FAILED TO FIX THIS PART OF THE LINE. RECALL REPAIR WAS PERFORMED APPROXIMATELY 1 YEAR BEFORE INCIDENT. CONTACTED SUBARU USA ABOUT THE ISSUE, AND THEY SAID THEY WOULD NOT PAY FOR ANY PART OF THE REPAIR.",
        "vin": "4S4BP62C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "02/18/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074497,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT SYSTEM IS ON INTERMITTENTLY, ESPECIALLY FOLLOWING COLD WEATHER.  KEYWORDS: \"SUBARU CODE 26 AIRBAG\".   IT IS CLEAR THAT THIS PROBLEM IS PERSISTENT AND OTHER SUBARU OWNERS REPORT THE SAME PROBLEM.  THERE APPEARS TO BE A PROBLEM WITH INADEQUATE SOLDERING OF THE ELECTRONICS ON THE PRINTED CIRCUIT BOARD (PCB) RELATED TO THE AIRBAG WARNING LIGHT DISPLAY. IT IS UNCLEAR WHETHER THIS DEFECT IMPAIRS THE ABILITY OF AN AIRBAG TO DEPLOY IN THE EVENT OF AN ACCIDENT.  IT CAN PRESENT ITSELF WHEN THE VEHICLE IS MOVING OR STATIONARY. MANY WEB-BASED ACCOUNTS OF THE PROBLEM HAVE REPORTED THAT CHANGES IN VEHICLE TEMPERATURE DUE TO WEATHER (PARTICULARLY ON COLD DAYS) MAY BE RELATED TO THE SOLDERING JOINT TO MALFUNCTION. IT IS NOT CLEAR TO ME WHETHER A PASSENGER IS IN DANGER IF THIS LIGHT IS ON OR IF IT IS A FAULTY SIGNAL THAT I CAN IGNORE.  I WANT CLARITY REGARDING SAFETY.",
        "vin": "4S4BP60C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072418,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL SOLDERING IN OVERHEAD CENTER CONSOLE WHERE PASSENGER AIRBAG ON/OFF LIGHT IS LOCATED WAS LOOSE CAUSING THE AIRBAG LIGHT ON THE DASH TO TURN ON. IT SEEMS TO BE A WIDESPREAD ISSUE WITH THIS GENERATION OF SUBARU OUTBACK. WITH THE AIRBAG LIGHT ILLUMINATED ON THE DASH THE AIRBAGS MAY NOT GO OFF IN AN ACCIDENT CAUSING A MAJOR SAFETY CONCERN.",
        "vin": "4S4BP60C786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/27/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065536,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIR BAG RELATED.  WE REPLACED THE RECALLED PASSENGER TAKATA AIRBAG  A WHILE AGO, AND AT THE SAME TIME PAID $297.95 TO THE DEALER TO FIX THE ISSUE (ERROR CODE 26) RELATED TO THE AIRBAG FAILURE INDICATOR WARNING LIGHT COMES. NOW WE ARE HAVING THE SAME PROBLEM AGAIN WITH THE AIRBAG FAILURE INDICATOR WARNING LIGHT, IT IS TURNED ON. SUBARU SHOULD BE PAYING FOR REPAIRING THIS RE-OCCURING PROBLEM WITH THE WARNING LIGHT AND REIMBURSING US FOR THE $297.95 WE PAID THE FIRST TIME TO FIX IT, SINCE SO MANY PEOPLE HAVE BEEN COMPLAINING ABOUT THIS PROBLEM.",
        "vin": "4S4BP61C887"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062886,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE.  DEALER HAS REPLACED THE TRANSMISSION THREE TIMES SO FAR.  NONE OF THE REPAIRS HAVE LASTED MORE THAN A DAY OR TWO.  VEHICLE WORKS FINE, THEN STARTS SLIPPING OUT GEAR. THIS HAS BEEN GOING ON NOW FOR TWO MONTHS.  MANUFACTURER SILENT ON GUIDANCE. SUSPECT TRANSMISSION AND/OR TRANSMISSION CONTROL MODULE FAILURE OR INCOMPATIBILITY. THE TRANSMISSION/CONTROL MODULE IS A SPLIT MODEL YEAR BUILD.",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/26/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056982,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I UNDERSTAND THAT I MAY BE DRIVING A CAR WITH THESE AIRBAGS AND THAT THEY MAY CAUSE SERIOUS DAMAGE OR DEATH IN CASE OF AN ACCIDENT. NOTHING HAS YET HAPPENED, BUT IN THE CASE OF AN ACCIDENT THERE COULD BE SOMETHING SERIOUS.",
        "vin": "4S4BP62C387"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052268,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED,  ON THE ROAD, PROBLEM SHIFTING,   I WANT TO KNOW IF THERE HAS BEEN A RECALL.  I COULD FIND THE PLACE TO ENTER THAT INFO.  I AM NOT A MACHANIC!",
        "vin": "4S4BP61C287"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035894,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG REPLACED AS PER RECALL, BUT NOT LONG THERAFTER, THE AIRBAG LIGHT WENT ON AND WON'T GO OFF. APPARENTLY, THIS IS A COMMON PROBLEM, AND SUBARU SHOULD COVER IT.     ALSO, REAR WHEEL BEARINGS FAILING AT 48K, VERY LOW MILEAGE FOR THEM TO NEED TO BE REPLACED.",
        "vin": "4S4BP62C887"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020944,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU HAS AN EXTREMELY COMMON FAULTY WIRING ISSUE WITH AN LED PRINTED CIRCUIT BOARD THAT IS PART OF THE AIRBAG WARNING LIGHT SYSTEM THAT RESIDES IN THE MAPLIGHT ASSEMBLY ABOVE THE REAR VIEW MIRROR.  THIS PROBLEM HAS BEEN REPORTED BY COUNTLESS VEHICLE OWNERS ACROSS A NUMBER OF MODELS (INCLUDING OUTBACK AND FORESTER) ACROSS A NUMBER OF MODEL YEARS.    A SIMPLE GOOGLE SEARCH USING THE KEYWORDS: \"SUBARU CODE 26 AIRBAG\" REVEALS A TREASURE TROVE OF INFORMATION PERTAINING TO THIS ISSUE.  IT IS CLEAR THAT THIS PROBLEM IS FREQUENT, PERSISTENT AND WIDESPREAD. THIS ISSUE HAS SPANNED A NUMBER OF MODELS AND MODEL YEARS.     THE COMPANY AND ITS DEALERS CANNOT HELP BUT BE AWARE OF THE ISSUE. THERE APPEARS TO BE A PROBLEM WITH INADEQUATE SOLDERING OF THE ELECTRONICS ON THE PRINTED CIRCUIT BOARD (PCB) RELATED TO THE AIRBAG WARNING LIGHT DISPLAY.  IT IS UNCLEAR WHETHER THIS DEFECT IMPAIRS THE ABILITY OF AN AIRBAG TO DEPLOY IN THE EVENT OF AN ACCIDENT.    SUBARU REFUSES TO WARRANTY THIS DEFECT.  IN ADDITION, SUBARU REFUSES TO HONOR THE TAKATA RECALL IF THIS FAULTY WIRING SYSTEM IS NOT FIRST REMEDIED.      THE PROBLEM IS INTERMITTENT AND CAN PRESENT ITSELF WHEN THE VEHICLE IS MOVING OR STATIONARY. MANY WEB-BASED ACCOUNTS OF THE PROBLEM HAVE REPORTED THAT CHANGES IN VEHICLE TEMPERATURE DUE TO WEATHER (PARTICULARLY ON COLD DAYS) MAY BE RELATED TO THE SOLDERING JOINT TO MALFUNCTION.",
        "vin": "4S4BP86C084"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2017",
        "dateOfIncident": "03/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016306,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS HAD SEVERE OIL LEAKING FOR 4 YEARS. DEALERSHIP INFORMED ME OF HEAD GASKET PROBLEMS, BUT ONLY OFFERED REPAIR AT FULL SHOP RATE PRICES. I SEE THIS A POTENTIAL FIRE HAZARD.",
        "vin": "4S4BP61C987"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014554,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-- SUBARU \"REPAIR\" OF DEFECTIVE AIRBAGS DANGEROUS. WARNING LIGHT ILLUMINATES REGULARLY. SUBARU REFUSES TO FIX. ----NOTE SUBARU ALSO REFUSED TO REPAIR LONG REPORTED ISSUES WITH BRAKES, AIR BAG, WINDSHIELD. THEY SOUGHT $$THOUSANDS OF DOLLARS IN REPAIR BILLINGS.  ALL THREE OF THESE LATER SUBJECT OF RECALLS. SUBARU REPORTED OIL CONSUMPTION DUE TO GASKET LEAKAGE, CONCERN FOR CAT CONVERTER AS POTENTIAL REPAIR BILLING.  THIS APPEARS TO BE A FOURTH POTENTIAL SUBJECT OF RECALL NOW. ----- WHAT MORE HAS TO BE DEFECTIVE ON ONE CAR BEFORE ENTIRE CAR RECALLED?!",
        "vin": "4S4BP61C587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012952,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. REPORTING MY CAR IS ON THE RECALL LIST. I WAS INFORMED WITH A LETTER FROM SUBARU MY CAR HAS THIS DEFECT. I AM MAKING AN APPOINTNENT TO HAVE IT REPLACED ASAP. IT HAS NOT DEPLOYED YET.",
        "vin": "4S4BP61C287"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993821,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHTS AND THE RADIO ON THE INSTRUMENT PANEL CONSTANTLY GO OFF AND ON SITTING STILL OR MOVING I TOLD THE TECHNICIAN AT THE DEALERSHIP   AND IT HAS NOT STOPPED AS OF  6/7/2017",
        "vin": "4S4BP61C187"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/28/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992192,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FAILURE, LOSS OF BRAKES WHILE DRIVING ON US HWY 221. BRAKE FLUID WAS LEAKING OUT FROM THE GAS TANK SPLASH SHIED. THE BRAKE FLUID RESERVOIR WAS EMPTY. ACCORDING TO RECALL BULLETIN A DESIGN FLAW IN THE SPLASH SHIELD ALLOWS SALT TO ACCUMULATE IN THIS AREA. I TRULY BELIEVE THIS IS WHY I HAVE HAD THIS FAILURE.RECALL PERFORMED PREVIOUSLY DID NOT REMEDY PROBLEM. SUBARU APPLIES BAND AID BY SPRAYING WITH ANTI-CORROSION NOXRUST.  THIS DOES NOT ALLEVIATE/SOLVE THE CORROSION ALREADY OCCURRING LEADING TO FAILURE LATER  ON, AS IN MY CASE.  THIS SHOULD BE ADDRESSED IMMEDIATELY BEFORE LOSS OF LIFE OCCURS. I HAVE CONTACTED SUBARU TO INFORM OF THE ISSUE INVOLVING MY SITUATION.  THEIR AGENT INDICATES THEY ARE NOT RESPONSIBLE DUE TO PREVIOUSLY PERFORMING SERVICE WQK47.  THIS DOES NOT REMOVE THE FAILING COMPONENTS THAT HAVE ALREADY BEGUN TO DETERIORATE DUE TO SURFACE CORROSION.  THIS SHOULD CAUSE AN IMMEDIATE ALARM TO ANY OWNERS KNOWING THEY COULD POSSIBLY EXPERIENCE MY SITUATION. I WAS LUCKY. NO ONE WAS INJURED OR NO PROPERTY DAMAGE.  THIS WILL NOT ALWAYS BE THE CASE. BE AWARE SUBARU IS TURNING A BLIND EYE TO THE REAL DANGER OF THESE FAULTY, CORRODED BRAKE LINES.  I DO NOT TRUST THEM TO DO ANY FURTHER INSPECTION OR REPAIR OF MY VEHICLE AND WILL TRUST IT TO MY LOCAL MECHANIC WHO HAS MY FAITH.  SUBARU HAS FAILED!!!!   MY HOPE IS THAT THE NHTSA WILL OPEN AN INVESTIGATION BEFORE THIS GOES MAINSTREAM NATIONALLY.  WHO CAN REPLACE A LOST LIVE?",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "12/18/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991543,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A UNKNOWN LOCAL DEALER WAS CONTACTED AND STATED THAT PARTS WERE UNAVAILABLE FOR THREE MONTHS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP62C887"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "04/06/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979010,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVER CORROSION OF REAR BRAKE LINE CAUSED SUDDEN AND COMPLETE LOSS OF BRAKE FLUID AND RESULTED IN LOSS OF ABILITY TO BRAKE.",
        "vin": "4S4BP62C687"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968155,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS PASSING FROM THE VEHICLE BODY THROUGH TO THE HATCHBACK IS CHAFFING AND HAS BROKEN WIRES.  I DISCOVERED THIS WHEN MY REAR WINDSHIELD WIPER STOPPED WORKING.  AFTER REPLACING THE MOTOR THE PROBLEM PERSISTED.  ONLINE SEARCH PROVIDED MANY REPORTS OF THIS PHENOMENON.  I CALLED SUBARU SERVICE AND THEY ARE AWARE OF THE PROBLEM AND REPORT THE FIX IS AROUND $500-600 AND ENTAILS REPLACING THE WIRING HARNESS.  I WAS TOLD THAT THE WIRES GET BRITTLE WITH AGE AND IT IS A TIGHT FIT.  MY ISSUE IS ON THE RUBBER BOOT ON THE PASSENGER SIDE OF THE CAR.  THE VEHICLE WAS STATIONARY IN MY GARAGE AS I WAS TROUBLESHOOTING THE INOPERATIVE REAR WIPER MOTOR.  85,150 MILES ON THE CAR, NEVER BEEN IN AN ACCIDENT, AND ALWAYS PARKED IN GARAGE.  I CAN UPLOAD PHOTO DOCUMENTS IF REQUESTED.  AS BARE WIRES ARE PRESENT IN THIS AREA I FEEL THAT THIS IS A POTENTIAL HAZARD.  REAR WIPER IS ALSO INOPERATIVE DUE TO BROKEN WIRE AND COULD RESULT IN LIMITED REAR VISIBILITY.  SERVICE MANAGER WAS VERY AWARE OF THIS COMMON PROBLEM.  ONLINE RESEARCH SHOWED REPORTS OF REAR BACK UP LIGHTS BECOMING INOPERATIVE AS WELL.",
        "vin": "4S4BP61C287"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "03/19/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967192,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND WITHOUT NOTICE THE CRUISE CONTROL SHUT OFF, BECAUSE OF A MINOR PROBLEM WITH THE CATALYTIC CONVERTER EFFICIENCY. HAD THE VEHICLE BEHIND ME BEEN ANY CLOSER I COULD HAVE BEEN REAR ENDED. IT TURNS OUT THAT SUBARU HAS PROGRAMED THEIR VEHICLES TO DO THIS. WHY WOULD ANYONE PROGRAM A CAR TO HAVE A SUDDEN LOSS OF POWER OVER SUCH A MINOR ISSUE.RECALLS FOR \"KEYS TURNING OFF\" HAVE HAPPENED, AND THE MANUFACTURERS KNEW ABOUT IT. SUBARU KNOWS THIS HAPPENS AND I HOPE THERE WILL BE A RECALL TO FIX THIS VERY DANGEROUS SITUATION. I HOPE THIS IS BOUGHT TO THE HIGHEST OFFICIALS AT NHTSA AND IS ADDRESS PROPERLY. I HOPE NO ONE GETS KILLED BEFORE THIS IS ADDRESSED.",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2017",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953690,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT WAS INFORMED THAT THE PARTS WERE BACKLOGGED DUE TO INCLEMENT WEATHER. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP62C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949251,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT MADE AN APPOINTMENT WITH A DEALER, BUT THERE WERE NO PARTS AVAILABLE WHEN THE CONTACT ARRIVED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949106,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) FOR THE PASSENGER SIDE AIR BAG INFLATOR. THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP61C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944929,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONSUMER REGARDING ISSUES WITH HIS 2008 SUBARU OUTBACK DUE TO A RECALL; SEEKING ASSISTANCE IN GETTING HIS VEHICLE CORRECTED BY JANUARY 31, 2017.  *SMD  THE CONSUMER REFERENCED RECALL # 15V323000. *JB",
        "vin": "4S4BP61C387"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939641,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). THE CONTACT STATED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE  THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 03/17/17*LJ  *TR",
        "vin": "4S4BP60C587"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/30/2016",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938852,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG:  THE \"OVHD CONSOLE PASS ON OFF INDICATOR\" HAD TO BE REPLACED.  SEAT BELTS:  THE FRONT DRIVER SIDE SEAT BELT DOES NOT RETRACT RELIABLY.  IT HAS BROKEN THE LEFT FRONT DOOR SWITCH TWICE.  WINDSHIELD WIPERS:  THE WIPER BLADE TRANSMISSION UNIT HAD TO BE REPLACED.",
        "vin": "BP6C9873655"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2016",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937604,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY, DEC. 22, ABOUT 11:25 A.M., I CAME TO A INTERSECTION OF MEADOWLARK LANE AND RT. 528 IN RIO RANCHO, NM. AND GOT IN THE RIGHT TURN LANE.  I DEPRESSED THE BRAKE PEDAL PART-WAY, FELT AND HEARD THE GRINDING UNDER MY FOOT. I LIFTED OFF MY FOOT AND DEPRESSED IT FULLY (NO NOISE OR GRINDING) AND CAME TO A COMPLETE STOP.  I TURNED INTO THE RIGHT LANE OF THE 3-LANE STREET.  I WANTED TO GET TO THE FAR LEFT LANE.  I SIGNALED AND TURNED LEFT.  THE CAR PASSED THROUGH THE CENTER LANE. AS THE CAR ENTERED THE LEFT LANE, IT SUDDENLY VEERED RIGHT INTO THE MIDDLE LANE AND CONTINUED FORWARD IN A \"S\" PATTERN FOR A FEW FEET! THE ROAD WAS DAMP, BY NO MEANS SLICK (NOT SHINY AND NO PUDDLES OR VISIBLE WATER OR ICE ON THE ROAD).  I BELIEVE THE TEMP WAS ABOVE FREEZING.  I WAS ABLE TO TURN THE CAR BACK TO THE FAR LEFT LANE.  THE NEXT DAY, I TOOK IT TO MY MECHANICS FOR AN APPT. I HAD MADE FOR TO HAVE THE CV BOOTS? REPLACED AND THEY SAID THEY CHECKED OUT THE STEERING, BRAKES, ETC. AND TRIED TO REPRODUCE THE SAME THING.  THEY SAID THEY WAS NOTHING MECHANICALLY WRONG. POSSIBLY THE ANTI-SKID ACTION WAS SET OFF.  THIS WAS VERY UNNERVING.  I AM NOT COMFORTABLE DRIVING THIS VEHICLE.  *TR",
        "vin": "4S4BP61C287"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/26/2016",
        "dateOfIncident": "11/26/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928062,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRE HARNESS GOING TO REAR HATCH HAD MULTIPLE WIRES SEVERED BY REPEATED OPENING/CLOSING OF REAR HATCH. LOCK AND TAIL LIGHT WIRES WERE BROKEN THOUGH. 4 OTHER WIRES HAD THEIR INSULATION CUT AND THE CONDUCTOR WAS EXPOSED. IN SEARCHING THE NET THIS APPEARS TO BE A VERY COMMON PROBLEM. WHY HASN'T A RECALL BEEN ISSUED? FAILURE OF BRAKE LIGHTS OR TAIL LIGHTS ARE A SAFETY ISSUE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927345,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK SPORT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" MY VEHICLE WAS TOWED TO \"SUBARU OF PLANO\" IN PLANO, TX. FOR AN OIL LEAK, WAS THERE FOR 3 WEEKS WHILE I WENT BACK AND FORTH WITH MY INSURANCE COMPANY. ON THE SECOND TO LAST DAY I LEARNED OF THE AIR BAG RECALL AND CALLED TO INFORM MY SERVICE ADVISOR OF THIS SINCE AT THIS POINT I WAS UNAWARE OF THE RECALL. GOT A CALL FROM HIM THE NEXT MORNING STATING THAT ALL OF THE REPAIRS HAD BE COMPLETED AND MY CAR WAS READY...? (SOUNDED FISHY TO ME..) ANYHOW, I NOTED THAT THE VEHICLE WAS ONLY DRIVEN 2 MILES IN THE THREE WEEKS IT WAS AT THE DEALERSHIP. NEEDLESS TO SAY I MADE IT A WHOLE 4 MILES BEFORE THE CAR STARTED TO DIE AND TURN OFF IN THE MIDDLE OF THE ROAD... TOOK THE CAR TO A NEAR BY SERVICE CENTER AND FOUND THAT THE DEALERSHIP PUT 2 TIMES THE AMOUNT OF OIL IN THE CAR THAT IT IS SUPPOSED TO HAVE WHICH IS CONCERNING BUT WHAT I'M REALLY CONCERNED WITH IS THE SHORT AMOUNT OF TIME IT TOOK TO INSTALL THE NEW AIRBAG, SINCE THE RECALL DEPARTMENT I ORIGINALLY SPOKE WITH STATED THAT THE PARTS WHERE STILL ON A NATIONAL BACK ORDER?",
        "vin": "JF1GH63688H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926145,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION CONNECT.",
        "vin": "4S4BP60C087"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/08/2016",
        "dateOfIncident": "12/03/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925045,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS HAD CYLINDER MISFIRES FOR OVER A YEAR.  SUBARU HAS TOLD ME IT IS \"NOT THEIR PROBLEM\" AND THEY HAVE CHARGED ME OVER $2,000 FOR THE VARIOUS TIMES I HAVE BROUGHT IT IN TO FIX THE PROBLEM.  THEY JUST \"FIXED\" IT LAST WEEK AND WITHIN 1 DAY, ALL MY CHECK ENGINE LIGHTS CAME BACK ON, AND WITHIN 3 DAYS IT IS MISFIRING AGAIN.  THEY DO NOT RETURN MY CALLS OR PROPERLY SERVICE MY CAR.  I BELIEVE THIS IS AN ENGINE RECALL PROBLEM THEY ARE AVOIDING FOR THE COSTS ASSOCIATED WITH THE RECALL.  I DO NOT WANT THIS DANGEROUS CAR.",
        "vin": "4S4BP61C386"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924539,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE CONTACTED TO HAVE PASSENGER AIRBAG REPLACED. THEY HAVE NOT CONTACTED US IN SEVERAL MONTHS.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916370,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH WIRING INSULATION FAILED AFTER 8 YEARS & 70,0000 MILES RESULTING IN (AMONG MANY OTHER PROBLEMS) FAILURE OF ALL BRAKE LIGHTS.  WIRES SHORTED OUT RESULTING IN BLOWN BRAKE LIGHT FUSE. THERE WAS NO INDICATION OF FAILURE OF BRAKE LIGHTS ON ANY DASHBOARD WARNING LIGHT.  IT IS UNKNOWN HOW LONG THIS VEHICLE (KNOWN TO HAVE UNSAFE AIRBAGS) WAS ALSO DRIVEN WITHOUT BRAKE LIGHTS.  THIS IS A KNOWN COMMON FAILURE POINT AND SHOULD BE A SAFETY RECALL.",
        "vin": "4S4BP60C286"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "10/25/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916274,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAPPENED YET,  JUST WANT THE AIRBAG REPLACED.",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915908,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP60C687"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903525,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A PASSENGER AIRBAG RECALL LETTER IN FEBRUARY 2016.  THE LETTER INFORMED ME THAT THERE WAS A PARTS SHORTAGE, SO THE REPAIR COULD NOT BE PERFORMED.  THE RECALL LETTER WARNED ME THAT I SHOULD NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT.  I HAVE NOT RECEIVED A FOLLOW-UP LETTER ADVISING ME THAT THE PARTS SUPPLY HAS IMPROVED AND I CAN SCHEDULE AN APPOINTMENT FOR REPAIR.  I'D LIKE A TIMELY RESOLUTION TO THIS ISSUE SO I CAN FULLY UTILIZE MY VEHICLE WITHOUT RISK TO PASSENGERS.",
        "vin": "4S4BP60C786"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899763,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF BELOW: SINCE EARLY ORIGINAL OWNERSHIP, FOR YEARS SUBARU DISMISSED REPEATED REPORTING OF (MOVING, STATIONARY, ALL ROADS):    TAKATA RECALL AIRBAG WARNING LIGHT ILLUMINATION. ONLY AFTER NATIONAL AIRBAG RECALL DID SUBARU RECOGNIZE CONCERN AND ADDRESS. SUBARU RECENTLY HAS SERVICED AIRBAG TWICE. BOTH TIMES, SHORTLY AFTER SERVICE DASH WARNING LIGHTS ILLUMINATED: AIRBAG, CRUISE, CHECK ENGINE. ALSO, ERRATIC CRUISE FUNCTION AND ENGINE CLICKING NOISE (MOVING, ALL ROADS) RESULTED. FOR NUMEROUS WEEKS, SUBARU HAS BEEN REFUSING TO FIX LETHAL AIRBAG/S AND REMEDY DAMAGE/CONCERNS RESULTING FROM AIRBAG SERVICE. SUBARU SEEKS PAYMENT FOR DIAGNOSIS (AND PRESUMABLY, SUBSEQUENT SERVICE) OF AIRBAG AND RELATED DAMAGE/CONCERNS AND A WRITTEN WAIVER FOR THIS SERVICE AND ANY FUTURE SERVICE NEEDS AS CONDITION OF SERVICE.    BRAKES RUSTING, SQUEALING, SPONGINESS. WEEKS BEFORE WARRANTY EXPIRED SUBARU DISMISSED ISSUES. WEEKS AFTER WARRANTY, (AT SOME 25K MILES) SUBARU SOUGHT TO SELL SOME $1900 IN NEW BRAKES OR NEW CAR. SUBARU RELENTED MONTHS LATER, ADDRESSING CONCERN. THEREAFTER, FOLLOWING THE NATIONAL BRAKES RECALL, SUBARU REPORTED NO SERVICE NEEDED ON SECOND FULL SET OF BRAKES. THIS MONTH REPLACED 4 ROTORS (AND PADS)'THIS IS THE THIRD TIME 4 ROTORS INSTALLED ON ORIGINAL-OWNERSHIP CAR WITH SOME 65K MILES.     ENGINE'S LOUD RATTLING, GURGLING. SUBARU EVENTUALLY ADMITTED AND SERVICED HEATSHIELD DEFECT. SUBARU HAS STATED REPEATEDLY HEATSHIELD ISSUE CAN'T BE RESOLVED. AFTER THREE SERVICES, SUBARU REPORTED RELATED ENGINE DAMAGE: OIL LEAK AND CATALYTIC. CHRONIC HEATSHIELD AND RELATED DAMAGE/CONCERNS ONGOING.    WINDSHIELD INTERIOR POOLING WATER AND ICING (NEEDING SCRAPING OFF DESPITE WINTER-PACKAGE WINDSHIELD HEATING), AS WELL AS EXTERIOR WINDSHIELD SEAL SLIDING FREELY. ONLY AFTER SHIELD SPONTANEOUSLY CRACKED DID SUBARU RECOGNIZE ISSUES AND ADDRESS.",
        "vin": "4S4BP61C587"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898479,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE ABS, TRACTION CONTROL, ENGINE, AND OTHER UNKNOWN WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 128,000.",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892278,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA  RECALL  I 1ST  CONTACTED PARKER SUBARU, COEUR D'ALENE, IDAHO, APPROX MARCH 2016 AND GAVE MY NAME ETC TO PARTS PERSONNEL. TOLD IT WOULD.BE AT.LEAST A.COUPLE OF MONTHS I WAITED UNTIL END.OF MAY TO CHECK IN AGAIN. NO RECORD OF MY PREVIOUS CONTACT COULD BE FOUND SO WE DID IT AGAIN & TO BE SURE I ALSO SUBMITTED AN ONLINE REQUEST FOR THE SAME PARTS AROUND THAT TIME. CALLED BACK TODAY 8/01/2016, THE GOOD.NEWS IS THAT WE ARE.ON THE LIST, @ #332. I ASKED WHAT # THEY'RE UP TO I WAS TOLD 30. THAT PARTS HAVE BEEN SLOW COMING IN ETC. IF SO, IT'S NOT THEIR FAULT, BUT IT IS UNACCEPTABLE THAT I SHOULD HAVE TO WAIT ANOTHER 6MO TO A YEAR FOR MY REPAIR.",
        "vin": "4S4BP61C787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "12/30/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889013,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: THE REPLACEMENT OF THESE DEFECTIVE AIRBAGS IS TAKING WAY TO LONG! THIS IS A DANGEROUS SITUATION AND SOMETHING NEEDS TO BE DONE TO REMEDY THIS! THERE HAS TO BE MORE MANUFACTURERS THAN TAKATA. WHAT AIRBAGS IS SUBARU PUTTING IN THEIR NEW CARS? THEY HAVEN'T STOPPED SELLING NEW VEHICLES BECAUSE OF THE AIRBAGS! THEY SHOULD BE FORCED TO PUT THE NEW AIRBAGS IN THE RECALLED CARS!  THIS NEEDS TO BE ADDRESSED RIGHT AWAY, THERE IS NO EXCUSE FOR THIS, SUBARU SALES HAVE NOT BEEN PUT ON HOLD AND WE SHOULDN'T BE PUT ON HOLD EITHER!!",
        "vin": "4S4BP62C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882906,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 09/06/16*LJ  UPDATED 09/08/16.*JB",
        "vin": "4S4BP61C087"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883133,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    SUBARU SENT ME A RECALL NOTICE IN FEB-16. IN THE NOTICE THEY SAID \"WHAT YOU SHOULD DO: WE ARE CURRENTLY EXPERIENCING A PARTS SHORTAGE...UNTIL THIS REPAIR IS PERFORMED, DO NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT. AS THE PARTS SUPPLY IMPROVES, YOU WILL BE NOTIFIED WITH ANOTHER LETTER ADVISING YOU TO SCHEDULE AN APPOINTMENT...TO HAVE THE FRONT PASSENGER AIRBAG INFLATOR REPLACED...\" BASICALLY, IN A BID TO AVOID RESPONSIBILITY, THEY ADVISED ME TO CUT MY PASSENGER CARRYING CAPACITY BY 25%. I HAVE BEEN WAITING PATIENTLY FOR THE FOLLOW UP LETTER TO LET ME KNOW TO SCHEDULE THE SERVICE, BUT NOTHING HAS ARRIVED. I JUST LOOKED ONLINE FOR AN UPDATE AND FOUND A REDDIT THREAD THAT SAID THE PARTS ARE AVAILABLE, YOU JUST NEED TO SCHEDULE SERVICE, AND SUBARU WON'T BE SENDING A FOLLOW UP LETTER.    THIS IS INEXCUSABLE. YOU HAVE PEOPLE STILL USING THEIR VEHICLES WITH A DEFECTIVE AIRBAG THAT COULD KILL OR MAIM. SUBARU IS SITTING ON THEIR STOCK OF AIRBAG INFLATORS AND NOT NOTIFYING THEIR CUSTOMERS TO SCHEDULE SERVICE. I EXPECT YOU, THE NHTSA TO OVERSEE THIS CRITICAL RECALL AND MAKE SUBARU COMMUNICATE WITH THEIR CUSTOMERS, OR IF THEY WON'T, DO IT ON THEIR BEHALF.    THANK YOU FOR HELPING TO KEEP US SAFE!  *TR",
        "vin": "4S4BP63C086"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881780,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP61CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873082,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP62C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872389,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 15V3230000 (AIR BAGS) WAS RECEIVED IN FEBRUARY OF 2016. AFTER CONTACTING THE DEALER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4S4BP86C884"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2016",
        "dateOfIncident": "05/28/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871317,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  GOT THE RECALL NOTICE FEB. 2016 AND STILL NO ACTION.  I CALLED THE DEALER AND THEY TOLD ME THEY DO NOT HAVE THE REPLACEMENT PART.  AFTER 5 MONTHS, I WOULD THINK THEY COULD HAVE THE PART BY NOW ESPECIALLY CONSIDERING I DRIVE THE CAR DAILY AND IT IS UNSAFE!",
        "vin": "4S4BP61C387"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10865537,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER, 2015 I WAS INVOLVED IN A COLLISION IN WHICH A DRIVER DIDN'T SEE THAT TRAFFIC HAD COME TO A COMPLETE STOP ON THE HIGHWAY AND HIT ME FROM BEHIND AT A HIGH SPEED (APPROXIMATELY 60 MPH).  I WAS IN THE FRONT DRIVER SEAT.  THE COLLISION FORCED ME AGAINST THE SEAT BACK, WHICH CAUSED THE ENTIRE BACK OF MY SEAT TO BREAK AT THE HINGE AREA WHERE THE SEAT BACK AND SEAT BOTTOM MEET. BECAUSE THE SEAT DIDN'T WITHSTAND THE IMPACT, IT BROKE COMPLETELY OFF AND IT WAS LAYING COMPLETELY FLAT INTO THE BACK SEAT.  SUBSEQUENTLY, I WAS COMPLETELY UNSUPPORTED AND MY SEAT BELT NO LONGER WORKED.  FORTUNATELY, I WASN'T HIT A 2ND TIME EVEN THOUGH I WAS THROWN ACROSS TWO LANES OF TRAFFIC BECAUSE WITH NO LONGER HAVING A SEAT BACK OR A WORKING SEAT BELT, I WAS WITHOUT ANY PROTECTION.    I DO NOT HAVE PHOTOS OF THE SEAT BACK, BUT THE POLICE AND EMERGENCY VEHICLES RESPONDED AND A REPORT WAS FILED.",
        "vin": "4S4BP60CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865608,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 07/13/16*LJ    *CN",
        "vin": "4S4BP61C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861224,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4BP62C687"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/02/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853068,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING COMES ON AND OFF CONSTANTLY EVERY TIME IT IS STARTED,SOMETIMES OFF,LATELY STAYING ON",
        "vin": "4S4BP61C786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852908,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.   SUBARU DEALERSHIPS DELAYING REPAIRS.  GO SUBARU WEST IN GOLDEN, COLORADO STATED IT COULD BE 3 MONTHS BEFORE RECALL CAN BE FIXED.  OTHER MANUFACTURERS HAVE FIXED UP TO 50% OF THEIR CARS, AND SUBARU HAS A DISMAL COMPLETION RATE OF 5%.    UPWARDS OF THREE TO SIX MONTHS IS UNACCEPTABLE TO BE UNABLE TO USE THE CAR AS INTENDED.",
        "vin": "4S4BP61C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852595,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 SUBARU OUTBACK WAS IN FOR ROUTINE MAINTENANCE WHEN THE DEALER STATED A TROUBLE CODE WAS BEING PRODUCED BY MY VEHICLE. THE SPECIFIC CODE WAS 26. I WAS TOLD THIS INDICATED A FAULT WITH THE PASSENGER SIDE AIRBAG AND THAT IT COULD FAIL TO DEPLOY IN THE EVENT OF AN ACCIDENT. ADDITIONALLY, THEY STATED THAT THIS CODE WOULD HAVE PREVENTED MY CAR FROM PASSING THE ANNUAL MASSACHUSETTS SAFETY INSPECTION AND REQUIRED A REPAIR BY REPLACING THE OVERHEAD MODULE FOR A TOTAL COST OF $360. I FIND IT UNACCEPTABLE THAT A SAFETY RELATED ISSUE SUCH AS A FAILURE OF THE PASSENGER AIR BAG TO DEPLOY WOULD RESULT IN THE CONSUMER HAVING TO PAY THE COST OF REPAIR.",
        "vin": "4S4BP60C787"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851037,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A USED 2008 SUBARU OUTBACK IN APRIL OF 2015, AND SHORTLY AFTERWARDS BEGAN SEEING THE AIRBAG DASH LIGHT OCCASIONALLY UPON STARTUP. THE AIRBAG LIGHT WOULD REMAIN ON UNTIL THE VEHICLE WAS TURNED OFF, AND WOULD OFTEN COME ON AND STAY ON WHEN THE VEHICLE WAS STARTED AGAIN. OVERHEAD PASSENGER AIRBAG INDICATOR ALSO WAS MALFUNCTIONING, AND DID NOT INDICATE ON OR OFF. VEHICLE WAS SERVICED AT DEALERSHIP ON 3/22/2016, AND THE OVERHEAD CONSOLE (PART # 92151AG13AOR) WAS REPLACED TO REMEDY AIR BAG CODE 26. TOTAL COST WAS $182.95; $130.45 FOR THE NEW CONSOLE, AND $52.50 FOR THE LABOR. THIS MALFUNCTION IS FAR TOO COMMON IN SUBARU VEHICLES ACROSS SEVERAL YEARS,AND IS AN EXTREMELY IMPORTANT REPAIR AND A DANGEROUS SAFETY CONCERN. THE AIRBAG SYSTEM IS INOPERABLE WHEN THE DASH LIGHT IS ON, AND SHOULD BE A RECALL SITUATION FOR ALL SUBARU VEHICLES THAT HAVE THE DEFECTIVE CONSOLE.",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850707,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. WHILE DRIVING AT VARIOUS SPEEDS, THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT THE FAILURE WOULD OCCUR INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF FAILURE. THE FAILURE MILEAGE WAS 62,000.",
        "vin": "4S4BP61C286"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "12/31/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850189,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I UNDERSTAND THERE'S A PART SHORTAGE HOWEVER, THIS PART HAS BEEN ON ORDER FOR OVER 3 MONTHS NOW AND THE ONLY SOLUTION I'VE BEEN GIVEN IS TO NOT ALLOW ANYONE TO SIT IN THE PASSENGER SEAT. UNACCEPTABLE.",
        "vin": "4S4BP63CX86"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849622,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE  EVENT OF THE CRASH THE FRONT PASSENGER AIR BAG , THE INFLATOR COULD RUPTURE WITH  METAL FRAGMENTS STRIKING VEHICLE OCCUPANTS AND POTENTIALLY CAUSING SERIOUS INJURY  OR  DEATH.",
        "vin": "4S4BP61C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846134,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 06/15/16*LJ  THE CONSUMER STATED THE VEHICLE WAS REPAIRED. UPDATED 06/20/16.*JB",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839799,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK SPORT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE RECEIVED NOTICE OVER A MONTH AGO THAT THE PASSENGER SIDE AIRBAG IS DEFECTIVE AND THAT NO ONE SHOULD RIDE IN SEAT. UNFORTUNATELY, THE SUBARU IS OUR ONLY CAR AND WE HAVE 2 CARSEATS IN THE BACK SO IF WE ARE DRIVING AS A FAMILY, WHICH WE DO ON A DAILY BASISS, SOMEONE HAS TO SIT IN THE FRONT. WE CALLED TEH SUBARU TO GET IT FIXED AND WE WERE TOLD IT WAS ON BACKORDER FOR AN UNKNOWN PERIOD OF TIME. HOW ARE WE RISKING OUR SAFETY WHILE WE WAIT FOR THIS PART? I AM DESIRING TO BE COMPENSATED FRO THIS PROBLEM BECAUSE I HAVE RECEIVED NO COMMUNICATION FROM SUBARU ABOUT HOW THEY WILL FIX THIS PROBLEM > I CAN'T CONTINUE TO WAIT AND DRIVE ON THE HIGHWAY WHILE I WORRY ABOUT TEH SAFETY OF ANOTHER ADULT IN TEH CAR KNOWING THAT THIS PROBLEM EXISTS.",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839269,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER SUBARU RECALL CAMPAIGN WQR53, I WAS ADVISED BY EMAIL AND POSTAL MAIL THAT I SHOULD NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT UNTIL THE AIR BAG INFLATOR IS REPLACED BY A SUBARU DEALER. I MADE AN APPOINTMENT MORE THAT A WEEK AGO TO HAVE THE WORK DONE ONLY TO LEARN TODAY WHEN I KEPT THE APPOINTMENT THAT THE DEALER DID NOT HAVE THE PART IN STOCK, AND  THAT IT WOULD BE \"WEEKS AND WEEKS\" BEFORE THE PART ARRIVED. I AM THEREBY DEPRIVED OF THE NORMAL, SAFE USE OF MY CAR FOR THAT TIME PERIOD. THE DEALER OFFERED A RENTAL CAR BUT WILL NOT STORE MY CAR IN THE INTERIM. I HAVE NO PLACE TO PARK AN EXTRA CAR. I WOULD LIKE TO RECEIVE ANOTHER FORM OF COMPENSATION AND THEREBY BE MADE WHOLE.",
        "vin": "4S4BP60C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2016",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837788,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS INVALID. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837429,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP61C787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837463,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP62C687"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/20/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837336,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  TRIED TO SCHEDULE THIS RECALL REPAIR AND THE LOCAL DEALERSHIP STATES THEY DON'T HAVE PARTS TO FIX THIS, EVEN STATING THAT THE PART HASN'T BEEN DESIGNED YET. ON THE RECALL NOTICE IT SAYS, \"WHAT YOU SHOULD DO . . .UNTIL THIS REPAIR IS PERFORMED, DO NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT.\"  THIS MEANS TO ME THAT SUBARU OWES ME A LOANER CAR UNTIL THE PART CAN BE REPLACED, BECAUSE MY CURRENT CAR IS NOT SAFE TO DRIVE.  I HAVE A FAMILY OF FOUR, INCLUDING TWO YOUNG CHILDREN IN CAR SEATS IN THE BACK.  THEY OWE ME A CAR, IF THEY CAN'T REPLACE THE PART YET THEY SAY THIS CAR IS NOT SAFE TO DRIVE.  SUBARU RECALL CAMPAIGN WQR53  NHTSA RECALL NO. 15V-323",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837101,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP61C987"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837213,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP62C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837215,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BP63C886"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837015,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4S4BP61C487"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2016",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836659,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    DEALER SAID THAT THEY DO NOT HAVE PARTS TO PERFORM RECALL SERVICE AND THAT IT WILL BE MONTHS BEFORE PARTS ARRIVE.",
        "vin": "4S4BP61C587"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/16/2016",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820652,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE IN LESS THAN SIX MONTHS, WHILE MY CAR WAS STOPPED BUT IN DRIVE, WITH MY FOOT FIRMLY PRESSED ON THE BRAKE, THE CAR HAS REVVED UP AND SURGED FORWARD OF ITS OWN ACCORD.  BRAKING DID NOTHING TO STOP THE CAR EITHER TIME.  ON AUGUST 3, 2015 AT @ 8:30 A.M., I PULLED INTO A PARKING SPACE DIRECTLY FACING A BUILDING AND STOPPED.  AS I WAS GETTING READY TO SHIFT FROM DRIVE TO PARK, THE CAR SURGED FORWARD, ACROSS A SIDEWALK, AND INTO/THROUGH THE WALL/WINDOWS OF A BUSINESS.  I CONTACTED THE LOCAL SUBARU DEALERSHIP AND WAS TOLD THEY KNEW OF NO SIMILAR ISSUES LOCALLY OR NATIONALLY.  I LEFT MY CAR WITH THE DEALERSHIP FOR A WEEK SO THEY COULD INSPECT IT.  THE CAR WAS DRIVEN UNDER 30 MILES AND THE ISSUE DID NOT ARISE, SO THE CAR WAS RETURNED TO ME.  I ASKED THAT THEY NOTIFY SUBARU NATIONALLY AND THE NHTSA OF THE INCIDENT, AND ONLY LEARNED LATER THAT THEY DID NEITHER.    ON DECEMBER 19, 2015, I WAS ON A CITY STREET (WET, BUT NOT ICY) @  BLOCK BACK FROM A RED LIGHT COMPLETELY STOPPED IN A LINE OF TRAFFIC.  I WAS AT LEAST 4-6' BEHIND THE CAR IN FRONT OF ME, WITH MY FOOT FIRMLY DEPRESSING THE BRAKE, AND MY CAR AGAIN SURGED FORWARD, DESPITE ALL MY EFFORTS TO CONTROL IT, AND SLAMMED INTO THE REAR OF THE CAR IN FRONT OF ME.  I CONTACTED THE DEALERSHIP AGAIN, AND ONLY AFTER TWO VISITS WAS A RECORD MADE OF THE 12/19/2015 INCIDENT AND I WAS GIVEN THE NUMBER FOR NATIONAL SUBARU CUSTOMER SERVICE.  I HAVE REQUESTED A FORM TO ALLOW AN INSPECTOR TO DOWNLOAD INFORMATION FROM THE EVENT DATA RECORDER FOR REVIEW WHEN HE INSPECTS THE CAR IN TWO WEEKS.    I USE ONLY MY RIGHT FOOT ON THE BRAKE AND GAS PEDAL.  I HAVE FACTORY FLOOR MATS WHICH ARE PINNED DOWN AND DO NOT MOVE.  I WEAR FLAT SHOES.",
        "vin": "4S4BP61C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/25/2015",
        "dateOfIncident": "12/20/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816210,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT OCCASIONALLY ILLUMINATES WHILE DRIVING OR IDLING AND CAN REMAIN ON FOR MINUTES, HOURS, OR CONSISTENTLY OVER CONSECUTIVE DRIVING DAYS. IN SOME INSTANCES, ILLUMINATION OCCURS DURING COLD AND/OR HUMID WEATHER. THE PROBLEM IS SUSPECTED TO BE CAUSED BY A FAILURE IN THE OVERHEAD/MAP LAMP ASSEMBLY PC BOARD. UPON VISUAL INSPECTION OF THE BOARD, NUMEROUS SURFACE MOUNT COMPONENTS HAD SOLDER CRACKS AT THEIR COMPONENT TERMINALS. THERE WAS NO APPARENT PHYSICAL DAMAGE TO THE MAP LAMP ASSEMBLY ENCLOSURE.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "12/16/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810672,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD LIGHTS BLINKED OFF & ON AND THE HEATER STOPPED WORKING, THEN STARTED WORKING AGAIN. THIS HAPPENED THREE TIMES. IT GIVES THE APPEARANCE OF INVOLVING A SHORT CIRCUIT. THIS HAPPENED BOTH WHEN THE VEHICLE WAS STATIONARY AND WHILE MOVING.",
        "vin": "4S4BP62C787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809095,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT ON THE FRONT DASH COMES ON WITHOUT ANY CRASH OR FRONT END IMPACT. MY VEHICLE HAS 45K MILES ON IT. ACCORDING TO MY RESEARCH, THIS IS A WELL KNOWN PROBLEM THAT HAS NOT BEEN ADDRESSED BY SUBARU.  THE SUBARU DEALER DIAGNOSES THIS AS A CODE 26 WHICH REQUIRES THE OVERHEAD CONSOLE TO BE REPLACED AT A COST OF ABOUT $400.  THIS IS AN UNSAFE CONDITION IN WHICH THE AIRBAGS WILL NOT DEPLOY IN AN ACCIDENT UNLESS THE OVERHEAD CONSOLE IS REPLACED. A SAFETY RECALL SEEMS WARRANTED GIVEN THE NUMBER OF SUBARU CONSUMERS EXPERIENCING THIS PROBLEM, AND THE  COMPROMISE IN SAFETY THAT COULD RESULT FROM NEGLECTING TO GET IT REPLACED",
        "vin": "4S4BP61C086"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/22/2015",
        "dateOfIncident": "11/18/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795283,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT CAME ON WITHOUT ANY CRASH OR FRONT END IMPACT. THE DIAGNOSTIC CODE INDICATES THAT IT IS THE PASSENGER AIR BAG MODULE.  IT IS A HARD FAULT SINCE IT IS UNABLE TO BE CLEARED.  ACCORDING TO MY RESEARCH THIS IS A WELL KNOWN PROBLEM THAT HAS NOT BEEN ADDRESSED BY SUBARU. THIS IS MY DAUGHTER'S CAR. ACCORDING TO TECHNICIAN, THIS IS AN UNSAFE CONDITION IN WHICH THE AIRBAGS WILL NOT DEPLOY.",
        "vin": "4S4BP86C084"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790543,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE OVER EAD CONSOLE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "4S4BP60C686"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789512,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT INTERMITTENTLY COMES ON WHILE DRIVING AND STAYS ON. I NOTICE THIS MORE IN THE EARLY MORNING WHEN IT'S COLD BUT IT'S BEEN HAPPENING ON A MORE FREQUENT BASIS NOW. I'VE BEEN TOLD THE AIRBAGS WOULD NOT DEPLOY IN AN ACCIDENT IF THE LIGHT IS ON. THIS IS A SERIOUS SAFETY ISSUE THAT SUBARU IS FULLY AWARE OF.",
        "vin": "4S4BP60C787"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785107,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. WHILE DRIVING 5 MPH, THE AUDIO AND THE WHOLE PANEL RELATED TO THE HEAT/AIR AND DEFROSTER FAILED WITHOUT WARNING. THE CONTACT STATED THAT THE AUDIO AND H-BACK CONTROL PANEL LIGHTS WERE BLINKING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 37,000.",
        "vin": "4S4BP86CX84"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2015",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778443,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "(VEHICLE HAS 112K MILES)  BEGINNING APPROXIMATELY IN THE MARCH 2015 TIMEFRAME, THE RADIO CONTROLS/DISPLAY BEGAN TO MALFUNCTION INTERMITTENTLY.  AT FIRST, THE RADIO DISPLAY WOULD BLINK OFF/ON, AND THEN PRESET STATION BUTTONS STOPPED/STARTED WORKING, THEN THE CD/RADIO/AUX CONTROL KNOB STOPPED/STARTED WORKING, ETC.  CONTROLS FROM THE STEERING WHEEL APPEAR UNAFFECTED.  THERE WOULD BE ONE PROBLEM ON ONE DAY, WHICH WOULD SEEMINGLY \"GO AWAY.\"  THEN, AT RANDOM (SOMETIMES DAYS OR WEEKS LATER), ANOTHER PROBLEM WOULD PRESENT ITSELF.  IT, TOO, WOULD \"GO AWAY\" IN SHORT ORDER AND THE PROCESS WOULD REPEAT ITSELF.  THE PROBLEM WOULD OCCUR ON START-UP AS WELL AS SUDDENLY WHILE IN MOTION (IN MAY 2015, I HAD THE RADIO GO OFF ABOUT MIDWAY ON A 150-MILE TRIP.)  ON SEPT 16, THE RADIO CONTROLS BECAME COMPLETELY INACTIVE, BUT THE UNIT FUNCTIONED AND THE DISPLAY WAS ON.  THEN, ON SEPT 24, I WAS TRAVELLING AT NIGHT WHEN THE HEADLIGHTS AND RADIO/AC DISPLAYS SUDDENLY WENT DARK.  THIS IS CLEARLY A SAFETY CONCERN.  THE HIGH BEAMS AND RUNNING LIGHTS REMAINED FUNCTIONAL, BUT THE REGULAR LIGHTS NO LONGER FUNCTION.  I DID NOT TEST THE FOG LIGHTS AND I AM NO LONGER DRIVING THE CAR.  I AM USING MY WIFE'S CAR.  UNTIL I CAN TAKE THE CAR FOR SERVICE, ITS USE IS LIMITED TO DAYLIGHT HOURS.  THE ISSUE HAS REMAINED AND DOES NOT APPEAR TO BE \"GOING AWAY\".  WHEN YOU TURN ON THE HEADLIGHTS, THE RADIO/AC DISPLAYS GO BLANK AND THE HEADLIGHTS DO NOT LIGHT.",
        "vin": "4S4BP86C984"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/24/2015",
        "dateOfIncident": "09/24/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775953,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC FAILS TO OPERATE. DEFROSTER WILL NOT OPERATE. SYMPTOMS ACCOMPANIED BY FLASHING CONTROL PANEL FOR HVAC AND RADIO.  WIDESPREAD REPORTS OF THIS PROBLEM SHARED ON CAR OWNER INTERNET FORUMS.",
        "vin": "4S4BP62C187"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775344,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR LIGHT PERIODICALLY TURNS ON WHEN A PASSENGER SITS IN THE FRONT PASSENGER SEAT.  SOMETIMES IT TURNS ON, SOMETIMES NOT.  YOU CAN RESET THE SENSOR AND IT GOES AWAY, FOR DAYS OR WEEKS.   NUMEROUS SIMILAR COMPLAINTS FOUND ONLINE.  MECHANIC CAN NOT FIND PROBLEM.",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761622,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT IS FREQUENTLY ON FOR EXTENDED PERIODS OF TIME (DAYS, WEEKS,MONTHS). THE ISSUE AND SUBARU'S UNWILLINGNESS TO ADDRESS IT ARE WELL DOCUMENTED IN COMPLAINTS FILED WITH NHTSA BY OTHER SUBARU OWNERS AND ON VARIOUS SUBARU OWNER WEBSITES. FOR EXAMPLE, SEE HTTP://WWW.ARFC.ORG/COMPLAINTS/2008/SUBARU/OUTBACK/AIR_BAGS/PROBLEM.ASPX   THERE IS CONFLICTING ADVICE ON WHETHER ILLUMINATION OF THE DASHBOARD WARNING LIGHT MEANS THE AIRBAGS ARE DISABLED OR NOT. EITHER WAY, THIS IS A SERIOUS SAFETY HAZARD THAT NEEDS TO BE ADDRESSED IMMEDIATELY.",
        "vin": "4S4BP62C487"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2015",
        "dateOfIncident": "08/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759795,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A YEAR AGO, MY VEHICLE WOULD STALL AT EVERY STOP (VEHICLE SHOULD BE NOTED IS STICK SHIFT).  AFTER THAT, THE CHECK ENGINE LIGHT CAME ON AND VEHICLE RAN FINE.  I DROVE IT WITH CHECK ENGINE LIGHT ON ACCORDINGLY.  I JUST RECEIVED VEHICLE BACK FROM SUBARU FOR RECALLS WQD40 (CATALYST CONVERTOR) AND WQK47 (BRAKE LINES).  WHEN I STARTED CAR, CHECK ENGINE LIGHT IS OFF AND NOW STALLS AT EVERY STOP, WHICH SHUTS DOWN CAR INCLUDING POWER BRAKES AND POWER STEERING.  I CALLED SUBARU AND THEY SAID THEY HAVE NO OTHER COMPLAINTS, BUT I DON'T THINK THAT IS TRUE.  I THINK THERE IS AN ISSUE AND IT IS DANGEROUS TO LOSE BRAKES AND STEERING.  SUBARU WANTS TO CHARGE ME TO LOOK AT IT AND I DON'T WANT TO PAY THEM.  MY PERSONAL MECHANIC CANNOT FIGURE IT OUT.",
        "vin": "4S4BP61C386"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750242,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. WHILE REVERSING AT MORE THAN 25 MPH, THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744948,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE MAP LIGHT AIR BAG UNIT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": "4S4BP62C387"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731018,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FOLLOWING ON THIS COMPLAINT FROM MANY SUBARU OUTBACK OWNERS ABOUT THE AIRBAG LIGHT MALFUNCTION  I THINK SHOULD BE ADDRESSED, DEFINITELY A RECALL ISSUE THAT SHOULD BE TAKEN CARE BY SUBARU.",
        "vin": "4S4BP61C387"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721954,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK.  CONSUMER SEEKS REIMBURSEMENT FROM MANUFACTURERS CATALYTIC CONVERTER DEFECT RECALL REPAIRS.  *SMD  THE CONSUMER STATED A FEW DAYS AFTER PURCHASING THE VEHICLE, THE CHECK ENGINE LIGHT ILLUMINATED. A LOCAL REPAIR SHOP READ THE CODES AND EXPLAINED TO THE CONSUMER, THE CATALYTIC CONVERTER WAS FAILING. THE CONSUMER LEARNED SUBARU HAD ISSUED A SELECTIVE RECALL, ONLY HONORED IN CERTAIN STATES, ON THE CATALYTIC CONVERTER WITH A REPROGRAMMING OF THE ECM.  THE CONSUMER PAID FOR THE REPLACEMENT OF THE CATALYTIC CONVERTER. HOWEVER, SHE IS REQUESTING REIMBURSEMENT.  *JB",
        "vin": "4S4BP61C487"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715488,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HEAD GASKET IS LEAKING OIL. WARRANTY IS EXPIRED, BUT 74K MILES IS TOO EARLY FOR THIS MAJOR PROBLEM TO OCCUR. SUBARU CUSTOMER SERVICE HAS AGREED TO PAY FOR A PORTION OF THE REPAIR COST.",
        "vin": "4S4BP61C687"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715487,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING FOR THE REAR LIFT GATE LOCK IS BROKEN. THE SAME PROBLEM OCCURRED IN 2013. DEFINITELY FAULTY DESIGN. SUBARU SAYS TO REPLACE THE ENTIRE WIRING HARNESS TO THE LIFT GATE FOR $500+.",
        "vin": "4S4BP61C687"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2015",
        "dateOfIncident": "04/29/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713513,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRES IN THE BOOT BETWEEN THE HATCH AND BODY BECOME BRITTLE OVER TIME AND CAN SNAP WITH HATCH USAGE. I REMOVED THE BOOT AND FOUND ONE WIRE COMPLETELY SEVERED (OPERATING THE HATCH LOCK WHICH HAD STOPPED WORKING). OTHERS WERE FRAYED AND REQUIRED REPAIR (INCLUDING THE WIRES FOR THE BRAKE LIGHTS).  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706472,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK. THE DASH INSTRUMENT PANEL AIRBAG WARNING LIGHT WOULD INTERMITTENTLY COME ON AND STAY ON FOR EXTENDED PERIODS OF TIME. THE RED AIRBAG LIGHT WOULD OCCASIONALLY TURN OFF BUT FOR THE MOST PART IT WAS ON CONTINUOUSLY.  DEALERSHIP ADVISED THAT WHEN THE RED AIRBAG WARNING LIGHT IS ILLUMINATED THE AIRBAG SYSTEM IS INOPERATIVE. THE VEHICLE WAS TAKEN TO OUR LOCAL DEALERSHIP ON 3/30/2015 AND THE SERVICE REPORT INDICATES A SCAN NOTED AIRBAG CODE 26 -PASSENGER SIDE INDICATOR FAILURE.  THE DEALERSHIP RECOMMENDED CORRECTION WAS THE REPLACEMENT OF THE MAP LIGHT ASSEMBLY (PART #92151AG13AOR) FOR A COST IN MATERIAL OF $163.95 AND LABOR OF $34.52, PLUS THE DIAGNOSTIC LABOR OF $35.00. COST TO CORRECT THE PROBLEM WAS NOT COVERED.  THE SERVICE MANAGER WAS VERY FAMILIAR WITH THIS TYPE OF AIRBAG SYSTEM FAILURE IN SUBARUS OF THIS SPECIFIC MODEL YEAR AND ALSO VEHICLES MANUFACTURED WITHIN THE SAME TIME PERIOD.  RESEARCH INDICATES THAT THE AIRBAG WARNING LIGHT PROBLEM IS LOCATED WITHIN THE OVERHEAD MAP LIGHT MODULE AND THE FAILURE OF SOLDERING AT THE LED LIGHTS WITHIN THIS ASSEMBLY.     A NEW MAP LIGHT CONSOLE WAS ORDERED AND HAS BEEN REPLACED WHICH HAS, AT THIS TIME, CORRECTED THE PROBLEM.  THIS SPECIFIC ISSUE IS WELL DOCUMENTED WITH THE N.H.T.S.A. ON LINE COMPLAINT DATA (54 COMPLAINTS ALONG SIMILAR CONSOLE LIGHT PANEL FAILURE).  AIR BAG SYSTEMS HAVE BEEN MANDATORY ON VEHICLES FOR BOTH FRONT SEAT OCCUPANTS SINCE SEPTEMBER 1998. AIRBAG SYSTEMS ARE NOT OPTIONAL EQUIPMENT, AND WITH THE COMBINATION OF SEAT BELTS, REPRESENT THE CRITICAL COMPONENTS OF A PASSENGER SAFETY SYSTEM. THIS SPECIFIC TYPE OF FAILURE INDICATES A PROBLEM THAT HAS NOT BEEN VOLUNTARILY RECALLED OR ADDRESSED BY THE MANUFACTURER. BECAUSE THIS DEFECT INVOLVES A VITAL SAFETY SYSTEM, AND IN ORDER TO PROTECT THE CONSUMER, AN INVESTIGATION AND RECALL SHOULD BE COMMENCED.  *TR",
        "vin": "4S4BP61C787"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/10/2015",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705057,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAGS LIGHT IS ON INTERMITTENTLY.  THE TECH AT THE SUBARU DEALERSHIP SAID IT WAS A PROBLEM IN THE CONNECTION IN THE MAP LIGHT CONSOLE. HE INDICATED THE AIRBAGS WOULD DEPLOY CORRECTLY.  IT APPEARS TO BE A COMMON PROBLEM WITH 2008 OUTBACKS AND OTHER POSTERS HAVE INDICATED THE AIRBAG SYSTEM WILL NOT WORK IF DASHBOARD AIRBAG LIGHT IS ILLUMINATED.  APPARENTLY MANY FOLKS HAVE FOUND A WEAK/AGED SOLDER POINT TO BE THE CAUSE OF AN INTERMITTENT CONNECTION.  GIVEN THE LARGE NUMBER OF OWNERS ENCOUNTERING THIS PROBLEM, SUBARU SHOULD INITIATE A RECALL BASED ON THE SAFETY CONCERNS OF A AN AIRBAG SYSTEM FAILURE IN THE EVENT OF AN ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "02/17/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702116,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING AIRBAG LIGHT COMING ON INTERMITTENTLY ALONG WITH PASSENGER AIRBAG LIGHT. MECHANIC SAID AIRBAGS PROBABLY ARE NOT FUNCTIONING PROPERLY. COST FOR REPAIR WOULD BE BETWEEN $350-$400. FROM READING OTHER COMPLAINTS, THIS IS AN EASY AND CHEAP FIX BUT DANGEROUS IF IT'S NOT REPAIRED. THIS SHOULD BE A RECALL!  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693823,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS SINGLE-OWNER, WELL-CARED FOR OUTBACK ABOUT 1/9/2015.  I WAS ASSURED ALL RECALLS HAD BEEN ADDRESSED.  I SOON REALIZED THE LOW BEAM HEADLIGHTS EXTENDED THE LIGHT-FIELD FOR ONLY A VERY SHORT DISTANCE.  (NO MORE THAN 7 FEET IN FRONT OF CAR).  AT NEXT OIL CHANGE, ASKED TO HAVE THEM LOOKED AT/ADJUSTED.  ABOUT 2 DAYS AFTER THAT WAS DONE, I HAD NO LOW-BEAM HEADLIGHTS.  TOLD THE LOW-BEAMS WERE NOT \"GROUNDING\".  (HIGH BEAMS AND FOG LIGHTS ARE FINE).  WAITED FOR A $300 CONTROL MODULE PART TO COME IN BUT THAT WAS NOT THE PROBLEM.  NOW WAITING FOR ANOTHER $300 FUSE BOX PART TO COME IN - NO GUARANTEE THAT IS THE PROBLEM.  AFTER SEEING SIMILAR CAR COMPLAINTS ON-LINE, REALIZED THIS MAY BE A SAFETY ISSUE (AND A MORE PERVASIVE ISSUE) THAN I THOUGHT.  THE STATE OF WISCONSIN CERTAINLY SEES THIS AS A SAFETY ISSUE AS THEY ISSUE A $187+ TICKET AND THE DRIVER LOSES 3 POINTS.  (I ALREADY GOT ONE TICKET DUE TO THIS PROBLEM WHILE AWAITING PARTS).  I DO NOT HAVE ANOTHER VEHICLE AVAILABLE AND DRIVE OVER 600 MILES (ROUND-TRIP) EACH WEEKEND BETWEEN WORK AND HOME.    *TR",
        "vin": "4S4BP61C087"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693399,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RED \"AIRBAG\" DASH LIGHT COMES ON AND STAYS ON.  THIS RENDERS AIRBAGS INOPERABLE AND CREATES AN UNSAFE DRIVING CONDITION. AN ACCIDENT WITHOUT AIRBAGS IS A SAFETY ISSUE. THE OVERHEAD PASSENGER SIDE AIRBAG INDICATOR ASSEMBLY FAILED AND NEEDED TO BE REPLACED FOR $333.24. RESEARCH INDICATES THAT POOR SOLDERING ON THE AIRBAG CIRCUIT BOARD CAUSES THE INDICATOR ASSEMBLE TO FAIL. BASED ON THE NUMBER OF COMPLAINTS, AND THE FACT THAT THIS COULD RESULT IN SERIOUS INJURY IN THE EVENT OF AN ACCIDENT, THIS SHOULD BE A RECALL SITUATION.  *TR",
        "vin": "4S4BP61C487"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691663,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS \"GHOST WALKING\" AS DEFINED IN THIS THREAD: HTTP://WWW.SUBARUOUTBACK.ORG/FORUMS/66-PROBLEMS-MAINTENANCE/16527-ALL-GHOSTWALKING-OUBACK-OWNERS-PRINT.HTML    THE REAR OF THE VEHICLE SLIDES FROM SIDED TO SIDE AT A CERTAIN FREQUENCY ABOVE 35 MPH IN SNOW CONDITIONS. THIS PROBLEM GETS WORSE AS MORE WEIGHT IS ADDED TO THE VEHICLE.   *TR",
        "vin": "4S4BP61C287"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690457,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT COMES ON INTERMITTENTLY ON MY 2008 SUBARU OUTBACK. I?M NOT SURE UNDER WHAT SPECIFIC CONDITIONS, SOMETIMES THE LIGHT STAYS ON FOR DAYS. AND RECENTLY IT HAS BEEN ON CONTINUOUSLY. THE AIRBAG LED INDICATOR FOR THE PASSENGER SEAT DOES NOT WORK.     I TOOK THE OUTBACK TO THE SUBARU DEALER, AND THEY SAID I NEEDED TO REPLACE OVERHEAD CONSOLE MODULE DUE TO SHORTING AND CHARGED ME $117 FOR THE INSPECTION, $137 FOR THE PART, $148 FOR SERVICE AND TAX. THE TOTAL WILL BE $402.    I RESEARCHED THE PROBLEM ONLINE AND FOUND MANY PEOPLE HAD SOLVED THIS PROBLEM WITH SIMPLY SOLDERING THE CONNECTION FOR ALMOST NO COST. THE SUBARU DEALER SERVICE NEVER OFFERED TO TRY SOLDERING, ONLY WARNED ME THAT THE AIRBAG WOULDN'T WORK WHEN LIGHT WAS ON.     THE SHEER NUMBER OF COMPLAINTS FILED AND SUBJECT DISCUSSIONS ONLINE SHOW THAT THIS PROBLEM IS PREDICTABLE AND COULD BE SOLVED CHEAPLY.     SUBARU MUST MAKE BETTER SOLDERING, ESPECIALLY WHEN LIFESAVING AIR BAGS ARE AT STAKE.    *JS",
        "vin": "4S4BP61C187"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2015",
        "dateOfIncident": "02/03/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683065,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M UPDATING MY 2/3/15 COMPLAINT 10680982. I CONTACTED SUBARU DIRECTLY ON THE SAME DAY AND INCLUDED A COPY OF THE COMPLAINT I FILED WITH NHTSA AND MY BILL FOR THE REPLACEMENT OF THE OVERHEAD AIRBAG CONTROL MODULE.  IN THE REPORT THE SUBARU TECH SAID THE UNIT WAS SHORTING OUT, SHOWING CODE \"26 FOR PASSENGER?S AIRBAG INDICATOR FAILURE AND S8 AIRBAG LIGHT ON.\" I ALSO GAVE SUBARU MY TALLY OF MY FIRST CURSORY SEARCH OF THE NHTSA COMPLAINTS DATABASE ON THE WORD \"AIRBAG\" FOR ALL MODELS OF SUBARU FROM 2000 TO PRESENT.  THE SEARCH RESULTED IN 145 COMPLAINTS.  AFTER I LOOKED THROUGH THE FIRST 60 COMPLAINTS I FOUND 45 OF THEM THAT SEEMED TO BE ABOUT THIS EXACT PROBLEM - THE AIRBAG WARNING LIGHT ON THE DASHBOARD AND/OR PASSENGER SIDE AIRBAG OVERHEAD INDICATOR GOING ON AND OFF INTERMITTENTLY.  THESE COMPLAINTS WERE ACROSS EVERY MODEL OF SUBARU AND YEARS FROM 2003 TO 2013.  MY 2008 OUTBACK HAD THE MOST COMPLAINTS - 13.  OTHER SEARCHES FOR DIFFERENT KEY WORDS AND SPELLINGS OF AIRBAG RESULTED IN MANY HUNDREDS OF RESULTS, TOO MANY FOR YOUR DATABASE TO DISPLAY, PROBABLY MANY OF THEM WERE ABOUT THE RECENT AIRBAG RECALL ISSUE. SUBARU'S CUSTOMER SERVICE DEPARTMENT RESPONDED IMMEDIATELY AND ON 2/12/15 THEY PROMISED TO REIMBURSE ME FOR THE ENTIRE $352, THE TOTAL COST OF PARTS AND LABOR TO REPLACE THE MODULE.  I URGE ALL SUBARU OWNERS TO TEST THEIR PASSENGER AIRBAG LIGHTS AND THOSE WITH PROBLEMS TO LODGE A FORMAL NHTSA COMPLAINT AND REPORT IT TO SUBARU.   SINCE THE AIRBAG DOESN'T WORK WHEN THE LIGHT ISN'T WORKING PROPERLY THIS IS A VERY DANGEROUS PROBLEM!  ENOUGH COMPLAINTS TO THE NHTSA WILL HELP PRESSURE SUBARU TO FINALLY LET ALL POTENTIALLY AFFECTED OWNERS KNOW ABOUT IT.    *TR",
        "vin": "4S4BP61C786"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2015",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682393,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT TURNS ON INTERMITTENTLY ON DASH AND OVERHEAD. NOT SURE AIRBAGS ARE WORKING.  DEALER SERVICE DEPARTMENT CANNOT FIND PROBLEM.  *TR",
        "vin": "4S4BP61C687"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681213,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS SUDDENLY BECOME VERY STICKY/TACKY, AND EXTREMELY SHINY.  ATTEMPTS TO CLEAN OR REMOVE APPARENT RESIDUE HAVE HAD NO EFFECT ON STICKINESS, AND LINT FROM RAGS OR PAPER TOWELS TENDS TO STICK TO DASH.  IN SUNLIGHT, MOONLIGHT OR STREETLIGHT, DASHBOARD SURFACE REFLECTS ONTO WINDSHIELD AND POSES A SAFETY HAZARD.  DASHBOARD PLASTIC APPEARS TO BE CHEMICALLY BREAKING DOWN OR MELTING.  A SIMILAR ISSUE AFFECTED SEVERAL MILLION TOYOTA VEHICLES FROM THE SAME MANUFACTURE DATE (2007-8), PARTICULARLY IN SUNNIER STATES WITH MORE UV EXPOSURE (FL, AZ, CA) AND TOYOTA ISSUED A RECALL.  SUSPECT THE SAME/A SIMILAR SUBCONTRACTOR PROVIDED SIMILAR/IDENTICAL PLASTIC TO BOTH MANUFACTURERS.  OUR CAR HAS BEEN KEPT MOSTLY OUTDOORS IN MD, CA AND HI.  SUBARU HAS YET TO FOLLOW TOYOTA IN ISSUING A RECALL.  SEVERE VISIBILITY HAZARD.  *TR",
        "vin": "4S4BP86C084"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680831,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING VEHICLE IN HEAVY SNOW, SUDDENLY LOST POWER, THE DASH LIGHT FLASHED, THE INSTRUMENT CLUSTER NEEDLES MOVED AS IF THE CAR WAS STARTING UP.  COULD NOT RESTART ENGINE, WOULD NOT CRANK. ALL OTHER ELECTRICAL EQUIPMENT WORKED.  SAT IN HEAVY SNOW FOR TWO HOURS (NO TOW TRUCKS AVAILABLE UNTIL NEXT DAY). SUDDENLY AFTER ATTEMPTING TO RESTART AFTER MANY FAILED ATTEMPTS, IT DID.  DROVE IT HOME FINE. STALLED NEXT DAY ON WAY TO REPAIR SHOP. HAD CAR TOWED AND SHOP FOUND ONE CODE, BUT NOTHING ELSE WRONG.  DROVE HOME FINE, RAN CAN FOR 45 MINS, FINE. NEXT DAY DROVE FOR 35 MIN TO WORK, FINE BUT LEFT WORK AND IMMEDIATELY STALLED JUST LIKE FEW DAYS BEFORE.  TOWED TO SUBARU DEALER AND TOOK A DAY TO FIGURE OUT WAS MAIN ENGINE COMPARTMENT WIRING HARNESS.  REPLACED WITH MINIMAL CHARGE OF $50, EVEN THOUGHT THREE MONTHS OUT OF WARRANTY.  VEHICLE HAS BEEN FINE SINCE THEN.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680982,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT COMES ON INTERMITTENTLY ON 2008 SUBARU OUTBACK, NOT SURE UNDER WHAT SPECIFIC CONDITIONS, SOMETIMES THE LIGHT STAYS ON FOR DAYS.  DEALER SERVICE SAID I NEEDED TO REPLACE OVERHEAD CONSOLE MODULE DUE TO SHORTING AND CHARGED ME $350. AFTER RESEARCHING THE PROBLEM I FOUND MANY PEOPLE HAD SOLVED THIS PROBLEM WITH SIMPLY SOLDERING THE CONNECTION FOR ALMOST NO COST.  DEALER SERVICE NEVER OFFERED TO TRY SOLDERING, ONLY WARNED ME THAT THE AIRBAG WOULDN'T WORK WHEN LIGHT WAS ON.  THE SHEER NUMBER OF COMPLAINTS FILED AND SUBJECT DISCUSSIONS ONLINE SHOW THAT THIS PROBLEM IS PREDICTABLE AND COULD BE SOLVED CHEAPLY.  I WOULD LIKE TO SEE SUBARU HELD ACCOUNTABLE FOR ALL THE MONEY OWNERS HAVE SPENT ON THIS AVOIDABLE AND SIMPLE PROBLEM.  *TR",
        "vin": "4S4BP61C786"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "01/21/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679991,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKETS FAILED AND, ONCE DISASSEMBLED, VALVES WERE FOUND TO BE LEAKING.  *TR",
        "vin": "4S4BP61C286"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "01/11/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671919,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MELTED DASHBOARD ON 2008 SUBARU OUTBACK 2.5I.  CAUSING GLARE IN WINDSHIELD REDUCING VISIBILITY.  *TR",
        "vin": "4S4BP61C687"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669760,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT STAYS ON, AND THE AIR BAG SYSTEM IS DISABLED WHILE THE LIGHT IS ON.  THIS IS A VERY WELL KNOWN AND DOCUMENTED PROBLEM THAT CAN BE CURED; HOWEVER, BECAUSE OF THE COST IT HAS NOT BEEN REMEDIED.  THE PART USED IS THE PRIMARY CULPRIT AND REGRETTABLY HAS BEEN INSTALLED IN SUBARU VEHICLES ACROSS SEVERAL MODEL YEARS.  SUBARU THE MANUFACTURER HAS FAILED TO RESPOND RESPONSIBLY; ERGO, NHTSA ACTION IS NEEDED TO BRING SUBARU TO TASK AND COMPLIANCE TO ENSURE ALL NECESSARY REPAIRS ARE PERFORMED FOR SAFE DEPLOYMENT OF ALL SUBARU CABIN AIR BAGS.  WHEN WORKING PROPERLY, AIR BAGS SAVE LIVES.  *TR",
        "vin": "4S4BP61CX87"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "11/17/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668661,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH AIRBAG LIGHT COMES ON INTERMITTENTLY, AND THIS DISABLES THE AIRBAG. DEALER STATES THIS IS A KNOWN PROBLEM, BUT CAN ONLY FIX BY TRIAL AND ERROR REPLACING (EXPENSIVE) COMPONENTS. IT HAPPENS MOST ON COLD WET WEATHER DAYS, OFTEN GOES OFF WHEN CAR WARMED UP, SO PROBABLY ELECTRICAL. HAS CONTINUED FOR YEARS NOW, STILL HAPPENING AT 105,000 MILES. MANY MANY EXAMPLES ON INTERNET BOARDS OF PEOPLE WITH THIS SAME PROBLEM. SHOULD BE A SAFETY RECALL!  *TR",
        "vin": "4S4BP62C057"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667011,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY REPLACED HEADLIGHTS DID NOT ILLUMINATE ON A RETURN TRIP HOME. THEY TURNED OFF WITHOUT WARNING WHILE DRIVING.  ACCORDING TO THE DEALER, THE WIRING HARNESS FAILED. *TR",
        "vin": "4S4BP60C587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/05/2014",
        "dateOfIncident": "10/29/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662444,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT ON THE DASH ILLUMINATES DUE TO A FLAWED PART IN THE SYSTEM. THIS IS A COMMON PROBLEM WITH THIS SERIES OF SUBARUS AND DISABLES THE AIRBAGS WHILE THE CAR IS IN USE, A VERY DANGEROUS AND POSSIBLY DEADLY PROBLEM. SUBARU HAS BEEN AWARE OF THIS PROBLEM FOR YEARS BUT REFUSES TO DO ANYTHING ABOUT IT. THE PART AND ITS REPLACEMENT ARE EXPENSIVE AND OFTEN DOES NOT GET REPAIRED BECAUSE IT IS AT THE OWNER'S EXPENSE. MY FEELING IS THAT SAFETY EQUIPMENT SHOULD BE WARRANTED BY THE MANUFACTURER FOR THE REASONABLE LIFE OF THE AUTOMOBILE.   THE FLAWED PART HAS BEEN USED FOR YEARS WITH SUBARU'S FULL KNOWLEDGE THAT THE PART IS FLAWED.  *TR",
        "vin": "4S4BP61C187"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "07/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660018,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY FOLLOWING THE REPLACEMENT OF OUR CATALYTIC CONVERTER I WROTE TO SUBARU TO INQUIRE ABOUT REIMBURSEMENT. THERE WAS NO RESPONSE. THE REPLACEMENT COST WAS $728.08. APPARENTLY ONLY SEVEN STATES ISSUED A MANDATORY RECALL. VIRGINIA ISN'T ONE OF THEM. THE VEHICLE WAS RELIGIOUSLY MAINTAINED, ALL SUPPORTED BY DOCUMENTATION. AT 97,600 MILES THE CATALYTIC CONVERTER WEARING OUT HAD SOMETHING TO DO WITH THE PART ITSELF.     REIMBURSEMENT FOR THIS CATALYTIC CONVERTER WOULD GO A LONG WAY IN OUR FUTURE DECISION OF WHICH BRAND CAR TO BUY. IT'S KNOWN IN MARKETING IT COSTS A LOT LESS TO KEEP A CUSTOMER THAN TO GAIN A NEW ONE.  *TR",
        "vin": "4S4BP62C087"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659622,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT INTERMITTENTLY TURNS ON. LIKELY DUE TO A FAULTY ELECTRICAL CONNECTION BEHIND THE MAP LIGHT CONSOLE. AIRBAGS WILL NOT DEPLOY IN THE EVENT OF AN ACCIDENT! THIS IS AN INCREDIBLY COMMON PROBLEM AND SUBARU REFUSES TO ADDRESS IT.    *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659053,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC / RADIO (CD 6 DISC CHANGER MODEL) FAST FLASHING, ALL FUNCTIONS STAY ENABLED BUT CAN NOT BE CONTROLLED FROM THE PANEL. CAN NOT TURN ON DEFROST UNIT OR ADJUST TEMPERATURE OR RADIO CONTROLS WHILE FLASHING OCCURS. THIS HAPPENS INTERMITTENTLY FOR A YEAR AND HAS GOTTEN SIGNIFICANTLY WORSE WHERE CONTROLS ARE UNAVAILABLE FOR 20 MINUTES OR MORE AT A TIME. DANGEROUS SITUATION IN WINTER WHEN YOU CAN NOT USE THE DEFROST BUTTONS TO DEICE WINDOWS OR CONTROL WINDOW FOGGING.  *TR",
        "vin": "4S4BP62C087"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2014",
        "dateOfIncident": "08/21/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653675,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIRBAG ON/OFF LIGHT MALFUNCTIONING.  SOMETIMES CEILING CONSOLE PASSENGER INDICATOR LIGHT COMES ON TO INDICATE BAG IS OFF (SUPPOSED TO HAPPEN WHEN LESS THAN 25 LBS IN PASSENGER SEAT) AND SOMETIMES IT DOESN'T. SOMETIMES DASHBOARD RED AIRBAG WARNING LIGHT COMES ON TO INDICATE MALFUNCTION WITH BAG AND SOMETIMES IT DOESN'T.  SOMETIMES THE PASSENGER AIRBAG ON/OFF LIGHT SHOWS DIMLY AS IF IT'S TRYING TO ILLUMINATE.  SEEMS LIKE A WIRING PROBLEM BASED ON INTERMITTENT ILLUMINATION BUT DEALER SAID NEEDED NEW $300 PLUS INDICATOR SWITCH BUT THEY WERE SURE AIRBAG WORKING PROPERLY.  HAVE ALREADY HAD SERIOUS PROBLEM WITH QUALITY OF WORK DONE BY THIS DEALER SO UNSURE OF WHETHER THEY REALLY KNOW WHAT'S HAPPENING.  WHY NO RECALL FROM SUBARU?  I SEE SEVERAL OTHER COMPLAINTS HERE ABOUT THE EXACT SAME PROBLEM.  *TR",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651580,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK SPORT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT REMAINED ON AFTER IGNITION AND WHILE DRIVING.  THIS HAPPENED INTERMITTENTLY UNTIL I REPLACED THE MAP LIGHT CONSOLE RECENTLY.  PROBLEM SOLVED.  THIS SHOULD BE A RECALL ITEM AS IT AFFECTS AN IMPORTANT SAFETY FEATURE OF THE CAR, I.E., THE AIRBAGS.   *TR",
        "vin": "4S4BP60C387"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644758,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN HEAD GASKET, DAMAGE OCCURRED OVER MANY YEARS WHILE CAR WAS UNDER WARRANTY AND WAS BEING SERVICED REGULARLY BY THE SUBARU DEALER. NO NOTIFICATION OF THIS DAMAGE WAS GIVEN TO ME UNTIL THE CAR WAS JUST OUTSIDE OF ITS WARRANTY. PREVIOUSLY SUBARU HAS ACKNOWLEDGED THIS DEFECT WHICH COULD CAUSE AN ENGINE TO SEIZE WHILE DRIVING CAUSING A SAFETY ISSUE IF THAT OCCURRED ON A HIGHWAY.  *TR",
        "vin": "4S4BP61C486"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638394,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT IS INTERMITTENTLY COMING ON WHILE DRIVING. CHECKED ONLINE AND FOUND OUT THIS IS A VERY COMMON PROBLEM. WHEN LIGHT IS ON VEHICLE AIR BAGS WILL NOT DEPLOY IN AN ACCIDENT. I DON'T UNDERSTAND WHY THIS PROBLEM WAS NOT HANDLED BY SUBARU AS A VOLUNTARY RECALL. THIS IS A SERIOUS SAFETY ISSUE.  *TR",
        "vin": "4S4BP62C587"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631141,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DASH LIGHT ON RENDERING AIRBAGS INOPERABLE. NO CRASH. FAULT IN PART. SIGNIFICANT SAFETY ISSUE. WHY NO RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628035,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT ON THE DASHBOARD CAME ON. I ALSO NOTICED THE LIGHT THAT SHOULD HAVE INDICATED THAT THE PASSENGER AIRBAG WAS OFF WAS NOT LIT. THE AIRBAGS WILL NOT DEPLOY WHEN AIRBAG LIGHT IS ON. AFTER RESEARCHING, I FOUND SEVERAL PEOPLE WITH THE EXACT PROBLEM AND THAT IT IS RELATED TO FAULTY WIRING IN OVERHEAD MAP LIGHT CONSOLE THAT CONTAINS THE PASSENGER AIRBAG INDICATORS. I PURCHASE A NEW LIGHT CONSOLE AND THE PROBLEM WAS FIXED. THIS IS A SAFETY ISSUE BECAUSE THE AIRBAGS WON'T DEPLOY AND SHOULD BE FIXED BY THE MANUFACTURER.  *TR",
        "vin": "4S4BP61C187"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625888,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE FAILED WHEEL BEARING BY 100K. ONE AT 30K, THE SECOND AT 67K. THE THIRD AT 90K. THE DEALERSHIP COULDN'T FIND ANYTHING AT 90K. AT 103K, THERE IS A HALF INCH OF PLAY IN THE FRONT PASSENGERS SIDE WHEEL AND IT SOUNDS LIKE A JET AIRPLANE. THIS IS UNACCEPTABLE. THIS IS A SERIOUS SAFETY ISSUE THAT IS NOT BEING TAKEN SERIOUSLY BY SUBARU OF NORTH AMERICA. IF THIS BEARING FAILED AT HIGHWAY SPEED IT WOULD BE CATASTROPHIC.  *TR",
        "vin": "4S4BP61C187"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622351,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IN DASHBOARD COMES ON AND AIRBAG LIGHT IN OVERHEAD CONSOLE DOES NOT DISPLAY PROPER INFO. 55000+ HITS IN INTERNET POINT TO BAD SOLDER JOINTS IN OVERHEAD CIRCUIT BOARD. ONCE LOOSE RESISTORS ARE RE-SOLDERED PROBLEM GOES AWAY. DEALERS ARE CHARGING UP TO $500 TO REPLACE OVERHEAD CONSOLE. THIS PROBLEM OF BAD SOLDER JOINTS GOES OVER SEVERAL MODEL YEARS. WHY HAS THERE NOT BEEN A SAFETY RELATED RECALL OVER AIRBAG ISSUES WHICH EXPIRE WHEN WARRANTY EXPIRES? THERE SHOULD BE NO EXPIRATION DATE ON SAFETY!  *TR",
        "vin": "4S4BP61C386"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2014",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616172,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG LIGHT SHOWS TO BE \"OFF.\"  I RECENTLY PURCHASED THIS CAR AND HAVE AN ELDERLY FRIEND IN THE PASSENGER SEAT. IN MY CONCERN, I SEARCHED OTHER SITES AND FOUND THAT OTHERS ARE POSTING THIS ISSUE ON VARIOUS SITES. FROM WHAT I READ, IT'S NOT CLEAR IF THIS MEANS THE PASSENGER AIRBAG IS NOT WORKING.   I CHECKED RECALLS AND SEE THAT JULY 4, 2014 A RECALL WAS PUT OUT FOR THIS PROBLEM ON CERTAIN SUBARU MODELS OF YEARS 2003 AND 2004.  FROM THE COMMENTS I'VE READ, PARTICULARLY ABOUT THE 2008 OUTBACK, THERE SHOULD BE A RECALL FOR THIS ISSUE FOR 2008 OUTBACK.  *TR",
        "vin": "4S4BP61C887"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/19/2014",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614682,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED SHOWING SIGNS OF ELECTRICAL PROBLEMS 2 MONTHS AGO WHEN THE REAR VIEW MIRROR HOMELINK WOULD ONLY HAVE POWER INTERMITTENTLY. PROBLEM PROGRESSED TO THE REVERSE LIGHTS AND NOW AFFECTS THE HEADLIGHTS. THE HEADLIGHTS WENT OUT AT NIGHT AS I WAS LEAVING A PARKING LOT, A DEFINITE HAZARD. HAVE RESEARCHED THE PROBLEM ON SUBARU ONLINE FORUMS AND DISCOVERED THAT THE PROBLEM IS THAT INDIVIDUAL WIRES IN THE WIRING HARNESS HAVE A TENDENCY TO CRACK AND BREAK AT THE JOINT BETWEEN THE BODY AND THE LIFTGATE.  THIS VEHICLE HAS 2 COMPLETELY BROKEN WIRES AND MOST OTHERS WITH BREAKS IN THE INSULATION.  OTHER OWNERS DESCRIBE SIMILAR PROBLEMS.  *TR",
        "vin": "4S4BP62C787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614524,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT INTERMITTENTLY ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 84,000 AND THE CURRENT MILEAGE WAS 89,400.   UPDATED 08/25/14*LJ",
        "vin": "4S4BP62C387"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2014",
        "dateOfIncident": "01/23/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598402,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO AND HEATER, A/C AND DEFROSTER CONTROLS ARE ALL ONE PIECE IN MY CAR. THE DISPLAY SCREENS ON BOTH GO BLANK WITHOUT WARNING. WHEN THIS HAPPENS NOTHING WORKS, MOST IMPORTANTLY THE DEFROSTER WHEN YOU BAD WEATHER WHILE DRIVING. THE OUTPUT TEMPERATURE AND FAN SPEED CANNOT BE CHANGED AND THE DEFROSTER CANNOT BE TURNED ON OR OFF. THE FACTORY RADIO-A/C CONTROL UNIT WENT BAD AND WAS USELESS. SUBARU WAS UNABLE TO PROVIDE SERVICE PARTS SINCE IT IS NO LONGER AVAILABLE NEW, ONLY AS A REBUILT UNIT, AND SUBARU HAS NO CORES TO REBUILD NOR DO THEY KNOW WHEN THEY WILL GET ONE. I BOUGHT A USED RADIO-A/C UNIT FROM A JUNKYARD AND INSTALLED IT ABOUT A YEAR AGO. NOW THIS UNIT IS STARTING TO GO BAD. I HAVE CONTACTED PANASONIC TO FIND AN AUTHORIZED REPAIR FACILITY AND THEY CANNOT IDENTIFY MY RADIO EVEN WITH THE NUMBERS ON THE TAG THAT SAYS MADE BY PANASONIC, SO THEY CANNOT TELL ME WHERE I CAN GET IT REPAIRED. SUBARU HAS BEEN JUST AS USELESS. I CAN LIVE WITHOUT A RADIO, BUT WHEN MY WINDSHIELD FOGS UP AT 60 MPH AND I CANNOT TURN THE DEFROSTER ON OR IT'S 20 DEGREES OUT AND I CANNOT TURN THE HEAT ON, THIS BECOMES A SAFETY ISSUE. I CHECKED A SUBARU OWNERS WEBSITE AND FOUND NUMEROUS PEOPLE WITH 2005-2008 MODELS SAYING THEY HAD THE SAME PROBLEM. I HAVE OWNED THE CAR SINCE NEW AND BESIDES CHANGING THE OIL MYSELF, ALL OTHER REPAIRS ON THE CAR HAVE BEEN DONE BY A SUBARU DEALER. THE DEALER EVEN INSTALLED THE JUNKYARD RADIO. THE LAST CONTACT I HAD WITH THE SUBARU FACTORY, THEY ARE BLAMING THE PROBLEM ON ME USING AN AFTERMARKET RADIO. MY LOCAL SUBARU DEALER CONFIRMED THRU SERIAL NUMBERS THAT THE RADIO FROM THE JUNKYARD IS THE EXACT SAME RADIO-A/C UNIT THAT CAME IN MY CAR WHEN NEW. SINCE SUBARU NO LONGER USES PANASONIC RADIOS, THEY ARE NO LONGER PROVIDING ANY PRODUCT SUPPORT ON PANASONIC PRODUCTS. SUBARU IS REQUIRED BY LAW TO PROVIDE SERVICE PARTS FOR AT LEAST 7 YEARS AND THEY ARE NOT DOING IT.    *JS",
        "vin": "4S4BP63C284"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2014",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587339,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CARPET HAD BAD SPOT UPON PURCHASE, TOLD BY DEALER DEFECT AND NOTHING COULD BE DONE.  THAT SPOT IS NOW A HOLE IN THE CARPET.        SEAT MATERIAL IS VERY CHEAP AND LOW QUALITY STARTED TO WEAR BEFORE 1K.  THAT TOO HAS LEFT A HOLE IN THE SEAT.      AT 37K PASSENGER CV BOOT WENT DUE TO THIN RUBBER BOOT FOLLOWED BY DRIVER BOOT AT 38K.  BOOT RUBBER IS EXTREMELY THIN COMPARED TO OTHER MANUFACTURERS.  WHEN THEY GO, THEY GO QUICKLY WITHOUT WARNING THE SMELL IS HORRIFIC AND THE STICKY RESIDUE LEFT BEHIND UNDER THE HOOD VISUALLY UNAPPEALING.  AS TO THE BOOTS, OUR WEATHER RUBBER CAR MATS ARE THICKER AND CERTAINLY LESS EXPENSIVE!        AT 68K CLUTCH WENT; POWER-STEERING PUMP WAS LEAKING AND A/C / ALTERNATOR BELTS WERE CRACKED.  THIS CAR HAS NEVER MISSED A MAINTENANCE AND HAS BEEN IMMACULATELY CARED FOR SO IMAGINE OUR DISAPPOINTMENT.  THE CLUTCH RESULTED IN THE CAR STALLING IN RUSH HOUR TRAFFIC.      THIS CAR DID NOT LIVE UP TO THE SUBARU REPUTATION OF SAFETY AND QUALITY.  I WOULD NOT ENTERTAIN THE THOUGHT OF EVERY PURCHASING ANOTHER SUBARU.    *TR",
        "vin": "4S4BP61C186"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2013",
        "dateOfIncident": "12/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556437,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON SLIGHTLY SLICK ROADS IN NORTHERN MICHIGAN THE REAR WHEELS WOULD LOSE TRACTION AND START TO FISH TAIL. THIS HAPPENED WITHOUT THE GAS APPLIED, WITH OR WITHOUT THE TRACTION CONTROL ENGAGED.  THE CAR FELT AS IF IT WAS SLIDING SIDE TO SIDE IN THE BACK.  THE TIRES ARE IN GOOD CONDITION AND THE VEHICLE IS WELL MAINTAINED. OTHER VEHICLES WERE TRAVELING WITHOUT ISSUE.  THIS HAS BEEN REFERRED TO AS GHOST WALKING IN ON LINE BLOGS.  THIS IS EXTREMELY UNSAFE AND DANGEROUS.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555783,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT COMES ON INTERMITTENTLY SOMETIMES AND OTHER TIMES STAYS ON.  I WAS TOLD THAT THIS HAS BEEN A PROBLEM WITH THIS YEAR, MAKE AND MODEL CAR AND THAT THE PASSENGER AIRBAG COULD BE DEFECTIVE.  THIS SHOULD BE A RECALL BY SUBARU AS IT IS A SAFETY ISSUE.  I HAVE READ NUMEROUS COMPLAINTS ONLINE REGARDING THIS YEAR OUTBACK.  THE CONSUMER SHOULD NOT HAVE TO PAY FOR A DEFECTIVE PART THAT SUBARU IS WELL AWARE OF AND IT IS THEIR RESPONSIBILITY TO CORRECT.   *TR",
        "vin": "4S4BP61C687"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "08/16/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537867,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS FAILED. THE CONTACT MENTIONED THAT THE FAILURE WOULD RECUR EVERY SIX MONTHS WHERE THE BULB NEEDED TO BE REPLACED EACH TIME. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 120,000.",
        "vin": "4S4BP61C387"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "08/29/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537950,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS BEEN ON INTERMITTENTLY SINCE 2010 DID NOT REPAIR AS THE CODE COULD NOT BE READ AND OUTSIDE OF WARRANTY. NOW CONSTANTLY ON MECHANICS TELLS ME THAT IT IS THE INDICATOR CIRCUIT ABOVE THE REAR VIEW MIRROR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "08/29/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537953,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRES IN THE REAR HATCH BREAK REPEATEDLY. WIRING HARNESS COMES FROM THE ROOF AND INTO THE REAR HATCH; MOST OF THE WIRES WORN AND MECHANIC HAS SPLICED MORE THAN HALF INCLUDING THE ANTENNA WIRE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2013",
        "dateOfIncident": "01/20/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536262,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE.  IT WAS WINTER IN WISCONSIN.  THE ROADS WERE MOSTLY CLEAR, BUT IT WAS STARTING TO SLEET.  WHILE DRIVING, ANY TIME I WOULD GO UNDER A BRIDGE, THE REAR OF THE CAR WOULD DRAMATICALLY SHIFT TO ONE SIDE OR THE OTHER.  I SLOWED DOWN TO 45 MPH, AND THE PROBLEM ALMOST SEEMED TO GET WORSE.  IT WOULD BE FINE UNTIL I WENT UNDER A BRIDGE WHERE THE ROAD SEEMED TO BE A LITTLE ICY.  IT WAS ACTING LIKE THE REAR TIRES WERE COMPENSATING TOO MUCH FOR THE CAR.  MY TIRES HAD 75% TREADLIFE LEFT ON ALL 4 TIRES.  THERE WAS A LITTLE EXTRA WEIGHT IN THE VEHICLE.  THERE WERE 3 PEOPLE IN THE CAR ALONG WITH APPROXIMATELY 200LBS IN THE REAR CARGO AREA.  WHEN THE ROADS GOT A LITTLE MORE ICE ON THEM, SO THAT IT WASN'T JUST UNDER BRIDGES, THE CAR WAS MOVING ALL OVER THE PLACE AND I WAS CONVINCED THAT THERE WAS GOING TO BE AN ACCIDENT.    I HAVE ALSO NOTICED THIS WHEN DRIVING ON DRY PAVEMENT IF THERE IS ANY WEIGHT IN THE REAR OF THE VEHICLE.  WHEN THE REAR TIRES HIT A BUMP OR A CRACK IN THE ROAD, IT WILL SHIFT THE REAR END OF THE CAR TO THE RIGHT OR LEFT, USUALLY TO THE RIGHT.  I HAVE RESEARCHED THIS AND IT IS A VERY COMMON THING KNOW AS GHOSTWALKING IN SUBARU OUTBACKS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2013",
        "dateOfIncident": "07/22/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535963,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT ON THE DASHBOARD CAME ON AND STAYED ON UPON DRIVING.  THE VEHICLE WAS TAKEN TO THE DEALER (PERRY SUBARU IN NORFOLK, VIRGINIA), WHO SAID THAT THE PASSENGER FRONT AIRBAG INDICATOR ASSEMBLY WAS FAULTY.  DEALER SAID THERE WAS NO MANDATORY OR VOLUNTARY RECALL ON THIS PART.  A NEW AIR BAG CONTROL MODULE (PART NO. 92151AG13AOR) WAS PURCHASED BY THE OWNER AND INSTALLED FOR A TOTAL COST OF $364.40.  THERE HAVE BEEN A NUMBER OF COMPLAINTS BY OTHER OWNERS OF THIS MODEL YEAR AND OTHER MODEL YEAR SUBARUS FOR THE SAME AIR BAG INDICATOR LIGHT PROBLEM.  THIS IS A SERIOUS SAFETY ISSUE THAT THE NTSB SHOULD INVESTIGATE.  *TR",
        "vin": "4S4BP61CX87"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2013",
        "dateOfIncident": "08/09/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534660,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BUYING CAR NOTICED AIR BAG LIGHT WAS ON WHILE DRIVING HOME. BEING A SAFETY ISSUE I STARTED INVESTIGATING. LOOKS TO BE FAIRLY COMMON. MAY BE ENOUGH FOR A RECALL. JUST WANTED TO REPORT IT FOR FUTURE REFERENCE. DEALER SAID SHOP DID NOT NOTICE LIGHT DURING THEIR INSPECTION.  *TR",
        "vin": "4S4BP63C284"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "07/12/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515795,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL LOOSE ACCELERATION WITHOUT WARNING. THIS HAS HAPPENED SIX (6) TIMES. WHEN THIS OCCURS PRESSING THE GAS PEDAL DOES NOTHING. THE VEHICLE'S SPEED IMMEDIATELY DROPS TO ABOUT 5 MPH. THE \"ENGINE\"  AND \"CRUISE\" LIGHTS ILLUMINATE. THE TACHOMETER CONTINUALLY FLUCTUATES BETWEEN 2500AND 3000 RPM DURING THIS TIME, . ONE MUST PULL OVER AND TURN OFF THE ENGINE, LET IT SET FOR A FEW MINUTES THEN RESTART THE ENGINE IN ORDER TO RESET THE ACCELERATION SYSTEM. WE HAVE HAD SEVERAL NEAR ACCIDENTS AS DRIVERS BEHIND OUR VEHICLE NEEDED TO SWERVE AWAY FROM OUR VEHICLE AS IT LOST ACCELERATION.  SUBARU PERFORMED THE FOLLOWING.  1. FLASHED THE ENGINE CONTROL MODULE (ECM) CODE TWICE.  2. REPLACED THE GAS PEDAL ASSEMBLE TWICE  3. REPLACED THE ENGINE WIRING HARNESS ONCE  4. REPLACED THE ENGINE CONTROL MODULE (ECM) ONCE.  I HAVE THREE (3) SERVICES CASES RECORDED WITH SUBARU OF AMERICA (SOA). THE CASE NUMBERS ARE AS LISTED.  > 1-2810691799 FILED ON DECEMBER 17, 2012  > 1-2888482660 FILED ON DECEMBER 26, 2012  > 1-4032748404 FILED ON MAY 21, 2013  THE ECM WAS REPLACED ON MAY 29, 2013 AND WE HOPE THIS WILL RESOLVE THE PROBLEM.   HOWEVER DURING THIS TEN (10) MONTH PERIOD OF TIME SOA ALWAYS PROMISED TO CORRECT THE PROBLEM YET DID SO RELUCTANTLY. AS THE NUMBER OF INCIDENTS WENT FROM 3 TO 6 SOA CUSTOMER SERVICES WAS NOT AT ALL CUSTOMER ORIENTATED.  THESE FAILURES ARE A SAFETY ISSUE. ACCIDENT, INJURY OR DEATH COULD HAVE BEEN THE END RESULT OF ANY OF THESE INCIDENTS. WE HAVE BEEN VERY LUCKY BUT HONESTLY DO NOT KNOW THAT THE PROBLEM HAS BEEN RESOLVED.  *TR",
        "vin": "4S4BP61C087"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "05/16/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515123,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED MAKING HUMMING NOISE FROM REAR END WHICH GOT PROGRESSIVELY WORSE. BROUGHT IT INTO THE DEALER WHO TOLD ME THE REAR BEARINGS WERE BAD. I WAS TOLD THEY WEREN'T COVERED SINCE MY WARRANTY HAD EXPIRED. EARLY FAILURE OF WHEEL BEARINGS IS APPARENTLY A KNOWN ISSUE WITH SUBARU AND SHOULD BE COVERED UNDER A RECALL.  *TR",
        "vin": "4S4BP61C386"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2013",
        "dateOfIncident": "11/29/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514620,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMED AT SHOP WHEN GETTING OIL CHANGE THAT LEFT FRONT WHEEL BEARING NEEDED REPLACEMENT.  CONTACTED LOCAL DEALER AND THEY CONFIRMED AND REPLACED IT UNDER POWERTRAIN WARRANTY.  HEARD NO NOISE AND FELT NO UNUSUAL PERFORMANCE TO ALERT ME OF THIS POWERTRAIN FAILURE.  DEALER STATED ALL THE OTHER WHEEL BEARINGS ARE OK.  2 YEARS LATER AT 70,000 MILES RIGHT REAR WHEEL BEARING FAILED WITH NO NOTICE OR NOISE JUST SUDDEN GRINDING AND SWAYING AT ABOUT 50 MPH.  HAD IT TOWED HOME AND TOOK IT TO DEALER WHO CONFIRMED THE OTHER TWO WHEEL BEARINGS ARE FAILING.  DEALER COVERED COST OF NEW BEARINGS BUT WE TRADED IT IN.  NO CONFIDENCE IN SUBARU.  DEALER STATED THIS IS A COMMON ISSUE, IT SHOULD HAVE BEEN RECALLED OR ALL REPLACED AT FIRST FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "06/18/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513068,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE OVERHEATED, DROVE TO NEAREST SERVICE STATION. RADIATOR FLUSHED AND TESTED FOR LEAKS, NONE FOUND. NO OTHER DETERMINATION MADE. CAR OVERHEATING, SLOW COOLANT LOSS. SUBARU DIAGNOSED MAJOR HEAD GASKET FAILURE PROBABLY OCCURRED PRIOR TO 73000 MILES, BUT BEYOND POWER TRAIN WARRANTY. SUBARU HQ DECLINED TO HELP WITH COST CONSIDERING THE SERVICE TECH MGR STATED A 2008 MODEL CAR SHOULD NOT HAVE THIS FAILURE.    PREVIOUSLY OWNED 1998 SUBARU OUTBACK WITH SIMILAR GASKET FAILURE SOME TIME AFTER POWER TRAIN WARRANTY EXPIRED. COSTLY REPAIR.  *TR",
        "vin": "4S4BP62C787"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "01/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496109,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE AIR BAG WARING LIGHT ILLUMINATED AND A PASSENGER AIR BAG WARNING MESSAGE APPEARED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "4S4BP62C087"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2013",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491450,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE CAR WAS NEARLY NEW THE AIRBAG WARNING LIGHT COMES ON INTERMITTENTLY AND NOW STAYS ON CONTINUOUSLY, RENDERING THE AIRBAG SYSTEM INOPERATIVE.  THE VEHICLE WAS BROUGHT TO THE DEALER THE FIRST TIME IT HAPPENED BUT THE DEALER SAID NO FAULT CODE WAS FOUND.  IN DECEMBER 2012 THE WARNING LIGHT CAME ON CONTINUOUSLY. I BROUGHT IT TO THE SUBARU DEALER TO DIAGNOSE AND SERVICE THE PROBLEM.  THE SERVICE MANAGER STATED THAT THE PROBLEM IS WITH THE LIGHT IN THE MAPLIGHT MODULE, AND IF SOMETHING IN THE MODULE GOES BAD THE AIRBAG WARNING LIGHT WILL COME ON AND PREVENT THE AIRBAG FROM DEPLOYING. CONSEQUENTLY I HAVE TO REPLACE THE ENTIRE MAPLIGHT CONSOLE AT A COST OF $510 ($110 TO READ THE CODE PLUS $400 FOR THE LIGHT MODULE) TO FIX A DANGEROUS SAFETY DEFECT AND DESIGN FLAW THAT SHOULD BE THE RESPONSIBILITY OF SUBARU.  *TR",
        "vin": "4S4BP61C787"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/14/2012",
        "dateOfIncident": "11/13/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484613,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2008 OUTBACK 2.5 LIMITED USED WITH 32K MILES.  AT 41K MILES THE RIGHT FRONT WHEEL BEARING WENT OUT.  WAS MAKING A VERY LOUD RUBBING NOISE WHEN TURNING AND ON THE HIGHWAY.  THE BEARING WAS REPLACED UNDER POWERTRAIN WARRANTY.  YESTERDAY I WAS INFORMED THAT MY LEFT FRONT BEARING HAS GONE OUT, NOW AT 80K MILES (ALL HIGHWAY MILEAGE).  NOW IT IS OUT OF WARRANTY.  THE 2 SHOPS I SPOKE TO REGARDING THE ISSUE STATED THIS IS ACTUALLY VERY COMMON ON THESE SUBARU MODELS AND THEY GENERATE QUITE A BIT OF BUSINESS.  SUBARU NEEDS TO PROVIDE A TSB AND FIX THE ISSUE AS THEY HAVE SPEC'D FAULTY WHEEL BEARINGS. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/13/2012",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479978,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OUR SUBARU INTO THE DEALER TO GET REGULAR SERVICES. WE WERE TOLD THAT OUR FRONT DRIVERS SIDE BRAKE WAS COMPLETELY GROUND DOWN WHILE THE OTHERS WERE FINE AND OR NORMAL FOR OUR MILEAGE. OUR CAR WAS STILL UNDER WARRANTY AND ALTHOUGH THE DEALERS EXPLANATION WAS \" A STUCK BRAKE CALIPER\" THEY MADE US PAY FOR NEW BRAKES. AND, THEY FAILED TO GIVE US  A NEW BRAKE CALIPER. WHEN WE ASKED FOR THE MANAGER, HE REFUSED TO HELP US AND BLAMED IT ON THE REGIONAL REPAIR MANAGER. WE COMPLAINED FOR NEARLY A YEAR AND WERE FINALLY GIVEN THE MONEY BACK JUST FOR THE BRAKE, BUT SINCE WE HAD BROUGHT THE CAR IN , THEY SHOULD HAVE FIXED THE BRAKE CALIPER AS WELL. THIS WAS A PROBLEM FROM THE BEGINNING AND WE HAD BOUGHT THE CAR \"BRAND NEW\" . WE THINK THIS IS A AN OVERALL MANUFACTURERS DEFECT BUT WHEN WE CALLED SUBARU CORPORATE OFFICES , THEY SLAMMED THE DOOR IN OUR FACES AND WE WERE NEVER ALLOWED TO TALK TO A PERSON OTHER THAN \"CUSTOMER SERVICE\" IN THE SUBARU CORPORATE OFFICES. WE HAVE TAKEN THE CAR TO 3 SUBARU DEALERS AND ALL 3 REFUSED TO REPLACE THE PARTS AND SERVICES FOR FREE.  WE HAVE EMAIL AND OTHER DOCUMENTATION OF OUR COMMUNICATIONS WITH THEM. PLEASE HELP US. *TR   UPDATED 11/14/12 *CN     UPDATED 11/14/2012*JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/06/2012",
        "dateOfIncident": "10/05/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478875,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT STAYS ON AND PASSENGER AIRBAG LIGHT( OFF) STAYS OFF. I HAD MY CAR SERVICED FOR COOLANT FLUSH. I ASKED SERVICE MANAGER ABOUT THE ISSUE HE STATED THAT IT IS IN THE MAPLIGHT AND IF THE LIGHT BURNS OUT THE AIRBAG ON THE DASH WILL LIGHT UP AND POSSIBLY CAUSE A MALFUNCTION IN AIRBAG DEPLOYMENT.  SO MEANING AS CONSUMER I HAVE TO REPLACE THE ENTIRE MAPLIGHT CONSOLE AND PAY FOR SOMETHING THAT IS A KNOWN SUBARU ISSUE OR MORE FAULT IN DESIGN.  *TR",
        "vin": "4S4BP86C184"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473066,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT ON OUR DASHBOARD RECENTLY LIT UP. WE HAD OUR MECHANIC LOOK AT THE CAR AND HE SAID THE CAR WAS NOT PRODUCING AN ERROR CODE. SOME BASIC RESEARCH ON THE INTERNET REVEALED THAT THIS PROBLEM IS BECOMING COMMON AND IS RELATED TO A FAULT IN THE PANEL CONTAINED IN THE MAP LIGHT CONSOLE, WHICH INCLUDES THE PASSENGER AIR BAG INDICATOR LIGHTS. HE REPLACED PANEL AND THAT SOLVED THE PROBLEM. I HAVE A COUPLE ISSUES THAT I HOPE YOU CAN ADDRESS. BECAUSE THE AIR BAG LIGHT WAS ILLUMINATED ON THE DASH, THE OPERATION OF THE CAR'S AIR BAGS WERE IN DOUBT, IF NOT DISABLED ALL TOGETHER. SO, THIS APPEARS TO BE A SAFETY ISSUE. ADDITIONALLY, WHEN OUR MECHANIC CALLED THE LOCAL SUBARU DEALER (GO SUBARU IN DENVER, CO) FOR THE PART AND ASKED IF THEY HAD THE PART IN STOCK, THE PARTS DESK IMMEDIATELY SAID, \"OH, IS THIS THAT AIR BAG THING?\" SO, THIS IS A KNOWN FAULT. I TRIED CONTACTING SUBARU TO NOTIFY THEM, BUT THEY SIMPLY TOLD ME THAT ALL RECALLS ARE ISSUED BY THE GOVERNMENT AND THAT I SHOULD HAVE MY VEHICLE SERVICED BY AN AUTHORIZED DEALER.  I HOPE THE NHTSA WILL TAKE TIME TO RESEARCH THIS SAFETY ISSUE AND MAKE THE APPROPRIATE RECALL.  *TR",
        "vin": "4S4BP61C086"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "06/24/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467668,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE WIRE LEADING TO THE REAR CARGO HATCH (RIGHT SIDE) BROKE AND 3 OTHERS HAD CRACKED INSULATION DUE TO A LACK OF RESILIENCE AFTER FLEXING.  THESE WIRES ARE FLEXED EVERY TIME THE HATCH IS OPENED AND CLOSED.  ALL ELECTRICAL PARTS ON THE HATCH TRAVEL THOUGH THIS WIRING HARNESS (WIPERS, LOCK, ETC.).  HAD THE FAILURE OF THE LOCK NOT BEEN NOTICED, FURTHER WEAR COULD HAVE CAUSED A SHORT AND A FIRE.  THE VEHICLE IS ONLY 4 AND A HALF YEARS OLD.  MANY OTHER PEOPLE HAVE HAD SIMILAR PROBLEMS GOING BACK TO AT LEAST THE 2005 MODEL. *TR",
        "vin": "4S4BP62CX87"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "03/28/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466411,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MANY SEPARATE OCCASIONS (BUT REPORTED TO SUBARU AUTHORIZED SERVICE DEALER ON 03/28/12, 10/01/11, AND 09/21/11), OUR HOOD HAS PARTLY POPPED OPEN WHILE DRIVING THE VEHICLE AT A RANGE OF SPEEDS AND IN A RANGE OF TEMPERATURES. IT IS AS IF THE INITIAL HOOD RELEASE LATCH HAS BEEN PULLED FROM WITHIN THE CAR, BUT THE HOOD THEN CATCHES ON THE MANUAL RELEASE UNDER THE LID. ONCE LOOSE, THE HOOD WOBBLES (WITH INCREASED VIOLENCE AT HIGH SPEEDS) AND IS OBVIOUSLY NOT SECURE.    THE SUBARU SHOP TECH INITIALLY ADJUSTED AND REALIGNED THE HOOD LATCH. ON A SUBSEQUENT VISIT, THE ENTIRE HOOD LATCH WAS REPLACED. THIS DID NOT SOLVE THE PROBLEM, AND ON VISITING AFTER THE THIRD OCCURENCE, THE  SAID THEY HAD NO RECOMMENDATIONS AS THEY COULD NOT REPLICATE THE PROBLEM EITHER ON THE ROAD OR IN THE SHOP, AND WERE SHOWING NO DIAGNOSTIC ISSUES WITH THEIR EQUIPMENT. SUBARU OF AMERICA WERE CONTACTED BY THE SHOP AND HAD NO AVAILABLE RECOMMENDATIONS.    THE VEHICLE HAS BEEN INSPECTED BUT THE SUBARU SHOP AND IS CLEAR OF PRIOR BODY DAMAGE.    THE UNPREDICTABILITY OF THIS ISSUE IS MOST ALARMING -- WE CAN NEVER TELL WHEN OUR HOOD IS GOING TO COME LOOSE WHILE TRAVELLING, AND HAVE HAD TO PULL OVER SEVERAL TIMES ON THE FREEWAY WHEN TRAVELLING AT HIGH SPEED TO SECURE THE HOOD.",
        "vin": "4S4BP60C387"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/07/2012",
        "dateOfIncident": "05/24/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460896,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2008 SUBARU OUTBACK. THE CONTACT STATED THAT WHILE ATTEMPTING TO PARK, SHE HEARD A LOUD NOISE COMING FROM THE ENGINE AND NOTICED THE VEHICLE MOVING FORWARD WHILE THE BRAKE WAS DEPRESSED. THE VEHICLE PROCEEDED TO CRASH INTO A STORE. THE CONTACT DID NOT SUSTAIN ANY INJURY. THE KANAWHA COUNTY SHERIFF WAS PRESENT AND A POLICE REPORT WAS AVAILABLE. THE VEHICLE WAS TOWED TO A BODY SHOP, BUT A DIAGNOSTIC TEST WAS NOT PERFORMED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT PROVIDED NO ASSISTANCE. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 86,837.",
        "vin": "4S4BP61C587"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2012",
        "dateOfIncident": "04/09/2012",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454935,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING WHILE DRIVING AT LOW SPEEDS. THE CONTACT ALSO STATED THAT THE TRANSMISSION FLUID LEAKED AND THE VEHICLE SMOKED. THE VEHICLE WAS TOWED TO THE DEALER. THE CONTACT WAS INFORMED THAT THE TRANSMISSION HOSE FRACTURED AND CREATED THE LEAK. THE CONTACT WAS ALSO INFORMED THAT THE RADIATOR WAS DEFECTIVE. THE DEALER REPLACED THE TRANSMISSION HOSES AND THE RADIATOR. THE VEHICLE WAS REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 50,284.",
        "vin": "4S4BP86C784"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447686,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED RUNNING BIT ROUGH WHILE IDLING AT INTERSECTION; UPON ACCELERATION, CHECK ENGINE LIGHT AND OTHER INSTRUMENT LIGHTS STARTED FLICKERING AND CAR STALLED. RESTARTED NORMALLY.  *TR",
        "vin": "4S4BP61C287"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447699,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2008 SUBARU OUTBACK NEW. I HAVE DRIVEN IT IN ALMOST EVERY ROAD AND WEATHER CONDITION POSSIBLE. IT IS DRIVEN 90% OF THE TIME WITH JUST ME OR ME AND MY WIFE IN THE CAR. JUST A FEW DAYS AGO I WAS DRIVING WITH A FULL LOAD OF LUGGAGE, AND 3 ADULT PASSENGERS IN THE CAR. ROAD CONDITIONS BECAME ICY ON THE INTERSTATE. THERE WAS A FAIRLY RAPID ONSET OF THE CAR KIND OF JERKING SIDE TO SIDE ALMOST LIKE THE BACK END OF THE CAR WAS BEING BLOWN FROM SIDE TO SIDE EVEN THOUGH THERE WAS NOT MUCH WIND. I WAS DRIVING VERY SLOWLY AT ABOUT 40-45 MPH WHILE OTHER CARS AND SEMI TRUCKS WERE PASSING ME. I HAD NOT EXPERIENCED THIS BEFORE AND I THOUGHT AT ANY MINUTE WE WOULD END UP IN THE DITCH. IT HAPPENED WITHOUT ANY INPUT FROM ME SUCH AS GIVING IT GAS OR BRAKING AND WHILE GOING STRAIGHT. THE CAR HAS NEW TIRES WITH LESS THAN 5000 MILES ON THEM. I JUST HAD THE 45000 MILE SERVICE COMPLETED BY THE DEALERSHIP. THE CAR IS A 2.5I WITH AN AUTOMATIC TRANSMISSION. I DID RESEARCH AS SOON AS I ARRIVED HOME AND FOUND THIS ISSUE WELL DESCRIBED IN A SUBARU OUTBACK FORUM. IT WAS DESCRIBED AS \"GHOSTWALKING\".  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2011",
        "dateOfIncident": "10/18/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430616,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ON DASH COMES ON INTERMITTENTLY. THERE APPEARS TO BE A KNOWN DEFECT IN THE OVERHEAD MAP LIGHT CONSOLE THAT CAUSES THE PROBLEM. WHEN OCCURRING, THE AIR BAG SYSTEM BECOMES DEACTIVATED AND POSES A DECREASE IN SAFETY. SUBARU OF AMERICA WOULD NOT TELL ME HOW MANY OF THESE UNITS HAVE BEEN REPLACED OR THEIR REPORTED RATE OF FAILURE.  *TR",
        "vin": "4S4BP61C987"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2011",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423372,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING THIS VEHICLE (NEW), THE HOOD LATCH BEGAN TO OCCASIONALLY OPEN BY ITSELF WHILE DRIVING. THE SAFETY LATCH DOES CATCH THE HOOD BEFORE IT OPENS ALL THE WAY, BUT IT IS NEVERTHELESS DISCONCERTING, AND CERTAINLY A SAFETY ISSUE. I CURRENTLY HAVE APPROXIMATELY 82000 MILES ON THE VEHICLE, AND WOULD ESTIMATE THAT THE HOOD HAS SELF-OPENED WHILE DRIVING AT LEAST 20 TIMES. THE DEALER SUGGESTED THAT I WAS NOT CLOSING THE HOOD SUFFICIENTLY WHEN CHANGING THE OIL, OR WHEN ADDING WASHER FLUID. I DO NOT CHANGE MY OWN OIL, AND RARELY NEED TO OPEN THE HOOD, AS THE DEALER OR A QUICK-LUBE SERVICE HAVE BEEN PERFORMING THE MAINTENANCE. THERE SEEMS TO BE NO RELATIONSHIP BETWEEN SPEED OR ROAD CONDITION, AS I HAVE NOT BEEN ABLE TO CAUSE THE HOOD TO OPEN ON DEMAND, AND NEITHER HAS THE DEALER. THERE ALSO SEEMS TO BE NO RELATIONSHIP TO THE NUMBER OF MILES SINCE THE LAST OCCURRENCE. SOMETIMES THE TIME BETWEEN OCCURRENCES IS VERY SHORT (LESS THAN A WEEK, AND LESS THAN 150 MILES), AND OTHER TIMES I CAN GO SEVERAL MONTHS BETWEEN OCCURRENCES. THE DEALER HAS SEEN THE VEHICLE FOR THIS PROBLEM AT LEAST 8 TIMES, I BELIEVE, AND HAS DONE VIRTUALLY NOTHING BUT \"ADJUST\" THE LATCH. I HAVE COMMUNICATED THIS PROBLEM TO THE MANUFACTURER, WHO REFERRED IT TO THE DEALER. THE DEALER ASKED IF I KNEW WHEN IT WAS GOING TO HAPPEN AGAIN (I DID NOT), AND THEY ASKED ME TO BRING IT IN THE NEXT TIME IT HAPPENED SO THAT THEY COULD SEE THAT THE HOOD LATCH WAS OPEN (I DID).",
        "vin": "4S4BP62C587"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/28/2011",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398135,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ENGINE STALLS IN THE MIDDLE OF THE ROAD WHILE DRIVING AND WHILE MAKING A LEFT TURN IN A SIGNAL, WHILE WAITING ON THE RED LIGHT AND WHILE STOPING AND IDLING AT THE PARKING LOT. WHEN THIS ISSUE HAPPENS ALL THE LIGHTS IN THE DASH LIGHTS UP AND THE STEERING WHEEL BECOMES LOCKED.  THIS ENGINE STALLING ISSUE HAPPENS RANDOMLY. SOME TIMES EVERY DAY IN A WEEK, 2 DAYS IN A WEEK OR 3 DAYS IN A WEEK. SOME TIMES THE ENGINE STALLS MORE THAN 10 TIMES IN A DAY.    IN ORDER TO CORRECT THIS ISSUE, I TOOK MY CAR TO SUBARU DEALERSHIP AND EXPLAINED THE SERVICE TECHNICIAN THE PROBLEM.   FIRST TIME, I WAS ASKED TO LEAVE MY CAR AT THE DEALER SHIP OVERNIGHT TO SEE IF DEALER CAN RECREATE THE PROBLEM. DEALER TOLD ME HE COULDN'T RECREATE THE ISSUE.  SECOND TIME, DEALER FOUND CHECK ENGINE LIGHT ON AND USED THE DIAGONSTIC TOOL TO FIND OUT THAT MASS AIR FLOW SENSOR IS BAD AND REPLACED IT. BUT THIS DIDN'T FIX THE PROBLEM.  THIRD TIME I CONTACT SUBARU CUSTOMER SERVICE AND EXPLAINED THE ISSUE. SUBARU CUSTOMER SERVICE ASKED ME TO TAKE MY CAR TO THE DEALERSHIP AGAIN. I TOOK MY CAR TO DEALERSHIP AND LEFT IT THERE FOR 2 DAYS. ON THE THIRD DAY, DEALER SAID THE BATTERY WAS BAD AND REPLACED THE BATTERY AND SAID HE COULDN'T REPRODUCE THE ISSUE.  WHEN I TOOK THE CAR BACK FROM THE DEALERSHIP ON THE THIRD DAY, WITHIN FEW HOURS MY CAR ENGINE AGAIN STALLED. THIS TIME I TOOK THE VIDEO OF THE ISSUE.    I CONTACTED THE SUBARU CUSTOMER SERVICE AND EXPLAINED WHAT WAS HAPPENING AND I WAS TOLD THAT DEALER CANNOT FIX THE ISSUE UNLESS HE CAN RECREATE THE ISSUE.   SO I TOOK MY CAR TO SUBARU DEALERSHIP MORE THAN 3 TIMES, SPENT MORE THAN $1000 FOR PARTS, LABOR AND CAR RENTAL AND STILL THE PROBLEM IS NOT FIXED.   ACTUALLY IT IS GETTING WORSE DAY BY DAY.  *TR",
        "vin": "4S4BP61C387"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/13/2011",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395819,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TPMS VALVE STEM BROKE OFF WHILE CHECKING TIRE PRESSURE.  *TR",
        "vin": "4S4BP62C487"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389930,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK 2.5I  DRIVING STRAIGHT ON COMPACTED SNOW OR ICY ROADS STARTING AT APPROX. 35MPH. REAR OF VEHICLE FEELS AS IF TRACTION IS BREAKING LOOSE AND FISHTAILING. TIRES ARE 1 YEAR OLD AND MADE FOR SNOW/ICE CONDITIONS AND ALIGNMENT WAS DONE 2 WEEKS PRIOR. PROBLEM IS EXACERBATED WHEN ADDITIONAL PASSENGERS OR WEIGHT IS ADDED TO VEHICLE. UNABLE TO DRIVE OVER 40-45 MPH; 2-WHEEL DRIVE COMPACTS PASSING ME IN AN OUTBACK ON A FLAT SNOW COVERED ROAD DUE TO INABILITY TO MAINTAIN CONTROL AT SPEED.  ALIGNMENT WAS DONE TO CORRECT THE PROBLEM FROM A ROAD TRIP ONE MONTH PRIOR TO THIS OCCURRENCE. NO SIMILAR ROAD CONDITION DRIVING BETWEEN THE TWO.  *TR",
        "vin": "4S4BP61C487"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "08/29/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386095,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU OUTBACK. THE CONTACT STATED THAT THE HOOD LATCH WOULD OPEN INDEPENDENTLY CAUSING THE HOOD TO MOVE WHILE THE CONTACT WAS DRIVING 20 MPH AND OVER. THE VEHICLE WAS TAKEN TO THE DEALER FOR THE RECURRING FAILURE AND THE HOOD WAS REPLACED TWICE BUT THE FAILURE CONTINUED TO RECUR. THE FAILURE MILEAGE WAS 20 AND THE CURRENT MILEAGE WAS 44,000. UPDATED 03/31/11*LJ  THE CONSUMER STATED THE HOOD LATCH WAS REPLACED TWICE. UPDATED 04/28/11",
        "vin": "4S4BP61C187"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2011",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378290,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT FOR A 2008 SUBARU OUTBACK 2.5I WITH A MANUAL TRANSMISSION. UNDER CERTAIN CONDITIONS, THE VEHICLE HAS A MAJOR STABILITY CONTROL ISSUE AND IS UNSAFE TO DRIVE. WHILE DRIVING AT CONSTANT SPEED (CONSTANT AND LOW THROTTLE POSITION) ON A FLAT, GOOD ROAD, WITH THE STEERING WHEEL POINTED STRAIGHT AHEAD, THE BACK END OF THE VEHICLE TENDS TO OSCILLATE FROM SIDE TO SIDE OR \"GHOST WALK\" WHEN THE ROAD HAS ICE ON IT. THE VEHICLE DOES NOT EVER LOSE TRACTION PER SE; IT JUST STEERS ITSELF ALL OVER THE ROAD.  TIRES ARE AT THE PROPER PRESSURE, TIRES ARE ALL BRAND NEW (ALTHOUGH THE PROBLEM HAS HAPPENED FOR THE  LIFE OF THE VEHICLE WITH DIFFERENT SETS OF TIRES.  THE ISSUE IS NOT TRACTION ON DEEP SNOW, NOR IS IT A PROBLEM WHEN CORNERING, BRAKING, OR ACCELERATING.  I AM A VERY EXPERIENCED DRIVER IN SNOW/ICE AND HAVE OWNED SEVERAL SUBARUS.  THIS PARTICULAR MODEL HAS MAJOR PROBLEMS WITH DRIVING ON ICE AND VERY HARD-PACK SNOW.  NOTE THAT HAVING ADDITIONAL WEIGHT IN THE CARGO AREA OR REAR PASSENGERS MAKES THE PROBLEM MUCH WORSE.  I HAVE BEEN FORCED TO DRIVE ON THE INTERSTATE AT 20 MPH WITH REAR-WHEELED DRIVE CARS BLOWING BY ME BECAUSE OF THE GHOST WALKING ISSUE.  I HAVE HAD SEVERAL NEAR-ACCIDENTS BECAUSE OF THIS ISSUE. THIS VEHICLE. IS UNSAFE AND SHOULD BE RECALLED IMMEDIATELY. *TR",
        "vin": "4S4BP61C886"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374740,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU OUTBACK. DURING INCLEMENT WEATHER, THE SNOW BECAME PACKED INTO THE WHEEL WELL AND MADE IT DIFFICULT FOR THE WHEEL TO TURN NORMALLY. THE DEALER WAS NOTIFIED  AND OFFERED NO ASSISTANCE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 11,300.",
        "vin": "4S4BP62C587"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/25/2010",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GHOSTWALKING SUBARU OUTBACK, 2008. DRIVING MY FAMILY (2 ADULTS, 2 TEENS) TO A FAMILY EVENT, ALONG WITH LUGGAGE, EXPERIENCED REAR END SWAY BACK AND FORTH UNCONTROLLABLY WHILE DRIVING ON SLIGHTLY SLICK ROADS (SLUSHY CONDITIONS). IT FELT LIKE REAR END WAS SWAYING INTO TRAFFIC IN ADJACENT LANE. IT WAS EXTREMELY UNNERVING. OCCURS IN SPEEDS ABOVE 50 KM/H. PROBLEM CONTINUED WHILE DRIVING ABOVE 50 KM/H WITH SLICK ROAD. HAD TO SLOW DOWN BELOW 50 KM/H ON HIGHWAY (WHICH IS ILLEGAL).  *TR",
        "vin": ""
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2010",
        "dateOfIncident": "11/20/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367221,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 SUBARU OUTBACK EQUIPPED WITH GOOD WINTER TIRES.  AT HIGHWAY SPEEDS ON WINTER ROADS MY CAR IS  EXTREMELY UNSTABLE.  FOR NO APPARENT REASON THE  REAR END OF THE CAR STARTS TO SWAY AND I AM ONLY ABLE TO BRING IT UNDER CONTROL BY BRINGING DOWN MY SPEED, AND I END UP TRAVELING MUCH SLOWER THEN THE TRAFFIC FLOW.  MY BROTHER IN LAW HAS THE SAME CAR AND EXPERIENCES THIS PROBLEM AS WELL WITH HIS VEHICLE.  THERE IS A DESIGN AND ENGINEERING FLAW WITH THIS CAR AND SUBARU NEEDS TO COMES TO GRIPS WITH IT AND COME UP WITH A SOLUTION.  THIS CAR IS UNSAFE ON SLICK WINTER ROADS. *TR",
        "vin": "4S4BP61C187"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/24/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332060,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK WAGON SWAYS DANGEROUSLY ON ROUGH ROADS.  THE SENSATION IS THAT WHEN ONE HITS A BUMP THE REAR END BOUNCES/KICKS/WALKS OUT TO THE RIGHT.  WHILE THERE HAVE BEEN NO ACCIDENTS WITH THIS VEHICLE, IT DOES NOT FEEL SAFE TO DRIVE.  THE CAR HAS BEEN SERVICED REGULARLY, HAS NEWER TIRES, AND HAS BEEN ALIGNED SEVERAL TIMES. *TR",
        "vin": "4S4BP62C687"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "04/30/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328667,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS THE CAR SUDDENLY LOOSING POWER AT VARIOUS SPEEDS FOR NO APPARENT REASON.  HAS OCCURRED OVER 6 TIMES IN THE PAST MONTH, 4 TIMES IN THIS LAST WEEK.  THE MOST RECENT ON 4/30/10  THE CAR COMPLETELY SHUT DOWN WHILE DRIVING AT A SPEED OF 20 MPH.  NO WARNING INDICATORS CAME ON THE DASHBOARD.  FIRST TIME WAS WHEN ACCELERATING UP AN ON RAMP AND SEVERAL MORE TIMES ON OTHER INCLINED RAMPS, THEN LEAVING A STREET TO ENTER A HWY 4/28/10, ANOTHER AT A COMPLETE STOP THE CAR SHUDDERED 4/29/10, SAME DAY TRAVELING AT 60 MPH LOST POWER FOR A BRIEF MOMENT THEN RESUMED, THESE TWO INCIDENTS WERE WITHIN 5 MINUTES.  I HAVE TAKEN IT TO THE DEALER WHERE PURCHASED AND SERVICED TO HAVE THEM LOCATE AND REPAIR THE PROBLEM.  HAVE NOT RECEIVED INFORMATION AS YET. *TR",
        "vin": "4S4BP61C987"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328527,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "S10 APPROPRIATE HANDLING-LETTER REGARDING SUBURU PROBLEMS *TGW  THE CONSUMER STATED THE ACCELERATOR PEDAL BECAME STUCK WHEN HE ATTEMPTED TO MAKE A LEFT TURN AND WAS UNABLE TO CONTROL THE SPEED OF THE VEHICLE AND SUBSEQUENTLY HE SCRAPED A GUARDRAIL, WHICH RESULTED IN OVER $5,000 IN BODY DAMAGE TO HIS VEHICLE. HE STATED EVERY TIME HE APPLIED THE BRAKES, THE VEHICLE ACCELERATED.  THE CONSUMER HAS SINCE TRADED THE VEHICLE. *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/22/2010",
        "dateOfIncident": "12/26/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321336,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": "P205/60R16",
                "type": "Tire"
            }
        ],
        "summary": "EXPERIENCED SEVERE FISHTAILING ON SLIGHTLY SLIPPERY ROADS WITH A 2008 SUBARU OUTBACK.  THIS WAS HIGHLY UNUSUAL FOR AN ALL WHEEL DRIVE CAR AND I DIDN'T HAVE THE SAME PROBLEM WITH MY WIFE'S HONDA CR-V THAT I DROVE ON THE SAME DAY ON THE SAME ROADS.",
        "vin": "4S4BP62C787"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "01/04/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317279,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU OUTBACK 2008 2.5I     SIDE-TO-SIDE MOTION:  RECURRING ISSUE IS CONSIDERABLY DANGEROUS AND PRESENTS ITSELF WHEN DRIVING ON WET AND OR SLIPPERY ROADS. YES, ALTHOUGH THE CONDITIONS ARE LESS THAN IDEAL THEY ARE NORMAL DRIVING SITUATIONS. TESTING HAS BEEN CONDUCTED WITH IDENTICAL CONDITIONS AND OTHER VEHICLES AND SIMILAR BEHAVIOR WAS NOT EXPERIENCED. THIS TESTING HAS BEEN REPEATED WITH IDENTICAL RESULTS.     ISSUE: WHEN TRAVELING ON SLIPPERY ROADS - RAIN, SNOW, ICE THE SUBARU ALL WHEEL DIRVE/SUSPENSION CONFIGURATION CREATES SIDE TO SIDE \"FISH-TAIL\" LIKE BEHAVIOR. THIS MOTION CAN CAUSE THE VEHICLE TO SPIN-OUT. OTHER DIRVERS HAVE EXPERICED OVER CORRECTION ISSUES WHEN DEALING WITH THIS UNEXPECTED BACK-END MOTION. THE SIDE TO SIDE MOTION DOES NOT SEEM TO BE A RESULT OF APPLICATION OF POWER. WTH POWER APPLIED OR COASTING THE MOTION IS STILL EVIDENT. *TR",
        "vin": "4S4BP61C186"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/12/2009",
        "dateOfIncident": "12/09/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295462,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE HAD AN UNCONTROLLED ACCELERATION EVENT IN HER 2008 SUBARU OUTBACK WHEN SHE WAS TRYING TO PARK BEHIND ANOTHER CAR.  SHE DIDN'T THINK THE FLOOR MAT WAS INVOLVED.  SHE HAD WINTER BOOTS ON AND THOUGHT SHE WAS ONLY PRESSING ON THE BRAKE.  HER FRONT LICENSE PLATE WAS TORN AND SHE DID ABOUT $700 OF DAMAGE TO THE OTHER CAR'S REAR BUMPER. *TR",
        "vin": "4S4BP61C387"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2009",
        "dateOfIncident": "10/18/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10292872,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN INTERSECTION ACCIDENT WHERE MY VEHICLE HIT THE OTHER CAR. THE IMPACT WAS QUITE SEVER AND THE DAMAGE WAS ABOUT $11,000. HOWEVER, THE AIR BAG DID NOT DEPLOY AND I HIT MY HEAD ON THE WINDSHIELD.   I REPORTED THIS TO THE MANUFACTURER SO THAT ANY DEFECT THAT MAY HAVE CAUSED THE FAILURE MIGHT BE DISCOVERED AND THEIR ACTION MIGHT PREVENT WORSE INJURY TO THE NEXT PERSON. HOWEVER, THEY SEEM TO BE TOTALLY UNINTERESTED AND TOLD ME TO CALL MY INSURANCE COMPANY. *TR",
        "vin": "4S4BP61C087"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "06/06/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281348,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2008 SUBARU OUTBACK.  WHILE DRIVING APPROXIMATELY 25 MPH ON A RURAL ROAD AFTER THE SUNSET WITH THE LOW BEAM HEADLIGHTS ENGAGED, THEY FAILED TO FULLY ILLUMINATE THE ROAD.  THE DEALER STATED THAT THE VEHICLE DOES COMPLY WITH THE REQUIREMENTS OF FEDERAL MOTOR VEHICLE SAFETY STANDARDS; WHICH WAS A MANUFACTURER DESIGN WITH NO MODIFICATIONS.  THE CONTACT IS AWARE OF THE SAFETY RISK INVOLVED. THE FAILURE MILEAGE WAS UNAVAILABLE AND THE CURRENT MILEAGE WAS 103,000. THE VIN WAS REJECTED FROM THE SYSTEM AND WILL BE UPDATED UPON RECEIPT OF THE SAFETY COMPLAINT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2009",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279627,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT STAYS ON AFTER STARTING, INDICATING MALFUNCTION IN AIRBAG SYSTEM. 2008 SUBARU OUTBACK STATION WAGON. UNDER WARRANTY. HAS BEEN TO DEALER SEVERAL TIMES, THEY ARE UNABLE TO FIX THE CONDITION.  *TR",
        "vin": "4S4BP62C487"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/03/2009",
        "dateOfIncident": "07/03/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275719,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU OUTBACK 2008 FRONT-WHEEL BEARING, SECOND TIME NEED TO BE CHANGE AFTER 25000 MILES. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/04/2009",
        "dateOfIncident": "04/27/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10272886,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU OUTBACK.  WHILE STOPPED AT A STOP SIGN, THE CONTACT'S VEHICLE WAS REAR-ENDED BY ANOTHER VEHICLE.  THE DRIVER'S SIDE SEAT BELT FAILED TO WORK PROPERLY AND THE CONTACT STRUCK THE STEERING COLUMN AND WINDSHIELD.  A POLICE REPORT WAS FILED.  THE CONTACT SUSTAINED BACK AND ARM INJURIES.  SHE FEELS THAT THE SEAT BELTS DO NOT RETRACT AND SECURE AN OCCUPANT IN PLACE WHEN A CRASH OCCURS.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE SEAT BELTS WERE FUNCTIONING AS DESIGNED.  THE CONTACT CALLED THE MANUFACTURER AND WAS INFORMED TO TAKE THE VEHICLE TO THE DEALER FOR FURTHER INSPECTION.  THE FAILURE MILEAGE WAS 13,000 AND CURRENT MILEAGE WAS 14,002.     UPDATED 08/04/09 *BF  UPDATED 08/11/09.*JB",
        "vin": "4S4BP61C087"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/15/2009",
        "dateOfIncident": "04/27/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10268806,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU OUTBACK.  THE CONTACT STATED THAT HER VEHICLE WAS REAR-ENDED AND THE SEAT BELT DID NOT PROVIDE ADEQUATE RESTRAINT.  SHE STRUCK HER CHEST ON THE STEERING WHEEL, WHICH CAUSED INJURIES TO HER CHEST AND BACK.  A POLICE REPORT WAS FILED.  SHE WILL HAVE SURGERY ON MAY 15, 2009 ON HER BACK.  A REPORT WAS FILED WITH THE MANUFACTURER AND THEY STATED THAT A REPRESENTATIVE WILL INSPECT THE SEAT BELTS.  TWO WEEKS LATER, THE CONTACT STILL HAS NOT HEARD BACK FROM THE MANUFACTURER.  THE FAILURE MILEAGE WAS 12,900.",
        "vin": "4S4BP61C087"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255776,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SWAYING WHILE DRIVING AT HWY SPEEDS ON ICY ROADS. SUBARU OUT BACK 08. I HAVE EXPERIENCED THIS SWAYING BACK AND FORTH WHILE DRIVING ON SLIPPERY ROADS. I WILL BE DRIVING AT 30-50% THEN ALL OTHER TRAFFIC TO MAINTAIN SAFE CHARACTERISTICS. THE TERM \"GHOST WALKING\" HAS BEEN ASSOCIATED WITH IT. SOA AND THE DEALERSHIP DENIES ANY ISSUES OR PROBLEMS. THE CARE IS COMPLETELY UNSAFE DURING ICE CONDITIONS. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/15/2008",
        "dateOfIncident": "04/06/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245572,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TECHNICAL CHEMICAL CO.",
                "productMake": "TECHNICAL",
                "productModel": "TECHNICAL",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2008 OUTBACK SUBARU - DROVE THE CAR FOR OVER 1 YEAR WITH THE TRANSMISSION JERKING INTO GEARS.  I HAD THE DEALER/MECHANICS CHECK IT 4 TIMES WITHIN THE FIRST 2 MONTHS OF THE PURCHASE. THEY COULD NOT FIND THE PROBLEM.  I HAVE HAD THE 3,000 MILE OIL CHANGE SERVICED BY THE DEALER - 6X AND COMPLAINED ABOUT THE TRANSMISSION. ON 10/9/08 TOOK TO THE DEALER AGAIN FOR A OIL CHANGE AND THE TRANSMISSION.  THEY FIND THE PROBLEM - I THINK THEY CALLED IT - A REFLASH - A COMPUTER ADJUSTMENT.  THE CAR NOW DRIVES GREAT.  WHY DID IT TAKE SO LONG FOR THIS ADJUSTMENT?  I THINK THAT SUBARU SHOULD HAVE CALLED A RECALL.  I AM ALSO CONCERNED IF IT DID ANY DAMAGE TO MY TRANSMISSION.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2008",
        "dateOfIncident": "10/03/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244549,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 SUBARU OUTBACK WITH 11,000 MILES HAS HAD A PERSISTENT PROBLEM PULLING TO THE RIGHT AT HIGHWAY SPEEDS.  REPEATED ATTEMPTS AT ALIGNING THE VEHICLE HAVE NOT CORRECTED THE PROBLEM.  RECENTLY THE FACTORY REP HAS ADVISED THE DEALER TO ADJUST THE CAMBER UNTIL THE VEHICLE WILL TRACK STRAIGHT.  THIS HAS ONLY MADE THE PULLING TO THE RIGHT WORSE AND MADE THE VEHICLE UNSAFE TO DRIVE. *TR",
        "vin": "4S4BP62C087"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2008",
        "dateOfIncident": "09/23/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243322,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 SUBARU OUTBACK AND THE LOW BEAM HEADLIGHTS ARE DANGEROUS WHEN TRAVELING ON HILLY ROADS. THE HEADLIGHTS DO NOT ILLUMINATE THE ROAD PROPERLY AND HAVE A HORIZONTAL LINE TO THE BEAM.  NOTHING CAN BE SEEN UNDER THIS LINE. NO PROBLEMS ENCOUNTERED WITH HIGH BEAMS. *TR",
        "vin": "4S4BP61C887"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/08/2008",
        "dateOfIncident": "06/03/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233493,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU OUTBACK.  WHILE DRIVING 30 MPH AND GREATER, THE VEHICLE WOULD TEND TO PULL TO THE RIGHT.  THE CONTACT DID NOT NOTICE ANY DIFFERENCES IN THE VEHICLE PRIOR TO THE FAILURE.  THE VEHICLE WAS TAKEN TO THE DEALER FOR AN ALIGNMENT, BUT THE FAILURE CONTINUED TO OCCUR.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 21,000.   UPDATED 07/29/08  *BF  UPDATED 08/05/08. *JB",
        "vin": "4S4BP61C587"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/01/2008",
        "dateOfIncident": "04/02/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226372,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR",
                "productModel": "HAYRACK",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SUBARU OUTBACK.  WHILE DRIVING APPROXIMATELY 70 MPH WITH A KAYAK STRAPPED TO THE ROOF OF THE VEHICLE, THE KAYAK FLEW BACKWARDS AND DETACHED FROM THE ROOF.  THE CONTACT PULLED OVER AND RETRIEVED THE KAYAK WITH THE AERIAL BAR STILL ATTACHED.  THE FAILURE MILEAGE WAS 176,00.   UPDATED 5/20/08 *CN  THE CARRIER THAT ATTACHED TO THE CROSS BAR  OF THE ROOF RACK BROKE. UPDATED 05/20/08",
        "vin": "4S4BP61C786"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2008",
        "dateOfIncident": "03/28/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222714,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN UNEXPECTED ACCELERATION WHILE DRIVING.  EVEN PULLING INTO THE DRIVEWAY WITH FOOT ON THE BRAKE THE ENGINE REVS UP OR SAME PROBLEM WHILE SITTING AT A STOPLIGHT.  IT'S AS THOUGH THE CAR DOES NOT WANT TO STOP.  AT TIMES IF YOU SHIFT DOWN AND LET OFF ON THE GAS THE CAR GOES FOR A SHORT STRETCH WITHOUT SLOWING DOWN.  *TR",
        "vin": "4S4BP60C786"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/30/2008",
        "dateOfIncident": "12/25/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222730,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS IN THE 2008 SUBARU OUTBACK ARE DEADLY AND AN ACCIDENT WAITING TO HAPPEN.  I CAN NOT BELIEVE THESE HEADLIGHTS WERE APPROVED AND THAT THEY ARE LAWFUL.  *TR",
        "vin": "4S4BP62C987"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/14/2008",
        "dateOfIncident": "11/26/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218009,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2008 SUBARU OUTBACK IN OCT. 07 AND DISCOVERED A PROBLEM WITH THE HEADLIGHTS AFTER DAYLIGHT SAVING TIME WENT INTO EFFECT.  THE HEADLIGHTS ARE TOTALLY INEFFECTIVE ON BACK ROADS WITH HILLY TERRAIN.  VISIBILITY CAN BE LIMITED TO AS LITTLE AS 20 FEET AT TIMES.  AFTER SPEAKING TO THE DEALER AND A SUBARU REGIONAL REP. WE WERE TOLD TO \"DEAL WITH IT\" AS THE VEHICLE MEETS MANUFACTURER SPECIFICATIONS.  OUR CONCERN IS THE DANGER NOT ONLY TO HUMANS BUT THE WILDLIFE THAT LIVE IN THIS AREA.  WE HAVE TRIED TO PURSUE THE LEMON LAW BUT CONTINUE TO HIT ROADBLOCKS AND HAVE NOT BEEN SUCCESSFUL.  WE WILL PROBABLY TRADE THE VEHICLE AND CUT OUR LOSSES BEFORE WE CAUSE INJURY TO OURSELVES OR OTHERS.  *TR",
        "vin": "4S4BP61C987"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/30/2007",
        "dateOfIncident": "12/29/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213195,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING OUR NEW 2008 SUBARU OUTBACK IN DARKNESS THERE ARE TIMES WHEN THE HEADLIGHTS DO NOT PROJECT THE BEAM FAR ENOUGH AHEAD TO ADEQUATELY SEE. THIS CONDITION IS VERY NOTICEABLE IN HILLY TERRAIN WHERE AS THE VEHICLE IS MOVING IN A FORWARD DOWN MOTION WITH A UPWARD HILL APPROACHING. THERE IS A DEFINITE HORIZONTAL PLANE OF LIGHT AND DARKNESS. AT TIMES THIS SITUATION HAS CAUSED US TO BRAKE QUICKLY DUE TO THE POSSIBLY OF COMING IN CONTACT WITH SOMETHING IN THE ROAD THAT WE WOULD OTHERWISE BE ABLE TO AVOID WITH ADEQUATE LIGHTING.   *TR",
        "vin": "4S4BP63C984"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2007",
        "dateOfIncident": "12/12/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212354,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TRIM THAT RETAINS THE CENTER LIGHT WILL BREAK OFF IF THERE IS ICE BUILT UP ON THE INSIDE OF THE HINGE AREA.  ALL ICE AND SNOW CAN BE REMOVED FROM THE TOP OF THE CAR, HOWEVER THERE IS NO SEAL BETWEEN THE REAR HATCH AND THE BODY TO PREVENT ICE FROM BUILDING UP. THERE IS NO WARNING WITH THE CAR TO BE AWARE OF THIS ISSUE.  THERE IS NO WARNING TO THE OWNER UNTIL IT TOO LATE AND YOU HAVE BROKEN THE WING OFF THE CAR.  *TR",
        "vin": ""
    }
]