[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193418,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH/BRAKE ASSEMBLY BROKE AWAY FROM FIRE WALL. MAKING CAR UNDRIVABLE",
        "vin": "JF1GH74698G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181448,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER LOOKS HIGH. CUTTING PEOPLE OFF AND RUNNING THROUGH STOP SIGNS",
        "vin": "6XKD352"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "12/28/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171257,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WELDS THAT ATTACH THE BRAKE AND CLUTCH PEDDLE TO THE VEHICLE BRAKE AND ALLOW THE WHOLE PEDDLE ASSEMBLY TO MOVE. BECAUSE OF THIS, BRAKING EFFICIENCY AND DRIVE GEAR ENGAGEMENT BECOME COMPROMISED. IN THE EVENT THAT A HARD STOP IS NEEDED, THE WHOLE ASSEMBLY COULD BRAKE AND KEEP THE DRIVER FROM BEING ABLE TO STOP. THIS ISSUE IS A HUGE HAZARD! THIS IS NOT A CONVENIENCE ISSUE, THIS IS A LIFE AND SAFETY ISSUE TO NOT ONLY THE OCCUPANTS OF THE SUBARU BUT EVERYONE ON THE ROAD! I HAVE CONTACTED SOA, AND THEY INFORMED ME THAT I WOULD HAVE TO TAKE CARE OF THE REPAIR MYSELF. THIS REPAIR IS NOT JUST SOME NUTS AND BOLTS COMING LOOSE OR SOMETHING LIKE THAT. THIS IS A HUGE REPAIR THAT IS STRUCTURAL TO THE VEHICLE. AT COSTS OF WELL INTO THE THOUSANDS! SOA KNOWS OF THE ISSUE AND REFUSES TO DO ANYTHING ABOUT IT! MY VEHICLE CURRENTLY SITS AT 92K MILES BECAUSE OF THE POOR CLUTCH ENGAGEMENT I HAD TO REPLACE MY CLUTCH AT 78K. I HAVE VIDEO AND PHOTO EVIDENCE TO GO ALONG WITH EVERYTHING THAT IS STATED ABOVE, BUT A QUICK GOOGLE SEARCH WILL SHOW YOU THAT THOUSANDS OF SUBARU WRX AND STI OWNERS FROM 2008 TO 2014 ARE OR WILL EXPERIENCE THIS EXACT ISSUE!",
        "vin": "JF1GE74668G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162027,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FIREWALL SPOT WELDS HAVE FAILED, CAUSING SIGNIFICANT LATERAL PLAY IN THE CLUTCH PEDAL. I HAVE HAD SOME SIGNIFICANT TROUBLE TRYING TO GET IT INTO GEAR. SO I HAVE HAD TROUBLE SHIFTING GEARS WHILE AT HIGHWAY SPEEDS AND HAVE HAD TROUBLE GETTING IT IN REVERSE IN ORDER TO PULL OUT OF A PARKING SPOT. THE BRAKE PEDAL IS NEXT IN-LINE TO BE AFFECTED BY THE SHEET METAL TEAR. I KEEP HEARING THAT THIS PROBLEM IS NOT COVERED UNDER ANY RECALL. NOR IS IT A WARRANTY ITEM AT THIS YEAR AND MILEAGE (105,000). THIS IS A VERY SIGNIFICANT ISSUE AND WILL COST A GREAT DEAL (OVER $1000) TO FIX. THIS BEING A WELD ISSUE AND NOT A WEAR ISSUE MAKES ME THINK THAT THE FACTORY OUGHT TO COVER THIS SAFETY ISSUE. THIS HAS BEEN HAPPENING FOR THE LAST YEAR AND A HALF. BUT I HAVE ONLY RECENTLY DISCOVERED THE TRUE EXTENT OF THE PROBLEM.",
        "vin": "VINJF1GE746"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150894,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE 3 WELD SPOTS ON MY FIREWALL THAT ARE SNAPPED. BECAUSE OF THIS I CONSTANTLY HEAR SNAPPING SOUNDS AND MY BREAK PEDAL MOVES WHEN THE CLUTCH IS DEPRESSED. THIS WAS A RECALL ON THE CAR BUT SUBARU OF AMERICA SAYS THAT I CANT GET IT FIXED UNDER WARRANTY. I BOUGHT THE CAR USED FROM A SUBARU DEALERSHIP IN RAMSEY NJ PRE-OWNED CERTIFIED AND THIS PROBLEM SHOULD HAVE BEEN FIXED BEFORE I PURCHASED THE CAR. IVE HAD THE CAR FOR ABOUT 6 MONTHS OR SO. THE SOUND IS DRIVING ME CRAZY AND THE CRACKS ARE GETTING WORSE.",
        "vin": "JF1GE74628G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139861,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FIREWALL WELDS BROKE AND CLUTCH NEEDS REPLACEMENT AT 88,000 MILES. THE CLUTCH IS STILL STIFF AND MAKES A CREAKING NOISE DESPITE THE FIREWALL WELDS BEING REPAIRED.",
        "vin": "JF1GH74648G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099309,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CREAKING CLUTCH PEDAL REALLY IS THE FIREWALL PEDAL MOUNTING BRACKET THAT IS FACTORY SPOT WELDED ONTO THE DRIVERS SIDE DASH SECTION OF THE FIREWALL UNDER THE DASH BOARD HAS ITS WEAK FACTORY SPOT WELDS BROKEN. I HAD REPLACED THE CLUTCH ON MY CAR AS IT WAS WEAK AND THOUGHT REPLACING IT WOULD MAKE THE CREAKING SOUND GO AWAY. REPLACING THE CLUTCH MADE THE SQUEAKING NOISE LOUDER AND NOW MY BRAKE PEDAL MOVES RIGHT INTO THE PATH OF THE CLUTCH WHEN IT IS PRESSED AND BACK TO ITS PLACE WHEN DEPRESSED. THIS IS A SAFETY CONCERN AS I AM A FATHER AND CANNOT GUARANTEE THIS CAR IS SAFE TO DRIVE AT ALL. I SPENT $1,200 ON THE INSTALLATION AS I PROVIDED THE PARTS TO THE SUBARU DEALER. AFTER RECEIVING MY CAR BACK, THE CAR BECAME INOPERABLE AS THE CLUTCH IS DIFFICULT TO ENGAGE SAFELY INTO ANY GEAR. I CONTACTED SUBARU OF AMERICA AS PER THE DEALERS ADVICE AND WAS DENIED ANY COMPENSATION FOR STRUCTURAL REPAIRS TO MY VEHICLE.",
        "vin": "JF1GE75608G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073524,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 SUBARU IMPREZA WRX. EVERY TIME THE CLUTCH IS ENGAGED OR DISENGAGED A CREAK/POP NOISE CAN BE HEARD. YOU CAN ALSO SEE THE CLUTCH AND BRAKE PEDAL MOVE SIGNIFICANTLY. THE SPOT WELDS ON THE FIREWALL/BULKHEAD HAVE SEPARATED MAKING IT VERY DIFFICULT TO GET INTO GEAR AND MAKING THE CLUTCH VERY FIRM. THIS NEEDS TO BE A RECALL. PEOPLE CAN NOT AFFORD THIS VERY EXPENSIVE WHILE MAKING PAYMENTS ON THEIR VEHICLE. THIS PROBLEM IS ALSO CAUSING PREMATURE WEAR ON TRANSMISSION PARTS AS WELL. I HAVE 4 SUBARUS AND IF THEY DON'T MAKE THIS RIGHT I WILL NOT BUY ANOTHER. VERY SAD TO SAY CONSIDERING I WORK FOR THEM BUILDING ENGINES.",
        "vin": "JF1GE74618G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067358,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIREWALL IS CRACKING WHICH CAN CAUSE THE CLUTCH PEDAL TO BECOME INOPERABLE. AFTER I HAD WORK DONE ON MY CAR THE MECHANIC TOLD ME THAT THE FIREWALL WAS CRACKING AND THAT I WOULD NEED TO CONTACT SUBARU OF AMERICA FOR POSSIBLE COVERAGE. THEY DENIED ME COVERAGE BECAUSE IT WOULD BE TOO COSTLY DESPITE THE FIREWALL BEING A KNOWN ISSUE ON THE WRX FROM 2008-2014",
        "vin": "JF1GE75618G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984665,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH BRACKET SPOT WELDS LET GO OF FIRE WALL. MAKING THE CLUTCH AND BRAKE PEDAL MOVE AND SQUEAK WHEN CLUTCH IS ENGAGED.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2017",
        "dateOfIncident": "03/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958678,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR USED WITH THE CLUTCH PEDAL SQUEAKING. IGNORED IT BECAUSE I THOUGHT IT JUST NEEDED GREASE. I WAS DRIVING HOME LAST NIGHT WHEN THE CLUTCH PEDAL GOT STUCK PRESSED ALL THE WAY DOWN. I STARTED RESEARCHING AND FOUND MANY POSTS OF PEOPLE WITH THE SAME PROBLEM. THE SQUEAKING WAS CAUSED BY THE CLUTCH PEDAL MOUNTING BRACKET SEPARATING FROM THE FIRE WALL. I CRAWLED UNDER THE DASHBOARD TO LOOK, AND SURE ENOUGH IT IS BROKEN.",
        "vin": "F1GH75628G8"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925474,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE I NOTICED WHILE DEPRESSING MY BRAKES OR CLUTCH, I WOULD HEAR A \"POPPING SOUND.\"  ALSO I NOTICED THE CLUTCH PEDAL AND THE BRAKE PEDAL WOULD MOVE TOWARDS THE LEFT TOGETHER (OPPOSE TO JUST UP AND DOWN) WHEN DEPRESSING THE CLUTCH PEDAL.  IT SEEMS LIKE THE WHOLE FIREWALL WHERE THE CLUTCH AND BRAKE PEDALS ARE ATTACHED TOO IS MOVING WHEN DEPRESSED.  THIS HAPPENS ALL THE TIME NOW WHEN CLUTCH PEDAL IS DEPRESSED.",
        "vin": "JF1GE74668G"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908832,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY DISCOVERED A KNOWN ISSUE IMPACTING MY PARTICULAR CAR AND CONFIRMED THE PROBLEM AFTER INSPECTING MY VEHICLE MYSELF.  THE FIRST 130K MILES WERE SPENT COMMUTING TO MY JOB 84 MILES A DAY AT OVER 90% HIGHWAY DRIVING (VERY LITTLE CLUTCH/BREAK ACTION REQUIRED), AND THE LAST 9K WERE PUT ON OVER THE LAST 4 YEARS - CAR MOSTLY SAT SINCE I STARTED WORKING FROM HOME.      OVER TIME SPOT WELDS WHICH HOLD THE CLUTCH/BRAKE ASSEMBLY TO THE FIREWALL HAVE BROKEN AND ASSEMBLY IS AT RISK OF DETACHING WHILE DRIVING MY CAR. NUMEROUS CARS HAVE BEEN AFFECTED OVER MULTIPLE MODEL YEARS AND HAS BEEN WELL DOCUMENTED SEE NASIOC OWNERS - HTTP://FORUMS.NASIOC.COM/FORUMS/SHOWTHREAD.PHP?T=2700583.      SUBARU HAS HISTORY OF DENYING CLAIMS DESPITE ISSUING EXTENDED WARRANTIES. THEIR INCONSISTENT TREATMENT OF THIS ISSUE AN UNWILLINGNESS TO ADDRESS THIS CLEAR DESIGN/ENGINEERING FLAW NEEDS TO BE HANDLES AT THE FEDERAL LEVEL.     I HAVE NOT REQUESTED A DEALERSHIP INSPECTION OR REPAIR DUE TO MY CARS AGE AND SUBARU'S PAST HISTORY OF DENYING CLAIMS.",
        "vin": "JF1GH74698G"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2016",
        "dateOfIncident": "11/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871148,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ISSUE PREVIOUSLY WITH THE WELDS FOR THE CLUTCH PEDAL ASSEMBLY CRACKING ON THE FIREWALL. IT GOT SO BAD THAT THE WHOLE PEDAL ASSEMBLY WITH THE BRAKE AND GAS PEDAL SHIFTED LEFT EVERY TIME I DEPRESSED THE CLUTCH. IT EVENTUALLY CAUSED THE CLUTCH TO NOT DISENGAGE ENTIRELY AND BURN OUT. SUBARU OF AMERICA FIXED THE PROBLEM BY SENDING IT TO A BODY SHOP TO RE-WELD THE PEDAL ASSEMBLY TO THE FIREWALL BUT NOW, JUST A FEW YEARS LATER, THE PEDAL IS SQUEAKING AGAIN JUST LIKE IT DID LAST TIME THE WELDS BROKE. I HAVEN'T TAKEN IT IN YET BUT IT IS AN UNMISTAKABLE SOUND.",
        "vin": "JF1GE74668G"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "04/27/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863136,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2008 WRX MAKES A SQUEAKING NOISE EVERY TIME IT'S ENGAGED. WHEN I INVESTIGATED THE NOISE, I NOTICED THAT THE CLUTCH PEDAL BRACKET ASSEMBLY (FORWARD FIREWALL) SHIFTS APPROX 1/4 INCH EVERY TIME THE CLUTCH PEDAL IS ENGAGED. I FOUND THAT THE THREE SPOT WELDS HOLDING THE CLUTCH PEDAL BRACKET TO THE FORWARD FIREWALL WERE BROKEN. FROM THE OUTSIDE OF THE FIREWALL, JUST UNDER THE WINDSHIELD WIPERS, THE SPOT WELDS ARE SEPARATING AWAY FROM THE FIREWALL EVERY TIME THE CLUTCH PEDAL IS ENGAGED. THIS ALLOWS THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY TO MOVE,MAKING THAT SQUEAKING NOISE. IF THE BRACKET COMPLETELY SEPARATES FROM THE FIREWALL, THE CLUTCH WILL NOT WORK. THIS IS SUPER SUPER DANGEROUS WHILE DRIVING.",
        "vin": "JF1GE746X8G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851681,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE YEARS AGO MY CLUTCH STARTED TO CREAK. I ASKED THE LOCAL SUBARU DEALER TO CHECK IT WHEN I TOOK IT IN FOR A SCHEDULED OIL CHANGE. I GOT TOLD THEY COULDN'T FIND A PROBLEM. SO I THOUGHT NOTHING OF IT. I JUST TOOK IT BACK TO THE DEALER AND GOT TOLD THE SPOT WELDS ON THE FIREWALL. SUBARU OFFERED TO FIX THE WELDS BUT I HAVE TO PAY FOR A NEW CLUTCH ASSEMBLY. IF THE WELDS TOTALLY FAIL THIS COULD BECOME A SERIOUS SAFETY ISSUE AS IT WILL AFFECT THE BRAKE MOTION ALSO.",
        "vin": "JF1GH75638G"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2016",
        "dateOfIncident": "12/22/2015",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819981,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED, CAR OFF. VEHICLE OWNER IN GYM WORKING OUT WHEN AN EMPLOYEE ALERTED HIM HE HAD SMOKE COMING OUT FROM UNDERHOOD. OWNER WENT OUT AND FOUND FLAMES COMING OUT OF HOOD SCOOP. OPENED HOOD AND FOUND WHAT APPEARED TO BE SECONDARY AIR PUMP ON FIRE. EXTINGUISHED WITH FIRE EXTINGUISHER. TOWED CAR TO SHOP AND INITIAL INSPECTION APPEARS THAT THE PLASTIC SECONDARY AIR PUMP CAUGHT FIRE AND WAS STARTING TO BURN AND DO DAMAGE TO SURROUNDING UNDERHOOD COMPONENTS. VEHICLE CURRENTLY IN SHOP (SMART SERVICE 206-417-0880) HAVING DAMAGE PARTS REPLACED. IT APPEARS THAT IF THIS FIRE WAS NOT EXTINGUISHED IT WOULD HAVE BURNED THE VEHICLE TO THE GROUND AND ANYTHING SURROUNDING IT.  MORE PICTURES ARE AVAILBLE BY CALLING SHOP LISTED ABOVE AS WELL AS ALL OLD PARTS WILL BE SAVED FOR INSPECTION IF NEEDED.",
        "vin": "JF1GH75658G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "01/30/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787965,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS VERIFIED BY THE DEALERSHIP: THE FIREWALL WELDS KEEPING THE CLUTCH BRACKETS IN PLACE ARE CRACKED. THIS CAUSES THE PEDAL ASSEMBLY TO HAVE PLAY AND MOVE AS UNINTENDED. IF THE PEDAL BRACKET WERE TO BECOME MORE UNSTABLE THE VEHICLE COULD BE UNCONTROLLABLE DURING USE.",
        "vin": "JF1GH7466G8"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "08/12/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782125,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPOT WELDS THAT HOLD MY CLUTCH PEDAL ASSEMBLY ON THE FIRE WALL ARE BREAKING AND CAUSING PROBLEMS GETTING CAR INTO 1ST AND REVERSE",
        "vin": "JF1GE74698G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779146,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS VEHICLE USED FROM A DEALERSHIP IN JANUARY OF 2015 WITH OVER 100,000 MILES ON THE ODOMETER. AFTER A FEW MONTHS OF DRIVING IT I BEGAN TO HEAR A CLICK EVERY TIME I DEPRESSED THE CLUTCH PEDAL. I LOOKED INTO THE ISSUE TO SEE IF IT WAS A COMMON PROBLEM AND IF THERE WAS AN EASY FIX TO IT. TURNS OUT SIX OF THE SEVEN SPOT WELDS THAT HOLD MY CLUTCH AND BRAKE ASSEMBLY TO THE FIREWALL WERE CRACKED. THERE IS A RECALL FOR THIS ISSUE ALREADY BUT THEY WONT SERVICE VEHICLES PAST 40,000 MILES.THIS DOES NOT HELP ME SEEING AS THE CAR IS FAR PAST 40,000. NOT ONLY IS THIS A SAFETY ISSUE BUT IT IS ALSO CAUSING OTHER PARTS OF THE CAR TO PREMATURELY WEAR OUT SUCH AS THE CLUTCH AND THE RELEASE BEARING. I NEED HELP.",
        "vin": "JF1GH75628G"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/16/2015",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734432,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2009 WRX MAKES A LOUD CREAKING NOISE EVERY TIME IT'S DEPRESSED. WHEN I INVESTIGATED THE NOISE, I NOTICED THAT THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY (ATTACHED TO THE FORWARD FIREWALL) SHIFTS APPROX 1/4 INCH EVERY TIME THE CLUTCH PEDAL IS DEPRESSED. I FOUND THAT THE THREE SPOT WELDS SECURING THE CLUTCH PEDAL BRACKET TO THE FORWARD FIREWALL WERE BROKEN. FROM THE OUTSIDE OF THE FIREWALL, JUST UNDER THE WINDSHIELD WIPERS, I SAW THE SPOT WELDS PULLING AWAY FROM THE FIREWALL EVERY TIME THE CLUTCH PEDAL WAS DEPRESSED. THIS ALLOWS THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY TO MOVE, CAUSING THE CREAKING NOISE. IF THE BRACKET COMPLETELY SEPARATES FROM THE FIREWALL, THE CLUTCH MAY BECOME COMPLETELY INOPERATIVE - ESPECIALLY DANGEROUS WHILE DRIVING. I EVENTUALLY FIXED IT MYSELF WITH A CUSTOM MADE BRACE AND SOME BOLTS.   UPDATED 12/21/2015*JS",
        "vin": "JF1GE76619G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726823,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK CLUTCH DIFFICULT TO GET IN GEAR FOUND CLUTCH PEDAL SUPPORT BRACE BROKEN AWAY FROM FIREWALL. NEEDED TO REWELD BRACE AND ADD PLATE AND ADDITIONAL WELDS",
        "vin": "JF1GE75638G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "12/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724438,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY PEOPLE WITH SUBARU WRX AND STI MODEL CARS HAVE BEEN HAVING PROBLEMS WITH THE SPOT WELDS THAT HOLD THE CLUTCH PEDAL ASSEMBLY. THESE SPOT WELDS HAVE A TENDENCY TO BRAKE OFF  AND LEAVE THE CAR INOPPERABLE BECAUSE ONCE THOSE SPOT WELDS BRAKE OFF YOU CANT PUSH IN THE CLUTCH PEDAL TO PUT IT IN GEAR. ONE OF THE EARLY SYMPTOMS I HAD IN MY CAR WAS A SQUEAKY CLUTCH PEDAL. MANY PEOPLE IN THE SUBARU COMMUNITY HAVE HAD THIS PROBLEM AND THERES EVIDENCE OF THIS ON YOUTUBE AND MANY SUBARU FORUMS LIKE NASIOC.COM . WE NEED HELP GETTING THIS FIX, SUBARU OF AMERICA HAS KNOWN FOR YEARS ABOUT THIS DEFECT BUT THEY HAVE BEEN DOING NOTHING ABOUT IT. MANY PEOPLE HAVE HAD TO PAY 1000-2000 DOLLARS OUT OF POCKET TO GET THIS PROBLEM FIXED BECAUSE SUBARU DOESNT WANT TO TAKE RESPONSIBILITY.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716235,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL WAS MAKING A LOT OF NOISE, PROGRESSIVELY GETTING WORSE OVER THE YEARS THAT I'VE OWNED THIS CAR. I TOOK IT TO THE DEALERSHIP AND THEY ADJUSTED THE PEDAL ASSEMBLY. THE NOISE CAME BACK SHORTLY AFTER SO I TOOK IT TO THE DEALERSHIP AGAIN AND THEY REPLACED THE PEDAL ASSEMBLY. ONCE AGAIN, THE NOISE CAME BACK, BUT THIS TIME IT WAS WORSE THAN EVER. THE DEALERSHIP IS SAYING THE CLUTCH PEDAL MOUNT HAS HAD ALL WELDS FAIL THAT ATTACH IT TO THE FIREWALL. SUBARU NEEDS TO ADDRESS THIS AS IT SEEMS MANY OWNERS HAVE THIS SAME ISSUE.",
        "vin": "JF1GE746X8G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/06/2015",
        "dateOfIncident": "11/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714939,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH STARTED MAKING A CREAKING NOISE WHEN PRESSING IN AND OUT.  SHIFTING GEARS HAS ALSO BECOME MORE DIFFICULT LIKE THE CLUTCH ISN'T FULLY ENGAGING AND DISENGAGING.  I ALSO NOTICED THE WHOLE ASSEMBLY SHIFTS (CLUTCH AND BRAKE PEDALS) WHEN PRESSING DOWN ON THE CLUTCH.  TURNS OUT THE SPOT WELDS ON THE BRACKET THAT HOLD THE ASSEMBLY ARE COMPLETELY BROKEN,  CAUSING FLEX TO THE CLUTCH AND BRAKE ASSEMBLY.  IF THAT BRACKET RIPS OFF,  COULD LOSE BRAKING POWER.  THIS IS UNSAFE AND NEEDS TO BE RECALLED.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702898,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2008 WRX MAKES A CREAKING AND POPPING NOISE WHEN THE PEDAL IS DEPRESSED/RELEASED. I AM NOT ENTIRELY SURE HOW LONG IT HAS BEEN MAKING THIS NOISE, AND ORIGINALLY I HAD THOUGHT NOTHING OF IT. AFTER READING SOME FORUMS ONLINE, I BEGAN TO SUSPECT THAT THE SPOT WELDS ON THE FIREWALL WERE BROKEN. FROM WHAT I UNDERSTAND THIS IS A FAIRLY COMMON ISSUE WITH THIS MODEL OF CAR. I CALLED SUBARU OF AMERICA TO FILE A COMPLAINT AND TRY TO GET THE ISSUE RESOLVED. WHEN I SPOKE WITH A REPRESENTATIVE ON THE PHONE, HE INFORMED ME THAT HE WAS AWARE OF THE ISSUE, AND REQUESTED THAT I TAKE THE CAR IN TO A DEALERSHIP TO CONFIRM THAT THIS WAS INDEED THE PROBLEM. I TOOK THE CAR IN AND THEY CONFIRMED THAT MY SPOT WELDS WERE BROKEN. THIS IS A MAJOR SAFETY CONCERN AS THE FIREWALL IS FLEXING EVERY TIME THE CLUTCH PEDAL IS ENGAGED. THE BRAKE PEDAL MOVES TO THE LEFT DUE TO THE WAY THE FIREWALL FLEXES WHEN THE PEDAL IS ENGAGED. IF THE CLUTCH PEDAL BRACKET ASSEMBLY SEPARATES FROM THE FIREWALL ENTIRELY, THIS COULD CAUSE THE CLUTCH TO BECOME INOPERABLE, WHICH COULD BE PARTICULARLY DANGEROUS IF IT OCCURS WHILE THE VEHICLE IS IN USE.   REFERENCE LINKS:  HTTP://CARPROBLEMZOO.COM/SUBARU/IMPR...S-PROBLEMS.PHP  HTTP://WWW.FAQS.ORG/CAR/SUBARU-IMPRE...POWER-TRAIN/#B  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-D...ON-NEEDED.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/37-C...INKAGE-45.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-D...EWALL-FIX.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/37-C...BLY-ISSUE.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-D...S-STORY-2.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-D...L-PROBLEM.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-D...OLT-STYLE.HTML  HTTP://FORUMS.NASIOC.COM/FORUMS/SHOW....PHP?T=2128617  HTTP://FORUMS.NASIOC.COM/FORUMS/SHOW....PHP?T=2184210  HTTP://FORUMS.NASIOC.COM/FORUMS/SHOW....PHP?T=2305937.  *TR",
        "vin": "JF1GE75638G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/16/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694482,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WELDS SUPPORTING THE CLUTCH PEDAL AND BRAKE PEDAL ASSEMBLY HAVE BROKEN. THE RESULT IS A PROMINENT SQUEAKING SOUND AND A NOTICEABLE LATERAL MOVEMENT OF THE PEDAL ASSEMBLY TO THE LEFT. THIS IS A REOCCURRING ISSUE AS IT HAD PREVIOUSLY BEEN ADDRESSED AND REPAIRED BACK IN JUNE OF 2014. AT THE TIME SUBARU OF AMERICA AGREED TO PAY FOR HALF OF THE REPAIRS AS THE VEHICLE WAS OUTSIDE OF WARRANTY COVERAGE. THE NEW ISSUE ARE FROM BROKEN WELDS IN ANOTHER AREA THAT WAS NOT INSPECTED OR DID NOT APPEAR TO NEED REPAIR AT THE TIME. MILEAGE AT TIME OF REPAIR WAS 74,839, CURRENT MILEAGE IS 84,420 (3/16/2015).  HOWEVER, FURTHER RESEARCH ON THIS ISSUE INDICATE THAT IT IS A WIDESPREAD ISSUE THAT HAS AFFECTED MANY OTHER SUBARU IMPREZA OWNERS WITH MODEL YEARS 2008 THROUGH 20012. THIS IS NOT THE RESULT OF OWNER NEGLECT, MISUSE, OR IMPROPER MAINTENANCE.   MY SAFETY CONCERN IS THAT THIS DOES APPEAR TO HAVE AN IMPACT ON THE FUNCTIONALITY OF CLUTCH PEDAL AND BRAKES UNDER ALL NORMAL CONDITIONS OF USE. FULL BREAKAGE OF THE ASSEMBLY COULD RESULT IN LOSS OF CONTROL, INJURY, AND OR DEATH. ORIGINAL CLAIM TO SOA WAS #[XXX], REPRESENTED BY RICH.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JF1GE75668G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692673,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PART OF THE STEEL BODY UNDER THE DASH THAT SUPPORTS THE CLUTCH PEDAL SHAFT ASSEMBLY FRACTURES INTO TWO PIECES DUE TO FLEX FORCES OVER TIME. THIS RESULTS IN THE CLUTCH MASTER CYLINDER FLEXING AT ITS MOUNTING POINT ON THE FIREWALL WHEN CLUTCH PEDAL IS DEPRESSED. SEVERED SQUEAKING AND NOISE IS HEARD EVERY TIME THE CLUTCH IS DEPRESSED AS A RESULT. WELDING IS NOT FEASIBLE AS IT IS LOCATED UN THE DASH (ABOVE THE ACCELERATOR PEDAL) AND WOULD CAUSE FIRE AROUND FLAMMABLE MATERIALS. THIS CAN BE SEEN ON YOUTUBE VIDEOS SUBMITTED BY SUBARU WRX OWNERS AND AFFECTS 2008-2014 WRX IMPREZA VEHICLES. SHOULD FIREWALL FRACTURE DUE TO THIS FLEX OVER TIME, ABILITY TO DISENGAGE THE CLUTCH BY PRESSING THE PEDAL WOULD RESULT AND PRESENT A VERY HIGH PROBABILITY OF CRASH OR ACCIDENT AS A LACK OF VEHICLE CONTROL AND ABILITY TO STOP VEHICLE. FOR ONE VIDEO OF THIS, SEE:  HTTPS://WWW.YOUTUBE.COM/WATCH?V=ZR6UMGZ5UTC.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "04/16/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691481,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 SUBARU IMPREZA WRX WITH A STOCK CLUTCH. FOR APPROXIMATELY 2 YEARS I HAVE BEEN HEARING CREAKING AND/OR CLICKING NOISES WHEN ENGAGING THE CLUTCH PEDAL. BEGAN TO LOOK ONLINE FOR A SOLUTION AND FOUND THAT THERE ARE SPOT WELDS THAT BREAK BETWEEN THE FIREWALL AND THE MOUNTING BRACKET THE CLUTCH PEDAL ASSEMBLY IS ATTACHED TO (HTTPS://WWW.GOOGLE.COM/?GWS_RD=SSL#Q=WRX+SPOT+WELDS). I REMOVED THE NECESSARY ITEMS TO INSPECT THE WELDS AND THEY DID UNFORTUNATELY FAIL.     LIST OF REFERENCES REGARDING ONGOING ISSUE:  HTTP://WWW.FAQS.ORG/CAR/SUBARU-IMPREZA-2009/POWER-TRAIN/#B  HTTP://CARPROBLEMZOO.COM/SUBARU/IMPREZA/SERVICE-BRAKES-PROBLEMS.PHP  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-DRIVETRAIN-TRANSMISSION-GEAR-BOX/21478-FIREWALL-WELD-BREAK-INFORMATION-NEEDED.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/37-CAR/8781-CLUTCH-PEDAL-SQUEAK-NOT-CLUTCH-TOB-LINKAGE-45.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-DRIVETRAIN-TRANSMISSION-GEAR-BOX/20639-POPPING-CLUTCH-BROKEN-FIREWALL-FIX.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/37-CAR/13265-HELP-PLEASE-CRACKED-FIREWALL-NOISY-CLUTCH-CRACKED-PEDAL-ASSEMBLY-ISSUE.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-DRIVETRAIN-TRANSMISSION-GEAR-BOX/22130-MY-CLUTCH-SQUEAK-BROKEN-WELDS-STORY-2.HTML  HTTP://WWW.WRXFORUMS.COM/FORUMS/84-DRIVETRAIN-TRANSMISSION-GEAR-BOX/11134-ANOTHER-08-CLUTCH-PEDAL-FIREWALL-PROBLEM.HTML  HTTP://FORUMS.NASIOC.COM/FORUMS/SHOWTHREAD.PHP?T=2128617.  *TR",
        "vin": "JF1GE74638G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2015",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691242,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BASICALLY THE WELDS ON THE CLUTCH ASSEMBLY BROKE LOOSE AND HAS CAUSED DAMAGED TO THE CLUTCH AND BRAKES. SUBARU DID TRY TO FIX THIS BUT IS FAILING AGAIN AND BELIEVE THERE IS A SAFETY ISSUE. WHEN THIS FAILED THE CLUTCH AND BRAKE MOVE ABOUT 1.5\" WHEN DEPRESSED.I AM PART OF A CLASS ACTION LAW SUITE AND NEED YOUR HELP BEFORE SOMEONE LOSSES A LIFE.  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JF1GH756X8G"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679338,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE/CLUTCH BRACKET WELD FAILURE. BRAKE/CLUTCH PEDAL ASSEMBLY IS LOSE.  3 OF THE 5 SPOTWELDS HOLDING THE BRAKE/CLUTCH ASSEMBLY HAVE FAILED. THIS CAUSES THE BRAKES TO FEEL MUSHY AND THE CLUTCH DIFFICULT TO DEPRESS AND DIFFICULT TO ENGAGE AND DISENGAGE THE CLUTCH.  THE BRAKES MAY FAIL IF THE OTHER TWO WELDS BRAKE.  *TR",
        "vin": "JF1GH74668G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "11/08/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668191,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY CAR TO A SUBARU DEALERSHIP FOR ALL MAINTENANCE SERVICES. THEY ADVISED ME TO REPLACE MY CLUTCH. I PAID FOR CLUTCH REPLACEMENT. THIS DID NOT FIX THE NOISE THAT CAME FROM THE CLUTCH PEDAL. THE NOISE IS FROM A CRACKED FIREWALL. THE DEALERSHIP TOLD ME I HAVE TO SEND THE CAR AWAY TO BE RE WELDED AND IT WILL COST 1,900 DOLLARS. I AM EXTREMELY DISAPPOINTED WITH THIS CRACKED FIREWALL ISSUE BECAUSE MY CLUTCH HAS BEEN MAKING NOISE FOR A VERY LONG TIME AND THE DEALERSHIP HAD MULTIPLE OPPORTUNITIES TO TELL ME THIS. I AM ALSO EXTREMELY DISAPPOINTED THAT I PAID 2,100 DOLLARS FOR A NEW CLUTCH WHICH DID NOT FIX THE ISSUE WHICH WAS THE NOISE FROM A CRACKED FIREWALL. I AM ALSO EXTREMELY DISAPPOINTED THAT THEIR ANSWER IS TO RE WELD. IF IT WERE TO BE RE WELDED THEN IT WILL CRACK AGAIN. IF I GOOGLE FIREWALL ISSUE WRX, THE RESULT COMES UP WITH NUMEROUS COMPLAINTS. THIS IS A MAJOR SAFETY CONCERN AND THIS NEEDS TO BE A RECALL NOTICE.   *TR",
        "vin": "JF1GH75618G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668013,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CLICKING/CRACKING NOISE STARTED ABOUT A YEAR AGO WHEN THE CLUTCH IS LET OUT.  DID NOT THINK TOO MUCH ABOUT IT.  IN NOVEMBER OF 2014, THE CLICKING STOPPED AND WAS LEFT WITH AN EERIE SQUEAKING SOUND.  THIS IS WHEN I STARTED TO INVESTIGATE WHAT IT IS.  TURNS OUT, THE FIREWALL IS TOO THIN TO HANDLE THE PRESSURE FROM THE BRAKE/CLUTCH MECHANISM.  THE PINS THAT GO THROUGH THE FIREWALL GET WORN AWAY FROM THE THIN FIREWALL CAUSING THE SPOT WELDS TO FAIL.  THE CAR IS CURRENTLY AT A SUBARU DEALERSHIP AND THEY HAVE ACKNOWLEDGED THAT IT IS THE SPOT WELDS.  I AM WAITING TO HEAR MORE FROM SUBARU OF AMERICA TO SEE IF THEY WILL ACKNOWLEDGE THAT THIS IS IN FACT A MANUFACTURES DEFECT AND NOT SOMETHING THAT IS CAUSED BY NORMAL WEAR AND TEAR.  IF THAT WAS THE CASE THERE WOULD NOT BE THIS MANY COMPLAINTS ABOUT THIS ISSUE.  THERE SHOULD BE A RECALL ISSUED ON THIS MANUFACTURING DEFECT.  IF THERE ARE THIS MANY COMPLAINTS HERE, HOW MANY CARS ARE OUT THERE WITH DRIVERS THAT ARE OBLIVIOUS TO THIS DEFECT THAT ARE STILL DRIVING WITH BRAKES/CLUTCH THAT COULD FAIL AT ANY TIME?  *TR",
        "vin": "JF1GH74658G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660524,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WELDS HOLDING THE CLUTCH AND BRAKE PEDAL ASSEMBLY TO THE FIREWALL ARE BREAKING.  DEPRESSING THE CLUTCH CAUSES FLEXING. IF/WHEN IT BREAKS OFF, THE CAR WILL BE DANGEROUS DUE TO NO FOOT BRAKING AND AN ENGAGED CLUTCH.  SEEMS LIKE A COMMON PROBLEM WITH THIS MODEL.  TIME FOR A MANUFACTURER PAID FIX.  *TR",
        "vin": "JF1GE74648G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "11/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 WRX, 61K MILES DRIVEN SINCE SEPTEMBER 2007. SECOND CLUTCH REPLACEMENT AND WAS TOLD BY THE DEALERSHIP SERVICE (KIRKLAND, WA) THAT THE SPOT WELDS FOR THE CLUTCH NEED WORK DONE BY BODY SHOP - ABOUT $1200. WAS TOLD THAT THIS WAS BECAUSE OF THE WEIGHT OF THE CLUTCH BUT THE CLUTCH WAS ALMOST ALWAYS HEAVY IN THE CAR. IT FIRST BECAME HEAVY 1-3 MONTHS AFTER IT WAS PURCHASED AND ABOUT THE SAME TIME AFTER THE CLUTCH WAS FIRST REPLACED. I UNDERSTAND THE CLUTCH COULD GET WORN IN A FEW YEARS, BUT BODY STRUCTURE LETTING GO IS NOT SOMETHING I'D EXPECT TO HAPPEN IN A 7 YEAR OLD CAR. I SEE MANY SIMILAR REPORTS AT HTTP://WWW.ARFC.ORG/COMPLAINTS/2008/SUBARU/IMPREZA/STRUCTURE/PROBLEM.ASPX. SOUNDS LIKE A POSSIBLE RECALL ISSUE TO ME.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651643,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU WRX. THE CONTACT STATED THAT WHILE DEPRESSING THE CLUTCH, THE BRAKE PEDAL BRACKET MOVED.  THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE CLUTCH PLATE WAS LOSE AND NEEDED TO BE REPLACED.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE.  THE FAILURE MILEAGE WAS 94,000.",
        "vin": "JF1GE74648G"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649481,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING HOME I WAS EXITING THE HIGHWAY WHEN MY BRAKE PEDAL WHEN TO THE FLOOR WITH NO PRESSURE. I USED THE EMERGENCY BRAKE AND CLUTCH TO GET OUT OF GEAR TO SLOW DOWN. I WAS ABLE TO SLOW DOWN TO A STOP AND WHEN I STOPPED MY BRAKES CONTINUED TO WORK. I TOOK MY CAR INTO A SUBARU DEALERSHIP AND WAS TOLD THAT THE WELDS ON MY FIREWALL WERE BROKEN THAT HOLD ON MY CLUTCH AND BRAKE PEDAL ASSEMBLY.     *TR",
        "vin": "JF1GH74628G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "11/28/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632024,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU OF AMERICA DOES NOT WANT TO TAKE RESPONSIBILITY FOR THEIR DEFECTED CLUTCH PEDAL ASSEMBLIES ON THEIR CARS. MY CAR WAS HAVING TROUBLE SHIFTING GEARS WHILE I WAS DRIVING SO I WENT TO GO GET IT CHECKED OUT. TURNS OUT THAT THE SPOT WELDS THAT HOLD THE CLUTCH BRACKET TO THE FIREWALL HAD BROKEN OFF. SUBARU NEEDS TO DO A RECALL ON THEIR CARS BECAUSE THIS IS A SERIOUS PROBLEM. THERE ARE MANY VIDEOS ON YOUTUBE WITH SUBARU OWNERS HAVING THIS PROBLEM. ONCE AGAIN THIS PROBLEM NEEDS A RECALL!!!!  *TR",
        "vin": "JF1GE75608G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625833,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A CLUTCH PEDAL SQUEAK NOISE FOR A LITTLE WHILE, THEN WHILE DRIVING, WENT TO PUSH IN THE CLUTCH, HEARD A POP NOISE. THEN THE BRAKE PEDAL AND CLUTCH PEDAL BEGAN TO MOVE IN ERRATIC DIRECTIONS WHEN DEPRESSED. THE PIECE OF SHEET METAL THAT THE PEDAL ASSEMBLY BOLTS TO BROKE AWAY FROM THE FIREWALL. ALL THE WELDS BROKE DO TO FLEXING IN THE FIREWALL SHEETMETAL.  *TR",
        "vin": "JF1GE75658G"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "07/31/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621164,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I PRESS IT THE CLUTCH I HEAR A CRACKLING NOISE FROM THE BROKEN WELDS THAT HOLD UP THE BRAKE AND CLUTCH ASSEMBLY TO THE FIREWALL. FEAR FOR MY SAFETY AND OTHER BECAUSE IF THE OTHER WELDS BREAK I MAY BE IN OR CAUSE AN ACCIDENT DUE NOT BEING ABLE TO BRAKE MY VEHICLE .  *TR",
        "vin": "JF1GE746X8G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/26/2014",
        "dateOfIncident": "07/31/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616452,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2008WRX MAKES A LOUD CREAKING/CLICKING NOISE EVERY TIME IT'S DEPRESSED. WHEN I INVESTIGATED THE NOISE, I NOTICED THAT THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY (ATTACHED TO THE FORWARD FIREWALL) SHIFTS APPROX 1/4 INCH EVERY TIME THE CLUTCH PEDAL IS DEPRESSED. I FOUND THAT THE THREE SPOT WELDS SECURING THE CLUTCH PEDAL BRACKET TO THE FORWARD FIREWALL WERE BROKEN. FROM THE OUTSIDE OF THE FIREWALL, JUST UNDER THE WINDSHIELD WIPERS, I SAW THE SPOT WELDS PULLING AWAY FROM THE FIREWALL EVERY TIME THE CLUTCH PEDAL WAS DEPRESSED. THIS ALLOWS THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY TO MOVE, CAUSING THE CREAKING NOISE. IF THE BRACKET COMPLETELY SEPARATES FROM THE FIREWALL, THE CLUTCH MAY BECOME COMPLETELY INOPERATIVE - ESPECIALLY DANGEROUS WHILE DRIVING. THIS ALSO HAS INCREASED WEAR ON MY TRANSMISSION GEARS AND SYNCHROS.  *TR",
        "vin": "JF1GE75668G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "02/07/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587854,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECOGNIZED A SQUEAKING SOUND EVERY TIME I DEPRESSED MY CLUTCH TO SHIFT THE CAR. HAVING HAD AN OIL CHANGE, I WASN'T SCHEDULED FOR CAR MAINTENANCE FOR 3 MONTHS OR 3,000 MILES. WHEN I TOOK MY CAR TO MY MECHANIC FOR SERVICE, I ASKED THEM TO CHECK THE SQUEAKING SOUND. THE TECHNICIAN FOUND A THAT THE STRUCTURE OF THE FIREWALL AT THE CLUTCH AND BRAKE PEDAL ASSEMBLY WAS FAILING - THE SPOT WELDS WERE SHATTERED. THE TECHNICIAN REMOVED THE WIPER BLADE ASSEMBLY AND FOUND THAT THE PEDAL ASSEMBLY FLEXES TO THE POINT OF MOVING THE FIREWALL OUT AT THE CLUTCH MASTER AND THAT THE FIREWALL IS CRACKED AT THE CLUTCH CYLINDER. AFTER RESEARCHING THE ISSUE, THE TECHNICIAN LEARNED THE PROBLEM IS INHERENT IN THIS PARTICULAR YEAR AND MODEL, AS WELL AS IN THE 2009 MODEL. THE TECHNICIAN RECOMMENDS REMOVING THE DASHBOARD, BRAKE BOOSTER, MASTER CYLINDER, AND CLUTCH CYLINDER IN ORDER TO IDENTIFY AND WELD THE BROKEN PIECES OF THE BRACKET THAT SHOULD BE HOLDING THE CLUTCH PEDAL ASSEMBLY IN PLACE. THIS REQUIRES ONLY WELDING AND REPLACING THE CLUTCH PEDAL ASSEMBLY, AS WELL AS FLUSHING THE BRAKE AND CLUTCH FLUID. THE OVERALL CONCERN WITH THIS STRUCTURAL FAILURE IS THAT THE DEGRADATION OF THE FIREWALL AND CLUTCH ASSEMBLY WILL CREATE AN ISSUE WHERE MY SAFETY IS AT RISK WHEN I LOSE THE ABILITY TO DRIVE THE VEHICLE BECAUSE SHIFTING WILL FAIL. IN A LOW OR HIGH SPEED SITUATION, I WOULD NEED TO DOWN OR UP SHIFT MY CAR TO HELP AVOID COLLISION OR LESSEN THE IMPACT OF A COLLISION. WITHOUT THIS ABILITY, I PUT MY LIFE, MY PASSENGER'S LIFE AND OTHER DRIVERS' LIVES IN DANGER. GIVEN THAT THIS IS A WIDESPREAD ISSUE WITH THE MAKE, MODEL AND YEAR, I BELIEVE SUBARU SHOULD ISSUE A RECALL. I AM ESPECIALLY CONCERNED TO FIND THAT MY PARTICULAR CAR IS ON THE PULL DOWN MENU WITH THE NTSB, AND UNTIL MY CAR STARTED TO FAIL, I HEARD NOTHING FROM THE NTSB, SUBARU OR THE DEALERSHIPS REGARDING THIS ISSUE. RESPONSE EXPECTED.  *TR",
        "vin": "JF1GE74628G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/01/2014",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585816,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN NOTICING A CREAKING AND POPPING NOISE FROM MY CLUTCH/BRAKE PEDAL ASSAY FOR SOME TIME NOW AND HAVE FOUND IT TO BE THE BRACE THAT HOLDS THE CLUTCH AND BRAKE PEDAL TO THE FIREWALL OF VEHICLE IS SPOT WELDED IN 2 PLACES AT TOP OF BRACKET AND THE SPOT WELDS HAVE CRACKED AND BROKEN AND THE BRACE NOW MOVES AROUND AND THE CLUTCH AND BRAKE PEDAL BIND AND STICK. I HAVE SINCE NOTICED IT GETTING WORSE AND NOTICED THE 4 SPOT WELDS ON THE BOTTOM OF THE BRACE HAVE CRACKED AND BROKEN ALSO. AS A AUTO TECHNICIAN I SEE PROBLEMS WITH VEHICLE ALL THE TIME AND THIS IS A HUGE SAFETY CONCERN IF THE BRACE AS TO BREAK OFF COMPLETELY THE VEHICLE WOULD LOOSE BRAKING CAPABILITIES AND THE ABILITY FOR THE CLUTCH TO DISENGAGE THE ENGINE FROM THE TRANSMISSION IN AN EMERGENCY I HAVE NOTICED ON MULTIPLE FORUMS THAT THERE ARE A LOT OF OWNERS WITH THE SAME PROBLEM. I FEEL AS SUBARU SHOULD PERFORM A RECALL/REPAIR FOR THIS ISSUE AS TO NOT HAVE VEHICLES BEING UNSAFE TO DRIVE. IF NEEDED I CAN SUPPLY PICTURES OF MY VEHICLE AND THE POINT OF FAILURE.   *TR",
        "vin": "JF1GE74668G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585559,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A MANUAL TRANSMISSION AND I NOTICED SIGNIFICANT SIDE WAY BACK AND FORTH MOVEMENT IN THE CLUTCH PEDAL AND BRAKE PEDAL WHILE THE CAR WAS STATIONARY.  IN THE LAST WEEK IT HAS BECOME VERY DIFFICULT TO ENGAGE THE CLUTCH AND GET THE CAR IN GEAR.  I TOOK THE CAR IN TO A SUBARU DEALERSHIP AND THEY KNEW RIGHT AWAY WHAT THE PROBLEM WAS.  SPOT WELDS ON THE PEDAL MOUNTS TO THE FIREWALL WERE FAILING.  THEY THEN SENT ME TO A BODY SHOP, WHICH HAS HAD EXPERIENCE MAKING THE NECESSARY REPAIR.  APPARENTLY THE BODY SHOP HAS REPAIRED SEVERAL SUBARU WRXS WITH THE SAME PROBLEM.    OF COURSE THEY WANT ME TO PAY FOR THE REPAIR.   *JS",
        "vin": "JF1GE74688G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2014",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583697,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUSH MY CLUTCH PEDAL  IN, MY BRAKE PEDAL MOVES TO THE LEFT ABOUT AN INCH AND A HALF. IT HAS ALSO SQUEAKED SINCE 20,000 MILES BUT I NEVER THOUGHT IT WAS A PROBLEM. MY CAR WAS INSPECTED BY AN INDEPENDENT MECHANIC AND THEY CONFIRMED MY FIREWALL IS FLEXING BECAUSE OF CRACKED WELDS. I NOTICED THIS HAPPENING AROUND 85,000 MILES ON A STOCK CLUTCH. THE DEALERSHIP IS CLAIMING THEY HAVE NEVER HEARD OF THE ISSUE AND I WOULD HAVE TO PAY $125 JUST FOR THEM TO INVESTIGATE THE ISSUE.  *TR",
        "vin": "JF1GH74638G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583541,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PLATE MOUNTED TO THE FIREWALL FLEXES AND SQUEAKS WHEN DEPRESSED AND WAS TOLD THIS IS FROM THE SPOT WELDS THAT HOLD THE CLUTCH PLATE TO THE FIREWALL NOT A SQUEAKY PEDAL LIKE I THOUGHT. IF LEFT IN THIS STATE I'M TOLD IT COULD LEAD TO THE CLUTCH PEDAL FAILING BY THE SPOT WELDS BREAKING AND THE PLATE AND PEDAL COMING OFF THE FIREWALL. I'M TOLD THAT THIS ONLY HAPPENS A LOT WITH THIS SPECIFIC YEAR AND MODEL SUBARU FROM A SUBARU MECHANIC YET NO RECALL OR ADVISORY HAS BEEN ANNOUNCED  *TR",
        "vin": "JF1GH75618G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575829,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS MAKING CLICKING NOISE EVERY-TIME THE CLUTCH IS BEING PRESSED / RELEASED. ADVISED IT IS THE SPOT WELDS BY THE FIREWALL HOLDING ON (THEY ARE FAILING).  *TR",
        "vin": "1F1GE74648G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566819,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HAVING A PROBLEM SHIFTING GEARS AND NOTICED THAT WHEN I DEPRESSED THE CLUTCH THAT THE BRAKE PEDAL WAS MOVING ALSO.   I TOOK THE VEHICLE TO A LOCAL REPAIR SHOP AND THEY DISCOVERED THAT THE PEDAL MOUNTING BRACKET THAT IS SPOTWELDED TO THE FIREWALL HAD BROKEN AT THE WELDS.   I WAS QUOTED $1200 FOR THE REPAIRS AS THE DASH & STEERING COLUMN HAVE TO BE REMOVED.  I WAS TOLD THAT THIS IS AN UNSAFE CONDITION AS IT COULD CAUSE AN ACCIDENT.  I FEEL THAT SUBARU SHOULD BE RESPONSIBLE FOR THE COST OF THE REPAIRS AS THIS IS CLEARLY A DESIGN DEFECT AND A SAFETY ISSUE.  *TR",
        "vin": "JF1GE74628G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565813,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SPOT WELDS ON THE CLUTCH PEDAL BRACKET ATTACHED TO THE FIREWALL HAVE CRACKED CAUSING A DISTINCT SQUEAKING NOISE AND HARD SHIFTING.  MECHANIC TOLD ME THAT THE BRACKET SEPARATION IS PUSHING AGAINST THE CLUTCH, CAUSING A SIDEWAYS PUSH INTO THE CLUTCH MASTER CYLINDER.  THIS DOES NOT ALLOW FOR FULL ENGAGEMENT OF THE CLUTCH WHEN SHIFTING GEARS AND IS FLEXING THE MASTER CYLINDER, CAUSING ADDITIONAL STRESS AND DAMAGE.  ADDITIONALLY, THE BRAKE PEDAL IS BEING DEPRESSED BY APPROXIMATELY 1/2\" DURING EVERY CLUTCH ENGAGEMENT. SUBARU OF AMERICA IS ONLY OFFERING TO COVER 50% OF THE WORK TO CORRECT THEIR DESIGN/MANUFACTURING DEFECT.  THIS IS RIDICULOUS.  NO VEHICLE SHOULD EXPERIENCE FIREWALL DAMAGE AT ANY MILEAGE, LET ALONE A DEFECT SO DANGEROUS THAT IT IMPACTS SHIFTING AND BREAKING.  *TR",
        "vin": "JF1GE74638G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556444,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLUTCH STARTED SQUEAKING FOR A MONTH AND HALF.  WHEN THE SQUEAKING STOPPED, IT OCCURRED TO ME THAT THE SQUEAKING STOPPED ONLY BECAUSE THE WHOLE FIREWALL HAD BROKEN.  THE CAR IS SUPPOSED TO BE FIXED TOMORROW, AND I AM OUT OF WARRANTY FOR MY 2008 STI.  I AM WRITING TO YOU BECAUSE THIS IS A MAJOR SAFETY ISSUE, WHICH INCLUDES THE CLUTCH AND THE BRAKING AND THE TRANSMISSION.  THE SUBARU DEALERSHIP WILL NOT FIX IT FOR ME AND HAS REFERRED ME TO A COLLISION SHOP BUT I AM NOW BEING FORCED TO PAY FOR THESE REPAIRS OUT-OF-POCKET.    *TR",
        "vin": "JF1GR89618L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2013",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549642,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PEDAL STARTED SQUEAKING AND THOUGHT IT WAS PART IN NEED OF GREASE. SUBARU DEALERSHIP DID A 60K MAINTENANCE AND FOUND NO PROBLEMS. CLUTCH SUDDENLY WENT OUT (WITHIN A FEW MILES) AND PEDAL BECAME HARD TO USE. TOOK TO A VERY EXPERIENCED SUBARU MECHANIC WHO DIAGNOSED BROKEN FIREWALL WELDS. REPAIR WILL CONSTITUTE REMOVING THE ENTIRE DASH TO REWELD THE SPOTS. MECHANIC EXPLAINED TO ME THAT WITHOUT REPAIR, THE PEDAL COULD EXPERIENCE A CATASTROPHIC FAILURE DURING DRIVING AND COME LOOSE, POSSIBLY INTERFERING WITH THE BRAKE PEDAL. VERY SERIOUS SAFETY CONCERN. MANY OTHER OWNERS ARE REPORTING SIMILAR CONCERNS.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548717,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH AND BRAKE PEDAL BOTH MOVE LATERALLY AND ARE MAKING NOISE WHEN PRESSED.   RESEARCH HAS YIELDED THAT THIS IS A COMMON PROBLEM WITH 2008+ WRX.  THE ISSUE IS THE CLUTCH BRACKET SEPARATING FROM THE FIREWALL.  THERE ARE SPOT WELDS THAT HAVE FAILED, AND THE PART NEEDS TO BE REWELDED TO PREVENT THE MOVEMENT/NOISE.  *TR",
        "vin": "JF1GE75648G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548153,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIREWALL IS BREAKING AND/OR COMING APART.  THERE IS A DISTINCT KNOCKING OR CRACKING NOISE WHEN RELEASING THE CLUTCH.   *TR",
        "vin": "JF1GE74668G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2013",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546770,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2008 WRX WOULD MAKE A LOUD CREAKING NOISE EVERY TIME IT'S DEPRESSED. RECENTLY, THE CREAKING WENT AWAY, BUT IT BEGAN TO BECOME INCREASINGLY DIFFICULT TO GET INTO GEAR AND SHIFT GEARS. I INVESTIGATED THE NOISE AND NOTICED THAT THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY (ATTACHED TO THE FORWARD FIREWALL) SHIFTS APPROX. ONE HALF INCH EVERY TIME THE CLUTCH PEDAL IS DEPRESSED. I FOUND THAT THE THREE SPOT WELDS SECURING THE CLUTCH PEDAL BRACKET TO THE FORWARD FIREWALL WERE BROKEN. FROM THE OUTSIDE OF THE FIREWALL, JUST UNDER THE WINDSHIELD WIPERS, I SAW THE SPOT WELDS PULLING AWAY FROM THE FIREWALL EVERY TIME THE CLUTCH PEDAL WAS DEPRESSED. THIS ALLOWS THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY TO MOVE ALONG WITH THE FIREWALL. IF THE BRACKET COMPLETELY SEPARATES FROM THE FIREWALL, THE CLUTCH WILL BECOME COMPLETELY INOPERATIVE - ESPECIALLY DANGEROUS WHILE DRIVING. MY VEHICLE IS A 2008 WITH ONLY 70,000 MILES.   *TR",
        "vin": "JF1GD29605G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544409,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "METAL ON METAL POPPING STARTED FOR APPARENTLY NO REASON. INTERMITTENT, INCONSISTENT AND DIFFICULT TO REPLICATE. NOISE STOPPED AFTER WARMER WEATHER STARTED. NOTICEABLE CHANGES IN SHIFTING BEGIN TO OCCUR. APPROXIMATELY THREE MONTHS LATER, SHIFTING BEGINS TO BECOME DIFFICULT. SYNCHRONIZATION OF GEARS WHEN SHIFTING BEGINS TO FAULT AND GEAR SCRATCHING CAN BE HEARD. STILL INCONSISTENT, NO IMMEDIATE INDICATION REPAIRS ARE NEEDED. SEVERAL WEEKS GO BY AND SUDDENLY SHIFTING IS EXTREMELY DIFFICULT. GEAR MATCHING AND SYNCHRONIZATION IS NO LONGER SMOOTH AND SCRATCHES GEARS OFTEN. OFTEN NOT POSSIBLE TO SHIFT IN TO REVERSE WHILE CAR IS RUNNING. IT HAS NOW BEEN IDENTIFIED THAT THE SPOT WELDING THAT HOLDS THE CLUTCH PEDAL ASSEMBLY HAS BROKEN FREE FROM THE MOUNTING POINTS UNDER THE DASHBOARD. THE ENTIRE PEDAL ASSEMBLY NOW BENDS AND FLEXES PREVENTING PROPER CLUTCH PLAY AND THROW, PREVENTING CLUTCH FROM COMPLETELY DISENGAGING TRANSMISSION.  *TR",
        "vin": "JF1GE75678G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "08/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544122,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL AND CLUTCH IS NOT OPERATING PROPERLY WHEN DEPRESSED. THE PEDALS SHIFT WHEN THE CLUTCH PEDAL IS DEPRESSED AND MAKES A POPPING SOUND EVERY TIME THAT ORIGINATES FROM THE FIRE WALL / BULK HEAD.    MY CAR HAS BEEN REPAIRED ONCE BEFORE AT JUST UNDER 40,000MI AT A SUBARU DEALER AS AUTHORIZED BY SUBARU OF AMERICA AND KNOW IT HAS 100,000MI AND THE ISSUE HAS COME BACK.  THIS IS A STRUCTURAL FLAW THAT CAN AND WILL LEAD TO A ACCIDENT WITH THE 2008 AND NEWER SUBARU WRX'S IF IT IS NOT ADDRESSED AND FIXED BY SUBARU.  IF SUBARU IS NOT WILLING TO REPAIR THE BRACKET WELD ISSUE AND REPLACE THE CLUTCH DUE TO IMPROPER ENGAGEMENT I WILL LET THE WELDS FAIL AND ALLOW THE CLUTCH PEDAL AND BRAKE PEDAL FALL TO THE FLOOR BOARD AND TRY TO CONTROL THE CRASH AS BEST AS POSSIBLE.  THEN I WILL PROCEED TO FILE A LAW SUIT ON THE BASES THAT SUBARU KNOWS OF THE ISSUE AND MEANT TO CAUSE DUE HARM TO THE VEHICLE OPERATOR AND THE POPULATION OF AMERICA.  *TR",
        "vin": "JF1GE75608G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "08/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544112,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 SUBARU WRX. THE CONTACT STATED THAT WHILE DRIVING 10 MPH, THE CLUTCH PEDAL MADE A POPPING SOUND. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE IT WAS STATED THAT THE CLUTCH PEDAL BRACKET NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE PROBLEM PERSISTED. THE APPROXIMATE FAILURE MILEAGE WAS 102,000.",
        "vin": "JF1GE75608G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538638,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING THE CAR FOR A FEW WEEKS I NOTICED THE CLUTCH PEDAL STARTED MAKING NOISES. I INVESTIGATED AND FOUND THAT THE CLUTCH MASTER CYLINDER WAS MOVING A LOT FOR A PART THAT SHOULD  NOT MOVE. I DID A LITTLE RESEARCH ONLINE AND ON FORUMS AND FOUND THAT MANY OTHER OWNERS OF THE VEHICLE HAD SIMILAR PROBLEMS. THE WELDS ON THE FIREWALL HAVE CRACKED. IT CAUSE MY BRAKE PEDAL TO SHIFT WHENEVER I DEPRESS THE CLUTCH PEDAL. IT ALSO HAS GOTTEN SO BAD THAT SHIFTING INTO GEAR AT ANY SPEED OVER THE 3400 RPM RANGE BECOMES VERY DIFFICULT AND IN SOME CASE IMPOSSIBLE! I DRIVE TO AND FROM WORK 60 MILES A DAY 5 DAYS A WEEK AND HAVE NOT MODIFIED THE CAR IN ANY WAY SINCE I PURCHASED THE VEHICLE. THE WINTER SEASON IS COMING UP AND THIS WILL BE MY FIRST WINTER WITH THE CAR. I WOULD HOPE THE COLD WEATHER DOES NOT MAKE THE SITUATION WORSE BUT IS HIGHLY LIKELY! THIS ISSUE HAS CAUSED STOPPING AND SHIFTING PROBLEMS. I WOULD NOT LIKE THIS ISSUE TO CAUSE A POSSIBILITY THAT SOMETHING CAN GO WRONG DURING THIS UPCOMING WINTER TO MAKE MY CAR FAIL DRASTICALLY IN PERFORMANCE AND LAND ME IN A HOSPITAL OR WORSE. PLEASE I ADVISE YOU TO ADDRESS THIS ISSUE AS MANY OTHER OWNERS OF THIS VEHICLE ARE HAVING THE SAME PROBLEMS. OTHERS HAVE ATTEMPTED TO RE WELD BUT FOUND THAT IT IS COSTLY AND ONLY A TEMPORARY FIX UNTIL IT BREAKS AGAIN. *JB",
        "vin": "JF1GH756X8G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2013",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538260,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AGO I STARTED HEARING A CREAKING NOISE. ONLY RECENTLY THE NOISE HAD GOTTEN WORSE SO BEING A MECHANIC MYSELF I DECIDED I WOULD TAKE A FEW DAYS AND REMOVE MY DASH BOARD TO PINPOINT THE NOISE SINCE IT HAD GOTTEN WORSE LATELY. AFTER REMOVING THE DASH I COULD CLEARLY SEE THAT THE PEDAL ASSEMBLY WAS BOLTED TO A THIN BRACKET THAT WAS WELDED TO THE MAIN BODY FRAME. WHEN I REMOVED THE PEDALS THE BRACKET JUST FELL RIGHT OUT. NO WELD WAS HOLDING MY CLUTCH AND BRAKE PEDAL. I WAS AMAZED THAT THE ASSEMBLY NEVER FELL OFF WHILE I WAS DRIVING IT FOR A YEAR. MIND YOU THE CLUTCH WAS ORIGINAL AND MODIFICATIONS WAS A SIMPLE AIR CLEANER. I DECIDED TO RESCUER IT TO THE FRAME WITH MACHINE NUTS AND BOLTS. AFTER I ASSEMBLED IT THERE WAS STILL PLAY IN THE PEDAL ASSEMBLY AND ONLY A FEW WEEKS LATER THE NOISE HAD RETURNED. I GUESS THE BRACKET NEEDS TO BE SECURED BETTER BUT THIS IS WHY I'M CONCERNED. ONE THE NOISE IS UNBEARABLE AND TWO IT'S JUST NOT SAFE IT COULD BRAKE OFF AGAIN THE MOVE THE BRAKE PEDAL ENOUGH TO CAUSE SOMEONE TO MISS THE PEDAL AND ACCELERATE INTO AN ACCIDENT.  *JS",
        "vin": "JF1GE74688G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2013",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533427,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING IN TRAFFIC WHEN I PUSHED DOWN ON CLUTCH PEDAL AND REALIZED I HAD NO CLUTCH.  I HAD TO REV CAR TO 2,500 RPM TO PUT IN GEAR TO DRIVE.  THEN EVERY TIME I CAME TO A STOP THE CAR FELT WIRED TO STOP. AS I LOOKED BY MY FEET I NOTICED MY CLUTCH AND BRAKE PEDAL WAS MOVING QUITE FREELY TO SIDE TO SIDE. IT WAS TO LATE IN DAY TO TAKE CAR TO DEALER AND BEING A MECHANIC I CHECKED CAR OUT MYSELF.  THAT'S WHEN I SAW THAT THE BRACKET THAT IS WELDED TO MY FIREWALL BROKE COMPLETELY OFF.  AFTER DEALING WITH SUBARU AND THE DEALER FOR A WEEK NOW I HAVE TO PAY $500 TO HAVE THEM FIX THE CAR AS A COURTESY THEY SAID. THERE ARE HUNDREDS OF COMPLAINTS OF THIS ISSUE AND WHAT IF I WAS ON THE HIGHWAY AND HAD TO STOP SUDDENLY WHEN THIS HAPPENED. I COULD HAVE CAUSED A MAJOR ACCIDENT.  WHY DO I HAVE TO PAY TO FIX THE FLAW IN THE STRUCTURAL INTEGRITY OF MY VEHICLE THAT CAN CAUSE AN ACCIDENT!  *TR",
        "vin": "JF1GH75618G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2013",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10506080,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLUTCH PEDAL HAS BEEN CLICKING AT THE EXTENT OF DEPRESSING THE PEDAL SINCE I BOUGHT THE CAR FROM A SUBARU DEALERSHIP TWO YEARS AGO.  I DIDN'T THINK MUCH OF IT BECAUSE OF HOW REGULARLY IT HAPPENED.  ABOUT A MONTH AGO, IT STARTED TO GET LOUDER AND ALSO BEGAN SQUEAKING.  I TOOK IT TO A NEARBY DEALERSHIP AND THEY INFORMED ME IT WAS PROBABLY A CRACKED WELD ON THE FIREWALL, WHICH THEY HAD SEEN BEFORE.  MY CAR IS JUST OUT OF WARRANTY, BUT THEY WOULD NOT FIX THE PROBLEM EVEN THOUGH IT HAD BEEN HAPPENING LONG BEFORE THE WARRANTY EXPIRED.  THE DEALERSHIP QUOTED ME $1,200 - $1,500, WHICH IS OUTRAGEOUS FOR SOMETHING THAT IS APPARENTLY A KNOWN ISSUE WITH THIS MODEL SUBARU.  I LEARNED THAT THIS IS A WELL DOCUMENTED ISSUE AND I AM GOING TO TAKE MY CASE UP WITH SUBARU.  *TR",
        "vin": "JF1GH74638G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507124,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM STARTED WITH A SQUEAKING/CLICKING WHEN THE CLUTCH WAS DEPRESSED. RECENTLY THE WHOLE CLUTCH/BRAKE ASSEMBLY SHIFTS DOWN AND TO THE LEFT ABOUT 1/4-1/2\" WHEN THE CLUTCH IS DEPRESSED. LOOKING UP THE PROBLEM, I SEE I HAVE THE SAME ISSUE AS MANY OWNERS, THE WELDS THAT HOLD THE ASSEMBLY TO THE FIREWALL HAVE BROKEN FREE. NOW IT IS DIFFICULT TO SHIFT AT TIMES.  *TR",
        "vin": "JF1GE75698G"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2013",
        "dateOfIncident": "10/29/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10506093,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL ON MY 2008 IMPREZA WRX FEELS GRITTY AND MAKES A LOUD CREAKING NOISE EVERY TIME IT'S DEPRESSED. WHEN I INVESTIGATED THE NOISE, I NOTICED THAT THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY (ATTACHED TO THE FORWARD FIREWALL) SHIFTS APPROX 1/4 INCH EVERY TIME THE CLUTCH PEDAL IS DEPRESSED. I FOUND THAT THE THREE SPOT WELDS SECURING THE CLUTCH PEDAL BRACKET TO THE FORWARD FIREWALL WERE BROKEN. FROM THE OUTSIDE OF THE FIREWALL, JUST UNDER THE WINDSHIELD WIPERS, I SAW THE SPOT WELDS PULLING AWAY FROM THE FIREWALL EVERY TIME THE CLUTCH PEDAL WAS DEPRESSED. THIS ALLOWS THE ENTIRE CLUTCH PEDAL BRACKET ASSEMBLY TO MOVE, CAUSING THE CREAKING NOISE. IF THE BRACKET COMPLETELY SEPARATES FROM THE FIREWALL, THE CLUTCH MAY BECOME COMPLETELY INOPERATIVE - ESPECIALLY DANGEROUS WHILE DRIVING.",
        "vin": "JF1GE746X8G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2013",
        "dateOfIncident": "09/03/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500890,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WELDS HOLDING PEDAL ASSEMBLY TO FIREWALL ARE BROKEN, SQUEAKING CLUTCH, VERY HARD TO GET INTO GEAR, BREAK PEDAL MOVING WHEN USING CLUTCH.  *TR",
        "vin": "JF1GH75688G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "02/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496665,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST MONTH OR SO I HAD SMELLED GAS FUMES PERIODICALLY WHEN THE MY CAR WAS IDLING.  A FEW DAYS AGO THE CAR WENT INTO LIMP MODE.  I HAD THE ECU CODE READ AT A LOCAL STORE AND THE TECHNICIAN THERE STATED THAT THE ENGINE CODE WAS \"P0171 SYSTEM TOO LEAN (BANK 1)\".  ON MONDAY I TOOK THE CAR TO THE LOCAL DEALER.  THEIR DIAGNOSIS WAS THAT THE FUEL LINE WAS DETERIORATING AND NEEDED REPLACEMENT. THEY ALSO INDICATED THAT THE FUEL LINE WAS LEAKING.      THEIR EXPLANATION FOR THE ENGINE CODE WAS THAT WHILE THE CAR WAS RUNNING THE FUEL PRESSURE EXPANDED THE FUEL LINE.  THIS EXPANSION EVENTUALLY REDUCED THE FUEL PRESSURE TO THE POINT THAT THE FUEL INJECTORS WERE NOT RECEIVING ADEQUATE FUEL AND THE ECU THREW A CODE.  WHILE I DO NOT KNOW WHY THE FUEL LINE DEGRADED, AND THERE COULD BE A NUMBER OF CAUSES, IT DOES SEEM PREMATURE.  *TR",
        "vin": "JF1GH75698G"
    }
]