[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122017,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE WIDOW FOGGED BETWEEN THE PANES OF GLASS. THIS SEVERELY LIMITS THE DRIVERS ABILITY TO SEE CROSS TRAFFIC, OR VEHICLES ALONG SIDE.",
        "vin": "4UZAB2BS98C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451138,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE FOUND CRACKS AND/OR FRACTURES ON THE ROOF OF OUR 2008 TIFFIN PHAETON QSH MOTOR HOME.  THESE CRACKS ARE MOSTLY ALONG THE CURVED EDGE OF THE FIBERGLASS ROOF.  THIS DEFECT SEEMS TO BE CAUSED BY POOR QUALITY MATERIALS AND POOR DESIGN BY TIFFIN MOTOR HOMES LEADING TO CRACKS DUE TO \"FLEXING\" OF THE VEHICLE STRUCTURAL FRAME DURING TRAVEL.  THIS VEHICLE DEFECT HAS BEEN WIDELY REPORTED TO TIFFIN BY MANY OWNERS OF THEIR PRODUCTS BEGINNING IN 2007 (AND PERHAPS BEFORE) THROUGH 2011 MODELS BASED ON INFORMATION FROM DEALERS AND OTHER MOTOR HOME OWNERS.  THESE CRACKS LEAD TO MOISTURE SEEPING THROUGH TO INTERIOR WALLS AND COULD CREATE AN ENVIRONMENTAL ISSUE DUE TO MOLD WITHIN THE INSIDE OF THE VEHICLE BEHIND THE INTERIOR WALLS.  TIFFIN MOTOR HOMES HAS NOT NOTIFIED ANY VEHICLE OWNERS OF THIS DEFECT; THEREFORE, CAUSING MANY OF THESE VEHICLES TO BE SOLD BY CURRENT OWNERS TO OTHER CONSUMERS THAT ARE NOT AWARE OF THE DEFECT AND POTENTIAL MOLD ISSUES.  IT HAS BEEN REPORTED THAT TIFFIN IS \"REPAIRING\" THIS DEFECT THAT INVOLVES MOST ALL OF THEIR DIESEL PUSHER MODELS, BUT ONLY IF THE OWNER BRINGS THE RV TO THEIR RED BAY, AL, SERVICE FACILITY, WITH SERVICE APPOINTMENTS SEVERAL MONTHS OUT AT THIS TIME.  THIS PUTS UNDUE HARDSHIP AND EXPENSE ON MOST OWNERS AND WILL, MOST LIKELY, LEAD TO A LOW RATE OF REPAIR OF THIS DEFECT ON MANY VEHICLES.  TIFFIN MOTOR HOMES SHOULD BE REQUIRED TO ACKNOWLEDGE AND REPORT THIS STRUCTURAL DEFECT TO ALL CURRENT OWNERS OF MODELS IMPACTED AND PROVIDE QUALIFIED SERVICE FACILITIES NATIONWIDE TO REPAIR THIS DEFECT, INCLUDING CERTIFIED MOLD REMEDIATION.  TIFFIN SHOULD ALSO BE REQUIRED TO REPORT HOW THIS MAJOR STRUCTURAL DEFECT HAS BEEN CORRECTED, IF IT HAS ACTUALLY BEEN CORRECTED, BY ENGINEERING AND DESIGN CHANGES IN CURRENT MODEL YEAR VEHICLES.  *TR",
        "vin": "4UZAB2BS88C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/09/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451009,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WET BAY FLOOR HOLDING THE FRESH WATER, GRAY WATER, AND BLACK WATER TANKS HAS ROTTED UNDERNEATH THE MOTORCOACH DUE TO THE POOR DESIGN/ENGINEERING BY TIFFIN MOTOR HOMES, AS WELL AS VERY POOR QUALITY MATERIALS USED. THERE IS VERY LITTLE STRUCTURAL SUPPORT FOR THE TANKS UNDERNEATH THE VEHICLE.  ALL OF THE TANKS AND WET BAY AREA HAVE TO BE REMOVED IN ORDER TO EVALUATE THE FULL EXTENT OF THE ROTTING AND MOLD IN THIS AREA.  THE INTERIOR FLOOR OF THE MOTOR HOME HAS ALSO BEGUN TO DROP LIKELY DUE TO THIS ROTTING. TIFFIN MOTOR HOMES IS FULLY AWARE OF THIS MAJOR DEFECT IN VEHICLES DATING BACK TO 2006 OR BEFORE ON MOST DIESEL PUSHER MODELS INVOLVING HUNDREDS TO SEVERAL THOUSAND VEHICLES.  BASED ON REPORTS FROM OTHER TIFFIN OWNERS THERE HAS BEEN MINIMAL OR NO ENGINEERING OR MATERIAL CHANGES MADE TO SUBSEQUENT MODEL YEARS.  THE COMPANY IS \"REPLACING OR REPAIRING\" THIS MAJOR DEFECT, BUT ONLY IF THE MOTOR HOME IS BROUGHT TO THEIR RED BAY, AL, SERVICE FACILITY AND SERVICE APPOINTMENTS ARE CURRENTLY 12 TO 18 MONTHS OUT.  THIS REQUIRES AN ALMOST 2000 MILE DRIVE FOR US TO HAVE A MAJOR SAFETY DEFECT REPAIRED. BUT WE MUST GET TO THE REPAIR FACILITY WITHOUT OUR TANKS FALLING OFF THE MOTOR HOME ONTO THE ROADWAY CAUSING A VERY SERIOUS SAFETY PROBLEM FOR US AND OTHER DRIVERS AS WELL AS A POTENTIAL ENVIRONMENTAL ISSUE BECAUSE THESE TANKS ARE HOLDING TANKS FOR SEWAGE AND HAVE BEEN TREATED WITH CHEMICALS.  OTHER OWNERS HAVE REPORTED HAVING TO WELD ADDITIONAL SUPPORT BEAMS UNDER THEIR RV THEMSELVES IN ORDER TO DRIVE AND GET IT IN FOR REPAIR.  A ROTTING UNDERCARRIAGE OF AN RV IS DANGEROUS ON HIGHWAYS AND TIFFIN SHOULD BE REQUIRED TO REPAIR THIS PROBLEM IMMEDIATELY, AT QUALIFIED SERVICE FACILITIES THROUGHOUT THE COUNTRY, AT THEIR COST.  THERE SHOULD BE A FULL INVESTIGATION INTO WHY TIFFIN HAS KNOWINGLY FAILED TO CORRECT THIS DEFECT FOR YEARS CREATING SAFETY ISSUES AND EXPENSE FOR OWNERS. *TR",
        "vin": "4UZAB2BS88C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/02/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368696,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 TIFFIN PHAETON 40 QS8 RV. THE CONTACT STATED THAT HE RECEIVED NOTIFICATION OF A RECALL FOR HIS NORCOLD 1210 REFRIGERATOR STATING THAT THE FAILURE COULD POTENTIALLY CAUSE A FIRE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR THE REPAIR, BUT THE CONTACT WAS INFORMED THAT THERE WOULD BE A 2 TO 3 WEEK WAIT FOR THE PART TO BECOME AVAILABLE.  THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE CURRENT AND FAILURE MILEAGE WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235343,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK DELIVERY ON A TIFFIN PHAETON 2008 MOTORHOME (VIN LAST DIGITS 8CZ81559)NOV. 9, 2007.  WE FIRST DROVE IT ON THE ROAD NOV. 23, 2007 AND WITHIN 30 MILES HAD OVERHEATING, LOW COOLANT, ENGINE SHUTDOWN PROBLEMS.  FREIGHTLINER SAID TO KEEP DRIVING AS LONG AS IT WOULD GO.  WE HAD MULTIPLE INCIDENTS WITH THE SAME PROBLEM AND KEPT GETTING THE SAME ANSWERS.  ON JUNE 25, 2008, WE COASTED TO THE SIDE OF A BUSY FOUR LANE 50 MILES SOUTH OF KANSAS CITY AND HAD TO BE TOWED TO  CUMMINS SINCE FREIGHTLINER HAD 6 TECH'S OFF TO SCHOOL.  WHEN DIAGNOSING THE PROBLEM, CUMMINS SAID FREIGHTLINER HAD A FIELD SAFETY CAMPAIGN 388A-F ISSUE AND THE PROBLEM DESCRIBED HAD OCCURRED.  THE HORTON FAN, FAN HUB, BELTS, WIRING, CAC, ETC. HAD ALL BEEN TORN OFF WITH THE SHEAR OF THE FAN BOLT AND WOBBLE AND FINAL BREAKAGE.  IT TOOK 6 DAYS TO GET PARTS AND FIX.  WE LEFT JULY 1ST AND MADE IT AS FAR AS DENVER WHEN ON JULY 4TH, IT OCCURRED AGAIN.  DENVER FREIGHTLINER SAID IT WAS THE SAME PROBLEM AND ALL NEW PARTS HAD TO BE ORDERED AND REPLACED.  IT TOOK 7 DAYS THIS TIME.  WE HAD NO NOTICE TO THE RECALL AND HAD TO LOSE TIME AND MONEY TWICE WITHIN TWO WEEKS.  *TR",
        "vin": ""
    }
]