[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "08/28/2013",
        "fire": false,
        "manufacturer": "Thor California, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544245,
        "products": [
            {
                "manufacturer": "Thor California, Inc.",
                "productMake": "THOR CALIFORNIA",
                "productModel": "JAZZ",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Greenball Corporation",
                "productMake": "GREENBALL",
                "productModel": "TOW MASTER",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "WHILE TRAVELING WEST ON I70 NEAR COLUMBIA, MO. THE RIGHT REAR TIRE ON THE TRAVEL TRAILER BLEW OUT. WE PURCHASED A NEW TIRE IN COLUMBIA SO AS NOT TO BE WITHOUT A SPARE. GOOD THING! BACK ON I70 AND LESS THAN AN HOUR LATER THE LEFT FRONT TIRE ON THE TRAILER BLEW. OF COURSE THERE WAS DAMAGE TO THE TRAILER BOTH TIMES. YOU CAN'T BLOW A TIRE ON A TRAVEL TRAILER, WITH TOTAL TREAD SEPARATION, AND NOT HAVE DAMAGE.   BOTH TIRES HAVE BEEN SENT BACK TO GREENBALL AND THEY HAVE AGREED TO PAY FOR ALL DAMAGES.  THESE TIRES WERE ONLY ONE YEAR OLD WITH MFG. DATES OF 2812 AND 2712. THEY HAD APPROX. 7600 MILES ON THEM WITH NO ADVERSE WEAR PATTERNS. THE PRESSURES HAD BEEN CHECKED THE DAY BEFORE AND SET TO 80 PSI AS I ALWAYS SET THEM. THE TRAILER HAD ACTUALLY BEEN ALIGNED  BEFORE THE TIRES WERE PUCHASED. EVERYTHING WAS DONE PROPERLY EXCEPT FOR BUYING TIRES MADE IN CHINA!",
        "vin": "4XTTS28288C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "05/31/2008",
        "fire": false,
        "manufacturer": "Thor California, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229952,
        "products": [
            {
                "manufacturer": "Thor California, Inc.",
                "productMake": "THOR CALIFORNIA",
                "productModel": "JAZZ",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 THOR CALIFORNIA JAZZ .  THE CONTACT NOTICED THAT THE SPRING HANGER CAME OFF OF THE FRONT RAIL.  AS A RESULT, ALL OF THE TIRES, EXCLUDING THE REAR DRIVER SIDE TIRE, FAILED.  HE TOOK THE VEHICLE TO A SERVICE CENTER AND THEY WELDED THE SPRING HANGER IN PLACE AND REPLACED THE THREE TIRES.  THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE.  THE FAILURE AND CURRENT MILEAGES WERE NOT APPLICABLE.  UPDATED 10/16/08.  *LJ  THE MECHANIC STATED THE SPRING HANGAER ON THE RIGHT SIDE OF THE TRAILED WAS NOT ATTACHED. IT WAS SITTING ON TOP OF THE RIGHT FRAME RAIL. THE CONSUMER WAS TOLD THE SPRING HANGER HAD NEVER BEEN WELDED IN PLACE PROPERLY. IT HAD ONLY BEEN TACK-WELDED.  UPDATED 10/20/08. *JB",
        "vin": "4XTFS29258C"
    }
]