[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "06/04/2007",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223241,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO BUS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD WIPERS WILL FAIL ON A 2008 ALLEGRO BUS RV MADE BY TIFFIN WITHIN A FEW MINUTES OF OPERATION. THE BRACKETS INSIDE BREAK OFF AND THE WIPERS FALL DOWN. ON JUNE 4, 2007, I PURCHASED FROM AN RV DEALERSHIP IN KINGSTON, NEW YORK A NEW 2008 ALLEGRO BUS MADE BY TIFFIN. WHILE TEST DRIVING THE NEW RV THAT DAY, THE WINDSHIELD WIPERS FAILED AND STOPPED WORKING. THEY WERE REPAIRED AT THE DEALERSHIP THAT SAME DAY. ONLY 8 HOURS LATER ON THE MORNING OF JUNE 5, 2007, I LEFT NEW YORK FOR HOME IN OHIO WITH THE NEW RV PURCHASED THE PREVIOUS DAY. DURING THE TRIP HOME, RAIN STARTED. THE WINDSHIELD WIPERS RAN ABOUT 7 MINUTES AND THE SAME THING HAPPENED. TIFFIN PICKED UP THE RV IN OHIO AND TOOK TO THEIR FACTORY IN ALABAMA TO REPAIR THE WINDSHIELD WIPERS, ALONG WITH OTHER DEFECTS, AND RETURNED IT BACK TO ME IN OHIO. THE TIFFIN DRIVER SAID HE HAD SEVERAL FAIL. AFTER THE RV WAS RETURNED TO ME, THE WINDSHIELD WIPERS RAN ABOUT 20 MINUTES BEFORE BREAKING AGAIN AND STILL DO NOT WORK.  *TR",
        "vin": "4VZBT1D997C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "06/05/2007",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223249,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO BUS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW DRIVER'S SIDE MIRROR ON A 2008 ALLEGRO BUS RV MADE BY TIFFIN IS MOUNTED IN A MANNER/LOCATION THAT CAUSES A VERY LARGE BLIND SPOT MAKING IT UNSAFE TO MAKE A LEFT TURN.  ON JUNE 4, 2007, I PURCHASED FROM AN RV DEALERSHIP IN KINGSTON, NEW YORK A NEW 2008 ALLEGRO BUS MADE BY TIFFIN. ON JUNE 5, 2007, I LEFT NEW YORK FOR HOME IN OHIO WITH THE NEW RV PURCHASED THE PREVIOUS DAY. DURING THE TRIP HOME, I REALIZED THE PROBLEM WITH THE MIRROR AND THE BLIND SPOT. TIFFIN PICKED UP THE RV IN OHIO AND TOOK TO THEIR FACTORY IN ALABAMA TO MOVE THE MIRROR, AND TO REPAIR OTHER DEFECTS WITH THE RV, AND RETURNED IT BACK TO ME IN OHIO. TIFFIN NEVER MOVED THE MIRROR WHICH STILL CAUSES A VERY LARGE BLIND SPOT MAKING IT UNSAFE TO MAKE A LEFT TURN. NEW RV'S FROM TIFFIN ARE STILL LIKE THIS EVEN THOUGH TIFFIN IS WELL AWARE OF THE PROBLEM FROM ME AND OTHER CUSTOMERS.  *TR",
        "vin": "4VZBT1D997C"
    }
]