[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2010",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Tracker Marine, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343867,
        "products": [
            {
                "manufacturer": "Tracker Marine, LLC",
                "productMake": "TRAILSTAR",
                "productModel": "P27",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/25/2008 ,WE PURCHASED  A NEW 2008 SUN TRACKER PONTOON AND A NEW 2008 TRAILSTAR BOAT TRAILER FROM A DEALERSHIP IN NORTH CAROLINA. WITHIN THE FIRST MONTH OF USING THE BOAT/TRAILER WE NOTICED THAT THE BOAT TRAILER TIRES WERE SHOWING EXCESSIVE WEAR AND WE NOTIFIED THE DEALER, WHO SENT  NEW TIRES FOR THE TRAILER, IN CASE WE HAD A BAD SET OF TIRES.  WE SHOULD TRY THESE TIRES AND WOULD \" SEE\" IF THIS FIXED THE ISSUE.  THIS DID NOT FIX THE ISSUE, THE SECOND SET OF TIRES SHOWED EXCESSIVE WEAR OVER THE BALANCE OF THE FIRST SUMMER'S USE.  WE CONTACTED THE DEALERSHIP AGAIN AND INSISTED THAT THEY CHECKOUT TRAILER, AXLE AND ANY OTHER POSSIBLE FACTOR THAT WOULD MAKE THE TIRES WEAR SO QUICKLY AND UN-EVENLY.  THEY RE-PLACED THE TIRES AGAIN ON TRAILER, SO THAT WE COULD CONTINUE USING DURING THE SUMMER.  MY HUSBAND CONSISTENTLY INSISTED THAT THE DEALERSHIP HAD SOLD US A TRAILER THAT WAS NOT RATED FOR OUR SIZE BOAT, THEY INSIST THAT IT WAS.. THE TIRES AGAIN WORE EXCESSIVELY IN LESS THAN 3 MONTHS USE, MY HUSBAND TOOK IT BACK TO THE DEALERSHIP AND INSISTED THAT THEY CHECKOUT THE TRAILER FOR ANY AND ALL DEFECTIVE ISSUES AND REPLACE OR REPAIR IMMEDIATELY.  THEY DECIDED THAT THE TRAILER AXLE WAS DEFECTIVE AND NEEDED A NEW AXLE.  THEY REPLACED THE AXLE AND PUT ON NEW TIRES.  WE WINTERED THE BOAT OVER 2009-2010 WINTER AND PULLED IT OUT FOR USE IN LATE MAY...THE TIRES ARE WEARING EXCESSIVELY AGAIN, AND IN FURTHER RESEARCH WE SEE THAT THE MFG. HAS BEEN CITED FOR PLACING THE INCORRECT CAPACITY STICKERS ON THEIR TRAILERS.  ALSO, WE SEE THAT OUR PAPERWORK FROM THE DEALER SHOWS THAT WE PURCHASED A 2008 TRAILER, BUT THE TRAILER PLATE SAYS THAT THE TRAILER WAS MANUFACTURED IN 2007.  AT THIS POINT I DON'T TRUST ANY OF THE DEALER/ MFGR DECISIONS THAT HAVE BEEN MADE SO FAR.  AND AM DISGUSTED BY THE FRESH HELL THAT IS IN STORE FOR US ..CALLING TRACKER MARINE GROUP FOR ROUND 4 DISCUSSIONS.  ISN'T THERE ANYONE WHO CAN HELP US?????  I HAVE PICTURES. EMAILS, OLD TIRES, ETC. *TR",
        "vin": "4TM13LJ1X8B"
    }
]