[
    {
        "components": "SUSPENSION,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/04/2017",
        "dateOfIncident": "09/03/2017",
        "fire": false,
        "manufacturer": "Tracker Marine, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021324,
        "products": [
            {
                "manufacturer": "Tracker Marine, LLC",
                "productMake": "TRAILSTAR",
                "productModel": "K21VTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS A PASSENGER ON THE SANTA CLARA VALLEY TRANSPORTATION BUS NO 2202 AT 6:00 AM. I HAVE PERSONALLY EXPERIENCED THE REPEAT FAILURE OF THE BUSINESS SEAT BELTS FOR THE HANDICAP.THAT COME UNLOCKED IF THE BUS SWAYS OR COMES TO A SUDDEN STOP. THESE THINGS CAN'T EVEN SUPPORT A SUITCASE THEY DON'T WORK ON PEOPLE EITHER. THEY JUST POP A LOOSE! MAYBE THIS WILL EXPLAIN THE RASH OF PATRONS DEATHS ON THIS BUS LINE BECAUSE THE DRIVER'S ARE DO CHILDLESS AND RECKLESS THEY ARE ALWAYS TRYING TO SPEED INTO YOUR NEWS AND MAKE SUDDEN STOPS THAT JERK YOU OUT IF YOUR SEAT.  PEOPLE AREN'T SAFE ON THIS BUS CO. THE PUBLIC BODY COUNT US RISING 10 FOLD. THERE TAKING ONE OF US EVERY WEEK! YOUR HELP IS DE PARATELY NEEDED!",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "05/02/2010",
        "fire": false,
        "manufacturer": "Tracker Marine, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328910,
        "products": [
            {
                "manufacturer": "Tracker Marine, LLC",
                "productMake": "TRAILSTAR",
                "productModel": "K21VTA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "IN DECEMBER OF 2009, I BOUGHT A TRAILSTAR TANDEM TRAILER (SERIAL NUMBER [XXX] ) TO TOW A 2009, MAKO 2101 BOAT FROM BASS PRO OUTLET CENTER, LOCATED AT 5250 N. LOOP 1604 E, SAN ANTONIO, TEXAS 78247 .  THE TRAILER WAS MANUFACTURED IN NOVEMBER 2008 BY TRACKER MARINE GROUP, 2500 E. KEARNEY, SPRINGFIELD, MO.      ON 02 MAY, 2010, I TOWED THE BOAT AND TRAILER FOR 150 MILES.  DURING THE TRIP, I FELT THE TRAILER JERK TO THE RIGHT SEVERAL TIMES.  DURING AN INSPECTION I FOUND THAT THE RIGHT FRONT TIRE WAS SEVERELY WORN ON THE OUTSIDE EDGES AND HAD SEVERAL BALD SPOTS WHERE THE TIRE HAD SKIDDED.  WHEN CHANGING THE TIRE I DISCOVERED THAT THE RIGHT FRONT TIRE WAS THE WRONG SIZE (TRAIL AMERICA ST205/75D14) FOR THE TRAILER. THE CORRECT TIRE SIZE FOR THE TRAILER IS ST215/75R14C. THE RIGHT FRONT TIRE WAS SMALLER THAN THE OTHER THREE TIRES CAUSING IT TO LEAVE THE SURFACE OF THE ROAD DURING TOWING AND SPIN IN THE AIR UNTIL IT TOUCHED THE ROAD AGAIN WHERE IT WOULD JERK TO THE RIGHT WHILE THE TIRE TRIED TO CATCH UP WITH THE TRAILER.  THIS WAS AN EXTREMELY DANGEROUS CONDITION THAT COULD HAVE RESULTED IN A CATASTROPHIC FAILURE THAT ENDANGERED THE LIVES OF ME, MY FAMILY AND OTHER MOTORISTS.     ON 03 MAY 2010, I TOOK THE TRAILER TO MY DEALER AND SPOKE TO THE GENERAL MANAGER.  HE INFORMED ME THAT THE TIRES WERE INSTALLED ON THIS TRAILER AT THE FACTORY.  HE AGREED THAT THE TIRE WAS THE WRONG SIZE AND WAS A SAFETY HAZARD.  HE AGREED TO REPLACE THE TIRE WITH THE PROPER SIZE AND TO REPLACE THE RIGHT FRONT WHEEL BEARINGS.    MY CONCERN IS THAT OTHER BOAT TRAILERS BEING MANUFACTURED BY TRACKER MARINE MIGHT HAVE THE SAME PROBLEM.  I BELIEVE THAT BOAT TRAILERS MANUFACTURED BY TRACKER MARINE NEED TO BE INSPECTED TO INSURE THAT THE PROPER SIZE TIRES ARE INSTALLED.  THIS INSPECTION WOULD ONLY TAKE A FEW MINUTES AND COULD POSSIBLY SAVE SOMEONE'S LIFE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "4TM1ADJ269B"
    }
]