[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "01/06/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679874,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY SMALL FOOT ROOM ON DRIVER SIDE. SHOE TRAPS UNDER BRAKE PEDAL SOMETIME, MAKE SOME DELAY OF USING BRAKE.   *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "03/27/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575267,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT SPRING BROKE WHILE ENTERING VEHICLE (PARKED OVERNIGHT IN GARAGE).  EVIDENCE OF ANTI-CORROSION PAINT FLAKING OFF OF SPRING IN THE AREA THAT THE BREAK OCCURRED.  THIS IS THE SECOND BROKEN FRONT SPRING ON THE SAME VEHICLE, THE PREVIOUS ONE HAPPENED ~ 1 YEAR AGO (ODI# 10502668.).  POTENTIALLY A DEFECT IN THE COATING PROCESS ALLOWING THE COATING TO CRACK AND LET CORROSION HAPPEN ON THE SURFACE OF THE SPRING.  *TR",
        "vin": "YV1MK672482"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550779,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL TRAP BROKEN.  WAS TOLD BY MY MECHANIC THERE WAS A VOLVO RECALL FOR THIS PROBLEM (DEALERSHIP RECALL # 202).  VOLVO DEALERSHIP SAID MY MAKE AND MODEL WAS NOT INCLUDED IN THE RECALL.  I BELIEVE IT WAS AN OVERSITE, AS MY VEHICLE WAS MANUFACTURED IN THE SAME COUNTRY AS THE OTHER VOLVO MAKE AND MODELS INCLUDED IN THE RECALL.  THIS 2008 C30 IS THE FIRST  MODEL OF THIS TYPE.  IT SHOULD HAVE BEEN INCLUDED IN THE RECALL AND WAS NOT.  PLEASE INVESTIGATE. I'VE PAID $550 TO REPAIR DUE TO POOR MANUFACTURING.    PLEASE REVIEW AND CONTACT VOLVO REGARDING THIS.  HOPEFULLY OTHER'S WITH THE SAME MAKE AND MODEL HAVE FILED A COMPLAINT FOR A STRONGER CASE.  I WANT MY MONEY BACK.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522979,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEATBELT DIFFICULT TO UNBUCKLE. TOOK TO VOLVO DEALERSHIP TO HAVE SERVICED ON 7/1/13. DEALERSHIP REPORTED \"FOUND A LITTLE STICKY. LUBED IT. NOW OPENS TO INTENT. IT DOES HELP TO PRESS DOWN ON THE BUCKLE BEFORE YOU RELEASE THE LATCH.\" THE LUBE DID NOT FIX THE BUCKLE. STILL DIFFICULT TO RELEASE. SAFETY CONCERN FOR EMERGENCY EXIT OF CAR.  *TR",
        "vin": "YV1MK672982"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/13/2013",
        "dateOfIncident": "03/12/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502668,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT SPRING BROKE, FRACTURE HAPPENED IN THE TRANSITION FROM THE LOWEST COIL (THE ONE ALWAYS ON THE SPRING SEAT) TO THE FIRST ACTIVE COIL.  ANTI-CORROSION COATING WAS MISSING IN THAT AREA, AND A SMALL AMOUNT OF SURFACE PITTING WAS PRESENT.      PHOTOS OF FAILED SPRING ARE AVAILABLE UPON REQUEST (BOTH IN PLACE BEFORE REMOVAL, AND CLOSEUP VIEW OF THE FRACTURE ON THE COIL THAT BROKE OFF).  *TR",
        "vin": "YV1MK672482"
    },
    {
        "components": "VISIBILITY,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/20/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448558,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER'S SEAT HEADREST ENGAGED VISOR IN STOWED POSITION WHEN SEAT PUSHED FORWARD TO ENTER REAR SEAT.  THIS CAUSED THE MIRROR INSIDE THE VISOR TO SHATTER.  WE DID NOT REALIZE THIS HAD OCCURRED UNTIL AFTER MY WIFE WAS DRIVING, LOWERED THE VISOR, AND GLASS SHARDS FELL ON HER LAP.  THANKFULLY THEY DID NOT FALL IN HER FACE/EYES.  THIS DID NOT CAUSE A WRECK, BUT WE'RE CONCERNED THAT THIS COULD CAUSE FUTURE ACCIDENTS.  WE CONTACTED VOLVO USA, AND THEY ACKNOWLEDGED PRIOR REPORTS OF SIMILAR INCIDENTS, BUT STATED THAT THE DAMAGE WAS NOT COVERED BY THE WARRANTY, AND ESSENTIALLY THEY TOOK NO RESPONSIBILITY.  THIS IS UNFORTUNATE, AS I BELIEVE THIS TO BE A CRITICAL DESIGN FLAW THAT COULD CAUSE A FATAL ACCIDENT.  I NOTIFIED VOLVO USA THAT I HAD NO CHOICE BUT TO FILE THIS CLAIM WITH NHTSA, IN AN EFFORT TO ALERT OTHER DRIVERS OF POTENTIAL RISKS. *TR",
        "vin": "YV1MK672682"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2009",
        "dateOfIncident": "06/21/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274561,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO C30 2008 HAS VERY SMALL SPACE BETWEEN BRAKE PEDAL,ACCELERATOR AND CONSOLE WHICH MAKE THE SHOE TRAPPED UNDER THE BRAKE PEDAL. THIS MAY VERY SERIOUS  ACCIDENT. *TR",
        "vin": "YV1MK672882"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/26/2008",
        "dateOfIncident": "12/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222435,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I WAS DRIVING OUT OF A TOLL BOOTH AND WAS ACCELERATING.  A TRACTOR TRAILER BEGAN COMING CLOSER TO ME.  I MOVED OVER TO AVOID IMPACT WITH THE TRUCK.  IN THE PROCESS MY FRONT AND REAR DRIVERS SIDE WHEELS RUBBED AGAINST A CURB CAUSING THE SIDE AIRBAGS TO DEPLOY.  THERE WAS NO DAMAGE TO THE VEHICLE OTHER THAN A TWO INCH SCRAPE ON THE RIMS.  THE EMPLOYEES IN THE BODY SHOP AND SERVICE DEPARTMENT STATED THAT THE AIRBAGS SHOULD NOT HAVE DEPLOYED DUE TO THE WHEELS RUBBING CURB.  THE WOMAN AT VOLVO STATED THAT THE CAR \"DETECTED IMMINENT DAMAGE\" WHICH CAUSED THE AIRBAGS TO DEPLOY.  I WAS DECELERATING AT THE TIME OF THE DEPLOYMENT, HAD I BEEN ACCELERATING TO PASS THE TRUCK I WOULD HAVE BEEN KILLED.  THE INVESTIGATOR FROM VOLVO STATED THAT THEY MOVED THE SENSORS TO THE WHEEL WELLS AND THE ARE MORE SENSITIVE.  I THINK THIS IS A SERIOUS SAFETY CONCERN AS THE VEHICLE, UPON DETECTING IMMINENT DANGER ALMOST KILLED ME.  *TR",
        "vin": "YV1MK672682"
    }
]