[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445058,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Volkswagen Jetta. The contact stated the front driver’s side seat heaters would overheat when choosing option 1 or 2 and failed to turn off. The contact stated that the heat was overwhelming for her and would feel like it was burning her back. The contact stated no warning light was illuminated. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 140,000.",
        "vin": "3VWRM71K88M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421759,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was placed in park but key would not turn to off position and therefore would not come out of the ignition nor turn the car off. Inability to turn car off causing increased carbon dioxide released and higher change of fire occurring especially in poorly vented areas such as garage. This occurred right after an inspection and there were no warning or messages before or after this issue.",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407606,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST AFTER I PURCHASED THE USED VEHICLE FROM A PRIVATE PARTY, I WAS DRIVING ON THE INTERSTATE AT APPROXIMATELY 70 MILES PER HOUR, WHEN THE VEHICLE WITHOUT WARNING SLAMMED INTO SECOND GEAR, SENDING MY FACE INTO THE STEERING WHEEL, WHILE THE CARS TRAVELLING BEHIND ME HAD TO BRAKE TO AVOID COLLISION. I PULLED OVER,  AND TURNED THE CAR OFF TO ASSESS THE REASON, TO NO AVAIL. WHEN I RE-STARTED THE CAR  AND PUT IT IN GEAR, IT DROVE FINE UNTIL THE NEXT TIME I DROVE IT. THEN IT DID A REPEAT OF THE PREVIOUS ACTION, SENDING THE TRANSMISSION INTO SAFE MADE WITHOUT ANY NOTICE OR PROVOCATION, AND AGAIN, WHEN I RESTARTED THE VEHICLE IT DROVE PERFECTLY NORMAL WHILE I DROVE IT DIRECTLY HOME. WHEN I PERFORMED AN OBDII SCAN, IT GENERATED P0746 AS THE PROBLEM, WITH NO OTHER PROBLEMS BEING REPORTED. I AM REPORTING THIS PROBLEM BECAUSE THE FIRST TIME IT HAPPENED, IT COULD HAVE HAVE ENDED VERY BADLY HAD SOMEONE ELSE BEEN BEHIND THE WHEEL, SUCH AS A MOTHER WHO MAY BE DISTRACTED BY HER CHILDREN AT THE TIME, AND I FEEL THIS MATTER SHOULD BE ADDRESSED BEFORE SOMEONE IS KILLED ON THE HIGHWAY. PRIOR EXPERIENCE HAS TAUGHT ME THAT HIGHWAY ACCIDENTS SELDOM ONLY HAPPEN TO ONE VEHICLE AT A TIME, AND ALMOST ANYONE THAT EXPERIENCES THIS PROBLEM ON A HIGHWAY COULD CAUSE SERIOUS INJURY TO MULTIPLE CARS AND NEEDS TO BE ADDRESSED.",
        "vin": "3VWRJ71K78M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406486,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN IGNITION WHILE TURNING OFF ENGINE.",
        "vin": "3VWJM71K68M"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366592,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WAS STUCK IN N THE IGNITION IN THE ON POSITION. COULD NOT TURN THE KEY EITHER WAY. AFTER SEVERAL HOURS OF THE CAR RUNNING I WAS FORCED TO HEAD TO MY LOCAL VW DEALERSHIP FOR REPAIR. THE COST TO REPLACE THE INSIDE OF THE IGNITION PLUS LABOR WAS $1,000.",
        "vin": "3VWJZ71K68M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365375,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY COMES OUT OF GEAR. WILL NOT LET YOU SELECT FORWARD OR REVERSE ,LEAVING YOU STUCK IN A POSSIBLE DANGEROUS SITUATION.  THROWS CODE P0717 , TRANSMISSION SPEED SENSOR. AFTER SOME RESEARCH I'VE DISCOVERED THIS IS A COMMON ISSUE AND RECALLS HAVE BEEN ISSUED IN OTHER COUNTRIES.",
        "vin": "3VWRA71K88M"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331740,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE, THE SAFETY ANTI-LOCK WARNING LIGHT ILLUMINATED AND THE VEHICLE FAILED TO START. THE CONTACT STATED THAT AFTER SEVERAL ATTEMPTS, THE VEHICLE STARTED HOWEVER, THE CONTACT WAS THEN UNABLE TO TURN OFF THE VEHICLE OR REMOVE THE KEY FROM THE IGNITION. THE CONTACT STATED THAT WITH EXTRA EFFORT SHE WAS ABLE TO REMOVE THE KEY FROM THE IGNITION. SUNTRUP VOLKSWAGEN LOCATED AT 6000 S LINDBERGH BLVD, ST. LOUIS, MO 63123, (314) 892-8200, WAS CONTACTED AND MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 167,000.",
        "vin": "3VWJM71KX8M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328740,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COULD NOT START VEHICLE BUT ONCE ABLE TO START WAS UNABLE TO TURN OFF VEHICLE. KEY IS STUCK IN IGNITION IN THE ON POSITION. HAD TO DISCONNECT BATTERY AND PULL FUEL PUMP RELAY TO KILL POWER. DID SOME RESEARCH AND THIS SEEMS TO BE A COMMON AND EXPENSIVE MANUFACTURE DEFECT FOR CERTAIN VOLKSWAGEN MODELS.  DUE TO THE REQUIRED KNOWLEDGE AND SPECIALIZED TOOLS NEEDED TO REPAIR THIS ISSUE, VW SHOULD HAVE RECALLED AND REPAIRED. THIS HAS BEEN AN ONGOING ISSUE BUT NOW UNABLE TO DRIVE.",
        "vin": "3VWRM71K78M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312023,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THERE WAS AN ABNORMAL CLUNKING SOUND COMING FROM THE TRANSMISSION. THE INSTRUMENT PANEL DISPLAY SHOWED THAT THE TRANSMISSION INDEPENDENTLY SWITCHED FROM DRIVE TO NEUTRAL AS THE VEHICLE LOST MOTIVE POWER. UPON INSPECTION, IT WAS DISCOVERED THAT THE DRIVESHAFT BOLTS LOOSENED AND A HOLE WAS PRESENT WHICH CAUSED TRANSMISSION FLUID TO LEAK FROM THE VEHICLE. THE VEHICLE WAS TOWED TO THE RESIDENCE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER AND MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310192,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR LEAKS ON THE FRONT AND REAR CARPET ON PASSENGER SIDE ONLY.  IS MY AIR CONDITIONED HOSE STOPPED UP OR SUN ROOF DRAINS STOPPED UP.",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WILL NEED $1500. OF WORK TO PASS NYS INSPECTION.THE REAR MAIN SEAL HAS FAILED WHICH CAUSES A VACUUM LEAK THAT RESULTS IN AN EMISSIONS FAILURE. CEL.   MY RESEARCH HAS INFORMED THAT THIS IS A VERY COMMON FAILURE.",
        "vin": "3VWRA71K08M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246125,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN STOPPED WORKING AND AIRBAG WARNING LIGHT ILLUMINATED.  TOOK CAR TO VW DEALERSHIP AND THEY ADVISED I NEED AN AIR BAG SPRING.  CHECKED ONLINE AND VW ISSUED RECALL NOTICES FOR SIMILAR ISSUE FOR NEWER MODELS, BUT NOT THIS MODEL.  VW DEALERSHIP OFFERED ESTIMATE OF $554.88 PLUS TAX AND SHOP SUPPLIES.  VW SHOULD EXTEND RECALL TO MORE YEARS SINCE THIS IS A KNOWN ISSUE.",
        "vin": "3VWJM71K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231997,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION SWITCH WAS STUCK IN THE ON POSITION WITH THE ENGINE RUNNING.  THE CAR WAS STOPPED AND IN PARK IN A DRIVEWAY.  BUT THIS FAILURE COULD HAVE EASILY OCCURRED INSIDE A GARAGE.  THE CAR WAS SUCCESSFULLY TURNED OFF AFTER BREAKING THE PLASTIC KEY TRANSMITTER AND FORCING THE KEY WITH PLIERS.  OTHERS MAY NOT HAVE THE STRENGTH OR TOOLS TO FORCE THIS TO TURN OFF.  I'M CONCERNED THAT THIS COULD OCCUR AND THE ENGINE NOT BEING ABLE TO BE TURN OFF COULD START A FIRE OR PRODUCE CO POISONING IN A CLOSED ENVIRONMENT.  PART FAILURES SUCH AS THIS SHOULD FAIL IN A SAFE MODE.  THIS IS CLEARLY NOT A SAFE FAILURE MODE.",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220537,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION LOCK, I CANNOT NOT TURN THE KEY TO TURN ON THE CAR. IT WAS WORKING AND ONCE I PARKED THE CAR, I CAME BACK TO THE CAR AND THE KEY WILL NOT TURN AT ALL. I TRIED TURNING THE WHEEL AND JIGGLING THE KEY LOCK AND IT STILL WON'T BUDGE.",
        "vin": "3VWRM71K08M"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/26/2019",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210866,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED MY CAR COMPLETELY OFF AND THE CAR WAS PARKED WHEN I GOT OUT OF MY CAR TO MEET WITH A FRIEND TO GO SWIMMING AT THIS NEIGHBORHOOD POOL. I HAD MY KEYS IN MY HAND (STILL DO HAVE THE KEY AS WELL) AND I SMELLED SOMETHING BURNING, SO I TURNED AROUND AND THERE WAS SMOKE COMING OUT OF MY SUNROOF. I LOOKED IN THE CAR AND SAW THAT IT WAS A FIRE IN MY BACKSEAT ON THE PASSENGER SIDE (ALSO WHERE THE GAS TANK IS LOCATED) AND SAW THE FIRE SPREADING. THEREFORE, I RAN AWAY FROM THE CAR, YELLED FOR HELP AND CALLED 911. WITHIN THREE MINUTES MY CAR WAS ENGULFED IN FLAMES AND POPPED A FEW TIMES AS WELL. THE FIRE ALSO CAUGHT THE GRASS, A FEW BUSHES AND TREES ON FIRE AS WELL. THE FIREFIGHTERS CAME TO PUT THE FIRE OUT AND INFORMED ME THAT THE FIRE STARTED IN MY ENGINE AND TRAVELED FROM THERE TO THE GAS TANK AND SPREAD FROM THERE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208154,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA SPORTWAGEN",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1.ON 3/23/2017 I PHYSICALLY SIGNED (INK SIGNATURE) TO PURCHASE A USED 2008 JETTA 2.WITHIN A WEEK THE 08 JETTA BROKE DOWN ON THE HIGHWAY 3.I IMMEDIATELY NOTIFIED (SELLER) PLEASANT VALLEY MOTORS, RALEIGH, NC (PVM) AND TOLD ME TO TOW IT TO MY HOME AND PVM WILL TOW THE VEHICLE WITH THEIR MECHANIC & FIX THE PROBLEM. 4.WHILE VEHICLE SAT FOR A WEEK, I HAD A MOBILE CO. CONDUCT A DIAGNOSTIC. RESULTS:REAR BRAKES ON DRIVER-SIDE WERE METAL TO METAL AND NEEDED TO BE REPLACED,ALSO CLUTCH WAS NOT FUNCTIONING, SLVE CYLINDER NEEDED TO BE REPLACED, ALSO NUT THAT HOLDS SHIFTER MECHANISM DOWN WAS BROKEN AND SOMEONE TRIED TO WELD IT BACK AND WOULD NEED TRANSMISSION TO REPAIR IT. 5.ON 3/31/2017 THE 08 JETTA WAS FINALLY PICKED UP BY PLEASANT VALLEY MOTORS 6.IN THE INTERIM, I HAD TO RENT VEHICLES TO GO TO WORK ETC. 7.PVM, OFFERED A VEHICLE IN WHICH THEY CAME UNANNOUNCED TO TOOK THE LOANER DUE TO THEM CLOSING DOWN ABRUPTLY. 8. ON MAY 12, 2017, WITH MY 08 JETTA IN THEIR POSSESSION STATED THEY WERE CLOSING AND I WILL NEED TO PAY THEIR UNKNOWN MECHANIC THE REPAIRS. 9. I REQUESTED FOR PVM TO FURNISH A MECHANICAL VEHICLE REPORT, LOCATION AND STATUS ON THE VEHICLE. I RECEIVED NOTHING BUT BACK AND FORTH CONFIRMATION FROM UNKNOWN REPS UPON PVM CLOSING. 10. PLEASE NOTE: I RECEIVED HARASSING PHONE CALLS FROM \"AL\" A SALES AGENT WITH PVM THAT WAS NEVER LICENSED TO SELL IN NORTH CAROLINA. 11. SINCE MAY 12, 2017, PVM AND THEIR MECHANIC WAS NEVER SEEN AND MY VEHICLE I NEVER HAD IN MY POSSESSION TO DATE. 12. I INFORMED CREDIT ACCEPTANCE ABOUT THIS ENTIRE ORDEAL AND CREDIT ACCEPTANCE THE LENDER STATED THEY CONDUCTED AN INVESTIGATION ON-SITE AFTER PVM CLOSED AND THEY DID NOT CONFIRM NOR PROVIDED ME DETAILS RESULTS OF THEIR INVESTIGATION SUCH AS DATE, TIME, AGENT WHO INVESTIGATED THIS AUTO FRAUD ETC. 13. IN RETURN, TO DATE HAVE ACCUMULATED BAD CREDIT REPORTING FROM CREDIT ACCEPTANCE, NO VEHICLE IN POSSESSION.",
        "vin": "3VWRA71K48M"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207572,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WHILE DRIVING IMMEDIATELY SLOWS LIKE IT WAS SHIFTED INTO NEUTRAL. WHEN YOU PRESS THE GAS CAR RACES BUT DOES NOT MOVE. THE PRNDS FLASHES AND THE CAR HAD TO BE SHUT DOWN AND RESTARTED.  I HEARD THERE WAS A RECALL BUT IT NEVER SHOWED FOR MY CAR NOR WILL THEY HELP, BECAUSE MY VIN WAS NOT LISTED. THIS IS A SERIOUS SAFETY HAZARD. ESPECIALLY AT 55 MPH IN HEAVY TRAFFIC.",
        "vin": "3VWRA71KX8M"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193503,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT ON",
        "vin": "3VWRZ71K08M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170475,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT SHIFT PROPERLY AND GOES INTO LOMPODE. CANNOT ACCELERATE. IT HAS HAPPENED WHILE DRIVING ON HIGHWAYS, IN STOP AND GO TRAFFIC, AND WHILE BACKING OUT OF PARKING SPOTS. THE CAUSE OF THE PROBLEM IS THE MECHATRONICS UNIT .",
        "vin": "3VWRJ71K88M"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11163359,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I UTILIZED MY SEAT WARMER ON THE DRIVER SIDE AND ONLY HAD THE SETTING ON 2 (OUT OF 5).  AFTER APPROXIMATELY AN HOUR OF MY TRIP HOME FOR CHRISTMAS, I STARTED TO FEEL MY LOWER BACK (ON MY RIGHT) BURN BECAUSE THE SEAT WAS EXCESSIVELY HOT.  WHEN I REACHED MY HAND BEHIND MY BACK TO FEEL THE SEAT THAT IS WHEN I DISCOVERED THE HOLE IN MY SEAT AND I BURNT MY HAND IN THE PROCESS.",
        "vin": "3VWRZ71K18M"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160846,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR INITIALLY HAD TROUBLES WHEN IT WOULD BE HOT OUTSIDE IT WOULD AND THE TEMPERATURE GAUGE WOULD GO HIGH IN TEMPERATURE ALSO IF IT WAS COLD OUTSIDE AND YOU WERE DRIVING SLOW TEMPERATURE GAUGE  DOWN BELOW SAFE TEMPERATURE. AFTER APPLYING 2-5 BOTTLES IN A MONTH  THE CAR STARTED SHUTING DOWN ON ITS ON . AFTER AN OIL CHANGE IN APRIL, I EXPERIENCED THE MOST SCARY INCIDENT... WHILE DRIVING ON FREEWAAY I FELT KERKING A SEEN SMOKE FROM UNDER THE HOOD. I OULLED IN S GAS STATION AND LET THE CAR COOL TOPK OVER 4HRS TO DO SO. I HAD TO DRIVE BACK HOME ON THE STREETS AND THE CAR WPULD NOT STAY AT A STABLE HEAT. I HAD TO STOP MY CAR IN MULTIPLE UNSAFE AREA AFTER'11 IN THE NIGHT. NOW THE CAR WILL NOT START UNLESS GIVE A JUMP FOR OVER AN HOUR. OBLY SATYS IN FOR ABOUT A MIN THE LOSES POWER ALL OVER AGAIN",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141146,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN IGNITION WHEN TURNING VEHICLE OFF.",
        "vin": "3VWRA71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123281,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUSTER..IINTERAL WIRING CLOCK ALWAYS RESETS AT 12:00 WINDSHIELD WASHER PUMP STOPPED WORKING AIR CONDITIONING POPS FUSES POWER SUPPLY PORTS HAVE NO POWER.",
        "vin": "3VWJM71K48M"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SELECTOR INDICATOR DISPLAY ON THE DASH IS FLASHING AND THE CAR IS DOING ITS OWN THING CHANGING GEARS. IT WILL NOT PROPERLY ACCELERATE CAUSING A MAJOR SAFETY ISSUE ANYWHERE BUT ESPECIALLY ON THE HIGHWAY. THE CAR WAS PROPERLY ACCELERATING ON THE HIGHWAY BEFORE THE DISPLAY STARTING FLASHING AND THE CAR DOWNSHIFTED (INTO EITHER 3RD OR 4TH) AND REFUSES TO UPSHIFT AGAIN. I THINK THIS IS RELATED TO A MECHATRONIC UNIT FAILURE IN THE 2009-2010 RECALLS.",
        "vin": "3VWRJ71K68M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089171,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY GETS STUCK IN KEYLOCK AND YOU ARE UNABLE TO TURN OFF ENGINE. WENT ONLINE AND THERE ARE TONS OF COMPLAINTS ON FORUMS.",
        "vin": "3VWRJ71K68M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071942,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA SPORTWAGEN",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA SPORTWAGEN. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THERE WAS A FAILURE WITH THE REAR PASSENGER SEAT. THE INDEPENDENT MECHANIC RESET THE AIR BAG WARNING INDICATOR; HOWEVER, THE INDICATOR CONTINUED TO ILLUMINATE. THE VEHICLE WAS TAKEN TO ANOTHER INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ILLUMINATION WAS DUE TO AN AIR BAG FAILURE LOCATED AT THE DRIVER'S SEAT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS 136,000.",
        "vin": "3VWRA71K28M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048689,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY 17 YEAR OLD DAUGHTER WAS DRIVING DOWN A CITY ROAD, GOING ABOUT 30MPH, THE CAR STOPPED ACCELERATING. SHE THEN NOTICED PRNDS WAS FLASHING ON THE DASH. LUCKILY, SHE WAS NOT FAR FROM HOME, SHE WAS ABLE TO CONTINUE DRIVING IT HOME. WE PARKED THE CAR UNTIL WE WERE ABLE TO HAVE IT TOWED TO THE NEAREST DEALERSHIP, WHICH IS 88MILES AWAY. THE CAR IS UNDRIVEABLE AT THIS POINT. .  THE DEALERSHIP INFORMED ME THAT THE MECHATRONIC UNIT HAS  FAILED AND NEEDS REPLACED, QUOTING ME $2800.00.  I'VE TRIED CONTACTING VOLKSWAGEN ABOUT THIS ISSUE AND ALL THEY TELL ME IS HER VIN NUMBER IS NOT INCLUDED IN THE RECALL EVEN THOUGH HER CAR IS HAVING THE EXACT SAME ISSUES AS THE OTHER RECALLED 2008 VW JETTAS.",
        "vin": "3VWRJ71K68M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048264,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "YELLOW AIRBAG LIGHT WOULD STAY ON WHEN CAR WAS ON. I CHECKED WITH VW DEALER TO SEE IF THERE WAS A RECALL AND WAS ADVISED NO. THIS IS THE SAME PROBLEM THAT THE 2010 THRU 2016 VW ARE HAVING. DEALER ADVISED TO REPLACE THE CLOCKSPRING AND HARNESS DUE TO BUILD UP OF DUST IN THE STEERING HUB. COST OF REPAIR $678.74 PLUS A 3WEEK WAITNG TIME FOR PART TO ARRIVE AT THE VW DEALER.",
        "vin": "3VWRM81K98M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035195,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY AIRBAG INDICATOR LIGHT FOR MY LEFT BACK SEAT STAYS ON AND AFTER GETTING MY CAR SERVICED, ANOTHER AIRBAG LIGHT FOR MY DRIVER SIDE STAYS ON. I FIND THAT UNUSUAL. AM I GOING TO HAVE TO TAKE MY CAR IN FOR SERVICE FOR EVERY AIRBAG THAT COMES ON WITHIN 3 MONTHS PERIOD??? SOMETHING NEEDS TO BE DONE....CONCERN AND FRUSTRATED OWNER.",
        "vin": "3VWRA71K28M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014626,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 08/08/17 WHEN I TURNED THE CAR ON, THE DRIVER'S SIDE AIRBAG INDICATOR LIGHT CAME ON AND STAYED ON.  I BROUGHT THE CAR TO LANGAN VW OF VERNON, CT (167 HARTFORD TURNPIKE, VERNON, CT 06066) ON 08/10/17.  AN ANALYSIS WAS DONE AND I WAS TOLD THAT THE AIRBAG WAS BROKEN AND THAT THE AIRBAG NEEDED TO BE REPLACED.  I WAS QUOTED A PRICE OF OVER $1,200 FOR PARTS AND LABOR.  I WAS TOLD THIS WAS VERY UNUSUAL.  I CHECKED THE RECALL LIST, BUT MY MAKE/MODEL/YEAR IS NOT ON THE LIST.  I THOUGHT YOU SHOULD KNOW THAT THERE MAY BE A POTENTIAL BIGGER PROBLEM THAT INCLUDES MY MAKE/MODEL/YEAR.  WHEN I PICK UP MY CAR AND GET THE ITEMIZED BILL, I WOULD BE HAPPY TO SEND IT TO YOU IF REQUESTED.  THANK YOU",
        "vin": "3VWRZ71K18M"
    },
    {
        "components": "EXTERIOR LIGHTING,INTERIOR LIGHTING,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003508,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. ON SEVERAL OCCASIONS, WHILE DRIVING, ALL THE HEADLIGHTS AND TAIL LIGHTS FAILED TO ILLUMINATE. ALSO, WHILE THE VEHICLE'S DOORS WERE AJAR, THE INTERIOR LIGHTING FAILED TO ILLUMINATE. ALSO, THE TRACTION CONTROL WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED. THE CONTACT PREVIOUSLY REPAIRED THE HEADLIGHTS AND TAIL LIGHTS THREE TIMES, BUT THE INTERIOR LIGHTING WAS NOT REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 118,000.",
        "vin": "3VWRZ71K48M"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000732,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. WHEN THE CONTACT ATTEMPTED TO DRIVE THE VEHICLE, THE BRAKE SYSTEM AND ABS WARNING INDICATOR REMAINED ILLUMINATED AND A BEEPING NOISE WAS HEARD. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHERE IT WAS DIAGNOSED THAT THE ABS MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. IN ADDITION, THE CONTACT HAD TO APPLY EXTREME PRESSURE TO THE BRAKE PEDAL, AND THE PARKING BRAKE HAD TO BE APPLIED IN ORDER TO STOP THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "3VWRA71K88M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "05/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991617,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. WHILE THE VEHICLE WAS PARKED WITH THE KEY OUT OF THE IGNITION, THE CONTACT ENTERED THE VEHICLE ON THE PASSENGER SIDE. HALF OF HER BODY WAS INSIDE THE VEHICLE AND ONE LEG WAS HANGING OUTSIDE THE VEHICLE. THE CONTACT HEARD A CLICKING NOISE AND THE VEHICLE STARTED TO ROLL BACK ACROSS THE PARKING LOT. THE VEHICLE CROSSED FOUR LANES OF TRAFFIC UNTIL IT WAS STOPPED BY STEEL CABLES THAT WERE SECURING A LIGHT POLE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. AFTERWARDS, THE CONTACT EXPERIENCED BODY SORENESS. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER OR AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "3VWRM71K48M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959007,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY TIMING CHAIN TENSIONER",
        "vin": "3VWRA71K38M"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "12/25/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937294,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I FIRST STARTED EXPERIENCING THIS PROBLEM WITH THE REAR PASSENGER DOOR ON MY VW JETTA IN DECEMBER 2015. THE DOOR WOULD NOT LOCK USING THE KEY REMOTE. I HAVE TO MANUALLY LOCK THE DOORS BY PUSHING THE KEY INTO THE DRIVER SIDE DOOR IN ORDER TO GET A BEEP SOUND AND FLASHING INDICATORS TO CONFIRM THAT ALL THE DOORS ARE LOCKED. I TOOK THE CAR TO THE VW DEALERSHIP WHICH COST $480 TO FIXED ONE DOOR. ABOUT FOUR MONTHS AFTER FIXING THE DOOR, SOMEONE BROKE INTO THE CAR WHICH I LATER FOUND OUT THAT THE DRIVER SIDE REAR DOOR LOCK ALSO FAILED AND WASN'T WORKING. THE DIFFERENCE THIS TIME WAS, MANUALLY USING THE KEY WOULD ONLY LOCK THREE DOORS (2 FRONT DOOR AND PASSENGER SIDE REAR DOOR, WHICH I HAD FIXED PRIOR TO THE SECOND FAILURE). I TOOK THE CAR TO THE DEALERSHIP AGAIN AND HAD TO PAY ANOTHER $480 TO GET IT FIXED. ABOUT A MONTHS AFTER THE SECOND FAILURE, THE FRONT PASSENGER SIDE DOOR LOCK STOP WORKING WHICH COST ME ANOTHER $480. CURRENTLY, THE DRIVER SIDE DOOR LOCK IS NOT WORKING. I ASKED THE VOLKSWAGEN SERVICE ADVISOR IF VOLKSWAGEN IS GOING TO OR PLANNING ON CORRECTING THIS PROBLEM AND THE ANSWER I GOT WAS 'NO, IT'S NOT A SAFETY ISSUE.' WHY DO CAR DOORS LOCK AUTOMATICALLY WHILE DRIVING? COULD IT SOMEWHAT BE FOR SAFETY REASON? WHEN ONE OF THE DOOR LOCK FAILS, THE CAR DOORS ARE NOT LOCKED WHILE DRIVING. THIS IS A WELL-KNOWN PROBLEM WITH MOST OF THE VOLKSWAGEN MODELS. DOES VOLKSWAGEN CARES? COULD THIS BE DANGEROUS FOR A CHILD OR ADULT IN THE BACK/FRONT SEAT OF A CAR DRIVING AROUND WITH UNLOCK DOORS? PLEASE, PLEASE I'M CRYING FOR HELP!  *TR",
        "vin": "3VWRZ71K08M"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/26/2016",
        "dateOfIncident": "11/26/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928049,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ACCELERATED UNCONTROLLABLY. UNENTENDENT ACCELERATION.",
        "vin": "3VWRA71K98M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918618,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN IGNITION WHEN TURNING OFF THE ENGINE.",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916447,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A STOP, WHEN ACCELERATING, THE CAR MAY JERK OR HESITATE. HARD SHIFTING FROM 2 TO 1 CAN CAUSE THE PERSON BEHIND TO REAR END OR  THE CAR NEXT TO YOU TO HIT YOU WHEN YOU SUDDENLY STOP MOVING.  *TR",
        "vin": "3VWRA71KX8M"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914809,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 WHEELS THAT KEEP LOSING AIR, I KEEP BRINGING IT BACK TO PEP BOYS THINKING THEY WERE SELLING ME DEFECTIVE TIRES.  MY LAST INCIDENT WAS IN WEDNESDAY OCTOBER 5, ON THE WAY BACK FROM SAN DIEGO I EXPERIENCED A SUDDEN LOSS OF AIR PRESSURE AND ALMOST CRASHED AT FREEWAY SPEEDS. THE TOW TRUCK DRIVER TOLD ME ITS THE VW WHEELS AND THEY ARE UNSAFE.",
        "vin": "3VWRZ71K98M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905971,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS IN MOTION ON A HIGHWAY, THE TURN SIGNALS BEGAN TO ACT ERRATICALLY.  INITIALLY ONLY THE LEFT TURN SIGNALING APPEARED TO BE AFFECTED, AND WOULD FAIL TO MAKE ANY INDICATION ON THE DASH OR ILLUMINATE THE LIGHTS.  SHORTLY AFTER THIS, ATTEMPTING TO SIGNAL A RIGHT TURN WOULD ACTUALLY RESULT IN THE LEFT TURN INDICATOR LIGHTS ILLUMINATING (YES, THE OPPOSITE OF WHAT WAS INTENDED).    AS I AM ONE OF THE INDIVIDUALS DEALING WITH THE DOOR CONTROL ISSUE, I AM UNABLE TO USE MY WINDOW.  I COULD NOT USE ARM SIGNALLING TO MAKE MY INTENTIONS CLEAR TO OTHER DRIVERS.  IT WAS VERY DIFFICULT TO CHANGE LANES ON THE HIGHWAY.    I BELIEVE THAT THERE WAS A SIMILAR ISSUE, AND ASSOCIATED RECALL, WITH THE 2002 JETTA TURN SIGNAL INDICATOR/SWITCH.",
        "vin": "3VWRA71K08M"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887820,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING THE  CAR STARTED SHAKING AND WHEN I CHECKED THE OIL THERE WAS NO OIL ON THE DIPSTICK.NO  OIL LIGHT CAME ON AND WHEN I BROUGHT IT TO MY MECHANIC HE STATED THAT THE REAR SEAL NEEDED TO BE REPLACED.    THIS CAR HAS ONLY 120,000 MILES ON IT WHEN I CALLED THE VW DEALER IN SACO MAINE I WAS TOLD THAT WHEN IT IS REPAIRED I SHOULD ALSO HAS THE PVB VALVE CHANGED THAT IT IS NOW MADE OUT OF A BETTER MATERIAL- HE STATED THAT IT IS A COMMON PROBLEM WITH THAT SPECIFIC MOTOR THAT WHEN THE PVB VALVE PUTS TOO MUCH PRESSURE ON THE SEAL CAUSING IT TO BREAK BUT STATED THERE IS NO WARRANTY COVERAGE OR RECALL.  IT IS AN EXPENSIVE REPAIR AS THEY NEED TO COMPLETELY REMOVE THE TRANSMISSION.",
        "vin": "3VWRA71KX8M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876296,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS STARTED TO DISPLAY SOME OF THE CHARACTERISTIC SLIPPING AND LURCHING DSG ISSUES THAT VW KNOWS ABOUT. I TOOK IT TO THE DEALERSHIP AND WHEN THE TECH TOOK IT OUT FOR A TEST DRIVE, HE ACTUALLY EXPERIENCED THE ISSUE HIMSELF. UNFORTUNATELY, THE COMPUTERS AREN'T THROWING ANY CODES SO THEIR ONLY ADVICE WAS TO KEEP DRIVING IT UNTIL IT GETS WORSE AND I CAN BRING IT BACK AND THEY CAN MORE EASILY DUPLICATE THE PROBLEM.    SO BASICALLY I'M DRIVING A TIME BOMB. VW KNOWS THERE'S ISSUES WITH THIS TRANSMISSION, THE VW DEALERSHIP TECH EXPERIENCED THE ACTUAL ISSUE HIMSELF, BUT THEY WON'T DO ANYTHING UNTIL IT GETS WORSE.",
        "vin": "3VWDJ71K38M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "06/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873334,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO A GAS STATION AND TRIED TO TURN OFF ENGINE TO FUEL THE CAR.  AN IGNITION MALFUNCTION WOULD NOT ALLOW ME TO TURN ENGINE OFF OR REMOVE KEY FROM IGNITION.",
        "vin": "3VWRM81K48M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "05/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864434,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  MY DASH READS, \"AIRBAG FAULT\".",
        "vin": "3VWRM81K18M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "04/19/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863938,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STALL IN MIDDLE OF THE ROAD WHILE DRIVING, THEN THE TRANSMISSION  HAS THE ISSUE AS CAR DOES NOT MOVE TO DRIVE OR REVERSE.  THE ISSUE CAN CAUSE THE SEVERE ACCIDENT.  THIS NEEDS TO LOOK INTO THIS.  I BELIEVE SIMILAR INSTANCES HAVE REPORTED:  HTTP://ABCNEWS.GO.COM/GMA/STORY?ID=8378724",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846338,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG MALFUNCTION LIGHT IS ON. I CHECKED AND THE PROBLEM SEEMS TO BE THE STEERING WHEEL CLOCK SPRING THAT CAN BE CONTAMINATED BY DEBRIS, WHICH MOVES THE PART'S GUIDE LOOPS OUT OF POSITION. THIS CAN CAUSE A TEAR IN THE ELECTRICAL CABLE THAT CONTROLS THE DRIVER'S AIRBAG. IF THIS HAPPENS, A WARNING LIGHT WOULD ILLUMINATE, BUT THE SAFETY DEVICE WOULD NOT DEPLOY IN A CRASH. VW IS STILL IDENTIFYING ALL OF THE AFFECTED VINS AND DEVELOPING A FIX.  I SOW THAT THE 2010 JETTA ARE RECALLED FOR THE SAME PROBLEM. WHY MY CAR IS NOT INCLUDED IN THE RECALL.",
        "vin": "3VWRZ71K08M"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/16/2016",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836460,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER HEATED LEATHER SEAT CAUGHT FIRE AFTER CAR WAS TURNED ON AND THE HEATED SEAT BUTTON WAS TURNED ON. THE VEHICLE WAS STATIONARY.",
        "vin": "3VWRM71K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2016",
        "dateOfIncident": "01/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825781,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER SIDE DOOR LOCK INOPERABLE. LOCK MECHANISM FAILED CAUSING THE DOOR TO NOT LOCK MANUALLY OR WITH REMOTE. ALSO, THE ALARM SYSTEM FAILED TO \"CHIRP\" WHEN PRESSING REMOTE. TOOK TO DEALER AND SPENT $500 ON A LOCK MECHANISM IN THE DOOR. I HEAR THIS IS VERY COMMON WITH THIS MODEL. BUYER BEWARE.",
        "vin": "3VWRZ71K68M"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825330,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SAFETY BELT FRAYING AND SHOULD BE REPLACED, POSSIBLE DEFECTIVE DESIGN OR FLAW IN THE CLIP WHERE THE BELT PASSES THROUGH, SHARP METAL IS PROTRUDING FROM PLASTIC BUCKLE CAUSING THE BELT TO FRAY. MAJOR SAFETY CONCERN.",
        "vin": "3VWRJ71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2015",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809404,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT THE REAR PASSENGER SIDE DOOR FAILED TO LOCK. THE DOOR FAILED TO LOCK MANUALLY AND WITH THE KEY FOB. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO A DEALER, AND THE DOOR LOCK MECHANISM WAS REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": "3VWRM71KX8M"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780581,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. WHEN THE VEHICLE WAS STARTED, THE AIR BAG WARNING INDICATOR INTERMITTENTLY ILLUMINATED. THE FAILURE RECURRED EACH TIME THE VEHICLE WAS STARTED OVER APPROXIMATELY A TWO WEEK PERIOD UNTIL IT WAS CONSISTENTLY ILLUMINATED EACH TIME THE VEHICLE WAS STARTED. THE CONTACT ALSO STATED THAT WHEN HE MADE A LEFT OR RIGHT TURN, THERE WAS A CLICKING SOUND THAT CAME FROM THE STEERING COLUMN. THE FAILURES RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V483000 (AIR BAGS). THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "3VWJM71K28M"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746328,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE VEHICLE STALLED AND THE ENGINE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS ABLE TO RESTART, BUT WOULD ONLY ACCELERATE UP TO 30 MPH. THE CONTACT STATED THAT THIS WAS A RECURRING FAILURE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE TECHNICIAN DIAGNOSED THAT THE FUEL SENSORS WERE DEFECTIVE AND AN OIL CHANGE WAS NEEDED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 94,000.",
        "vin": "3VWRJ71K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735710,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT WHEN THE VEHICLE WAS PLACED INTO PARK, THE KEY WOULD NOT RELEASE FROM THE IGNITION SWITCH. THE VEHICLE WAS TAKEN TO THE DEALER AND WAS DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 67,000.",
        "vin": "3VWRZ71K88M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722920,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. WHEN DRIVING VARIOUS SPEEDS, THE CHECK ENGINE LIGHT ILLUMINATED. THE CONTACT ALSO NOTICED A LEAK IN THE VEHICLE. THE VEHICLE WAS TAKEN TO DEALER WHERE IT WAS DIAGNOSED THAT THE COOLING FAN MALFUNCTIONED AND THE LEAK WAS A CAUSED BY FAULTY PURGE PRESSURE SENSOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 132,911.",
        "vin": "3VWJM71K68M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2015",
        "dateOfIncident": "04/13/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706488,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 2012, I HAVE HAD CHECK ENGINE LIGHTS THAT NO MECHANIC HAS BEEN ABLE TO DIAGNOSE, BECAUSE EVERYTHING WAS FINE WHEN THEY WOULD CHECK THE KNOCK SENSOR. THEY WOULD RESET IT, AND SEE IF IT CAME ON AGAIN. HOWEVER, THERE WOULD BE LONG PERIODS WHERE IT WOULDN'T COME ON. IT HAS NOT COME ON, SINCE NOVEMBER OF 2014. 4/13/2015, AT APPROXIMATELY 1900 HOURS, I WAS TRAVELING ON A MAJOR FREEWAY, IN AFTERNOON TRAFFIC IN HOUSTON. WHEN, MY ENGINE BEGAN TO DIE. MY CONTROL PANEL WENT DEAD, AND MY ENGINE WAS GRADUALLY DYING, WITH THE RADIO AND ELECTRICITY STILL WORKING. I ENDED UP BEING STRANDED IN A MOVING LANE, AT A SPLIT, WITH VEHICLES WHIZZING FROM 60-80 MPH. I CALLED FOR A WRECKER OVER A POLICE RADIO, BUT 5 MINUTES LATER MY VEHICLE RESTARTED LIKE EVERYTHING WAS FINE, DIED AND RESTARTED AGAIN ON SHOULDER OF FREEWAY. I THEN GOT OFF THE FREEWAY AND WENT PARKING LOT TO PARKING LOT GOT HOME, TOOK IT TO VW DEALERSHIP FIRST THING. DUE TO NO ENGINE LIGHT OR FAULT CODE, DEALERSHIP GUESSED IGNITION SWITCH. DUE TO PROBLEMS WITH DEALERSHIP, TOOK VEHICLE FROM THEM AND PAID FOR DIAGNOSTIC. DISCOVERED IN REPORT THEY LISTED MALFUNCTIONING CAMSHAFT, WHICH THEY WERE GOING TO TRY AND HAVE ME PAY. I HAD THE IGNITION SWITCH REPLACED, DIED ON ME AGAIN ON 4/19/15. BECAUSE SEARCHING WITH MY VIN DID NOT REVEAL DEFECTS OR INVESTIGATIONS AND MY VEHICLE WAS SERVICED FOR THE 1 RECALL -- I SEARCHED WITH THE ENGINE CODE \"BPY\", I FOUND THERE HAD BEEN AN INVESTIGATION AND VW DECIDED TO NOT DO A RECALL BUT \"UPDATE\", THUS DIDN'T HAVE TO GIVE OWNERS NOTICE. HOWEVER, THEIR OWN MECHANICS SEEM TO BE UNAWARE. I REALIZED THAT THE TECHNICIAN THOUGHT OF THE IGNITION SWITCH DUE TO GM BEING IN THE NEWS AFTER THE DEATHS, DUE TO SIMILARITIES. VW DID AN \"UPDATE\" TO SETTLE THE INVESTIGATION, DID NOT GIVE NOTICE, AND I WOULD HAVE HAD TO PAY EVEN THOUGH THEY AGREED TO EXTEND THE WARRANTY FOR 10 YEARS AND 120,000 MILES.  *TR",
        "vin": "3VWRJ71K68M"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706445,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PCV VALVE GOT CLOGGED WHICH CAUSED THE REAR MAIN SEAL TO BLOW OUT CAUSING A LOT OF DAMAGE. THIS IS NOT SUPPOSED TO HAPPEN AT THIS MILEAGE. VOLKSWAGEN HAS ACKNOWLEDGED THEY ARE RECEIVING A LOT OF THESE VEHICLES BETWEEN 80K AND 100K, UNACCEPTABLE. THEY ARE NOT COVERING ANY REPAIRS. THERE HAS BEEN 3 REVISIONS BY VOLKSWAGEN TO THE PCV VALVE THATS IN MY VEHICLE BUT THEY WON'T ACKNOWLEDGE MINE IS FAULTY..WHY DID THEY REMAKE IT 3 TIMES? ALSO MODEL YEARS BEFORE ME HAD PCV VALVE RECALLS FOR THIS EXACT REASON. THANK YOU  *TR",
        "vin": "3VWRA71K88M"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702806,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 25 MPH, THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DISCOVERED THAT THE FRONT DRIVER AND PASSENGER SIDE AIR BAG CRASH SENSORS WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. IN ADDITION, THERE WAS A SHORTAGE WITHIN THE ELECTRICAL CIRCUIT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 116,000.",
        "vin": "3VWJM71K88M"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701665,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LOCKING MECHANISM STOPS WORKING AND THIS IS A KNOWN ISSUE IN A LOT OF VW FORUMS ONLINE. THEY CALL IT THE ACTUATOR AND WHEN IT STOPS WORKING THE CHILD LOCKS DO NOT WORK AND THE VEHICLE THEN HAS A MAJOR SAFETY ISSUE WHICH RELATES TO \"CHILD SAFETY SEATS THAT CONTAIN DEFECTIVE SAFETY BELTS, BUCKLES, OR COMPONENTS THAT CREATE A RISK OF INJURY, NOT ONLY IN A VEHICLE CRASH BUT ALSO IN NON-OPERATIONAL SAFETY OF A MOTOR VEHICLE.\" A DOOR THAT CAN BE OPENED BY A CHILD WHEN IN MOVEMENT OR PARKED IS A BIG SAFETY ISSUE.    THE DOOR CAN BE EASILY PUSHED OPEN FROM THE INSIDE WHEN THE LOCKS DON'T WORK. ALSO, THE ALARM ON THE VEHICLE WILL NOT ARM BECAUSE THE DOORS WILL NOT LOCK SO IF SOMEONE WENT DOOR CHECKING IN A PARKING LOT, MY CAR WOULD BE BROKEN INTO - IF NOT STOLEN ALTOGETHER DUE TO THIS. IN DECEMBER I PAID $450+ TO HAVE THE REAR DOOR LOCK REPLACED AND NOW, 3 MONTHS LATER, THE FRONT TWO DOOR LOCKS HAVE STOPPED WORKING.     ANOTHER HAZARD FOR SAFETY HAPPENS WHEN YOU CANNOT LOCK YOUR DOOR FROM THE INSIDE. IF SOMEONE WANTED TO CARJACK ME AT A STOP LIGHT - I AM UNABLE TO LOCK MY DOORS!    I CALLED VW CARE AND THEY HAVE DECLINED TO EVEN HELP ME WITH THIS COST AND I AM SLO FILING A CLAIM WITH THE BETTER BUSINESS BUREAU. IT IS A KNOWN ISSUE IN THE FORUMS ONLINE, SOMETHING MUST BE DONE ABOUT THIS.  *TR",
        "vin": "3VWRZ81K98M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701778,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM GETTING A WARNING LIGHT ON MY DASH INDICATING THAT THERE IS AN AIRBAG FAULT IN MY 2008 VOLKSWAGEN JETTA.  I HAVE CALLED THE DEALER WHERE I PURCHASED THE VEHICLE, AND AFTER SPEAKING WITH THEM, THE DEALER GAVE ME A NUMBER TO WHAT HE SAID WAS THE VOLKSWAGEN CORPORATE OFFICE IN MICHIGAN.  I WAS TOLD BY BOTH THE DEALER AND BY VOLKSWAGEN CORPORATE THAT MY AIRBAG WAS PAST ITS WARRANTY AND THAT IT WOULD BE MY RESPONSIBILITY TO FIX IT.  AN AIRBAG IS A LIFESAVING SAFETY COMPONENT, AND IT SEEMS TO ME TO BE THE RESPONSIBILITY OF THE CAR MANUFACTURER TO SEE THAT THE DRIVERS OF THEIR VEHICLES ARE SAFE.  AN AIRBAG THAT IS NOT FUNCTIONING PROPERLY IS IN VIOLATION OF SAFETY STANDARD 201, ACCORDING TO THE NHTSA.  I HAVE READ ONLINE HOW TOYOTA, HONDA, AND CHRYSLER HAVE RECALLED HUNDREDS OF THOUSANDS OF THEIR VEHICLES DUE TO FAULTY AIRBAGS.  I HAVE ALSO SEEN THAT THESE VEHICLES HAVE LIFETIME WARRANTEES ON THEIR AIRBAGS.  SO, WITH THAT, SHOULDN'T VOLKSWAGEN BE RESPONSIBLE TO ENSURE THAT MY VEHICLE IS UP TO SAFETY STANDARDS?  THERE HAS BEEN NO ACCIDENT AT THIS POINT, HOWEVER, IF THERE WAS, I COULD LOSE MY LIFE, AND I AM A SINGLE MOTHER OF TWO SMALL CHILDREN.  THANK YOU FOR YOUR CONCERN!  *TR",
        "vin": "3VWRM81K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692721,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE FRONT AND REAR DOORS DON'T LOCK. THERE IS NO OPTION TO MANUALLY LOCK IT, THE ELECTRONIC IGNITION HAS MALFUNCTIONED AND THERE IS NO WAY TO LOCK THESE DOORS. THERE IS RISK OF THE DOORS FLINGING OPEN IN CASE OF ACCIDENT ESPECIALLY WITH A CHILD SITTING IN THE REAR SEAT.  *TR",
        "vin": "3VWJZ71K08M"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "03/05/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692387,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ENTERING A PARKING LOT, PARKING SPACE, AFTER STOPPING COMPLETELY, THE CAR WOULD NOT MOVE WHEN ACCELERATOR WAS LIGHTLY DEPRESSED, THERE WAS A 1 TO 3 SECOND DELAY, AND THEN THE CAR LUNGED FORWARD CRASHING INTO THE OPPOSING PARKED VEHICLE, DAMAGING THE FRONTS OF BOTH VEHICLES.   THIS HESITATION WAS NOTED ONCE BEFORE AT ABOUT 3800 MILES WHILE ENTERING A HIGHWAY FROM A STOP.  AGAIN, THE HESITATION WAS FOLLOWED BY A SUDDEN LUNGE.  SELLING VW DEALER SAID IT SOUNDED LIKE A DSG TRANS PROBLEM, BRING BACK FPR EVALUATION AFTER ITS REPAIRED.  THIS UNEXPECTED SURGE PROBLEM IS THE DIRECT CAUSE OF THE ACCIDENT.  THERE SHOULD BE A SAFETY RECALL.  NOTE: WHILE THIS VW JETTA IS 7 YRS OLD, IT IS NOT DRIVEN OFTEN AS CAN BE SEEN BY LESS THAN 500-800 MILES PER YEAR.   *TR",
        "vin": "3VWJM71K98M"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2015",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692042,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKS HARSHLY WHEN DOWN SHIFTING FROM 3RD TO 2ND & 2ND TO 1ST GEARS.  USUALLY RIGHT AROUND 20MPH TO 15MPH.  *TR",
        "vin": "3VWRZ71K88M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2008 JETTA PURCHASED NEW IN DECEMBER 2007.  IT CURRENTLY HAS 58,000 MILES ON IT. WE HAVE HAD NUMEROUS SAFETY ISSUES WITH IT.  A CRASH SENSOR WENT OUT AT ABOUT 50K. THIS COST OVER $500 TO FIX AT THE LOCAL DEALER. RECENTLY THE AIRBAG LIGHT CAME ON AND SHOWS CODE 01221 WHICH IS DRIVERS SIDE AIRBAG.  THE DEALER SAID THE AIRBAG SYSTEM IS PROBABLY NOT FUNCTIONING WITH THE LIGHT ON.  I'D GUESS THIS IS ANOTHER EXPENSIVE FIX. THIS CAR HAS NEVER BEEN IN AN ACCIDENT, SUBMERGED, OR HAD A SPILL IN IT.  IT SEEMS RIDICULOUS THAT  THESE TYPE OF ISSUES WOULD BE OCCURRING IN A VEHICLE WITH THIS TYPE OF MILEAGE.   *TR",
        "vin": "3VWRM71K48M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672472,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON. VOLKSWAGEN INDICATES THAT AIRBAGS ARE NOT FUNCTIONING. NO INCIDENT CONTRIBUTED TO THIS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2015",
        "dateOfIncident": "11/22/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669507,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EMMISIONS  LIGHT ON- NEVER RECEIVED ANY RECALL NOTICES FOR VW 2008 JETTA GLI/ EMMISION LIGHT ON/IGNIATION TO START HESITATION PLEASE TELL ME ALL RECALLS ON VW 2008 JETTA GLI.        CAN I TAKE MY CAR TO MY LOCAL MECHANIC FOR RECALLS?  THANK YOU   *JS",
        "vin": "3VWDJ71K28M"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641765,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF WOULD OPEN AND CLOSE AT RANDOM, HAD THAT FIXED WHILE UNDER WARRANTY. NOW THE REAR DRIVERS SIDE DOOR WILL NOT LOCK AND THE ALARM WILL NOT TURN ON. THIS IS A SAFETY ISSUE AS WELL AS A THEFT ISSUE AND APPEARS ITS PRETTY COMMON DUE TO PREVIOUS VW THREADS. AT $400 REPAIR COSTS AND VW KNOWING THIS IS AN ISSUE, I FEEL THIS SHOULD BE ELEVATED TO A RECALL STATUS AND NOT CHARGEABLE TO OWNERS. PLEASE HELP ME/US, I CANT AFFORD THE REPAIR!!!  *TR",
        "vin": "3VWRZ81K98M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "10/15/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640806,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2011, THE RIGHT REAR DOOR STOPPED LOCKING.  WHEN I WOULD TRY TO LOCK THE DOOR BOTH WITH THE INTERNAL LOCK SWITCH AND THE FOB, THE DOOR WOULD NOT LOCK.  IT ALSO WOULD NOT CHIRP TO LET ME KNOW THAT ALL THE DOORS WERE LOCKED AND THE ALARM WAS SET.  LOCKING THE DOOR WITH THE FOB DOES SET THE ALARM, HOWEVER YOU CAN OPEN THE REAR DOOR AND THE ALARM GOES OFF.  IN SEPTEMBER OF 2014 THE LEFT REAR DOOR STOPPED LOCKING AS WELL...IT HAS THE EXACT SAME ISSUES AS THE RIGHT REAR DOOR NOT LOCKING...HOWEVER, IT IS SO FAR SOMEWHAT INTERMITTENT AND SOMETIMES WILL NOT OPEN AT ALL!  *TR",
        "vin": "3VWRM71K38M"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10633531,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAR HIT ME WHEN I WAS STOP TRYING TO MAKE A LEFT HAND TURN. THEY HIT ME ON THE LEFT FRONT CORNER OF MY CAR . TOOK OUT MY FRONT END. MY AIR BAGS DID NOT GO OFF.  *TR",
        "vin": "3VWRZ71K98M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631686,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR IN TO HAVE OIL CHANGED AND TO HAVE MY AC LOOKED AT DUE TO STRANGE SMELL COMING FROM VENTS.  PER DEALERSHIP REQUEST THEY STATED I SHOULD HAVE THE AC FLUSHED.  I LEFT MY CAR THERE WITHIN 30 MINUTES OF DROPPING IT OFF THE DEALERSHIP CALLED ME TO TELL ME MY CAR DIED.  THEY HAD HOOKED IT UP TO FLUSH THE AC AND THE ENGINE DIED.  UPON THEIR INVESTIGATION A COMPRESSION TEST WAS PERFORMED AND IT WAS DETERMINED CYLINDERS 1,2,3 AND 5 SHOWED ZERO COMPRESSION WHILE 4 SHOWED 80PSI. THEY ARE STATING DUE TO IMPROPER CAM TIMING.  FURTHER INVESTIGATION SHOWED THE SECURING BOLT ON THE INTAKE CAMSHAFT WAS LOOSE. IT IS NOW RECOMMENDED TO REPLACE THE CYLINDER HEAD AND RETIME THE CAMSHAFT TO THE CRANKSHAFT.      MY CAR DID NOT SHOW ANY ISSUES LEADING UP TO THE OIL CHANGE, NO WARNING LIGHTS NOTHING.  CLEARLY I SHOULD HAVE HAD SOME SORT OF WARNING SIGNS.  *TR",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597685,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA.  WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE STALLED.  THE CONTACT STEERED THE VEHICLE TO THE SIDE OF THE ROAD AND WAS ABLE TO RESTART THE VEHICLE.  THE FAILURE RECURRED FOUR TIMES IN FIVE DAYS.  THE DEALER STATED THAT THE ELECTRONIC COMPUTER MACHINE NEEDED TO BE REPLACED.  THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED.  THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "3VWJM71K28M"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597230,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR CENTER SEAT BELT IS LOCKED AND WILL NOT RELEASE. THE VEHICLE WAS NOT IN AN ACCIDENT AND NOW THE VEHICLE CANNOT SAFETY CARRY 5 PASSENGERS. I AM SURE THIS IS A SAFETY ISSUE AND NEEDS TO BE ADDRESSED SINCE THE SAFETY SYSTEM SHOULD NEVER FAIL FOR ANY REASON.  *TR",
        "vin": "3VWRM71K38M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593056,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT WHEN THE A/C WAS OPERATED, THERE WAS A STRONG ODOR EMITTED FROM THE VENTS. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THAT THE EVAPORATOR COIL NEEDED TO BE CLEANED. THE FAILURE MILEAGE WAS 59,000 AND THE CURRENT MILEAGE WAS 66,000.",
        "vin": "3VWRM71K98M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/04/2014",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586454,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT LOCKED INSIDE THE CAR ON A HOT DAY WITH MY KID! I SAT IN THE BACK TO PLAY WITH HIM AND KEEP HIM COMPANY. THE DOOR CLOSED AND IT WOULD NOT UNLOCK NO MATTER HOW MANY TIMES I WOULD PULL ON THE LEVER. I WAS PINCHED BETWEEN THE CHILD SEAT, THE DRIVER'S SEAT (I KEEP IT PULLED BACK QUITE A BIT) AND THE DOOR. I COULD BARELY MOVE. MY WIFE HAD TO UNLOCK THE DOOR FROM THE OUTSIDE. THE DOOR LOCK/LATCH MECHANISM HAS (SINCE THIS INCIDENT) FAILED ON BOTH REAR DOORS. BOTH!!! WE CAN NO LONGER LOCK THE CAR WITHOUT SPENDING 10-15 MINUTES OPENING, CLOSING, WORKING THE REMOTE ETC, UNTIL IT FINALLY PRODUCES THE DESIRED BEEP WITH THE CAR BEING ACTUALLY LOCKED. THE DOOR WOULD CLOSE, THE ALARM WOULD BE ACTIVATED BUT THE REAR DOOR (PASSENGER SIDE) WOULD REMAIN UNLOCKED. I PULL ON THE HANDLE, THE DOOR OPENS AND THE ALARM GOES OFF. WE ARE ALMOST AT THE POINT WHERE WE MIGHT HAVE TO TAKE THE CHILD OUT OF THE CAR VIA THE FRONT DOORS. I AM NOT EVEN TALKING ABOUT THE CAR PROBABLY GETTING STOLEN OVER THIS. THIS IS A SERIOUS CHILD HAZARD! THERE ARE DOZENS OF THREADS ON VW FORUMS ABOUT THESE MECHANISMS FAILING EITHER ON:  1. ELECTRICAL HARNESS BEING DAMAGED. OR  2. DOOR LOCK/LATCH NOT ACTIVATING OR DEACTIVATING. OR BOTH    HOW LONG IS VW GOING TO IGNORE THIS MASSIVE PROBLEM. THE DEALERSHIP WANTS $450 IN PARTS AND LABOR FOR 1 DOOR. THAT'S ALMOST A $1000 FOR A PROBLEM THAT IS VERY COMMON. VERY.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "04/03/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, I HEARD SOME BUMPING FROM THE BACK OF THE VEHICLE WHILE DRIVING.  I TOOK THE CAR IN TO GET REPAIRED, AND THEY TOLD ME THAT THE COIL SPRING IN THE RIGHT REAR HAD BROKEN DUE TO CORROSION AND THAT IT NEED TO BE FIXED OR THAT SPRING COULD POP OUT WHILE DRIVING AND CAUSE THE SUSPENSION TO FAIL.  THE VOLKSWAGEN MECHANIC STATED THAT THIS WAS A COMMON PROBLEM WITH THE MODEL.  I HAD THE SPRING REPLACED, BUT I AM CONCERNED THAT THE OTHER SPRING MAY HAVE THE SAME FAILURE WHILE DRIVING.  WITH THE VEHICLE BEING ONLY 5 YEARS OLD, I AM CONCERNED THAT THIS IS A PROBLEM FOR OTHER DRIVERS THAT DO NOT PAY AS CLOSE ATTENTION TO THE SOUNDS THEIR CARS MAKE.  I BELIEVE THIS IS A SAFETY ISSUE THAT SHOULD WARRANT A RECALL.  *TR",
        "vin": "3VWRJ71K18M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MERGING ONTO THE FREEWAY, AS I REACHED 60MPH THE CAR LUNGED AND THE ENGINE BEGAN REVVING OVER 6000RPM. IT FELT LIKE THE CAR WAS STUCK IN 3RD GEAR. THE GEAR/DRIVE MODE DISPLAY LED BEGAN FLASHING CONSTANTLY. THE CAR WOULD NOT SHIFT UP TO A HIGHER GEAR SO I MOVED INTO SLOWER LANES AND KEPT THE CAR AT ABOUT 5000RPM/55MPH UNTIL IT WAS SAFE TO STOP. THE CAR GEARED DOWN AS I DECELERATED BUT APPEARED TO SKIP A GEAR AND LUNGED AT EACH SHIFT. I TRIED SWITCHING BETWEEN DRIVE AND SPORT MODE BUT THERE WAS NO CHANGE. WHEN I FINALLY WAS ABLE TO BRING THE CAR TO A STOP I DISCOVERED THE REVERSE GEAR DID NOT ENGAGE. IT SIMPLY WENT INTO NEUTRAL. I SHUT THE CAR DOWN, WAITED A MINUTE AND STARTED IT AGAIN. IT NO LONGER HAD ANY VISIBLE PROBLEMS OR ERROR MESSAGES. I LATER LEARNED THIS IS A KNOWN ISSUE WITH THE DSG TRANSMISSION AND IS REFERRED TO AS THE 'DSG FLASH OF DEATH'.",
        "vin": "3VWRJ71K48M"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "02/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ON MY VEHICLE ARE FAILING FOR THE THIRD TIME IN 6 YEARS AND THE VEHICLE ONLY HAS 68,000 MILES ON IT.  THE FIRST TIME THEY FAILED, THE CAR WAS BARELY TWO YEARS OLD AND HAD 22,000 MILES ON IT.  THE SECOND TIME THEY FAILED WAS TWO YEARS LATER, AT 40,000 MILES.  THEY ARE NOW FAILING AGAIN.  RESEARCH ON THE INTERNET SHOWS THAT VW HAD DISCOVERED A DESIGN FLAW ON THEIR 2008 JETTA BRAKES THAT WAS CAUSING THIS, BUT NO RECALL OR RESOLUTION HAS EVER BEEN ISSUED.  VW NOW REFUSES TO TAKE RESPONSIBILITY FOR THEIR DEFECTIVE VEHICLE OR TO OFFER ANY ASSISTANCE TO RESOLVE THE PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/26/2014",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10561937,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY SISTER WHICH IS CURRENTLY PREGNANT, WAS DRIVING MY JETTA THE HEATED SEAT OVERHEATED.  THE HEATED SEATS BECAME SO HOT THAT IT BURNED THE SEAT, HER JACKET AND HER SKIN.  SHE RECEIVED 1ST -2ND DEGREE BURNS ON HER BACK.    *TR",
        "vin": "3VWRJ71K78M"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/26/2014",
        "dateOfIncident": "01/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10561569,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED SEAT WARMER ON WHILE DRIVING.  THIRTY MINUTES LATER AFTER ARRIVING AT DESTINATION, FELT LIKE MY LOWER BACK WAS BURNED.  HAD MY WIFE LOOK AT MY BACK.  I HAD WHAT APPEARED TO BE A SECOND TO THIRD DEGREE BURN.  THROUGHOUT THE AFTERNOON, THE BURN BEGAN BLISTERING.  THERE IS AN IMPRINT IN THE SEAT WHICH MATCHES WHERE THE BURNT PART OF MY BACK WAS RESTING AGAINST THE BACK OF THE SEAT.  A BURN MARK (HOLE), A LITTLE LARGER THAN THE SIZE OF A PIN TIP, WAS LEFT IN THE SEAT AND THE FABRIC APPEARS TO BE MELTED AROUND THE HOLE.   *TR",
        "vin": "3VWJM71K88M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/02/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558275,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK PASSENGER SIDE DOOR LOCK QUIT WORKING AND THE DOOR  WON'T LOCK AT ALL.  ANYBODY CAN OPEN THE DOOR AND HURT YOUR CHILD OR STILL THE CAR.   I CALLED THE DEALER HERE IN AUSTIN, TX TODAY, AND THEY TOLD ME THAT IS A VERY COMMON PROBLEMS WITH THE JETTA MODEL AND IT HAS HAPPENED TO HUNDREDS OF COSTUMERS. THE ELECTRIC LOCKS QUIT WORKING.  THIS IS A SAFETY ISSUE AND CLEARLY A MANUFACTURERS DEFECT THAT SHOULD BE A RECALL.  *TR",
        "vin": "3VWJM71K08M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "11/21/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556179,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL CUT-OFF/SURGING WHEN ACCELERATING AND TAPPING NOISE FROM ENGINE. ENGINE IS THROWING ENGINE CODES; A LOSS OF POWER IS PRESENT WHEN ACCELERATING. THIS     OCCURS EVERY TIME I TRY TO ACCELERATE. THIS IS A KNOWN ISSUE WITH THE CAM FOLLOWER AND HIGH PRESSURE FUEL PUMP ON ALL 2.0T FSI MOTORS FROM VW. MY CAM     FOLLOWER HAS A HOLE IN IT (HAVE THE PART) AND THE HIGH PRESSURE FUEL PUMP IS WORN DOWN (HAVE THE PART) BECAUSE IT HAS MADE CONTACT WITH THE CAM LOBE, WHICH     HAS BEEN SCARRED (HAVE THE PART). REPLACEMENT REQUIRES A NEW CAM, HIGH PRESSURE FUEL PUMP, AND CAM FOLLOWER. THE DESIGN HOWEVER WILL REQUIRE CONSTANT     INSPECTION OF THE CAM FOLLOWER TO AVOID MAJOR ENGINE FAILURE. ALL 2.0 T FSI ENGINES WILL EXPERIENCE THIS PROBLEM. VOLKSWAGEN HAS A TSB #2015153 DATED     DECEMBER 16, 2009 THAT WARNS OF THIS PROBLEM UPON CEL LIGHT BEING SHOWN. BUT BY THEN THE DAMAGE WAS DONE, UPON FURTHER INSPECTION IT HAD A HOLE IN THE CAM     FOLLOWER, WITH SEVERE DAMAGE TO THE CAM AND HIGH PRESSURE FUEL PUMP. REPAIR COST WAS OVER $2,000.00.    AFTER RESEARCHING THIS I FOUND OUT THIS IS A COMMON PROBLEM WITH THIS PARTICULAR MOTOR. SO MUCH SO THAT VOA EXTENDED THE WARRANTY TO TEN YEARS AND 100,000     MILES JUST FOR THIS EXACT PROBLEM. UNFORTUNATELY THEY USED VIN NUMBERS AND MY VIN NUMBERS IS AFTER THE CUTOFF POINT EVEN THOUGH IT'S THE EXACT SAME MOTOR WITH   THE EXACT SAME PROBLEM AS THE EARLIER VIN NUMBERED CARS. THEY NEED TO COVER THE AFFECTED MOTOR NUMBERS NOT THE VIN NUMBERS.  *TR",
        "vin": "3VWRJ71K28M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/06/2013",
        "dateOfIncident": "12/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555112,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nexen Tire Corporation",
                "productMake": "NEXEN",
                "productModel": "N5000",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED 4 NEW NEXEN N5000 (225/45R17) TIRES AND HAD THEM INSTALLED ON 10/21/13.  APPROX. 2K MILES ON THE TIRES, AND WE NOTICED A BUBBLE ON THE FRONT DRIVER SIDE TIRE WHERE THE TREAD AND SIDEWALL MEET.  NO SIGNS OF SCRATCHES ON THE SIDEWALL, AND WE ARE NOT AWARE OF ANY IMPACT WITH POTHOLES OR ANYTHING ELSE THAT MIGHT HAVE CAUSED IT.  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/22/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553366,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DOORS DO NOT LOCK, OR UNLOCK, RANDOM OPENING OF SUNROOF AND DOOR LOCK MECHANISM.  *TR",
        "vin": "3VWRM71K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2013",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551660,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED MIRROR TURN SIGNAL AND THE FRONT BUMPER ORANGE ILLUMINATED SAFETY REFLECTOR BOTH ON THE DRIVER'S SIDE OF THE VEHICLE SIMULTANEOUSLY STOPPED WORKING. I'M UNSURE IF THIS IS DUE TO FUSE ISSUES OR COMPUTER RELATED ELECTRICAL ISSUES. A SAFETY PROBLEM IS POSED WHEN THEY'RE NOT WORKING.   *TR",
        "vin": "3VWRM71K88M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545599,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE PASSENGER DOOR(S) WILL NOT RESPOND TO THE KEYLESS ENTRY LOCK OR UNLOCK COMMANDS. THEY CAN ONLY CLOSE AND OPEN MANUALLY. I HAVE READ SEVERAL DIFFERENT FORUMS AND THIS SEEMS TO BE A STANDARD DEFAULT IN MODEL YEARS RANGING FROM 2007 AND ONWARD. THE SUNROOF WILL PERIODICALLY OPEN BY ITSELF AND THE BLINKERS DO NOT FUNCTION PROPERLY (EXAMPLE IS WHEN I FLICK THE BLINKER UP TO MAKE A RIGHT TURN, THE LEFT BLINKER COMES ON INSTEAD). WHY HASN'T THERE BEEN A RECALL TO REPLACE THESE FAULTY, AND LIFE THREATENING, ISSUES?  *JS",
        "vin": "3VWRJ71K28M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2013",
        "dateOfIncident": "07/21/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE BECAME HESITANT TO ACCELERATION ATTEMPTS. THE FAILURE RECURRED INTERMITTENTLY AT SPEEDS BETWEEN 10 AND 50 MPH.  THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE THE TECHNICIAN STATED THAT THE CAMSHAFT, CAMSHAFT FOLLOWER, FUEL PUMP, AND A VALVE WOULD HAVE TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524136,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAM FOLLOWER FAILED RESULTING IN SEVERE ENGINE HESITATION UPON ACCELERATION MAKING THE CAR UNSAFE TO OPERATE.  THE METAL THE PART IT IS MADE FROM IS NOT STRONG ENOUGH. THIS CAUSES IT TO WEAR THROUGH AND BREAK, WHICH IN TURN CAUSES SEVERE DAMAGE TO THE CAMSHAFT AND FUEL PUMP.  AS A RESULT, ALL THREE PARTS MUST BE REPLACED AT GREAT EXPENSE.  VOLKSWAGEN HAS CHOSEN TO COVER THIS REPAIR ON SOME BUT NOT ALL VEHICLES WITH THE IDENTICAL PROBLEM.  THEY STATE THAT THEY ARE CHOOSING WHICH VEHICLES TO COVER BASED ON VIN # ALONE AND NOT ALL VEHICLES WITH THE IDENTICAL PROBLEM.  THE FAILED PART EXTENDS BEYOND THEIR VIN # METRIC.  THEY HAVE ACKNOWLEDGED THE PROBLEM AND HAVE CHOSEN TO COVER THE REPAIR ON SOME, BUT NOT ALL VEHICLES AFFECTED.  THIS IS UNFAIR TO THOSE CONSUMERS STUCK WITH A BILL, WHILE OTHERS WITH THE IDENTICAL PROBLEM HAVE IT COVERED.  *TR",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/19/2013",
        "dateOfIncident": "06/04/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520618,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD THE CAR IN THE BODY SHOP FOR A REPAIR! DENT IN THE REAR CORNER PANEL THE AIR BAG LIGHT CAME ON A COUPLE DAYS LATER WE TOOK THE CAR BACK TO THE BODY SHOP THEY TOOK IT THE COLUMBUS GA VW DEALER AND WERE TOLD THE CLOCK SPRING IN THE STEERING COLUMN WAS BAD AND THEY WERE GETTING QUITE A FEW CARS BACK FOR THE SAME PROBLEM.WELL IT TURNS OUT ALL YOUR ELECTRONICS HORN, RADIO,CRUISE CONTROL, AIR BAGS,DASH LIGHTS,ALL THE WIRES FOR THESE ANY MANY MORE ITEMS TRAVEL THRU THE CLOCK SPRING! THERE HAVING ALOT OF PROBLEMS WITH THIS ITEM WHY IS THERE NO RECALL? THEY HAD A RECALL ON THERE 2011 JETTA HONK YOUR HORN AND YOUR MOTOR MIGHT TURN OFF! THE CAUSE CLOCK SPRING! (SO THE  BODY SHOP WAS TOLD NOTHING THEY DID CAUSED IT TO GO BAD THAT THEY JUST GO BAD). THE CAR IS FIVE YEARS OLD THEY DON'T JUST GO BAD!!!! BAD DESIGN MAYBE? MY CAR IS OUT OF WARRANTY AND HAVE BEEN TOLD THE AIRBAGS WILL NOT DEPLOY???? SAFETY FIRST!! OH YA AND THE HORN IS NOT WORKING! I GUESS THE CRUISE CONTROL WILL BE NEXT!    THANK YOU FOR YOUR TIME........[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "3VWRM71K18M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "04/05/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513073,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS THE INTAKE MANIFOLD AND THE INTAKE VALVES STUCK FROM EXCESSIVE CARBON BUILDUP.  IT WAS REPLACED IN FEB 2011 AND NOW NEEDS REPLACING AGAIN.  PROBLEM IS, NOW I'M OUT OF THE WARRANTY PERIOD AND THE DEALER IS SAYING I WOULD HAVE TO PAY FOR THIS MYSELF.  THEY ALSO ADDED THAT THERE WAS ONLY A 1 YEAR WARRANTY FOR THE FIRST TIME THIS WAS REPLACED IN FEB 2011.  THERE HAVE BEEN MANY COMPLAINTS ON THE INTAKE MANIFOLD AND NO RECALL FROM VOLKSWAGEN.  IF THE DECARBONIZATION HAD BEEN DONE WHEN THE INTAKE MANIFOLD HAD BEEN REPLACED THE FIRST TIME, THIS WOULD HAVE NEVER HAPPENED AGAIN.  *TR",
        "vin": "3VWRA71K58M"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/16/2013",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512420,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENTLY THIS CAR WAS IN A SERIOUS FRONT END ACCIDENT THAT WAS NOT REPAIRED PROPERLY. I PURCHASED THIS CAR FROM CARMAX. I WAS UNAWARE OF THE PREVIOUS ACCIDENT. IT WAS ONLY UNTIL I HAD MY WINDSHIELD REPLACED AFTER TAKING A STONE TO IT THAT MANY PROBLEMS WERE SHOWN TO ME INCLUDING PARTS MISSING, BENT RIM, FRAUDULENT REPRESENTATION BY CAR MAX.  *TR",
        "vin": "3VWHM71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/15/2013",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503128,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR LOCK ACTUATOR FAILED TO LOCK OR UNLOCK THE DOOR, ALARM HORN FAILS TO SOUND WHEN ALARM IS ACTIVATED.  REAR DRIVER'S DOOR LOCK ACTUATOR FAILED TO LOCK OR UNLOCK THE DOOR.  THE REAR DRIVERS DOOR DOESN'T HAVE AN EXTERNAL KEY HOLE TO UNLOCK DOOR AND THE ONLY WAY TO OPEN THE DOOR IS FROM THE INSIDE.  IN THE EVENT OF AN ACCIDENT WITH A CHILD IN A CHILD SAFETY SEAT,  THIS COULD RESULT IN A DELAY OF REMOVING THE CHILD FROM A POTENTIALLY DANGEROUS SITUATION.  THE VOLKSWAGEN MANUFACTURER/DEALERSHIP CHARGES BETWEEN $450 TO $550 PER ACTUATOR.  AFTER AN EXTENSIVE SEARCH OF THE INTERNET AND NUMEROUS FORUMS, THIS ACTUATOR REPAIR IS MORE COMMON THAN VOLKSWAGEN WOULD LIKE ANYONE TO BELIEVE.  THIS PART IS KEPT IN STOCK AT DEALERSHIPS AND THEY ARE VAGUE WHEN QUESTIONED ABOUT THE FREQUENCY OF REPAIR.  THIS APPEARS TO BE MORE A PROBLEM WITH NEWER MODELS.  I'VE OWNED A USED 2003 VW JETTA FOR OVER 5 YEARS NOW AND HAVEN'T NEEDED AN ACTUATOR YET.   *TR",
        "vin": "3VWJM71K08M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501896,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BY THE VW DEALERSHIP THAT THERE IS KNOWN DEFECT WITH THE MOTOR THAT IS PART OF THE AIR INTAKE MANIFOLD WHICH CAUSES THE VALVES TO STICK AND NOT ALLOW THE PROPER MIXTURE OF AIR/GAS, CAUSING THE ENGINE TO MISFIRE....AT TIMES, THE MISFIRE CAN BE INTENSE AND COULD POSSIBLY CAUSE SOMEONE TO LOSE CONTROL OF THEIR VEHICLE (\"BUCKING SENSATION\").  I FOUND MANY THREADS ON THE INTERNET REGARDING THE VW JETTA (2.0T ENGINE) AND A PROBLEM WITH THE AIR INTAKE MANIFOLD, BUT YET, VW HAS NEVER ISSUED A RECALL FOR THE PROBLEM.  *TR",
        "vin": "3VWRA71K18M"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/27/2013",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500687,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ONE MORNING AND IT STARTED TO SMELL LIKE SOMETHING WAS BURNING. I THOUGHT MAYBE IT WAS JUST A WEIRD SMELL IN MY VENTS BUT WITHIN 10 MINUTES OF DRIVING A CLOUD OF SMOKE FILED THE DRIVER SIDE OF MY CAR. LUCKILY I WAS NOT ON THE HIGHWAY YET AND I WAS ABLE TO PULL OVER AND SHUT OFF THE CAR. NOT KNOWING WHERE THE SMOKE CAME FROM I IMMEDIATELY GOT OUT OF THE CAR. IT WHEN THEN THAT I LOOKED DOWN AND SAW THE SOURCE OF THE SMOKE, THERE WAS A QUARTER SIZE HOLE IN MY DRIVER SEAT. I HAD BEEN DRIVING WITH THE SEAT HEATER ON AND IT CAUGHT FIRE. LUCKILY I WAS NOT INJURED AND WAS ABLE TO QUICKLY GET OFF THE ROAD AND DISCOVER THE ISSUE HOWEVER I HAVE READ OTHER COMPLAINTS OF SIMILAR EVENTS AND YET NO RECALL.  *TR",
        "vin": "3VWSE69MX4M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/15/2012",
        "dateOfIncident": "11/12/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484768,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL400-02",
                "productYear": "9999",
                "size": "P205/55R16",
                "type": "Tire"
            }
        ],
        "summary": "SIDEWALL TEARING APART IN TWO SECTIONS AS WELL AS CENTER TREADS CONTAIN SEVERE CRACKING.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2012",
        "dateOfIncident": "05/13/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473186,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 08 JETTA SE STALL W/O ANY WARNING, USUALLY AFTER 30 MINUTES OF DRIVING AND SOMETIME AT STOPLIGHTS.  *TR",
        "vin": "3VWRM81K28M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "07/18/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466520,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 JETTA AND I STARTED EXPERIENCING PROBLEMS WITH 1 DOOR.  MY CAR WAS STILL UNDER WARRANTY AND THE LOCK WAS REPLACED AT THE DEALERSHIP.  THEN ONLY MONTHS LATER I STARTED HAVING SIMILAR PROBLEMS RANDOMLY (THE LOCK WOULD WORK SOME TIMES BUT NOT OTHERS).  EVERYTIME I STOPPED AT THE DEALERSHIP TO HAVE IT FIXED THE LOCK WORKED- THEREFORE THEY COULD NOT DIAGNOSE WHICH DOOR HAD A PROBLEM.  THE LOCK FAILED EVERYTIME AND WHEN I RETURNED TO THE DEALERSHIP, THE CAR WAS NO LONGER UNDER WARRANTY.  THE DEALERSHIP SAID THE LOCKS CAN GO BAD AND QUOTED ME A COST OF $400 TO REPAIR.  AFTER HAVING ONE DOOR \"FIXED\" ONLY TO HAVE ANOTHER LOCK FAIL AFTER MONTHS LATER SEEMS EXCESSIVE.  AT THIS POINT I HAVE NOT REPLACED THE SECOND LOCK.  IT IS FRUSTRATING TO SEE A CAR WITH FOUR DOORS HAVE PROBLEM WITH TWO OF THE DOORS!  AT A COST OF $400 TO REPLACE I FELT THERE MUST BE A LARGER ISSUE THAT NEEDS ATTENTION.  WE KEEP OUR CAR IN THE GARAGE, THE DOOR THAT IS NOW IN NEED OF REPAIR IS RARELY USED.    THIS IS A SERIOUS ISSUE AS THE LOCKS SERVE AS THE FIRST LINE OF DEFENSE IN PERSONAL PROTECTION AND ANTI-THEFT.  AFTER SEARCHING ON LINE AND SEEING OTHERS WITH SIMILAR ISSUES, I FELT IT WAS IMPORTANT TO REPORT THIS.  I TRUST YOU WILL PROMPTLY FOLLOW UP AND ASSIST ME IN RESOLVING THIS ISSUE.  *TR",
        "vin": "3VWRM71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463154,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S OWN KEYS COULD NOT BE INSERTED INTO THE IGNITION. THE DUST CAP INSIDE THE IGNITION CYLINDER/ SWITCH WAS BLOCKING THE KEY FROM ENTERING. THE STEERING WHEEL WAS LOCKED BECAUSE OF THE IGNITION KEY NOT ABLE TO ENTER THE IGNITION SWITCH.  ALSO THE TRANSMISSION COULD NOT BE MOVED FROM PARKING BECAUSE OF THE ABOVE REASON.  AS A RESULT, WE WERE ALL STRANDED ON THE ROAD FOR SEVERAL HOURS BECAUSE THE CAR KEYS COULD NOT BE INSERTED TO THE IGNITION. HAD TO TOW THE CAR TO VW DEALERSHIP AND THE DEALERS WANTED TO CHANGE THE ENTIRE IGNITION SWITCH.  LATER FOUND OUT THAT IT CAN HAPPEN TO ANY VW JETTA BECAUSE OF THE WAY THE CYLINDER HAS BEEN DESIGNED BY VW AND VWOA DOES NOT WANT TO MAKE ANY RECALL AND CHANGE THIS DESIGN.  PLEASE NOTE THAT THE CAR IS ONLY 4 YEARS OLD, USED ONLY BY ME VERY GENTLY, AND THE IGNITION SWITCH DESIGN IS FAULTY.  *JB",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462972,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT THE KEY WOULD NOT INSERT INTO THE IGNITION AND THE VEHICLE WOULD NOT START. THE VEHICLE WAS TAKEN TO THE DEALER FOR AN INSPECTION AND THEY STATED THAT THE CYLINDER LOCK WAS BLOCKED AND THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THEY TOOK A COMPLAINT. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "3VWRM71K58M"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/10/2012",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461151,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 WOLFSBURG EDITION JETTA: STARTED EXPERIENCING ISSUES WITH ONE DOOR LOCK AND THE DEALER TOLD ME THAT THE LOCKS CAN GO BAD AND NEED TO BE REPLACED, COSTING $450 FOR THE REPLACEMENT.  AFTER HAVING THIS FIXED, ONLY TWO MONTHS LATER, ANOTHER LOCK STARTED HAVING AN ISSUE.  I HAVE NOT YET REPLACED THIS LOCK, BUT NOW A THIRD LOCK IS STARTING TO EXPERIENCE PROBLEMS ON THE SAME VEHICLE.    AT THIS RATE, I EXPECT THE FOURTH AND FINAL LOCK TO START HAVING ISSUES.  AT $450 FOR EACH LOCK REPLACEMENT, THIS SEEMS EXCESSIVE.  ON A SINGLE CAR THAT IS KEPT IN A GARAGE, WITH ONLY TWO ADULTS (NO CHILDREN) USING THE FRONT DOORS, IT DOESN'T MAKE SENSE HOW THREE DOORS CAN EXPERIENCE LOCK ISSUES, UNLESS THERE WAS SOME LARGER ISSUE WITH THE LOCKS.  THIS IS A SERIOUS ISSUE AS THE LOCKS SERVE AS THE FIRST LINE OF DEFENSE IN ANTI-THEFT.  AFTER SEARCHING ONLINE AND SEEING OTHERS WITH SIMILAR ISSUES, I DECIDED TO REPORT THIS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2012",
        "dateOfIncident": "03/26/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453356,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE (2008 VW GLI) SHOULD BE COVERED UNDER SB-69-11-01 AS WELL. THE PASSENGER SIDE AIRBAG WARNING LIGHT HAS COME UP. VW JETTA GLI IS A SPECIAL MODEL BASED ON THE VW JETTA 2008. I THINK THERE IS AN OVERSIGHT FOR NOT PLACING THIS SAME TYPE OF VEHICLE UNDER SB-69-11-01.    GLI IS ESSENTIAL A SPORTS MODEL UPGRADE OF JETTA MODEL, WHY ISN'T THIS VEHICLE COVERED BY THE SAME TSB?    MAKE / MODELS: MODEL/BUILD YEARS:  VOLKSWAGEN / EOS 2007-2008  VOLKSWAGEN / GTI 2006-2008  VOLKSWAGEN / JETTA 2005-2008  VOLKSWAGEN / NEW BEETLE 2004-2008  VOLKSWAGEN / NEW BEETLE CONVERTIBLE 2004-2008  VOLKSWAGEN / PASSAT 2006-2008  VOLKSWAGEN / PASSAT WAGON 2006-2008  VOLKSWAGEN / R32 2006-2008  VOLKSWAGEN / RABBIT 2006-2008  SERVICE BULLETIN NUMBER: SB-69-11-01  NHTSA ITEM NUMBER: 10038665  SUMMARY:  VOLKSWAGEN: AIR BAG LIGHT IS ON WITH AN INTERNAL TROUBLE CODE STORED. THIS COULD BE A WIRING PROBLEM. *RM",
        "vin": "3VWDJ71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/18/2012",
        "dateOfIncident": "11/16/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED APPROXIMATELY SEPTEMBER 2008, AND TO DATE HAS EXPERIENCED FIVE (5) FAILURES OF THE ELECTRONIC DOOR LOCKING/UNLOCKING MECHANISMS OF THREE OF THE FOUR DOORS OF THE VEHICLE AND IN SOME CASE MULTIPLE FAILURES.  I AM CURRENTLY EXPERIENCING FAILURE NUMBER SIX (6).    THE FAILURE OF THE LOCKING/UNLOCKING MECHANISMS IS A SAFETY ISSUE AS THESE FAILURE HAVE AT TIME PREVENTED BEING ABLE TO EXIT THE VEHICLE AND IN THE CASE OF AN EMERGENCY IT IS A SERIOUS THREAT TO MY SAFETY.  ADDITIONALLY, I'M UNABLE TO LOCK THE VEHICLE WHENEVER I GO ANYWHERE THUS PUTTING ANYTHING IN THE VEHICLE AT RISK OF LOSS FROM THEFT.    THE DEALER'S SOLUTION IS TO REPLACE THE LOCKING MECHANISMS AS THEY FAIL AND AS THE VEHICLE IS NO LONGER UNDER WARRANTY IT'S COST ROUGHLY $370.00 PER INCIDENT. BELOW IS A SUMMARY OF THE FAILURES EXPERIENCED THUS FAR.  I HAVE COPIES OF THE SERVICE RECORDS AVAILABLE.      2008 JETTA DOOR LOCK FAILURES:       DATE   RO #                   ITEM          RESPONSIBLE PARTYCOST    11/16/09  116190DRIVERS SIDE FRONT DOOR LOCK REPLACED   WARRANTY  03/02/10  118212LEFT REAR DOOR LOCK REPLACED                WARRANTY  08/03/10  121525RIGHT REAR DOOR LOCK DIAGNOSED            WARRANTY  08/06/10  121609RIGHT REAR DOOR LOCK REPLACED              WARRANTY  06/01/11  129079LEFT REAR DOOR LOCK DIAGNOSIS               CUSTOMER PAID          $69.00   06/01/11  129247LEFT REAR DOOR LOCK REPLACED                CUSTOMER PAID        $303.09   10/18/11  132986DRIVERS SIDE FRONT DOOR LOCK REPLACED  CUSTOMER PAID        $367.25   03/15/12                RIGHT REAR DOOR LOCK BEGINNING TO FAIL.      DOOR LOCK FAILUREOCCURANCES    DRIVERS SIDE FRONT             2  LEFT REAR                          2  RIGHT REAR                        2  *TR",
        "vin": "3VWRM71K28M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447795,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10 FEBRUARY 2012, AT APPROXIMATELY 7:45 AM, I WAS DRIVING ON INTERSTATE 395 NORTH , WASHINGTON, DC.  IN THE HIGH OCCUPANCY VEHICLE (HOV) LANE WHEN I HEARD NOISE FROM THE ENGINE AND I SAW WHITE SMOKE COMING FROM UNDERNEATH THE HOOD OF THE ENGINE.  I CHECKED THE INDICATOR LIGHTS AND NO LIGHTS WERE ON THAT INDICATED THERE WAS A PROBLEMS. AT THE STOP SIGN NEAR THE ENTRANCE NEAR THE NAVY ANNEX OFF COLOMBIA PIKE, I NOTICED A SMELL SIMILAR TO BURNING OIL.  FIRST, THE VEHICLE WAS CHECKED BY JACK TAYLOR TOYOTA IN ALEXANDRIA, VA.   TOYOTA STATED THEY WERE NOT AWARE OF A VOLKSWAGEN DEALERSHIP IN THE AREA AND INDICATED THEY HAD THE ABILITY TO IDENTIFY ANY PROBLEMS WITH THE VEHICLE BY CONDUCTING A DIAGNOSTIC TEST.    ACCORDING TO THE DIAGNOSTIC TEST, THE  REAR MAIN SEAL, WHICH IS LOCATED AT THE REAR OF THE ENGINE BETWEEN THE ENGINE AND THE FLYWHEEL OF FLEX PLATE/TORQUE CONVERTER WAS LEAKING TRANSMISSION FLUID.  I LEARNED LATER VIA AN INTERNET SEARCH THERE WAS A VOLKSWAGEN DEALERSHIP APPROXIMATELY 10 MILES FROM THE TOYOTA DEALERSHIP.  I CONSULTED WITH A TECHNICIAN AT VOLKSWAGEN WHO INDICATED THE PROBLEM DESCRIBED BY TOYOTA WAS CONFUSING AND WAS POSSIBLY AN ERROR WAS ASKED  TO BRING THE VEHICLE IN FOR A CERTIFIED VOLKSWAGEN TECHNICIAN TO INSPECT FURTHER. PRESENTLY, THE CAR IS AT THE VOLKSWAGEN DEALERSHIP IN ALEXANDRIA, VA FOR FURTHER DIAGNOSTIC TESTING AND REPAIRS. THEY CONFIRMED THE REAR MAIN SEAL WAS LEAKING TRANSMISSION FLUID AND ORDERED THE PART WHICH WAS PROJECTED TO ARRIVE ON OR ABOUT 13 FEBRUARY 2012. THE CAR WAS SERVICED FOR 50K TUNE UP AT VOLKSWAGEN IN SPRINGFIELD, VA AND THIS PROBLEMS WAS NOT IDENTIFIED.  THIS IS THE FIRST INCIDENT IN-WHICH I HAVE ENCOUNTERED TRANSMISSION PROBLEMS WITH THIS CAR.  *TR",
        "vin": "3VWJZ71K68M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/11/2012",
        "dateOfIncident": "01/09/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT THE REAR DRIVER SIDE BRAKE WAS DEFECTIVE. THE CONTACT INSPECTED THE VEHICLE AND FOUND THAT THE REAR DRIVER SIDE BRAKE PADS WERE WORN PREMATURELY. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 38,000.    UPDATED 07/06/12 *BF  UPDATED 07/12/12.*JB",
        "vin": "3VWRL71K89M"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2012",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442308,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I FIRST TOOK MY CAR TO THE DEALERSHIP JUNE 1ST FOR AN OBVIOUS RATTLING NOISE IN BETWEEN MY FRONT TIRES. ON JUNE 15TH BACK TO THE DEALERSHIP FOR THEM TO REPLACE MY BUSHINGS BUT PROBLEM STILL EXISTED SO THEY ORDERED PINS FOR CALIPER BRACKET. IN  JULY AFTER REPLACING STRUTS THE PROBLEM STILL EXISTED. AUG 31ST THEY REPLACED THE SWAY BAR AND DECLARED THE PROBLEM WAS RESOLVED. WHEN I GOT IN MY CAR THE PROBLEM STILL EXISTED AND THEY HAD LEFT MY CAR OUT OF ALIGNMENT IT WAS ALMOST IMPOSSIBLE TO DRIVE.  SEPT 14TH I RETURNED BACK TO THE DEALERSHIP FOR THE SAME PROBLEM.  THEY REPLACED BOTH SWAY BARS. THE PROBLEM WAS FINALLY RESOLVED AFTER LOSING MY CAR FOR 6 FULL DAYS, HOWEVER MY BRAKE LIGHTS WERE ON. THEY ASSURED ME IT WAS JUST A COINCIDENCE, THE SERVICE GUY DISCOVERED THE TECH HAD FORGOTTEN TO CONNECT MY BRAKES BACK. I DID NOT FILE A FORMAL COMPLAINT AT THIS TIME BECAUSE I WAS SO RELIEVED THEY HAD FINALLY FIXED MY SUSPENSION ISSUE.  IVE HAD TO BUY 2 BRAND NEW SETS OF TIRES SINCE JUNE BECAUSE OF ALL THE WARE ON MY TIRES FROM MY MESSED UP SUSPENSION. TODAY, JAN 3RD 2012 MY CAR IS BACK IN THE SHOP YET AGAIN.  THIS TIME FOR A REAR PASSANGER SIDE DOOR LOCK THAT HAD BEEN SET ON CHILD LOCK WILL NO LONGER LOCK.  ORDERED THE PART, SINCE MY CAR IS NO LONGER UNDER WARRANTY THE PART WITH LABOR 360. IN THE MEANTINE THE TECH DISCOVERED AN OIL LEAK.  THE DEALERSHIP IS NOW SAYING MY VACCUM PUMP IS LEAKING AND IS NO LONGER UNDER WARRANTY FOR THEM TO FIX IT.  THEIR QUOTE 960.  I CHECKED ON THE PART ITS 257 NEW.  EVEN THOUGH I DIDN'T FILE A COMPLAINT OR COST THEM MONEY WHEN THEY FORGOT TO CONNECT MY BRAKES BAKE THEY ARE GOING TO CHARGE ME 700 DOLLARS IN LABOR.  MY CAR IS ONLY A 2008 AND HAS BEEN IN THE SHOP MORE IN ONE YEAR THAN ANY OF MY OTHER CARS COMBINED. IT IS DAILY A SAFETY HAZARD BECAUSE OF THE LINGERING OF FIXING MY CAR RIGHT THE VERY FIRST DAY I TOOK IT TO THE DEALERSHIP JUNE OF 2010.  *TR",
        "vin": "3VWJM71K48M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2011",
        "dateOfIncident": "02/07/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436508,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BELIEVE IT IS THE AIRBAG SENSOR THAT IS MALFUNCTIONING. HAVE HAD IT RESET ABOUT FIVE TIMES AND WITHIN A FIVE TO SIX WEEKS, THE AIRBAG LIGHT GOES ON AGAIN. THIS IS  NOT THE FIRST TIME THE VW HAS HAD ISSUES WITH ELECTRICAL COMPONENTS. OF COURSE, THE WARRANTY IS OVER.  *TR",
        "vin": "3VWRZ71K48M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2011",
        "dateOfIncident": "10/30/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433740,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSES MOTIVE FORCE, SHIFTS INTO NEUTRAL WHILE IN MOTION. SHIFT INDICATOR LIGHTS ON DASH FLASH AND GREEN \"APPLY BRAKE\" ICON LIGHTS UP.  *TR",
        "vin": "3VWRJ71KX8M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2011",
        "dateOfIncident": "07/07/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430851,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY MORNING MY 2008 VW JETTA 2.0T IS VERY HARD TO START.  SOMETIMES WHEN THE CAR IS TRYING  TO START IT STALLS IN THE MIDDLE OF STARTING.     HTTP://WWW.YOUTUBE.COM/WATCH?V=_TGW53YVLQA&FEATURE=YOUTUBE_GDATA_PLAYER.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2011",
        "dateOfIncident": "09/18/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425964,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DSG TRANSMISSION SEEMS TO SLIP WHEN COLD, OR FROM DEAD STOP OR UNDER KICK DOWN ACCELERATION.  *TT",
        "vin": "3VWRJ71K98M"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2011",
        "dateOfIncident": "06/29/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411168,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD BEEN PROPERLY LOCKED; THE STEERING WHEEL WAS NOT TURNED AFTER PARKING TO ACTIVATE THE WHEEL LOCK; ON RE-ENTERING THE LOCKED CAR, USING THE CORRECT KEY, THE PROBLEM WAS THAT THE KEY COULD NOT BE INSERTED INTO THE STEERING COLUMN IGNITION KEY SLOT. NOTHING HAD BEEN DONE TO DAMAGE THE SLOT; OUR 2ND KEY WAS ALSO USED, BUT IT ALSO COULD NOT BE INSERTED INTO THE IGNITION KEY SLOT. VW SERVICE ADVISED THEY HAD ONLY SEEN THE PROBLEM ONCE BEFORE, AND THE CAR HAD TO BE TOWED TO THE DEALER 6 MILES AWAY. MY REASON TO CONSIDER THIS A SAFETY MATTER IS THAT SUCH A PROBLEM COULD HAVE HAPPENED AT A DANGEROUS TIME (SUCH AS A ZERO DEGREE DAY IN THE MIDDLE OF NOWHERE; OR A MIDDLE OF THE DESERT SCENARIO; OR WHEN NEEDING TO GET AWAY FAST --- E.G., BRINGING SOMEONE TO A HOSPITAL). THANKS YOU.",
        "vin": "3VWRM71K98M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410283,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN TAKE OFF HARD CLUTCH KICKING, DURING DRIVE HARD SHIFTING, PROBLEMS WITH REVERSE AND GEARBOX NOT RESPONDING. THE MECHATRONIC UNIT WAS CHANGED IN MY VEHICLE AFTER IT WAS WORKING FINE DUE TO A RECALL AND NOW THE CAR HAS SEVERE PROBLEMS.  *TR",
        "vin": "3VWRJ71KX8M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/28/2011",
        "dateOfIncident": "06/11/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409209,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA. THE CONTACT STATED THAT THE REAR BRAKE PAD LOCKED WHILE DRIVING, DUE TO THE BRAKE PAD BEING STUCK.  WHEN THE CONTACT PUT THE VEHICLE IN PARK, THE BRAKE PAD FELL OFF ONTO THE FLOOR.  THE DEALER DIAGNOSED THAT THE VEHICLE NEEDED A NEW BRAKE CALIPER AND BRAKES.  THE VEHICLE WAS REPAIRED.  THE MANUFACTURER WAS NOTIFIED, BUT DID NOT ASSIST THE CONTACT WITH THE REPAIRS.  THE FAILURE MILEAGE WAS 48,000 AND THE CURRENT MILEAGE WAS 49,000.",
        "vin": "3VWRM71KX8M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2011",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393013,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NO PRIOR WARNING BEFORE FAILURE OCCURRED; 2. THE AUTOMATIC TRANSMISSION WILL NOT GO INTO REVERSE; THIS OCCURS EVERYTIME AFTER THE INITIAL INSTANCE; CONSEQUENCE IS THAT THE CAR CAN NOT BE BACKED UP; 3. THE DEALER HAS REVIEWED AND WANTED NEW TRANSMISSION BUT NO GUARANTEE IT WOULDN'T HAPPEN AGAIN. HAVE ALSO TAKEN TO INDEPENDENT SERVICE FOR VWS AND SERVICED TRANSMISSION BUT INDICATED INTERNAL MECHANISMS NEEDED TO BE INSPECTED BY VW DEALER.  *TR",
        "vin": "3VWSP69M02M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2011",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381290,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DECEMBER 13, 2010.  THE CHECK ENGINE LIGHT CAME ON.  METRO VW SERVICE DIAGNOSED AN IGNITION MISS.  THEY REPLACED (1) IGNITION COIL ON CYLINDER #2 WITH A DIFFERENT TYPE OF IGNITION COIL THAN THE ORIGINAL.  THE \"NEW VERSION\" IGNITION COIL HAS INSULATION WHERE THE ORIGINAL COIL DID NOT.  FEBRUARY 8, 2011, APPROXIMATELY, TWO MONTHS LATER, THE CHECK ENGINE LIGHT CAME ON AGAIN.  AT LEAST ONE OF THE THREE ORIGINAL IGNITION COILS IS FAILING, CAUSING AN IGNITION MISS, AND NEEDS TO BE REPLACED.  THE ORIGINAL IGNITION COILS ARE NOT PERFORMING AS ORIGINALLY DESIGNED.  THE ORIGINAL IGNITION COILS SHOULD BE RECALLED AND REPLACED WITH THE NEW VERSOIN IGNITION COILS AT THE MANUFACTURERS EXPENSE.  *TR",
        "vin": "3VWRJ71K28M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2011",
        "dateOfIncident": "01/24/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381073,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING RELATES TO A 2008 JETTA 2.0L WOLFSBURG EDITION SEDAN.  THREE TIMES IN THE LAST MONTH THE VEHICLE HAS SUDDENLY LOST MOTIVE POWER, WITH THE ENGINE QUICKLY DROPPING TO 0 RPM, WITH ALL 3 INCIDENTS OCCURRING DURING BUSY TRAFFIC CONDITIONS.  AFTER THE FIRST INCIDENT, THE CAR WAS ABLE TO RESTART, AND WAS BROUGHT TO THE DEALER. A FUEL PRESSURE SENSOR WAS REPLACED.  TWO WEEKS LATER, THE EXACT SAME INCIDENT OCCURRED, BUT THE CAR COULD NOT BE RESTARTED.  VEHICLE WAS TOWED TO DEALER, AND THE FUEL PUMP WAS REPLACED.  WHILE IN THE SHOP, THE DEALER STATED THAT THERE WAS A RECALL ON A PART WITHIN THE TRANSMISSION, WHICH WAS ORDER AND REPLACED.  UPON RECEIVING THE CAR THE 2ND TIME, THE VEHICLE BEHAVED NOTICEABLY DIFFERENT - POOR ACCELERATION, UNUSUAL SHIFTING, SUDDEN JERKING AND LURCHING WHILE IDLING.  THREE DAYS AFTER RECEIVING THE CAR, ONCE AGAIN A COMPLETE LOSS OF MOTIVE POWER DURING HEAVY TRAFFIC.  NOW WAITING FOR A SECOND TOW, AND THIRD VISIT TO THE DEALER SERVICE DEPARTMENT.  THESE INCIDENTS POSE SERIOUS SAFETY THREATS, SINCE THE SUDDEN LOSS OF POWER SEEMS TO UNRELATED TO VEHICLE OPERATION STATUS - IE, SPEED, INCLINE, ETC DO NOT AFFECT THE VEHICLE'S SUDDEN LOSS OF POWER, AND THUS CAN OCCUR IN ANY TRAFFIC CONDITION.  *LN",
        "vin": "3VWRA71K68M"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "12/27/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375495,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER ABS WIRE CAME OUT OF BRACKET AND RUBBED ON THE AXLE. ABS LIGHT AND TRACTION CONTROL LIGHT CAME ON...ABS IS INOPERABLE. DEALERSHIP SAID IT WAS CAUSED BY SNOW AND ICE. WE LIVE IN ILLINOIS WHERE THERE IS SNOW AND ICE 6 MONTHS OUT OF THE YEAR. WHY IS THIS KIND OF ENGINEERING ALLOWED IN SNOWY CLIMATES IF IT IS UNABLE TO PROBABLY FUNCTION. THIS IS A SAFETY HAZARD AS THE BRAKE LINE IS ALSO FASTENED TO THIS BRACKET. WHEN CHECKING ONLINE THIS SEEMS TO BE A VERY RECURRING ISSUE. WE WILL BE NEEDING TO GET THIS FIXED....CAR IS UNDER WARRANTY BUT THEY SAY THIS DOES NOT FALL UNDER THE WARRANTY. THE REPAIR IS $506.00 FOR AN ENTIRE WIRE HARNESS. WE HAVE OWNED AUTOS AND VANS SINCE THE INCEPTION OF ABS. WE HAVE NEVER HAD A VEHICLE THAT HAS HAD THIS PROBLEM. *TR",
        "vin": "3VWRM71K08M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "05/17/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368447,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW JETTA 2.5L ENGINE STALLS AND EPC LIGHT ILLUMINATES. *TR",
        "vin": "3VWJM71K08M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/22/2010",
        "dateOfIncident": "11/22/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367145,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE PADS ON MY 2008 VOLKSWAGEN JETTA ARE WORN DOWN TO NOTHING AND MY FRONT BRAKE PADS ARE JUST ABOUT PERFECT.  HAVE NOTICED MANY ONLINE FORUMS HAVE MENTIONED THIS PROBLEM AS WELL. *TR",
        "vin": "3VWJM71K78M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365311,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 VW JETTA AND I HAVE HAD TO HAVE THE BRAKE PADS, ROTORS AND CALIPERS REPLACED NOW FOR A 3RD TIME.  THE FIRST 2 TIMES HAPPENED WITHIN THE FIRST 12 MONTHS OF OWNING THE VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/19/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361208,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 VW JETTA. THE TIRES WERE REPLACED SEPTEMBER 17, 2010. THE CONTACT NOTICED THAT THE REAR RIMS, AND THE RIGHT FRONT RIMS WERE BENT.  REPORT 1003146 WAS FILED WITH THE MANUFACTURER. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DIAGNOSIS REVEALED THAT THE RIMS WERE DEFECTIVE AND THERE WAS NO EVIDENCE OF A CRASH THAT MAY HAVE CAUSED THE RIMS TO BEND; HOWEVER, THE MANUFACTURER CONCLUDED THAT THEY WOULD NOT REPLACE THE DEFECTIVE RIMS UNDER WARRANTY. THE CONTACT STATED THAT THE PASSENGER REAR TIRE BLEW; YET, THE TIRE SHOP DIDN'T LOCATE A FAILURE ON THE TIRE. THE FAILURE MILEAGE WAS 41,000 AND THE CURRENT MILEAGE WAS 42,000.",
        "vin": "3VWJM71K68M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2010",
        "dateOfIncident": "10/08/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360010,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOCKING SOUND WHEN THE VEHICLE IS IN MOTION. *TR",
        "vin": "3VWJZ71K98M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359792,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW JETTA. CONSUMER STATES ENGINE SHUTDOWN *TGW  THE CONSUMER STATED WHILE DRIVING ON THE TURNPIKE, SUDDENLY THE VEHICLE FELT AS IF IT DOWNSHIFTED AND BEGAN TO LOSE SPEED. DEPRESSING THE ACCELERATOR HAD NO EFFECT. THE CONSUMER MANAGED TO GET TO THE EMERGENCY LANE.  HE PUT THE GEAR IN NEUTRAL AND THEN IN DRIVE AND THE VEHICLE STARTED TO RESPOND AND MOVED FORWARD.  HE CONTINUED ON WITH NO FURTHER PROBLEMS. *JB",
        "vin": "3VWRZ71K38M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/12/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356963,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLKSWAGEN JETTA DSG MECHATRONICS FAILURE. *TR",
        "vin": "3VWRJ71K88M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356964,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLKSWAGEN JETTA DSG MECHATRONICS FAILURE. *TR",
        "vin": "3VWRJ71K88M"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355819,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 JETTA, WITH AN AUTOMATIC TRANSMISSION AND I HAVE BEEN THE SOLE OWNER.  THE CAR HAS 18,000 MILES AND NEEDS NEW BACK BRAKES.  VW SAYS IT IS NO LONGER UNDER WARRANTY AND WILL NOT PAY FOR BRAKES.  THEY TOLD ME THAT THERE IS 'EQUAL WEAR' ON BOTH BACK BRAKES (THE FRONT ARE FINE); HOWEVER, WHEN I LOOKED AT THE BRAKES WITH THE VW MECHANIC, THERE WAS NOT EQUAL WEAR.  I AM CONTESTING THE ISSUE AND BELIEVE THAT IT IS A MECHANICAL PROBLEM AND NOT A CASE OF NATURAL WEAR. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/06/2010",
        "dateOfIncident": "09/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354025,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPER BLADES LEAVE A UNBEARABLE STREAK RIGHT IN MY LINE OF SIGHT WHILE DRIVING MY 2008 JETTA WOLFSBURG.  THE WINDSHIELD IS OUT OF CONTOUR FOR THE FACTORY WIPER BLADES.  BOTH SIDES LEAVE STREAKS THAT ARE A DISTRACTION TO MY DRIVING ESPECIALLY IN RAINY WEATHER AT NIGHT. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "08/30/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352783,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN JETTA S    MY CAR HAS 36000 MILES ON IT AND I HAVE CHANGED THE REAR BRAKE PADS AND ROTORS TWICE ON THIS VEHICLE. IT IS MY UNDERSTANDING THAT THIS HAS BEEN A PROBLEM WITH MANY JETTAS AROUND THAT YEAR. I HAVE LUCKILY AVOIDED MANY WRECKS THAT I WOULD NOT HAVE POTENTIALLY BEEN IN IF THE REAR BRAKES RESPONDED AS THEY SHOULD. I FEEL THAT THIS IS DEFINATELY A SAFETY ISSUE THAT NEEDS TO BE ADDRESSED. *TR",
        "vin": "3VWHM71K08M"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/28/2010",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352449,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS HEATED SEAT ACTIVATED ON ITS OWN. CONTROL SWITCH ON DASH WAS SET AT 0, DRIVE RECEIVED MODERATE BURNS TO LEGS AND BUTTOCK. REMOVED FUSE AND TOOK VEHICLE TO DEALER. NOTHING FOUND, DEALER SUGGESTED IF THE SEAT HEATS UP AGAIN, BRING VEHICLE DIRECTLY TO THE DEALER, DO NOT SHUT IT OFF. BURNS ARE SIMILAR TO A BAD SUNBURN, SOME REDNESS, NO BLISTERS. *TR",
        "vin": "3VWRM71K08M"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "04/27/2010",
        "dateOfIncident": "04/03/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327827,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGED REAR BRAKE PADS BECAUSE OF SQUEAKING NOISE. AFTER THAT BRAKE STARTED TO LOCK AND SMOKE COMING OUT OF REAR PASSENGER SIDE.  WENT BACK TO MY MECHANIC AND WAS TOLD COULD BE PROBLEM WITH CALIPER.  CHANGED CALIPER AND BRAKE LOCKED AGAIN WITH MORE SMOKE AND SMELL OF BURN COMING FROM REAR PASSENGER SIDE.  HAD CAR TOWED TO MECHANIC AND THEY ADJUSTED BRAKES.  TOOK CAR TO VW DEALER AND WAS TOLD NOTHING WAS WRONG WITH BRAKES.  NOTHING HAPPENED FOR ABOUT 5 DAYS AND AGAIN BURNED SMELL CAME BACK,  TOOK CAR BACK TO MY MECHANIC DAY AFTER SINCE THEY WERE THE ONES THAT CHANGED PADS AND CALIPER BUT BRAKES WERE NOT LOCKED ANYMORE. *TR",
        "vin": "3VWJZ71K88M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/18/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326193,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED A CHALLENGE WITH MY REAR BRAKES ON MY 2008 VOLKSWAGEN JETTA SO I BEGAN SEARCHING FOR INFORMATION FROM OTHERS ON THE INTERNET.  REFER TO WWW.EDMUNDS.COM FOR OTHER CONCERNS REGARDING SIMILAR CONCERNS.  I AM NOT THE ONLY INDIVIDUAL EXPERIENCING THESE CHALLENGES.      NOW LET ME DESCRIBE MY SITUATION.  I NOTICED SOME SQUEAKING HERE AND THERE AROUND 26,000 MILES.  I ASKED THE DEALERSHIP ABOUT THE NOISE AT THAT TIME.  THEY DIDN'T SHARE THAT ANYTHING WAS WRONG SO I DROVE OFF THE LOT.       FROM THAT POINT FORWARD, I HEARD THE SAME SQUEAKING NOISE ONLY WHEN IT RAINED AND THEY MENTIONED THAT HAPPENS WHEN FROST GETS IN BETWEEN THE ROTORS AND PADS SO I DID NOT THINK MUCH OF IT.    WHEN I DROVE INTO THE DEALERSHIP AT 31,000 MILES THEY SHARED MY REAR BRAKES WERE BETWEEN 2-3; THEREFORE THE REAR ROTORS WOULD NEED TO BE REPLACED.      I SHARED MY CONCERNS AS A VOLKSWAGEN OWNER, (HAVE OWNED 4 IN THE LAST 5 YEARS), THAT IT SEEMED ODD THAT THE ROTORS HAD TO BE REPLACED AT SUCH A YOUNG AGE OF 31,000 MILES.    THEY ASSURED ME THAT THEY DID NOTHING WRONG AND THEY ASSURED ME THAT THERE WAS NOT A RECALL ABOUT THIS ISSUE.      OVERALL I AM DISAPPOINTED WITH MY DEALERSHIP IN THEIR RESPONSE CONSIDERING I HAVE BEEN A LONG STANDING CUSTOMER WHO DOES ALL OF MY SERVICE WITH THEM.  AND I AM STILL LEFT WONDERING IF THERE IS AN ISSUE WITH THE MAKING OF THE CAR; THEREFORE CAUSING PRE-MATURE PROBLEMS WITH THE ROTORS.    WHAT WOULD BE A NEXT STEP TO SHARE THIS INFORMATION?  I WONDER HOW MANY OTHER PEOPLE HAVE BEEN AFFECTED.  *TR",
        "vin": "3VWRM71K88M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "03/16/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324324,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PRE-MATURE REAR-BRAKE WEAR.  THE REAR BRAKE PADS COMPLETELY WORE OUT AT ABOUT 17,000 MILES CAUSING METAL TO METAL CONTACT WITH THE REAR ROTORS.  MOST OF THE MILES ARE HIGHWAY.  MANY FORUMS REPORT SIMILAR PROBLEMS FOR OTHER YEARS OF THE VEHICLE AND IT SEEMS THAT THE CAUSE COULD BE CALIPERS THAT DON'T DISENGAGE COMPLETELY WHEN THE PARKING BRAKE IS USED.  SINCE I HAVE A MANUAL TRANSMISSION IT'S HARD NOT TO USE THE PARKING BRAKE.  MY REAR WHEELS ARE ALWAYS COVERED IN BRAKE DUST AND IT SEEMS LIKE THE PADS WILL WEAR OUT SOON AGAIN (ABOUT 22,000 MILES LATER).  I TRIED NOT TO USE THE PARKING BRAKE AFTER THE FIRST REPAIR AND HAVE A COMMUTE CONSISTING OF ABOUT 85 PERCENT HIGHWAY MILES SO THIS KIND OF BRAKE WEAR IS INEXCUSABLE.  THE FRONT BRAKE PADS DID NOT NEED ANY ATTENTION YET AND LOOK GOOD. *TR",
        "vin": "3VWJZ71K38M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2010",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 VW JETTA WAS GIVING BURNT SMELL/FUMES. LOSS OF POWER IN GEAR WITH IN 1 MILE RADIUS WAS DIFFICULT  TO MOVE. HAD TO TOW TO VW DEALERSHIP",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311684,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 VOLKSWAGEN JETTA.  I PURCHASED IT NEW IN AUGUST 2008.  THE REAR BRAKES WORE INTO THE ROTORS AT 12,000 MILES.  THE DEALERSHIP REPAIR SHOP HAD JUST INFORMED ME THAT THE BRAKES WERE FINE AT 10,000 MILES.  THE ROTORS AND BRAKES HAD TO BE REPLACED AT MY COST AS IT IS NOT A WARRANTY ITEM BUT A WEAR ITEM.  AT MY 20,000 MILE CHECKUP, I WAS AGAIN TOLD THAT MY BRAKES WERE FINE AND HAD 50% REMAINING.  I TOOK THE CAR TO MEINEKE TO HAVE THE BRAKES DOUBLE CHECKED.  I WAS SHOWN THAT THE REAR CALIPERS ARE DEFECTIVE. THEY DO NOT ALLOW THE EMERGENCY BRAKE TO DISENGAGE.  AS SUCH, MY EMERGENCY BRAKE IS CONSTANTLY ON, CAUSING MY BRAKES TO LOCK ON TO THE ROTOR.  THE MECHANIC HAD TO USE A CROW BAR TO PRY LOOSE THE EMERGENCY BRAKE.  I WAS TOLD THAT I CANNOT USE THE EMERGENCY BRAKE UNTIL IT IS FIXED.  I HAVE A 5 SPEED AND THIS IS CONCERNING THAT I CANNOT USE THE EMERGENCY BRAKE.  THE DEALERSHIP EXPLAINED THAT THE WARRANTY WILL ONLY ALLOW THEM TO REPLACE ONE CALIPER AT A TIME.  IF THE OTHER ONE IS BROKEN, THEN I HAVE TO WAIT UNTIL I DRIVE IT A WHILE AFTER ONE IS REPLACED.  I HAVE SEEN A LOT OF DATA ONLINE ABOUT THE EXACT SAME PROBLEM IN SEVERAL MODEL YEARS OF THE VOLKSWAGEN JETTA.  INTERESTINGLY, MY DEALERSHIP WAS OUT OF THE CALIPERS AND HAD TO REORDER MORE.  I AM VERY FRUSTRATED THAT MY SAFETY HAS BEEN IN JEOPARDY AS MY BRAKES COULD HAVE ONCE AGAIN FAILED.  I AM UPSET THAT THE DEALERSHIP NEGLECTED TO CORRECT THE PROBLEM.  I HAD TO TAKE IT TO A DIFFERENT MECHANIC TO FINALLY HAVE THE PROBLEM CORRECTLY DIAGNOSED.  INCIDENTALLY, PART OF MY ENGINE WENT OUT WITHIN THE FIRST 6 MONTHS OF OWNING THE CAR.  I HAVE ALSO HAD TO HAVE THE FRONT END REPAINTED AS IT BEGAN CHIPPING IMMEDIATELY. NOW THE DOOR EDGES AND THE TOP EDGE OF THE HOOD ARE CHIPPING. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "01/08/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307966,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW JETTA 2.5 WITH 5 SPEED MANUAL AND 25,300 MILES. UNABLE TO SHIFT INTO REVERSE AND SHIFTING INTO FIRST GEAR WAS DIFFICULT. DEALER STATED THAT CLUTCH WAS BAD FROM WEAR AND TEAR. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HORRIBLE BRAKE WEAR ON REAR BRAKES ON 2008 VW JETTA. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2010",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298644,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ILLUMINATED. FIRST OCCURRED SEPTEMBER 2009, TAKEN TO DEALER TO BE REPAIRED. ONCE AGAIN IN DECEMBER 2009. *TR",
        "vin": "3VWJM71K28M"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2009",
        "dateOfIncident": "09/17/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297662,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN JETTA WOLFSBURG 2.0T FSI DSG (DIRECT SHIFT GEARBOX)  WHILE PULLING OUT INTO TRAFFIC ON NUMEROUS OCCASIONS FROM A FULL STANDSTILL THERE WAS A VERY SIGNIFICANT DELAY IN THE RESPONSE OF THE DSG TRANSMISSION TO DRIVER THROTTLE INPUT. THERE WILL BE A 1-2-3 GO, (DELAY) THE CAR WILL THEN JERK FORWARD OUT INTO TRAFFIC THEN ONLY CREEP VERY SLOWLY FORWARD AT THIS POINT WHICH COMMITS THE CAR AND IT'S PASSENGERS TO THE MANEUVER OF TURNING INTO ACTIVE TRAFFIC PATTERN. THIS DELAY/JERK/THEN CREEPING FORWARD HAS CAUSED A FEW CLOSE CALLS WITH HAVING AN ACCIDENT FROM ONCOMING TRAFFIC. THE POSSIBILITY OF TRAFFIC COLLIDING INTO THIS VEHICLE IS VERY HIGH AS THE CAR DOES NOT RESPOND TO DRIVER THROTTLE INPUT LEAVING YOU DEAD IN THE WATER UNTIL THE CAR FINALLY DECIDES TO MOVE ITSELF FORWARD. THIS IS A VERY DANGEROUS SITUATION WHICH COULD VERY EASILY RESULT IN SIGNIFICANT INJURY OR DEATH. WHEN ONE PURCHASES AND DRIVES A CAR ONE WOULD EXPECT THE CAR TO PROPERLY RESPOND TO DRIVER INPUTS AND NOT BE LEFT IN ONCOMING TRAFFIC WITH A CAR THAT WONT RESPOND TO THE DRIVER. *TR",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2009",
        "dateOfIncident": "09/14/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290543,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOXIC MOLD:     THANK YOU FOR THIS MESSAGE. FOR THE RECORD, WE DID NOT REQUEST FINANCIAL RELIEF FOR THE MOLD PROBLEM WITH OUR 2008 LEASED VOLKSWAGEN (VW) JETTA. WE REQUESTED RECEIPT OF A NEW, MOLD-FREE VEHICLE FOR THE COMPLETION OF OUR LEASE. THIS REQUEST WAS MADE BECAUSE OF THE RECURRENT MOLD PROBLEM THAT RESULTED FROM A MANUFACTURER'S DEFECTIVE GASKET SEAL ON THE CAR'S TRUNK. WE ALSO MUST ITERATE THAT THE MOLD IS A SERIOUS TOXIC HEALTH HAZARD FOR WHICH WE WILL HOLD VOLKWAGEN RESPONSIBLE IF HEALTH, I.E., BREATHING OR OTHER MOLD RELATED PROBLEMS RESULT FROM THIS HAZARDOUS CONDITION FOR WHICH VW REFUSES TO TAKE RESPONSIBILITY BY EITHER FULLY ABATING THE MOLD IN THIS VEHICLE OR REPLACING THE VEHICLE WITH A HEALTHY, I.E., MOLD-FREE, VEHICLE.     IT IS OUR DESIRE TO RECEIVE FULL-SERVICE FROM THE VEHICLE THAT I AM CURRENTLY LEASING, HOWEVER, IF IT IS DETERMINED BY CERTIFIED MOLD INSPECTORS, THAT THIS VEHICLE IS UNSAFE DUE TO A TOXIC MOLD INFESTATION, WE WILL PURSUE THIS MATTER TO THE FULL-EXTENT OF THE LAWS OF THE STATE OF FLORIDA, AND THOSE OF THE U.S. FEDERAL GOVERNMENT. VOLKSWAGEN'S CALLOUS DETERMINATION THAT THE HEALTH OF THE DRIVERS AND PASSENGERS OF THIS LEASED VW VEHICLE ARE NOT WORTHY OF THE CONCERN AND RESOLUTION OF THIS PROBLEM, IS AN UNFORTUNATE SITUATION THAT MUST BE MADE KNOWN TO ALL VW OWNERS/DRIVERS/PASSENGERS, AND PARTICULARLY TO THE GOVERNMENT AGENCIES THAT REGULATE THE AUTOMOBILE INDUSTRY, AND THE CONSUMER HEALTH AGENCIES OF THE STATE OF FLORIDA AN THE UNITED STATES.     TO ALL THOSE IN RECEIPT OF THIS MESSAGE, PLEASE PASS THIS ALONG TO ALL PEOPLE YOU KNOW WHO DRIVE CARS, RIDE IN CARS, OR WHO ARE IN THE MARKET TO PURCHASE OR LEASE A CAR.     THANK YOU FOR YOUR CONSIDERATION OF THE HEALTH AND SAFETY OF ALL VEHICLE OWNERS, PARTICULARLY THOSE WHO OWN OR LEASE VOLKSWAGEN VEHICLES.     FOR ADDITIONAL INFORMATION ABOUT THIS PLEASE CONTACT ME BY RESPONSE TO THIS E-MAIL. *TR",
        "vin": "3VWRJ71K48M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285794,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS NO SPECIFIC EVENT THAT LED UP TO THE PROBLEMS. I BOUGHT THE CAR BRAND NEW AND PROBLEMS BEGAN AFTER ABOUT 4 MONTHS.THE CAR \"BUCKS\" OR \"JERKS\" WHEN GAS PEDAL DEPRESSED TO ACCELERATE. ALSO WHEN PULLING OUT OR WHEN CAR IS IN REVERSE (IE FOR PARKING,ETC). THE FIRST TIME I TOOK THE CAR TO THE DEALERSHIP WHERE IT WAS PURCHASED AND THEY SIMPLY RESET THE COMPUTER. THE PROBLEM PERSISTED SO I RETURNED TO THE DEALERSHIP. THE SECOND TIME WE WERE TOLD THE PROBLEM WAS THE CLUTCH PACKS AND THEY WERE REPLACED. THE PROBLEM CONTINUED AND THE THIRD TIME THE MECHATRONIC UNIT WAS REPLACED. THE PROBLEM IS STILL ONGOING AND I JUST DROPPED IT OFF TO THE DEALERSHIP AGAIN. *TR",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "08/26/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING INTO REVERSE AND TAKING FOOT OFF THE BRAKES, VEHICLE LAUNCHES BACKWARD.  I HAVE TO WAIT A FEW SECONDS AFTER SHIFTING INTO REVERSE BEFORE TAKING FOOT OFF THE BRAKES TO AVOID LAUNCHING.  NEVER EXPERIENCED THIS IN ANOTHER VEHICLE. *TR",
        "vin": "3VWRM71K78M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "01/26/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281864,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED THE CAR IT HAS BEEN EXHIBITING ERRATIC BEHAVIOR.  FOR EXAMPLE WHEN I PRESS ON THE GAS THERE IS A DELAY OF A SECOND OR TWO BEFORE THE TRANSMISSION ENGAGES AND PROVIDE POWER TO THE WHEELS.  EVERYTIME I STOP AND THEN START AGAIN THERE IS A SUDDEN JERK.  IT IS A SAFETY HAZARD WHEN MERGING ONTO HIGHWAYS. *TR",
        "vin": "3VWRA71K48M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "05/30/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281898,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2008 VOLKSWAGEN JETTA 2.0 IN MAY OF 08.  SINCE MY PURCHASE THE CAR IS JERKY ALL THE TIME WHILE IN MOTION, ESPECIALLY DURING ACCELERATION.  I BROUGHT THIS TO THE ATTENTION OF THE DEALERSHIP I PURCHASED IT FROM AND THEY FOUND NO ISSUES EACH TIME IT WAS SERVICED.  THIS IS NOT NORMAL FOR A CAR TO DO THIS HOWEVER VOLKSWAGEN STATES THERE ARE NO PROBLEMS. *TR",
        "vin": "3VWRJ71K88M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2009",
        "dateOfIncident": "08/07/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281633,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THIS EVENT OCCURS CONSTANTLY UNDER ALL CONDITIONS  2. THE TRANSMISSION WILL JERK FROM A START CAUSING DISCOMFORT AND IRRITATION  3. NOTHING HAS BEEN DONE TO PREVENT THIS ISSUE. *TR",
        "vin": "3VWFJ71K58M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281734,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "08  VW JETTA DSG TRANS. AFTER THE TRANS IS WARMED UP, THE CAR IS JERKY TAKING OFF FROM A STOP, AS IF THE CLUTCH IS NOT ENGAGED PROPERLY. ON A FEW OCCASIONS, IT SEEMED THAT NO POWER WAS BEING TRANSMITTED TO THE WHEELS, LEAVING THE VEHICLE IN THE MIDDLE OF AN INTERSECTION. ONCE THE RPMS CAME DOWN, THE TRANS. ENGAGED, AND THE CAR BECAME MOBILE AGAIN. THE \"JERKINESS\" FROM A STOP IS ALMOST ALL THE TIME ONCE THE CAR WARMS UP, THE TOTAL LACK OF POWER TRANSMISSION HAS ONLY HAPPENED ONCE OR TWICE. THE CAR WAS TESTED BY THE VW DEALER SERVICE DEPT. A NEW MECHTRONIC UNIT IS ON ORDER. *TR",
        "vin": "3VWRJ71KX8M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/23/2009",
        "dateOfIncident": "06/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281494,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR IN MAY OF 2008.  IT IS NOW AUGUST 23, 2008 AND IT IS GOING INTO THE SHOP THIS WEEK FOR THE THIRD TIME.  THE MECHATRONIC UNIT HAS BEEN REPLACED ONCE AS WELL AS THE CLUTCH PLATES.  IT IS A 2008 JETTA WOLFSBURG EDITION 2.0T WITH THE DSG TRANSMISSION.  THE PROBLEM IS A JERKY, SURGING FEELING WHEN THE TRANSMISSION IS WARMED UP.  YOU TAKE YOUR FOOT OFF THE BRAKE AND IT STARTS TO JERK AS IF YOU'RE TAPPING THE GAS AND LETTING OFF.  IT HAPPENS 2 OR 3 TIMES A DAY WHEN I DRIVE A LOT.  NOT SURE WHAT ELSE IT COULD BE.  THE CAR WAS BUILT IN MAY 2008 AS FAR AS I KNOW, MEANING ITS NOT PART OF THE RECALL AS OF TODAY AUGUST 21, 2009.  I CAN'T BELIEVE A CAR THAT HAS 18,000 MILES ON IT IS HAVING THESE MANY PROBLEMS.  *TR",
        "vin": "3VWRJ71K28M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "06/08/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281288,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF VW DSG TRANSMISSION AFTER 7000 MILES. *TR",
        "vin": "3VWRJ71K88M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "07/25/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281354,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2008 VOLKSWAGEN JETTA WOLFSBERG EDITION.   FROM A DEALERSHIP ON STATEN ISLAND.  THE CAR NOW HAS APPROXIMATELY 5,000 MILES ON THE ODOMETER.  WE BEGAN TO NOTICE THAT THE CAR WOULD LUNGE FORWARD FROM A STARTING POSITION WHILE IN DRIVE OR LUNGE BACKWARDS FROM A STARTING POSITION WHILE IN REVERSE.  THE CAR MAKES VERY JERKY, JOLTY MOVEMENTS FORWARD.  WE HAVE TAKEN IT TO THE DEALERSHIP OPEN ROAD IN BROOKLYN, NY.  THE MECHANICS BELIEVE IT IS A TRANSMISSION ISSUE. THE PART IS ON ORDER, BUT THE DEALERSHIP HAS SAID IT IS SAFE TO DRIVE UNTIL THE PART COMES IN FROM GERMANY.  ALTHOUGH THEY OFFERED US A \"RENTAL\" CAR JUST IN CASE WE FELT UNCOMFORTABLE.  I READ TODAY (AUGUST 21ST) THAT VW IN CONJUNCTION WITH THE NHTSA IS RECALLING SEVERAL VW'S DUE TO PROBLEMS WITH THE DCT IN THE TRANSMISSION.  I AM CONCERNED THAT THIS PROBLEM MAY INVOLVE MORE THAN THE CARS LISTED, AS I AM SURE THAT OUR VEHICLE IS AFFECTED BY THIS DEFECT.  *TR",
        "vin": "3VWRA71K58M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/18/2009",
        "dateOfIncident": "08/17/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280806,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2008 VW JETTA. 2.5 L THE JETTA HAS 25,000 MILES AND LESS THAN YEAR OF OWNERSHIP (PURCHASED AT 8000 AS PROGRAM CAR)  REAR BRAKES ARE COMPLETELY GONE & RUINED ONE ROTOR  -NO WARNING PRIOR?  (PER DEALER) FRONT BRAKES ARE FINE TOLD REAR PADS AND ROTORS MUST BE REPLACED.  *TR",
        "vin": "3VWRM71K98M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2009",
        "dateOfIncident": "08/17/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280748,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 08 VW JETTA WOLFSBURG WITH DSG TRANSMISSION FOR A LITTLE OVER A YEAR AND HAVE DRIVEN IT 25000 MILES. THE TRANSMISSION HAS NEVER REALLY BEEN PERFECT BUT I PUT THE VARIOUS CLUNKS, HESITATIONS AND HARD SHIFTS DOWN TO THE TRANSMISSION TECHNOLOGY RATHER THAN A POTENTIAL FAILURE. HOWEVER, AS TIME HAS GONE BY I HAVE NOTICED AN INCREASED TENDENCY FOR THE CAR TO SURGE WHEN ATTEMPTING TO SLOWLY REVERSE. THIS CAUSES REPEATED SUDDEN ACCELERATIONS MUCH GREATER THAN ANTICIPATED WITH THE SMALL AMOUNT IN THROTTLE INPUT. GIVEN THAT I NEED TO NEGOTIATE MY CHILD'S DAYCARE FACILITY PARKING LOT TWICE A DAY THIS SITUATION HAS BECOME A REAL SAFETY CONCERN FOR ME. A SIMILAR PROBLEM OCCURS WHEN VERY SLOWLY STARTING FORWARD FROM A COMPLETE STOP. THIS SITUATION IS NOT QUITE AS SERIOUS A CONCERN FOR ME BUT IS AT LEAST VERY ANNOYING. PRIMARILY I AM CONCERNED ABOUT THE ABILITY TO SAFELY REVERSE MY VEHICLE AND MAINTAIN CONTROL OF MY SPEED IN DOING SO. *TR",
        "vin": "3VWRJ71K58M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280467,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN JETTA GLI WITH DSG TRANSMISSION. THIS CAR HAS A FAULTY DSG TRANSMISSION WHICH MAKES THE CAR UNSAFE TO DRIVE. THE CAR SHIFTS ROUGHLY, BUCKS WHILE ROLLING IN STOP AND GO TRAFFIC, AND ROLLS BACKWARDS AN EXCESSIVE DISTANCE WHEN SHIFTING INTO PARK ON A HILL (NOSE POINTING UPHILL). THIS IS A DANGEROUS DEFECT. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "12/31/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278484,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SUBMITTING A COMPLAINT REGARDING MY 2008 VOLKSWAGEN JETTA, WOLFSBURG EDITION.WE PURCHASED THIS CAR 8-08 FROM A VW DEALER, IT WAS BRAND NEW. WITHIN SEVERAL MONTHS OF OWNING THE CAR, WHEN ATTEMPTING TO ACCELERATE WHEN IN DRIVE, THE CAR WOULD LUNGE FORWARD. THE CONDITION KEPT GETTING WORSE AND BEGAN ALSO LUNGING FORWARD WHEN IDLING. I TOOK IT TO THE SERVICE DEPT. OF THE VW DEALERSHIP WHERE I PURCHASED THE CAR. THEY SAID IT HAD TO DO WITH THE COMPUTER MEMORY IN MY CAR AND IT WAS MEMORIZING HOW I DRIVE AND IF I SWITCHED OVER TO ANOTHER DRIVER IT WOULD BE CONFUSED AND LUNGE. THIS IS WRITTEN ON MY RECEIPT FOR THE WORK: \"ADVISE CUSTOMER TO ONLY DRIVE THE VEHICLE. IT IS ACTING AS IF TWO PEOPLE ARE DRIVING AND THE ADAPTIVE LEARNING IS CONFUSED. NO CODES STORED.\"     MY CAR IS CONFUSED, THEREFORE THERE CAN ONLY BE ONE DRIVER????  SOUNDED SILLY TO ME, BUT I NEEDED MY CAR AND I ACCEPTED THAT EXPLANATION AND LEFT. THE CONDITION ONLY WORSENED. THE LUNGE OR SURGING FORWARD BECAME SO NOTICEABLE THAT IT WAS EMBARRASSING. MY HUSBAND SAID HE ALSO NOTICED IT LUNGING OR SURGING IN THE REVERSE GEAR AS WELL AS FORWARD AND IDLE. I RETURNED IT TO THE SERVICE DEPARTMENT AT THE VW DEALERSHIP JULY 13, 2009. THEY HAVE DETERMINED THAT IT IS A FAULTY MECHATRONICS UNIT. THEY CANNOT EVEN GET THE PART UNTIL THE FIRST WEEK IN AUGUST.  THEY TOLD ME THAT PROBLEMS WITH THE MECHATRONICS UNIT ARE RARE. HOWEVER, I DID MY OWN RESEARCH AND FOUND THAT THERE ARE MANY PEOPLE WHO HAVE VW JETTAS WITH THE SAME PROBLEM. AND, THIS PART IS A BIT WEIRD...MANY OF THEM HAD TO WAIT WEEKS FOR THE PART. ONE PERSON REPORTED THAT THE \"SURGING FORWARD\" WAS SO BAD THAT HE HIT ANOTHER CAR. I AM REPORTING THIS BECAUSE THIS CONDITION COULD  BE POTENTIALLY DANGEROUS.IT IS EXTREMELY FRUSTRATING TO  OWN A NEW CAR THAT HAS SOMETHING SO MAJOR WRONG WITH IT. AND IT WAS VERY UPSETTING TO FIND SO MANY OTHERS (ONLINE FORUMS) WITH THE SAME PROBLEMS.  THANK YOU FOR YOUR HELP AND CONSIDERATION OF THIS SITUATION. *TR",
        "vin": "3VWRJ71K58M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278498,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN JETTA WOLFSBURG W/ DSG TRANSMISSION, 22K MILES. AFTER WARMING UP, THERE IS SIGNIFICANT LURCHING AND STUTTERING FROM A STOP WHEN IN D(RIVE), S(PORT) OR \"MANUAL\" MODE. WHEN IN D & S, THERE IS OFTEN TIMES A HARSH DOWNSHIFT INTO 3RD OR 2ND GEAR. ENGINE ALMOST DIES WHEN COMING TO A STOP ON OCCASION, THEN LURCHES FORWARD. IN REVERSE, THERE IS ALMOST NO RESPONSE TO PRESSING THE ACCELERATOR FOR A SPLIT SECOND, THEN THE CAR LUNGES BACKWARDS VERY NEARLY CAUSING A CRASH ON MULTIPLE OCCASIONS. PROBLEM HAS BEEN OCCURRING FOR APPROX 6 MONTHS. I ORIGINALLY THOUGHT IT MAY NEED A REGULAR SERVICING TO FIX, BUT THE RECOMMENDED INTERVAL ISN'T UNTIL 40K MILES. CURRENTLY WAITING ON APPT AT DEALER TO HAVE IT LOOKED AT. *TR",
        "vin": "3VWRJ71K28M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2009",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278320,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THIS ISSUE IS MORE PREVALENT WHEN THE CAR IS WARMED UP, LIKE AFTER DRIVING FOR 20 OR 30 MINUTES OR SO.    2. MY CAR (VW JETTA '08 DSG) AUTOMATIC TRANNY OPERATION FAILS USUALLY WHEN IN 1ST GEAR (WHILE IN 'D' MODE) OR IN REVERSE SO THAT YOU EXPERIENCE VERY BAD \"LURCHING\" AND SURGING EFFECT. THE CAR WOULD SUDDENLY REV AND JUMP FORWARD A FOOT OR TWO THEN FEEL LIKE IT WAS IDLING WRONG AND FEEL LIKE IT WAS GOING TO DIE, THEN RUN FINE THEN DO IT ALL OVER AGAIN. THIS COULD CAUSE SERIOUS ACCIDENT BECAUSE CAR WOULDN'T HAVE POWER TO MOVE WHEN ITS NEEDED FOR EXAMPLE IN T-JUNCTION.    3. I CALLED THE DEALER AND THEY WANT TO GET THE CAR IN TO FIX THE BAD MECHATRONICS UNIT. THE NEW MECHATRONICS UNIT PART WAS ORDERED AND IT WILL TAKE \"SOME TIME\" (NO LESS THAN ONE MONTH), NO EXACT DATE WAS GIVEN WHEN THEN NEW PART IS AVAILABLE AND READY FOR REPLACING. I FEAR THAT THE DSG REPAIRING IS NOT THE FINAL SOLUTION AND IT WILL TAKE LOTS OF REPAIRS TO GET THIS THING EVENTUALLY FIXED. *NOTE* CAR VIN  SITE DIDN'T ACCEPT IT FOR SOME REASON. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2009",
        "dateOfIncident": "06/12/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278269,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M GOING ON MY 3RD DSG/MECHATRONICS UNIT. I HAVE A 08 WOLFSBURG WITH 31,000 MILES. THE VERY FIRST DAY I HAD THE CAR IN BROKE DOWN WITH 101 MILES ON IT. FLASHING PRNDS AND IT WOULD NOT SHIFT INTO ANY OTHER GEARS OR REVERSE. HAD IT TOWED TO DEALER AND WAITED 3 WEEKS FOR NEW MECHATRONICS UNIT. FOR A FEW DAYS IT WAS FINE THEN IT STARTED WITH JERKING,HARD DOWN SHIFTS FROM 3 TO 1 IN DRIVE. BACKING UP WAS SCARY AT TIMES. BROUGHT IT BACK TO THE SAME DEALER 4 DIFFERENT TIMES AND THEY SAID THIS WAS NORMAL FOR DSG. GOT TIRED OF HEARING THE SAME STORY FROM THEM AND TOOK IT TO ANOTHER DEALERSHIP AND THEY SAID IT WAS MECHATRONICS UNIT AND ITS ON ORDER SINCE JUNE 12,2009 AND TODAY IS JULY 25, 2009 AND STILL WAITING FOR MY CAR TO BE FIXED. *TR",
        "vin": "3VWRJ71K48M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "07/24/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2008 VW JETTA WITH DSG TRANSMISSION.  HAVE TAKEN TO DEALER 3 TIMES SINCE PURCHASING FOR SAME PROBLEM.  THE TRANSMISSION DOWNSHIFTS \"CLUNKS\" HARD IN STOP AND GO TRAFFIC PRIMARILY 2ND TO 1ST TO NEUTRAL.  THIS IS WORSE THE LONGER AND HOTTER TRANSMISSION GETS.  ALSO TRANSMISSION JUMPS OR SURGES FORWARD OR BACK AFTER PUTTING IN DRIVE OR REVERSE.  THIS PRIMARILY HAPPENS WHEN PUTTING INTO GEAR WITH FOOT ON BRAKE, THEN TAKING FOOT OFF BRAKE AND SLIGHTLY PRESSING ACCELERATOR PEDAL.  THE VEHICLE JUMPS SEVERAL FEET FORWARD OR REVERSE.  THE DEALER TELLS ME THAT THIS IS TO BE EXPECTED FROM A MANUAL TRANSMISSION THAT IS OPERATED BY SOFTWARE.  I LIKE THE CAR AND HAVE NO PROBLEMS WITH THE TRANSMISSION AT HIGHWAY SPEEDS.  THEY NEED TO DO SOMETHING TO\"SOFTEN\" THE STOP AND GO JERKINESS OF THIS SUPPOSEDLY CUTTING EDGE TECHNOLOGY. *TR",
        "vin": "3VWRA71K08M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "07/21/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278029,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 VOLKSWAGEN JETTA 2.0T WOLFSBURG EDITION WITH THE DSG TRANSMISSION. AROUND 5,000 MILES, I STARTED EXPERIENCING BANGING OF GEARS WHEN I WAS START UP AT A LIGHT, THE PROBLEM CONTINUED TO GET WORSE TO THE POINT MY NECK WAS HURTING AND THE FRONT SEAT OF THE CAR HAS BECOME LOOSE DUE TO THE CONSTANT FORCE OF THE BANGING. MOST RECENTLY ON MY WAY TO THE DEALER, THE CAR BANGED INTO GEAR AND STARTED TO ROLL BACK (NOT LIKE IT DOES NORMALLY ON A HILL, THIS WAS AFTER THAT SHOULD OF HAPPENED) BEFORE IT MOVED FORWARD. I'VE ALSO EXPERIENCE THE CAR REVVING AND NOT GOING INTO GEAR THEN IN BANGS INTO GEAR AND SURGES FORWARD AT A HIGHER SPEED THEN WHICH YOU HIT THE GAS. MY CAR IS CURRENTLY BEING LOOKED AT. BUT FROM WHAT I UNDERSTAND MULTIPLE COMPLAINTS ARE POSTED FOR THIS SAME ISSUE. VOLKSWAGEN NEEDS TO ADDRESS THE ISSUE AND RECALL THE TRANSMISSIONS, AS THE SYMPTOMS GET WORSE THE CAR BECOMES A DANGER TO DRIVE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278070,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2008 VOLKSWAGEN GLI SEDAN EQUIPPED WITH A DSG TRANSMISSION I HAVE ON NUMEROUS OCCASIONS EITHER WHILE ACCELERATING OR SLOWING HAD SUDDEN, ROUGH SHIFTS, AND AT TIMES HAVE BEEN LITERALLY BUCKED AROUND IN THE VEHICLE WHILE SHIFTING FROM 1ST TO 2ND GEAR WHEN LEAVING A STOP LIGHT. THIS HAS BEEN HAPPENING SINCE FEBRUARY 2009...POSSIBLY BEFORE, AND HAS BEEN INCREASING IN FREQUENCY. I HAVE ALSO HAD ROUGH SHIFTS DOWNSHIFTING AT TIMES CAUSING THE ESP TO BECOME ACTIVATED IN MY VEHICLE MAKING IT FEEL LIKE I AM LOSING TRACTION. I UNDERSTAND THERE IS AN OFFICIAL INVESTIGATION IN TO THIS AND WOULD LIKE TO HAVE MY STORIES ADDED TO THE INVESTIGATION. PE09-035. I HAVE TAKEN MY VEHICLE IN FOR SERVICE ON THIS BEFORE AND THEY DENIED ANY PROBLEMS WITH THE VEHICLE. *TR",
        "vin": "3VWDJ71K88M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278108,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JETTA WOLFSBURG IS CURRENTLY IN SHOP DUE TO A DSG MECHATRONIC UNIT FAILURE.  PRIOR TO BRINGING IT IN THE CAR WAS 'JERKY' AND 'JUMPY' AS THOUGH I WAS DRIVING A MANUAL TRANSMISSION AND RELEASING THE CLUTCH TOO FAST.  THIS HAPPENED IN BOTH DRIVE AND REVERSE.  MY CAR CURRENTLY HAS ~ 12000 MILES ON IT AND THE ISSUE BEGAN AROUND 10000 MILES.  THE JUMPINESS OF THE CAR WAS SIGNIFICANT ENOUGH THAT I BACKED INTO A WALL (LUCKILY AT LOW SPEED) EVEN WITH SLIGHT BRAKE PRESSURE (THE CAR LURCHED BACKWARDS SUDDENLY).  THE DEALER BELIEVES THAT THE REPLACEMENT OF THE MECHATRONIC UNIT SHOULD SOLVE THE PROBLEM.  I HAVE BEEN WAITING FOR THE PART TO COME IN FOR 2 WEEKS NOW AND AM DRIVING A LOANER IN THE MEAN TIME. *TR",
        "vin": "3VWRJ71K48M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "07/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277986,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW JETTA WOLFSBURG WITH 2.0T & DSG TRANSMISSION 21K MILES. TRANSMISSION CONSISTENTLY LURCHES FORWARD AT A STOP ESPECIALLY AFTER DRIVING AT HIGHWAY SPEEDS.  THIS IS MAGNIFIED WHEN THE A/C IS ON.  RPM'S WILL FLUCTUATE +/- 200 AS YOU FEEL THE GEAR ENGAGE.  SYMPTOMS ARE WORSE WHEN THE CAR IS IN REVERSE.  HAS THE SAME FEELING AS SOMEONE NOT KNOWING HOW TO DRIVE A MANUAL TRANSMISSION. THE \"JERKINESS\" CONTINUES FROM A STOP UNTIL UNDER ACCELERATION INTO 3RD GEAR.  THE TRANSMISSION ALSO DOWNSHIFTS UNUSUALLY HARD INTO 2ND & ESPECIALLY 1ST GEAR.  ALL THESE SYMPTOMS HAVE SLOWLY BECOME MORE PRONOUNCED OVER THE LAST MONTH.  THE WORST & POTENTIALLY HAZARDOUS PROBLEM WAS WHEN I ATTEMPTED TO MAKE A LEFT TURN ONTO A BUSY ROAD WITH MY ENTIRE FAMILY IN THE CAR.  I WAS AT A STOP & SHIFTED THE CAR INTO \"SPORT\" MODE WHICH GIVES THE CAR MUCH QUICKER SHORT TERM ACCELERATION, WHICH WOULD HELP IN THE BUSY SITUATION.  AS TRAFFIC CLEARED ENOUGH I PRESSED THE GAS & THE CAR SIMPLY ROLLED WITHOUT POWER INTO THE ONCOMING TRAFFIC.  I HAD TO SHIFT QUICKLY INTO REVERSE TO AVOID BEING HIT BY ONCOMING TRAFFIC.  I ATTEMPTED THIS A 2ND TIME & THE SAME THING HAPPENED...NO POWER, JUST ROLLED LIKE IT WAS IN NEUTRAL.  I HAVE NOT RUSTED THIS CAR IN THESE SITUATIONS SINCE. I HAVE AN APPOINTMENT WITH THE DEALER IN 1 WEEK TO ADDRESS THIS & A RECALL ON THE DRIVESHAFT BOLTS.  I AM FILING THIS BECAUSE AS I RESEARCHED THIS ISSUE FROM CREDIBLE SOURCES, IT IS APPARENT THIS IS A BIG ISSUE FOR THE  DSG TRANSMISSIONS & THE CONSUMER IS GETTING THE RUN AROUND. I COULD HAVE BEEN INVOLVED IN A SERIOUS/FATAL ACCIDENT WITH MY FAMILY & IT WOULD HAVE BEEN WRITTEN UP AT THE SCENE THAT I PULLED OUT IN FRONT OF ONCOMING TRAFFIC.  WHEN IN REALITY THIS TRANSMISSION FAILED TO ENGAGE (TWICE) AND JEOPARDIZED OUR LIVES.  I WOULD HOPE THAT THIS ISSUE GAINS THE ATTENTION IT DESERVES AND VW STEPS UP AND MAKES A PERMANENT FIX. THE PARTS THE ARE REPLACING (MECHATRONIC) IS FAILING AGAIN AFTER TIME. I EXPECT A DEALER RUN-A-ROUND. PLEASE HELP. *TR",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "06/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277676,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SURGES/BUCKS DURING LOW SPEED OPERATION SUCH AS PARKING. REVERSE IS WORSE THAN FORWARD. REVERSE OPERATION CAN BE DANGEROUS AS EXTRA THROTTLE MUST BE APPLIED TO GET THE CAR TO MOVE BUT THEN THERE IS A RAPID ACCELERATION THAT IS DIFFICULT TO CONTROL. TRANSMISSION ALSO DOWN SHIFTS VERY HARD WHILE SLOWING FOR A STOP, 2ND TO 1ST DOWNSHIFT. CAR IS INOP. SINCE 6/26/09 AWAITING REPAIR PART. PART ETA IS LATE AUGUST 2009. TRANSMISSION IS DSG MODEL. *TR",
        "vin": "3VWRJ71K78M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2009",
        "dateOfIncident": "06/02/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277034,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VW 2008 2.0T, SHIFTS VERY HARD WHEN DRIVING WITH THE DSG TRANSMISSION. IT ALSO LURCHES FORWARD FROM A STOP; AT TIMES IT ALSO LOSES POWER WHEN THE ACCELERATOR IS STEPPED ON. THE VEHICLE JERKS VERY HARD AND HAS ALSO WHEN REVERSING ALMOST HIT THE GARAGE. THE CAR CANNOT BE TRUSTED TO GO FROM PARK TO DRIVE SMOOTHLY, AT TIMES VIOLENTLY JERKING FORWARD. *TR",
        "vin": "3VWRJ71K38M"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2009",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276374,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS PURCHASED NEW IT DROVE PERFECTLY NO HESITATION NO PROBLEMS WHAT SO EVER.  OVER THE PAST FEW MONTHS WHILE BACKING OUT OF A PARKING SPACE I WILL PUT THE CAR IN REVERSE PRESS THE ACCELERATOR AND THE CAR WILL HESITATE AND THEN LURCH BACKWARDS.  THIS IS A SERIOUS SAFETY ISSUE THAT OCCURS 1 OUT OF EVERY 25 TIMES.  SINCE IT DOES NOT HAPPEN ALL OF THE TIME I REALLY HAVE KNOW IDEA HOW MY VEHICLE WILL REACT WHILE BACKING.  ALSO MORE RECENTLY OCCURRING IS WHILE DOING HIGHWAY SPEEDS AND  TRYING TO PASS A VEHICLE I WILL ACCELERATE THE VEHICLE AND THE TRANSMISSION WILL SLIP INTO A NEUTRAL STATE.  I WILL HAVE TO COAST TO THE SHOULDER AND RE-START THE VEHICLE.  I HAVE TAKEN THE VEHICLE TO THE DEALER THEY HAD VERIFIED MY COMPLAINTS AND ORDERED A NEW VALVE BODY (MECHTRONICS UNIT) AND ADVISED ME NOT TO DRIVE THE CAR SINCE IT COULD BE UNSAFE.  UNFORTUNATELY, THE PART IS ON BACK ORDER FOR 4-6 WEEKS AND THE ONLY ALTERNATE TRANSPORTATION THEY COULD PROVIDE FREE OF CHARGE WAS A COMPACT CAR.  I DECIDED TO KEEP MY VEHICLE UNTIL THE PART COMES IN HOPING I WILL NOT HAVE ANY SERIOUS PROBLEMS.  THIS IS A MAJOR SAFETY ISSUE AND A RECALL OF THIS PART IS NEEDED. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2009",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276011,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2008 VW JETTA WOLFSBURG EDITION EQUIPPED WITH THE DSG (DIRECT SHIFT GEARBOX) TRANSMISSION.  AFTER DRIVING THE CAR FOR ABOUT 1000 MILES I STARTED TO NOTICED VERY HARSH 2 TO 1 DOWNSHIFTS AND SURGING WHILE IN DRIVE.  BY THE HARSH DOWNSHIFT I MEAN WHEN SLOWING DOWN COMING TO A STOP WHEN THE GEARBOX WOULD SHIFT FROM 2ND GEAR DOWN INTO 1ST GEAR I WOULD ALWAYS EXPERIENCE A LOUD METALLIC \"CLUNK\" NOISE.  IN REGARDS TO THE SURGING WHILE IN DRIVE I MEAN WHEN AT A DEAD STOP AND YOU GIVE EVEN/SLIGHT PEDAL PRESSURE ON THE ACCELERATOR THE CAR WOULD SURGE FORWARD OVER AND OVER AGAIN LIKE YOU WERE STEPPING ON THE GAS AND THEN LETTING OFF.  THIS CHARACTERISTIC WAS VERY PREVALENT ON AN INCLINE.  THE VW DEALERSHIP I WORK WITH DIAGNOSED THE  PROBLEM AS A FAULTY MECHATRONICS UNIT WHICH CONTROLS THE FUNCTIONS OF THE COMPLEX DSG TRANSMISSION.  IT WAS REPLACED AT 5000 MILES.  AFTER DRIVING WITH THE NEW MECHATRONICS UNIT INSTALLED FOR ROUGHLY 6000 MORE MILES I STARTED TO NOW EXPERIENCE THE SAME SURGING ISSUES BUT WHEN THE CAR WAS IN REVERSE.  I ALSO NOTICED THAT THE RPM'S WOULD ALWAYS DROP LIKE THE ENGINE WAS GOING TO STALL EVERYTIME I WOULD SHIFT INTO DRIVE FROM PARK.  AND LASTLY WHEN STARTING FROM A STOP, APPLYING EVEN ACCELERATOR PEDAL PRESSURE, THE CAR WOULD ALWAYS \"JUMP\" OFF THE LINE.  BROUGHT IT INTO THE VW DEALERSHIP AGAIN AND THEY ENDED UP REPLACING THE WHOLE TRANSMISSION.  AFTER THE NEW DSG TRANSMISSION HAS BEEN INSTALLED THE CAR DRIVES VERY SMOOTH NOW WITH NO SURGING AND NO HARSH 2 TO 1 DOWNSHIFTS.  THE NEW TRANS ONLY HAS 300 MILES ON IT CURRENTLY BUT I HOPE THE SAME ISSUES DO NOT OCCUR AGAIN. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "06/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273901,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE FRONT AND REAR WINDOW AND PASSENGER SIDE FRONT AND REAR WINDOW LEAK WATER.  *TR",
        "vin": "3VWHM71K28M"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "03/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT SENSOR IS DEFECTIVE.  IT WILL COME ONE FOR DRIVER AND PASSENGER WHEN BOTH PEOPLE ARE PRESENT IN THE CAR.  I HAD IT FIXED ONCE BEFORE AND NOW IT HAPPENED AGAIN. *TR",
        "vin": "3VWRM71K48M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "05/11/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269460,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 JETTA SE HAS HAD RECURRING SQUEALING BACK BRAKES SINCE DAY 1.  MURRIETA VW IN CA SAYS IT IS NORMAL.  THEY CHECKED AND SPRAYED.  GOOD TO GO, BUT NOW AT 14K MILES, NOISE HAS RETURNED.  ONLY HAPPENS AT SLOW SPEED (BACKING UP/PARKING).  IS THERE A DEFECT ON THE CALIPERS/PISTON ASSEMBLY?  VW DEALER SAYS IT IS \"NORMAL.\"  IN 25 YEARS OF DRIVING NEVER HAD A CAR DO THIS.  IT IS VERY ANNOYING AND SOUNDS DANGEROUS.  CARS SHOULD NOT DO THIS, ESP AT 14K MILES.  BRAKE FAILURE COULD BE ON THE WAY, CAUSING SERIOUS DAMAGE,  OR DEATH. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "03/24/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263014,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A COLD MARCH MORNING, WAS NOT ABLE TO PUT THE KEY IN THE IGNITION.  AFTER A FEW MINUTES OF UNSUCCESSFULLY TRYING TO FORCE THE KEY IN, VW ROADSIDE ASSISTANCE WAS CALLED.  THE CAR WAS TOWED TO THE NEAREST DEALER.  WHEN DEALER LOOKED AT THE PROBLEM, IT WAS DETERMINED THAT THE TUMBLER IN THE CYLINDER WAS IN THE LOCKED POSITION.  THE DEALER SPRAYED WITH SILICONE LUBRICANT TO COAX THE TUMBLER TO RELEASE. *TR",
        "vin": "3VWRZ71K18M"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/23/2009",
        "dateOfIncident": "08/03/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256118,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY FIRST DRIVE IN THE RAIN I COULD NOT SEE OUT THE WINDOW. I HAD TO PULL OFF THE ROAD BECAUSE THE DRIVER SIDE WINDSHIELD WIPER LEAVES A STREAK RIGHT IN THE LINE OF VISION WHEN IN USE. DEALER REPLACED THE WIPER, THE STREAK IS SMALLER, BUT THE PROBLEM REMAINS.  IN ADDITION, NOW THAT WINTER IS HERE, IT IS ESPECIALLY DANGEROUS AS THE SNOW MELTS AND SALT AND SLUSH ARE HITTING THE WINDOW.  THE WIPERS WILL NOT CLEAN IT PROPERLY.  *TR",
        "vin": "3VWRA71K48M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/08/2009",
        "dateOfIncident": "01/07/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254296,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES ARE WEARING PREMATURELY ON 2008 VW JETTA.  ONLY LASTED 20, 000 MILES. *TR",
        "vin": "3VWJZ71K28M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2008",
        "dateOfIncident": "12/22/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253191,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DIFFICULTY FILLING GAS TANK WHILE AT PUMP.  THE AUTO SHUT-OFF KICKS IN AFTER PUTTING IN A FEW CENTS WORTH OF GAS MAKING FILL-UP FRUSTRATING AND TIME CONSUMING.  TOOK TO VW DEALERSHIP.  THEY SPENT A DAY INVESTIGATING AND COULDN'T FIND THE PROBLEM SO THEY KEPT IT OVERNIGHT AND CALLED VW TO WALK THEM THROUGH TROUBLESHOOTING.  VW SAYS THE FUEL TANK IS NOT VENTING PROPERLY AND THE ONLY WAY TO FIX IT IS TO REPLACE THE ENTIRE FUEL TANK ($1500 FOR THE PARTS).  VW REFUSED TO PAY BECAUSE CAR WAS 1400 MILES BEYOND ITS WARRANTY.  THEY CLAIM SITUATION IS NOT DANGEROUS, JUST ANNOYING, BUT I PLAN TO CONTACT THEIR RESIDENT AGENT ANYWAY - SUSPECT A MANUFACTURING OR DESIGN DEFECT . *TR",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "12/19/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252313,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2008 JETTA FROM ROD EAST VW IN LATE JUNE, IN LATE JULY MY BRAKE LIGHT CAME ON, I THEN CALLED ROD EAST VW TO INFORM THEM AND THEY TOLD ME TO CALL THEIR ROADSIDE ASSISTANCE TO HAVE THEM TOW MY CAR OVER TO THEM. ONE WEEK HAD PASSED AND THEY HAD STILL NOT LOOKED AT MY CAR SO I INFORMED THEM THAT I WOULD NEED A RENTAL CAR BECAUSE I AM A STUDENT AND I HAVE A DAUGHTER THAT HAS NUMEROUS THERAPY AND DR APPT EVERY WEEK.  THEY SAID FINE AND THE MAN THAT I WAS TALKING TO SAID LET ME GO GET YOUR CHILD SEAT OUT OF THE CAR FOR YOU, HE THEN CAME BACK TO ME AND SAID HOW ABOUT YOU COME TO THE BACK AND GET IT FROM YOUR CAR, I DID AND THAT'S WHEN I NOTICED THAT MY CAR HAD A BIG DENT AND DEEP SCRATCH FROM THE REAR RIGHT FENDER TO THE BACK PASSENGER DOOR...I WAS THEN TOLD THAT THAT'S HOW THE CAR WAS WHEN THEY GOT IT AND THAT IT WAS MY FAULT.  HE THEN SAID THAT HE COULD TALK TO THE MANAGER AND SEE WHAT HE WOULD SAY.  I CALLED THE MANAGER,  ON MY WAY HOME AND HE SAID WE WILL FIX IT, I SEE THAT ITS A NEW DENT AND SCRATCH AND WE WILL SEND IT TO A BODY SHOP TO GET FIXED.  I THEN DEMANDED THAT I GET ALL OEM PARTS AND I WAS IT BRAND NEW AGAIN AND THE SERVICE MAN SAID THAT'S GOING TO BE TOO EXPENSIVE AND IT DIDN'T NEED NEW PARTS HE ALSO WANTED ME TO RETURN THE RENTAL WHEN I LEFT ON VACATION TO SAN FRANCISCO, THAT'S WHEN I SPOKE TO THE MANAGER AGAIN AND HE GUARANTEED THAT THEY WOULD BE OEM PARTS AND I WOULDN'T NEED TO RETURN THE RENTAL. WHEN I PICKED UP MY CAR AFTER 3 AND A HALF WEEKS THEY SAID NOTHING WAS WRONG WITH MY BRAKES AND THE LIGHT WAS OUT.  I NOTICED THE NEXT DAY THAT MY 12 VOLT LIGHTERS WERE NOT WORKING AND I CALLED THE MANGER AND HE TOLD ME TO COME IN.  I NEVER DID BECAUSE I DIDN'T WANT THEM TO WORK ON MY CAR AGAIN.  TODAY I TOOK IT TO ANCIRA VW AND THEY SAID I HAD SOME WIRES MIXED UP, I STARTED TO DRIVE OFF THE LOT AND MY BRAKE LIGHT CAME BACK ON!  THAT CAN NOT BE A COINCIDENCE AND IT TELLS ME THAT SOME WIRES WERE CHANGED TO HIDE THE FACT THAT NOTHING WAS EVER DONE BY ROD EAST. *TR",
        "vin": "3VWRM71K78M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/15/2008",
        "dateOfIncident": "11/02/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251805,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW JETTA WOLFSBURG (LESS THAN 5000 MILES AT FIRST OCCURRENCE)  BRAKE ISSUE 1ST OCCURRENCE - COMING UP TO A STOP, AND BRAKE PEDAL LOST PRESSURE BUT RE-ENGAGED AFTER TRAVELING 2-3 INCHES BEYOND NORMAL BRAKING PRESSURE.  VERY INTERMITTENT ISSUE.   AFTER BOTH OF MY TEENAGE SONS REPORTED THE SAME ISSUE, I TOOK THE CAR INTO THE VW DEALERSHIP FOR REPAIR.  THELEN (BAY CITY, MI) BLED THE BRAKES AND RETURNED THE CAR.  WITHIN A FEW DAYS, I WAS EXPERIENCING THE SAME ISSUE WITH MORE FREQUENCY, BUT COULD NOT REPRODUCE CONSISTENTLY.  TOOK TO DEALERSHIP A SECOND TIME - THIS TIME TOLD THAT VW SAID THIS WAS A \"NORMAL\" BRAKE FUNCTION.  SERVICE TECHNICIAN DROVE VEHICLE HOME AND BACK IN THE NEXT MORNING.  HE EXPERIENCED THE PROBLEM TWICE AND (AS DESCRIBED TO HIS SERVICE MANAGER) \"HIS HEART WENT INTO HIS THROAT.\"  STILL - VW MAINTAINED THAT THIS WAS \"NORMAL\".  RECEIVED AN EMAIL FROM DEALERSHIP OWNER STATING SAME.  AFTER CONTINUED PRESSURE, VW TECHNICAL REP CAME TO DEALERSHIP AND FINALLY DETERMINED THAT THE BRAKE POWER BOOSTER NEEDED TO BE REPLACED (OVER A TWO WEEK SPAN).  RECEIVED CAR BACK, AND WITHIN THREE DAYS, THE PROBLEM RETURNED - AS I NEARLY RAN THROUGH AN INTERSECTION WHEN THE BRAKES WENT TO THE FLOOR BEFORE ENGAGING (WITH ABS).    TOOK BACK TO DEALER (3RD TIME) - DEALER NOT ABLE TO REPLICATE - STATED THAT THEY CANNOT FIX THE PROBLEM IF THEY CAN'T IDENTIFY/REPLICATE - CAR STILL AT DEALERSHIP (5 DAYS LATER).  MET WITH DEALERSHIP OWNER TO EXPRESS CONCERN FOR THE SAFETY OF THE VEHICLE AND MY FAMILY.  I REFUSED TO TAKE VEHICLE UNTIL THEY CAME UP WITH A SOLUTION FOR THE PROBLEM.  SCHEDULED MEETING WITH VW REP AT THE DEALERSHIP ON 12/16 TO DISCUSS ISSUE.  *TR",
        "vin": "3VWRJ71KX8M"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/14/2008",
        "dateOfIncident": "08/24/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251715,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE WINDSHIELD WIPER LEAVES A 2 OR 3 INCH STREAK RIGHT IN THE CRITICAL VIEW OF THE DRIVER WHEN THE WINDSHIELD WIPERS ARE USED. VW ENGINEERING RESPONSE WAS THAT THEY DON'T SEE A PROBLEM WITH IT. WIPERS HAVE BEEN REPLACED AND ISSUE STILL REMAINED. *TR",
        "vin": "3VWRM71KX8M"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248568,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW VW JETTA OFF THE FLOOR ROOM. BOTH THE DRIVERSIDE AND PASSENGER SIDE WINDOWS LEAK AIR BADLY AND WATER DRIPS IN.. DEALER TOLD ME THAT THIS IS THEY WAY IT IS AND REFUSED TO FIX IT FOR ME... *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/23/2008",
        "dateOfIncident": "10/21/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246563,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE REAR BRAKE WEAR. BRAKE NEEDED REPLACING AT 12K. CAR IS A 5-SPEED MANUAL AND BRAKES ARE USED VERY LITTLE. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244718,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUES INVOLVES THE FAILURE OF WINDSHIELD WIPERS SET ON THE HIGHEST SETTING TO REMAIN AT THAT SPEED.  VW HAS CONFIRMED THE PROBLEM AT A DEALERSHIP BUT OFFERS NO FIX TO THE PROBLEM.  ESCALATION WITHIN VW HAS YET TO PRODUCE A SATISFACTORY ANSWER TO THIS OBVIOUS PROBLEM.  IN HEAVY RAIN, DRIVING IS UNSAFE BECAUSE  THE WIPERS VARY IN SPEED AND TO KEEP A CONSTANT WIPER RATE REQUIRES REPEATED CHANGING OF THE SETTINGS. *TR",
        "vin": "3VWRZ71K48M"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "09/28/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244051,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDSHIELD FOGS UP, AND YOU CANT SEE ANYTHING THROUGH IT. YOU NEED TO TURN ON THE AIR-CONDITIONING, SO THAT IT HEATS THE FRONT WINDSHIELD UP. IF YOU DON'T DO THAT, YOU WILL CRASH BECAUSE OF 0% VISIBILITY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/22/2008",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243132,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE DRIVE BY WIRE THROTTLE DELAY. THROTTLE RESPONSE DELAYED APROX. 1-2 OR MORE SECONDS AFTER DEPRESSING THROTTLE PEDAL. THROTTLE DELAY CAUSING HAZARDOUS DRIVING SITUATIONS WHEN PULLING OUT INTO TRAFFIC ETC.  THIS \"DELAY\" IS PROGRAMMED INTO THE CAR'S SOFTWARE BY DESIGN. UNSAFE, CAUSED NEAR MISS ACCIDENT. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/16/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234584,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER STREAKING PROBLEM:      I PURCHASED A NEW 2008 VOLKSWAGEN JETTA SE ON MAY 6, 2008.  THE FIRST RAIN THE CAR WAS DRIVEN IN (WITHIN TWO WEEKS OF PURCHASE) THE DRIVER SIDE WINDSHIELD WIPER WAS LEAVING A STREAK APPROXIMATELY THREE INCHES WIDE AT EYE LEVEL OF THE DRIVER.  THE VEHICLE HAS BEEN RETURNED FOR DEALERSHIP SERVICE ON NUMEROUS OCCASIONS.  THE VOLKSWAGEN SERVICE DEPARTMENT REPLACED THE DRIVER SIDE WIPER BLADE TWICE AND THE WIPER ARM.  THIS HAS NOT CORRECTED THE STREAK ISSUE.  THE SERVICE DEPARTMENT INDICATES THE STREAK IS INDICATIVE OF ALL 2008 JETTAS AND THERE IS NOTHING THAT CAN BE DONE TO REMEDY THE PROBLEM.  I HAVE CONTACTED VOLKSWAGEN CUSTOMER CARE.  THEY ADVISED ME THEY ACCEPT THE DEALERSHIPS ASSESSMENT OF THE STREAKING PROBLEM AND I WILL HAVE TO LIVE WITH THE PROBLEM.  WHILE DRIVING IN RAIN, LIGHT OR HEAVY, THE STREAK IS PRESENT AND PRESENTS A VISION OBSTRUCTION FOR THE DRIVER.  I BELIEVE THIS IS A VALID SAFETY ISSUE THAT SHOULD BE ADDRESSED FURTHER BY VOLKSWAGEN.  THANKS FOR YOUR CONSIDERATION IN THIS MATTER.  *TR",
        "vin": "3VWRM71K98M"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "06/30/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233657,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DEFROST SYSTEM DOES NOT WORK.  THERE APPEARS TO BE A SECRET FORMULA NEED TO GET THE DEFROST SYSTEM TO DEFROST THE FRONT WINDSHIELD.  I HAVE MADE SEVERAL COMPLAINTS TO THE DEALER AND WAS INFORMED THAT ONLY 1 OTHER PERSON HAD COMPLAINED OF THIS ISSUE.  THIS IS A VERY DANGEROUS DEFECT.  NORMALLY I'M  DRIVING THROUGH A STORM, THE WINDSHIELD FOGS UP AND I CAN'T SEE.  I END UP PULLING OVER TO THE SIDE OF THE ROAD WHEREVER I CAN.  *TR",
        "vin": "3VWRM71K38M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/17/2008",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221509,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*CONTACT OWNS A 2008 VOLKSWAGEN JETTA. TWO AND A HALF MONTHS AFTER PURCHASING THE VEHICLE, HE OBSERVED A BLISTER ON THE FRONT DRIVER SIDE TIRE. THE DEALER ADVISED HIM THAT HE HAS TO PURCHASE A NEW TIRE SINCE THERE WAS NO WARRANTY ON THE TIRE AND TO CONTACT BRIDGESTONE FOR ASSISTANCE. THEY ALSO INFORMED HIM THAT THEY DO NOT GUARANTEE THE ORIGINAL EQUIPMENT. THE DOT, TIRE PRESSURE AND SIZE WERE NOT AVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE 1800.   UPDATED 4/29/08 *CN",
        "vin": "3VWRZ71K38M"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/05/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220180,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 VOLKSWAGEN JETTA.  WHILE DRIVING 15 MPH, THE BRAKES JERKED WHEN THE PEDAL WAS DEPRESSED.  THE DRIVER'S FOOT WAS KNOCKED OFF THE BRAKE PEDAL.  THE DRIVER ATTEMPTED A SECOND TIME TO APPLY THE BRAKES, BUT THE VEHICLE WOULD NOT STOP AND CRASHED INTO THE PRECEDING VEHICLE.  THE VEHICLE HAS NOT YET BEEN INSPECTED BY THE DEALER.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 7,300.",
        "vin": "3VWRM71K78M"
    }
]