[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "07/31/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671784,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "ROUTAN",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN ROUTAN. WHILE DRIVING 20 MPH, THE VEHICLE STALLED AND THE ENGINE WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "2V8HW54X99R"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "ROUTAN",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN ROUTAN. THE CONTACT STATED THAT UPON INSPECTION, IT WAS FOUND THAT THE TPMS SLEEVES WERE CORRODED. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE THE FAILURE WAS CONFIRMED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE AND VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "03/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514297,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "ROUTAN",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Graco Children's Products, Inc.",
                "productMake": "GRACO",
                "productModel": "MY RIDE 65",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "I HAVE THE CAR SEAT GRACO MY RIDE 65.  I HAVE HAD IT NOW FOR 4 YEARS.  I WAS PLANNING ON USING IT AGAIN FOR MY SECOND DAUGHTER.  AFTER THE END OF THE 2ND YEAR, THE STRAPS THAT YOU PULL BEGAN TO FRAY.  THE LATCHING SYSTEM ON THE SEAT HAS BEEN LOCKING OR GETTING STUCK IN THE UPRIGHT POSITION MAKING IT HARD FOR ME TO RELEASE MY DAUGHTER FROM THE STRAPS.  I AM ALSO HAVING A HARD TIME TIGHTENING HER SUFFICIENTLY ENOUGH BECAUSE THE LATCH GETS STUCK.  THE STRAPS ARE ALSO CONSTANTLY GETTING TANGLED AND TWISTED.  I CALLED GRACO AND THEY SAID THERE WAS NOTHING THEY COULD DO BUT SEND ME A 40 DOLLAR REBATE WHEN I BUY ANOTHER ONE OF THEIR SEATS. THERE IS NO PARTS THAT THEY CAN HELP ME WITH REPLACING ANYTHING. I AM VERY DISGUSTED.  I NOW HAD TO PURCHASE ANOTHER GRACO HIGH BACK BOOSTER FOR MY 5 YEAR OLD AND NOW I HAVE TO PURCHASE ANOTHER SEAT FOR MY BABY.  I WASN'T PLANNING ON BUYING ANOTHER SEAT FOR MY BABY.  I WANTED TO USE THE MY RIDE FOR MY 2ND DAUGHTER.  I AM VERY UPSET.  *TR",
        "vin": ""
    }
]