[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383507,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WENT INTO NEUTRAL WHILE ACCELERATING AT HIGHWAY SPEED LAST NIGHT.  FALSE NEUTRAL? NO NOTICEABLE LIGHTS CAME ON AND FINALLY PUT ITSELF BACK IN GEAR AFTER WE CAME TO A STOP.  GEAR SELECTOR WAS NEVER MOVED.   I'VE READ MANY PEOPLE HAVING THIS ISSUE AND SEEMS TO BE A TEMP OR SPEED SENSOR IN THE TRANS.",
        "vin": "WVWJK73C48E"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350147,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT MOVES BACK AND FORTH ON ITS OWN WHILE DRIVING. ALL LUMBAR AND SEAT SUPPORTS ALSO MOVE WITHOUT WARNING WHILE OPERATING VEHICLE IN MOTION.",
        "vin": "WVWCU73C28E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341691,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT WHILE HER SON WAS DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED ON SEVERAL OCCASIONS. RECENTLY, THE VEHICLE FAILED TO RESTART. THE CONTACT'S SON HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE OR PROVIDE A CAUSE FOR THE FAILURE. THE VEHICLE WAS PREVIOUSLY TAKEN TO TEAM VOLKSWAGEN (3990 E LINCOLN HWY, MERRILLVILLE, IN 46410) HOWEVER, THE MECHANIC WAS ALSO UNABLE TO DUPLICATE THE FAILURE OR PROVIDED A CAUSE FOR THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. UPON INVESTIGATION, THE CONTACT LINKED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324358,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED THE CALL SO I WOULD LIKE TO KNOW HOW I CAN CONTACT YOU OR WHEN I COULD MAKE AN APPOINTMENT TO TAKE MY CAR THANK YOU VERY MUCH MY CAR HAS LIGHTS ON AIR BAGS BRAND I WOULD LOVE TO BRING MY CAR AS SOON AS POSSIBLE THANK YOU VERY MUCH!  *TR",
        "vin": "WVWJK73C58E"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316418,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURN ON AC THE CAR LOSES POWER AND THE BATTER ICON AND CHECK ENGINE LIGHT COMES ON AND THE STEERING WHEEL LOCKS UP. AFTER I TURNED OFF AC AND ATTEMPTED TO RESTART CAR AFTER A FEW TRYS IT STARTED BACK UP AND THE CHECK ENGINE LIGHT WENT OFF.. THIS HAD NEVER HAPPENED BEFORE",
        "vin": "WVWJK73C68P"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288611,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR AROUND MID-SEPTEMBER 2019. I'VE BEEN DRIVING IT SINCE AND JUST RECENTLY, I'D SAY DECEMBER 9TH, 2019 TO BE EXACT, GOT A LETTER IN THE MAIL SAYING MY VEHICLE HAD A RECALL FOR THE AIRBAG. I WENT ONLINE TO THE CAR BRANDS WEBSITE AND LOOKED UP MY EXACT CAR TO VERIFY. UPON DOING THIS, I DISCOVERED IT HAD A SECOND RECALL FOR THE FUEL PUMP. I TOOK THE CAR IN FOR THE FREE REPAIRS, ONLY TO BE TOLD THAT THEY CAN'T FIX THE FUEL FUMP ISSUE AS MY CHECK ENGINE LIGHT IS ON. FROM WHAT I'VE BEEN TOLD BY A MECHANIC I WENT TO, THE LIGHT IS ON DUE TO A LEAK IN MY VACUUM PUMP. HE SAID IT'D COST ABOUT $600 FOR PART AND LABOR, BUT THAT THIS FIX ISN'T EXTREMELY IMPORTANT AND THAT MY CAR SHOULD RUN WELL ENOUGH WITHOUT THIS FIX. ME BEING BROKE, I DIDN'T GET IT FIXED. WELL, NOW THAT I'M HERE TO GET MY RECALL PARTS FIXED, I'M BEING TOLD I CAN'T GET ONE OF THEM FIXED, AND I'D HAVE TO PAY AROUND $124 FOR A DIAGNOSIS OF WHY THE CHECK ENGINE LIGHT IS ON, OR PAY THE ESTIMATED COST TO FIX WHAT'S CASUING IT (WHICH I'D ONLY KNOW IF I ALLOWED THE DIAGNOSIS). SO NO MATTER WHAT, I'D HAVE TO PAY MONEY, OR JUST NOT GET MY FUEL PUMP, WHICH WAS RECALLED, FIXED. IS THIS SOMETHING THEY CAN DO? SEEMS UNLIKELY THEY'D HAVE TO CLEAR THE LIGHT TO FIX THE FUEL PUMP...",
        "vin": "WVWJK73C18P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269173,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE NTSA VEHICLE SAFETY RECALL NUMBER 08V235000.  IT IDENTIFIES A ENGINE SURGE AND RESULTANT VEHICLE SURGE FOR VW PASSATS IN THE YEAR 2008.  I RECENTLY PURCHASED A 2008 VW PASSAT LUX WAGON AND HAVE HAD THIS HAPPEN TO ME AT LEAST 6 TIMES SINCE THE END OF JUNE WHEN I BOUGHT THE CAR.  MOST RECENTLY, A LADY WAS WALKING IN FRONT OF MY CAR IN A CROSSWALK, I HAD STOPPED FOR.  AS I BEGAN TO LET OFF THE BRAKE, THE CAR LUNGED FORWARD ABOUT A FOOT, BEFORE I STOPPED IT AGAIN.  WE WERE BOTH NOTICEABLY SHAKEN BY WHAT HAD JUST HAPPENED.    I TRIED REPORTING THIS INCIDENT AND THE RECALL TO MY LOCAL DEALER, VW OF OLYMPIA< WA> ONLY TO BE TOLD IT DID NOT APPLY TO MY SPECIFIC VIN.  I WENT ON TO CONTACT VW CARES ONLY TO BE TOLD THE SAME THING.  I DID FILE A REPORT WITH THEIR CASE NUMBER 190810111.    THIS SITUATION MAY NOT HAVE BEEN APPARENT TO MY SPECIFIC VIN WHEN THE CAR WAS NEW AND THE RECALL WAS ISSUED.   NOW 12 YEARS AND 137K MILES LATER, THERE IT IS.   PEOPLE ARE GOING TO GET HURT OR EVEN KILLED IF THIS IS NOT DEALT WITH.",
        "vin": "WVWTK93C18E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221154,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN  PASSAT WAGON TIMING CHAIN BROKE WHILE DRIVING ON INTERSTATE CAUSING ENGINE FAILURE, 160K MILES. VERY SCARY!!!!!!",
        "vin": "WVWLK73C08E"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217861,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. WHILE DRIVING 35 MPH, THE VEHICLE STALLED AND FAILED TO RESTART. THE VEHICLE WAS COASTED OVER TO THE SIDE OF THE ROAD AND THEN TOWED TO THE OWNER'S RESIDENCE. THE CONTACT WAS NOT NOTIFIED, BUT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. IN ADDITION, THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V148000 (AIR BAGS). JOE HOLLAND VOLKSWAGEN (150 MACCORKLE AVE SW A, SOUTH CHARLESTON, WV 25303, (304) 744-1561) WAS CONTACTED, BUT DID NOT RESPOND WITHIN A REASONABLE TIMEFRAME TO ADDRESS THE TWO RECALL REPAIRS. THE VEHICLE WAS UNABLE TO BE DRIVEN DUE TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 96,000.",
        "vin": "WVWJK73C98E"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196090,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD FUEL MODULE RECALL FIXED AT DEALERSHIP AND 5 MONTHS LATER THE PROBLEM IS BACK THE FIX FOR THE RECALL DOES NOT WORK OR LAST NEEDS TO HAVE ANOTHER RECALL PUT OUT ON THE 2008 VOLKSWAGEN PASSAT",
        "vin": "WVWAK73C48P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192463,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"STEERING COLUMN LOCK DEFECTIVE\" WARNING DISPLAYS ON THE OBD PANEL REGULARLY, YET RANDOMLY SINCE PURCHASING VEHICLE. BOUGHT IN 2011 ODOMETER 5,989, NOW IN 2019 60,000 MI. HAVE REPORTED THIS TO VW DEALER MULTIPLE TIMES DURING SERVICE MAINTENANCE. ALWAYS TOLD THAT NO CODE POPS, AND NO RECALL HAS BEEN ISSUED.   YET IT OCCURS REGULARLY CAUSING THE VEHICLE NOT TO START. ON ONE OCCASION, VEHICLE DID START WHILE WARNING WAS ON DISPLAY, ATTEMPTED TO EXIT PARKING LOT, AND WHILE MOVING FORWARD STEERING WAS UNRESPONSIVE.  SHUT OFF VEHICLE AND RESTARTED. WARNING DID NOT REAPPEAR.  IF YOU REFERENCE - SAFERCAR.GOV - THERE ARE HUNDREDS TO THOUSANDS OF COMPLAINTS THAT DISCUSS THIS SAME FACTORY DESIGN FLAW; SOME CONSUMERS REPORT VEHICLE SHUTTING DOWN AT HIGHWAY SPEEDS WITH THIS DEFECT. ALL HAVE THE SAME QUANTRY:   VW WILL NOT ADDRESS. A VOLUNTARY RECALL WAS ISSUED WITHOUT NOTIFICATION TO OWNERS IN USA. IT LIMITED MODEL/YEARS AND IMPOSED AN EXPIRATION DATE, EVEN THOUGH IT MAY AFFECT ALL B6 PASSATS MADE DURING 2005-2010.  APPARENTLY, AN OPEN RECALL WAS ISSUED FOR UK OWNERS. MY CONCERN IS THAT THIS DEFECT HAS SERIOUS IF NOT FATAL SAFETY CONCERNS THAT VW IS BEING ALLOWED TO PASS ON AT THE BUYERS EXPENSE. (DEALER QUOTES RANGE FROM $1,500-2,000 AND ABOVE)  NOW THAT VW IS MANUFACTURING IN THE US I AM URGING THIS AGENCY TO REINVESTIGATE THIS MANUFACTURE DEFECT AFFECTING SAFE OPERATION. I DO HAVE DATE/TIME STAMPED PHOTOS OF THIS OBD WARNING DISPLAY. IF VW WANTS TO ENJOY CONTINUED MANUFACTURING IN THE US THEN THEY SHOULD BE MADE ACCOUNTABLE FOR REPLACING DEFECTIVE STEERING COLUMN SYSTEMS THROUGH OPEN RECALL TO US BUYERS.  THIS HELD TRUE FOR EMISSIONS VIOLATIONS (US STANDARDS VS UK) SHOULDN'T US BUYERS BE GIVEN THE SAME SAFETY CONSIDERATION AS UK BUYERS.",
        "vin": "WVWJK73C68P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187403,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP OF MY CAR STOPPED WORKING LAST MONDAY MARCH 11, 2018 FOR NO REASON.",
        "vin": "WVWAK73C68P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "01/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184876,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING AN UNRELATED SERVICE, MY ENGINE WAS DIAGNOSED WITH A TIMING CHAIN PROBLEM.  THE SERVICE PERSONNEL INDICATED THAT MY TIMING CHAIN HAS EXTENSIVE WEAR AND WILL FAIL AT SOME POINT IN THE NEAR FUTURE.  THE ENGINE ONLY HAS 75,000 MILES.  THIS SHOULD NOT BE HAPPENING WITH THE LOW MILES ON THE VEHICLE.  UPON RESEARCH, I FOUND THAT A GOOD NUMBER OF OTHER VOLKSWAGEN VEHICLES ARE HAVING THE SAME ISSUE.  VOLKSWAGEN HAS DENIED ANY ASSISTANCE WITH THE PROBLEM.  THIS IS A SAFETY ISSUE AND A DEFECT WITH THE ENGINE.  I FEEL THAT A RECALL SHOULD BE DONE BY VOLKSWAGEN TO REMEDY THE MANY VEHICLES WITH THIS PROBLEM.",
        "vin": "WVWLK93CX8E"
    },
    {
        "components": "AIR BAGS,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180474,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO NHTSA I HAVE A 2008 VOLKSWAGEN PASSAT THAT WAS RECALLED ABOUT AN AIRBAG THIS TO ME WAS UNSAFE I TRIED TO GET IT FIXED A SOON AS POSSIBLE,GETTING TO THE VOLKSWAGEN DEALERSHIP I LEAVE MY PASSAT TO THEM TO FIX IT LIKE THE LETTER I RECEIVED IN THE MAIL SAID I WOULD PAY ANYTHING OUT OF POCKET, I GET MY CAR IN LESS THAN AN OUR SUPPOSEDLY FIXED MY AIR BAG BUT BIT ONLY DID THEY CHANGE MY AIR BAG BUT THEY TAMPERED WITH A FEW OTHER THINGS ONE OF THEM BEING THE FUEL PUMP CONTROL MODUEL BECAUSE ACCORDING TO THEM THE CARS PARTS WHERE ALL RECALLED,NOW I'M GETTING TO MY COMPLAIN I TOOK MY CAR IN IN GOOD CONDITION NOW MY CAR TURNS OFF AT RANDOM TIME BEING IN THE STREET OR IN THE FREEWAY DRIVING WHEN I FILL IT UP WITH GAS I HAVE TO STRIP ON MY ENGINE FOR IT TO TURN ON OR IT WON'T START,ALSO THE CAR KEEPS MARKING TIRE PRESSURE EVERY DAY I USED THIS CAR BEFORE I TOOK IT INTO VOLKSWAGEN , MY CAR WAS NOT LIKE THIS I GAVE THEM A CALL TO MAKE AN APPOINTMENT BUT I DON'T REALLY TRUST THE PEOPLE WHO I BELIEVE MESSED UP MY VEHICLE IT IS IN THE BAKC NOW SITTING U CAN CONTACT ME AT (XXXX) MY NAME  IS (XXXX) THANSK YOU FOR YOUR TIME    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "WVWUK73C38P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I PURCHASED A 2008 VW PASSAT 2.0 SEDAN NEW FROM A VW DEALERSHIP AND RECENTLY (WITHIN THE PAST 6-8 MONTHS THE AIR BAG LIGHT CAME ON FROM TIME TO TIME).  BECAUSE THE VEHICLE IS NOT A PRIMARY VEHICLE FOR ME OR MY WIFE IT IS SELDOM DRIVEN, BUT ABOUT 2 TO3 MONTHS AGO I NOTICE THE AIR BAG LIGHT COMING ON WHICH IMMEDIATELY CONCERNED ME AND I REMEMBER HEARING ABOUT THE TAKATA AIR BAG RECALL, BUT DUE TO MY/MY WIFE WORK SCHEDULE IT WAS HARD TO GET TO A DEALER, BUT I RECALL RECEIVING NOTIFICATIONS, BUT I HONESTLY WILL HAVE SEARCH FOR THEM. ANYWAY I TOOK THE VEHICLE TO HAGERTY VOLKSWAGEN AND THEY TOLD ME THAT I MISSED THREE(3) FACTORY RECALLS AND IF I WANTED THEM DONE NOW I WOULD HAVE TO PAY OUT MY POCKET. THE AIR BAG LIGHT IS ON, I AM AFRAID OF BEING INJURED SERIOUSLY OR KILLED. THE DEALERSHIP SAYS IT'S THEY CAN DO ABOUT THE ISSUE BECAUSE THE VEHICLE IS  ONE WHICH WAS NOT TAGGED AS NEEDING ATTENTION, THAT'S MIGHTY NICE THAT MIKE HAGERTY OF ORLAND PARK FEELS THAT WAY. WHAT I WANT KNOW IS DOES THE NHTSA FEEL THAT CAR MANUFACTURE ARE SO HONEST THAT IF A TAX PAYING AMERICAN CITIZEN SHOULD BASE ON THE WORD OF A GLOBAL MANUFACTURE WHO ALREADY HAS BEEN CAUGHT USING DEFECTIVE PARTS. I RECEIVED SOMETHING ABOUT A RECALL, I EXPECT THAT THE NHTSA HAS ENOUGH EXPERIENCE AS TO CORRECT THE MANUFACTURE TO REPAIR A CLEARLY DANGEROUS SITUATION IN WHICH AND OTHERS MAY PERISH FROM AN UNFORESEEN EXPLOSIVE STEERING DEFAULT THAT THE MANUFACTURE AND TAKATA ARE MAKING EVERY EFFORT TO AVOID ANY RESPONSIBILITY/LIABILITY BY SIMPLY DENYING A FAULTY BAG WAS PLACED IN THIS PARTICULAR VEHICLE. I HAVE ALWAYS LOOK UPON EVERY INDIVIDUAL AS AN EQUAL, I WOULD APPRECIATE IT IF WHOM EVER PROCESSES THIS COMPLAINT. I DO NOT WANT TO DIE IN A CAR THAT I PAID FOR ACCORDING TO THE CONTRACT THAT I SIGNED, CAN VOLLKSWAGEN OF AMERICA AND IT PARENT COMPANY DO THE SAME. I PRAY YOUR AGENCY WILL REPRESENT ME.",
        "vin": "WVWAK73CX8E"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151084,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE RECALL FOR THE FUEL PUMP REPAIRED IN AUGUST 2018 BY THE WILMINGTON DEALERSHIP. I DON'T BELIEVE IT WAS EITHER DONE RIGHT OR HOWEVER THEY DID IT DID NOT FIX THE PROBLEM BECAUSE IN OCTOBER  2018 MY CAR IS HAVING THE RECALL PROBLEM STARTING AGAIN WHICH IS CAUSING GASOLINE TO RUN OUT IMMEDIATELY AND THIS TIME IT'S WORSE THAN BEFORE THE FUMES ARE NOW IN THE VEHICLE EVEN WHEN THE CAR ISN'T ON.  I BELIEVE I SHOULD HAVE THIS RECALL ISSUE REPAIRED AGAIN BECAUSE IT SHOULD NOT HAVE ONLY LASTED 2 MONTHS AND NEEDING THE FUEL PUMP MODULE TO BE REPLACED/REPAIRED AGAIN BUT PROBLEM IS WORSE THE SECOND TIME AROUND. ACCELERATION AND STALLING IS BECOMING MORE OF AN ISSUE AGAIN",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130587,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 VOLKSWAGEN PASSAT ENGINE CUT OFF WHILE I WAS DRIVING, IN THE MIDDLE OF TRAFFIC, I COULD HAVE BEEN KILLED IF I WAS ON THE EXPRESS WAY. FORTUNATELY, I WAS ON A CITY STREET AND WAS ABLE TO GET TO THE SIDE OF THE ROAD.",
        "vin": "WVWAK73C58P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121089,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING IN FROM SUNROOF. FOOT WELLS ON PASSANGER SIDE FILLED WITH WATER.  WATER DRIPS FROM SUN VISOR ATTACHMENT. AIR BAG FAULT LIGHT CAME ON SOON AFTER I NOTICED THIS.",
        "vin": "WVWRU73C98E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114741,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE FUEL PUMP WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS SERVICED BY AN UNKNOWN DEALER PER NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE CONTACT MENTIONED THAT THE FUEL PUMP WARNING INDICATOR REMAINED ILLUMINATED AFTER THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "WVWEK73C48E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112461,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT FUEL WAS LEAKING ONTO THE REAR SEATS OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT SCHEDULED AN APPOINTMENT FOR DIAGNOSTIC TESTING AND REPAIRS AT GEBHARDT VOLKSWAGEN (2470 49TH ST, BOULDER, CO 80301, (303) 444-1644). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "WVWLK73CX8E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111928,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE FUEL PUMP WATER PUMP AND POWER LOSS",
        "vin": "WVWAK73C48P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110421,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER (BOMMARITO CADILLAC INC., 4190 I-70 NORTH OUTER ROAD, ST PETERS, MISSOURI 63370) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE DEALER STATED THAT THE FUEL FILTER CAP WAS FRACTURED AND NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 123,373.",
        "vin": "WVWAK93C58E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109954,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES WHEN TURNING CORNERS",
        "vin": "WVWJK73C18E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2018",
        "dateOfIncident": "05/31/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109512,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SEIZED WHILE DRIVING ON ROADWAY DUE TO METAL SHAVINGS FROM \"CAM FOLLOWER\" FOR HIGH PRESSURE FUEL PUMP. A POOR CAMSHAFT LOBE DESIGN CAUSED METAL SHAVINGS FROM CAM FOLLOWER TO GOUGE INTO CAMSHAFT JOURNALS GUIDES OF CYLINDER HEAD. A KNOWN VW ISSUE, YET THEY HAVE NOT LOOKED TO HELP CONSUMERS. THE FSI 2.0L ENGINES ARE IN MILLIONS OF CARS THAT STILL MAY BE ON THE ROAD TODAY. MULTIPLE VW AND AUDI POPULAR MODELS.",
        "vin": "WVWJK73C38P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104566,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE LOST POWER, BUT WAS ABLE TO RESTART AFTER APPROXIMATELY TWENTY MINUTES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP MALFUNCTIONED. THE DEALER INFORMED THE CONTACT OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE) AND ADVISED HER TO CALL THE DEALER. THE CONTACT CALLED CHAPMAN VOLKSWAGEN OF NORTHEAST PHILADELPHIA AT 866-577-2408 (LOCATED AT 9371 ROOSEVELT BLVD, PHILADELPHIA, PA 19114) WHERE A RECALL REPAIR APPOINTMENT WAS SCHEDULED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "WVWAK73C78E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR AROUND JUNE 2017 VW SERVICE DEPARTMENT REPLACED FUEL PUMP AND MODULE/ O-RING DUE TO FUEL PUMP RUNNING WITH IGNITION OFF AND MODULE THAT GOES TO PUMP WAS VERY HOT.  COST WAS $946.98.   ON OR AROUND OCTOBER 2017 I RECEIVED A RECALL NOTICE FOR THE FUEL PUMP RUNNING CONTINUOUSLY RESULTING IN A DRAINED BATTERY. TO DATE, THIS REPAIR HAS NOT BEEN RELEASED AND IT HAS ALMOST BEEN A YEAR.  I WOULD LIKE TO BE REIMBURSED FOR MY REPAIRS.  MY CAR WAS STATIONARY WHEN THE ISSUES WAS FIRST NOTICED (DRAINED BATTERY REPEATEDLY).",
        "vin": "WVWAK73C48P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2018",
        "dateOfIncident": "06/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100659,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL INVOLVING MY 2008 VOLKSWAGON PASSAT SEDAN. THE FUEL PUMP RECALL. THERE ISN'T A REMEDY AND I JUST FEEL VERY UNSAFE UNTIL SOMETHING IS FIXED! I HOPE TO HEAR BACK FROM SOMEBODY SOON!",
        "vin": "WVWAK73C68E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100336,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE) AND STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO PERFORM THE REPAIR. THE DEALER (LOW COUNTRY VOLKSWAGEN, 1001 JOHNNIE DODDS BOULEVARD, MT PLEASANT, SOUTH CAROLINA 29464) CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWJK73C18P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100203,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS PUSHED TO AN INDEPENDENT MECHANIC AUTO SHOP AND IT WAS DIAGNOSED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBERS: 17V509000 (FUEL SYSTEM, GASOLINE) AND 18V148000 (AIR BAGS). THE CONTACT CALLED GANLEY WESTSIDE VOLKSWAGEN AT (440) 734-2000 (LOCATED AT 25580 LORAIN RD, NORTH OLMSTED, OH 44070) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 165,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE AND PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WVWJK73C88P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "08/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093911,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT WAGON. THE CONTACT STATED THAT THE CHECK ENGINE INDICATOR ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (PACIFIC VOLKSWAGEN, 14900 HINDRY AVE, HAWTHORNE, CA 90250) AND WAS INFORMED THAT THE VEHICLE WOULD NOT BE REPAIRED UNTIL THE PART WAS AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OPENED CASE NUMBER: 180395286. THE MANUFACTURER CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 71,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWXK93C38E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092033,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A STRONG GASOLINE SMELL BOTH INSIDE AND OUT WITH NO VISIBLE LEAKS. MECHANIC PERFORMED A SMOKE TEST AND FOUND A HAIRLINE CRACKS IN THE TOP OF THE FUEL PUMP THUS ALLOWING GASOLINE VAPORS TO ESCAPE. MECHANIC STATES HE HAS SEEN THIS PROBLEM SEVERAL TIMES BEFORE IN THESE VOLKSWAGENS.",
        "vin": "WVWJK73C18E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "04/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11091538,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 20 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS. THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 117,000. *TT",
        "vin": "WVWAK73C78P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090949,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE VEHICLE WAS NOT OPERABLE AFTER BEING STARTED. THE FAILURE OCCURRED WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE CONTACT WAS UNABLE TO GET THE RECALL REMEDY REPAIRED FOR FREE BECAUSE THE DEALER STATED THAT THE REPAIR HAD NOT BEEN FINALIZED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TOWED TO SCHUMACHER VOLKSWAGEN OF NORTH PALM BEACH (3720 NORTHLAKE BLVD, SUITE B, LAKE PARK, FL 33403) WHERE THE FUEL PUMP WAS REPLACED. THE MANUFACTURER WAS NOTIFIED AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE MANUFACTURER PROVIDED CASE NUMBER: [XXX]. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT",
        "vin": "WVWAK73CX8E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "04/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091054,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2008 VW PASSAT KOMFORT WAGON. AFTER BUYING THE VEHICLE WHILE DOING RESEARCH ON THE WEB COME TO FIND OUT THAT THE CAR HAS A BAD CAM FOLLOWER BAD CAM SHAFT AND HIGH PRESSURE FUEL PUMP.  VW KNOWINGLY SELLS THIS VEHICLE WITH AN INTERNAL ENGINE ISSUE TO CUSTOMERS WHEN THE ENGINE COULD BLOW UP AT ANY TIME CAUSING SEVERE SAFETY ISSUES.",
        "vin": "WVWLK93C98E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089700,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTED ENGINE FAILURE DUE TO TIMING FAILURE",
        "vin": "WVWAK73C58E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088607,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FOR THE FOLLOWING:  NO PART IS AVAILABLE TO FIX THIS AS OF YET. THE VEHICLE IS 10 YEARS OLD. I WANT TO SELL IT.    ON CERTAIN VEHICLES, THERE COULD BE AN INTERRUPTION IN ELECTRICAL POWER TO THE FUEL PUMP CONTROL MODULE. THIS COULD RESULT IN THE FUEL PUMP RUNNING CONTINUOUSLY, RESULTING IN A DRAINED BATTERY AND/OR A NO START CONDITION, OR CAUSE A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION, WHICH COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.  RECALL STATUS  RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE  REMEDY  REPLACE THE FUEL PUMP CONTROL MODULE AND RELOCATE IT WITHIN THE VEHICLE.  SAFETY RISK DESCRPITION  A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.",
        "vin": "WVWEK73CX8P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084466,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A RECALL FOR KNOWN ELECTRICAL PROBLEMS WHICH MAY CAUSE A LOSS OF STEERING WHILE DRIVING. I HAVE ATTEMPTED TO CONTACT MY LOCAL VW DEALERSHIP TO HAVE THEM LOOK INTO THE ISSUE BUT THEY FAIL TO OFFER A SOLUTION. THE VEHICLE ALSO HAS KNOWN FAULTY ELECTRICAL COMPONENTS IN THE STEERING WHEEL WHICH CAUSE AIRBAG FAULTS.",
        "vin": "WVWAK73C78E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/24/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'VE BEEN DRIVING MY CAR IT COMPLETELY SHUTS OFF, I LOSE POWER STEERING, ACCELERATION, BRAKING & NEED TO ALLOW THE CAR TO COME TO A STOP & THEN STUT IF OFF & TURN IT BACK ON. I HAVE TAKEN MY PASTA IN AND THEY ARE UNABLE TO FIND ANYTHING WRONG WITH IT. I FOUND THAT THERE IS A RECALL FOR MY VIN BUT NO AVAILABLE PARTS FOR A FUEL PUMP REPLACEMENT THAT WOULD CAUSE THE CAR TO SUDDENLY SHUT OFF. WHAT CAN I DO TO GET THIS REPLACED I'M SCARED TO KEEP DRIVING IT BECAUSE AT SOME POINT I WILL NOT BE SO LUCKY TO NOT HIT SOMEONE.",
        "vin": "WVWTK93C08E"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STARTED IT IMMEDIATELY SHUTS ITSELF OFF AND SAYS STEERING COLUMN LOCK DEFECTIVE. I TOOK IT TO THE DEALER TODAY AND THEY TOLD ME THIS COULD CAUSE MORE SERIOUS PROBLEMS WHILE DRIVING, ESPECIALLY THE AIRBAG SYSTEM. THIS SEEMS LIKE A VERY COMMON ISSUE WITH THESE CARS AND COULD POTENTIALLY LEAD TO LIFE THREATENING SITUATIONS WHILE DRIVING. A SIMPLE GOOGLE SEARCH REVEALS HOARDS OF PEOPLE WHO EXPERIENCE THE SAME ISSUE WITH THIS MODEL PASSAT.",
        "vin": "WVWAK73C98P"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080366,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUG 16,2017   MANUFACTURER RECALL NUMBER20AE  NHTSA RECALL NUMBER17V509  RECALL STATUSRECALL INCOMPLETE, REMEDY NOT YET AVAILABLE  SUMMARY  ON CERTAIN VEHICLES, THERE COULD BE AN INTERRUPTION IN ELECTRICAL POWER TO THE FUEL PUMP CONTROL MODULE. THIS COULD RESULT IN THE FUEL PUMP RUNNING CONTINUOUSLY, RESULTING IN A DRAINED BATTERY AND/OR A NO START CONDITION, OR CAUSE A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION, WHICH COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY. BATTERY WAS DEAD AFTER ONLY TWO YEARS HAD TO HAVE IT TOWED OFF HIGHWAY TIRES PLUS SAID CODE FUEL PUMP AND TRANSMISSION MODULE OPEN RECALL !",
        "vin": "WVWEK73C18E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "08/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079798,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (PAUL MILLER VOLKSWAGEN, 118 MORRISTOWN RD, BERNARDSVILLE, NJ 07924, 908-766-1600) AND WAS INFORMED THAT THE REMEDY WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT",
        "vin": "WVWXK73C28E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079072,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION THERE IS A SUDDEN LOSS OF POWER ON CITY STREETS OR ON THE HIGHWAY TURNING AND WHILE ACCELERATING",
        "vin": "WVWTK73C28E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "03/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079162,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER AND MANUFACTURER WERE NOT CONTACTED REGARDING PART AVAILABILITY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWLK73C68E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078654,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. UPON STARTING THE VEHICLE, A FUEL ODOR WAS DETECTED INSIDE THE VEHICLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER AND LOCAL VOLKSWAGEN DEALER WERE NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73C68P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075177,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (HERITAGE VOLKSWAGEN IN OWINGS MILLS, MARYLAND) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73C88P"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072319,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M CONCERNED THAT THERE COULD BE AN INTERRUPTION IN ELECTRICAL POWER TO THE FUEL PUMP CONTROL MODULE. THIS COULD RESULT IN THE FUEL PUMP RUNNING CONTINUOUSLY, RESULTING IN A DRAINED BATTERY AND/OR A NO START CONDITION, OR CAUSE A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION, WHICH COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.    IN ADDITION, THE AIRBAG RECALL IS A GREAT CONCERN. I'M ALSO CONCERNED FOR ANY OTHER RECALLS ASSOCIATED WITH MY VOLKSWAGEN.    NOW THAT TAKATA HAS SETTLED THE LAWSUIT, I HOPE MY CONCERNED CAN BE RESOLVED EXPEDITIOUSLY.",
        "vin": "WVWJK73C49P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072417,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT DID NOT CALL THE LOCAL VOLKSWAGEN DEALER OR THE MANUFACTURER BECAUSE THE RECALL NOTICE STATED THAT OWNERS WOULD RECEIVE A SECOND NOTICE WHEN PARTS BECAME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73C48E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "09/30/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066968,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED A COMPLETE LOSS OF POWER WHILE BEING DRIVEN APPROXIMATELY 50 MPH. ALSO, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT WAS GUARANTEED COMPENSATION, BUT ONLY IF THE MECHANIC USED VOLKSWAGEN MANUFACTURED PARTS. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWJK73C98E"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065594,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED EXCESSIVE ELECTRICAL POWER CONSUMPTION. THE CONTACT STATED THAT THE BATTERY HAD TO BE REPLACED THREE TIMES. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73CX88"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064304,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CHANGING THE PASSENGER-SIDE LOW-BEAM BULB, I FOUND WIRING TO ALL THREE BULB HOLDERS MISSING INSULATION, HAVING EXPOSED WIRES.  EVEN THE INTACT INSULATION IS VERY BRITTLE WHERE THE MINIMAL MOVEMENT OF THE WIRES, NECESSARY TO REPLACE ANY OF THE BULBS, CAUSES MORE INSULATION TO BREAK AWAY FROM THE BULB WIRING.  THERE IS NO WIRE WRAP, ELECTRICAL TAPE, NOR HEAT SHIELDING ON ANY OF THE WIRES WITHIN THE HEADLIGHT ASSEMBLY, LIKE WHAT I SEE ELSEWHERE WITHIN THE WIRING LOOM UNDER THE HOOD.  WHETHER THE DAMAGE TO THE WIRES IS INITIALLY FROM HEAT BUILD-UP WITHIN THE HOUSING OR ABRASION AGAINST ANY OF SEVERAL STAMPED METAL PIECES INTERNAL TO THE HOUSING, THE RESULT IS UNSAFE.  IF EACH LIGHT WERE INDIVIDUALLY FUSED, THEN THE WIRE GAUGE USED WOULD BE SUFFICIENT FOR A 55-WATT (HALOGEN) BULB.  HOWEVER, THE WIRE GAUGE IS NOT ENOUGH TO SURVIVE ANY SHORTING OF THESE WIRES, EITHER DIRECTLY AGAINST EACH OTHER OR THROUGH ANY METAL WITHIN THE HOUSING, BECAUSE IT WOULD HAVE TO PASS ENOUGH CURRENT TO BLOW THE COMMON FUSE.  LOSING A LIGHT SEEMS PALE IN COMPARISON TO THE RISK OF AN ELECTRICAL FIRE UNDER THE HOOD.  A QUICK GOOGLE OR YOUTUBE SEARCH REVEALS THIS PERSISTENT ISSUE OVER MANY MODELS AND YEARS OF VW, AUDI, AND OTHER MANUFACTURERS USING SIMILAR HELLA OR VALEO LIGHTING COMPONENTS.  I HAVE NOW EXPERIENCED THIS ON BOTH HEADLIGHTS ON MY 08 TOUAREG, WHICH I COMPLETELY REWIRED, AND NOW ON BOTH SIDES OF MY 08 PASSAT.  VOLKSWAGEN DOES NOT HAVE ANY SUPERCEDED PART FOR THE HEADLIGHT ASSEMBLIES, WHICH MEANS THEY HAVE NOT FIXED IT.  AS OPPOSED TO BUYING A REPLACEMENT HOUSING (~$340 EACH) WITH THE EXACT SAME SPECIFICATIONS, I WILL REWIRE THESE HOUSINGS WITH LARGER WIRE, HEAT-RESISTANT SHIELDING AND LOOM WRAP TAPE, JUST AS I HAD TO DO ON MY TOUAREG.  ANY OTHERS NOT SO MECHANICALLY INCLINED ARE TRAPPED WITH A POOR DESIGN THAT HELLA, VALEO, AND VW HAVE NOT RESOLVED.",
        "vin": "WVWAK73C38E"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063879,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL #17V509 FUEL PUMP CONTROL MODULE 8/16/17 I HAD TO HAVE THIS REPAIRED 1/6/18 AS IT WAS CAUSING MY CAR TO SHUT OFF WHILE DRIVING AND NOT START.  THE FOLLOWING WAS REPAIRED FUEL PUMP IN TANK WITH HIGH PRESSURE, MODULE, WASHER, FUEL PUMP CONTROL UNIT, FUEL PUMP CONTROLLER. THE VEHI",
        "vin": "WVWAK73CX8P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063419,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY TIMES THE CAR WON'T START. AFTER MANY TRIES, IT MAY START, BUT I HAVE BEEN LEFT IN VERY COLD AND UNSAFE PLACES WITHOUT THE ABILITY TO START THE CAR. I FEEL LIKE THIS IS AN ONGOING ISSUE FOR THESE CARS AND VW SHOULD OFFER AN INEXPENSIVE OR FREE FIX FOR THIS.",
        "vin": "WVWLK73C08E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062811,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A SAFETY RECALL FOR THE FUEL PUMP IN AUGUST 2017 (SAFETY RISK DESCRPITION LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.) AND IT STILL HAS NO FIX. THIS IS VERY WORRYING AS IT COULD LEAD TO SERIOUS INJURY FOR MY FAMILY. SOMETIMES IT SEEMS MY FUEL PUMP IS HOT UNDER THE REAR PASSENGER SEAT.",
        "vin": "WVWTK73C28E"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062752,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY WITH MY CAR IN MOTION WHEN MY CAR BEGAN TO SPUTTER AND STALL FORCING ME TO PULL OVER AND HAVE MY CAR TOWED HOME, WHERE IT ONLY STARTS AFTER TURNING OVER MULTIPLE TIMES AND WILL NOT SHIFT GEARS PROPERLY DUE TO AN IMPROPER FUEL PUMP NOT GIVING THE ENGINE ENOUGH FUEL.",
        "vin": "WVWJK73C48E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062547,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN TENSIONER FAILED CAUSING EXTENSIVE ENGINE DAMAGE RESULTING IN A REPAIR ESTIMATE OF 4500",
        "vin": "WVWJK73C18E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060741,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE VEHICLE EXPERIENCED SEVERE VIBRATION AND A LACK OF ENGINE POWER WHILE BEING OPERATED AT VARIOUS SPEEDS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. VOLKSWAGEN JACKSON (5320 INTERSTATE 55 NORTH FRONTAGE RD, JACKSON, MS) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 150,871. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73C58E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "03/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056092,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE OIL PRESSURE AND CHECK ENGINE INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO FINDLAY NORTH VOLKSWAGEN (7500 W AZURE DR, LAS VEGAS, NV 89130, (702) 982-4800) WHERE THE OIL WAS CHANGED; HOWEVER, THE FAILURE RECURRED AND THE VEHICLE STALLED. THE CHECK ENGINE AND OIL PRESSURE INDICATORS ILLUMINATED AGAIN. THE VEHICLE WAS TAKEN BACK TO FINDLAY NORTH VOLKSWAGEN WHERE NO DIAGNOSTIC FAILURE CODES WERE FOUND AND THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 101,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWJK73C68E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055807,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VW PASSAT IS UNDER RECALL FOR THE FUEL PUMP MODULE. THEY DO NOT HAVE A FIX YET AND THIS HAS BEEN SINCE AUGUST. I HAVE BEEN WITH A CAR THAT DOES NOT RUN. WHEN THIS FIRST STARTED THE DEALERSHIP KEPT SENDING ME AWAY NOT KNOWING WHAT THE PROBLEM WAS, THEN WE LEARNED ABOUT THIS RECALL AND IT IS EXACTLY WHAT IS HAPPENING TO OUR CAR. THE CAR WILL NOT RUN FOR MORE THAN 5 MIN. IT STALLS OUT. THE CAR WILL START OKAY AND AS SOON AS YOU BEGIN TO DRIVE YOU CANNOT PUMP THE GAS THE ENTIRE CAR TURNS OFF, THIS HAPPENED TWICE IN THE MIDDLE OF THE STREET TRYING TO GET TO A MECHANIC. THIS PART (FULE PUMP MODULE) CAUSES OUR BATTERY TO DRAIN WHICH HAS ALSO CAUSED OUR ALTERNATOR TO GO OUT. WE HAVE REPLACED THE ALTERNATOR BUT WE PUT IN A NEW BATTERY AND AS SOON AS WE DID THIS THE FUEL PUMP MODULE DRAINED IT AGAIN AND IT CONTINUES TO STALL EVERY 5 MIN, AT A POINT IT WILL NOT EVEN START. THIS HAS BEEN SINCE AUGUST AND VW HAS TOLD US THEY STILL DO NOT HAVE A REPAIR AND NOT ETA (LADY SAID IT COULD BE MONTHS TO YEARS!)",
        "vin": "WVWJK73C68E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "09/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055285,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE VEHICLE WAS INOPERABLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THEY REFERRED HIM TO A DEALER DUE TO A RECALL. THE VEHICLE WAS TOWED TO SCHUMACHER VOLKSWAGEN OF NORTH PALM BEACH (3720 NORTHLAKE BLVD, SUITE B, LAKE PARK, FL) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE CONTACT COVERED THE EXPENSE FOR THE FUEL PUMP. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THEY COULD NOT ASSIST WITH REIMBURSEMENT DUE TO A REMEDY NOT BEING MADE AVAILABLE. THE CONTACT WAS PROVIDED WITH CASE NUMBER: 171531952. THE FAILURE MILEAGE WAS APPROXIMATELY 35,605. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWAK73CX8E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE SUDDENLY STALLED AND ALL POWER WAS LOST. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE OR AFTER THE FAILURE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052265,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS EXHIBITING SEVERAL OF THE SYMPTOMS LISTED WITH REGARDS TO THE FUEL PUMP RECALL. VW HAS CONTACTED ME WITH NO ETA ON WHEN THE ISSUE CAN BE RESOLVED. VEHICLE IS EXHIBITING NO CRANK (STATIONARY) AND HAS LOST POWER (WHILE DRIVING) AND THE BATTERY WHICH WAS LESS THAN 3 YEARS OLD HAD TO RECENTLY BE REPLACED.",
        "vin": "WVWAK73C88E"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2017",
        "dateOfIncident": "04/25/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051885,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS SOMETIMES WHILE DRIVING--JUST A MOMENTARY HICKUP",
        "vin": "WVWXK73C18E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051519,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT CAME ON AND THE ENGINE STARTED RUNNING ROUGH. THE HIGH PRESSURE FUEL SENSOR FAILED RUINING THE CAMSHAFT AND ASSOCIATED PARTS. THE DEALER SAID THERE IS METAL IN THE OIL. ENGINE NEEDS TO BE REPLACED. THIS IS CONSISTENT WITH RECALL FOR 2007 VW 2.0T ENGINES BUT NO RECALL ON 2008S.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047867,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN A RECALL ON MY VEHICLE SINCE AUGUST 16, 2017 ON THE FUEL PUMP CONTROL MODULE AND AND IT IS GETTING WORSE AND WORSE ON MY VEHICLE AND MY VW DEALERSHIP SAID THEY CANT GET THE PRODUCT TO REPLACE IT AND THEY DON'T KNOW WHEN IT WILL BE IN.  I AM GETTING TERRIBLE GAS MILEAGE AND IT CUTS OUT, WHICH IS DANGEROUS.",
        "vin": "WVWJK73C68E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047617,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS  LIGHT CAME ON AND FLASHING BRAKE LIGHT WHOE DRIVING. THERE WAS ALSO A BEEP",
        "vin": "WVWCU73C68E"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/19/2017",
        "dateOfIncident": "11/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WON'T START BUT CHECK ENGINE LIGHT IS ON. I NEED MY CAR FIXED. IT SHOWS THERE IS A RECALL FOR THIS ON MY VEHICLE. IT SAYS REMEDY NOT YET FOUND. WHAT DOES THAT MEAN? I'M NOT GOING TO RESPONSIBLE FOR FIXING THIS. THIS LIGHT CAME ON WHILE DRIVING ON THE HIGHWAY. ONCE I STOPPED THE CAR IT WOULDN'T RESTART",
        "vin": "WVWJK73C18P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046995,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING 50MPH, THE INTERNAL TIMING BELT BELT AND TENSIONER BROKE IN THE ENGINE AND I LOST ALL CONTROL OF THE VEHICLE AND HAD TO PULL OVER DURING RUSH HOUR TRAFFIC. THE TIMING BELT SHOULD LAST THE LIFE OF THE MOTOR ACCORDING TO VW WHICH IS OBVIOUSLY NOT TRUE. SEVERE SAFETY HAZZARD. I HAD THE CAR TOWED TO VW DEALERSHIP AND AFTER TAKING THE ENGINE APART THAT IS THE DIAGNOSIS THEY GAVE ME.",
        "vin": "WVWAK73C38E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045796,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT RECALL NOTICE TOOK TO DEALERSHIP NOV. FIRST SHOWED RECALL CARD SERVICE MANAGER SAID I WOULD GET SOMETHING ELSE IN MAIL  AND THEN TO COME BACK. DEADLINE TO FILE CLAIM DEC. 17 2017.",
        "vin": "WVWAK73C08E"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043132,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 VOLKSWAGEN PASSAT HAS CUT OFF WHILE DRIVING. THERE IS NO WARNING LIGHT, IT SIMPLY TURNS OFF AND FLASHES THE BATTERY SIGNAL AND TURNS OFF. THE OTHER TIMES NO OTHER LIGHT IS PRESENT. DUE TO THIS ISSUE, CHANGED OUT FUEL PUMP,CRANK POSITION SENSOR, ENGINE HARNESS, SPARK PLUGS, O2 SENSOR, AND OIL CHANGE. ISSUE STILL PERSISTS. I ALMOST GOT HIT BY A SEMI TRUCK WHEN IT CUT OFF. THERE IS NO CHECK ENGINE LIGHT PRESENT AT ALL. THE BATTERY IS GOOD. IT'S AS IF I'M DRIVING AND THE FUEL CUTS OFF. I ALREADY CHANGED THE FUEL PUMP AND ENGINE HARNESS, DON'T KNOW WHAT ELSE COULD CAUSE THIS. BIG SAFETY ISSUE AS CAR GIVES NO WARNING AND JUST TURNS OFF WHILE ON HIGHWAY OR WHEN COMING TO A STOP SIGN WHILE THE CAR IS IN MOTION.",
        "vin": "WVWJK73C88E"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041550,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY  ON CERTAIN VEHICLES, THERE COULD BE AN INTERRUPTION IN ELECTRICAL POWER TO THE FUEL PUMP CONTROL MODULE. THIS COULD RESULT IN THE FUEL PUMP RUNNING CONTINUOUSLY, RESULTING IN A DRAINED BATTERY AND/OR A NO START CONDITION, OR CAUSE A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION, WHICH COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.  RECALL STATUS  RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE  REMEDY  REPLACE THE FUEL PUMP CONTROL MODULE AND RELOCATE IT WITHIN THE VEHICLE.  SAFETY RISK DESCRPITION  A LOSS OF MOTIVE POWER WHILE THE VEHICLE IS IN MOTION COULD INCREASE THE RISK OF A CRASH CAUSING INJURY AND/OR DAMAGE TO PROPERTY.  MANUFACTURER RECALL NUMBER  20AE  NHTSA RECALL NUMBER  17V509",
        "vin": "WVWTK73C68E"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041731,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELL OF GASOLINE INSIDE CAR",
        "vin": "WVWAK73CX8E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035719,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING AT A LOW SPEED, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE, BUT IT FAILED TO REMAIN ON. THE CONTACT WAS CLOSE TO HOME AND PUSHED THE VEHICLE BACK INTO HER DRIVEWAY. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE FUEL PUMP MODULE FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED SINCE IT WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V509000 (FUEL SYSTEM, GASOLINE). THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO CALL A DEALER. THE LOW COUNTRY VOLKSWAGEN DEALER (1001 JOHNNIE DODDS BLVD, MT PLEASANT, SC 29464 (843) 881-8555) WAS CONTACTED AND CONFIRMED THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL DECEMBER OR JANUARY. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "WVWAK73C88E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034776,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND NOTICED A LOSS OF POWER WITH THE ENGINE LIGHT ON. WHEN I COMPLETED THE TRIP, I FOUND THAT THE CAMSHAFT FOLLOWER HAD WORN ALL THE WAY THROUGH, LEAVING METAL FRAGMENTS INSIDE THE ENGINE. THE CAMSHAFT HAD WORN AWAY AT THE HIGH PRESSURE FUEL PUMP, WITH DAMAGE OCCURRING TO BOTH PARTS.   WHAT WAS ADDRESSED IN TECHNICAL BULLETIN 2015153 HAPPENED TO MY CAR AS WELL. THE ISSUE IS THAT VW DENIED TO HELP BECAUSE MY CAR WAS A 2008 MODEL YEAR, WITH A PRODUCTION DATE IN JANUARY OF 2008. THE RECALL AND WARRANTY EXTENSION APPLIED TO MODEL YEAR 2006-2007, BUT BECAUSE THE SAME EXACT FAILURE HAPPENED ON MY CAR IT SHOULD BE COVERED ALSO.",
        "vin": "WVWUK73C78E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "10/03/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034219,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD WARNING STATES \" STEERING COLUMN LOCK DEFECTIVE\"",
        "vin": "WVWUK73C98P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031567,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLING WHILE DRIVING   SAME ISSUE HAS HAPPENED TWICE WITHIN TWO MONTHS",
        "vin": "WVWXK73C98E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024571,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/19/2017 WHILE DRIVING ON THE FREEWAY COMING HOME FROM SOCCER PRACTICE THE HEADLINER CAME APART FROM THE ROOF CAUSING REAR VISIBILITY ISSUES.  WE CONTACTED VW CUSTOMER CARE AND THEY WILL NOT REPAIR DESPITE THERE BEING MANY OTHER VW OWNERS WHO HAVE EXPERIENCED THIS (PASSATWORLD FORUM).  WE HAVE OWNED EIGHT DIFFERENT CARS, HONDA, TOYOTA, ETC. AND HAVE NEVER HAD THIS HAPPEN SO THIS IS CLEARLY A VW DEFECT.",
        "vin": "WVWCU73C28P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022040,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022041,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOO MANY RECALLS!!!",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003539,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE DUE TO CAM SHAFT, HIGH PRESSURE FUEL PUMP, OIL PUMP, CAM SHAFT FOLLOWER. LOUD NOISE AND ROUGH SOUNDING ENGINE. CONSTANT WARNING LIGHT OF \"STOP! LOW OIL PRESSURE\"    PROBLEMS SIMILAR OR IDENTICAL TO THE 07 ENGINE THAT WAS RECALLED.",
        "vin": "WVWUK73C98E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003702,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT SPOKE TO HANSEL VOLKSWAGEN (2951 CORBY AVE, SANTA ROSA, CA 95407) WHO STATED THAT PARTS WERE NOT AVAILABLE AND DID NOT KNOW WHEN THEY WOULD ARRIVE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WVWUK73C28E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995420,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (BOMMARITO VOLKSWAGEN OF HAZELWOOD  LOCATED AT 400 BROOKES DRIVE HAZLEWOOD, MO 314-731-7777) AND WAS INFORMED THAT THE RECALL REMEDY PARTS WERE ON BACKORDER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 08/04/17*LJ    THE CONSUMER STATED THE VEHICLE WAS REPAIRED.  UPDATED 08/15/2017*JS",
        "vin": "WVWJK73C18E"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "03/25/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981137,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING BELT TENSIONER LET GO. THE CAR HAS 78000 MILES ON IT. AND A QUICK GOOGLE SEARCH RESULTED IN FINDING MANY INSTANCES AND A CLASS ACTION LAW SUIT OVER THIS ISSUE DO TO VWS RELUCTANCE TO ORDER A RECALL.",
        "vin": "WVWAK73C08E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980003,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I TOOK THE VEHICLE IN FOR THE TAKATA RECALL TO THE AUTOBARN CITY VOLKSWAGEN LOCATED IN CHICAGO, IL.  THE FIRST TIME I TOOK IT IN, ON MARCH 31ST, THE CONSULTANT TOLD ME THAT IT WAS TOO LATE TO WORK ON IT EVEN THOUGH I BROUGHT IT IN AT 5 PM WHILE THEY CLOSED AT 7 PM.  THE OPTION THEY GAVE ME WAS TO LEAVE THE CAR OVERNIGHT AND PICK IT UP THE NEXT DAY.  I NEEDED THE CAR OVER THE WEEKEND SO THEY RESCHEDULED MY APPOINTMENT TO THE FOLLOIWNG SATURDAY, THE 8TH.  ON THE 8TH, I HAD THE LUCK TO SPEAK WITH A DIFFERENT CONSULTANT BY THE NAME OF BRAYNER ASATOURI. WHEN HE FOUND OUT THAT THE VEHICLE HAD A RE-BUILT TITLE HE TOLD ME THAT THEY WILL NOT BE DOING THE RECALL. HE TOLD ME TO HOPE THAT THE AIRBAG DOES NOT MALFUNCTION WHILE IM IN THE VEHICLE BUT THAT THERE WAS NOTHING THEY CAN DO ABOUT IT AND THAT I WAS NOT THE FIRST RECALL HE HAD TO SEND HOME.  IT LEFT ME WONDERING THAT I SHOULD JUNK THE CAR IF THERE WAS A CHANCE OF SOMEBODY BEING HARMED BY THE AIRBAG.  WITH A LITTLE RESEARCH AND MANY CALLS TO THE VOLKSWAGEN CARE TEAM, AN INVESTIGATION WAS STARTED AND IT TURNS OUT THAT THE CONSULTANT GAVE ME FALSE INFORMATION.  I HAVE TO USE THE VEHICLE TO GO TO WORK, GO PLACES AND DO SOME EVERYDAY DAY ACTIVITIES. WHILE THE INVESTIGATION WAS GOING ON, I HAD TO USE THE VEHICLE FOR TWO WEEKS BEFORE THEY COULD WORK ON THE CAR.  FOR TWO WEEKS I WAS PUT AT RISK AND EVERYBODY AROUND ME BECAUSE A VOLKSWAGEN SERVICE CONSULTANT  WOULD NOT WORK ON THE TAKATA AIRBAG RECALL.  HE DID NOT MAKE ANY EFFORT TO FIND OUT FROM HIS SUPERIORS IF THE CAR QUALIFIED FOR THE REPAIR LET ALONE EXPLAIN SOME OPTIONS TO MAKE THE VEHICLE SAFER.  FORTUNATELY, NOTHING HAPPENED DURING THE TIME THAT THEY REJECTED TO WORK ON THE VEHICLE BUT IF SOMETHING WOULD HAVE HAPPENED, I DONT KNOW HOW THE DEALER WOULD REACT SINCE THEY NEGLECTED THE SAFETY RECALL. WHO KNOWS HOW MANY VEHICLES HAVE BEEN NEGLECTED IN THIS DEALER?",
        "vin": "WVWXK73C38E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970920,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PART DISTRIBUTION DISCONNECT.",
        "vin": "WVWXK73C98E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970692,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PART DISTRIBUTION DISCONNECT.",
        "vin": "WVWJK73C58E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968889,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WVWJK73C58E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968934,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WVWXK73C38E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2017",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968134,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: WE GOT A LETTER FROM VW IN APRIL 2016 ABOUT THIS. I CALLED THE DEALER THIS WEEK AND THEY STILL HAVE NO REPAIR FOR THE PROBLEM. IT'S DANGEROUS AND IT'S BEEN A LONG TIME, SO I DON'T UNDERSTAND THE DELAY.     THE DATE BELOW IS THE APPROXIMATE DATE OF THE FIRST LETTER.    THE LETTER IDENTIFIES THE PROBLEM AS: NHTSA 16V078, SAFETY RECALL 69M9",
        "vin": "WVWJK73C18P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966214,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "WVWJK73C38P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "02/09/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN OVER A YEAR SINCE THIS RECALL WAS EXPANDED TO INCLUDE VW, YET NEITHER THE DEALERS, NOR THE MANUFACTURER HAVE PARTS TO SUPPORT THE RECALL; YET PARTS ARE CLEARLY AVAILABLE AS VEHICLES ARE STILL BEING PRODUCED.  VOLKSWAGEN'S FAILURE TO PROVIDE REPLACEMENT PARTS FOR A SAFETY RELATED RECALL WITH THE POTENTIAL TO INFLICT SERIOUS BODILY INJURY OR DEATH IS UNCONSCIONABLE AND RECKLESS.  OVER A YEAR SINCE THE RECALL BEGAN AND THEY STILL DO NOT HAVE A TIMELINE OF WHEN PARTS MAY BE AVAILABLE, THIS CLEARLY SEEMS TO BE AN ISSUE OF MOTIVATION.  INSTEAD THEY JUST SENT LETTERS THAT A RECALL EXISTS, NOT VERY HELPFUL IN CORRECTING A SAFETY ISSUE WITH LIFE THREATENING POTENTIAL; YET OTHER VEHICLES HAVE COMPLETED NEARLY 13 MILLION CORRECTIONS.",
        "vin": "WVWJK73C38P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE (2008 VW PASSAT) STARTED HAVING ACCELERATION ISSUES AND WOULD ONLY GO UP TO 40 MPH AS WELL AS ALSO HAVING A ROUGH START UP WHEN TURNING MY CAR ON.  I PROCEEDED TO TAKE IT INTO THE DEALERSHIP TO HAVE THIS LOOKED AT AND AT FIRST THEY CLAIMED THAT I NEEDED A NEW HIGH PRESSURE FUEL PUMP WHICH WOULD COST ME AROUND $700.  LATER IN THE DAY, I RECEIVED A CALL BACK TELLING ME THAT MY INTAKE CAMSHAFT WAS BROKEN AND THAT THEY COULD NOT MAKE THE REPAIR WITHOUT REPLACING THIS AS WELL.  NOW MY TOTAL WAS UP TO $2000.  AFTER DOING SOME RESEARCH AND CALLING AROUND TO COMPARE PRICES, I TALKED TO A REPAIRMAN THAT HAD TO REPLACE HIS CAMSHAFT IN THE SAME YEAR VW CAR BECAUSE OF SIMILAR ISSUES.  I FOUND THAT MY MODEL 2008 VW PASSAT WAS BUILT WITH A FAULTY INTAKE CAMSHAFT REVISION B WHICH WAS FOUND TO BE ABRASIVE AND CAUSING FRICTION WITH THE FUEL PUMP.  SINCE 2008 VW FOUND A SNEAKY WAY TO REPLACE THIS WITH A REVISION A CAMSHAFT AND NOT RECALL THE PREVIOUS PART, WHICH HAS NOW, OVER TIME CAUSED MY $2,000 PROBLEM AND COULD HAVE PUT MY FAMILY AT RISK OF AN ACCIDENT DUE TO ACCELERATION ISSUES.  I GUESS THIS REPAIR WOULD HAVE FALLEN UNDER MY POWERTRAIN WARRANTY, WHICH HAS SINCE EXPIRED, BUT MOST CAR ISSUES TAKE LONGER THAN THE WARRANTY PERIOD ANYWAYS, ESPECIALLY THOSE WHICH OCCUR OVER TIME WITH FAULTY PARTS.  I HAVE TALKED TO VW AND THEY CANNOT DO ANYTHING FOR ME AND THERE IS NOT AN OPEN RECALL ON THIS PART AND NEVER HAS BEEN.  THE ISSUE WAS JUST PUSHED UNDER THE RUG, HOPING TO BE IGNORED FOREVER.  UNTIL NOW, I WILL NOT ALLOW OTHER TO SUFFER WHAT I AM GOING THROUGH NOW AND VW HAS A BAD REPUTATION WITH BEING DISHONEST RIGHT NOW SO WHY WOULDN'T THEY HIDE YET ANOTHER ISSUE?  PLEASE LOOK INTO THIS FOR ME AND PROVIDE ME WITH FURTHER STEPS TO TAKE ACTION.  *TR",
        "vin": "WVWEK73CX8E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940373,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL SUBJECT: AIR BAGS > FRONTAL > DRIVER SIDE INFLATOR MODULE  WE RECEIVED THE LETTER OF RECALL FOR ALMOST ONE YEAR, BUT EVERY TIME WE CHECK WITH VW, THEY KEPT REPLIED THE PARTS HAVE NOT ARRIVE.THAT LEAVE US TO BELIEVE WE ARE DRIVING AN UNSAFE CAR.  *TR",
        "vin": "WVWXK73C88E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933731,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT APPEARED WHILE DRIVING AND I BROUGHT TO SERVICE STATION WHERE I WAS INFORMED THAT THE TIMING CHAIN HAD FAILED DUE TO THE TENSIONER.  AFTER RESEARCHING ON THE INTERNET I FOUND THAT THIS IS A SAFETY ISSUE THAT VW HAS KNOWN ABOUT SINCE THE EARLY 2000'S.  *TR",
        "vin": "WVWAK73C88E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2016",
        "dateOfIncident": "04/22/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929819,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG  I RECEIVED A SAFETY RECALL 16V078 BUT THERE IS STILL NO SOLUTION, HOW LONG DO THEY HAVE TO REMEDY THE SITUATION? THIS IS MY DAUGHTERS CAR AND I WOULD LIKE TO GET THIS DONE ASAP  THX [XXX] .    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WVWJK73C98E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927739,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND IGNITION.COIL FAILURE IN 1 MONTH PERIOD.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926861,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWXK73CX8E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924523,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTIFICATION OVER 1 YEAR AGO ABOUT ISSUE, TOLD TO WAIT FOR FURTHER INSTRUCTTIONS NONE HAS BEEN RECEIVED. VEHICLE SAFETY ISSUE NOT REMEDIED",
        "vin": "VWVJK73C)8P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918107,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM IGNITION COILS (06F905115F) SEEM TO HAVE A DESIGN FLAW. CHANGED ONE AND NOW ANOTHER ONE HAS WENT BAD. CAR LOST SOME OF ITS POWER WHEN ON THE INTERSTATE. THERE WAS RECALL FOR EARLIER YEAR MODELS OF THE SAME VEHICLE. HOWEVER THE 2008 MODEL IS NOT INCLUDED IN THE RECALLS.",
        "vin": "WVWJK73C18E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2016",
        "dateOfIncident": "09/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES VEHICLE STALLS UPON STARTING AND THEN WILL RESTART. THE VEHICLE SOMETIMES SHAKES AND SPUTTERS AND THEN STALLS WHILE STOPPED. ALSO, MANY TIMES CAR WILL STALL WHEN VEHICLE IS MOVING SOMETIMES AT HIGH SPEEDS WITH NO WARNING AND HAS ALMOST RESULTED IN NUMEROUS ACCIDENTS DUE TO STALLING IN MIDDLE OF ROAD OR HIGHWAY. THIS HAS BEEN HAPPENING WELL OVER A YEAR.",
        "vin": "WVWXK73C78E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907576,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS    I HAD RECEIVED A NOTICE FROM VW AUTO COMPANY IN THE MONTH OF MARCH THAT THERE IS A PROBLEM WITH THE DRIVER SIDE SAFETY AIR BAG. HERE IS WHAT IT SAID \"AKATA HAS REPORTED THAT THE DRIVER FRONTAL AIRBAG INFLATOR COULD POTENTIALLY RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WHERE THE FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. IN THE EVENT OF AN INFLATOR RUPTURE, METAL FRAGMENTS COULD PASS THROUGH THE AIRBAG CUSHION MATERIAL, WHICH MAY RESULT IN SERIOUS INJURY OR DEATH TO VEHICLE OCCUPANTS.\"     IT CLEARLY SAYS THAT THIS ISSUE MIGHT RESULT IN SERIOUS INJURY OR EVEN DEATH IN CASE OF AN ACCIDENT. I DRIVE MY VW WITH MY KIDS IN IT AND GOD FORBID, IF SOMETHING WERE TO HAPPEN, IS VW TAKING THE RESPONSIBILITY FOR ANY LOSSES INCUR?     I AM SURPRISED NO ACTION HAS BEEN TAKEN AS YET TO FIX THIS PROBLEM. I AM SCARED TO DRIVE THIS CAR AROUND NOW. THE THOUGHT THAT ANYTHING CAN HAPPEN TO MY FAMILY MEMBERS DURING AN EVENT HAS TAKEN AWAY THE PEACE OF MIND FROM ME. THE LEAST I EXPECT FROM VW IS TO AT LEAST GIVE A COURTESY VEHICLE UNTIL THEY RESOLVE THIS ISSUE.",
        "vin": "WVWJK73C08P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904407,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE PARTS HAVE BEEN OUTSTANDING SINCE APRIL AND VOLKSWAGON DOES NOT HAVE ANY ETA FOR THE TAKATA PARTS FOR AIR BAG RUPTURES.",
        "vin": "WVWJK73C58P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899446,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWJK73CX8P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898717,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE CAR/ENGINE IN THE MORNING AND MIL CAME ON ROUGH START WITH RATTLING IN ENGINE BAY.  BROUGHT TO VW DEALERSHIP.  THEY INDICATED THE OIL SCREEN IN FRONT OF THE CHECK VALVE IN THE CAM SHAFT POSITIONER BRIDGE \"HAS COME APART LODGING ITSELF BETWEEN THE CAMSHAFT ADJUSTER [VALVE] AND INTAKE CAMSHAFT ADJUSTER.\"       IT APPEARS THIS IS A RECOGNIZED PROBLEM FOR 2009 AUDI A3, A4, TT PER TSB 15-11-21.  HOWEVER, THE ISSUE IS NOT RECOGNIZED FOR OTHER (VW) VEHICLES WITH SAME ENGINE GROUP.    THOUGH I UNDERSTAND THE OTHER COMPLAINTS BELOW ARE ANECDOTAL WITH REPAIRS RANGING FROM $700 TO $4,000 DEPENDING ON THE EXTENT OF INTERNAL DAMAGE, I COULD NOT FIND ANYONE RESEARCHING THIS ISSUE REGARDING CAUSES AND OCCURRENCES THAT MAY ELEVATE THIS PROBLEM TO A RECALL:   HTTP://FORUMS.VWVORTEX.COM/SHOWTHREAD.PHP?7118356-MISFIRE-AND-CAM-CRANK-CORRELATION-ERROR HTTP://WWW.EXCELERATEPERFORMANCE.COM/NEWS/2-0T-TSI-TIMING-CHAIN-TENSIONER  HTTP://FORUMS.ROSS-TECH.COM/SHOWTHREAD.PHP?5312-CCTA-TSI-VALVE-ACTUATOR-PROBLEM/PAGE2  HTTP://WWW.GOLFMK6.COM/FORUMS/SHOWTHREAD.PHP?S=AA587752110817FA3F1148944194E2BC&T=60320&PAGE=2",
        "vin": "WVWTK73CX8E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898494,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BEGAN MAKING A LOUDER THAN USUAL SOUND. THERE WERE NOT ANY CHECK ENGINE LIGHTS.  I TOOK THE CAR TO THE GARAGE AND  WAS TOLD THAT MY CAMSHAFT FOLLOWER WAS WORN COMPLETELY THROUGH CAUSING DAMAGE TO CHAIN AND PUMP.  NEED TO REPLACE FUEL HIGH PRESSURE PUMP, CAMSHAFT, TIMING CHAIN TENSIONER CAM FOLLOWER AND VACUUM PUMP. LUCKILY I GOT IT TO THE GARAGE BEFORE EVEN MORE DAMAGE OCCURRED AND THE ENGINE JUST STOPPED.",
        "vin": "WVWLK73C88E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA SAFETY RECALL NOTICE 69M9",
        "vin": "WVWJK73C98E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "02/06/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892551,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  NHTSA 16V078  MAN. # 69M9  RECALL ISSUED 6 MONTHS AGO AND \"NO REMEDY AVAILABLE\" STILL.",
        "vin": "WVWHK73CX8P"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888855,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WOULD SHUT OFF WITHIN 1-90 SECONDS AFTER STARTING, THEREBY DISABLING ALL ACCESSORIES INCLUDING POWER STEERING & BRAKES, CAUSING LOSS O CONTROL OF VEHICLE, SOMETIMES WHILE AT HIGH SPEED ON HIGHWAY.     DIAGNOSED BY LOCAL SHOP AS A FAILURE OF THE CAM FOLLOWER, WHICH WORE THROUGH, IN TURN CAUSING FAILURE OF THE HIGH PRESSURE FUEL PUMP, AS WELL AS SCORING OF THE INTAKE CAMSHAFT, NECESSITATING REPLACEMENT OF ALL THREE COMPONENTS.",
        "vin": "WVWJK73C78E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863112,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WVWXK73C58E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "02/21/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852815,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY IN THE RAIN THE CAR WOULD STALL WHICH CAUSED US TO HAVE TO PULL TO THE SIDE OF THE ROAD. AN ENGINE CODE INDICATED A FAULTY PART. THE PART WAS REPLACED, THEN THE SAME ISSUE OCCURRED AFTER A CAR WASH. IT WAS DISCOVERED THAT WATER HAD GOTTEN INTO THE WIRING HARNESS AT AN AREA AT THE BASE OF THE WINDSHIELD AND CAUSED A SHORT.  IN THIS AREA OF THE WIRING HARNESS THERE IS A JUNCTION THAT WE WERE TOLD WAS NOT WATER PROOF OR SEAL AGAINST WATER. THIS SHORT DAMAGED THE ELECTRONIC CONTROL MODULE WHICH MADE THE CAR UNDRIVEABLE.",
        "vin": "WVWEK73C08E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851503,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMALLY ON THE HIGHWAY AND THE VEHICLE SUDDENLY STOPPED RUNNING. VEHICLE WOULD NOT RESTART. AAA ADVISED AND VEHICLE DELIVERED TO MY LOCAL VW MECHANIC. I ADVISED VW AND THEY NEVER HEARD OF THAT PROBLEM. FUEL PUMP NEEDED TO BE REPLACED. CAR HAS 35000 MILES. VW CUSTOMER SERVICE ADVISED ME THAT THE 2008 PASSAT IS NOT INCLUDED IN ANY CAMPAIGN, SUCH AS A RECALL OR WARRANTY EXTENSION. FUEL PUMP WAS REPLACED.",
        "vin": "WVWEK73C98E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838711,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE WOULD NOT SHIFT INTO HIGH GEAR. IN ADDITION, WHEN THE SHIFTER WAS MOVED INTO DRIVE OR REVERSE AND THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO FUNCTION. THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 208,000.",
        "vin": "WVWJK73C18P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824754,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMALLY ON THE HIGHWAY AND THE VEHICLE SUDDENLY STOPPED RUNNING. VEHICLE WOULD NOT RESTART.  AAA ADVISED AND VEHICLE DELIVERED TO MY LOCAL VW MECHANIC. I ADVISED VW AND THEY NEVER HEARD OF THAT PROBLEM.   FUEL PUMP NEEDED TO BE REPLACED.   CAR HAS 35000 MILES.   VW CUSTOMER SERVICE ADVISED ME THAT THE 2008 PASSAT IS NOT INCLUDED IN ANY CAMPAIGN, SUCH AS A RECALL OR WARRANTY EXTENSION.  FUEL PUMP WAS REPLACED. COST $600",
        "vin": "WVWAK73C98E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "12/29/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817526,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCK MALFUNCTION, THE VEHICLE WILL TURN OVER BUT NOT FIRE. EVERY NOW AND THEN IT WILL FIRE AND THEN IMMEDIATELY DIE. LUCKILY IT WENT OUT WHILE MY VEHICLE WAS PARKED, IF IT WERE TO MALFUNCTION WHILE DRIVING IT COULD BE VERY DANGEROUS",
        "vin": "WVWLK73CX8E"
    },
    {
        "components": "SEATS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "05/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790211,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 30 MPH, THE FRONT DRIVER'S SEAT AND THE DRIVER SIDE MIRROR MOVED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND A DEALER. THE DEALER REPLACED THE FRONT DRIVER SIDE MIRROR. THE FAILURE PERSISTED AFTER THE REPAIR WAS PERFORMED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "WVWEK73C78P"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "10/25/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786653,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT WHILE AT A STOP, THE LOW BEAM HEAD LAMPS FAILED TO ILLUMINATE. THE VEHICLE WAS TAKEN TO A DEALER WHO DIAGNOSED THAT THE BULBS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO A DEALER WHO DIAGNOSED THAT THE HEAD LAMP ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "WVWJK73C38P"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "09/25/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781872,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNED BY  OTHER OWNERS OF 2006-08 PASSATS, I INSPECTED THE HIGH PRESSURE FUEL PUMP, CAM, AND CAM FOLLOWER FOR ABNORMAL WEAR. THE HIGH PRESSURE FUEL PUMP (HPFP) CAM FOLLOWER HAS BEEN RECOGNIZED AS A FLAW REQUIRING WARRANTY EXTENSION TO 120,000 MILES ON THE 2006-2007 MODELS. THIS FAULT CAUSES FAILURE OF THE CAM FOLLOWER AND THE FUEL PUMP SHAFT WEARS INTO THE CAMSHAFT CAUSING LOSS OF FUEL/SPEED, ACCELERATION, OR ENGINE POWER UPON FAILURE. MY VEHICLE EXHIBITS IDENTICAL EARLY WEAR AND FAILURE AS 2006-07 MODELS, THOUGH VW REFUSES TO EXTEND WARRANTY COVERAGE FOR 2008 CARS. FURTHER CONSIDERATION OF 2008 VEHICLES WITH THE IDENTICAL PROBLEM SHOULD BE CONSIDERED. VOLKSWAGEN CUSTOMER SERVICE HAS BEEN CONTACTED BY SEVERAL AFFECTED OWNERS IN THIS MATTER AND IS UNWILLING TO ACKNOWLEDGE THAT THIS FLAW RECOGNIZED IN 06-07 VEHICLES EXTENDS INTO SOME 2008 VEHICLES AND IS DENYING COVERAGE OF THIS SAFETY/EMISSIONS ISSUE. VW CUSTOMER CARE HAS DENIED ANY FLAW OR EXTENDED WARRANTY FOR 2008 2.0T OWNERS DESPITE THE WARRANTY EXTENSION FOR PRIOR MODEL YEARS FOR THE EXACT SAME PROBLEM.",
        "vin": "WVWLK73CX8E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2015",
        "dateOfIncident": "10/10/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781388,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS ACCUMULATING ON THE CARPET OF THE PASSENGER SIDE...BOTH FRONT AND REAR...  HAPPENS AFTER A RAINFALL. CARPETS GET SOAKED. NO OTHER VISIBLE WATER DAMAGE ON THE INTERIOR. VEHICLE DOES HAVE A MOON ROOF.",
        "vin": "WVWAK73C98E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2015",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777697,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS \"CERTIFIED PRE-OWNED\" VEHICLE HAS CONSISTENTLY PERFORMED DANGEROUSLY AND UNRELIABLY SINCE IT WAS PURCHASED. THE CAR WOULD NOT START ON SO MANY OCCASIONS THAT WE LOST COUNT. WHEN THE CAR WOULD START, IT WOULD CUT OFF WITHOUT WARNING IN THE MIDDLE OF DRIVING IT DOWN THE ROAD, COMING OFF OF EXIT RAMPS, AND ON BUSY HIGHWAYS, NOT EVEN GIVING THE DRIVER AN OPPORTUNITY TO PULL OVER. THE ENGINE WOULD REV AT UNEXPECTED TIMES, CAUSING THE CAR TO WANT TO MOVE FORWARD EVEN WHEN THE BRAKE WAS BEING DEPRESSED. THE CAR WOULD WANT TO MOVE FORWARD AT STOP LIGHTS, IN TRAFFIC, AND IN PARKING GARAGES. THE ENGINE WOULD ALSO RUN LOUDLY AND AT A VERY HIGH RPM ANY TIME THE AIR CONDITIONER WAS ON. THESE CONCERNS WERE REPORTED TO THE DEALER ON NUMEROUS OCCASIONS. WE HAVE EMAILS FROM THE SERVICE MANAGER SAYING THAT THERE IS NOTHING WRONG WITH THE CAR. IT WOULD CUT OFF AND REQUIRE TOWING THE SAME DAY IT WAS BOTH DROPPED OFF AND PICKED UP FROM THE DEALERSHIP FOR THIS VERY REASON.  THE VEHICLE IS NOW PARKED AT THE SERVICE DEPARTMENT OF THE DEALERSHIP BECAUSE IT IS COMPLETELY UNDRIVEABLE. WE HAVE REACHED OUT TO VOLKSWAGEN GROUP OF AMERICA. THEIR SOLUTION IS TO ALLOW THE CAR TO GET REPOSSESSED, AND THEY WILL GLADLY SELL US ANOTHER VEHICLE. THIS IS OUT OF THE QUESTION. PAYMENTS CONTINUE TO BE MADE ON THE CAR.",
        "vin": "WVWCU73C38P"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2015",
        "dateOfIncident": "02/06/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682799,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT PROMPTED ME TO TAKE MY 2008 VW PASSAT 2.0T TO THE DEALER TO HAVE CODE READ.  ADVISED IT WAS A MALFUNCTION OF THE CAMSHAFT AND THE HIGH PRESSURE FUEL PUMP (HPFP) CAM FOLLOWER THAT HAS BEEN RECOGNIZED AS A FLAW MERITING WARRANTY EXTENSION ON THE 2006-2007 MODELS.  I HAVE BEEN INFORMED THAT THE 2007 MODEL YEAR WAS PRODUCED THROUGH 7/2007.  MY VEHICLE WAS MANUFACTURED IN 8/2007 AND THUS HAS THE 2008 MODEL YEAR, BUT THE DEALERSHIP SERVICE MANAGER INFORMED ME THAT THIS WAS THE SAME PARTS AND THE SAME PROBLEM AS THE PRIOR YEARS WITH EXTENDED WARRANTY.  THIS FAULT CAUSES PREMATURE WEAR ON THE CAM FOLLOWER AND THE HPFP ROD WEARS INTO THE CAMSHAFT CAUSING LOSS OF FUEL/SPEED, ACCELERATION, OR ENGINE POWER UPON FAILURE.  SEEING AS HOW MY VEHICLE HAS THE SAME BUILD AS THOSE OF PREVIOUS MODEL YEARS THAT WERE INCLUDED IN THE WARRANTY EXTENSION, FURTHER CONSIDERATION OF 2008 VEHICLES WITH THE IDENTICAL PROBLEM SHOULD BE CONSIDERED.  VOLKSWAGEN CUSTOMER SERVICE HAS BEEN CONTACTED BY SEVERAL AFFECTED OWNERS IN THIS MATTER AND IS UNWILLING TO ACKNOWLEDGE THAT THIS FLAW RECOGNIZED IN 06-07 VEHICLES EXTENDS INTO SOME 2008 VEHICLES AND IS DENYING COVERAGE AND DISREGARDING THE SAFETY ISSUE THAT FOLLOWS FAILURE OF THE CAMSHAFT DUE TO THE EROSION OF THIS PART.  VW CUSTOMER CARE WAS NOT ABLE TO PRODUCE PROOF THAT MY VEHICLE HAD DIFFERENT OR IMPROVED PARTS BY WAY OF A DIFFERENT SET OF PART NUMBERS INSTALLED.  THE TECHNICIANS CONFIRMED THAT MY CAMSHAFT WAS IDENTICAL TO THE RECALLED CAMSHAFT, AND THE CAM FOLLOWER WEAR WAS SO EXTREME THAT THE HPFP ROD WAS ERODING THE CAM SURFACE DIRECTLY. VW CUSTOMER CARE HAS DENIED ANY FLAW OR EXTENDED WARRANTY FOR 2008 2.0T OWNERS DESPITE THE WARRANTY EXTENSION FOR PRIOR MODEL YEARS FOR THE EXACT SAME PROBLEM.  *TR",
        "vin": "WVWTK73C78E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671439,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE STALLED AND ALL THE WARNING LIGHTS ILLUMINATED. THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 165,000.",
        "vin": "WVWJK73CX8P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2014",
        "dateOfIncident": "11/22/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662594,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS ALL ABOUT VW PASSAT 2008 2.0T, IT WAS A RAINY DAY ON SATURDAY (NOV-14) ENGINE STARTED MISFIRE AND GAVE FLASHING ENGINE CHECK LIGHT, IMMEDIATELY WENT TO SEE THE VW SERVICE TO GET THE FEEDBACK, SERVICE GUY GUESSED IT MIGHT CAUSED DUE TO MISFIRE IN ONE OR MORE CYLINDER AND TOOK VEHICLE BACK WITH ENGINE FLUID TOPOFF, ON THE WAY BACK HOME THE ENGINE CHECK LIGHT CAME AND STAYED CONSTANT. SO ON MONDAY MORNING WENT TO VW SERVICE TO GET FULL DIAGNOSE, SERVICE GUY GAVE  P300 AND P301 AS RANDOM MISFIRES AND DID ADDITIONAL FINDINGS SAYING INTAKE MANIFOLD NEEDS DE-CARB WITH $1000+ IN SERVICE CHARGE, I DECLINED THE REPAIR AND GOT THE VEHICLE BACK WITH CLEARED CODE. NOW THE ENGINE IS NOT RUNNING SMOOTH AND SEEMS IT LOST TURBO POWER. EVEN DURING FREEWAY TAKE OVER IF I PRESS HARD ON GAS PEDDLE ENGINE LIGHT FLASHES FOR COUPLE TIMES AND THERE IS NO FASTER PICK UP TO DO SMOOTH OVER TAKE, IF I CHOOSE RUN VEHICLE UNDER THIS CONDITION IT MAY NOT BE SAFE ON ROADS. I READ SIMILAR COMPLAINTS REPORTED HERE. PLANNING TO TAKE BACK TO SERVICE CENTER TO SEE IF THEY GOT ANY POSSIBLE RECALL UPDATES FROM VW.   *TR",
        "vin": "WVWJK73C28E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653034,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MERGING ONTO AN ON-RAMP ON A TOLL ROAD, AT APPROXIMATELY 50 MPH, THE STEERING TRIED TO PULL THE CAR IN THE OPPOSITE DIRECTION OF THE ONE I WAS TURNING.  THIS WAS A \"CLOVERLEAF\" ON-RAMP, WITH A TIGHT TURNING ANGLE.  I IMMEDIATELY SLOWED DOWN TO ABOUT 30 OR 35 MPH, AS I WAS BEGINNING TO COME OUT OF THE TURN AND IT HAPPENED AGAIN.  I WAS TURNING THE  RIGHT AND STEERING WOULD TURN THE STEERING WHEEL TO THE LEFT FOR A SECOND OR TWO.  I WAS FORCED TO TRY TO MAINTAIN THE CORRECT DIRECTION AND AVOID CRASHING.  I BROUGHT THE CAR TO THE DEALERSHIP, BUT THEY WERE UNABLE TO DUPLICATE THE ISSUE.  IT ONLY SEEMED TO HAPPEN ON THIS ONE PARTICULAR ON-RAMP AT THE TIME.  APPROXIMATELY A MONTH LATER (ON A MONDAY, 10/20/2014), I WAS ON ANOTHER SIMILAR \"CLOVERLEAF\" ON-RAMP BUT AT DIFFERENT LOCATION AND THE SAME THING HAPPENED, WHILE TURNING TO THE RIGHT. LATER THAT DAY THE SAME ISSUE OCCURRED WHILE I WAS TURNING TO THE LEFT ON A LESSER EXIT RAMP, AND THE STEERING WHEEL WOULD \"GLITCH\" AND TRY TO PULL THE CAR TO THE OPPOSITE DIRECTION.  BEING AWARE THAT THIS HAD HAPPENED A COUPLE OF TIMES, I WAS VERY CAUTIOUS ABOUT MY SPEED ON THESE RAMPS.  REGARDLESS OF THE SPEED, THE ISSUE WOULD STILL OCCUR.  THE NEXT DAY, THE STEERING ISSUE HAPPENED AGAIN AT A DIFFERENT LOCATION, THREE TIMES WHILE ON THE RAMP, PULLING THE CAR IN THE OPPOSITE DIRECTION.  I BROUGHT IT BACK TO THE DEALERSHIP THAT SAME WEEK ON FRIDAY (10/24/2014).  THEY WERE FINALLY ABLE TO DUPLICATE THE ISSUE AND SAID I NEEDED TO HAVE THE ENTIRE STEERING RACK REPLACED.  SINCE THE PROBLEM WAS GETTING WORSE AND COULD CAUSE AN ACCIDENT, I WAS FORCED TO HAVE THE REPAIR MADE, WHICH COST MORE THAN $1,700.  THIS WAS A VERY SCARY ISSUE AND I WAS VERY AFRAID IT WOULD CAUSE ME TO GET INTO AN ACCIDENT.  *TR",
        "vin": "WVWEK73C78E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2014",
        "dateOfIncident": "08/15/2014",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637884,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLED SMOKE IN CABIN OF CAR STOPPED CAR ON INTERSTATE I-4. SMOKE COMING FROM UNDER HOOD. LIFTED HOLD TO SEE OIL ALL OVER ENGINE AND EXHAUST. HAD TOW TO DEALER WHERE IT WAS CONFIRMED AS A REAR MAIN SEAL DEFECT DUE TO NOT BEADING THE SEAL AT THE FACTORY. FIRE HAZARD!!!!!!!!  *TR",
        "vin": "WVWLK73C18E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630929,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE USED AT 42K MILES IN MAY 2010. THE VW DEALERSHIP HAD CHANGED OIL AT THE TIME OF MY PURCHASE. ALMOST EXACTLY 4 WEEKS LATER I CHECKED MY OIL AND NONE REGISTERED ON THE DIPSTICK. IT REQUIRED AN ENTIRE QUART OF OIL TO BRING BACK TO ACCEPTABLE FILL LEVEL. CALLING VW THEY STATED THIS WAS NOT ENOUGH OIL TO EVEN CONSTITUTE AN OIL TEST. THEY STATED THAT THIS FSI MOTOR CAN BURN UP TO 1 QUART OF OIL EVERY 1200 MILES AND WILL STILL BE WITHIN THE MFR ACCEPTABLE LIMITS. THIS MEANS IN THIS 2.0T 4 CYL MOTOR IT CAN BURN OVER 6 QUARTS OF OIL BETWEEN OIL CHANGES, WHICH IS MORE THAN IT CAN HOLD. A QUART OF FULL SYNTHETIC OIL CASTROL BRAND AS REQUIRED IS OVER $9, THIS IS NOT COST EFFECTIVE AND INFURIATING. I WILL NOT PURCHASE ANOTHER VW BECAUSE OF THIS EXPERIENCE AND RECOMMEND ANYONE ELSE NOT TO AS WELL. VW OFFERED NO OPTIONS REPAIRS OR FIXES AND I FOOT THE EXPENSIVE OIL HABIT. WHO BUYS A CAR THAT KNOWINGLY BURNS AND BREAKS DOWN FULL SYNTHETIC OIL?  *TR",
        "vin": "WVWAK73C18P"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628479,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT APPROXIMATELY 50 MILES PER HOUR ON STATE HIGHWAY CAR SUDDENLY LOST ALL POWER.  STEERING BECAME DIFFICULT BUT WAS ABLE TO PULL OFF TO SIDE OF ROAD AND COAST INTO PARKING LOT.  CAR WOULD NOT START FOR 24 HOURS TO MOVE TO REPAIR SHOP.    AFTER DIFFICULTY DIAGNOSING DUE TO LOSS OF ALL POWER, IT WAS DETERMINED THAT THE POWER SUPPLY RELAY WAS APPARENTLY BAD.  COULD FIND NO RECALL OR EXTENDED WARRANTY FOR THIS ISSUE.  SHOULD NOT HAPPEN ON A CAR WITH SO FEW MILES WHICH HAS BEEN WELL MAINTAINED.  VERY DANGEROUS AND SCARY ISSUE!  WAS VERY LUCKY TO BE ABLE TO PULL OVER IN TIME TO AVOID TRAFFIC.  *TR",
        "vin": "WVWJK73C68E"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/20/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615276,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS APPROX ONE YEAR OF DIFFICULT STARTS REQUIRING MULTIPLE ATTEMPTS. ON 7/20/14 WHILE DRIVING IN PARKING LOT VEHICLE STALLED AND REFUSED TO RESTART DESPITE NUMEROUS ATTEMPTS. TOWED HOME. DTC SHOWED CONTROL MODULE FOR ELECTRONIC STEERING COLUMN LOCK LEAKING. VEHICLE REFUSING TO START DESPITE ALL OTHER ELECTRICAL COMPONENTS CHECKING OUT. CHECK ENGINE LIGHT NOT ON.   *TR",
        "vin": "WVWXK93C88E"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2014",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614742,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED AND WOULD NOT START EVEN AFTER A CHECK OF THE BATTERY. THE CAR HAD NO POWER WHATSOEVER AND COULD NOT BE PLACED INTO NEUTRAL TO TOW-THE ELECTRONIC EMERGENCY BRAKE WAS ALSO LOCKED.THE VEHICLE SAT TWO NIGHTS IN A SHOPPING CENTER PARKING LOT BEFORE A TOWING COMPANY COULD FIGURE SOMETHING OUT. THE TOW WAS $106.00 TO THE VW DEALERSHIP.THE DEALER WANTED $107 LABOR CHARGE FOR EACH PROBLEM. I ALREADY LOOKING AT A $214.00 BILL FOR THE STARTING ISSUE AND BRAKE.I TOLD THE TECHNICIAN IF THE CAR STARTS THE BRAKE SHOULD RELEASE ACCORDING THE OPERATORS MANUAL-ITS ELECTRONIC.HOW THIS HAPPENED IS A COMPLETE MYSTERY AS THERE HAD NEVER BEEN EVEN THE SLIGHTEST INDICATION.I HAVE SEEN MANY, MANY REPORTS OF THIS SAME ISSUE WITH THIS CAR ON THE INTERNET AS I DID SOME RESEARCH AFTER THIS HAPPENED. I RECEIVED A CALL FROM THE DEALERSHIP- THE STEERING WHEEL MODULE WAS $565 SINCE THE DEALERSHIP HAD TO MOVE THE CAR AND TRY AND GET IT STARTED , ,,WHICH SEEMS RIDICULOUS TO ME GIVEN THAT THE CAR ONLY HAS 90,000 MILES. I TRIED TO GET SOME HELP FROM VW CUSTOMER CARE GIVEN THAT THIS SEEMS LIKE A DESIGN FLAW...IT REALLY IS UPSETTING TO HAVE TO PAY SO MUCH FOR A CAR SO LIGHTLY USED WITH ONLY MAKING 3 MONTHLY VEHICLE PAYMENTS AND. VW WAS COMPLETELY UNWILLING TO WORK WITH ME IN ANY WAY. GERMAN ENGINEERING = GERMAN JUNK!   *TR",
        "vin": "WVWAK73C78E"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "05/06/2014",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587079,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CAME HOME FROM A 30 MILE TRIP AND PARKED THE CAR IN THE DRIVEWAY. WENT IN THE HOUSE AND ABOUT 5 MINUTES LATER HEARD A BIG POP SOUND. I THINK IS WAS A TIRE EXPLODING AND FOUND THE ENTIRE ENGINE ON FIRE. ANOTHER POPPING SOUND OCCURRED AND ANOTHER TIRE BLEW. ON THE DRIVE HOME THERE WERE NO PROBLEMS NOTED ON THE DASH BOARD. WHEN WE GOT OUT OF THE CAR THERE WERE NO ODORS OR INDICATION OF A FIRE. MY KEYS WERE IN THE HOUSE AT THE TIME OF THE FIRE.    OTHER ISSUES THAT MIGHT BE RELATED. THIS PAST WEEK MY CHARGER GOT EXTREMELY HOT TO TOUCH AND I STOPPED USING IT. I ALSO FELT THE CAR TRY TO START AFTER I TURNED IT OFF.  *TR",
        "vin": "WVWAK73C58E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2014",
        "dateOfIncident": "10/23/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566579,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 VOLKSWAGEN PASSAT 2.0T. I BOUGHT THIS VEHICLE USED WITH 66000 MILES. AFTER NUMEROUS VISITS TO MY DEALER ABOUT THE CHECK ENGINE LIGHT BEING ON AND THEM SAYING IT WAS A SENSOR NOT A PROBLEM THEY WOULD REPLACE IT. I WAS DRIVING DOWN INTERSTATE 65 DOING 65MPH THE CAR SPUTTERED AND LOST MOST POWER DOWN A MAJOR INTERSTATE. THIS CAUSED A QUICK REDUCTION IS SPEED. COME TO FIND OUT THE CAMSHAFT AND HIGH PRESSURE FUEL PUMP WERE DESTROYED BY THE TWO COMPONENTS GRINDING AGAINST EACH OTHER. NOW THE 2006 AND THE 2007 VEHICLES BOTH HAD THIS PROBLEM AND VOLKSWAGEN PUT EXTENDED WARRANTIES ON THESE VEHICLES. THIS COULD CAUSE A ACCIDENT SOONER OR LATER. THANK YOU  *TR",
        "vin": "WVWAK73C18E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "02/09/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE ENGINE STALLED AS THE OIL WARNING LIGHT ILLUMINATED. THE CONTACT ADDED OIL TO THE VEHICLE BUT THE ENGINE REFUSED TO START. THE VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE TIMING BELT AND THE HEAD GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "WVWAK73C88E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563190,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAM FOLLOWER ON 2006-2008 PASSATS WITH THE 2.0T FSI BPY ENGINE ARE ALL SUSCEPTIBLE TO AN EVENT WHERE THE CAM FOLLOWER GETS A HOLE IN IT AND THE HIGH PRESSURE FUEL PUMP CAN DRILL THROUGH THE INTAKE CAMSHAFT. VOLKSWAGEN GAVE A WARRANTY EXTENSION TO 2006 AND 2007 PASSATS BUT WILL NOT TAKE CARE OF THE 2008S! VOLKSWAGEN CLAIMS NEW PARTS WERE USED BUT I HAD THE REPAIR DONE AND THE PART NUMBER ON MY FUEL PUMP WAS DIFFERENT THAN THE NEW ONE! IT IS A $2000 PROBLEM AND THIS NEED TO HAVE ACTION TAKEN! THE SYMPTOMS CAN CAUSE TERRIBLE ACCIDENTS! THEY INCLUDE EXTREMELY POOR ACCELERATION, JOLTS, HESITATIONS, ROUGH STARTS, AND ROUGH IDLES. VOLKSWAGEN SAYS THAT THIS IS VIN SPECIFIC AND 2008S DO NOT APPLY BUT NUMEROUS PEOPLE WITH PASSATS, GTI'S, AND JETTA'S WITH THIS ENGINE HAVE HAD THIS PROBLEM! IT IS DANGEROUS. I HAVE NEARLY GOTTEN IN MANY ACCIDENTS AND IT IS EXPENSIVE TO REPAIR IT. THEY HAVE RECOGNIZED IT AS A PROBLEM AS THEY HAVE RELEASED NUMEROUS TECHNICAL SERVICE BULLETINS FOR THIS SPECIFIC MODEL YEAR CONCERNING THESE PARTS! THERE NEEDS TO BE FORMAL ACTION TAKEN AS THIS IS NOT JUST A FEW CARS THAT THIS HAS HAPPENED TO, BUT MANY!  *TR",
        "vin": "WVWJK73C68E"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559496,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL CONTROLS LOCATED ON THE STEERING WHEEL WENT DEAD, AND AIRBAG FAILURE INDICATOR CAME ON.  TURNING VEHICLE OFF AND RESTARTING IT DID NOT SOLVE THE PROBLEM.  DRIVERS SIDE AIRBAG SEEMS NOT TO BE FUNCTIONAL.  *TR",
        "vin": "WVWCU73C08E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2013",
        "dateOfIncident": "12/09/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553543,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW  PASSAT. PURCHASED BRAND NEW FROM MCDONALD AUTOMOTIVE LITTLETON CO    TRANSMISSION SLIPPING 2009  BRAKES / ROTORS. 2010  SUNROOF / WOULD NOT CLOSE POURING RAIN. NEEDS NEW MOTOR 2011  LEAKING OIL  VACUUM PUMP  2013.    87000 MILES  TURBO CUT OFF VALVE  2013  FRONT ROTORS  2013  ENGINE REVVING UP 2013  HEADLIGHTS KEEP GOING OUT.  *TR",
        "vin": "WVWAK73C88E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549663,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TIMING CHAIN JUMPED TIMING AT 74K MILES.  THIS CAUSED THE PISTONS TO HIT THE VALVES AND CAUSED $6K WORTH OF DAMAGE.  THE DEALERSHIP INFORMED ME THERE WAS NOTHING PREVENTATIVE I COULD HAVE DONE.  THEY ACTUALLY CONTACTED VW TO SEE WHAT THEY WOULD DO TO HELP WITH THIS ISSUE.  INITIALLY, THEY OFFERED TO CONTRIBUTE $1,000 TOWARD REPAIRS.     I CONTACTED VW BECAUSE I SAW 2 SEPARATE SERVICE BULLETINS ON THIS MODEL REGARDING THE TIMING JUMPING.  MY TIMING JUMPED DUE TO A FAULTY TENSIONER.  WHEN I SPOKE WITH VW, THEY DIDN'T EVEN OFFER THE $1,000 ANYMORE AND SIMPLY GOT THE DEALERSHIP TO REDUCE REPAIRS BY 15%,      THIS WAS COMPLETELY UNACCEPTABLE CONSIDERING A) THEIR TENSIONERS ARE FAULTY AND ARE CAUSING CONSUMERS TO SPEND OUTRAGEOUS AMOUNTS OF MONEY ON REPAIRS B) THIS IS NOT A NORMAL WEAR-AND-TEAR REPAIR FOR THE AGE AND MILEAGE OF THE CAR, PER THE DEALERSHIP.  THE FAILURE OF THE TENSIONER CAUSES A JUMP IN TIMING WHICH IMMOBILIZES THE CAR, WHICH IS DANGEROUS IF THE CAR IS OPERATING AT THE TIME.  IT IS COSTLY BECAUSE IT CAUSES SIGNIFICANT ENGINE DAMAGE.    SEE  SERVICE BULLETIN NO.: TB-15-12-01   SERVICE BULLETIN NO.: TB-15-11-04 .  *TR",
        "vin": "WVWXK73C88E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS SERVICED AT THE DEALER AT 90K MILES. WHILE DRIVING LOCALLY ONE MONTH AFTER THE SERVICE, THE CAR WAS DIFFICULT TO START, IDLED ROUGH, SPUTTERED WHILE TRAVELING, AND BUCKED WHILE STOPPED AT A TRAFFIC LIGHT. IT TURNS OUT THAT THE TIMING CHAIN SLIPPED AND CAUSED THE ENGINE TO BREAK. THE TIMING CHAIN IS NOT SUGGESTED TO BE REPLACED UNTIL 110,000 MILES. UPON FURTHER RESEARCH, IT APPEARS THERE IS A FAULTY ENGINE COMPONENT (TIMING CHAIN TENSIONER) THAT VW IS AWARE OF, BUT REFUSES TO LET CUSTOMERS KNOW ABOUT. PLEASE GOOGLE TSB 15 12 01, DATED JULY 23, 2012 WHICH IS A SERVICE BULLETIN RELEASED BY VW DETAILING THE FAULTY COMPONENT. THIS FAULTY COMPONENT HAS THE POTENTIAL TO CAUSE A MAJOR ROAD HAZARD DUE TO AN UNCONTROLLABLE VEHICLE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2013",
        "dateOfIncident": "09/09/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545220,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED AND WOULD NOT START EVEN AFTER A CHECK OF THE BATTERY.  THE CAR HAD NO POWER WHATSOEVER AND COULD NOT BE PLACED INTO NEUTRAL TO TOW. AFTER 4 DAYS IN THE SHOP, IT WAS DETERMINED THAT THE ENTIRE ANTI-THEFT SYSTEM HAD BURNED OUT AND FRIED THE IGNITION AS WELL.  HOW THIS HAPPENED IS A COMPLETE MYSTERY AS THERE HAD NEVER BEEN EVEN THE SLIGHTEST INDICATION THAT SOMETHING WAS WRONG BEFORE THIS INCIDENT.THE ENTIRE STEERING COLUMN HAD TO BE PULLED OUT OF THE VEHICLE AND THE MODULE HAD TO BE REPLACED.  I HAVE SEEN MANY, MANY REPORTS OF THIS SAME ISSUE WITH THIS CAR ON THE INTERNET AS I DID SOME RESEARCH AFTER THIS HAPPENED. THE PRICE TO REPAIR THE CAR WAS $895.00,,,WHICH SEEMS RIDICULOUS TO ME GIVEN THAT THE CAR ONLY HAS 45K MILES.  I TRIED TO GET SOME HELP FROM VW CUSTOMER CARE GIVEN THAT THIS SEEMS LIKE A DESIGN FLAW...IT REALLY IS UPSETTING TO HAVE TO PAY SO MUCH FOR A CAR SO LIGHTLY USED...AND COULD IT JUST HAPPEN AGAIN? VW WAS COMPLETELY UNWILLING TO WORK WITH ME IN ANY WAY.    *JS",
        "vin": "WVWAK73C78P"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "06/18/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521641,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DRIVER SIDE SEAT BELT RETRACTOR BROKE AND WILL NOT RETRACT.  *TR",
        "vin": "WVWXK73C18E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "02/07/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501148,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER REAR SEAT BELT RETRACTING MECHANISM MALFUNCTIONS AND THE BELT TIGHTENS AGAINST THE SEAT ITSELF. PASSENGERS USING THE CENTER BELT FIND IT DIFFICULT TO RELEASE THE BELT WHEN FASTENED.  AFTER THE BELT RETRACTS FULLY, THE SEAT BELT CAN NO LONGER BE USED. IF THE REAR SEAT BACK IS SUBSEQUENTLY \"FOLDED\" DOWN TO ALLOW FOR TRUNK ACCESS FROM THE PASSENGER COMPARTMENT, THE FOLDED SEAT BACK WILL BE STUCK IN THE DOWN POSITION DUE TO THE CENTER SEAT BELT RETRACTING WITHOUT RELEASE.  *TR",
        "vin": "WVWAK73CX8E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/22/2012",
        "dateOfIncident": "09/17/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481336,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "CS4 TOURING (VR)",
                "productYear": "9999",
                "size": "215/55R17",
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED TIRES FOR MY 2008 VW PASSAT TURBO 4 DOOR SEDAN. I SELECTED FOUR COOPER CS4 TOURING TIRES.  I BOUGHT THEM ABOUT A MONTH AGO, SEPTEMBER 17, 2012.    ALMOST IMMEDIATELY AFTER THE INSTALLATION OF THE COOPER TIRES, I NOTICED A PULSATING NOISE WHEN THE STEERING WHEEL IS TURNED EITHER LEFT OR RIGHT; THE NOISE FREQUENCY IS A FUNCTION OF SPEED.    SO, TWO DAYS LATER, I BROUGHT THE CAR BACK TO THE DEALER.  A MECHANIC CHECKED THE TIRES, WHEELS, AND MOUNTING; HE COULD FIND NOTHING OBVIOUSLY WRONG.  SO, I TOOK THE MECHANIC FOR A RIDE.  HE HEARD THE NOISE, AND TOLD ME THAT IT WOULD DISAPPEAR AFTER THE TIRES WERE BROKEN IN OR WORN IN.    THE NOISE HAS SEEMED TO INCREASE OF LATE.  I AM CONCERNED THAT THE TIRES MAY BE DEFECTIVE.    WHAT DO YOU THINK?  *TR",
        "vin": "WVWUK73C28E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2012",
        "dateOfIncident": "08/17/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473624,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING HOME FROM THE GROCERY STORE MY WIFE NOTICED A FUEL SMELL COMING FROM THE BACK SEAT. I REMOVED THE BACK SEAT TO SEE A ACCESS PANEL TO THE FUEL TANK. I REMOVED THE RUBBER CAP AND SAW THE TOP HOUSING OF THE FUEL PUMP, WHICH IS PLASTIC, HAD A CRACK AND FUEL WAS SPRAYING OUT OF THE CRACK. CALLED DEALERSHIPS IN AZ AND THEY ALL SAID THE SAME THING, NO FUEL PUMPS AVAILABLE IN THE UNITED STATES. THEY HAVE DISCONTINUED THE PART # 3C0919051AG AND REPLACED IT WITH 3C0919051AM. WHY DID THEY HAVE ALL DEALERSHIPS RETURN THAT PART AND NO RECALL WAS ISSUED?  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2012",
        "dateOfIncident": "06/03/2012",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460693,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED IN THE LOT, THE ENGINE AREA CAUGHT ON FIRE AND BURNED THE FRONT HALF OF THE CAR BEFORE THE FIRE DEPARTMENT PUT IT OUT.  *TR",
        "vin": "WVWAK73C08E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "11/09/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446903,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE DOOR COULD NOT BE OPENED FROM THE INSIDE OF THE VEHICLE. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED THREE TIMES PRIOR. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DUPLICATE THE FAILURE.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 31,000.",
        "vin": "WVWJK73C28E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2012",
        "dateOfIncident": "08/19/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445005,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. WHILE DRIVING APPROXIMATELY 15 MPH, THE CONTACT APPROACHED A TRAFFIC STOP AND DEPRESSED THE ACCELERATOR PEDAL BUT THERE WAS NO RESPONSE. THERE WERE NUMEROUS ATTEMPTS BEFORE THE VEHICLE UNEXPECTEDLY ACCELERATED WITH EXTREME FORCE. THE FAILURE RECURRED WHENEVER ACCELERATING FROM A COMPLETE STOP. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER SEVERAL TIMES FOR THE MALFUNCTION AND THEY WERE UNABLE TO LOCATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE INTERMITTENT PROBLEM BUT PROVIDED NO ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 9,000.",
        "vin": "WVWDU73C08E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2011",
        "dateOfIncident": "10/29/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433144,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT. THE CONTACT WAS TRAVELING 30 MPH AND HEARD A SCRAPING SOUND WHENEVER HE SHIFTED GEARS. THE CONTACT ALSO STATED THAT THE TRANSMISSION WAS MANUAL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON SEVERAL OCCASIONS, BUT THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NEVER REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE CONTACT EXPRESSED CONCERNS OVER A POSSIBLE TRANSMISSION FAILURE IN THE FUTURE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "WVWYK73C48E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2011",
        "dateOfIncident": "08/13/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT.  THE CONTACT APPLIED PRESSURE TO THE ACCELERATOR PEDAL HOWEVER, THE VEHICLE WOULD NOT RESPOND.  SHE WAS ABLE TO MANUALLY SHIFT THE GEAR IN ORDER TO GET THE VEHICLE OFF THE MAIN ROADWAY.  THE DEALER DIAGNOSED THE VEHICLE WITH A FAULTY HIGH PRESSURE FUEL PUMP AND ADVISED HAVING IT REPLACED.  THE MANUFACTURER WAS NOT NOTIFIED.  NO REPAIRS WERE PERFORMED. THE DEALER HAD BEEN WAITING FOR THE PART NEEDED FOR REPAIRS FOR APPROXIMATELY ONE MONTH.  THE CURRENT AND FAILURE MILEAGES WERE 62,000.",
        "vin": "WVWAK73C78P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "03/17/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392410,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT COMES ON INTERMITTENTLY STARTING IN MARCH 2010 WITH A LOW FUEL PRESSURE FAULT.  CAR RUNS FINE MOST OF THE TIME, BUT SPUTTERS WHEN THE FAULT OCCURS AND FUEL ECONOMY SUFFERS.  AFTER RECEIVING THIS FAULT MULTIPLE TIMES, REPAIR SHOP SUGGESTS WE TRY A NEW FUEL FILTER TO SEE IF THAT CLEARS IT, BUT IT WILL LIKELY NEED A NEW FUEL PUMP.  NEW FUEL FILTER HELPS FOR 3 WEEKS, BUT FAULT STARTS OCCURRING AGAIN.  I TOOK THE CAR TO ANOTHER SHOP FOR A SECOND OPINION AND THEY AGREED THAT I NEEDED TO REPLACE THE FUEL PUMP AND FUEL PUMP SENSOR, WHICH I HAD DONE IN NOV 2010 AFTER THE FUEL GAUGE STOPS REPORTING ACCURATE FUEL LEVELS.  THIS CLEARS BOTH ISSUES UNTIL FEBRUARY 2011, WHEN LOW FUEL PRESSURE FAULT STARTS FIRING AGAIN INTERMITTENTLY EVERY 2-3 WEEKS AS IT HAD BEFORE AND FUEL GAUGE IS NOT REPORTING ACCURATE FUEL LEVELS AGAIN.  NOW VW STATES THE FUEL PUMP IS NOT THE PROBLEM (A $1K REPAIR!) AND IS RECOMMENDING A NEW HIGH PRESSURE FUEL PUMP AND CAM SHAFT - A $2,300 REPAIR!  TO ADD INSULT TO INJURY MY CAR NOW SMELLS LIKE FUEL AFTER DRIVING IT.  VW REFUSES TO PROVIDE ANY SORT OF WARRANTY FOR ANY OF THIS WORK, INCLUDING THE FIRST TWO REPAIRS THAT DIDN'T FIX THE PROBLEM.  I CANNOT AFFORD TO MAKE THESE REPAIRS AT THIS TIME AND I AM CONSIDERING ASKING VW CREDIT TO TAKE BACK THE CAR.  *TR",
        "vin": "WVWLK73C98E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "02/10/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386052,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN PSSAT. THE CONTACT STATED THAT BOTH REAR DOORS HOUSED PIVOTING TABS FOR A SHADE  TO KEEP THE SUN OUT OF THE VEHICLE. THE CONTACT STATED THAT THE DESIGN WAS POORLY MANUFACTURED BECAUSE THE CHILD OCCUPANT IN THE BACK SEAT COULD PULL THE TABS UP AND DOWN AND COULD POTENTIALLY  CATCH HIS FINGERS IN THE TAB. THE MANUFACTURER WAS CONTACTED BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 23,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2010",
        "dateOfIncident": "11/20/2010",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367107,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT HOME AFTER WORK SATURDAY NIGHT AROUND 7PM AND PARK MY 2008 VW PASSAT IN FRONT OF MY HOUSE AND TWO MINUTES AFTER SMOKE START COMING OUT THROUGH FRONT GRILLE I OPEN THE HOOD AND IT SMALL LIKE BURNED PLASTIC. I SOW COIL AND WIRE WHERE IS CONNECTED ALL MELTED.  I WAS LUCKY THAT THIS DID NOT HAPPENED WHILE I WAS DRIVING. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366505,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GOING GROCERY SHOPPING, AFTER LEAVING THE PARKING LOT, I ACCELERATED TO ABOUT 2500 RPMS AND THEN ENGINE CUT OUT AND STALLED.  I TRIED TO RESTART THE CAR AND EVERY TIME I TRY TO PUT IT INTO GEAR, THE ENGINE CUT OUT AND STALLED.    I MANAGED TO GET IT INTO A BANK PARKING LOT NEXT DOOR.  FORTUNATELY, ALL THIS HAPPENED SUNDAY NIGHT, WHICH VERY LITTLE TRAFFIC ON THE ROAD.    THERE WAS A CHECK ENGINE LIGHT WITH THE FOLLOWING CODES:  001056 - CATALYST SYSTEM; BANK 1: EFFICIENCY BELOW THRESHOLD   P0420 - 002 - LOWER LIMIT EXCEEDED - INTERMITTENT    012555 - LOW PRESSURE FUEL REGULATION: FUEL PRESSURE OUTSIDE SPECIFICATION   P310B - 008 - IMPLAUSIBLE SIGNAL - MIL ON    004767 - LOW-PRESSURE FUEL PRESSURE REGULATION: PRESSURE TOO HIGH   P129F - 001 - UPPER LIMIT EXCEEDED - MIL ON    000135 - FUEL RAIL/SYSTEM PRESSURE: TOO LOW   P0087 - 002 - LOWER LIMIT EXCEEDED - INTERMITTENT    000135 - FUEL RAIL/SYSTEM PRESSURE: TOO LOW   P0087 - 008 - IMPLAUSIBLE SIGNAL    THIS IS ON A 2008 VW PASSAT 2.0T (WITH THE BPY ENGINE).    THE DEALERSHIP TECHNICIAN REPLACED THE HIGH PRESSURE FUEL PUMP (HPFP) SENSOR.  APPARENTLY, THERE HAS BEEN AN UPDATE TO THE SENSOR, WHICH MY CAR LACKED.  *TR",
        "vin": "WVWYK73C98E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "08/22/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351400,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD WIPERS ON THE 2008 VW PASSAT SELF-ADJUST THEIR SPEED ON THEIR OWN WITHOUT THE DRIVER TOUCHING THEM. ON SUNDAY, AUGUST 22, 2010, I WAS DRIVING ON I-95 AND DROVE INTO AN AREA UNDER A TORNADO WARNING. IT WAS RAINING IN TORRENTS AND TRAFFIC CAME TO A STOP. MY WINDSHIELD WIPERS WERE ON REGULAR SPEED, AND WHILE STOPPED THEY SUDDENLY CHANGED TO INTERMITTENT WITHOUT ME TOUCHING THE CONTROLS.     THIS HAPPENED FOUR DIFFERENT TIMES! I WAS TRYING TO WATCH THE SKY FOR SWIRLING CLOUDS AND WATCH THE ROAD FOR FLASH FLOODING AND THE WINDSHIELD WIPERS KEPT SLOWING TO INTERMITTENT! I CALLED THE DEALERSHIP AT 7:30 A.M. MONDAY MORNING AND LEARNED THAT THE WIPERS ARE OPERATING AS DESIGNED.     I DO NOT UNDERSTAND HOW THE ENGINEERS AND LEADERS AT VW COULD POSSIBLY THINK THAT THE CAR HAS A BETTER SENSE OF THE DRIVER'S VISIBILITY NEEDS THAN THE DRIVER! THIS IS AN ABSOLUTE AND OBVIOUS SAFETY HAZARD! THE DRIVER KNOWS THE CONDITIONS THEY ARE IN! HOW COULD THE CAR SELF-ADJUST SOMETHING AS CRITICAL AS THE DRIVER'S VISIBILITY? PLEASE FORCE VW TO CHANGE THIS \"FEATURE\" IN THE PASSAT AND ANY OTHER MODELS WHERE IT IS PRESENT. *TR",
        "vin": "WVWJK73C78P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "07/30/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346933,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT PROBLEM THAT CAUSES ENGINE TO WANT TO CONTINUE WORKING INSTEAD OF IDLE WHILE FOOT ON BRAKE AND GEAR IN DRIVE. RPMS BETWEEN 8-10K. APPEARS TO HAPPEN IN HOT AFTERNOONS WHEN AIR IS ON FULL BLAST. WHEN BRAKE IS ENGAGED THERE IS ENORMOUS PRESSURE BACK ON THE FOOT AND THE CAR WANTS TO GO. FIRST TAKEN IN TO VW DEALER AND THEY HAD ANOTHER CAR OF SAME YEAR AND MODEL AND COLOR WHICH WAS DOING SAME THING. THEY CLEANED THE THROTTLE CABLE. AS I PULLED AWAY FROM THE DEALERSHIP THE PROBLEM HAPPENED AGAIN. I IMMEDIATELY CALLED BACK AND LET THE SERVICE GUY KNOW THE FIX DIDN'T WORK. ON 8/1 I TOOK IT BACK AND THE PROBLEM WAS HAPPENING WHILE I WAS IN THEIR GARAGE. THE OTHER CAR WAS BACK AGAIN WITH SAME ISSUE. VW HAD A TECH BULLETIN ABOUT A LOOSE GROUND WIRE. THE SERVICE TECH PUT A JUMPER CABLE SOMEWHERE AND TOLD ME TO TRY THAT OUT. WITHIN A MILE I EXPERIENCED THE PROBLEM AGAIN. *TR",
        "vin": "WVWCU73C08P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "07/19/2010",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345874,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED IN THE PARKING GARAGE AFTER BEING DRIVEN AT LUNCH AND WITHIN APPROXIMATELY 15-30 MINUTES OF OWNER HAVING TURNED OFF THE VEHICLE THE GARAGE ATTENDANT REPORTED SMELLING SMOKE. ACCORDING TO AN EYEWITNESS, THERE WAS SMOLDERING SMOKE COMING FROM UNDER THE HOOD AND WITHIN A MINUTE OR SO OF DISCOVERING THE SMOKE AN EXPLOSION TOOK PLACE UNDER THE HOOD AND THE ENTIRE FRONT HOOD COMPARTMENT WAS ENGULFED IN FLAMES. THE FIRE DEPARTMENT WAS ABLE TO PUT OUT THE FIRE BUT THE VEHICLE IS A TOTAL LOSS. *TR",
        "vin": "WVWTK93C48E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2010",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341430,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNED THE CAR FOR 9 MONTHS, AND HAVE HAD DOCUMENTED PROBLEMS FOR 8 MONTHS INCLUDING A COMPLETE FAILURE THAT REQUIRED TOWING. THE PRIMARY PROBLEMS ARE:  1.  STEERING COLUMN WARNING LIGHT ON - THE COMFORT MODULE AND STEERING ELECTRONICS WERE REPLACED 7 WEEKS AFTER PURCHASING THE CAR  2.  ONGOING INTERMITTENT PROBLEMS STARTING THE CAR. THE CAR DIED ON 6/15/10, WAS TOWED, AND THE IGNITION COIL WAS REPLACED. CURRENT: CAR DID NOT START ON FIRST ATTEMPT ON 7/4/10, WHICH IS LESS THAN 3 WEEKS LATER!  3.  CAR BURNS EXCESSIVE OIL. NEED TO ADD OIL BETWEEN SCHEDULED OIL CHANGES. IN APRIL 2010, OIL PRESSURE LIGHT CAME ON. DEALER ADDED 2 QTS OF OIL AND TANK WAS STILL NOT FULL. STILL HAD 1,000 MILES TO GO BEFORE NEXT SCHEDULED OIL CHANGE. HAVE HAD OIL ADDED ON TWO OTHER OCCASIONS BETWEEN OIL CHANGES.  4.  CAR IS SLUGGISH, ESPECIALLY WHEN GOING UP HILLS. NO RESPONSE OR RESOLUTION FOR THIS, BUT THE CAR HAS A TURBO ENGINE  NOTE: THIS CAR HAS ONLY BEEN SERVICED BY VW DEALERSHIPS. *TR",
        "vin": "WVWJK73C78P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "05/19/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331175,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 08 PASSAT AND FOR ABOUT A YEAR NOW I HAVE HAD A 'STEERING COLUMN LOCK DEFECTIVE' PROBLEM. I WOULD HAVE WROTE THIS LETTER A LONG TIME AGO BUT WHEN IT STARTED HAPPENING MY WARRANTY WAS ALREADY EXPIRED AND IT WAS NOT AS SEVERE, NOW IT CAN TAKE ME ANYWHERE FROM 5-15 MINUTES JUST TO START MY CAR AND WHEN I DO GET IT STARTED MY CAR SOMETIMES COMPLETELY SHUTS OFF WHILE I'M DRIVING. I STARTED DOING RESEARCH ON THIS ISSUE AND THERE ARE A LOT OF UPSET VW OWNERS WITH THE SAME PROBLEM. IF YOU GOOGLE 'PASSAT STEERING COLUMN LOCK DEFECTIVE PROBLEM' YOU WILL SEE MULTIPLE WEBSITES AND FORUMS. I DON'T UNDERSTAND IF SO MANY PEOPLE ARE HAVING THIS PROBLEM WHY THERE HASN'T BEEN A RECALL? *TR",
        "vin": "WVWAK73C18E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330018,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VW PASSAT  2008, LOW OIL LIGHT COME ON BEFORE SCHEDULE OIL CHANGE FREQUENTLY.  THE CAR BURNS OIL BECAUSE OF THE TURBO ENGINE.  AND THE EMISSION SYSTEM HAS A VALVE FAILURE TOO.  *TR",
        "vin": "WVWAK73C78E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "02/25/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316424,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2008 VW PASSAT WITH 26K MILES ON IT. THE FOLLOWER CAM AT HPFP GO BAD AND DAMAGED MY ENGINE IT IS A COMMON PROBLEM ON VW 2.0T FSI ENGINES PLEASE MAKE VW/AUDI TO DO SOMETHING WITH IT OR EXTEND WARRANTY. *TR",
        "vin": "WVWJK73CX8E"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/06/2010",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10308290,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW PASSAT WAGON.  THIS CAR WHILE PARKED, RUNNING AND OCCUPIED, IN A GARAGE HAD A FIRE WHOSE POINT OF ORIGIN WAS THE AREA OF THE DRIVER'S SEAT.  THE FIRE INVESTIGATION DETERMINED THE CAUSE TO BE ACCIDENTAL MECHANICAL.  THE FIRE CAUSED SIGNIFICANT DAMAGE TO A SINGLE FAMILY HOME, DAMAGE ESTIMATED AT ABOUT $200,000  ALSO ONE OCCUPANT OF THE HOME HAD TO BE TRANSPORTED BY EMS FOR SMOKE INHALATION.    THE DRIVER OF THE CAR STATED SHE TO LEAVE.  SHE PLACED THE 5  YEAR OLD IN THE CHILD SEAT OF THE VOLKSWAGEN AND OPENED THE GARAGE DOOR.  SHE STARTED THE CAR AND SMELT SMOKE.  IMMEDIATELY SHUT THE CAR OFF AND CALLED THE HUSBAND.    THE HUSBAND SAID THAT IT WAS PROBABLY THE SEAT HEATER, HAD HER TURN OFF THE SEAT HEATER AND RESTART THE CAR.  SHE RESTARTED THE CAR SMELT AND OBSERVED SMOKE AGAIN, TURNED OFF THE CAR, GOT OUT AND SAW FLAME UNDERNEATH THE DRIVER'S SEAT.  SHE REMOVED THE DAUGHTER FROM THE CAR AND TOOK HER OUT TO THE DRIVEWAY.  SHE THEN WENT BACK INTO THE GARAGE AND REMOVED A GAS CAN FROM THE AREA OF THE CAR/SNOWBLOWER.  SHE AGAIN RE-ENTERED THE GARAGE AND OPENED THE OTHER GARAGE DOOR (BOTH NOW OPEN) OBSERVED FLAMES SHOOTING OUT OF THE DRIVERS DOOR OF THE CAR.  SHE EXITED THE GARAGE THROUGH AN INTERIOR DOOR, CLOSING IT BEHIND HER.  SHE THEN WENT UP INTO THE HOUSE REMOVED TWO DOGS TO A CRATE ON THE DECK.  IN THE MEANTIME A NEIGHBOR HAD GRABBED THE LITTLE GIRL.  WHILE ALL THIS WAS HAPPENING THE MOTHER PLACED THREE FRANTIC 911 CALLS.    THE OWNER OF THE CAR STATED HE HAD HAD PROBLEMS WITH THE HEATED SEATS IN THE PAST AND THAT THEY HAD BEEN REPAIRED TWICE.  THE LAST TIME IN NOVEMBER OF 2009.    THE DERRY FIRE DEPARTMENT HAS COMPLETED ITS FIRE INVESTIGATION, AND THE CAR IS BEING TURNED OVER TO THE INSURANCE COMPANIES (STATE FARM AND LIBERTY MUTUAL). *TR",
        "vin": "WVWLK73C38E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE READS INCORRECTLY.  PRIOR TO FIRST SERVICE CALL, GAUGE READ NEARLY EMPTY WHEN TANK WAS FULL; AFTER REPLACING \"SENDING SENSOR\" THE CONDITION REVERSED AND NOW READS FULL WHEN TANK IS NEARLY EMPTY. *TR",
        "vin": "WVWRU93C08E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "10/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289880,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY '08 PASSAT WITH A 2.0 T ENGINE BURNS THROUGH A GREAT DEAL OF OIL.  ABOUT 1/2 LITER PER 1,000 MILES.  IT IS A NEW CAR (NOW 28,000 MILES) AND SHOULD NOT BURN OIL!  VW STATES THIS OIL CONSUMPTION IS NORMAL, BUT I DISAGREE.  I LEASE THE CAR AND HAVE HAD ALL MAINTENANCE DONE AT THE DEALER.  I MUST FREQUENTLY ADD OIL TO THE ENGINE AND HAVE BROUGHT IT IN TO BE SERVICED FOR THIS OIL CONSUMPTION ISSUE SEVERAL TIMES.  FROM RESEARCH DONE ONLINE, THIS IS NOT A PROBLEM UNIQUE TO ME.  PLEASE HELP! *TR",
        "vin": "WVWEK73C08E"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/10/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283560,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST PIPE BROKE AT THE FLEX PIPE.  HOT EXHAUST GAS BURNED THROUGH THE WIRING OF THE ELECTRONIC STEERING RACK.  LOST STEERING AND THEN ENGINE SHUT OFF COMPLETELY AND NOT ABLE TO BE RESTARTED.    EXHAUST PIPE, STEERING RACK & STEERING WIRING WAS REPLACED    (WIRING NEEDS A HEAT-SHIELD TO  PROTECT THE WIRING). *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2009",
        "dateOfIncident": "06/18/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282238,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS, AFTER STOPPING AT A STOP SIGN, MY 2008 PASSAT HAS SLID INTO NEUTRAL GEAR WHEN ACCELERATING.  THE DISPLAY STILL INDICATES THE CAR IS IN 'DRIVE', BUT THE ENGINE RACES WHEN THE GAS PEDAL IS DEPRESSED, AND THE CAR DOES NOT MOVE.  AFTER MOVING THE GEAR SHIFT TO ANOTHER GEAR, AND THEN BACK TO DRIVE, THE CAR WILL AGAIN GO INTO DRIVE GEAR. *TR",
        "vin": "WVWAK73C78P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275601,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW PASSAT. FUEL PUMP HAD TO BE REPLACED AT 29K MILES, AFTER FREQUENT STALLS WHILE DRIVING AT LOW SPEED, DIFFICULTIES CRANKING AND FREQUENT DISPLAY OF FUEL CAP LIGHT. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/12/2009",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268469,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT.  THE DEALER REPLACED THE FRONT AXLE AT 2,200 MILES BECAUSE THE VEHICLE WAS SHAKING SEVERELY.  WHEN THE TEMPERATURE DROPS BELOW 50 DEGREES, THE VEHICLE DOES NOT SHIFT INTO GEAR AND HAS TO BE WARMED UP FOR AT LEAST TWENTY MINUTES BEFORE IT WILL SHIFT.  IN ADDITION, THE AIR CONDITIONING SYSTEM HAS TO BE REPLACED BECAUSE IT WAS ONLY EMITTING HOT AIR.  THE RADIO ALSO DOES NOT WORK ON OCCASION.  THE CONTACT HAS ONLY OWNED THE VEHICLE FOR EIGHT MONTHS.  THE AUTOMATIC TRANSMISSION DOES NOT WORK AND THE DEALER ADVISED THAT IT BE REPLACED.  THERE WERE NO RECALLS AVAILABLE.  THE FAILURE MILEAGE WAS 12,000.   UPDATED 5/27/09 *CN  UPDATED 05/29/09. *JB",
        "vin": "WVWAK73T48P"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "01/13/2009",
        "dateOfIncident": "12/28/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254832,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE ENGAGED AT HIGHWAY SPEED  ( 1 2 )  CONSIDERED BUYING ONE OF THESE, BUT CONCERNED AFTER READING THIS FORUM POST FROM   VW VORTEX.  THE  PASSAT HAS A ELECTRONIC/COMPUTER CONTROL PARKING BRAKE SYSTEM.  IT ENGAGED  AT 65MPH! *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "12/26/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254178,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. SLOWING TO STOP AT RED LIGHT.  15 FEET BEHIND ANOTHER CAR THAT WAS STOPPED, AND WITH MY FOOT FIRMLY ON THE BRAKE, THE ENGINE REVVED TO TOP SPEED AND THE BRAKE DID NOT STOP THE CAR.  I BUMPED THE STOPPED CAR, PUT THE CAR IN PARK AND TURNED OFF THE ENGINE.  2. NO DAMAGE TO EITHER CAR. POLICE WERE CALLED AND CAME OUT UNTIL TOW TRUCK ARRIVED.  CAR TOWED TO DEALER WHERE THE CAR (9 MONTHS OLD AND 11000 MILES) WAS PURCHASED.  3. ONE WEEK LATER, THE DEALER SAID THEY COULD FIND NOTHING WRONG.  THEY PAID FOR A RENTAL CAR FOR THE WEEK.  I REFUSE TO DRIVE THE CAR SO THEY OFFERED TO TRADE IT IN ON A NEW ONE AND THAT IT HAD DEPRECIATED 50% IN 9 MONTHS.  VW CORPORATE OFFERED A $1000 REBATE ON A NEW CAR.   4. I CALLED VW CORPORATE TO REGISTER A COMPLAINT, BUT THEY SAID THAT THE DEALER WAS \"EMPOWERED\" TO MADE DECISIONS.  THEY WOULD DO NOTHING. *TR",
        "vin": "WVWCU73C38E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/25/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232291,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE DISTORTION IN WINDSHIELD.  VW REPLACED ORIGINAL WITH TWO MORE.  THAN SAFELIGHT REPLACED  TWO MORE WINDSHIELDS AND LAST WAS REPLACED BE BLUE RIDGE AUTO GLASS.  DRIVING WITH THIS DISTORTION CAUSES HEADACHES AND NAUSEA.  *TR",
        "vin": "WVWEK73C78P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232132,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 VOLKSWAGEN PASSAT.  WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT DEPRESSED THE BRAKE PEDAL, BUT THE VEHICLE CONTINUED TO MOVE.  IT TOOK GREAT EFFORT TO STOP THE VEHICLE.  HE EXITED THE FREEWAY AND THE FAILURE RECURRED AT THE VERY NEXT STOP.  THE CONTACT WENT TO THE DEALER AND SHUT OFF THE VEHICLE.  THE MECHANIC ATTEMPTED TO DUPLICATE THE FAILURE; HOWEVER, IT DID NOT RECUR ONCE THE VEHICLE WAS RESTARTED.  THE CONTACT CONTINUED TO DRIVE THE VEHICLE UNTIL HE DISCOVERED NHTSA CAMPAIGN ID NUMBER 08V235000 (ENGINE AND ENGINE COOLING) ON JUNE 23, 2008.  HE TOOK THE VEHICLE BACK TO THE DEALER AND THEY INFORMED HIM THAT HIS VIN WAS NOT INCLUDED IN THE RECALL, EVEN THOUGH THE FAILURES WERE IDENTICAL.  THE FAILURE MILEAGE WAS 1,500 AND CURRENT MILEAGE WAS 7,000.",
        "vin": "WVWJK73CX8E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/26/2007",
        "dateOfIncident": "12/13/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212703,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME WITH IN FREEZING WEATHER AFTER A SNOW STORM, EVERY FEW MINUTES CLEANING THE WINDSHIELD WITH WASHER FLUID,  WHERE AFTER STOPPING THE CAR FOR A FEW MINUTES, THE WIPERS REFUSED TO FUNCTION WHILE DRIVING (ATTEMPTING TO CLEAN THE WINDSHIELD FROM THE ROAD SALT).    HAD TO CAREFULLY PULL OVER, CHECKED THE FUSES, AND CLEARED ALL ICE FROM THE WINDSHIELD COWL AND WIPER BLADE ARMS, THEN IT WORKED.    NONE OF MY OLDER CARS HAD THIS ISSUE.  *TR",
        "vin": ""
    }
]