[
    {
        "components": "EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340270,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RPMS ONLY GO TO 4000 THE HEADLIGHTS ARE CONSTANTLY BLOWN, ONE OF THE FANS DOES NOT WORK ....THERE ARE A LOT OF ELECTRICAL PROBLEMS, THE MASS AIR INTAKE FLOW ISSUES WITH THAT THERE'S JUST A LOT OF ISSUES. IT'S AFFECTED THE ELECTRICAL, SPEED CONTROL, AIRBAGS, VISIBILITY AND WIPER,LIGHTING, FUEL SYSTEM MASS AIR INTAKE SENSOR",
        "vin": "WZWHV71K57W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228885,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EA888 HAS A KNOWN TIMING CHAIN AND CHAIN TENSIONER ISSUE THAT CAUSES ENGINE FAILURE.",
        "vin": "WVWFD71K68W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110978,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR JERKS OUT WHEN U ACCELERATE.  THE CAR FEELS LIKE IT'S IN MANUAL WHEN TAKING OFF.",
        "vin": "WVHHD71K58W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072991,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2.0 T USE OF EXCESSIVE OIL BETWEEN OIL CHANGES",
        "vin": "WVWGV71K18W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035352,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOSS POWER HAD TO BE TOWED TO VOLTSWAGON LATER THE HIGH PRESSURE FUEL PUMP WAS FOUND TO HAVE  FAILED CAUSING A LOST OF POWER WHILE ON THE ON RAMP TO THE HIGHWAY. THERE WAS ALSO DAMAGE DONE TO THE MOTOR FROM THE INTERNAL METAL FRAGMENTS FROM WHERE THE  PUMP WORKS WITH THE CAM SHAFT AND THE METAL FELL INTO THE MOTOR. HAD TO HAVE A NEW ENGINE REPLACE MENT MILEAGE 135000.",
        "vin": "WVWGV71K18W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926335,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I PREFORMED A ROUTINE MAINTENANCE CHECK ON MY VEHICLE AND AS SUGGESTED BY ALL MARK 5 GTI OWNERS I CHECKED THE CAM FOLLOWER. I FOUND THE CAM FOLLOWER COMPLETELY WORN THROUGH. I CONTACTED VW TO MAKE SURE I WAS UNDER THE EXTENDED WARRANTY HANDED OUT TO ALL 2006-2007 AND SOME 2008 OWNERS TO FIND OUT I WAS NOT UNDER THE WARRANTY EXTENSION. RIGHT NOW I HAVE A THE PIECE OFF MY OLD CAM FOLLOWER SOMEWHERE IN MY ENGINE AND VW REFUSES TO SERVICE MY VEHICLE DUE TO THEIR NEW IMPROVED MODEL APPARENTLY THAT MANY OTHER OWNERS ARE EXPERIENCING. VW KNOWS THAT THE CAM FOLLOWER IS FAULTY BUT REFUSES TO SERVICE MANY OTHER 2008 OWNERS SUCH AS MYSELF. RIGHT NOW IT FEELS LIKE MY CAR IS A TICKING TIME BOMB WITH THE CAM FOLLOWER PIECE SOMEWHERE IN THE ENGINE.",
        "vin": "WVWEV71K88W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899349,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAM FOLLOWER HAS PREMATURELY WARN OUT CAUSING THE INTAKE CAMSHAFT TO WEAR PREMATURELY AS WELL, WHICH HAS IN TURN CAUSED THE HIGH PRESSURE FUEL PUMP TO FAIL.    THIS IS A LONG-TERM, DEGENERATIVE ISSUE.     VOLKSWAGEN HAS EXTENDED THE WARRANTY ON THESE PARTS FOR SOME 2006-2008 GTI'S BUT NOT MY VIN. THEIR WARRANTY EXTENSION WAS NOT BROAD ENOUGH AS THESE SAME PARTS HAVE FAILED IN MY CAR.",
        "vin": "WVWHV71KX8W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852395,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE RECENTLY HAD FREQUENT HEADLIGHT BULB FAILURES AND OTHER HEADLIGHT RELATED ISSUES DURING MY OWNERSHIP OF THE CAR.  PRIOR TO INSTALLING ANOTHER EXPENSIVE NEW BULB I DID SOME INVESTIGATION INTO THE WIRING INSIDE THE HEADLIGHT HOUSING AND I WAS COMPLETELY STUNNED AND CONCERNED AT WHAT I FOUND.  THE WIRING INSULATION/COVERING IS MISSING ON THE MAJORITY OF THE WIRES.  ESPECIALLY AT THE MAIN CONNECTOR WHERE THE COVERING ON ALL WIRES IS MISSING. THE MAJORITY, APPROXIMATELY 80% OF THE WIRES ARE BARE.  ANY WIRE INSULATION REMAINING IS CRACKED AND FRAIL.  I AM CONCERNED ABOUT THE SAFETY OF THIS VEHICLES WIRING AND THE POTENTIAL FOR FIRE DUE TO ELECTRICAL SHORTS AS WELL AS THE POTENTIAL FOR THIS ISSUE TO CAUSE OTHER PROBLEMS WITH THE ELECTRICAL CIRCUIT OF THE CAR.   THERE IS NO ROUTINE MAINTENANCE AS AN OWNER THAT COULD HAVE PREVENTED THIS FROM HAPPENING.  I CONTACTED VOLKSWAGEN OF AMERICA AND I WAS TOLD THAT DUE TO THE AGE AND MILEAGE (103,257) OF THE VEHICLE THEY COULDN'T DO ANYTHING.  I BELIEVE THIS TO BE AN ENGINEERING FAILURE TO PROVIDE ADEQUATE INSULATION TO THE WIRING IN AN ENVIRONMENT PRONE TO HEAT AND SHOULD BE SUBJECT TO A FORMAL INQUIRY OF OTHER VEHICLES OF THE SAME MAKE AND MODEL.   THE HEADLIGHT FAILURE INDICATOR ON THE DASH CAME AS I STARTED THE CAR AND I VERIFIED THE LIGHT WAS OUT.  THE WIRING ISSUE WAS FOUND WHILE THE CAR WAS STATIONARY DURING THE REPLACEMENT OF THE BULB.",
        "vin": "WVWHV71K38W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2015",
        "dateOfIncident": "09/12/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743484,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING MY 08 GTI WITH THE FSI MOTOR, I WAS SEARCHING THE INTERNET FOR COMMON ISSUES TO WATCH OUT FOR. THE CAM FOLLOWER WHICH SITS BETWEEN THE CAMSHAFT AND HIGH PRESSURE FUEL PUMP WAS SEEN MULTIPLE TIMES ONLINE AS AN ISSUE DUE TO WEARING THROUGH ALLOWING THE CAM SHAFT TO INTERACT WITH THE PUMP. I ASKED A VW DEALERSHIP ABOUT THE PROBLEM AND THEY TOLD ME THAT EARLIER MODELS WERE COVERED UNDER WARRANTY, BUT 2008 WAS NOT DUE TO THE PROBLEM BEING FIXED BY THE FACTORY FOR THIS YEAR. I DECIDED TO CHECK ANYWAY AND FOUND THAT THE FOLLOWER WAS COMPLETELY WORN THROUGH ALLOWING THE CAM SHAFT TO INTERACT WITH THE PUMP. THIS WAS AT 56K MILES. WHEN I RETURNED TO DISCUSS THIS WITH THE DEALERSHIP THEY SAID THAT THERE WAS NOTHING THEY COULD DO. THIS SHOWS THAT THE PROBLEM WASN'T SOLVED, AND WHILE EARLIER MODELS ARE COVERED FOR THEIR DAMAGE IF SOMETHING GOES WRONG DUE TO METAL SHAVINGS IN MY ENGINE, OR OTHER ISSUES I'LL BE FORCED TO PAY OUT OF POCKET. I AM NOW REPLACING THE FOLLOWER MYSELF EVERY 15K JUST TO BE SURE, BUT THE FACT THAT ONE YEAR ISN'T COVERED IS NOT RIGHT. SINCE THE ISSUE PERSISTS THEY SHOULD COVER IT.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/28/2015",
        "dateOfIncident": "06/28/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730845,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BUCKLING THE DRIVERSIDE SEATBELT BEFORE BACKING UP, IT WOULD NOT LATCH.",
        "vin": "WVWFV71K68W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/17/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661514,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REQUIRED EXTRA CRANKING BEFORE STARTING.  UPON STARTING AND BEGINNING TO DRIVE, THERE WAS LACK OF POWER AND RPMS DID NOT WANT TO GO ABOVE 4K.  AFTER APPROX. 1/4-1/2 MILE ENGINE BEGAN TO RESPOND NORMALLY.   TOOK VEHICLE TO DEALERSHIP FOR DIAGNOSIS.  TOLD THE HIGH PRESSURE FUEL PUMP, CAM FOLLOWER AND CAM NEEDED TO BE REPLACED DUE TO CAM FOLLOWER LOSING HARDNESS AND WEARING THROUGH CAUSING FUEL PUMP TO RUN DIRECTLY ON CAM.  FUEL PUMP ARM WAS WORN AND ALSO SCORED CAM.  WAS TOLD THAT 2006-07 MODEL YEARS HAD EXTENDED WARRANTY FROM VW TO FIX THIS BUT 2008 DID NOT.  IN MODEL YEAR 2009, A COMPLETELY DIFFERENT SYSTEM WAS USED.  I BELIEVE THAT MY ENGINE STILL CONTAINED THE DEFECTIVE PARTS AND VW INTERNET FORUMS ALSO HAVE EXTENSIVE MENTION OF THIS PROBLEM IN 2008 MODELS.  I ALSO ON MANY OCCASIONS HAVE TAKEN VEHICLE TO DEALERSHIP FOR ROUTINE MAINTENANCE AND WAS NEVER INFORMED THAT I SHOULD HAVE THE CAM FOLLOWER INSPECTED FOR WEAR.  THIS IS A $60.00 PART THAT COULD BE REPLACED BEFORE IT WEARS THROUGH.  INSTEAD, I HAVE A QUOTE FROM THE DEALER TO REPLACE NOT ONLY THE CAM FOLLOWER, BUT ALSO THE HIGH PRESSURE FUEL PUMP AND THE CAM FOR SLIGHTLY OVER $2,000.00.  I TOOK THE VEHICLE TO AN INDEPENDENT REPAIR SHOP AND WAS TOLD THAT BECAUSE THERE ARE ALSO METAL SHAVINGS IN THE CAM HOUSING THAT I SHOULD ALSO REPLACE THIS ALONG WITH SOME OTHER MISC. PARTS.  THE HOUSING PART ALONE IS APPROX. $1,600.00.  I AM REPLACING THE FUEL PUMP AND CAM FOLLOWER AND WILL BE CHECKING THE PARTS FOR WEAR EVERY 10-20K MILES.  REPORTED THIS ISSUE TO VW CUSTOMER CARE AND WAS TOLD THAT MY VIN DID NOT FALL INTO THE RANGE FOR THE EXTENDED WARRANTY SO THERE WAS NOTHING THEY COULD DO.  I DID RECEIVE A \"COUPON\" FOR $500 OFF A NEW VEHICLE PURCHASE BUT NOT SURE I WOULD BUY ANOTHER VW AFTER THIS EXPERIENCE.  *JS",
        "vin": "WVWEV71K38W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2014",
        "dateOfIncident": "10/23/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655006,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN GTI. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE STARTED TO JERK WHEN ATTEMPTING TO ACCELERATE. ALSO, THE CONTACT MENTIONED THAT THE KEY HAD TO BE PLACED IN ACCESSORY MODE BEFORE THE VEHICLE WOULD TURN ON. THE FAILURE RECURRED NUMEROUS TIMES. THE DEALER STATED THAT THE CAM, HIGH PRESSURED FUEL PUMP, AND THE EVAP PURGE VALVE NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 99,800.     UPDATED 1/21/15*CN   UPDATED 01/26/15",
        "vin": "WVWFV71K78W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630714,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN GTI. THE CONTACT STATED THAT WHILE ATTEMPTING TO DRIVE, THE VEHICLE HESITATED AND MADE AN ABNORMAL NOISE WHEN SHIFTING GEARS. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE TRANSMISSION FAILED AND AS A RESULT A FLUSH NEEDED TO PERFORM. THE REMEDY FAILED TO REPAIR THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "WVWFV71K28W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592823,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN GTI. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS DID NOT PROJECT. THE HEADLIGHTS WERE NOT AIMED PROPERLY AND CAUSED REDUCED ROAD VISIBILITY INTERMITTENTLY. THE CONTACT USED THE HIGH BEAMS AS AN INTERIM FIX DUE TO THE FAILURE. THE VEHICLE WAS SCHEDULED TO BE INSPECTED, DIAGNOSED AND REPAIRED BY AN AUTHORIZED DEALER. THE CONTACTS VIN  WAS NOT INCLUDED IN NHTSA RECALL CAMPAIGN NUMBER: 07V442000 (EXTERIOR LIGHTING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "WVWEV71K48W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2012",
        "dateOfIncident": "07/18/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466726,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN GTI. THE CONTACT STATED THAT THE AIR BAG LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT TOOK THE VEHICLE THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE AIR BAG NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE.  THE FAILURE MILEAGE WAS 42,000.  UPDATED 08/28/12*LJ",
        "vin": "WVWFV71K18W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/13/2012",
        "dateOfIncident": "06/10/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10461479,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLKSWAGEN GTI. THE CONTACT STATED WHILE DRIVING 40 MPH THE DRIVER REAR ENDED ANOTHER VEHICLE AND THE PASSENGER SIDE AIR BAG DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE PASSENGER SUSTAINED BRUISES AFTER HITTING HER HEAD ON THE DASHBOARD. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 67,000.    *TR",
        "vin": "WVWGV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "12/19/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452238,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE TRANSMISSION DOG BONE MOUNT BOLT BROKE.  THIS DAMAGED:  THE TRANSMISSION HOUSING - THE TRANSMISSION HOUSING SUPPORT - THE CATALYTIC CONVERTER ASSEMBLY - STEERING - THE WIRING HARNESS - THE RADIATOR - THE RADIATOR FAN - ADDITIONAL ITEMS.     THE LOSS OF CONTROL THAT RESULTED COULD HAVE LED TO BODILY INJURY.    VW IS DECLINING WARRANTY COVERAGE FOR THIS DEFECT.       *JS",
        "vin": "WVWGD71K08W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/01/2011",
        "dateOfIncident": "07/08/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438428,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2008  VOLKSWAGEN GTI. CONSUMER STATED THEY HIT A POTHOLE WHILE DRIVING AT NIGHT IN THE POCONE PA AREA.  THE TIRE WAS LESS THAN ONE MONTH OLD. HAD ALL FOUR TIRES REPLACED SHORTLY AFTER PURCHASING THE VEHICLE IN JUNE.  THE CONSUMER STATED THE LOW PROFILE HIGH PERFORMANCE TIRES WERE PRONE TO FREQUENT BLOW OUTS.  *JB",
        "vin": "WVWHV71K08W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/08/2011",
        "dateOfIncident": "05/19/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406369,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VOLKSWAGEN GTI. CONSUMER WRITES IN REGARDS TO DISCONTENT RELATED TO VEHICLE PERFORMANCE *TGW  THE CONSUMER STATED DURING A 70,000 MILE SERVICE MAINTENANCE, SHE WAS INFORMED THE VEHICLE NEEDED A NEW $2300 TURBO ON A THREE YEAR OLD VEHICLE. *JB  UPDATED 06/09/11",
        "vin": "WVWF71K68W1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2010",
        "dateOfIncident": "11/02/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371595,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME TO COMPLETE STOP. PRESSED ON GAS PEDAL TO MOVE FORWARD INTO INTERSECTION. AFTER AUTOMATIC TRANSMISSION SHIFTED INTO 2ND, THE CAR LOSS ALL ENGAGEMENT AND FELT AS IF IT WAS IN NEUTRAL. I STEPPED ON THE GAS PEDAL FURTHER AND AFTER 5 SECONDS, THE ENGINE RPM\"S INCREASED AND THE TRANSMISSION LUNGED FORWARD. I AM UNSURE IF IT WAS THE DSG TRANSMISSION SLIPPING INTO NEUTRAL, OR A THROTTLE ISSUE. DEALER REPLACED MECHATRONIC UNIT WHICH DID NOT ALLEVIATE THIS FREQUENT PROBLEM.",
        "vin": "WVWHV71K18W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353227,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW GTI DSG--AUTOMATIC TRANSMISSION PROBLEM:    THE CAR \"JUMPS\" RANDOMLY WHEN RELEASING FOOT OFF THE BRAKE AT A RED LIGHT, OR WHEN ENGAGING FROM PARK TO DRIVE AND RELEASING BRAKE.  MANY \"CLOSE CALLS\" TO CRASHING AND/OR PROPERTY DAMAGE DUE TO KNOWN ISSUE, ESPECIALLY WHEN PARALLEL PARKED ON STREET: I.E. CAR JUMPING FORWARD OR BACKWARD POTENTIALLY DAMAGING PARKED CARS AROUND OR, EVEN WORSE, \"JUMPING\" INTO THE TRAFFIC LANES.  DEALERSHIP DEFLECTS THE ISSUE, CLAIMING IT TO BE \"NORMAL\" OPERATION OF THE TRANSMISSION.  WARRANTY ON THE TRANSMISSION HAS BEEN EXTENDED TO 10YR/100,000MILE, THOUGH NOT IN RESPONSE TO THIS ISSUE, ACCORDING TO DEALERSHIP. *TR",
        "vin": "WVWFV71K98W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2010",
        "dateOfIncident": "08/11/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352515,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUG 11TH I TURNED A CORNER IN MY 2008 VW GTI WITH ~29,8XX MILES ON THE ODOMETER, ACCELERATED BRISKLY IN 2ND GEAR AT APPROX 4000 RPM THE CAR BUCKED AND SHUDDERED AND LOST POWER.  WHEN THE RPM'S DROPPED ABOUT 500RPM THE MOTOR REGAINED POWER UNTIL ABOUT 4000 RPM AND THEN THE CAR BUCKED, SHUDDERED AND LOST POWER AGAIN.   THIS CONTINUED TO HAPPEN AS LONG AS THE ACCELERATOR PEDDLE WAS DEPRESSED.  THIS HAPPENED IN EVERY GEAR.  LUCKILY THIS HAPPENED ON A LONG FREEWAY ENTRANCE RAMP PRIOR TO MY ATTEMPT TO MERGE WITH FREEWAY TRAFFIC.  I TOOK IT TO THE DEALER AND THE ECU HAD A LOW FUEL PRESSURE CODE.  THIS APPARENTLY IS A KNOWN ISSUE AND THEY REPLACED THE CAM, HIGH PRESSURE FUEL PUMP AND CAM FOLLOWER.  APPARENTLY THE HIGH PRESSURE FUEL PUMP IS DRIVEN OFF THE CAM AND OVER TIME PUNCHES A HOLE IN THE CAM FOLLOWER AND THEN RIDES DIRECTLY ON THE CAM SHAFT CAUSING SCORING AND RESULTING IN THE FAILURE I EXPERIENCED.  I SPECIFICALLY ASKED TO SEE THE OLD PARTS AS I WANTED TO ASCERTAIN THE AMOUNT OF METAL SHAVINGS THAT WERE NOW FLOATING AROUND IN MY ENGINE.  FOR WHATEVER REASON THEY DID NOT SAVE THE PARTS AND SENT THEM BACK TO VW SINCE THIS REPAIR WAS UNDER WARRANTY. *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349906,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "245/60R18",
                "type": "Tire"
            }
        ],
        "summary": "HARSH SHIFTING DURING ACCELERATION IN 2008 VOLKSWAGEN GTI WITH DSG TRANSMISSION. *TR",
        "vin": "WVWFV71K68W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/06/2010",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334806,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE CONSUMES 3-4 EXTRA QUARTS OF SYNTHETIC OIL BETWEEN 5,000 MILE OIL CHANGE INTERVALS AS INSTRUCTED BY MANUFACTURER. ITS A 2.0T ENGINE THAT USES SYNTHETIC OIL. I HAD PREVIOUS VERSION OF 1.8T AND IT DID NOT CONSUME ANY OIL AT ALL.  IF THE OIL IS NOT ADDED, THE CAR WOULD TAKE 2-3 TIMES TO START UP (DOESN'T MATTER WHICH SEASON) AND ITS HORRIBLE ON GAS MILEAGE.  WENT TO DEALERSHIP 5 TIMES ALREADY AND EVERY TIME THEY TELL ME THAT THIS IS NORMAL CONSUMPTION. I INFORMED THAT I HAVE TO ADD OIL TO KEEP THE CAR GOING, THEY TOLD ME THAT ITS NOT THEIR PROBLEM UNTIL THE ENGINE CEASES AT WHICH TIME THEY WILL LOOK INTO IT.   AS A CONSUMER,  I HAVE NO CHOICE BUT TO KEEP ON ADDING THE SYNTHETIC OIL. I THOUGHT THAT SYNTHETIC OIL IS HARD TO BREAK DOWN AND YES I USED THE RECOMMENDED GRADE. VW IS TAKING ME FOR A RIDE. DOES ANYBODY HAVE ANY SUGGESTIONS? *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328466,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2008 VW GTI WITH THE DSG TRANSMISSION. THE TRANSMISSION IS VERY NOISY, EXTREMELY DIFFICULT TO DRIVE AT LOW SPEEDS, AND IS JERKY AND BUCKS WHEN DOWNSHIFTING. AT LOW SPEEDS, THE CLUTCH ENGAGES WITH A JERK AND THE CAR LURCHES FORWARD TO ACCELERATE. WHEN DOWN SHIFTING, IT IS DIFFICULT TO BRAKE BECAUSE AS THE GEARS ARE DISENGAGING AND REENGAGING IN A JERKY MANNER, THE AMOUNT OF BRAKE FORCE REQUIRED TO STOP CHANGES TOO. I RECEIVED A RECALL LETTER ABOUT THIS FROM VOLKSWAGEN OF AMERICA, BUT THE DEALERSHIP DENIES ANY LETTER WAS SENT TO ME AND THAT THERE IS NOTHING WRONG WITH MY VEHICLE. *TR",
        "vin": "WVWFV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2010",
        "dateOfIncident": "04/27/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327824,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD JERKING BASED IN AUTO TRANSMISSION OCCURRING WHEN IN DRIVE AT A STOP WITH NO PRESSURE APPLIED TO EITHER THE BRAKE OR THE GAS.  THIS OCCURS CONSISTENTLY AND DAILY UNDER NORMAL, IN-TOWN DRIVING CONDITIONS. *TR",
        "vin": "WVWFV71K48W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316678,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "SP SPORT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A NEW 2008 VOLKSWAGEN GTI IN SEPT, 2008 WHICH CAME WITH DUNLOP SP SPORT 01 AS SIZE 225/40R/18 TIRES.  WITHIN THE FIRST FEW MONTHS I EXPERIENCED A BLOWOUT OF THE FRONT LEFT TIRE WHEN AT VERY LOW SPEED (APPROX 5 MPH I HIT A SMALL POTHOLE.  IN THE YEAR SINCE THEN, I HAVE HAD THREE MORE TIRES GET LARGE BUBBLES IN THE SIDEWALL (INCLUDING TWO OVER THE LAST TWO WEEKS) UNDER THE SAME CIRCUMSTANCES.  I ALSO RESEARCHED THIS TIRE ON THE TIRE RACK WEBSITE AND FOUND THAT OUT OF APPROXIMATELY 45 REVIEWS OF THIS TIRE THERE WERE 18 COMPLAINTS OF EXACTLY THE SAME THING HAPPENING AND IN MOST OF THESE THEY ALSO EXPERIENCED THIS FAILURE 3 OR 4 TIMES IN A RELATIVELY SHORT PERIOD OF TIME.  I HAD PURCHASED A TIRE WARRANTY WHEN I PURCHASED MY CAR AND THEY HAVE PAID TO REPLACE THESE TIRES EACH TIME.  SINCE THERE ARE ALMOST NO CASES SUCH AS THESE LISTED FOR ANY OTHER TIRE REVIEW ON THE TIRE RACK WEBSITE I NOW BELIEVE THERE IS A DESIGN FLAW IN THIS PARTICULAR TIRE.  I HAVE CONTACTED GOODYEAR/DUNLOP TO REQUEST THAT THEY EITHER REPLACE THIS TIRE WITH A DIFFERENT MODEL OR BUY THEM BACK FROM ME AND ALLOW ME TO PURCHASE A SAFE TIRE AND THEY HAVE REFUSED TO DO ANYTHING OR ACKNOWLEDGE THERE MAY BE A DEFECT IN THE DESIGN OF THIS TIRE. *TR",
        "vin": "WVWFV71KX8W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2009",
        "dateOfIncident": "12/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 VOLKSWAGEN GTI AND AM HAVING MANUAL TRANSMISSION PROBLEMS,  THREE MONTHS OF OWNING THE CAR MY FIRST GEAR SCYNRO HAS GONE OUT,(DISINTEGRATED) THIS PROBLEM HAS BEEN REPAIRED UNDER WARRANTY. AND NOW HAS GONE OUT A SECOND AND A THIRD TIME. THE SECOND TIME SAME DEALER SAME WARRANTY REPAIR.  FOR THE THIRD REPAIR THE DEALER HAS DENIED MY WARRANTY FOR THE PART IN QUESTION. I'M CURRENTLY TRYING TO GET A HOLD OF VW IN GERMANY, BECAUSE VOLKSWAGEN OF AMERICA'S CUSTOMER SERVICE IS NOT WILLING TO HELP ME. *TR",
        "vin": "WVWEV71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2009",
        "dateOfIncident": "12/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294674,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LURCHES WHEN MOVING FROM A STOP. THIS IS A BIG ISSUE IN TRAFFIC DUE TO THE LAG THAT EXISTS IN APPLICATION OF THROTTLE TO ACTUAL MOVEMENT. WHAT ALSO HAPPENS IS A MOMENTARY NEUTRAL WHEN YOU APPLY FULL THROTTLE WHEN MOVING. THIS IS NOT LIKE A NORMAL KICKDOWN, THE CAR DOES NOTHING AT FIRST THEN ROCKETS FORWARD , TO THE EXTENT THAT IT IS VERY DIFFICULT TO DRIVE IN STOP AND GO TRAFFIC. I HAVE HAD NUMEROUS CLOSE CALL IN THIS CAR AS A RESULT OF THE TRANSMISSION SHIFT PATTERNS. THESE ARE ALL PRESENT AFTER DRIVING THE CAR 20+ MILES TO WORK IN TRAFFIC. *TR",
        "vin": "WVWHD71K98W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/20/2009",
        "dateOfIncident": "09/16/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293056,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR (2008 VW GTI W/DSG) RUNS VERY CHOPPY AT LOW SPEEDS AND IN REVERSE.  OFTEN TIMES AT A STOP LIGHT, THE CAR WOULD SHIFT VERY HARD INTO FIRST GEAR WHEN I LET GO OF THE BRAKE. *TR",
        "vin": "WVWFV71K78W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/30/2009",
        "dateOfIncident": "10/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290389,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL ACCELERATION FROM A STOP OR ROLLING, THE DSG TRANSMISSION WILL HESITATE AND PRODUCE A VERY ROUGH SHIFT TO THE NEXT GEAR. THIS IS INTERMITTENT BUT ALMOST DAILY. CAR IS NOW IN THE VW DEALERS REPAIR SHOP. *TR",
        "vin": "WVWHV71K48W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "08/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287449,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VW GTI DSG TRANSMISSION, DRIVING APPROX 30-40KM/H, TRANSMISSION LIGHTS STARTED FLASHING, VEHICLE WAS STUCK IN FIRST GEAR. *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2009",
        "dateOfIncident": "08/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 VW MKV GTI WITH DSG TRANSMISSION, AND I HAVE ENCOUNTERED THE FOLLOWING PROBLEMS.  1.     AFTER A 700 MILE DRIVE, I NOTICED THAT THE PRDNS DISPLAY WAS FLASHING,          AND THAT MY TRANSMISSION WAS LOCKED IN 2ND GEAR, NO OTHER GEARS COULD BE          USED INCLUDING REVERSE          AFTER SHUTTING DOWN MY CAR, AND LETTING IT SIT FOR 20 MINUTES, I RESTARTED THE         CAR AND IT WAS BEHAVING NORMAL AGAIN, AND THE FLASHING OF THE PRDNS         DISPLAY WAS GONE.    2.    FOR A COUPLE OF DAYS NOW I HAVE EXPERIENCED A POTENTIALLY DANGEROUS         BEHAVIOR OF MY DSG TRANSMISSION, WHEN COMING TO A STOP IT JERKS AND         SURGES FORWARD IN 1ST GEAR, THE SAME HAPPENS WHEN TAKING OF FROM A STOP         IT JERKS AND SURGES, WHICH MAKES IT FOR THE DRIVER IMPOSSIBLE TO         CONTROL/MODULATE THE SPEED WITH WHICH THE CAR WILL MOVE FORWARD, I HAVE         TO KEEP A SUBSTANTIAL DISTANCE FROM THE TRAFFIC IN FRONT OF ME TO NOT HIT         THEM BY ACCIDENT DUE TO THE SURGING BEHAVIOR OF MY TRANSMISSION         THIS SURGING AND JERKY BEHAVIOR IS ONLY IN 1ST GEAR AND REVERSE, AND         HAPPENS WHEN THE TRANSMISSION SHIFTS BACK INTO 1ST OR WHEN YOU TAKE OFF         FROM 1ST OR REVERSE.    CURRENTLY DEALERS ARE AWARE OF THE ISSUES, BUT HAVE NOT BEEN ABLE TO FIX THE ISSUES DUE TO PARTS NOT BEING AVAILABLE AT THE TIME I CALLED. *TR",
        "vin": "WVWFV71K68W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282844,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. PROBLEM - ROUGH UP AND DOWNSHIFTS IN D, MANUAL/TIPTRONIC MODE, AND S MODES (ALL MODES AVAILABLE IN THE CAR).    2.   WHEN MANUALLY DOWNSHIFTING/UPSHIFTING THE CAR OR WHEN ALLOWING THE CAR TO DO SO ON ITS OWN, YOU OFTEN GET A SLIGHT TO SEVERE JERK. PROBLEM OCCURS ON 90% OF ALL SHIFTS.     3.  BEEN TO THE DEALERSHIP SEVERAL TIMES, HAVE DROPPED THE CAR OFF 3 TIMES.  FIRST TWO TIMES THEY HAD DONE SOFTWARE RESET AND THEN A SOFTWARE UPDATE.  NEITHER FIXED THE ISSUE ALTHOUGH THEY TOLD ME THE CAR WAS 'RUNNING FINE' OR THE 'JERKS ARE NORMAL'.  THIS THIRD TIME, THE MECHATRONIC UNIT (WHAT I FEEL IS THE CULPRIT AND HAVE BEEN PUSHING) IS SUPPOSEDLY BEING REPLACED.  UNCERTAIN IF THIS WILL RESOLVE THE ISSUE 100%.  STILL DO NOT HAVE THE CAR. *TR",
        "vin": "WVWFV71K08W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2009",
        "dateOfIncident": "01/06/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282088,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "JERKING WHEN GOING IN REVERSE OR WHEN TAKING OF FROM A STAND STILL. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "06/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281611,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BEGINNING TO ACCELERATE FROM A COMPLETE STOP THE CAR LUNGES AND/OR IS VERY JERKY (EXTREMELY SUDDEN STARTS AND STOPS). IF THE CAR IS ON A HILL THE CAR ROLLS BACK VERY QUICKLY AND TAKES A WHILE TO START MOVING FORWARD, IF THE VEHICLE BEHIND IS TOO CLOSE ITS POSSIBLE TO ACCIDENTALLY HIT THEM. DURING CONGESTED TRAFFIC ITS UNPREDICTABLE WHEN THE VEHICLE WILL SUDDENLY LUNGE, IN THE EVENT OF GETTING CUT OFF BY ANOTHER CAR ITS VERY POSSIBLE TO ACCIDENTALLY DRIVE INTO THEM. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2009",
        "dateOfIncident": "08/08/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280175,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE NOTICED STARTING THIS SUMMER MY CAR HAS BEEN REALLY JERKY, EVEN SURGING FORWARD WHEN STOPPED OCCASIONALLY. A FEW DAYS AGO IT ACTUALLY LOST POWER WHILE I WAS AT SPEED ON THE FREEWAY. THIS IS EXTREMELY DANGEROUS, ESPECIALLY IN THE WINTER TIME WITH ICY CONDITIONS WHERE I LIVE. AFTER RESEARCHING THE PROBLEM I'VE NOTICED I'M NOT THE ONLY ONE WITH THIS PROBLEM. SOMETHING HAS TO BE DONE BEFORE IT COSTS SOMEONE THEIR LIFE. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/12/2009",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280266,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE FRONT WINDSHIELD WIPERS ARE ON IN THE SLOW CONSTANT (AKA 'LOW' OR IN THE VW OWNERS MANUAL \"POSITION 2\")  AND I COME TO A COMPLETE STOP, THE WIPERS STOP AND GO TO A LONG DELAY INTERVAL.  ONCE I START MOVING AGAIN, THEY GO BACK TO 'NORMAL'.    I FIND THIS TO BE A SAFETY HAZARD  WHEN IT IS RAINING HARD AS IT BECOMES DIFFICULT TO SEE OUT OF THE WINDSHIELD WHEN AT STOPLIGHT, INTERSECTION ETC.  IF I TURN THE WIPERS ON TO \"HIGH\" LEVER POSITION 3 THEY WILL WIPE CONSTANTLY, ALBEIT SLOWLY.    THIS OCCURS ALL THE TIME.  I HAVE CONTACTED MY DEALER WHO SAYS THEY DO NOT KNOW HOW TO CORRECT THIS AND I HAVE CONTACTED VW WHO SAYS IT IS NORMAL AND CANNOT BE CHANGED.  I FIND IT DIFFICULT TO UNDERSTAND HOW SEMI-FUNCTIONAL WIPERS FOR A WINDSHIELD EVEN WHILE THE VEHICLE ISN'T MOVING COULD BE CONSIDERED NORMAL.  HOW ELSE AM I TO MAKE SURE THERE ISN'T ANYTHING, OR ANYONE IN FRONT OF ME BEFORE I MOVE FORWARD. *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2009",
        "dateOfIncident": "07/16/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280167,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL START WITH THE MOST SERIOUS INCIDENT FIRST. AT THE TIME OF INCIDENT I WAS DRIVING UP A HILL MAKING A LEFT TURN INTO A SIDE STREET. I STOPPED TO WAIT FOR TRAFFIC TO CLEAR, WHEN TRAFFIC CLEARED I LET OFF THE BRAKE AND PRESSED THE GAS PEDAL. THE CAR SLOWLY STARTED TO ROLL FORWARD AS I APPROACHED THE MIDDLE OF THE ONCOMING LANE THE TRANSMISSION SHIFTED INTO NEUTRAL AND THE RPM'S CLIMBED. WE STARTED TO ROLL BACK SLIGHTLY. I PRESSED THE GAS HARDER AND THE CAR ROLLED BACK FOR A SECOND, THEN SLAMMED INTO THE FORWARD GEAR AND I MADE IT ACROSS THE INTERSECTION, WITHOUT BEING HIT BY AN ONCOMING VEHICLE. MY GIRLFRIEND WAS IN THE PASSENGER SEAT AND VERY UPSET ABOUT THIS. EARLIER THAT EVENING WE EXITED A DRIVEWAY IN REVERSE, THEN PUT THE CAR INTO DRIVE. THE CAR ROLLED BACK AND STALLED. I GOT THE CAR STARTED AND WE RESUMED OUR TRIP. I TOOK IT TO THE DEALER, AND THEY SAID THERE WERE NO FAULT CODES AND SAID EVERYTHING IS FINE.   YESTERDAY (AUG 10TH 2009) I WAS EXITING A PARKING LOT, MAKING A LEFT TURN AND AGAIN HALFWAY THROUGH THE TURN THE CAR WENT INTO NEUTRAL, NEARLY CAUSING AN ACCIDENT, THE CAR THEN SLAMMED BACK INTO GEAR AND RESUMED FORWARD MOTION.   IN ADDITION TO THESE INCIDENTS THE VEHICLE SLAMS INTO FORWARD GEAR FROM ALMOST EVERY STOP. AND WHEN THE TRANSMISSION DOWNSHIFTS WHILE STOPPING THERE IS A STRONG JERKY MOTION. ALSO IN REVERSE THE VEHICLE BUCKS AS IF IS GOING IN AND OUT OF THE REVERSE GEAR. ALL INCIDENTS OCCURRED WHILE THE VEHICLE WAS IN NORMAL \"D\" DRIVING MODE, FOR THE FORWARD INCIDENTS, OR \"R\" GEAR FOR THE REVERSE INCIDENTS.  THESE JERKY MOTIONS ARE DAILY OCCURRENCES. *TR",
        "vin": "WVWFD71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2009",
        "dateOfIncident": "06/29/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279106,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "-WHEN I LIFT MY FOOT OF THE BRAKE AND APPLY GAS AFTER COMING TO A STOP, THE CAR WILL HESITATE AND THEN VIOLENTLY LURCH FORWARD AS IT SHIFTS INTO GEAR, THIS IS EXTREMELY BOTHERSOME WHEN IN BUMPER TO BUMPER TRAFFIC SITUATIONS, WHEN I HAVE MANY TIMES LIFTED MY FOOT OF THE BRAKE, APPLIED NO PRESSURE TO THE ACCELERATOR, AND THE CAR PROCEEDED TO VIOLENTLY LURCH FORWARD 6 FEET OR SO, NEARLY INTO THE BACK OF THE CAR IN FRONT OF ME. IT SEEMS AS THOUGHT THE TRANSMISSION CAN NOT SLOWLY MOVE INTO 1ST GEAR.    -THERE IS OFTEN A DELAY IN POWER WHEN \"GETTING ON IT\", THIS IS ESPECIALLY TROUBLESOME WHEN MAKING A MERGE ONTO A BUSY HIGHWAY WHEN I NEED TO QUICKLY ACCELERATE. I WILL LITERALLY PUT THE PEDAL TO THE FLOOR AND THE CAR WILL EITHER REV AND NOT MOVE, OR SIMPLY STUTTER FOR 2-4 SECONDS. I AM SURPRISED I HAVEN'T BEEN REAR ENDED BECAUSE OF THIS ALREADY.    -BOTH IN DRIVE AND REVERSE THE CAR MAKES A BUCKING MOTION WHEN A CONSISTENT LIGHT AMOUNT OF PRESSURE IS PUT ON THE ACCELERATOR. ALTHOUGH MY FOOT DOES NOT MOVE, THE ENGINE GOES INTO A CYCLE OF POWER SURGES. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278851,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A NEW 2008 VW GTI WITH THE DSG TRANSMISSION. AFTER 3 MONTHS OF OWNERSHIP, I NOTICED THE FOLLOWING PROBLEM: WHEN VEHICLE STARTS TO SLOWLY ACCELERATE FROM A COMPLETE STOP, VEHICLE SURGES BACK AND FORTH (JERKS) CONSTANTLY UNTIL YOU PICK UP SPEED THEN CONDITION GOES AWAY. THIS IS MORE PREVALENT WHEN ENGINE/TRANS IS HOT. ALSO CONDITION IS WORST WHEN VEHICLE STARTS TO MOVE WHEN GOING UPHILL OR INCLINES, IT WILL SURGE HARD AS IF TRYING TO DECIDE ON 1ST OR 2ND GEAR.  I WANT TO REPORT THIS, BECAUSE ON SEVERAL INSTANCES, SPECIALLY WHEN SLOWLY APPLYING THE GAS TO CREEP UPHILL ALONG WITH TRAFFIC, MY VEHICLE HAS SURGED FORWARD HARD ENOUGH THAT I ALMOST HIT THE CAR IN FRONT OF ME IF I HAD NOT AND REACTED QUICKLY TO THE JERKING SURGE. CONDITION ALSO PRESENTS WHEN DRIVING ON A LEVEL ROAD, BUT ITS MORE CONTROLLABLE THAN IN AN INCLINE. IT ONLY HAPPENS WHEN CREEPING OF GOING SLOWLY BELOW 1200RPM. I HAVE READ THAT THIS CONDITION AFFECTS THE DSG TRANSMISSION AND ITS MECHATRONICS UNIT IS PRONE TO FAILURE CAUSING THE SYMPTOMS I HAVE DESCRIBED. *TR",
        "vin": "WVWHV71K78W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278703,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ABOUT 4,000 MILES ON MY CAR I WAS PARKED ON A HILL GOING UPWARDS, I TURNED THE CAR ON ONLY TO FIND THAT IT WOULD GO INTO D, BUT NOT ENGAGE IN DRIVE AND I WOULD JUST DRIFT BACKWARDS.  THEN I NOTICED \"PRNDS\" WAS FLASHING WHERE THE GEARS USUALLY ARE LOCATED ON THE MFD.  I SHUT THE CAR OF AND TURNED IT BACK ON, EVERYTHING WORKED OUT FINE.  THIS HAS OCCURRED ONE OTHER TIME, SAME EXACT SCENARIO, AT 15,000 MILES.  ALSO, WHEN STARTING OUT OR SLOWING DOWN, NO MATTER WHAT GEAR I'M IN, MY CAR WILL SHUTTER VERY ROUGHLY.  I TOOK A FEW PEOPLE FOR A RIDE, THEIR REACTION WAS \"WHAT ARE YOU DOING?: AND \"IS THAT NORMAL?\"    NOW I HAVE HAD MY CAR AT THE DEALERSHIP TWICE ABOUT THIS, AND ALL THEY TELL ME IS THAT IT'S \"NORMAL FOR THE DSG\" AND I DON'T NEED TO WORRY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "02/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278706,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DSG TRANSMISSION JUMPING OUT OF GEAR AT HIGHWAY SPEEDS CAUSING MY VEHICLE TO SLOW DRAMATICALLY. WHEN STARTING FROM A STOP THERE IS A DELAY BETWEEN THROTTLE INPUT AND ACTUAL MOVEMENT. THE CAR WILL REV, AND THEN \"LURCH\" HEAVILY AND SUDDENLY FORWARD. I HAVE ALMOST BEEN IN NUMEROUS ACCIDENTS DUE TO THESE TWO PROBLEMS.   SLOW SPEED \"PARKING\" MANEUVERS ARE ALSO DANGEROUS DUE TO A \"SURGING\" IN ACCELERATION, AND OCCASIONAL LAG IN GEAR SELECTION.   THESE ISSUES ONLY APPEAR WHEN THE TRANSMISSION IS WARM.   I HAVE REPORTED THE ISSUES TO VOLKSWAGEN ON NUMEROUS OCCASIONS ONLY TO BE TOLD IT IS NORMAL, AND SENT AWAY. IT HAS BEEN ONGOING FOR OVER 6 MONTHS. *TR",
        "vin": "WVWFV71K28W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "01/24/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278424,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS JERKING DURING LOW SPEED DRIVING AND HAS HARD SHIFTS SOMETIMES. WHEN BACKING UP THE CAR BUCKS OR WHEN TAKING OFF SLOWLY OR IN TRAFFIC THE CAR IS EXTREMELY JERKY. *TR",
        "vin": "WVWHV71K88W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278158,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DSG WORKED WHEN I FIRST GOT THE CAR. I NOW HAVE 20K MILES ON THE CAR AND MY DSG IS CLUNKY, UNSMOOTH, AND SOMETIMES THE REVERSE GEAR DOES NOT EVEN WORK, IT JUST GOES INTO NEUTRAL AND STAYS THERE UNTIL I GO BACK INTO PARK AND SWITCH BACK TO REVERSE. I THINK THAT THE DSG IS A GREAT TRANSMISSION, DON'T GET ME WRONG, BUT I FEEL THAT TOO MANY OF THEM ARE FAILING TOO QUICKLY. IF VWOA WERE TO FIX THESE BUGS THEN IT WOULD BE AN AMAZING TRANSMISSION. I AM HAVING SO MANY PROBLEMS WITH MY TRANSMISSION THAT IM THINKING THAT I SHOULD HAVE JUST GOT THE MANUAL. VWOA NEEDS TO FIX THESE BUGS BEFORE SOMETHING BAD HAPPENS, TO ME, OR OTHER FELLOW VW OWNERS. *TR",
        "vin": "WVWHV91KX8W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278235,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN DRIVE MY CAR JERKS AND LUNGES IN LOW SPEED DRIVING.  THIS HAPPENS ON A CONSISTENT BASIS AND IS A CONCERN OF MINE.  I BROUGHT MY VEHICLE IN TO MY LOCAL DEALERSHIP AND WAS TOLD THAT THEY ARE NOT ABLE TO DO ANYTHING ABOUT IT BECAUSE THE ISSUES ARE STEMMING FROM THE DESIGN OF THE TRANSMISSION, NOT FROM A FAULTY PART. *TR",
        "vin": "WVWHV71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278061,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SURGING DURING PARKING MANEUVERS  HARSH SHIFTING FROM THE STOP LIGHT. *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278094,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH DSG TRANSMISSION SURGING AND CAR LURCHING AT LOWER SPEEDS.  MAKES PARKING PARTICULARLY DANGEROUS AND DIFFICULT.  CAR DOWNSHIFTS VERY HARSHLY CAUSING EXAGGERATED ENGINE BRAKING.  VEHICLE WILL HESITATE FROM A STOP AND SOMETIMES IS INDECISIVE ABOUT WHICH GEAR SHOULD BE ENGAGED.  WE ARE TOLD THE \"MECHATRONICS\" UNIT WILL NEED REPLACED, IT'S BEEN OVER 4 WEEKS AND NO UPDATE ON PARTS OR SERVICE.  WE ARE TOLD THE PARTS ARE COMING FROM GERMANY. *TR",
        "vin": "WVWFV71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277889,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FIRST BOUGHT MY 2008 VOLKSWAGEN GTI IT WAS A GREAT CAR, BUT SHORTLY AFTER THINGS STARTED TO CHANGE. FOR NO APPARENT REASON THE CAR STARTED DRIVING VERY ROUGH AND HAS ALMOST GOT ME INTO ACCIDENTS AT TIMES. ONE INSTANCE OF THIS WAS WHEN I WAS TURNING ONTO A HIGHWAY (RIGHT ON RED) AND AFTER ACCELERATING AND THE CAR SHIFTING TO 2ND GEAR FROM 1ST THE CAR JUST PAUSED AND TOOK 3-4 SECONDS TO SHIFT AND LEFT ME THERE NOT ACCELERATING AND ALMOST GETTING REAR ENDED. LUCKILY THERE DRIVER AVOIDED HITTING ME AND I WAS SAFE. I HAVE BEEN READING UP ON THIS PROBLEM AND IT SEEMS TO BE WITH THE MECHATRONICS UNIT OF THE DSG(DIRECT SHIFT GEARBOX) IN MY CAR AND MANY OTHERS ARE HAVING SIMILAR PROBLEMS. SOME PEOPLE HAVE BEEN LUCKY ENOUGH FOR IT TO BE FIXED AND OTHERS ARE STUCK WITH IT STILL NOT WORKING AFTER MULTIPLE FIXES. IT WOULD BE GREAT IF SOMEONE COULD LOOK INTO THIS PROBLEM AND FIND A RESOLUTION. *TR",
        "vin": "WVWFV71K88W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "07/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277526,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DSG TRANSMISSION ON MY 2008 VW GTI BEGAN ACTING UNPREDICTABLY ABOUT 3 WEEKS AGO.  WHEN LIFTING OFF THE BRAKE AFTER COMING TO A STOP, THE CAR FEELS LIKE IT IS ABOUT TO STALL, THE ENGINE RPM'S DROP VERY LOW (250RPM), AND THEN QUICKLY JUMP TO 750-1000RPM, FORCING THE CAR TO BUCK AND SURGE FORWARD.  IN REVERSE, THE CAR BUCKS BACKWARD.  THIS CREATES UNPREDICTABLE DRIVING CONDITIONS. I AM CONCERNED IT COULD CREATE AN ACCIDENT AT A STOP LIGHT OR OTHER INTERSECTION BY EITHER UNCONTROLLABLY SURGING INTO THE CAR IN FRONT OF ME OR BY BEING HIT BY THE CAR BEHIND ME AS THE CAR BUCKS FORWARD.    I HAVE TAKEN THE CAR TO THE DEALER FOR SERVICE AND THEY IDENTIFIED A FAULTY MECHATRONICS UNIT WHICH WOULD REQUIRE 3-4 WEEKS TO BE REPAIRED.   THE DEALER STATED THE CAR CANNOT BE DRIVEN UNTIL THAT PART IS REPLACED AND WILL REMAIN IN THEIR POSSESSION UNTIL THAT TIME.  *TR",
        "vin": "WVWHV71K48W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2009",
        "dateOfIncident": "07/19/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO NOTICE A FEW MONTHS AGO THAT MY DSG TRANSMISSION ON MY 2008 VOLKSWAGEN GTI WAS STARTING TO ACT WEIRD. IT WOULD HAVE A HARD JERKING WHEN IT WOULD DOWNSHIFT INTO A GEAR WHEN COMING TO A STOP. ITS WOULD ALSO HESITATE GOING INTO GEAR WHEN I WOULD GIVE IT THROTTLE. A FEW TIMES WHEN THE HESITATION WOULD OCCUR IT ALMOST CAUSED ME TO GET INTO AN ACCIDENT. *TR",
        "vin": "WVWFV71K38W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "04/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276726,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED AN ISSUE WITH MY 2008 VW GTI DSG TRANSMISSION WHICH CAUSED SAFETY HAZARDS DUE TO THE JERKING AND UNRESPONSIVENESS OF THE CAR WHEN MERGING INTO TRAFFIC.  VW DID REPLACE THE TRANSMISSION PARTS WHICH WERE DEFECTIVE BUT I AM CONCERNED THAT THE SAME FAILURES WILL REPEAT AFTER MY WARRANTY PERIOD ENDS.  PLEASE TAKE ACTION TO EXTEND THE WARRANTY ON DSG TRANSMISSION FOR 08 VW GTI'S.  THANK YOU. *TR",
        "vin": "WVWHV71K78W"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "01/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276764,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 08 GTI HAS VERY STRANGE ACTIONS WHEN I AM DRIVING MY AUTOMATIC DSG TRANSMISSION. IT WILL EITHER LURCH FORWARD OR SLAM INTO GEARS. AT TIMES IT FEEL LIKE IT STALLS AS THE CAR SHAKES VIOLENTLY. I KNOW PEOPLE THAT HAVE CHANGED THEIR MECHATRONI UNITS AND FOUND IT'S JUST A CPU PROBLEM BUT WHEN I TAKE THIS TO THE DEALER THERE IS ISSUES WITH THEM STATING THEY CAN'T DUPLICATE THE PROBLEM. MY CAR HAS CAUSED ME TO GET INTO AN ACCIDENT IN WHICH SOMEBODY REAR ENDED ME BECAUSE MY CAR SLAMMED INTO 1ST GEAR AS I BRAKED. THIS SCARES ME VERY MUCH WHEN THE VEHICLES GEAR DOESN'T SEEM TO ALWAYS BE IN THE PROPER GEAR. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "07/03/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 VW GTI WITH THE DSG TRANSMISSION.  FOR THE LAST FEW DAYS IT HAS BEEN SURGING WHEN DRIVING AT LOW \"PARKING LOT\"  SPEEDS LESS THAN 10 MPH.  THE CAR ALSO SHIFTS VERY HARD FROM 3RD TO 2ND AND THEN TO 1ST GEAR, ESPECIALLY WHEN THE CAR IS WARMED UP AND THE AMBIENT TEMPERATURE IS HIGH, AROUND 90 DEGREES.  *TR",
        "vin": "WVWFV71K98W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276551,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHIFTS VERY ROUGHLY 100 PERCENT OF THE TIME.  WHEN I ACCELERATE FROM A DEAD STOP THE CAR HESITATES AND THEN JERKS INTO GEAR. SOMETIMES IT SLAMS INTO GEAR VERY HARSHLY WITH EVEN THE LIGHTEST PRESSURE ON THE PEDAL.  THIS HAS TAKEN ME BY SURPRISE ON SEVERAL OCCASIONS ALMOST CAUSING ME TO REAREND THE PERSON IN FRONT OF ME.  IT ALSO DOWNSHIFTS VERY STRANGELY...SOMETIMES SEARCHING FOR GEARS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2009",
        "dateOfIncident": "05/11/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276577,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY \"AUTOMATIC\" DSG (DIRECT SHIFT GATE) TRANSMISSION TO BE ACTING UP. FROM A STOP UP TO 15 MPH IN 1ST GEAR AND REVERSE THE TRANSMISSION FELT VERY LURCHY AND HAD LOTS OF SURGING ASSOCIATED WITH ACCELERATION. IT COULD BE SIMULATED IN A \"NORMAL\" CAR BY TAPPING THE ACCELERATOR WHEN STARTING TO DRIVE INSTEAD OF SMOOTHLY PRESSING IT. IT WAS ESPECIALLY NOTICEABLE WHEN THE CAR'S OPERATING TEMPERATURE WAS HOT. IE: THE HOTTER IT WAS THE WORSE THE SYMPTOMS ARE. IT OCCURS EVERY TIME I DRIVE THE CAR LONG ENOUGH TO HEAT THE CAR UP. IT'S DANGEROUS IN BUMPER TO BUMPER TRAFFIC BECAUSE SOMETIMES THE CAR DOESN'T GO, THEN I GIVE IT MORE GAS AND IT GOES TOO MUCH.  I AM AFRAID I WILL REAR-END ANOTHER CAR SOMEDAY. REVERSE GEAR IS EVEN WORSE. I HAVE TO BE VERY CAREFUL WHEN PARKING THAT I DO NOT SMASH INTO ANOTHER CAR.  THESE PROBLEMS ARE ALSO FOR SOME REASON AMPLIFIED WHEN ON ANY INCLINE.  THE SECOND ISSUE WITH THE TRANSMISSION IS THAT MAINLY WHEN THE OPERATING TEMPERATURE IS COLD THE CAR EXPERIENCES TROUBLE WHEN SHIFTING FROM 1ST TO 2ND GEAR.  NORMALLY UNDER HEAVY ACCELERATION, THE CAR CAN'T SEEM TO \"FIND\" 2ND GEAR. IT WILL SHIFT OUT OF 1ST GEAR AND \"HANG\" IN A NEUTRAL POSITION WHERE NO POWER IS AVAILABLE TO MOVE THE CAR FORWARD. APPROXIMATELY .5 - 1 SECONDS LATER, IT SHIFTS INTO SECOND GEAR.  I WOULD HATE TO BE TRYING TO AVOID A COLLISION AND HAVE NO POWER AVAILABLE IF NEEDED TO MOVE OUT OF THE WAY.  VOLKSWAGEN HAS TOLD ME THESE ISSUES ARE \"NORMAL\" AND THAT IT IS WORKING AS DESIGNED. I FIND THIS HARD TO BELIEVE SINCE THESE SYMPTOMS WERE NOT EVIDENT WHATSOEVER WHEN I PURCHASED THE CAR NEW 11 MONTHS AND 13 DAYS AGO.  AS VOLKSWAGEN REFUSES TO ACKNOWLEDGE A PROBLEM, I HOPE THE NHTSA CAN GRASP THEIR ATTENTION. *TR",
        "vin": "WVWFV71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2009",
        "dateOfIncident": "06/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276306,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 VW GTI EQUIPPED WITH THE DSG TRANSMISSION.  RECENTLY, I HAVE NOTICED PROBLEMS WITH THIS TRANSMISSION AND ITS DELIVERY OF POWER FROM THE ENGINE TO THE WHEELS OF MY CAR.      WHEN THE CAR IS WARMED UP, THE TRANSMISSION DOES NOT SMOOTHLY AND PREDICTABLY DELIVER POWER TO THE CAR'S WHEELS.  WHEN IN REVERSE, THE PROBLEM IS VERY NOTICEABLE.  IT SURGES AND STOPS CONSTANTLY WHILE BACKING UP, MAKING IT DIFFICULT TO CONTROL THE SPEED AT WHICH YOU ARE BACKING UP.  WHEN ACCELERATING FROM A COMPLETE STOP, THE CAR BUCKS AND SURGES FORWARD.  THIS IS NOT AS DANGEROUS AS WHEN IN REVERSE, BUT IT IS STILL VERY UNCOMFORTABLE.     THERE ARE SEVERAL INTERNET FORUMS THAT ARE SHARING INFORMATION AND EXPERIENCES ABOUT THIS TRANSMISSION AND ITS VARIOUS PROBLEMS.  TO DATE, VW DOES NOT ACKNOWLEDGE THAT THERE IS A WIDESPREAD PROBLEM WITH THIS TRANSMISSION.  I'M ADDING MY COMPLAINT TO THE OTHERS IN THE HOPES THAT SOMEONE WILL PUT PRESSURE ON VW TO ACKNOWLEDGE THAT THESE TRANSMISSIONS NEED TO BE SERIOUSLY LOOKED AT NATIONWIDE AND PERHAPS A RECALL STARTED IN ORDER TO FIX THE ISSUES WITH THESE TRANSMISSIONS.  THANK YOU FOR YOUR TIME AND UNDERSTANDING. *TR",
        "vin": "WVWHV71K18W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2009",
        "dateOfIncident": "05/10/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276153,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 20,000 MILES.  HAVE MAJOR ISSUE WITH DSG AUTOMATIC TRANS OCCASIONALLY GOING INTO NEUTRAL WHILE TRYING TO ACCELERATE AND LOW SPEED JERKINESS (LIKE THE TRANS DOESN'T KNOW WHETHER IT SHOULD BE IN NEUTRAL OR 1ST/REVERSE) AFTER AT LEAST 15 MIN OF DRIVING.  THE LOW SPEED JERKING ISSUE IS EASILY REPEATABLE BUT THE CAR NEEDS TO BE DRIVEN AT LEAST 15 MINUTES TO NOTICE IT.  THE TRANS GOING INTO NEUTRAL ISSUE IS HARD TO REPRODUCE AS IT CAN HAPPEN RANDOMLY WITH UP TO 3-4 WEEKS IN BETWEEN OCCURRENCES, BUT HAS HAPPENED AT LEAST 8 TIMES.  WHEN IT HAPPENS THE CAR ROLLS TO A STOP, USUALLY LIFTING OFF OF THE GAS PEDAL, GIVING IT A FEW SECONDS BEFORE GIVING IT GAS AGAIN SEEMS TO BE ENOUGH FOR IT TO GO INTO GEAR.  I'VE BEEN TO 2 DIFFERENT DEALERS.  ALMOST GOT HIT BY A GARBAGE TRUCK ON THE WAY TO THE FIRST DEALER, WHEN THE TRANS WENT INTO NEUTRAL WHILE MERGING ONTO A BUSY STREET.  LUCKILY IT WENT INTO GEAR JUST IN TIME.  1ST DEALER REPLACED A FUEL PRESSURE SENSOR WHICH FIXED A CHECK ENGINE LIGHT, BUT HAS NOT FIXED ANY OF THE ISSUES WITH THE TRANSMISSION.  2ND DEALER ADMITS IT'S THE TRANSMISSION, BUT SO FAR VW OF AMERICA HAS NOT APPROVED ANY PARTS REPLACEMENT. *TR",
        "vin": "WVWHV71K58W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275876,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LURCHING AND JERKINESS FROM DEAD STOP IN BOTH FORWARD AND REVERSE WITH A 2008 VW GTI.  THIS IS A CONTINUAL PROBLEM PARTICULARLY WHEN THE ENGINE IS WARM AND IN WARMER WEATHER.  NO ACCIDENTS HAVE BEEN CAUSED BY THE LURCHING, YET, BUT THE INABILITY TO PULL AWAY WHEN A LIGHT TURNS GREEN, AND THE INABILITY TO CONTROL THE ACCELERATION WHEN REVERSING IS LIKELY TO CAUSE AN ACCIDENT SOON.  THE GENERAL CONSENSUS ONLINE IS THAT THERE IS A KNOWN PROBLEM WITH SOME 2008 MECHATRONIC UNITS (ASSOCIATED WITH THIS CAR'S DSG TRANSMISSION), AND THAT REPLACEMENT SOLVES THE PROBLEM.  BUT VW HAS, SO FAR, REFUSED TO REPLACE MY MECHATRONIC UNIT, ISSUE A RECALL, OR IN ANY WAY RECTIFY THE SITUATION.  *TR",
        "vin": "WVWHV71KX8W"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/08/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264477,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DAILY USAGE FOR APPROXIMATELY A YEAR CAUSED MY VEHICLE'S SEATBELT TO NO LONGER LOCK IN. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2009",
        "dateOfIncident": "07/05/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262494,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 08 VW GTI 10/13/07. AFTER A FEW MONTHS, THE MANUAL 6 SPEED CLUTCH MADE A LOUD GRINDING NOISE WHEN SHIFTING FROM 1ST INTO 2ND GEAR. INITIALLY I TOOK IT IN 3 TIMES, THE TECH SAID THE CONDITION COULD NOT BE DUPLICATED. ON 7/5/08, AS I WAS ON MY WAY TO WORK, THE CLUTCH ACTION FELL LIMP AND SMOKE BELLOWED FROM THE ENGINE AREA. THE CAR WAS DOWN FOR A WEEK. THE CLUTCH DISC,PRESSURE PLATE,TRANS SEALS,BOLTS,FLYWHEEL AND RELEASE BEARING WERE REPLACED. HOWEVER, 2 MONTHS LATER THE ISSUE RETURNED BUT WAS WORSE. I TOOK THE CAR BACK TO THE DEALER ANOTHER 10 TIMES. I EVENTUALLY HAD TO TRADE THE CAR @ A HUGE LOSS. THERE IS A MANUFACTURER DEFECT WITH THIS TRANSMISSION. I CONTACTED VW HEADQUARTERS 2 MONTHS BEFORE I HAD TO SELL THE CAR, THEY WERE OF NO ASSISTANCE. *TR",
        "vin": "WVWEV71K78W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "12/26/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257385,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS FOR MY 2008 VOLKSWAGEN GTI MKV MUST HAVE SOME FORM OF A HOLE OR INSUFFICIENT SEALANT BECAUSE WHEN IT WAS COLD OUTSIDE ALLOT OF MOISTURE BUILT UP INSIDE THE HEADLIGHTS AND MADE MY VISIBILITY SO HARD TO SEE ON THE HIGHWAY I ALMOST RAN INTO 1 CAR AND WHILE I WAS EXITING AND GETTING ONTO THE SERVICE ROAD I WAS GOING TO MAKE A RIGHT TURN ONTO MY STREET WHEN I ALMOST HIT 2 PARKED CARS. MY FRIEND HAS ALSO BEEN HAVING THE SAME ISSUES WITH HIS CAR. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/29/2009",
        "dateOfIncident": "01/29/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10256878,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS INVOLVED IN FRONTAL CRASH, HITTING ANOTHER THAT WAS STOPPED IN THE ROAD.  CAR WAS GOING BETWEEN 20 AND 30 MPH.  AIRBAGS DID NOT DEPLOY CAUSING DRIVER TO HIT NOSE ON STEERING WHEEL.  NOT BROKEN BUT SEVERELY BRUISED. *TR",
        "vin": "WVWHV71K38W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2008",
        "dateOfIncident": "11/20/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249547,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM UNABLE TO REPLACE MY THIRD BRAKE LIGHT WITHOUT TAKING IT TO THE DEALERSHIP. I DRIVE A 2008 VW GTI. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2008",
        "dateOfIncident": "11/07/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248293,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN'T REPLACE THE 3RD BRAKE LIGHT BULBS ON MY 2008 VW GTI.  THERE IS NO WAY TO SERVICE THEM AND THE DEAL STATES THEY WOULD HAVE TO PHYSICALLY RIP OFF MY SPOILER TO DO SO.  *TR",
        "vin": "WVWED71K48W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/09/2008",
        "dateOfIncident": "11/08/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248069,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2008 VW GTI USES THE HEADLIGHTS AS RUNNING LIGHTS. WHEN THE CAR IS STARTED AND THE PARKING BRAKE IS RELEASED THE HEADLIGHTS TURN ON. THIS OCCURS REGARDLESS OF THE POSITION OF THE HEADLIGHT SWITCH. THIS CAUSES A HAZARD AS AT NIGHT THE DRIVER IS LIKELY TO START THE CAR AND PROCEED TO DRIVE. USUALLY ONE WOULD NOT PROCEED TO DRIVE WITHOUT TURNING THE LIGHTS ON HOWEVER THE HEADLIGHTS ARE TURNED ON AUTOMATICALLY. NOW YOU ARE DRIVING WITH HEADLIGHTS BUT NO TAILLIGHTS. THIS FEATURE IS CREATING A HAZARD AND SHOULD BE CHANGED. I INQUIRED AT THE DEALER AND THEY STATED 'THAT IS THE WAY IT IS DESIGNED TO WORK'. I HAVE NOT HAD AN ACCIDENT BECAUSE OF THIS DEFICIENCY. *TR",
        "vin": "WVWEV71K88W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/30/2008",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247222,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2008 VW GTI USES THE HEADLIGHTS AS RUNNING LIGHTS.  WHEN THE CAR IS STARTED AND THE PARKING BRAKE IS RELEASED THE HEADLIGHTS TURN ON.  THIS OCCURS REGARDLESS OF THE POSITION OF THE HEADLIGHT SWITCH.  THIS CAUSES A HAZARD AS AT NIGHT THE DRIVER IS LIKELY TO START THE CAR AND PROCEED TO DRIVE.  USUALLY ONE WOULD NOT PROCEED TO DRIVE WITHOUT TURNING THE LIGHTS ON HOWEVER THE HEADLIGHTS ARE TURNED ON AUTOMATICALLY.  NOW YOU ARE DRIVING WITH HEADLIGHTS BUT NO TAILLIGHTS.  THIS FEATURE IS CREATING A HAZARD AND SHOULD BE CHANGED.   I INQUIRED AT THE DEALER AND THEY STATED 'THAT IS THE WAY IT IS DESIGNED TO WORK'. I HAVE NOT HAD AN ACCIDENT BECAUSE OF THIS DEFICIENCY.  *TR",
        "vin": ""
    }
]