[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454606,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Sub frame cracking due to rust.",
        "vin": "Yv1ah852481"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436848,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The subframe is rotting prematurely and this issue is only present on the v8 equipped models. Cars in very good shape but the subframe is almost rotted totally through above the exhaust. Due to the poor layout of the exhaust which causes the paint on the welds to flake off and then the subframe begins to rust from the inside out.",
        "vin": "yv1ah852881"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424126,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The front windshield is leaking, such that the driver's side front and rear floors flood, even with a light rain.  Enough water comes in that the padding, carpet, floor mat and rubber floors mat are all under water.  When it rains, we see water droplets and water trails on the inside of the windshield.  The windshield is original and has never been replaced.  We've never had a car that leaked like this and don't expect that cars should turn into small swimming pools inside when it rains.",
        "vin": "YV1AS982681"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/19/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365977,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AND CLOSED SUNROOF SHATTERED. NO DEBRIS CAME FROM VEHICLES AHEAD. THE VEHICLES WERE MORE THAN 500 FEET AHEAD, AND I WAS LOOKING AHEAD ON THE HIGHWAY WHEN IT SHATTERED. CAUSE UNKNOWN.",
        "vin": "YV1AH992781"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099971,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING MY CAR I TRIED TO PUT ON MY SEAT BELT BUT IT WOULD NOT EXTEND OUT SO I COULD NOT PUT IT ON.  THIS HAPPENED LAST NIGHT AND THE PROBLEM STILL PERSISTS TODAY.",
        "vin": "YV1AS982181"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "01/13/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063128,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S80. WHILE FUELING THE VEHICLE, THE CONTACT NOTICED AN EXTREMELY STRONG ODOR OF FUEL EMITTING INTO THE VEHICLE. THE VEHICLE WAS NOT INSPECTED AND DIAGNOSED BY A DEALER. THE VEHICLE WAS TAKEN TO AN INSPECTION STATION AND PASSED THE INSPECTION, BUT THE MECHANIC ALSO INDICATED TO CHECK THE FUEL SYSTEM DUE TO A STRONG ODOR OF FUEL. THE INDEPENDENT MECHANIC ADVISED THAT THE VEHICLE BE SERVICED BY A DEALER. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE), BUT THE CONTACT DID NOT RECEIVE A NOTIFICATION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YV1TS92D531"
    },
    {
        "components": "SEAT BELTS,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062718,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING INTO A PARKING SPACE FROM THE LANE OF A PARKING LOT, WITH MY FOOT ON THE BRAKE, MY VOLVO S80 ACCELERATED SO POWERFULLY IT COULD BE HEARD YARDS AWAY. I APPLIED THE BRAKE HARDER BUT THE CAR WOULDN'T STOP AND SURGED OVER A WHEEL STOP, IT WAS STILL SURGING SO I STARTED PUMPING THE BRAKE, THE CAR FINALLY CRASHED INTO A PIPE BOLLARD BRINGING IT TO A STOP, THE CAR WOULDN'T TURN OFF, THE ELECTRICAL WAS GOING HAYWIRE AND I COULD NOT GET THE CAR INTO PARK TO REMOVE THE KEY. UPON IMPACT THE SEAT BELT DID NOT HOLD MY MOTHER INTO PLACE AND THE AIRBAGS DID NOT DEPLOY. I AM THE ORIGINAL OWNER OF THIS 2008 VOLVO S80 AWD WITH 58K MILES ON IT IN PRISTINE CONDITION. I HAVE HAD PROBLEMS IN THE PAST WITH THE COOLING FAN MODULE, ENGINE RUNNING HOT, THE SCU MODULE, MAP SENSOR, A FAULTY FUEL SENSOR, FAULTY SCHRAEDER VALVES, FAULTY ALTERNATOR AND VOLTAGE REGULATOR, FAULTY AC COMPRESSOR BUT NEVER A POWER SURGE TO THIS EXTREME.",
        "vin": "YV1AH852781"
    },
    {
        "components": "SEAT BELTS,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062721,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A PARKING SPACE FROM THE DRIVING LANE OF A PARKING LOT, MY VOLVO HAD A SURGE OF POWER THAT COULD NOT BE CONTROLLED/STOPPED BY APPLYING THE BRAKES. I WAS BARELY IN MOTION WITH MY FOOT ON THE BRAKE WHEN WE (MY MOTHER, SISTER, AND I) HEARD THE ENGINE ROAR AND THE CAR SURGED FORWARD. I APPLIED MORE PRESSURE TO THE BRAKE BUT THE CAR WOULD NOT STOP AND WENT OVER A WHEEL STOP SO I THEN STARTED PUMPING THE BRAKE. THE CAR FINALLY STOPPED MOVING ONCE IT HIT A PIPE BOLLARD BUT THE ENGINE WOULD NOT TURN OFF, MY ELECTRICAL WENT HAYWIRE AND I COULD NOT GET THE CAR IN PARK TO REMOVE THE KEY. UPON IMPACT THE PASSENGER SEAT BELT DID NOT HOLD MY MOTHER IN PLACE AND THE AIR BAGS DIDN'T DEPLOY. I AM THE ORIGINAL OWNER OF THIS CAR WHICH WAS IN PRISTINE CONDITION BUT NOW WRECKED. I HAVE ALL THE SERVICE RECORDS FOR THIS CAR AND HAVE HAD PROBLEMS IN THE PAST WITH THE FOLLOWING ITEMS; FAULTY COOLING FAN MODULE, ENGINE RUNNING HOT, FAULTY BATTERY CELL, FAULTY SCU MODULE, FAULTY STARTER, FAULTY MAP SENSOR, FAULTY OIL LEVEL SENSOR, FAULTY POWER STEERING RACK,FAULTY FUEL PRESSURE SENSOR, FAILING LAMP SOCKET, FAULTY SCHRAEDER VALVES, FAULTY ALTERNATOR AND VOLTAGE REGULATOR, AND A FAULTY AC COMPRESSOR.",
        "vin": "YV1AH852781"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018754,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  IN FEBRUARY 2017, WHILE IN MOTION ON A CITY STREET, ALTERNATOR FAILED, VEHICLE WAS TOWED TO DEALERSHIP, ALTERNATOR WAS REPLACED  2. IN AUGUST 2017, WHILE IN MOTION ON CITY STREET, MESSAGE DISPLAYED ALERTING ON ENGINE OVERHEAT -- SLOW DOWN SPEED - THEN STOP IMMEDIATELY. VEHICLE WAS TOWED TO DEALERSHIP. ON DIAGNOSTICS, WAS ESTABLISHED THAT ONLY ONE FAN WAS WORKING ON THE COOLING FAN ASSEMBLY CAUSING OVERHEAT.  3. WHILE AT DEALERSHIP FOR REPAIRS OF THE COOLING FAN, DIAGNOSTICS ESTABLISHED THE FOLLOWING:  - CODE ECM-PO19000: WAS RECOMMENDED TO REPLACE FUEL RAIL PRESSURE SENSOR FIRST (IF SAME CODE COMES BACK IN THE FUTURE, A FUEL PUMP REPLACEMENT WAS RECOMMENDED)  - TAG LIGHT BULBS REGULARLY GO OUT  - NEGATIVE BATTERY CABLE IS CORRODED; REPLACEMENT NEEDED  - POWER STEERING LINE LEAKING FROM RACK TO COOLER, REPLACEMENT NEEDED; RESERVOIR REPLACEMENT NEEDED -- HAS INTERNAL FILTER  - POWER STEERING FLUID IS WHITE-CONTAMINATED   - REPLACE NEEDED FOR THE FRONT STRUTS, MOUNTS, AND SUPPORT PLATES: STRUTS LEAKING",
        "vin": "YV1AS982X81"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995142,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF BLEW UP, OR SPONTANEOUSLY COMBUSTED. WAS NOT HIT BY AN OBJECT, LOUD SOUND WAS HEARD PRIOR TO THE INCIDENT.  CAR WAS IN MOTION AT THE TIME, GOING ABOUT 60MPH. CONDITIONS CLEAR, COOL TEMPERATURES NOT VERY HOT OR COLD OUTSIDE.",
        "vin": "YV1AH992481"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872983,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S80. WHILE DRIVING VARIOUS SPEEDS, THE SUN ROOF FRACTURED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,310.",
        "vin": "YV1AS982X81"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2015",
        "dateOfIncident": "08/13/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10748945,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT APPROX 3PM. MY 11 YEAR OLD SON WAS ALSO A PASSENGER IN THE VEHICLE. I WAS ON WIDE OPEN HIGHWAY - NO STORMS - NO VEHICLES ON THE HIGHWAY NEAR ME.  ALL OF A SUDDEN, THERE WAS A LOUD NOISE, SOUNDED LIKE A BOMB EXPLODED. I FELT SHARP PIECES OF GLASS AND SAW GLASS IN THE COMPARTMENT OF THE VEHICLE, LOOKED UP AND THE SUNROOF HAD SHATTERED.     I FIRST ATTEMPTED TO SLIDE THE GLASS ALL THE WAY BACK SO THAT THE GLASS WOULD NOT CONTINUE TO FALL AND CUT US. THEN I REALIZED THAT WAS NOT A GOOD IDEA SO I CLOSED THE SUNROOF BACK AND THE CLOSED THE CLOTH ROOF COVERING.     I HAD TO WAS ABLE TO DRIVE THE VEHICLE TO PICK MY DAUGHTER UP FROM HER LOCATION AND GET US HOME SAFELY. THE FOLLOWING DAY, I TOOK THE VEHICLE TO VOLVO TO SEE IF THIS WAS COVERED UNDER MY EXTENDED WARRANTY OR IF VOLVO WOULD PAY SINCE THEIR VEHICLE WAS DEFECTIVE.      THE SERVICE MANAGER OF VOLVO OF CHARLOTTE CALLED ME A LIAR - SAID THAT THIS WOULD NOT HAPPEN UNLESS SOMETHING HIT THE VEHICLE.  I EXPLAINED TO THIS GUY THAT NOTHING HIT THE VEH, I WAS ON WIDE OPEN ROAD - GOOD SUNNY WEATHER WITH NO VEHICLE IN SIGHT.  HE CONTINUED TO CALL ME A LIAR.  CALLED MY INSURANCE COMPANY TO REPORT THE CLAIM TO HAVE IT ON RECORD AND FOR POSSIBLE SUBROGATION RIGHTS .",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2014",
        "dateOfIncident": "07/11/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621542,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S80. THE CONTACT NOTICED THAT THE ENGINE COOLING SYSTEM WARNING INDICATOR ILLUMINATED AND THE AIR CONDITIONING PERFORMANCE REDUCED WHILE AT A TRAFFIC LIGHT. THE FAILURE OCCURRED MULTIPLE TIMES. THE CONTACT ALSO STATED THAT THE VEHICLE WOULD NOT START WHEN THE KEY WAS INSERTED INTO THE IGNITION. WHEN THE VEHICLE WAS TAKEN TO THE DEALER FOR AN OIL AND FILTER CHANGE, THE MECHANIC REPLACED THE FAN CONTROL MODULE ACCORDING TO NHTSA CAMPAIGN NUMBER: 09V218000 (ENGINE AND ENGINE COOLING). THE CONTACT WAS UNAWARE OF THIS RECALL PRIOR TO THE REPAIR BEING PERFORMED. THE FAILURES RECURRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.",
        "vin": "YV1AS982481"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614582,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S80.  THE CONTACT STATED THAT THERE WAS WATER LEAKING INTO THE VEHICLE FROM THE SUNROOF.  AS A RESULT, THERE WAS WATER DAMAGE TO THE FRONT AND REAR FLOORBOARDS AND MOLD WAS PRESENT.  THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 52,000.  ..UPDATED 08-25-14 *BF    THE CONSUMER STATED VOLVO ADVISED THEY WOULD NEED TO REMOVE THE INTERIOR TO FULLY CLEAN AND DRY IT. THIS WAS NOT COVERED BY WARRANTY. THE MANUFACTURER DENIED ANY ASSISTANCE.  UPDATED 09/2/2014   *JS",
        "vin": "YV1AS982081"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537976,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2008 VOLVO S80 HAS ALREADY HAD THE COOLING FAN CONTROL MODULE REPLACED THROUGH A RECALL.THE COOLING FAN STOPPED WORKING AGAIN CAUSING MY CAR TO OVERHEAT AND AIR CONDITIONER TO STOP WORKING. I CALLED CORPORATE AND THEY SAID THAT THEY ARE NOT RESPONSIBLE EVEN THOUGH IT IS THE SAME EXACT THING THAT WAS RECALLED (DUE TO THE RISK TO MOTOR VEHICLE SAFETY.) THEY CLAIM THAT ONCE THE RECALL REPAIR IS PERFORMED THE CAMPAIGN IS OFFICIALLY CLOSED.",
        "vin": "YV1AS982581"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2013",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511009,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S FUEL GAUGE HAS NEVER WORKED CORRECTLY.  WE HAVE TAKEN THE VEHICLE IN TO GET IT REPAIRED 4 TIMES IN THE PAST FIVE YEARS.  THE ISSUE HAS NOT BEEN FIXED.  I AM AFRAID THAT WITHOUT KNOWING THE CORRECT LEVEL OF FUEL IN THE TANK WE COULD GET IN AN ACCIDENT SHOULD THE CAR UNKNOWINGLY RUN OUT OF GAS ON A HIGHWAY.  I HAVE DONE SOME RESEARCH ON THE WEB AND THIS SEEMS TO BE A COMMON PROBLEM THAT VOLVO IS DISREGARDING EXCEPT IN SOME LIMITED CASES.  IT SEEMS TO BE AN ISSUE THAT COULD LEAD TO UNNECESSARY HIGHWAY DEATHS OR INJURIES IN A CAR GENERALLY ASSOCIATED WITH FAMILIES WITH SMALL CHILDREN LIKE OURS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2013",
        "dateOfIncident": "12/17/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498122,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT CLUSTER PANEL FAULTY, UNABLE TO DETECT VEHICLE SPEED, BLINKER OPERATION, GAS IN FUEL TANK REMAINING.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490382,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND DEFECTIVE REAR-VIEW MIRROR WITHIN ONE YEAR.  THIS COMPUTER AUTO-DARKENING MIRROR AGAIN HAS PERMANENT BLACK LINES AFFECTING VIEWING AND THE DEALER AND VOLVO COMPANY CLAIM THE WARRANTY IS 3 MONTHS.  EVENING USE IS UNSAFE DUE TO THE INABILITY OF THE MIRROR TO REFLECT TRAFFIC.  INSTEAD, SAFETY IS COMPROMISED.  THE DEALER AND VOLVO CORPORATION REFUSE TO ACKNOWLEDGE THIS IS AN EQUIPMENT DEFECT AND THEY TRULY SHOULD KNOW THAT SUCH EQUIPMENT OUGHT TO LAST THE LIFETIME OF THE CAR.  IT IS AN EQUIPMENT MALFUNCTION AND DEFECT AND  IS A SAFETY ISSUE BECAUSE THE VIEWING CANNOT BE ACCURATE AND CLEARLY REFLECTED.  HELP.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/07/2012",
        "dateOfIncident": "08/25/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474236,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S80. THE CONTACT STATED THAT THE WINDSHIELD WIPER ACTIVATED INDEPENDENTLY BEFORE FAILING COMPLETELY. THE DEALER INSPECTED THE VEHICLE AND RECOMMENDED REPLACING AND REPROGRAMMING THE BATTERY. THE BATTERY WAS REPLACED BUT WAS NOT REPROGRAMMED. THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 09V139000 (ELECTRICAL SYSTEM: SOFTWARE) THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 59,185 AND THE CURRENT MILEAGE WAS 59,203...UPDATED 10/19/12 *BF UPDATED 10/25/2012 *JS",
        "vin": "YV1AS982681"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/06/2012",
        "dateOfIncident": "03/06/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450535,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM VACUUM PUMP FAILED, FOUND LEAKING ENGINE OIL INTO THE PUMP HOUSING.  *TR",
        "vin": "YV1AH992981"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370714,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE CHECK SIGNAL COMES ON VERY OFTEN - SEVERAL COMPLAINTS TO DEALER OVER THE LAST TWO YEARS - ALWAYS TOLD THAT'S IT MY PROBLEM.  CHECKING YOUR WEBSITE IT APPEARS TO BE A RECALL BY THE FACTORY ON THEIR OWN - INCORRECT.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "06/20/2009",
        "dateOfIncident": "06/18/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274401,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 18 2009 I WAS DRIVING THE CAR AND ALL THE SUDDEN THE CAR JUST DIED COMPLETELY.  NO ACCIDENT OCCURRED AS I WAS DRIVING IN MY SUBDIVISION AND THERE WERE NO CARS AROUND ME.  I COULD IMAGINE THERE MIGHT WELL BE A SERIOUS ACCIDENT INVOLVED IF I WAS DRIVING ON A BUSY STREET OR ON THE HIGHWAY.       IN ADDITION TO THIS INSTANCE, ON MAY 11, 2009, I EXPERIENCED A SUDDEN ACCELERATION OF THE VEHICLE WHILE I WAS PARKING THE CAR.  THE CAR ACCELERATED SO MUCH AS IF I WAS PRESSING THE GAS PEDAL DOWN TO THE FLOOR.  THE CAR THEN HIT THE LAMP POLE IN FRONT OF THE PARKING SPOT.  THE IMPACT WAS SO STRONG WHICH DEPLOYED THE AIR BAG AND CAUSED A HUGE DAMAGE TO THE CAR.  I REPORTED THE ACCIDENT TO THE DEALER AND ALSO TO VOLVO PRODUCT INVESTIGATION DEPARTMENT.  A FIELD TECHNICAL SPECIALIST WAS SENT OUT TO CHECK THE CAR AND I WAS TOLD THAT THERE WAS NO SINGLE PROBLEM FOUND WITH THE VEHICLE.  THE CASE WAS THEN DISMISSED.      I AM 100% CONVINCED THAT THERE IS A SERIOUS SAFETY ISSUE WITH THIS VEHICLE AND I AM VERY CONCERNED/SCARED FOR MY LIFE AND FOR THE PUBLIC SAFETY.  I COULD NOT TAKE THE RISK OF INJURING/KILLING MYSELF OR OTHERS.  I HAVE NOT BEEN ABLE TO GET THE DEALER OR THE VOLVO PRODUCT DEPARTMENT TO TAKE MY CASES SERIOUSLY.  PLEASE PLEASE HELP. *TR",
        "vin": "YV1AH992681"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2008",
        "dateOfIncident": "01/11/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10219980,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO S80 WAS STRUCK ON PASSENGER DOOR.  THERE WAS NO ONE SEATED IN THE PASSENGER SEAT.  PASSENGER SIDE AIR BAG DEPLOYED.  DRIVER'S SIDE AIR BAG DID NOT DEPLOY.  WHEN CAR WAS HIT, DRIVER'S HEAD HIT DRIVER SIDE WINDOW.   *TR",
        "vin": ""
    }
]