[
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/03/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428519,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "After buying the vehicle on 7/9/21, the car started having problems with the cooling system. I took it to a repair shop and they said the cooling system was overfilled. The air problem continued. I took it back to the dealership who said they fixed it but it continued. I contacted the prior Manufactuer service center who informed me the computer chip was recommended to be replaced when the dealer had it serviced but they declined, causing all the electrical and cooling issues. I called the dealer and they said they had the alarm disconnected also which was why the computer system wasn't working. The alarm system doesn't work and I have had to replace the key fob 3 times. I took it to another repair shop who diagnosed the following as permanent failure codes: 6 CEM codes, 1 ECM code, 6 SRS codes, 2 DIM codes, 11 CEM-HS codes, passenger and driver door codes, 4 climate control codes, 1EPS code, 4 SWM codes, DD11, all of which are safety hazards.",
        "vin": "Yv1ms382282"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310426,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40. THE CONTACT STATED THAT AFTER EXITING A STORE AND ENTERING THE VEHICLE, THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE CONTACT STATED THAT THERE WERE SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED. THE CONTACT STATED THAT A MESSAGE DISPLAYED ON THE INSTRUMENT PANEL STATED TO TURN THE STEERING WHEEL AND TRY AGAIN. THE VEHICLE WAS FIRST TOWED TO THE RESIDENCE AND THEN TO AUTOBAHN VOLVO FORT WORTH (2910 WHITE SETTLEMENT RD, FORT WORTH, TX 76107) WHERE THE VEHICLE WAS DIAGNOSED WITH A STEERING COLUMN LOCK MODULE FAILURE AND AN BATTERY FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "YV1MS382282"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118496,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40. WHILE DRIVING 60 MPH, THE VEHICLE OVERHEATED AND STALLED. IN ADDITION, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 191,000.",
        "vin": "YV1MS390282"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958042,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR PUMP HAS A FAULTY SWITCH, STARTED RINGING WHEN I TURN THE ENGINE OFF.  THE MECHANIC SAYS THE SWITCH ISN'T SHUTTING OFF CORRECTLY.",
        "vin": "OYV1MS38248"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918442,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "EXTREMECONTACT DWS",
                "productYear": "9999",
                "size": "205/50R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40 EQUIPPED WITH CONTINENTAL EXTREMECONTACT DWS TIRES, SIZE: 205/50/17 (NA). WHILE DRIVING APPROXIMATELY 35 MPH, THE FRONT PASSENGER SIDE TIRE EXPERIENCED A SIDEWALL BLOW OUT AFTER DRIVING OVER GRAVEL IN THE ROAD. DURING THE INCIDENT, THE VEHICLE SUSTAINED DAMAGE TO THE SUSPENSION, BUMPER, AND ROCKER PANEL. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DOT NUMBER, VEHICLE FAILURE MILEAGE, AND VIN WERE NOT AVAILABLE. THE TIRE FAILURE MILEAGE WAS 12,000.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2015",
        "dateOfIncident": "09/05/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761857,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 S40, CAR WAS PLACED IN PARK AND TURNED OFF WHILE RUNNING ERRANDS, NO PROBLEMS. CAME OUT OF THE STORE AND PLACED THE KEY INTO THE IGNITION AND RECEIVED THIS ERROR MESSAGE, \"TURN STEERING, TRY START AGAIN.\"  PRIOR TO THIS, THE CAR WAS COMPLETELY OPERABLE. REMOVED THE KEY AND INSERTED KEY INTO THE IGNITION AGAIN AND NOTHING HAPPENED. I NOTICED THE FOLLOWING: WHEN THE KEY IS TURNED TO 1 AND 2, ALL DASH LIGHT AND HEADLIGHTS COME ON. AT THREE, THE HEADLIGHTS GO OFF, THE ARM REST BUTTONS GO OFF AND ONLY CHECK ENGINE STAYS ON. ONCE THE KEY IS RELEASED, ALL INDICATORS AND HEADLIGHTS COME BACK ON. OBD SHOWS NO CODES. TURNED THE WHEEL ALL THE WAY LEFT AND RIGHT, MESSAGE PERSISTS. THIS HAS NEVER HAPPENED BEFORE AND I HAD A MINOR CHILD WITH ME IN THE SCORCHING HEAT. HAD THE CAR TOWED AND SURPRISINGLY THE INDIVIDUAL TOWING THE CAR WAS A MECHANIC FOR YEARS AND STATED THE WHEEL WAS NOT LOCKED AT ALL, AFTER MOVING THE STEERING WHEEL TO THE LEFT AND RIGHT AS WELL. THIS RAISES SOME SERIOUS SAFETY CONCERNS, AS THERE WERE NO PRIOR WARNINGS AND THE WHEEL WAS NEVER LOCKED AND THANKFULLY I WAS NOT NOT IN MOTION.",
        "vin": ""
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746988,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GETTING IN MY CAR WITH MY TWO YOUNG CHILDREN AND THE CAR WOULD NOT START (TURN STEERING WHEEL AND TRY TO START AGAIN).  I TRIED MULTIPLE TIMES, BUT IT WOULD NOT START.  AFTER 15 MINUTES, I DECIDED IT WAS TOO HOT WITH MY CHILDREN OUTSIDE SO I WENT INSIDE.  I CHECKED AN HOUR LATER, THE CAR WOULD NOT START.  MY HUSBAND WAS ABLE TO START THE CAR HOURS LATER AFTER MOVING THE STEERING COLUMN UP AND DOWN QUICKLY AND HARSHLY.  THIS MORNING, I WAS GETTING IN THE CAR WITH MY TWO YOUNG CHILDREN, THE CAR WOULD NOT START (TURN STEERING WHEEL AND TRY TO START AGAIN).  I MOVED THE STEERING COLUMN AS SUGGESTED BY MY HUSBAND, THE CAR WOULD NOT START.        LUCKILY WE WERE HOME AND WERE NOT STRANDED ON THE SIDE OF THE ROAD WITH TWO YOUNG CHILDREN IN THE HEAT OF SUMMER.",
        "vin": ""
    },
    {
        "components": "VISIBILITY,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "10/29/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743995,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40. THE CONTACT STATED THAT THE SUN ROOF WAS LEAKING WATER INTO THE VEHICLE. THE VEHICLE WAS INVOLVED IN A FRONT END COLLISION WHILE DRIVING 25 MPH. THE AIR BAGS DID NOT DEPLOY. THERE WAS A WARNING INDICATOR ILLUMINATED. THE DEALER STATED THAT WATER MAY HAVE STOPPED THE AIR BAGS FROM DEPLOYING. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 73,000.",
        "vin": "YV1MS382782"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743990,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40. THE CONTACT STATED THAT THE OIL TRAP AND VENTILATION HOSE WERE DAMAGED. THE CONTACT STATED THAT THE CHECK ENGINE WARNING INDICATOR ILLUMINATED, THE VEHICLE MADE AN ABNORMAL NOISE, AND THERE WAS AN OIL LEAK IN THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND IT WAS CONFIRMED THE FAILURE WAS IN THE OIL TRAP AND VENTILATION HOSE IN THE ENGINE THAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THERE WAS A TECHNICAL SERVICE BULLETIN RTJ-19745 (ENGINE AND ENGINE COOLING), WHICH EXTENDED THE WARRANTY FOR AFFECTED VEHICLES; HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 77,800.",
        "vin": "YV1MS382782"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678956,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A MAIN ROUTE AT NIGHT AROUND 730 AND A CAR WAS TRYING TO GET IN MY LINE AND I ASSUME THEY DID NOT SEE ME. I TRIED TO MOVE TO THE LEFT TO GET OUT OF THE WAY BUT  MY STEERING WHEEL WAS SO TIGHT I COULD NOT VEER AWAY FROM THE CURB. DUE TO THIS I HAVE NUMEROUS REPAIRS THAT NEED TO BE PAID AND MY POWER STEERING WAS TIGHT FOR SEVERAL WEEKS, IT WAS ALMOST HARD FOR A STRONG MAN TO TURN THE WHEEL. I TRIED POWER STEERING FLUID WHEN I STARTED TO NOTICE THE PROBLEM AND IT DID NOT HELP.  *TR",
        "vin": "YV1MS390582"
    },
    {
        "components": "SUSPENSION,AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10649024,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 VOLVO S40 STOPPED IN TRAFFIC WHEN I WAS IN MAJOR/SEVERE REAR END COLLISION. THE FORCE OF THE IMPACT (70+ MPH) PUSHED ME INTO A VEHICLE AHEAD WHICH CAUSED SEVERE FRONTAL DAMAGE THAT WENT ALL THE WAY PAST MY RADIATOR. PROPERTY DAMAGES OVER $17K AND AIRBAGS FAILED TO DEPLOY RESULTING IN INJURIES. *TR",
        "vin": "YV1MS382482"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/20/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605931,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SERPENTINE BELT BROKE ON 6/6/2014 AND WAS REPLACED.  ON 6/20/2014 I WAS DRIVING ABOUT 60MPH ON THE INTERSTATE IN CHICAGO, IL WHEN MY VEHICLE STOPPED ACCELERATING AND EVENTUALLY STOPPED.  THIS NEARLY CAUSED AN ACCIDENT ON THE INTERSTATE, BUT I WAS ABLE TO PULL TO THE LEFT SHOULDER BEFORE BEING STRUCK.  I HAD TO HAVE THE VEHICLE TOWED TO A SHOP WHERE IT WAS DETERMINED THAT WHEN THE SERPENTINE BELT BROKE, SHARDS OF THAT BELT WENT IN TO THE TIMING BELT AREA.  THIS IS DUE TO A FLAWED DESIGN ON MY MAKE OF VOLVO.  THE TIMING COVER IS NOT SEALED, ALLOWING PARTICLES TO ENTER THIS AREA CAUSING SEVERE DAMAGE AND NEARLY CAUSING AN ACCIDENT.  I HAVE 20 BENT VALVES THAT NOW NEED TO BE REPLACED DUE TO THIS DESIGN FLAW.  THERE IS NO TECHNICIAN SERVICE BULLETIN THAT WOULD HAVE NOTIFIED MECHANICS TO BE AWARE OF THIS POTENTIAL PROBLEM WHEN A SERPENTINE BELT BREAKS, SO MY MECHANIC WOULD NOT HAVE KNOWN TO LOOK FOR THIS, WHICH WOULD HAVE PREVENTED THE ALMOST $3,000 WORTH OF DAMAGE.  THIS CAUSED MY CAR TO COMPLETELY SHUT DOWN IN THE MIDDLE OF TRAFFIC, WHICH COULD HAVE RESULTED IN NOT ONLY MY DEATH, BUT POTENTIALLY OTHER FATALITIES. I HAVE REQUESTED VOLVO CORRECT WHAT HAS OCCURRED DUE TO THEIR DESIGN FLAW, AND LACK OF PUBLIC NOTIFICATION BUT THEY HAVE NOT AGREED TO DO SO.  THIS IS A KNOWN CONCERN AT THE LOCAL VOLVO DEALERSHIP LEVEL, AS MY MECHANIC CONTACTED A LOCAL VOLVO DEALERSHIP IN ORLAND PARK, IL AND WAS ADVISED BY THE MECHANIC THAT THEY ARE SEEING THIS ISSUE ON NOT ONLY MY MODEL, BUT OTHER VOLVO MODELS AS WELL.  THIS PROBLEM, IF IT IS NOT KNOWN TO MECHANICS, CAN AND DID CAUSE A COMPLETE LOSS OF POWER IN THE VEHICLE.  THIS INCREASES THE RISK OF A CRASH OR POTENTIAL FATALITY.  AS YOU CAN TELL, I HAVE FEW MILES ON MY VEHICLE FOR IT BEING 6 YEARS OLD, SO THERE IS NO REASON FOR HAVING TO REPLACE 20 VALVES IN THE ENGINE, OTHER THAN DUE TO THE DESIGN FLAW. THANK YOU SO MUCH FOR YOUR TIME.  *TR",
        "vin": "YV1MS390282"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2013",
        "dateOfIncident": "03/28/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505181,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY I SET CRUISE CONTROL TO 65. WITHIN SECONDS I FELT AS IF I WERE GOING VERY FAST AND I HAD ACCELERATED TO NEAR 90 MPH. I TURNED CRUISE CONTROL OFF, STEPPED ON THE BRAKE AND WHEN I LET OFF THE BRAKE THE CAR BEGAN TO ACCELERATE AGAIN. AFTER THE SECOND TIME STEPPING ON THE BRAKE THE PROBLEM CEASED. THE SAME TYPE OF INCIDENT OCCURRED AGAIN, ONLY THIS TIME CRUISE CONTROL WAS NOT INVOLVED. STOPPED AT A RED LIGHT, I STEPPED ON THE ACCELERATOR TO MAKE A RIGHT HAND TURN, THE RPMS IMMEDIATELY JUMPED AND MY CAR ACCELERATED VERY QUICKLY. I STEPPED ON THE BRAKE AND AFTER A FEW SECONDS THE ISSUE RESOLVED ITSELF.  *TR",
        "vin": "YV1MS390082"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/03/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373946,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 VOLVO S40. THE CONTACT STATED WHILE DRIVING 40 MPH DURING A SNOW STORM, THE WINDSHIELD WIPERS FAILED IMPAIRING THE CONTACTS VIEW OF THE ROADWAY. THE CONTACT WAS ABLE TO MOVE OFF THE ROADWAY AND THE VEHICLE WAS LEFT UNTIL THE SNOW STOPPED. THE VEHICLE WAS LATER TAKEN TO THE DEALER AND THE DEALER NOTICED THAT THE WIPER ARM HAD FRACTURED. FOUR WEEKS LATER WHILE THE CONTACT WAS DRIVING IN SNOWY WEATHER, THE FAILURE RECURRED. THE CONTACT TOOK THE VEHICLE TO ANOTHER DEALER AND THE DEALER STATED THAT THE WIPER MOTOR FAILED. THE CONTACT DID NOT HAVE THE WIPER MOTOR REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS UNSAFE TO DRIVE IN BAD WEATHER. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "YV1MS382182"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10313793,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 VOLVO S40. SHE STATED THAT WHILE DRIVING 2 MPH AND PARKING THE VEHICLE WITH HER FOOT ON THE BRAKE PEDAL, THE VEHICLE ACCELERATED ON ITS OWN AND CRASHED INTO A STORE WINDOW. THERE WERE FRONTAL DAMAGES TO THE VEHICLE. SHE SUFFERED CHEST INJURIES. A POLICE REPORT IS AVAILABLE. THE VEHICLE WAS TOWED TO THE DEALER AND THEY ARE WAITING FOR THE DIAGNOSTIC TEST RESULTS. THERE HAVE BEEN NO REPAIRS DONE TO THE VEHICLE. THE FAILURE AND CURRENT MILEAGE WERE 10000.",
        "vin": "YV1MS390082"
    }
]