[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2011",
        "dateOfIncident": "12/04/2010",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398869,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 WEEKEND WARRIOR TRAILER, WAS MANUFACTURED AFTER THE CLASS ACTION LAWSUIT AGAINST WEEKEND WARRIOR AND LIPPERT INC. TRAILER WAS DESIGNED AND MANUFACTURED BY LIPPERT INC. WITH A STRUCTURAL DEFICIENCY OUTLINED IN THE ORIGINAL CLASS ACTION LAWSUIT. MY TRAILER WALLS ARE DROPPING AND INTERIOR WALLS BUCKLING DUE TO THE ABSENCE OF ADEQUATE SUPPORT ON THE OUTER PORTION OF THE CHASSIS / FRAME REFERRED TO AS OUTRIGGERS. THIS ISSUE IS A VERY DANGEROUS ISSUE, AND COULD RESULT IN THE TRAILER BREAKING APART WHILE TOWING ON THE HIGHWAY, DEATHS ETC...I NOTICED THE WALLS WERE DROPPING AFTER MY LAST TRIP IN THE TRAILER WHILE VACATIONING. I TOOK THE TRAILER IN TO HAVE IT LOOKED AT AND THE PROBLEM WAS CONFIRMED BY AN RV REPAIR FACILITY. COST TO REPAIR THE ISSUE IS $2,000.00. I'M VERY CONCERNED FOR MY FAMILIES SAFETY AS WELL AS OTHERS WHILE TOWING THIS TRAILER. I CANNOT BELIEVE THAT THE DEALER SOLD ME THIS TRAILER WITHOUT INFORMING ME OF THE PRIOR CHASSIS / FRAME ISSUES, AND THAT LIPPERT INC. CONTINUED TO MANUFACTURE CHASSIS / FRAMES FOR THIS COMPANY THAT WERE STRUCTURALLY DEFICIENT, EVEN AFTER THE CLASS ACTION LAWSUIT TIME FRAME. LIPPERT INC. HAS FAILED TO RESPOND TO MY COMPLAINT VIA THE NEW MOTOR VEHICLE BOARD HERE IN CALIFORNIA.  *TR",
        "vin": "5HRFF23238C"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/26/2010",
        "dateOfIncident": "11/24/2010",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367891,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC FAILURE OF SUSPENSION COMPONENTS RELATED TO CHASSIS MANUFACTURE.  *TR",
        "vin": "5HRSS40378C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2010",
        "dateOfIncident": "06/26/2010",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340218,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTE: THIS COMPLAINT IS ABOUT THE WEEKEND WARRIOR FS2500 MODEL, BUT THAT WAS NOT A CHOICE ON YOUR DROP-DOWN MENU. THE BEDS IN OUR CAMPER ARE ELECTRIC -- YOU PUSH A BUTTON AND THEY RAISE UP TO THE CEILING TO MAKE SPACE BELOW DURING THE DAY. MY 14 YEAR OLD DAUGHTER AND 7 YR OLD SON WERE IN THE LOWER BUNK BED, AND THE BED STARTING RAISING UP UNEXPECTEDLY -- NOBODY PUSHED THE BUTTON OR WAS NEAR THE BUTTON. MY DAUGHTER ROLLED OFF, BUT MY SON WAS ASLEEP. EVEN WITH 3 ADULTS (NEARLY 400 LBS TOTAL) PULLING ON THE BED, IT KEPT GOING UP, WITH MY SON IN IT. WE PUSHED THE BUTTON TO MAKE IT STOP OR COME DOWN, BUT IT KEPT RAISING UP. MY SON WAS PUSHED UP AGAINST THE BOTTOM OF THE TOP BUNK AND WE WERE ABLE TO SQUEEZE BETWEEN THE BACK DOOR AND THE BUNK TO PULL HIM OUT BY HIS ARM. HIS SCREAMS WERE MUFFLED AND HE FELT AS IF HE WAS BEING SUFFOCATED. THE COMPANY HAS GONE OUT OF BUSINESS. I AM ALSO REPORTING THIS TO NHTSA EVEN THOUGH IT'S NOT A VEHICLE THAT YOU DRIVE, IT'S A 5TH WHEEL CAMPER. PHOTOS OF THE MODEL'S BEDS AT HTTP://WWW.A1WARRIORTRAILERS.COM/09PHOTO-WIDEFEATURES.HTM. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/31/2009",
        "dateOfIncident": "09/21/2008",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272451,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "109S MEDALIST TRAIL A/P",
                "productModel": "P255/70R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE WERE DRIVING DOWN THE INTERSTATE AND THE TIRE ON THE PASSENGERS SIDE RIGHT FRONT BLEW. THIS TIRE HAD LESS THAN 2000 MILES ON IT. IT DID CAUSE APPROX. 2500.00 WORTH OF DAMAGE TO OUR TRAILER. WE REPORTED THE TIRE FAILURE TO GLOBAL DIRECT COMPONENTS WHO IS THE TIRE DISTRIBUTOR. THEY DID SENT US A REPLACEMENT TIRE BUT OF THE SAME BRAND. THEY ARE ALSO IN LITIGATION WITH OUR INSURANCE COMPANY FOR RECOVERY OF THE TRAILER REPAIRS.    THEN ON 4-19-09 AS WE WERE AGAIN DRIVING HOME WE HAD 2 MORE OF THE SAME BRAND OF TIRES GO BAD AND THESE TIRES HAVE THEN LESS 2300 MILES ON THEM. WE DID CATCH THEM BEFORE THEY BLEW BUT BOTH OF THESE TIRES HAVE A VERY LARGE BULGES IN THEM.. WE HAVE NOT HAD THEM REPLACED BY THE MANUFACTURER, BECAUSE THE MANUFACTURER OF COURSE WANTS TO SEND US MORE OF THE SAME TIRES OF WHICH WE REALLY DON'T WANT CONSIDERING THE TURN OF EVENTS ABOVE.    WE HAVE ALSO SINCE THIS LAST INCIDENT CALLED THEM TO FIND OUT ABOUT HOW TO GET REPLACEMENT TIRES BUT OF A DIFFERENT BRAND. THEY STATED BECAUSE THESE TIRES WITH THE NUMBERS OF 3107 AND 2507 HAVE NOT BEEN REPORTED AS DEFECTIVE THEY WOULD NOT REPLACE THEM WITH ANYTHING DIFFERENT.     GLOBAL DIRECT COMPONENTS  4519 INNOVATION DR  RIVERSIDE, CA  92518  800-282-2801  THE BRAND OF TIRE IS TRAIL AMERICA.    THESE TIRES ARE NOT LISTED IN YOUR DROP DOWN SECTION. *TR",
        "vin": "5LZBF30288R"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2008",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231043,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 WEEKEND WARRIOR 5TH WHEEL TRAILER LED3505 WHICH I PURCHASED NEW.  I CHOSE MOST OPTIONS AVAILABLE AND ON ARRIVAL THE TRAILER WAS 13 FOOT 10 INCHES HIGH WHICH IS OVER LEGAL ROAD HEIGHT.  I HAVE TRIED TO WORK WITH THE DEALER AND WW BUT THEY HAVE REFUSED TO CORRECT THE PROBLEM.  THIS PROBLEM HAS BEEN ADDRESSED ON WWW.RV.NET WITH SEVERAL OWNERS OF THE SAME MODEL.  IT CAN BE CORRECTED BY INSTALLING A LOW PROFILE AC UNIT TO MAKE THE UNIT CONFORM WITH THE 13 FOOT 6 INCH HIGH LIMIT.  *TR",
        "vin": "5HRSS35398C"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "03/04/2008",
        "fire": false,
        "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222904,
        "products": [
            {
                "manufacturer": "WEEKEND WARRIOR TRAILERS INC.",
                "productMake": "WEEKEND WARRIOR",
                "productModel": "LED 3505",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 WEEKEND WARRIOR 5TH WHEEL TRAILER MODEL LED3505 IN DECEMBER 2007.  WHILE TOWING THE VEHICLE ON THE HIGHWAY THE METAL ENTRANCE STAIRS LEADING INTO THE COACH, WHICH NORMALLY STOW UNDER THE TRAILER WHILE BEING TOWED, NOW UNFOLD EXTENDING 2.5FT BEYOND THE SIDE OF THE TRAILER INTO SECONDARY TRAFFIC LANES DUE TO A FAILURE OF THE SELF LOCKING DESIGN.  BECAUSE THE TRAILER IS ALREADY AT A MAXIMUM ALLOWED 102 INCHES WIDE, THIS CAUSES A 30 INCH METAL STRUCTURE TO TRAVERSE INTO OTHER TRAFFIC LANES CAUSING VEHICLES ALONG SIDE OF THIS TRAILER TO TAKE CORRECTIVE ACTIONS IF POSSIBLE TO AVOID BEING HIT OR DAMAGED.  THE DEALERSHIP \"GIANT RV OF CORONA CALIFORNIA\" HAS ASKED THE MANUFACTURE WEEKEND WARRIOR TRAILERS INC. OF PERRIS CALIFORNIA TO CORRECT THIS ISSUE AS PART OF THE WARRANTY PROGRAM.  WEEKEND WARRIOR TRAILERS INC OF PERRIS CALIFORNIA HAS REFUSED AFTER BEING ASKED BY THE DEALERSHIP AND OWNER OF THE TRAILER 3 CONSECUTIVE TIMES.  THE MANUFACTURE STATES \"STAIRS ARE INSTALLED AS DESIGNED\" REQUEST TO CORRECT DENIED.  THIS DESIGN IS DANGEROUS AND FOR THE MANUFACTURE TO CLAIM THAT THIS POSES NOT THREAT OR POSSIBLE THREAT TO LIFE OR PROPERTY IS NOT ACCEPTABLE.  *TR",
        "vin": "5HRSS35328C"
    }
]