[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380509,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 WINNEBAGO ON A 2008 W22 WORKHORSE CHASSIS HAS 26838 MILES, REQUIRED REPLACEMENT OF THE FRONT ROTORS AND ALL OF THE BRAKE PADS. ROTORS WERE ACTUALLY CRACKED BUT NOT BURNED REQUIRING REPLACEMENT *TGW  THE CONSUMER STATED THE CALIPERS SEIZED. ALSO, SEVERAL BRAKE REPAIR TECHNICIANS STATED THE PROBLEM WAS NOT DUE TO NORMAL FAILURE, BUT MORE LIKELY DUE TO THE DEFECTIVE CALIPERS. THE CONSUMER STATED THE FRONT SEALS, ROTORS, FRONT AND REAR PADS AND SEAL OIL CAP WERE REPLACED. *JB  UPDATED 03/10/11. *JB",
        "vin": "5B4MP67G683"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/26/2010",
        "dateOfIncident": "07/13/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345348,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 WORKHORSE W22 CHASSIS. THE CONTACT STATED WHILE EXITING A PARKING LOT AT LOW SPEEDS, THE BRAKES WERE DEPRESSED AND THE PEDAL FELL INTO THE FLOORBOARD. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THEY ADVISED THAT THE HYDRAULIC FLUID HAD OVERHEATED AND LEAKED OUT OF THE VEHICLE. THE DEALER ALSO ADVISED THAT IT WOULD TAKE APPROXIMATELY FIVE DAYS BEFORE THE PARTS NEEDED TO REPAIR THE VEHICLE WOULD ARRIVE. INSTEAD, THE REPAIRS WERE PERFORMED WITH THE SAME DEFECTIVE PARTS THAT WERE INITIALLY ON THE VEHICLE. THE DEALER ADVISED THAT THE NEW CALIPERS WERE NOT YET AVAILABLE TO INSTALL ON THE VEHICLE. THE CONTACT STATED HE WOULD NO LONGER OPERATE THE VEHICLE UNTIL REPAIRS WERE COMPLETED DUE TO THE NATURE OF THE FAILURE. THE CONTACT DID NOT FEEL SAFE DRIVING THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000. THE CURRENT MILEAGE WAS APPROXIMATELY 11,000.",
        "vin": "5B4MP67G973"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341171,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HOLIDAY RAMBLER 34'.   CONSUMER STATES PROBLEM WITH 2008 W22 WORKHORSE GAS TANK *TGW  THE CONSUMER STATED THE CHASSIS HAS A 75 GALLON GAS TANK AND IT WAS DESIGNED TO BE USED AS A LEFT OR RIGHT FILL.  SINCE HIS IS A LEFT FILL, THE MANUFACTURER CAPPED THE RIGHT SIDE. THE CONSUMER STATED THE CAP BEGAN TO LEAK. WORKHORSE PAID TO HAVE THE HOSE REPLACED. THE CONSUMER BELIEVED THE HOSE MATERIAL WAS NEVER MEANT TO BE USED FOR GASOLINE. *JB",
        "vin": "5B4MP67G083"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/17/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330755,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2008 WORKHORSE W22 CHASSIS MOTOR HOME. WHILE DRIVING AT 30 MPH, THE CONTACT ENGAGED THE BRAKES AND BUT THEY WOULD NOT RELEASE. HE HAD TO COAST TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALERSHIP. THE VEHICLE WAS NOT REPAIRED AT THE TIME THE COMPLAINT WAS FILED. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 15,800.",
        "vin": "5B4MP67G383"
    }
]