[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163896,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "XV1900",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THIS 2008 YAMAHA STRATOLINER 1900CC MOTORCYCLE IT IS A KNOWN ISSUE WITH THE 3RD GEAR FAILURE.  ACCORDING TO MECHANICS AND RESEARCH ONLINE I HAVE FOUND IT TO BE A COMMON ISSUE.  IT WAS RECALLED IN 2007 ON OTHER YAMAHA MOTORCYCLES THAT USED THE SAME ENGINE/TRANSMISSION.  3RD PUSH ROD NOT BEING PROPERLY HEAT TREATED ARE SOME OF THE DIAGNOSES FOUND ONLINE.  STATING THAT THIS FEAR FAILURE IN THE TRANSMISSION COULD POSSIBLY CAUSE IT TO \"LOCK UP\" PREVENTING REAR WHEN FROM FREELY ROLLING WHICH COULD PRESENT A SAFETY ISSUE.  AS IT APPEARS IN MY RESEARCH FOR THE PAST 12 MONTHS IT IS A KNOWN ISSUE BUT NO RECALL WAS ISSUED BY YAMAHA.  THE MOTORCYCLE WAS DISCONTINUED AND IS NO LONGER IN PRODUCTION AND TO MY BELIEF IS DUE TO THE FAULTY PRODUCTION AND FAILURE OF 3RD GEAR.  THE STRATOLINER AND RAIDER BOTH USING THE 1900CC MOTOR AND OTHER MODELS USING THIS SAME TRANSMISSION HAVE THE SAME COMMON ISSUE.  ISSUE OCCURS ANY TIME MOTORCYCLE IS IN MOTION AND UTILIZING THE 3RD GEAR OF THIS MANUAL TRANSMISSION.  THE DEFECT CAUSES A WHINE AND A KNOCK/TICK SOUND. DOES NOT MATTER THE SPEED OR CONDITIONS OF TRAVEL, SIMPLY, ANY TIME IN 3RD GEAR AND IN MOTION.  AT THIS TIME AND ACCORDING TO MY RESEARCH IT DOES NOT EFFECT THE OTHER TRANSMISSION GEARS UNTIL THE GEAR COMPLETELY FAILS (WHICH COULD CAUSE INJURY TO THE RIDER AND FURTHER DAMAGE TO MOTORCYCLE.) ONCE PURCHASED AND THIS PROBLEM PRESENTS ITSELF IT IS NOT SAFE TO SELL TO OTHER CONSUMERS AND TRADE IN VALUE IS NON EXISTENT DUE TO SAFETY AND MECHANICAL DEFECTS.",
        "vin": "JYAVP22E88A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099184,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "XV1900",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 YAMAHA XV1900. WHILE RIDING 2 MPH, THE MOTORCYCLE STALLED. THE NON PERFORMANCE WARNING INDICATOR ILLUMINATED PRIOR TO THE FAILURE. IN ADDITION, THE CONTACT STATED THAT THE FUEL PUMP CASING WAS CRACKED. THE MOTORCYCLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 34,000.",
        "vin": "JYAVP27E28A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2017",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960255,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "XV1900",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED WHILE RIDING DOWN THE STREET A KNOCKING NOISE COMING FROM TRANSMISSION ONLY WHEN I WAS IN 3RD GEAR.THE SOUND CONTINUED AS I RODE AND STEADILY WORSENED . NOW I HAVE BEEN SKIPPING THE USE OF3RD GEAR WHEN I RIDE BECAUSE I AM SCARED THAT IT WILL LOCK UP AND CAUSE ME TO HAVE AN ACCIDENT. AFTER RESEARCHING THIS NOISE ON THE INTERNET I FOUND THAT THEIR ARE MANY PEOPLE OUT THEIR THAT HAVE THE SAME ISSUE. CONSUMERS STATE THAT IT IS CAUSED BY 3RD GEAR BEING WEAK AND ONE OR MORE OF THE TEETH ON THE GEAR BREAK OFF. IT ALSO MENTIONS HOW YAMAHA HAS SINCE CHANGE THE MANUFACTURER OF THIS SAME GEAR THAT HAS FAILED IN THE SAME XV1900 ENGINES USED IN 2006,2007, AND 2008 VARIOUS MODELS OF YAMAHA. I CALLED YAMAHA HEAD QUARTERS TO SEE IF THEY WOULD HELP AND THEY DENIED KNOWING OF THE ISSUE OR HELP IN ANY WAY WITH THE COST OF THE REPAIR. NOW I HAVE A $14,000 DOLLAR PIECE OF SCRAP MEDAL, BECAUSE I CAN NOT AFFORD TO HAVE IT REPAIRED SINCE IT WOULD MEET A COMPLETE REMOVAL AND TEAR DOWN OF THE ENGINE. I DO NOT FEEL SAFE RIDING MY YAMAHA RAIDER ANY MORE...",
        "vin": "JYAVP27E68A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894985,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "XV1900",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD TO REPLACE THE FUEL PUMP ASSEMBLY DUE TO A CRACK IN THE PLASTIC BODY ALLOWING THE ESCAPE OF PRESSURIZED FUEL BACK INTO THE AUXILIARY FUEL TANK RESULTING IN A TENDENCY FOR THE ENGINE TO STALL WHEN COMING TO A STOP. THIS TENDS TO HAPPEN ON BUSY CITY STREETS, AT STOP SIGNS AND RED LIGHTS, AND IN STOP AND GO TRAFFIC ON THE HIGHWAY.",
        "vin": "JYAVP21E58A"
    }
]