[
    {
        "components": "POWER TRAIN,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2022",
        "dateOfIncident": "08/19/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456529,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I had purchased the car back in August 17th 2021 my power steering my brakes my airbag light and the fuel system fuel leak started happening all at once water was draining out of the middle of the engine . It overheating the engine speed ball down and I automatically I instantly pulled over and turned it off and towed it home 2 days after I bought it. these are also recalls my Audi 2009-a3 2.0 tfsi s tronic has been sitting in my friends driveway for 7 months now because I cannot take the car anywhere I cannot move the car anywhere I cannot start the car and I don't know what else to do so I do need your help I should be eligible it says my VIN number matches the eligible subject vehicle my VIN number is in your system but my car is not showing up it shows up but it's not showing up as a recall or included in the class action settlement if you have any questions please call me [XXX] at [XXX] if you have any input thank you. I do love my Audi I love it very much the day I got to drive it and the only day I got to drive it I was very happy I thought with it until I get it fixed I will not be happy again  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WAUHE78P09A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437903,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DSG transmission will abruptly shift down to first gear and would not respond in any other gear. The shift indicator in the dashboard will light up and blink and the check engine light will come on. There are no warnings before this happens and it will happen at random times. It has happen in separate occasions while traveling at different speeds. When this happens while traveling it creates a dramatic reduction on vehicle speed almost causing the vehicle traveling behind me to rear end me. Once stopped the car will only engage when put on D and will stay at a low gear causing the RPMs to red line even at low speeds making it unsafe to drive due to only being able to reach 5 to 10 MPH. A scan was performed and codes P1814 Press. Ctrl. Valve 1 Open circuit/short implausible signal, and, P1835 Press. Ctrl. Valve 5 Short circuit to B+. This fault is random and there is no warning or indication of when it may happen making the vehicle unsafe at any speed.",
        "vin": "wauhf98p19a"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389974,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS OF A TEMPERATURE SENSOR IN THE DSG MAY HAVE CONNECTOR WIRES THAT WERE INSUFFICIENTLY CRIMPED BY THE CONNECTOR SUPPLIER DURING A LIMITED PRODUCTION PERIOD. WITH INSUFFICIENTLY CRIMPED CONNECTOR WIRES, A TEMPERATURE SENSOR HAS THE POTENTIAL TO FALSELY DETECT A HIGH GEARBOX OIL TEMPERATURE, CAUSING THE CLUTCH TO OPEN AND CAN CAUSE THE DRIVER TO PERCEIVE THAT THE TRANSMISSION HAS SHIFTED INTO NEUTRAL. IF THIS HAPPENS, THE SELECTOR LEVER POSITION INDICATOR WITHIN THE INSTRUMENT PANEL WILL FLASH. IN ADDITION, THE DEPRESS BRAKE PEDAL INDICATOR LIGHT WILL BE ILLUMINATED, ALERTING THE DRIVER TO APPLY THE BRAKES. IN HEAVY TRAFFIC, THIS COULD LEAD TO A CRASH WITHOUT WARNING.",
        "vin": "WAUKF78PX9A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "01/08/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322035,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR IN 2010 WITH AROUND 10,000 MILES ON IT. A FEW MONTHS AFTER PURCHASING, CHECK ENGINE LIGHT WOULD ILLUMINATE, VEHICLE WOULD HAVE A NOTICEABLE DECREASE IN POWER AND NOT ACCELERATE OVER ABOUT 40MPH. SOMETIMES AFTER SHUTTING CAR OFF AND RESTARTING PROBLEM WOULD GO AWAY, OTHER TIMES IT WOULD NOT. VEHICLE TAKEN TO AUDI DEALERSHIP CAR PURCHASED FROM FOR REPAIR AND INITIALLY REPORTED AS SENSOR PROBLEM AND REPAIRED. COUPLE WEEKS AFTER REPAIR CAR WOULD HAVE SAME PROBLEM, SO TAKEN BACK TO DEALERSHIP AND AGAIN REPAIRED SENSOR(S). WITHIN ABOUT THE FIRST YEAR AFTER PURCHASING, ISSUE HAPPENED MULTIPLE (+/-5)  TIMES AFTER DEALERSHIP 'REPAIRED' WHAT THEY THOUGHT WAS THE PROBLEM AT THE PARTICULAR TIME. AFTER ABOUT 5/6 TIMES OF THIS HAPPENING DEALERSHIP TOOK A MORE IN DEPTH ATTEMPT AT FIGURING OUT WHAT PROBLEM REALLY WAS, TELLING ME THEY WERE WORKING DIRECTLY WITH AUDI & THEIR MECHANICS TO FIND AND FIX THE ACTUAL DEFECT. CAR WAS IN SHOP FOR AROUND 3 MONTHS FOR THIS REPAIR, WHICH THEY DETERMINED WAS ELECTRICAL AND DECIDED TO REWIRE THE ENTIRE CAR. IN THE MEANTIME, I MOVED OUT OF STATE TO START GRADUATE SCHOOL. I FINALLY GOT IT BACK A FEW MONTHS LATER AFTER HAVING TO PAY TO SHIP IT TO ME AND FOR A RENTAL WHILE WAITING. WITHIN A FEW MONTHS, CAR ONCE AGAIN HAD SAME EXACT PROBLEM. TOOK TO NEW LOCAL DEALERSHIP WHO ALSO DIAGNOSED ISSUE AS SENSOR(S) & 'REPAIRED' THEM. CONTINUED TO HAVE SAME PROBLEM EVERY FEW WEEKS, WOULD TAKE INTO DEALER FOR REPAIR, GET IT BACK, HAVE PROBLEM, TAKE TO DEALERSHIP, ETC. DEALERSHIP WOULD NOT ADDRESS CAR OVERALL BEING DEFECTIVE, THEY'D AVOID CONTACT, NOT RETURN CALLS, HANGUP ETC. CAR EVENTUALLY TRADED IN FOR NEW MAKE WHEN WARRANTY EXPIRED.",
        "vin": "WAUKF78P19A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300553,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 30 MINUTES INTO THE HIGHWAY, THE VEHICLE DECIDED TO SHIFT INTO NEUTRAL WHILE THE VEHICLE WAS IN \"D\" DRIVE AND IN MOTION. THE \"PRNDS\" STARTED FLASHING ON MY DASH, WHILE NOT LETTING ME ACCELERATE GOING 65MPH. I HAD TO QUICKLY SLOWDOWN, AND PULL OVER TO THE EMERGENCY LANE. THE VEHICLE SEEMS TO HAVE GONE INTO \"LIMP MODE\". AFTER TURNING OFF THE VEHICLE AND TURNING IT BACK ON, IT DROVE JUST FINE. THIS HAPPENED ONCE MORE 2 DAYS AGO. SEEMS LIKE IT COULD BE THE TRANSMISSION CONTROL UNIT, HOWEVER DEALER CANT DETERMINE THE FAULT WITHOUT A CODE. SCARED TO DRIVE THE VEHICLE NOW.",
        "vin": "WAUHE78PX9A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245552,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI / VW HAD A CLASS ACTION LAWSUIT ON THIS CARS TIMING CHAIN AND TIMING CHAIN TENSIONER.   THE EXTENDED WARRANTY HAS EXPIRED.   MINE BROKE AT 95000 MILES.  SO I'M SURE THERE ARE OTHER AUDI OWNERS THAT DON'T EVEN KNOW THIS HAPPENED.  THIS IS COSTING ME OVER 1000$.   AND SHOULD OF BEEN A FULL RECALL,  NOT THIS OTHER BS.  IT IS LEAVING US HIGH AND DRY.   I HOPE YOU CAN DO SOMETHING ABOUT THIS.   THANKS",
        "vin": "WAUKF78P39A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244641,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION GOES INTO NEUTRAL WHILE AT HIGHWAY SPEEDS. ENGINE RPMS JUMP TO REDLINE WHILE CAR IS IN NEUTRAL, THEN GOES BACK INTO GEAR. HAS HAPPEN SEVERAL TIMES WHILE ON THE HIGHWAY. TRANSMISSION ALSO KICKS DOWN TO LOWEST GEAR WHEN COMING AT STOP, JERKING THE CAR WHILE BRAKING.",
        "vin": "WAUHE78P29A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204416,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT STATED THAT THE ABS AND STABILITY CONTROL FAILED TO FUNCTION PROPERLY AND MADE THE VEHICLE UNSTABLE TO DRIVE. BELL AUDI (782 US-1, EDISON, NJ 08817, (732) 388-2800) AND THE MANUFACTURER INDICATED THAT THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 16V913000 (SERVICE BRAKES, HYDRAULIC, ELECTRONIC STABILITY CONTROL); ALTHOUGH, THE VEHICLE EXHIBITED THE SAME FAILURE AS THE RECALL CAMPAIGN. THE DEALER DIAGNOSED THAT THE ABS CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED; HOWEVER, A SYSTEM ISSUE OCCURRED WITH THE SOFTWARE UPDATE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 109,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203091,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKING SYSTEM SOFTWARE UPDATE DID NOT FIX BRAKES. RECALL SHOWS IF BRAKE MODULE IS BAD IT WOULD REPLACE. HOWEVER, THEY ONLY UPDATED THE SOFTWARE AND CLAIMED THE MODULE IS NOT INVOLVED IN THE RECALL. I DO NOT HAVE ABS BRAKES THAT ARE FUNCTIONAL.",
        "vin": "WAUKF78P49A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165283,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN RECEIVING NOTICES OF THE TAKATA AIRBAG RECALL REGULARLY FOR ALMOST A YEAR.  SEVERAL MONTHS AGO, I ASKED TO BE NOTIFIED WHEN PARTS WERE AVAILABLE.  HAVING NOT HEARD BACK FROM THE DEALER (BUT STILL RECEIVING NOTICES, THE LATEST ONE TODAY), I PLACED AN ORDER FOR THE PARTS IN MID-NOVEMBER 2018.  STILL HAVE NOT HEARD BACK FROM THE DEALERSHIP.",
        "vin": "WAUKF78P09A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142459,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME ISSUE AS THE VW TIGUAN. FUSE F16 IN THE FUSE BOX IN THE ENGINE BAY. VW ISSUED A RECALL.",
        "vin": "WAUKF78P79A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141864,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE LOCAL DEALER (GURLEY LEEP MOTORWERKS, 4004 GRAPE RD, MISHAWAKA, IN 46545, (574) 254-7130) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE AND TO CALL BACK AT A LATER DATE. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUHF98P59A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140033,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUDI GREENWICH AT (203) 930-7176 (LOCATED AT 181 WEST PUTNAM AVE, GREENWICH, CT 06830) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED, BUT DID NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUHE78P99A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091266,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN DRIVE AND STARTING TO ACCELERATE IN A TRAFFIC LIGHT THE TRANSMISSION GOT STUCK IN A GEAR WHILE MAKING A TURN. PRDNS LIGHTS STARTED FLASHING AND SUDDENLY WHEN IN TO NEUTRAL. IT HAS HAPPEN SEVERAL TIMES NOW WHERE I GO FROM PARKING TO REVERSE AND THEN DRIVE. ALL PRDNS START FLASHING AND CAR DOES NOT RESPOND TO ANY GEAR.",
        "vin": "WAUHE78P69A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11080419,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2009 AUDI A3. WHILE DRIVING ON A HILL, THE VEHICLE COULD NOT BE STOPPED DUE TO BLACK ICE. AS A RESULT, THE VEHICLE WAS INVOLVED IN A FRONT END COLLISION WITH A TELEPHONE POLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED DESTROYED. AUDI FAIRFIELD (435 COMMERCE DR, FAIRFIELD, CT) WAS CONTACTED, BUT DID NOT COMMUNICATE WITH THE CONTACT IN REGARDS TO THE FAILURE. THE CONTACT ALSO STATED THAT THERE WAS AN INTERIM REPAIR FOR THE TAKATA RECALL FOUR MONTHS PRIOR TO THE CRASH. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THERE WAS ONE INJURY THAT REQUIRED MEDICAL ATTENTION. THE CONTACT SUFFERED MILD BRUISING FROM CONTACTING THE STEERING COLUMN. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000. *TT NEITHER AUDI OR TAKATA ACKNOWLEDGES THE AIRBAG RECALL FIX AS BEING INADEQUATE. *TT",
        "vin": "WAUKF78P89A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065501,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    WE WERE NOTIFIED BY MAIL OF THE TAKATA RECALL FOR OUR AUDI MODEL. WE HAD SCHEDULED AN APPOINTMENT WITH AUDI OAKLAND DEALERSHIP REGARDING THE RECALL. ON OUR WAY TO THE DEALERSHIP, THE CAR SUDDENLY STOPS WORKING. WE GET THE CAR TOWED OVER TO THE DEALERSHIP, TO OUR SCHEDULED APPOINTMENT AS WELL AS HOPING TO SEE WHAT THE ISSUE IS WITH THE CAR. THEY ALLEGEDLY CLAIM THAT THE ENGINE NEEDED REPLACING EVEN THOUGH THEY NEVER PERFORMED AN OBD ON THE CAR. WITH THAT, THEY REFUSED TO TAKE CARE OF THE RECALL, EVEN THOUGH THAT WAS WHAT OUR SCHEDULED APPOINTMENT WAS FOR TO BEGIN WITH.",
        "vin": "WAHUE78P29A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/22/2017",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010070,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCORDING TO THE PUBLICATION I FOUND HTTPS://STATIC.NHTSA.GOV/ODI/RCL/2016/RCLRPT-16V913-3524.PDF MY CAR VIN IS LISTED AS PART OF A RECALL FOR THE ABS CONTROL MODULE.  I WAS INVOLVED IN AN ACCIDENT 18 MONTHS AGO WHERE THIS EXACT PROBLEM OCCURRED.  THE CAR IN FRONT OF ME WAS CUT OFF AND SLAMMED ON HIS BRAKES.  I HAD TO BRAKE QUICKLY AND WAS NOT ABLE TO CONTROL THE CAR.  BOTH MY ABS AND  ESC WARNING LIGHTS CAME ON.  I DID NOT THINK ABOUT ANY MECHANICAL PROBLEM UNTIL I READ ABOUT THE RECALL.  NOW AUDI HAS INFORMED ME THAT MY CAR IS NOT PART OF THE RECALL.  I HAVE NOT BEEN ABLE TO GET ANY INFORMATION HOW THIS WAS DETERMINED.  AS THIS IS A SAFETY CONCERN I NEED TO KNOW WHY MY CAR IS NOT PART OF THE RECALL.",
        "vin": "WAUHE78P09A"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985106,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. WHILE DRIVING 35 MPH, THE ABS AND ESC INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ABS MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "WAUKF78P89A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984609,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I AM OVERSEES AND PRIOR TO SHIPMENT I INFORMED AUDI USA OF ROCHESTER MICHIGAN OF THIS INCIDENT AND THEY WERE UNABLE TO PROVIDE ME ANY SUPPORT/ REPLACEMENT ETC. AUDI IN GERMANY ( GARMISSCH/ GRAINAU). SINCE IT IS A US SPEC VEHICLE WONT HELP ME EITHER. NOW I AM LOOKING INTO MOVING BACK TO THE USA AND NEW GUIDELINES CAME OUT IF MY VEHICLE HAS ANY RECALLS ( SEVERE) I WONT BE ABLE TO SEND IT. I NEED FOR SOMEONE TO LOOK AT THIS AND HAVE AUDI GERMANY REPLACE THE AIRBAG.",
        "vin": "WAUHF98P89A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981123,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUKF78P89A"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960277,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBERS: 16V913000 (SERVICE BRAKES, HYDRAULIC, ELECTRONIC STABILITY CONTROL) AND 16V079000 (AIR BAGS). THE PARTS TO DO THE RECALL REPAIRS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUKF78P89A"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956170,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE AIR BAG INDICATOR REMAINED ILLUMINATED AND THE ABS MALFUNCTIONED WITHOUT WARNING. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUHE78P19A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954264,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 05/10/17*LJ  UPDATED 05/18/2016 *JS",
        "vin": "WAUHE78P99A"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10948798,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2009 AUDI A3. THE CONTACT STATED THAT WHILE DRIVING AT 25 MPH, THE ABS AND THE ESC WARNING LIGHTS FLICKERED. AS A RESULT, THE BRAKE PEDAL AND ACCELERATOR PEDAL FAILED TO ENGAGE AND CAUSED THE CONTACT TO CRASH INTO A TREE. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED A MILD CONCUSSION AND BODY BRUISING THAT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V913000 (SERVICE BRAKES, HYDRAULIC, ELECTRONIC STABILITY CONTROL). THE FAILURE MILEAGE WAS 87,000.",
        "vin": "WAUKF78P39A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934451,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AND AUDI INFORMED ME ONE YEAR AGO BUT NO RESPONSE FROM AUDI DEALERSHIP FOR REPLACEMENT.",
        "vin": "WAUHE78P99A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/26/2016",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928066,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I RECEIVED MY RECALL NOTICE IN FEBRUARY AND HAVE NOT HEARD ANYTHING FURTHER FROM NHTSA OR AUDI. WHEN WILL THERE BE A SOLUTION TO THIS?    MY WIFE RECEIVED A CALL FROM OUR AUDI DEALER YESTERDAY DURING WHICH THEY SAID THAT THE DEFECT COULD NOT BE REPAIRED. I CAN'T BELIEVE THAT THIS IS THE CASE. DOESN'T AUDI HAVE TO REPLACE THE DEFECTIVE COMPONENT? I HAVE NO INTEREST IN PURCHASING A NEW CAR WITHOUT SIGNIFICANT  COMPENSATION FOR ITS COST.",
        "vin": "WAUHE78P39A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS UNAVAILABLE.",
        "vin": "WAUKF78P79A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919239,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG RECALL FOR DRIVERSIDE   NO REMEDY YET!!!",
        "vin": "WAUHE78P09A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919152,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN LOW GEARS, EVERY ACTION (DECELERATION AND ACCELERATION) ARE EXTREMELY \"JERKY\". WHEN COMING TO A STOP AUDIBLE \"CLUNK\"S CAN BE HEARD FROM THE ENGINE AREA, AND WHEN ATTEMPTING TO FULLY STOP THE CAR JERKS FORWARD INTO FIRST GEAR. THE REVERSE AND DRIVE GEARS ON THE AUTOMATIC TRANSMISSION SOMETIMES PARTIALLY ENGAGE, OR DO NOT FULLY ENGAGE AT ALL. ON HILLS, THE TRANSMISSION HAS THESE ISSUES AS WELL.",
        "vin": "WAUHE78P59A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898662,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG IS ON THE RECALL LIST!! WHY WON'T AUDI REPLACE MY AIR BAG NOW FOR FREE BEFORE IT KILLS ME OR MY HUSBAND?",
        "vin": "WAUHE78P39A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897786,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS CONTROL MODULE HAS FAILED AND I'VE READ THIS IS AN ONGOING ISSUE WITH ALL 2009 MODELS FROM AUDI TO VOLKSWAGEN TSI ENGINE MODELS.  THE VEHICLE HAD ABS STEERING AND BRAKE LIGHTS COME ON WITHIN THE CLUSTER.  WHEN BRAKING THE BRAKES LOCKED UP CAUSING ME TO LOSE CONTROL. THANKFULLY I WAS NOT GOING FAST IT DIDN'T CRASH INTO ANYTHING.",
        "vin": "WAUHE78PX9A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2016",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI OF AMERICA IS SAYING THAT THE NHTSA IS SAYING THAT I SHOULD CONTINUE TO DRIVE THE VEHICLE    HERE IS THE LANGUAGE FROM AN EMAIL I RECEIVED TODAY FROM AUDI OF AMERICA        \"THE NATIONAL HIGHWAY TRAFFIC AND SAFETY ADMINISTRATION (NHTSA) HAS ENCOURAGED CUSTOMERS TO BRING THEIR VEHICLES IN FOR SERVICE AS SOON AS THEY ARE NOTIFIED THAT PARTS ARE AVAILABLE AND FURTHER INDICATED THAT CUSTOMERS SHOULD CONTINUE TO DRIVE THEIR VEHICLES UNTIL THEN.\"    THEY DON'T HAVE A LOANER PROGRAM AND THE DEALERSHIPS ARE NOT PROVIDING LOANERS.    THEY DONT HAVE A DATE FOR REPAIR.    THEY ARE SAYING THAT NHTSA IS SAYING ITS OK TO DRIVE THE VEHICLES.",
        "vin": "WAUHE78P39A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "04/22/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883338,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUKF78P39A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883347,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WAUHE78P19A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUDI A3 SPORTBACK 1.4 TFSI ATTRACTION 2009. WHILE DRIVING OR WHEN THE CAR IS STATIONARY THE SELECTOR LEVER POSITION INDICATOR WITHIN THE INSTRUMENT PANEL IS FLASHING. WHEN THIS HAPPENS THE CAR MAY NOT MOVE AND  THE DEPRESS BRAKE PEDAL INDICATOR LIGHT  ILLUMINATES. I APPLY THE BRAKES AND NOTHING HAPPENED. I HAVE TO TURN OFF THE CAR AND TURN ON AGAIN. THIS PROBLEM HAPPENS ALL THE TIME WHILE I AM DRIVING, WHEN THE CAR IS STATIONARY, WHEN I JUST START THE CAR. ITS UNSAFE TO DRIVE THE CAR LIKE THAT BECAUSE I HAD THIS HAPPENED WHILE I'M DRIVING IN A HIGH WAY. THE SELECTOR LEVER POSITION INDICATOR WITHIN THE INSTRUMENT PANEL START TO FLASHING AND THE CAR WAS LOOSING POWER, AS IT DID NOT ACCELERATE ANY MORE. I STOPPED AND TURN OFF THE CAR.THEN I START IT AGAIN. THE INDICATOR PRNDS STILL FLASHING BUT THE CAR SOMETIMES MOVES.  I AM NOT SURE BUT THIS IS A PROBLEM WITH THE 7 SPEED DSG AUTOMATIC GEARBOX. WHAT CAUSING THE PROBLEM MIGHT BE A TEMPERATURE SENSOR.  I WILL SELECT RANDOM STATE, ZIP CODE AND TELEPHONE NUMBER, BECAUSE COUNTRY IS NOT LISTED THERE. MY ADDRESS IS [XXX].  ZIP CODE: 2049 MOBILE NUMBER :[XXX]  EMAIL: [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUZZZ8P2AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864021,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. NO REPAIRS UNTIL 2017. DRIVING UNSAFE WITH DEFECTIVE AIRBAG AKA IED. UNACCEPTABLE",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863180,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. RECEIVED MANUFACTURER SAFETY RECALL NOTICE. PARTS NOT YET AVAILABLE NO INFORMATION WHEN RECALL PARTS WILL BE AVAILABLE. NOW DRIVING UNSAFE VEHICLE WITH NO RECOURSE.",
        "vin": "WAUKF78P09A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/24/2015",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816187,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ALL POWER TO THE ENGINE JUST SUDDENLY TURNS OFF WITHOUT WARNING.  IT HAS HAPPENED A FEW TIMES WHILE ON THE FREEWAY AND ALMOST CAUSED AN ACCIDENT, AS A COUPLE SEMIS KEPT ME FROM PULLING OFF THE ROAD BEFORE LOSING SIGNIFICANT SPEED THAT CAUSE MERGING TO BE VERY DIFFICULT.  UPON TRYING TO RESTART, ONE TIME THE CAR RESTARTED FINE WHILE ANOTHER IT TOOK NUMEROUS TRIES WITH A ESP FAULT ERROR RESULTING, THEN IT SUDDENLY WORKED FINE AGAIN, UNTIL IT HAPPENED ANOTHER TIME.",
        "vin": "WAUHF98P29A"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/07/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619508,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING INTO A SMALL LOT TO PARK. FOOT ON BRAKE AND  MOVING AT AT LOW SPEED CAME TO STOP AND AUTO SUDDENLY STARTED TO SPEED AND SOUNDED LIKE THE CAR WAS IN NEUTRAL. AUTO JUMPED A SMALL CURB AND WENT INTO SOME BUSHES. IN PAST WHEN DRIVING AUTO SHIFTED TO SPORT GEAR WITHOUT WARNING AND SLOWED DOWN. DEALER CHECKED AND COULD NOT FIND A PROBLEM SIMILAR RECALL WITH 2009 A3 BUT NOT MY VIN.  *TR",
        "vin": "WAUHE78P79A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "04/03/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT GO INTO GEAR, TRANSMISSION FROZE UP. ALL THE GEAR LIGHTS WERE FLASHING PRND. HAD TO HAVE IT TOWED TO DEALER. THEY STATED THAT THE MEGATRONIC TRANSMISSION MODULE HAD TO BE REPLACED AND THE PART NEEDED TO COME FROM EUROPE.   *JS",
        "vin": "WAUHE78P79A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553855,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEM. MECHATRONIC CONTROLLER HAS GONE BAD. INTERMITTENT PROBLEM. DSG WILL NOT ENGAGE TO GO INTO REVERSE. TRANSMISSION ACTS AS IF IT IS IN NEUTRAL. WHEN PLACED IN PARK, IF AUTO IS ON AN INCLINE OF ANY SORT, THE VEHICLE WILL AND HAS ROLLED FORWARD APPROXIMATELY 10 INCHES. THE CONCERN IS THAT IF THE CAR WILL NOT GO INTO REVERSE ON COMMAND, THE OCCUPANTS MAY NOT BE ABLE TO GET OUT OF THE WAY AN ONCOMING MASS.  *TR",
        "vin": "WAUKF78P09A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519534,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 AUDI A3. THE CONTACT STATED THAT THE REAR DIFFERENTIAL FAILED WHILE TRAVELING 60 MPH. THE FAILURE FELT AS IF THE BRAKES HAD ENGAGED INDEPENDENTLY. THE VEHICLE WAS STILL ABLE TO BE DRIVEN, BUT THE VEHICLE RAN WOULD DRIVE ROUGHLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DETERMINED THAT THE REAR DIFFERENTIAL NEEDED TO BE REPLACED. THE FAILURE AND THE CURRENT MILEAGE WAS 75,000.   *TR",
        "vin": "WAUKF78P59A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/23/2009",
        "dateOfIncident": "11/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293287,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 2009 AUDI A3 2.0T WITH AN AUTOMATIC TRANSMISSION.  AFTER ABOUT 20-30 MINUTES OF DRIVING THE CARE THE TRANSMISSION STARTS EXHIBITING STRANGE BEHAVIOR.  AFTER COMING TO A FULL STOP THE CAR LURCHES FORWARD AFTER LETTING THE FOOT OFF THE BRAKE.  IT MAKES A CLUNKING SOUND AND THE GEAR INDICATOR GOES FROM THE GEAR NUMBER DISPLAN TO P-R-N-D INDICATOR AND THEN BACK TO THE GEAR NUMBER DISPLAY.  IF YOU LEAVE YOUR FOOT OFF THE BRAKE, THE CAR WILL REPEATEDLY JERK FORWARD.  IF YOU SLOWLY ACCELERATE THE CAR IS EXTREMELY JERKY AND NOT SMOOTH LIKE IT SHOULD BE.  THIS MAKES FOR DANGEROUS PARKING IN A GARAGE OR WHERE THERE ARE OBSTACLES IN THE AREA.  I AM AFRAID TO PARK IT.  THE PROBLEM OCCURS EVERYTIME I DRIVE THE CARE FOR 20-30 MINUTES. *TR",
        "vin": "WAUHE78P89A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "08/21/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10281829,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2009 AUDI A3 WITH 200 MILES COMPLETELY FAILED IN THE HIGHWAY IN LAS VEGAS, NV. I PURCHASED THE VEHICLE BRAND NEW APPROXIMATELY ONE WEEK PRIOR TO THIS INCIDENT. I AM TRAVELING ON THE HIGHWAY IN THE MIDDLE LANE AT AROUND 60/65 MPH, THE TRANSMISSION (DSG) STARTED MAKING CHUNK NOISES AND THE CAR STARTED TO JERK, THEN THE ENGINE COMPLETELY SHUT DOWN IN THE MIDDLE OF THE HIGHWAY!! NOT TO MENTION MY YOUNGEST SISTER (10 YEARS OLD) WAS WITH ME. I COULDN'T RESTART THE ENGINE AND I COULDN'T STEER AND/OR SHIFT WITHOUT PRESSING ON THE BREAK. I ENDED UP IN A COMPLETE STOP IN THE MIDDLE OF THE HIGHWAY HOPED NO ONE WOULD HIT ME AND THANK GOD IT DIDN'T. I THEN QUICKLY SHIFT THE GEAR BACK TO \"P\" AND FORTUNATELY THE ENGINE STARTED AGAIN SO I COULD GET OUT OF THIS HELL ZONE.     THIS IS TRULY UNBELIEVABLE FOR A NEW VEHICLE WITH 200 MILES. IF THIS DOES NOT PUT MY AND MY LOVE ONES IN DANGEROUS, I AM IN SERIOUS CONCERN OF THE MANUFACTURERS MOST BASIS HUMAN INTENTIONS. *TR",
        "vin": "WAUKF78P39A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/09/2009",
        "dateOfIncident": "04/02/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268277,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM IS BLINKING HEADLIGHTS AND INTERIOR LIGHTS WHEN BRAKES APPLIED. AT NIGHT IT IS MORE PRONOUNCED AND RESULTS IN A FLASHING EFFECT AS BRAKES ARE USED. CONSIDERED UNSAFE TO BE FLASHING LIGHTS AT NIGHT. HAVE TAKEN THE CAR TO DEALER MULTIPLE TIMES BUT THEY SAY IT IS WITHIN SPEC AND ALL 2009 AUDI A3 CARS WITH HALOGEN LAMPS EXHIBIT THIS. *TR",
        "vin": "WAUHF78P99A"
    }
]