[
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427001,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2009 BMW M3. The contact stated while operating the vehicle, the driver’s and passenger’s side turn signal failed to illuminate. Additionally, the headlights and dashboard lights would flicker on and off. Upon inspection, it was discovered that the electrical wiring insulation was frayed and damaged. The cause of the failure was not yet determined. The manufacturer and local dealer were not notified of the failure. The failure mileage was approximately 84,000.",
        "vin": "wBSWD93519P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318530,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL FOR THE AIRBAG ON MY CAR. I CONTACTED BMW TO REPLACE BUT THEY WERE UNABLE TO REPLACE AT THAT TIME. I HAVE TRIED TO CONTACT THEM SINCE TO ARRANGE REPLACEMENT AND THEY HAVE NOT RETURNED MY CALLS.",
        "vin": "WBSPM935X9E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060803,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE BEEN WAITING 2 YEARS TO HAVE THIS RECALL DONE. I WAS ONCE SCHEDULED TO GET THE SERVICE AND THEN AFTER I DROPPED OFF THE CAR THEY CALLED ME BACK AND STATED THAT THEY DIDNT HAVE THE PART IN.",
        "vin": "WBSWL93539P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2017",
        "dateOfIncident": "02/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002983,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  DRIVING MY CAR FOR ABOUT 30 MINUTES ON THE LOCAL STREET AND STOPPED AT A RED LIGHT, LIGHT TURNS GREEN, I TRY TO ACCELERATE AND ENGINE FELT SLUGGISH AND SHUTS OFF. TOWED THE CAR TO MRF ENGINEERING AND CAR NEEDED AN \"ENGINE REPLACEMENT\" AS MY ROD BEARINGS CAUSED THE ENGINE TO FAIL. COSTED ROUGHLY AROUND $19,000 IN PARTS AND LABOR.",
        "vin": "WBSPM93549E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991274,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT START AND ALL ELECTRICAL SYSTEMS WERE DEAD DESPITE A GOOD BATTERY.  WAS SOLVED BY REMOVING GLOVE BOX AND FUS BOX AND PUSHING ON THE BATTERY CABLE THAT GOES INTO THE FUSE BOX TO GET A CONNECTION.  THIS IS A KNOW ISSUE FOR BMW AND A RECALL WAS ISSUED ON OTHER 3-SERIES VEHICLES (2007 - 2011) WITH THE SAME PART NUMBERS, BUT WILL NOT COVER M3.  THIS IS A SAFETY ISSUE AS LOSS OF POWER TO FUSE BOX WHILE DRIVING CAN SHUT DOWN THE CAR.",
        "vin": "WBSPM93589E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970756,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN WAITING FOR OVER ONE YEAR FOR MY RECALL TO BE PERFORMED BY MY LOCAL BMW SERVICE CENTER. I RECEIVED A LETTER STATING IT WAS GOING TO BE TAKEN CARE OF IN MAY OF 2016 (LETTER WAS DATED MARCH OF 2016).  I DRIVE MY CAR ON A DAILY BASIS AND RUN THE RISK OF INJURY DUE TO THE DEFECTIVE AIRBAG. I WILL NOT ALLOW FAMILY MEMBERS TO DRIVE MY DANGEROUS VEHICLE AND NOW WORRIED I HAVE TO SELL MY CAR. IF I SELL MY CAR I SHALL DIVULGE THAT THERE IS A RECALL BY BMW AND THAT IT HAS NOT BEEN PERFORMED. I CANNOT DRIVE THIS VEHICLE ANYLONGER.",
        "vin": "WBSWD93549P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935144,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I RECEIVED NOTICE OF MY DRIVER SIDE AIRBAG AT THE BEGINNING OF THIS YEAR BUT THE BMW STILL DOES NOT HAVE THE PART. THIS CAR IS MY DAILY DRIVER AND I DO NOT HAVE THE LUXURY TO HAVE A SECOND CAR. I AM DRIVING A CAR THAT IS PUTTING MY LIFE AT RISK. BMW STATES THEY DO NOT HAVE ENOUGH, YET THEY HAVE PLENTY TO SELL MILLIONS OF NEW CARS. I FIND THIS ABSOLUTELY RIDICULOUS! MY WIFE'S TOYOTA WAS ALSO RECALLED AND IT TOOK A FEW MONTHS TO GET REPLACED, BUT NOT BMW. I WOULD LIKE TO SUGGEST A CHANGE TO RECALLS WHERE MANUFACTURES WOULD HAVE TO STOP OR REDUCE THE PRODUCTION NUMBERS OF NEW CARS FOR UNTIL ALL RECALLS HAVE BEEN SATISFIED FOR EXTREMELY DANGEROUS RECALLS. MAYBE THEN WE CAN HAVE MANUFACTURES TAKE THE ISSUE SERIOUSLY.",
        "vin": "WBSWD93519P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934034,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL HASN'T HAPPENED.  WHAT IS THE PROBLEM.  I GUESS IF YOU WAIT WE WON'T BE ABLE TO COMPLAIN AFTER IT KILLS US IN AN ACCIDENT.",
        "vin": "WBSWD93519P"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917999,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SUDDENLY VIBRATED AND THE WHEELS LOCKED UP AND SKIDDED SLIGHTLY SIDEWAYS BEFORE GOING INTO A REDUCED POWER MODE. IF IT HAD BEEN RAINING OR SNOWING, OR AT A HIGHER SPEED ON HIGHWAY THE SITUATION COULD HAVE BEEN DEADLY.  I HAD THE CAR TAKEN TO THE DEALER. I WAS TOLD A THE THROTTLE ACTUATOR VALVE WAS DEFECTIVE. THE CAR HAS ONLY 44K MILES BUT HAS SURPASSED THE 4 YEARS OF WARRANTY. THIS IS A KNOWN ISSUE WITH THOUSANDS OF CARS AFFECTED. BMW REFUSES TO RECALL AND REPAIR THE ITEM IF THE CAR IS NOT UNDER WARRANTY. THE COST FOR REPAIR IS $3000.00 THE PART ALONE IS $1200.00 WHICH I WAS QUOTED. MY VEHICLE IS ALSO AFFECTED BY THE TAKATA AIRBAG RECALL.",
        "vin": "WBSWD93589P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863062,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    HELLO MADAM/ SIR,    I RECEIVED A SAFETY RECALL NOTICE - 16V-071 REGARDING FAULTY DRIVERS SIDE AIRBAGS IN MY 2009 BMW M3. THE NOTICE (ATTACHED) CLEARLY STATES THAT IN AN EVENT OF AIRBAG GETTING DEPLOYED, THE AIRBAG MIGHT EXPLODE CAUSING SERIOUS INJURY OR DEATH.BMW SAYS THAT THEY DON'T HAVE ANY INFORMATION OF WHEN NEW PARTS WILL BE AVAILABLE.     TO AVOID ANY POTENTIAL ISSUE OF SOMETHING HAPPENING, I HAVE BEEN RENTING A CAR FOR A WHILE. I HAVE ALSO CONTACTED BMW AND HAVE BEEN UNSUCCESSFUL SO FAR TO RECEIVE ANY HELP. BMW TOLD ME THAT BMW DEALERSHIP OF ANN ARBOR WILL CONTACT ME FOR ALTERNATE TRANSPORTATION AND THEN BMW OF ANN ARBOR TOLD ME THAT THEY ARE NOT SUPPORTING THIS RECALL. I HAVE JUST BEEN GOING BACK AND FORTH WITH BMW AND THE DEALERSHIP WITHOUT ANY ASSISTANCE.    HOW AM I SUPPOSED TO DRIVE A VEHICLE WHEN THE RECALL CLEARLY STATES THAT EXPLOSION OF AIRBAG MIGHT EVEN CAUSE DEATH? I CAN'T JUST AFFORD TO CONTINUE RENTING A CAR.    ANY HELP FROM NHTSA WOULD BE GREATLY APPRECIATED. I AM HAPPY TO PROVIDE MORE INFORMATION.    KIND REGARDS,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBSWL93599P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863153,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, REPLACEMENT AIR BAGS ARE NOT AVAILABLE.  BMW HAS NO IDEA WHEN THEY WILL BE.  THIS IS NOT RIGHT, I SHOULD NOT HAVE TO DRIVE THIS CAR WITH THIS DEFECT.",
        "vin": "WBSWL93579P"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/27/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838738,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ERROR MESSAGE: FAULT IN - PASSENGER RESTRAIN SYSTEM AFFECTING AIRBAG, BELT TENSIONER, OR BELT FORCE LIMITER.    THIS IS CAUSED BY FAULT SEAT MAT SENSOR IN THE PASSENGER SEAT, WHICH MAY CAUSE THE AIRBAG NOT TO FUNCTION PROPERLY.",
        "vin": "WBSL93589P3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825875,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "S65 V8 ENGINE IN A BMW M3 E90/92/93 AND M5'S WITH A V10 HAS TWO THROTTLE VALVE ACTUATORS THAT FAIL PREMATURELY AT 40-80K MILES. BOTH THE INTERNAL NYLON GEARS AND ELECTRONICS WILL FAIL, AFFECTING ACCELERATOR PEDAL RESPONSE AND CAUSING HESITATION, ESPECIALLY WITH THE DCT TRANSMISSION. THESE PARTS ARE NOT A MAINTENANCE ITEM. WHEN FAILED, THE ENGINE MALFUNCTION, EXCESS EMISSIONS, SKID CONTROL, AND ABS BRAKING WARNING LIGHTS ARE TRIGGERED. ENGINE GOES INTO LIMP MODE. THIS IS DANGEROUS WHEN IT HAPPENS WHILE DRIVING IN RAINY, SNOWY, AND ICY ROAD CONDITIONS. THE THROTTLE VALVE ACTUATOR DESIGN DEFECT SHOULD HAVE TRIGGERED A BMW RECALL. REPLACEMENT PARTS ARE $1000-1300 EACH PLUS $1000 LABOR AND HAVE NEVER BEEN REDESIGNED BY BMW/BOSCH. SO THE REPLACEMENT PARTS ARE ALSO DEFECTIVE AND WILL FAIL PREMATURELY. REPAIRS OCCURRED ON DEC. 2012 AT 80K MILES FOR $2000 AND ON JAN. 2016 AT 140K MILES FOR $3000. A BMW M3 AND M5 RECALL AND REDESIGNED PARTS ARE WARRANTED. BMW TECHNICAL SERVICE BULLETINS SHOULD BE ISSUED FOR THIS DESIGN FLAW. 8YR/80KM FEDERAL EMISSIONS WARRANTY SHOULD COVER THESE REPAIRS AS WELL.",
        "vin": "WBSPM93579E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2015",
        "dateOfIncident": "08/22/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10765229,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST POWER WHILE TAKING A TURN.  I WAS ABLE TO RESTART IT AND DRIVE TO A NEARBY PARKING LOT.  I DROVE AROUND SLOWLY TO TEST AND NOTICED KNOCKING NOISE FROM THE ENGINE.  I ALSO NOTICED ENGINE TEMPERATURE WAS ABOVE NORMAL, NOT QUITE TO THE NEXT MARKER, BUT CLOSE.  AT THAT POINT, I HAD THE CAR TOWED TO A BMW SERVICE SHOP.  THEIR DIAGNOSIS WAS ROD BEARING FAILURE WHICH LED TO CRANKSHAFT DAMAGE, RESULTING IN AN ENGINE, WITH ONLY 57K MI,  THAT IS NO LONGER REUSABLE.  I AM NOW FACING ENGINE REPLACEMENT COSTS OF $15-25K.",
        "vin": "WBSWD935X9P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "03/23/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701509,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO EXIT MY E92 2009 M3 FROM INSIDE THE VEHICLE BY DOUBLE PULLING THE HANDLE IT WOULD NOT UNLOCK THE CAR.  THE LOCKING BOLT STICKS UP PARTIALLY WHEN YOU PULL THE HANDLE BUT DOESN'T UNLOCK.  I HAD TO HIT THE LOCK BUTTON FROM THE DASHBOARD TO UNLOCK THE CAR.  THIS IS A SAFETY CONCERN IF YOU ARE PANICKED AND CAN'T GET OUT OF THE VEHICLE UNDER HEAVY STRESS.  *TR",
        "vin": "WBSWD93559P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "04/05/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560764,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "400 MILES OUT OF WARRANTY, THE ELECTRICAL SYSTEM FAULT WARNING BEGAN TO COME ON. WHEN THIS HAPPENS ALL GAUGES BOTTOM OUT QUICKLY THEN RETURN TO NORMAL. SOMETIMES, THE RESTRAINT SYSTEM, EDC OR OTHER WARNINGS WILL START.  I DON'T EXPERIENCE ANY PROBLEMS DRIVING THE VEHICLE.   THE BATTERY HAS BEEN REPLACED AND ALTERNATOR HAS BEEN TESTED AND IS PERFORMING AS IT SHOULD.  WHEN CONNECTED TO THE BMW COMPUTER FOR ERROR CODES IT DOESN'T SHOW ANY CODES OR THAT THE WARNINGS HAVE GONE OFF.  I HAVE DRIVEN IT FOR 18000 MILES TRYING TO FIND JUST ONE COMMON THING THAT WILL MAKE THIS HAPPEN. I HAVE FOUND NOTHING TO CAUSE THIS WARNING. IT MAY GO OFF CONSTANTLY ONE DAY AND NOT HAPPEN AGAIN FOR 2 WEEKS. SOMETIMES, AFTER GOING OFF FOR SEVERAL TIMES, THE GAUGES FOR RPM, TEMP WILL DROP TO THEIR LOWEST INDICATIONS AND THE SPEEDOMETER WILL STICK AT WHATEVER THE SPEED IS AT THE TIME.  I HAVE EMAILED BMW OF NA AND THEY INFORMED ME THAT THE RECENT RECALL FOR THIS PROBLEM DOES NOT INCLUDE THE M SERIES. I WAS TOLD THAT IT COULD COST UP TOWARDS $5000 TO FIND A LOOSE WIRE. DIDN'T THINK I SHOULD HAVE TO PAY THAT MUCH SINCE IT WAS JUST 400 MILES OUT OF WARRANTY.  I DON'T THINK THAT IT IS A LOOSE WIRE BECAUSE I WOULD HAVE NOTICED THAT AS A COMMON FACTOR, LIKE HITTING A BUMP IN THE ROAD.  AFTER READING MANY BMW FORUMS, THIS SEEMS TO BE A PROBLEM ASSOCIATED WITH THE M3 AS WELL AS THE OTHER SERIES.  *TR",
        "vin": "WBSWL93529P"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/06/2011",
        "dateOfIncident": "09/29/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428888,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING MY BMW 2009 M3, I NOTICED  A RARE BUT VERY DISTURBING PATTERN ON TAKE OFF. I HAD CAR CHECKED IN DEALER AND I WAS TOLD IT WAS LIKELY SECONDARY TO MY DRIVING STYLE! THIS UNCONTROLLED TAKE OFF IS LIKE HI REV AND RAPID ACCELERATION PERIODICALLY ALTERNATING WITH DECELERATION FOR FEW SECONDS. I HAD THIS HAPPEN PROB A DOZEN TIME SO FAR(36K ON CAR). ON DAY OF MY ACCIDENT, IN STOP AND GO TRAFFIC WITH SPEED LESS THAN 5 MILES PER HOUR, CAR LITERALLY WENT OFF ON ME. IT ACCELERATED TO HIT THE CAR IN FRONT AND THEN MANAGED TO PUSH THE CAR INTO ANOTHER 3 CARS IN FRONT, BEFORE IT CAME TO A STALL. I AM NOT SURE IF IT WAS EXACTLY LIKE MY PREVIOUS EPISODES BECAUSE THE DISTANCE BETWEEN MY CAR AND NEXT CAR WAS SHORT. WHAT I AM SURE IS THAT I HAD NO CONTROL ON CAR.  *TR",
        "vin": "WBSWD93549P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2010",
        "dateOfIncident": "08/18/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350848,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN,    I AM VERY HAPPY TO SEE YOUR ORGANIZATION TAKING AN INTEREST IN THIS ISSUE. IT IS A VERY DANGEROUS PROBLEM WITH THIS VEHICLE THAT BMWNA IS WELL AWARE OF, BUT INSISTS THAT IT IS \"NORMAL BEHAVIOR\" FOR MY CAR/TRANSMISSION. I BROUGHT THE CAR INTO THE DEALER, AND THEY WERE ABLE TO REPRODUCE IT, BUT THEY WERE TOLD BY BMW THAT THIS WAS \"NORMAL BEHAVIOR.\"    THE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL.     THE DANGER IN THIS BEHAVIOR OCCURS WHEN MAKING A TURN INTO ON-COMING TRAFFIC AFTER SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT YOU HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. THIS SITUATION IS MOST PRONOUNCED IN THE \"AUTO\" MODE OF THE DCT TRANSMISSION, BUT ALSO OCCURS TO A LESSER DEGREE WHILE IN THE MANUAL MODE WHEN YOU SELECT SECOND GEAR IN PREPARATION FOR THE TURN. IT IS ALSO VERY REPEATABLE IN BOTH MODES.    THESE PROBLEMS STARTED OCCURRING AFTER A PREVIOUS RECALL ON THIS TRANSMISSION WHERE THE ENGINE WOULD STALL UNDER HARD BRAKING OR NOT SHIFT UNDER HARD BRAKING. THE RECALL FIXED THAT PROBLEM, BUT INTRODUCED THIS PROBLEM, WHICH OCCURS ALMOST EVERY DAY WHEREAS THE PREVIOUS PROBLEM ONLY OCCURRED DURING A SPECIFIC SITUATION.    THANK YOU FOR LOOKING INTO THIS DANGEROUS MATTER. *TR",
        "vin": "WBSWD93549P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2010",
        "dateOfIncident": "05/26/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332510,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    DEAR [XXX],    I AM VERY HAPPY TO SEE YOUR ORANIZATION TAKING AN INTEREST IN THIS ISSUE. IT IS A VERY DANGEROUS PROBLEM WITH THIS VEHICLE THAT BMWNA IS WELL AWARE OF, BUT INSISTS THAT IT IS \"NORMAL BEHAVIOR\" FOR MY CAR/TRANSMISSION. I BROUGHT THE CAR INTO THE DEALER, AND THEY WERE ABLE TO REPRODUCE IT, BUT THEY WERE TOLD BY BMW THAT THIS WAS \"NORMAL BEHAVIOR.\"    THE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL.     THE DANGER IN THIS BEHAVIOR OCCURS WHEN MAKING A TURN INTO ON-COMING TRAFFIC AFTER SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT YOU HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. THIS SITUATION IS MOST PRONOUNCED IN THE \"AUTO\" MODE OF THE DCT TRANSMISSION, BUT ALSO OCCURS TO A LESSER DEGREE WHILE IN THE MANUAL MODE WHEN YOU SELECT SECOND GEAR IN PREPARATION FOR THE TURN. IT IS ALSO VERY REPEATABLE IN BOTH MODES.    THESE PROBLEMS STARTED OCCURING AFTER A PREVIOUS RECALL ON THIS TRANSMISSION WHERE THE ENGINE WOULD STALL UNDER HARD BRAKING OR NOT SHIFT UNDER HARD BRAKING. THE RECALL FIXED THAT PROBLEM, BUT INTRODUCED THIS PROBLEM, WHICH OCCURS ALMOST EVERY DAY WHEREAS THE PREVIOUS PROBLEM ONLY OCCURED DURING A SPECIFIC SITUATION.    THANK YOU FOR LOOKING INTO THIS DANGEROUS MATTER. *TR",
        "vin": "WBSWL93589P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "02/20/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312918,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE DUAL CLUTCH AUTOMATIC TRANSMISSION IN D MODE, WHEN SLOWING FROM 50 OR 60 MPH TO 15-20 MPH THE TRANSMISSION WILL NOT DOWNSHIFT AND STAYS IN 6TH OR 7TH GEAR.  EVEN WITH THE ACCELERATOR TO THE FLOOR THE CAR WILL NOT SELECT AN APPROPRIATE GEAR WHICH MAKES THE CAR BARELY ACCELERATE AT ALL CREATING A SAFETY HAZARD.    THIS CAR HAS LITTLE TO NO TORQUE (BY DESIGN) AT VERY LOW RPMS, AND IT BASICALLY JUST SITS THERE AND DOESN'T MOVE.   A DRIVER OFTEN SLOWS LIKE THIS WHEN MAKING A LEFT OR RIGHT HAND TURN AND HAVING THE CAR JUST SIT THERE UNDER THOSE CONDITIONS PRESENTS A HUGE SAFETY ISSUE IN TERMS OF BEING EITHER REAR-ENDED OR BEING HIT BY ONCOMING TRAFFIC.    THE ENTIRE NATURE OF THE AUTOMATIC PROGRAM ON THIS CAR IS UNPREDICTABLE; IN SOME CASES IT WILL DOWNSHIFT, IN OTHERS (AS DESCRIBED ABOVE) IT WILL NOT, WHICH ADDS TO THE UNSAFE NATURE OF THIS DEFECT.   IT DOES NOT BEHAVE LIKE ANY AUTOMATIC TRANSMISSION I'VE EVER OWNED.       THE SOFTWARE CONTROLLING THE TRANSMISSION WAS UPDATED IN DECEMBER 2009.  PRIOR TO THAT, IN EITHER MANUAL OR AUTOMATIC MODE THE CAR WOULD DOWNSHIFT INTO A LOWER GEAR, BUT THERE WAS A 1-2 SECOND PAUSE BEFORE ANY POWER WAS DELIVERED (THE ENGINE WOULD NOT \"GO\" EVEN ACCELERATOR TO THE FLOOR).   THIS ISSUE HASN'T RECURRED, BUT THE SITUATION IS STILL NOT RECTIFIED (AS NOTED IN THE DESCRIPTION ABOVE) AS THE \"NEW\" ISSUE WITH FAILING TO DOWNSHIFT IN D MODES HAS SURFACED.    *TR",
        "vin": "WBSWD93599P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "02/21/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312915,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "1. WHEN SLOWING DOWN FOR A RED LIGHT THAT TURNS GREEN, THEN TRYING TO ACCELERATE BEFORE ACTUALLY STOPPING, THE CAR HESITATES OR LAGS. COULD GET REAR-ENDED OR T-BONED IF TURNING IN AN INTERSECTION. SOMEONE IS GOING TO GET KILLED DUE TO THIS ONGOING, IGNORED, SERIOUS SAFETY FLAW.  2. CAN ROUTINELY REPRODUCE THIS HESITATION/LAG.  3. BMW REFUSES TO RESOLVE THE PROBLEM AND HAS TOLD IT'S DEALERS IT IS A NORMAL RESPONSE. *TR",
        "vin": "WBSWL935X9P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2010",
        "dateOfIncident": "05/30/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310310,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2009 BMW M3 WITH DCT - ISSUE PRESENT FROM THE DATE OF PURCHASE.  THE PROBLEM OCCURS FREQUENTLY WHEN IN AUTOMATIC MODE AND SLOWING SUCH AS AT AN INTERSECTION PRIOR TO A TURN AND THE TRANSMISSION SHIFTS INTO THE LOWER GEAR (USUALLY 2ND).  WHEN THE ACCELERATOR IS PRESSED, THERE IS OFTEN NO RESPONSE FOR UP TO 2 SECONDS. WHEN THE VEHICLE DOES RESPOND, THE APPLICATION OF POWER MAY BE GRADUAL AND NOT DIRECTLY PROPORTIONAL TO THE ACCELERATOR PEDAL POSITION.    ON SEVERAL OCCASIONS, THIS HAS RESULTED IN A NEAR-ACCIDENT SITUATION. WHEN MAKING A LEFT TURN WITH ONCOMING TRAFFIC, OR MERGING RIGHT WITH TRAFFIC THAT IS MAKING A LEFT TURN, I HAVE HAD TO TAKE EMERGENCY ACTION TO AVOID COLLISION. IT IS ONLY A MATTER OF TIME, UNTIL SOMEONE IS INJURED OR WORSE WHEN THE VEHICLE FAILS TO RESPOND AS EXPECTED.    THERE ARE NUMEROUS COMPLAINTS OF THIS ISSUE IN THE NET DISCUSSION BOARDS, YET BMW NORTH AMERICA HAS ISSUED A STATEMENT CLAIMING THAT IT IS NORMAL TRANSMISSION BEHAVIOR.    THERE IS A SAFETY ISSUE WHEN YOUR VEHICLE FAILS TO RESPOND IN A RELIABLE/TIMELY MANNER IN REAL TRAFFIC SITUATIONS. *TR",
        "vin": "WBSWL935X9P"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/01/2009",
        "dateOfIncident": "09/24/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285960,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A SIDE ROAD AT THE ALLOTTED SPEED LIMIT., I WAS ON A SINGLE LANE ROAD. I THEN WENT OVER A POTHOLE- NOT A HUGE CRATER. AFTER WHICH MY STEERING WHEEL BECAME CROOKED AND THE DSC FAILURE WARNING ON MY BMW CAME UP. I TOOK IT TO THE DEALER SHIP AND THEY SAID THAT I HAVE DAMAGE TO MY REAR SUB FRAME(BENT), I APPARENTLY HAPPENS UNDER NORMAL DRIVING CIRCUMSTANCES-THE COST FOR REPAIRING IS 4000$. IT IS NOT COVERED UNDER WARRANTY. I HAVE TO PAY FOR IT. IT LOOKS LIKE TO AVOID THESE INCIDENTS I SHOULD NOT BE DRIVING ON ROADS - AS I WAS NOT SPEEDING NOR WAS I INVOLVED IN A COLLISION WITH ANOTHER CAR. I COULD HAVE AVOIDED THE POTHOLE - AT THE EXPENSE OF GOING INTO THE OPPOSITE LANE AND HITTING THE OTHER CAR. I HAVE CONTACTED EVERYONE AT BMW., NONE HELPS. I HOPE THIS IS MY LAST RESORT FOR LITTLE PEOPLE LIKE ME. *TR",
        "vin": "WBAWL735X9P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2009",
        "dateOfIncident": "08/03/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279187,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DUAL CLUTCH TRANSMISSION (DCT) IN MY CAR, A 2009 BMW M3 ROUTINELY HESITATES WHEN PUSHING THE ACCELERATOR IN 2ND GEAR. THE HESITATION IS LONG ENOUGH TO HAVE PUT ME AND MY PASSENGERS IN GRAVE DANGER. IN FACT, IT HAS ALMOST CAUSED A NUMBER OF ACCIDENTS WHEN MERGING WITH HIGHWAY TRAFFIC. THIS IS UNACCEPTABLE AND NEEDS TO BE IMMEDIATELY CORRECTED BEFORE SOMEONE IS SERIOUSLY INJURED OR KILLED. *TR",
        "vin": "WBSWL93589P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279088,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,    I RECENTLY PURCHASED A 2009 BMW M3 WITH THE DCT TRANSMISSION. THE TRANSMISSION ACTS LIKE A SEQUENTIAL MANUAL SHIFTER, ALLOWING THE DRIVER TO SHIFT UP AND DOWN AT THEIR WILL. THESE SHIFTS HAPPEN INSTANTANEOUSLY, WITHIN FRACTIONS OF A SECOND. ADDITIONALLY, WHEN COMING TO A STOP, THE CAR WILL DOWNSHIFT TO 1ST GEAR ON ITS OWN, INSTEAD OF RELYING ON DRIVER INPUT, AS A MATTER OF CONVENIENCE. ALL OF THIS IS NORMAL, ADVERTISED, AND EXPECTED BEHAVIOR.    THERE ARE TIMES, HOWEVER, WHEN THE CAR IS DECELERATING BUT NOT COMING TO A FULL STOP (WHEN TAKING A TURN AT AN INTERSECTION, FOR EXAMPLE), THAT THE TRANSMISSION WILL BEGIN ITS AUTOMATED DOWNSHIFTS BUT THEN BECOME INCREDIBLY UNRESPONSIVE. IN THESE CASES, IF I PRESS ON THE ACCELERATOR BEFORE COMING TO A FULL STOP, I'LL NOTICE A SIGNIFICANT LAG BEFORE THE ENGINE ACTUALLY REVS UP. BASICALLY, PRESSING ON THE GAS WON'T DO ANYTHING -- THE TRANSMISSION IS OSTENSIBLY \"DECIDING\" WHICH GEAR IS THE OPTIMAL ONE AND WILL IGNORE ALL MANUAL GEAR CHANGES AND GAS PEDAL INPUT UNTIL IT MAKES UP ITS MIND. AT TIMES, THIS LAG HAS LASTED AS LONG AS 2-3 SECONDS. THIS LAG IS BOTHERSOME, AT TIMES DANGEROUS, AND ALARMINGLY, WAS NOT AS NOTICEABLY BAD WHEN I FIRST PURCHASED THE CAR A FEW MONTHS AGO. THIS BEHAVIOR OCCURS ON A DAILY BASIS, AND CAN BE REPRODUCED AT WILL.    INCIDENTALLY, THIS LAG DOESN'T HAPPEN IF I MANUALLY DOWNSHIFT THROUGH THE GEARS TO 3RD, 2ND, OR 1ST RATHER THAN LETTING THE CAR PERFORM THE DOWNSHIFTS FOR ME. *TR",
        "vin": "WBSWD93599P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277564,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "M-DCT TRANSMISSION LAG. WHEN YOU'RE TURNING AND CARS MAY BE COMING AT YOU THERE IS NO POWER, CAUSING SERIOUS ENDANGERMENT. *TR",
        "vin": "WBSWD93529P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "07/05/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277616,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKID CONTROL.  THE OCCURS FREQUENTLY. *TR",
        "vin": "WBSWL93599P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "06/27/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275525,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A TWO-LANE STREET (ONE-LANE EACH DIRECTION) AND AS I WAS APPROACHING A STOPLIGHT I TURNED ON MY LEFT TURN SIGNAL AND STARTED TO MOVE INTO THE DEDICATED LEFT-HAND TURN LANE. AS I DID THIS I NEEDED TO DOWNSHIFT AS I SLOWED DOWN FOR THE STOPPED TRAFFIC AHEAD AT THE LIGHT. WHEN I SHIFTED TO SECOND GEAR AND PRESSED THE ACCELERATOR TO MOVE INTO THE TURN LANE MY CAR WOULD NOT ENGAGE INTO GEAR. I WAS ALMOST REAR-ENDED FROM THE CARS BEHIND ME BUT LUCKILY MY CAR'S TRANSMISSION ENGAGED AT THE LAST SECOND AND I CLEARED THE LANE I WAS IN. BUT BECAUSE I WAS PRESSING THE ACCELERATOR SO HARD TO TRY TO GET THE CLUTCH TO ENGAGE, WHEN IT FINALLY DID I SHOT OFF ACROSS THE LEFT-HAND TURN LANE INTO THE LANE OF ON-COMING TRAFFIC. I WAS ABLE TO STEER CLEAR BEFORE BEING HIT HEAD-ON BY ON-COMING TRAFFIC BUT THE EXPERIENCE LEFT ME VERY UNCOMFORTABLE WITH THE TRANSMISSION IN MY VEHICLE. *TR",
        "vin": "WBSPM93539E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/19/2009",
        "dateOfIncident": "01/15/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274339,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS FOR A 2009 BMW M3 COUPE WITH THE DUAL-CLUTCH TRANSMISSION (DCT). I AM EXPERIENCING MAJOR SHIFT LAG TRYING TO REACCELERATE AFTER SLOWING DOWN. BASICALLY, THE 2ND GEAR WILL FAIL TO CATCH / ENGAGE WHEN I PUT MY FOOT ON THE GAS PEDAL CAUSING THE CAR STALL FOR A SECOND OR TWO. AFTER THAT, THE GEAR WILL ENGAGE ABRUPTLY AND I WILL BE PULLED VIOLENTLY FORWARD. THIS HAS RESULTED IN SEVERAL NEAR-ACCIDENT SITUATIONS:    1. I ALMOST REAR-ENDED SOMEONE WHEN THE GEAR ENGAGED ABRUPTLY WITH THE CAR JERKING FORWARD AT A STOP LIGHT WHEN IT TURNED GREEN AS I WAS APPROACHING, SLOWING DOWN TO 2ND GEAR.    2. I WAS ALMOST T-BONED AT A NON-REGULATED INTERSECTION. I WAS SLOWING DOWN WHEN APPROACHING THE INTERSECTION. THE CAR DOWNSHIFTED TO 2ND GEAR FOR ME AND ABOUT 1/4 WAY INTO THE INTERSECTION, I SAW A VEHICLE SPEEDING DOWN TOWARDS THE INTERSECTION ON MY LEFT. I TRIED TO ACCELERATE TO GET OUT OF THE INTERSECTION BUT THE TRANSMISSION FAILED TO ENGAGE FOR A FULL 2 SECONDS. I BARELY MISSED THE VEHICLE T-BONING INTO MY CAR.    THERE IS NO APPARENT EVENTS THAT HAVE LED UP TO THE FAILURE. THE CAR BEHAVES LIKE THAT ON THE FIRST DAY I BOUGHT IT. THIS FAILURE WOULD HAPPEN EVERY TIME I LEAVE THE CAR IN AUTOMATIC MODE, SO THAT THE CAR'S COMPUTER WILL DOWNSHIFT FOR ME. I ALREADY BROUGHT THE CAR TO THE DEALERSHIP TWICE COMPLAINING ABOUT THE ISSUE AND THE POTENTIAL SAFETY RAMIFICATIONS, BUT THE DEALERSHIP'S SERVICE DEPARTMENT CLAIMED THAT BMW NORTH AMERICA HAS ISSUED A STATEMENT CLAIMING THAT IT IS NORMAL TRANSMISSION BEHAVIOR AND THERE IS NOTHING THAT THEY CAN DO TO CORRECT IT.    OBVIOUSLY, THIS IS A MAJOR SAFETY CONCERN FOR ME AND I AM ASTONISHED THAT BMW WILL NOT DO ANYTHING TO RECTIFY ITS PROBLEM. *TR",
        "vin": "WBSWD93579P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/19/2009",
        "dateOfIncident": "06/12/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274365,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO. I HAVE A 2009 BMW M3 WITH THE DCT TRANSMISSION. I AM EXPERIENCING SIGNIFICANT DELAYS WHEN DOWN SHIFTING FROM ONE GEAR TO A LOWER GEAR.  THE PROBLEM OCCURS WHEN YOU SLOW DOWN, LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE A SERIOUS PROBLEM FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE POWER ENGAGING. I WOULD SAY ABOUT 2-4 SECONDS. BY THIS TIME, I AM REALLY STEPPING ON THE GAS PEDAL. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES ENGAGING THE ANTI-SKIP CONTROL. THIS PROBLEM BECOMES MOST APPARENT WHEN MAKING A TURN INTO ON-COMING TRAFFIC, SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT I HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. *TR",
        "vin": "WBSWD93599P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273913,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING OUR 2009 BMW 335I ON FWY 5 SOUTH AT ABOUT 65 MPH , THE CHECK ENGINE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANE. IT SPUTTERED AND STALLED REPEATEDLY, WE HAVE TO DRIVE REALLY SLOW TO GET HOME, NEXT DAY I GOT IT IN AUTHORIZED DEALER, THE TECHNICIAN STATED THAT THE FUEL PUMP CONTRIBUTED TO THE FAILURE. THE FUEL PUMP WAS REPLACED THIS HAPPENED TO MY 2 TIMES , THIS IS A VERY UNSAFE PROBLEM COULD CAUSE ACCIDENT IF WE IN A MID OF PASSING OTHER CAR ON FWY . THE GOVERNMENT SHOULD REQUIRE BMW RECALL ALL VEHICLES WITH THIS PUMP,THIS SEAM TO BE THE ONGOING PROBLEM WITH 335I SEAN 2007 AND BMW STILL DIDN'T FIX IT, THIS IS NEW 2009 BMW 335I ONLY HAVE 2500 MILES ON IT. *TR",
        "vin": "WBAPM73569E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/29/2009",
        "dateOfIncident": "05/25/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272388,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2009 BMW M3 DCT (DUAL CLUTCH TRANSMISSION) EXHIBITS A SERIOUS LAG/HESITATION WHEN TRYING TO ACCELERATE FROM A RAPID ROLLING STOP. WHEN THIS ISSUE OCCURS IN AN INTERSECTION OR AT A STOP LIGHT, A SERIOUS SAFETY ISSUE EXISTS OF BEING T-BONED OR SLAMMED IN THE REAR. WHEN REPORTED TO BMW THEY CLAIM IT \"WORKS AS DESIGNED\". GUESS SOMEONE NEEDS TO BE SERIOUSLY INJURED OR KILLED BEFORE BMW WILL RESOLVE THIS ISSUE. *TR",
        "vin": "WBSWL935X9P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/23/2009",
        "dateOfIncident": "05/20/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269767,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOWING DOWN AT AN INTERSECTION TO MAKE A LEFT TURN.  DECELERATED TO ABOUT 3 MPH.  ACCELERATED TO INITIATE THE TURN.  TRANSMISSION FAILED AND CAR DID NOT ACCELERATE.  ABOUT 1.5-2 SECOND LAG TIME BEFORE THE TRANSMISSION ACTUALLY ENGAGED.  ALMOST GOT HIT BY AN ONCOMING CAR. *TR",
        "vin": "WBSPM93539E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2009",
        "dateOfIncident": "04/29/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267248,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2009 BMW M3 WITH DCT TRANSMISSION, THERE IS A NOTICEABLE LAG AFTER BRAKING WHEN YOU TRY TO ACCELERATE WHILE IN AUTOMATIC(D).  THIS IS ESPECIALLY DANGEROUS WHEN TRYING TO PULL OUT OF AN INTERSECTION.  THE CAR HAS NO POWER AND SITS THERE LIKE IT'S THINKING.  SOMEONE IS GOING TO GET HURT.  BMW NEEDS TO GET A FIX TO THIS SOFTWARE GLITCH. *TR",
        "vin": "WBSPM93529E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2009",
        "dateOfIncident": "04/13/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265508,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER ON HIGHWAY AND ENGINE MISFIRE/STUTTER. *TR",
        "vin": "WBANW13549C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2009",
        "dateOfIncident": "04/08/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265523,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 2002 BMW 325I    TAIL LIGHT SOCKET OVER HEATS DUE TO IMPROPER GROUNDING AND BURNS OUT. CAUSES THE TAIL LIGHT AND BLINKERS TO MALFUNCTION. DEALERS CHARGING UPWARDS OF $600 (EACH SIDE ) TO FIX THE WIRING THAT CERTAINLY IS A SAFETY ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "04/14/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265296,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW M3 WITH DCT TRANSMISSION EXHIBITS A DANGEROUS ACCELERATION LAG IN SECOND GEAR.  SPECIFICALLY, WHEN COASTING AT LOW SPEED IN SECOND GEAR, CLOSE TO ONE FULL SECOND WILL ELAPSE ONCE THE ACCELERATOR PEDAL IS DEPRESSED BEFORE THE TRANSMISSION ACTUALLY ENGAGES AND THE CAR BEGINS TO ACCELERATE.  THIS MAKES MERGING INTO TRAFFIC, OR ANY SITUATION REQUIRING QUICK POWER APPLICATION, DIFFICULT AND POTENTIALLY DANGEROUS. *TR",
        "vin": "WBSWD93569P"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265347,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2009 BMW M3 WITH A DCT TRANSMISSION LAGS BETWEEN 1ST AND 2ND GEAR. WHEN YOU PUSH ON THE ACCELERATOR THE CAR DOES NOT GO FOR AT LEAST 2 SECONDS, THEN IT SHOOTS FORWARD. I HAVE COMPLAINED TO BMW BUT THEY SAY THIS IS NORMAL. THIS OCCURS ALL THE TIME WHEN I AM SLOWING DOWN AND THE CAR IS DOWN SHIFTING. *TR",
        "vin": "WBSWD93509P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2009",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265033,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A SIGNIFICANT LAG FOR THE TRANSMISSION TO ENGAGE IN MY CAR WHICH AT TIMES PREVENTS ME FROM GETTING OUT OF THE WAY OF A POTENTIAL CONFLICT.  *TR",
        "vin": "WBSWL93589P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2009",
        "dateOfIncident": "03/16/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264984,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY: POWER APPLICATION LAG IN 2ND GEAR WITH M3 DUAL CLUTCH TRANSMISSION.  SPECIFIC INCIDENT: WHILE ROLLING IN 2ND WITH ABOUT 1500RPM I WAS TRYING TO MERGE ONTO TRAFFIC FROM A MERGING RIGHT LANE THAT WAS ENDING SHORTLY. AFTER I THOUGHT IT WAS SAFE TO ACCELERATE, I DID SO, BUT THE ENGINE DID NOT PRODUCE POWER FOR THE NEXT 0.5 SECOND. AFTER POWER KICKED IN, IT WAS NO LONGER SAFE TO CONTINUE AS THE ONCOMING CAR WAS CLOSER THAN I HAD CALCULATED BEFORE ATTEMPTING TO ACCELERATE. ALSO, POWER KICKED IN AS I WOULD EXPECT IT TO HAPPEN 0.5 SECOND AGO. TO AVOID AN ACCIDENT, I HAD TO BREAK ABRUPTLY CAUSING THE BELTS TO LOCK AND MY WIFE CONSIDERABLE DISCOMFORT. GOOD THING NO ONE WAS BEHIND ME EXPECTING ME TO ACCELERATE. THE OCCURRENCE OF THE LAG IS PREVALENT WHERE THE SYSTEM IS NOT SURE WHETHER THE DRIVER WANTS TO BREAK OR ACCELERATE. I BELIEVE IT NEEDS ATTENTION BY BMW AND APPROPRIATE REPROGRAMMING OF THE TRANSMISSION CONTROL SYSTEM. *TR",
        "vin": "WBSPM93599E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2009",
        "dateOfIncident": "04/02/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264299,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRANSMISSION DOWNSHIFTS TO 2ND GEAR, SUDDEN AND COMPLETE LOSS OF POWER WHEN TURNING.  HAPPENS WITH DCT TRANSMISSION WITH LATEST SOFTWARE.  MANY SIMILAR COMPLAINTS ON BMW MESSAGE BOARDS, AND BMW IS BASICALLY IGNORING US. *TR",
        "vin": "WBSWD93559P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263986,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2009 BMW M3.  IT HAS THE MDCT TRANSMISSION.  THERE IS A DELAY WHEN COMING TO A ROLLING STOP AND THEN TRYING TO ACCELERATE AGAIN.  THE DELAY OCCURS WHEN PUSHING THE ACCELERATOR AND WHEN THE ENGINE/TRANSMISSION ACTUALLY ENGAGES AND MOVES FORWARD.  THE DELAY IS AS LONG AS 1-1.5 SECONDS.  THIS HAS NEARLY CAUSED SEVERAL ACCIDENTS.  BMW SAYS THIS IS NORMAL BEHAVIOR, BUT I DON'T BELIEVE IT TO BE THE CASE.  IT SEEMS LIKE THE TRANSMISSION DOESN'T DOWNSHIFT AT LOWER SPEEDS.  IN FACT, ONLY \"THINKING\" AND PROCEEDING TO DOWNSHIFT AFTER THE ACCELERATOR IS APPLIED.  BY THEN, IT'S TOO LATE.  AS A DRIVER, YOU EXPECT FORWARD MOMENTUM AS SOON AS THE ACCELERATOR IS APPLIED... NOT THAT IT DOWN SHIFTS AT THAT POINT.  PLUS, THE READING DISPLAY SUGGESTS IT IS IN FACT DOWNSHIFTED TO 2ND GEAR... BUT I ASSURE YOU, THAT'S NOT THE POINT.  THIS HAPPENS EVERY TIME THE SCENARIO IS MENTIONED.  SAY COMING FROM 35 MPH OR HIGHER SO THE VEHICLE IS IN A HIGHER GEAR (5 OR 6) AND THEN YOU SLOW TO SAY 10 MPH AND THEN TRY TO ACCELERATE.... SAY IN STOP AND GO TRAFFIC. *TR",
        "vin": "WBSWD93519P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "02/09/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258029,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS OCCURS REGULARLY, PERHAPS 10 TIMES PER WEEK OR MORE DEPENDING ON SEVERITY.  ON DECELERATION, THE TRANSMISSION WILL DISENGAGE THE DRIVELINE.  WHEN THE THROTTLE IS DEPRESSED AGAIN TO ACCELERATE, THERE IS A LONG DELAY (GREATER THAN 1 SECOND).  THIS OCCURS AT SLOW SPEEDS (LESS THAN 20 MPH), FOR EXAMPLE WHEN ENTERING A LEFT TURN LANE WITH ONCOMING TRAFFIC.  I HAD THIS BEHAVIOR DUPLICATED FOR A BMW TECHNICIAN WHO, UPON FURTHER RESEARCH, INDICATED THAT BMW WAS AWARE OF THIS ISSUE AND HAS DECLARED IT \"NORMAL OPERATION\".  IT IS ONLY A MATTER OF TIME BEFORE A SERIOUS ACCIDENT IS CAUSED BY THIS ISSUE. *TR",
        "vin": "WBSPM93509E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257975,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE 2009 BMW M3 SEDAN WITH DCT (DUAL CLUTCH) TRANSMISSION, THERE IS A SIGNIFICANT LAG OR HESITATION OF AT LEAST 1 SECOND BETWEEN APPLYING PRESSURE TO THE ACCELERATOR AND THE CLUTCH ENGAGING AND GIVING ACCELERATION TO THE WHEELS. THIS DOES NOT HAPPEN FROM A STAND-STILL, BUT OCCURS PRIMARILY WHEN THE CAR IS IN MOTION AT VIRTUALLY ALL RANGES OF SPEED, FROM ROLLING STOP (5KM/HR OR LESS) THROUGH STANDARD ROAD SPEEDS OF ANY DEGREE (RESIDENTIAL 30-40KM/HR, CITY ROADS 50-70KM/HR, OR HIGHWAY 90KM/HR+). I WAS CAREFULLY IN THE MIDDLE OF A SLOW LEFT TURN AT AN INTERSECTION ON SATURDAY, FEB 7, 2009. TO AVOID AN ONCOMING CAR PREMATURELY HEADING IN MY DIRECTION, I PRESSED ON THE ACCELERATOR TO HASTEN THE COMPLETION OF MY TURN, BUT THE  CAR DID NOT RESPOND BECAUSE OF THE CLUTCH LAG. I NARROWLY AVOIDED BEING HIT.     THIS TRANSMISSION DEFECT COULD REASONABLY RESULT IN SERIOUS INJURY OR DEATH TO THE DRIVER OR PASSENGERS, ESPECIALLY WHEN SUDDEN AND UNANTICIPATED ACCELERATION OUT OF A DIFFICULT DRIVING SITUATION IS REQUIRED. *TR  THE CONSUMER STATED HE ALSO EXPERIENCED UNEXPECTED STALLS DURING LOW SPEED DRIVING, BUT NOT RAPID DECELERATION.  UPDATED 03/11/09. *JB",
        "vin": "WBSPM93569E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2009",
        "dateOfIncident": "02/06/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257666,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 09 BMW M3 WITH DCT IS EXHIBITING GEAR SHIFTING SLOWNESS AND POWER LAGGING PROBLEMS AFTER HARD BRAKING. THE MOST RECENT INCIDENT WAS A NEAR REAR END COLLISION TODAY THAT REQUIRED ME TO BRAKE HARD FROM 70MPH, TO 40, SWITCH LANES AND ACCELERATE TO AVOID BEING HIT BY APPROACHING TRAFFIC FROM BEHIND. WHEN I ATTEMPTED TO ACCELERATE, THE CAR DID NOT RESPOND FOR WHAT SEEMED LIKE A COUPLE SECONDS. THE LAG WAS LONG ENOUGH THAT THE CAR BEHIND ME WAS FORCED TO LEAVE THE ROAD TO AVOID HITTING ME. *TR",
        "vin": "WBSPM93599E"
    }
]