[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760162,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK ON THESE F-SERIES (F650GS, F800GS) BMW MOTORCYCLES IS A KNOWN (NATIONWIDE, AND WORLDWIDE) PROBLEM. THE GAS TANK DEVELOPS CRACKS ALONG A PARTICULAR AREA ON THE SIDE. THIS HAPPENED TWICE TO THE VEHICLE I OWN, IN APRIL OF 2015, AND NOW IN AUGUST, 2015. THE FIRST TIME IT HAPPENED ON MY MOTORCYCLE, FUEL WAS ACTUALLY LEAKING OUT OF THE TANK. NOW IT IS A DEEP CRACK THAT A PERSON CAN FIT A FINGERNAIL INTO, IT IS THAT WIDE. I EXPECT FUEL TO LEAK OUT OF IT AGAIN SOON. THE LOCAL DEALER WARRANTEES THE TANK, BUT THE ISSUE CONTINUES. THE ISSUE IS WITH THE LACK OF QUALITY IN THE MANUFACTURING PROCESS. BMW MOTORRAD CONTINUES TO WARRANTY THESE TANKS INSTEAD OF ADDRESSING THE DESIGN FLAW AND/OR MANUFACTURING PROCESS THAT CAUSES IT.",
        "vin": "WB10228079Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745672,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTORCYCLE WAS PUT INTO THE SHOP BEFORE A TRIP AND WE WERE TOLD THAT THERE WERE CRACKS ON THE OUTSIDE WALL OF THE FUEL TANK IN THE SEAM AREAS.  VICTORY BMW TOLD US THAT IT HAPPENS TO A LOT OF BIKES AND THEY WOULD TRY TO PUT IT IN UNDER WARRANTY AND WE WERE LATER TOLD THAT THE COMPANY WOULD NOT COVER IT.  THERE ARE A LOT OF COMPLAINTS ON THE WEB UNDER THE BMW 600 - 800 FORUMS.  ANY PROBLEM WITH FUEL TANKS IS A SERIOUS DANGEROUS SITUATION.  BMW SHOULD BE FORCED TO RECALL AND REPLACE THE TANKS.",
        "vin": "WB10228049Z"
    }
]