[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233327,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1300 S",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MOTORCYCLE WAS INCLUDED IN THE PREVIOUS NHTSA RECALL CAMPAIGN NUMBER: 13V617000, FOR A FUEL PUMP FLANGE FAILURE WHICH WOULD RESULT IN A FUEL LEAK AND POTENTIAL FIRE, AND WORSE.    SINCE THE RECALL, WE'VE HAD 2 SEPARATE SITUATIONS OF FUEL LEAKAGE WHILE IN MOTION.      THE FIRST WAS NOVEMBER 18, 2017, TRAVELING AT SPEED ALONG A STRAIGHT HIGHWAY, RAW GASOLINE WAS SMELLED BY THE PASSENGER. FUEL WAS DRIPPING STEADILY OVER THE LOWER ENGINE COMPONENTS. THE BIKE WAS NOT SAFE TO RETURN TO THE ROAD, TRUCKED BACK HOME. WE WERE INFORMED THE RECALL HAD ALREADY BEEN SATISFIED, ALL RISKS WERE OURS TO ASSUME. WE REPLACED THE PLASTIC FUEL PUMP MALE QUICK DISCONNECT FITTING WITH A METAL UNIT, AS THE MALE UNIT SHOWED A CRACK.    THE SECOND FAILURE WAS JULY 16, 2019. VEHICLE WAS IN MOTION, FREEWAY TRAFFIC CONGESTION AND ASSOCIATED SPEED FOR EVENING COMMUTE, STRAIGHT ROUTES OF TRAVEL. THE SMELL OF GASOLINE WAS AGAIN DETECTED AND RAW GAS WAS AGAIN OBSERVED DRIPPING FROM THE CONNECTORS, LEAKING FROM BETWEEN THE COLLAR AND THE FEMALE CONNECTOR.      THE CRACKS THE RECALL COLLAR WAS TO ADDRESS AND KEEP FROM CONTINUING, APPEAR TO HAVE ACTUALLY CONTINUED TO DEVELOP AND INCREASE, LEADING TO POTENTIALLY LIFE-THREATENING CIRCUMSTANCES.     THE MALE AND FEMALE QUICK DISCONNECT FITTINGS CAN BE REPLACED WITH METAL, BUT THESE REPLACEMENTS MUST BE THREADED INTO AN ALREADY COMPROMISED SETTING.     THE PREVIOUS RECALL COLLAR IS A FAILURE. THIS SHOULD HAVE BEEN CORRECTLY FIXED BY A REDESIGNED FUEL PUMP REPLACEMENT USING METAL QUICK DISCONNECTS, INSTEAD OF APPLYING WHAT AMOUNTS TO A BAND-AID SOLUTION.    WE DO NOT KNOW HOW MUCH DAMAGE OR FRACTURING IS CONTINUE TO OCCUR UNDER THE FLANGE 'FIX'. BUT THIS CONTINUED FAILURE IS PUTTING THE RIDER AT RISK FOR VEHICLE FIRE, INJURY, OR EVEN DEATH.",
        "vin": "WB10509089Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "04/30/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269380,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1300 S",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 BMW K1300S.  WHEN COMING TO A STOP, THE MOTORCYCLE SHUTS OFF.  THE FAILURE BEGAN WHEN THE VEHICLE REACHED 500 MILES AND ALWAYS OCCURS AFTER IT HAS BEEN FILLED WITH GASOLINE AND APPROACHING A STOP SIGN AT 30 MPH OR LESS.  THE CONTACT FILED A CLAIM WITH BMW AND WAS ADVISED TO CALL NHTSA.  THE FAILURE MILEAGE WAS 500 AND CURRENT MILEAGE WAS 1,400.    UPDATED 05/27/09  *BF  UPDATED  06/01/09.*JB",
        "vin": "WB10509009Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "05/11/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269403,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1300 S",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 BMW K1300S MOTORCYCLE.  THE CONTACT STATED THAT THE ENGINE SHUTS OFF WHEN COASTING OR DOWNSHIFTING TO A STOP.  THE FAILURE OCCURS WHENEVER HE ATTEMPTS TO STOP HIS VEHICLE AT A STOP LIGHT.  IN ADDITION, THE PASSENGER SIDE SIGNAL SWITCH WAS NOT WORKING.  THE DEALER DID NOT HAVE THE NECESSARY PARTS BECAUSE THE VEHICLE WAS NEW AND THEY COULD NOT DETERMINE WHY THE ENGINE WAS STALLING.  THE FAILURE MILEAGE WAS 580.   UPDATED 05/21/09  *BF  THE VEHICLE WOULD OCCASIONALLY STALL WHEN COMING TO A STOP. UPDATED 05/27/09.*JB",
        "vin": "WB10509079Z"
    }
]