[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172736,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ENTERING THE INTERSTATE FUEL BEGAN SPEWING FROM THE UPPER LEFT FAIRING AREA. I PULLED OFF AND SHUT IT DOWN. I COULDN'T TELL WHERE IT ORIGINATED FROM. IT DIDN'T APPEAR ANY LONGER SO I DECIDED TO RETURN HOME, ABOUT 2 MILES. UPON ENTERING THE INTERSTATE AGAIN FUEL SPEWED OUT WITH SUCH FORCE IT COVERED MY ENTIRE LEFT SIDE AND LEG. I PULLED OFF ASAP. A MOTORIST SAW ME AND STOPPED TO HELP. HE WAS AFRAID OF A FIRE, AS I WAS, AND PULLED OUT AN EXTINGUISHER. FUEL WAS EVERYWHERE. HE HELPED ME TOW IT HOME.",
        "vin": "WB10388039Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092807,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC FAILURE OF THE REAR DIFFERENTIAL (FINAL DRIVE). THE DRIVE BEGAN MAKING GRINDING AND SQUEALING NOISES. I THEN FELT THE REAR WHEEL LOOSING TRACTION. I PULLED TO THE SHOULDER IMMEDIATELY. I NOTICED AT THAT TIME A BRAKE FAILURE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. MY REAR BRAKE WAS INEFFECTIVE. UPON EXAMINING THE DRIVE AREA THERE WAS GEAR OIL ALL OVER THE REAR BRAKE CALIPER, DISC AND REAR WHEEL, INCLUDING THE TIRE. THE FINAL DRIVE WAS SERVICED APPROXIMATELY 1200 MILES PRIOR TO THIS FAILURE, IT HAD BEEN FILLED WITH THE CORRECT VISCOSITY OIL AT THE RECOMMENDED LEVEL OF 180CC. AT THAT TIME THERE WERE NO METALLIC SHAVING OF ANY KIND VISIBLE IN THE OIL THAT WAS DRAINED FROM THE DRIVE.   THE FAILURE OCCURRED ON TEXAS STATE HIGHWAY 6 IN A RURAL AREA.",
        "vin": "WB10388039Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092504,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 RECALL ON THE FUEL PUMP FLANGE WAS ISSUED AND IT WAS COMPLETED AT A BMW DEALER IN JUNE OF 2014. NOW MAY 6, 2018 THE FUEL PUMP FLANGE HAS FAILED SPRAYING FUEL OVER THE ENGINE. I CONTACTED THE BMW CUSTOMER SERVICE DEPARTMENT THEY INFORMED ME THAT DUE TO THE PART BEING OVER 2 YEARS OLD AND THEY NO LONGER RESPONSABLE FOR THE REPLACEMENT OF THE PART. THIS IS THE SAME ISSUE FOR THE 2014 RECALL AND NOW IT HAS HAPPENED AGAIN.",
        "vin": "WB10388029Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2017",
        "dateOfIncident": "09/02/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023849,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS 52500 MILES.  AFTER FUELING THE MOTORCYCLE I ATTEMPTED TO RESET THE TRIP ODOMETER IN THE NORMAL WAY BY TURNING THE THROTTLE TO MAXIMUM WHILE HOLDING THE BC BUTTON ON THE DASHBOARD.  BIKE WAS ON, ENGINE NOT RUNNING. THE PLASTIC PULLEYS ON BOTH THROTTLE BODIES SNAPPED SUDDENLY,  LEAVING THE THROTTLE BODY SET TO FULL THROTTLE. I VERIFIED THIS BY STARTING THE BIKE. IF THIS PULLEY FAILURE HAD HAPPENED WHILE IN MOTION IT COULD HAVE RESULTED IN AN ACCIDENT. THE THROTTLE BODY PULLEYS ARE NOT REPLACEABLE NOR ARE THE THROTTLE BODIES SERVICEABLE. AFTER A PERIOD OF TIME THE PLASTIC PULLEY DETERIORATES DUE TO HEAT AND LOSES STRENGTH. I REGARD THIS AS A DEFECTIVE DESIGN AND SAFETY HAZARD. THE PART SHOULD BE METAL AS ON PREVIOUS MODELS. MY R1100RT HAS 150,000 MILES AND NO ISSUES WITH THE TB PULLEYS. I WOULD URGE THAT BMW BE REQUIRED TO RECALL THE 2005-2009 MODELS WITH THESE PLASTIC PULLEYS AND REPLACE WITH METAL ONES OR THAT THEY WARRANTY THE REPAIR WHEN THIS FAILURE OCCURS.",
        "vin": "WB10388079Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005469,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: VIN [XXX]    DEAR BMW MOTORCYCLES OF AMERICA    I DEVELOPED A SERIOUS AND SIGNIFICANT FUEL LEAK TODAY FROM THE LEFT SIDE OF MY FAIRING/ TANK OF MY R1200RT.  THE FUEL ONLY LEAKED WHEN THE KEY WAS ON, OR THE ENGINE WAS RUNNING, INDICATING THE FUEL WAS COMING FROM THE PRESSURIZED SIDE OF THE FUEL CIRCUIT, FROM LIKELY THE FUEL PUMP FLANGE. THERE IS EVIDENCE IN FORUMS AND THE RESPONSES FROM OWNERS TO DEALERS THAT THIS FUEL PUMP FLANGE CRACKING IS A COMMON ISSUE, AND THAT THERE HAS BEEN A RECALL ISSUED (13V617000) FOR REPAIR AND REPLACEMENT.  I AM THE ORIGINAL OWNER OF THIS BIKE AND I NEVER RECEIVED A NOTICE FROM BMW REGARDING THIS ISSUE, AND WHEN I TRY TO ENTER MY VIN WITH THE BMWUSA.COM SITE AS WELL AS WITH NHTSA.GOV (SAFERCAR.GOV), I CANNOT MAKE PROGRESS BECAUSE I AM TOLD MY VIN IS INVALID.  THIS IS NOT SO, AS I HAVE HAD OTHER WARRANTY WORK NOTIFIED AND COMPLETED VIA THIS VIN. (REPEATED FUEL STRIP SENSOR FAILURE, AND THE REAR WHEEL FLANGE CRACK RECALL).    PLEASE CONTACT ME REGARDING THIS FUEL LEAK RECALL ISSUE AND HELP ARRANGE APPROPRIATE REPAIRS AND REPLACEMENT. THIS IS A FAILURE OF A PART THAT IS NOT NORMAL WEAR AND TEAR, AND POSES A SIGNIFICANT SAFETY RISK FOR FIRE.    SINCERELY,       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WB10388099Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671553,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING INTO SECOND GEAR, THE ENGINE SPEED DROPPED TO IDLE AND I LOST ALL POWER AND THE ABILITY TO CONTROL ENGINE SPEED. I COASTED TO THE SHOULDER AND HAD TO CALL FOR A TOW AS THE BIKE WOULD ONLY IDLE. UPON FURTHER INSPECTION AFTER I GOT THE BIKE HOME, I DISCOVERED THAT THE PLASTIC PULLEYS ON THE THROTTLE BODIES HAD SHEARED OFF. THIS REQUIRES REPLACEMENT OF THE THROTTLE BODIES. I WAS SHOCKED TO FIND OUT THE PULLEYS ARE PLASTIC. PREVIOUS MODELS WERE METAL AND MOST CARS/BIKES USE METAL, WHICH WOULD BE MORE RESISTANT TO FAILURE. TO QUOTE ANOTHER COMPLAINT:  \"IF OR WHEN THE PLASTIC FAILS, THERE IS NO THROTTLE AND THE ENGINE GOES TO IDLE, THUS CREATING AN EXTREME SAFETY HAZARD IF ONE IS DRIVING IN TRAFFIC AND UNABLE TO MAINTAIN SPEED OR ACCELERATE. IN THIS CIRCUMSTANCE THE RIDER COULD BE FORTHRIGHTLY IN HARM'S WAY AND ENDANGERED. THIS SHOULD BE AN URGENT RECALL ISSUE FOR REPLACEMENT OF THE PLASTIC PART WITH A SOLID CABLE PULLEY WHICH WILL NOT BREAK. PREVIOUS MODELS USED METAL CABLE PULLEYS WHICH DID NOT FAIL.\" THIS IS A POTENTIAL DANGER. IF SOMEONE HAD BEEN ACCELERATING BEHIND ME, I COULD HAVE BEEN REAR ENDED. BMWS INTRANSIGENCE IS MIND BOGGLING.   *TR",
        "vin": "WB10388099Z"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641062,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW MOTORCYCLE WAS BEING RIDDEN AT INTERSTATE SPEEDS WHEN IT BEGAN TO DEVELOP A VIBRATION. THE VEHICLE WAS SLOWED AND THE FIRST AVAILABLE EXIT WAS TAKEN. BY THIS TIME THE REAR WHEEL FELT LIKE IT WAS GOING TO LOCK UP. THE MOTORCYCLE WAS STOPPED AT THE FIRST SAFE PARKING AND A WRECKER WAS DISPATCHED.  THE REPAIR FACILITY INFORMED ME THAT THE DRIVESHAFT UNIVERSAL JOINT HAD FAILED AND WAS BEATING AGAINST THE SWING ARM  WHICH COULD HAVE BEEN A TOTAL FAILURE.  THE DRIVESHAFT IS NOT A TEARDOWN AND INSPECT ITEM AND THEREFORE LEAVES THE RIDER WITH NO WARNING OF IMPENDING FAILURE.   THIS IS VERY DANGEROUS.  *TR",
        "vin": "WB10388059Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "07/14/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525757,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 BMW R1200 RT MOTORCYCLE. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, A LOUD NOISE WAS HEARD FROM THE REAR OF THE VEHICLE. THE CONTACT PULLED OVER TO INSPECT THE VEHICLE AND NOTICED GREASE COVERING THE BRAKES AND REAR WHEEL. THE GREASE CAME FROM A BROKEN REAR DIFFERENTIAL/FINAL DRIVE. THE CONTACT TOWED THE VEHICLE TO A LOCAL DEALER, WHO STATED THAT THE FINAL DRIVE RIGHT ANGLE GEAR BOX NEEDED TO BE REPLACED. THE CONTACT DID NOT HAVE THE VEHICLE REPAIRED. THE FAILURE MILEAGE WAS 30,580.",
        "vin": "WB10388059Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514560,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORCYCLE RAN OUT OF FUEL DUE TO FUEL SENSOR FAILURE.  BOTH ANALOG AND DIGITAL GAUGES SHOWED 40+ MILES REMAINING IN THE FUEL TANK.  VEHICLE WAS IN FAST LANE OF INTERSTATE HIGHWAY AND MY EMERGENCY STOP REQUIRED STATE PATROL ASSISTANCE DO TO THE LOCATION OF THE STOP.  *TR",
        "vin": "WB10388099Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2013",
        "dateOfIncident": "01/10/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492199,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE TOP OF THE FUEL PUMP, WHERE THE FUEL LINE QUICK DISCONNECT IS THREADED INTO THE HOUSING, MULTIPLE CRACKS HAVE DEVELOPED IN THE FUEL PUMP HOUSING. *TR",
        "vin": "WB10388019Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2012",
        "dateOfIncident": "10/23/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485368,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL LEVEL SENSOR HAS FAILED (TWICE) AND HAS BEEN REPLACED BY THE BMW MOTORCYCLE DEALERSHIP.  THE LATEST FUEL LEVEL SENSOR IS NOT WORKING PROPERLY EITHER AND WILL EVENTUALLY BE REPLACED AGAIN BEFORE THE WARRANTY EXPIRES IN FEB 2013.  *TR",
        "vin": "WB10388049Z"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/18/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485221,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS GAUGE SENSOR STRIP STOPS WORKING AND WILL READ THAT YOU HAVE MORE GAS THAN YOU ACTUALLY DO.  THIS IS EXTREMELY DANGEROUS AND CAN CAUSE THE RIDER TO RUN OUT OF GAS AND BE STRANDED IN MOVING TRAFFIC.  THERE ARE TOO MANY COMPLAINTS FROM BMW MOTORCYCLE OWNERS TO IGNORE THIS PROBLEM ANY LONGER!  PLEASE MAKE THE MANUFACTURER ADDRESS THIS PROBLEM INSTEAD OF CONTINUING TO PROFIT OFF OF A SAFETY ISSUE.  A GOOGLE SEARCH ON \"BMW MOTORCYCLE FUEL STRIP\" WILL GIVE YOU ALL THE LEVERAGE YOU NEED.  *TR",
        "vin": "WB10388039Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2012",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446392,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "IN RESPONSE TO A REQUEST FROM OWNERS WITH SIMILAR PROBLEMS TO REPORT THESE TO THE NHTSA, I AM ADDING MY OWN INFORMATION:  DURING A TIRE-CHANGE SERVICE, THE DEALER'S MECHANIC NOTED THAT THE BEARING IN THE REAR WHEEL FINAL DRIVE HAD BECOME \"CRUNCHY\" AND NEEDED TO BE REPLACED. UPON POINTING OUT THE PROBLEM, I WAS ABLE TO DETECT THE RESISTANCE IN THE WHEEL MYSELF.  THE DEALER REPLACED THE BEARING UNDER WARRANTY AND ON COMPARISON WITH A NEW BEARING, THERE WAS DEFINITELY RESISTANCE AND A LACK OF SMOOTH FUNCTION IN THE ORIGINAL BEARING.  MY UNDERSTANDING IS THAT OTHERS WITH SIMILAR PARALEVER FINAL DRIVES HAVE ENCOUNTERED SERIOUS BEARING FAILURE RENDERING THE MOTORCYCLE SUDDENLY UNABLE TO PROCEED NORMALLY, SOMETIMES WITH A MAJOR LEAKAGE OF THE FINAL DRIVE LUBRICANT.  I BELIEVE MINE WAS SIMPLY CAUGHT EARLY ENOUGH TO AVOID A MORE DRAMATIC FAILURE.   *KB",
        "vin": "WB103880X9Z"
    }
]