[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/28/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Winnebago of Indiana, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409157,
        "products": [
            {
                "manufacturer": "Winnebago of Indiana, LLC",
                "productMake": "BRISTOL BAY",
                "productModel": "FIFTHWHEEL",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2009 BRISTOL BAY 3420BH IN SEPTEMBER OF 2009.  TO DATE, I HAVE LESS THAN 3,000 MILES ON THE UNIT.  THE SUNNYBROOK RV., INC. PROVIDED TIRES (LOAD STAR KARRIER TIRES (ST235/80R16)) ON THE UNIT HAVE DEVELOPED BLISTERS ON THE SIDEWALLS.  UPON INVESTIGATION, THIS IS A KNOWN PROBLEM WITH THESE TIRES.  IT APPEARS THAT SUNNYBROOK RV, INC. IS KNOWINGLY AND WILLFULLY EQUIPPING THEIR RV UNITS WITH DEFECTIVE AND/OR INFERIOR TIRES.   THIS CREATES AN UNACCEPTABLE SAFETY HAZARD FOR MYSELF AND MY FAMILY.  THIS SITUATION ALSO GREATLY DIMINISHES AN OTHERWISE QUALITY PRODUCT.  IT IS TROUBLESOME THAT CORNERS WERE CUT IN THE NAME OF SAFETY JUST TO INCREASE THE BOTTOM LINE.    I ATTEMPTED TO RECTIFY THIS SITUATION THROUGH MY LOCAL AUTHORIZED SUNNYBROOK DEALER, AMERICAN TRUCK AND RV WHO ARE LOCATED IN SAN ANGELO, TX.  THE AUTHORIZED DEALER PROMPTLY CONTACTED SUNNYBROOK ABOUT THIS SITUATION.  THE SUNNYBROOK REPRESENTATIVE ADVISED THE AUTHORIZED DEALER TO TELL ME TO DIRECTLY CONTACT THE SUNNYBROOK TIRE SUPPLIER ' LOAD STAR TIRES. I CONTACTED THE TIRE SUPPLIER AND WAS TOLD THERE WAS NOTHING THEY COULD DO.  I AM GRATEFUL TO MY LOCAL AUTHORIZED DEALER FOR THEIR ASSISTANCE IN THIS MATTER, BUT ON THE OTHER HAND SUNNYBROOK'S ACTIONS AND ADVICE TRULY INDICATE THE APATHY AND INDIFFERENCE THEY HAVE TOWARDS THEIR CUSTOMERS WITH A KNOWN ISSUE PERTAINING TO THEIR PRODUCTS.  *TR",
        "vin": "4UBBR0T2791"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/15/2009",
        "dateOfIncident": "08/05/2009",
        "fire": false,
        "manufacturer": "Winnebago of Indiana, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283975,
        "products": [
            {
                "manufacturer": "Winnebago of Indiana, LLC",
                "productMake": "BRISTOL BAY",
                "productModel": "FIFTHWHEEL",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2009 FIFTH WHEEL RV TRAILER IS EQUIPPED WITH A MOR RYDE RE (RUBBER EQUALIZER) SUSPENSION ON THE DUAL AXLES. WHILE I WAS UNDER THE TRAILER INSTALLING TIRE COVERS I NOTED THAT TWO OF THE  EIGHT BOLTS WHICH SECURE ONE OF THE MOR RYDE UNITS WERE MISSING AND TWO OTHER BOLTS WERE SIGNIFICANTLY LOOSE AND WOULD HAVE FALLEN OUT. LOSS OF ALL FOUR BOLTS ON ONE SIDE OF THE SPRING ISOLATOR WOULD CAUSE AN IMMEDIATE COLLAPSE OF THE SUSPENSION AND DEPENDING ON SPEED OF THE RV AT THE TIME OF FAILURE A SEVERE WRECK. I IMMEDIATELY INSTALLED TWO BOLTS AND THEN WENT TO AN RV SERVICE SHOP TO HAVE THE TIRES REMOVED SO THE TECHNICIAN COULD REACH THE UPPER BOLTS TO TIGHTEN THEM. MOR RYDE WAS CONTACTED BUT STATED THAT THE RE UNITS ARE SEND TO THE FRAME MANUFACTURES/RV MANUFACTURER UNASSEMBLED AND ARE TIGHTENED WHEN THE SPRINGS AND RE UNITS ARE INSTALLED ON THE FRAME. THIS DOES NOT APPEAR TO BE A DESIGN OR ENGINEERING PROBLEM BUT RATHER POOR QA ON THE LINE WHEN THE SUSPENSION WAS ASSEMBLED. HAVING SAID THAT, A SUSPENSION COLLAPSE ON A TRAILER WHICH WEIGHS 14K CAN BE CATASTROPHIC. *TR",
        "vin": "4UBBR0S2791"
    }
]