[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "05/12/2014",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242598,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2009 CAN AM SPYDER RS AND IT CAUGHT ON FIRE IN MAY 2014 . MY BIKE ONLY HAS 1900 MILES AND HAS BEEN IN THE  SHOP FOR SERVICE FOUR TIMES. IT CAUGHT ON FIRE ON MAY 12, 2014 AT MY WORK FABENSISD. I HAD IT IN THE SHOP FOR 3 RECALLS AND  GOT IT BK 3 MONTHS LATER FROM NOV. 2013 TO FEB 2014. DROVE IT TO WORK WHICH IS 5 MILES AWAY. THE SCHOOL HAS IT IN THEIR  SURVEILLANCE CAMERA. SANTA TERESA WANTS TO CHARGE ME FOR A PART THAT DOES NOT HAVE ANY WARRANTY. MY COMPLAIN IS WHY  SHOULD I PAY FOR ANYTHING WHEN IT WAS THE MANUFACTURES FAULT? SINCERELY [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *JS *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2017",
        "dateOfIncident": "02/21/2017",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959806,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CAN-AM SPYDER ROADSTER. WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING FAILED WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE POWER STEERING FAILED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.   UPDATED 06/08/17*LJ  *AS",
        "vin": "2BXJAXA139V"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "05/12/0201",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745299,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: X1460470A. 2009 CAN AM SPYDER RS. CONSUMER STATED AFTER HAVING THE BIKE SERVICED 4 TIMES AND RECALLED 3 IT CAUGHT FIRE. *LN",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "05/02/2015",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735999,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CAN-AM SPYDER ROADSTER. THE CONTACT STATED THAT THE CHECK DYNAMIC POWER STEERING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 09V162000 (STEERING) BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE CONTACT MENTIONED THAT THE VEHICLE EXHIBITED SIMILAR STEERING DIFFICULTIES AS BEFORE THE RECALL REPAIR WAS PERFORMED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 799.     UPDATED 12/06/2017*CN",
        "vin": "2BXJAWA149V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525756,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKED UP IN TURNS, 11 TIMES IN 6 MILES AT 45 MPH.  *TR",
        "vin": "2BXJAWA1X9V"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2011",
        "dateOfIncident": "06/09/2011",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411083,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING ON A TWO LANE RESIDENTIAL STREET WHEN WITHOUT ANY WARNING THE STEERING PULLED HARD TO THE LEFT AND TOOK ME INTO THE ONCOMING LANE. HAD A ONCOMING CAR BEEN COMING IN MY DIRECTION I WOULD HAVE HIT IT HEAD ON AT APPROXIMATELY A 30 DEGREE ANGLE. THIS HAPPENED SO FAST AND I WAS TRYING TO COUNTER STEER BACK INTO MY LANE AND ALMOST FLIPPED WHEN THE STEERING RELEASED.   I HAD THIS SAME PROBLEM WITH A 2008 CAN AM SPYDER. THIS PROBLEM WAS SUPPOSED TO BE FIXED ACCORDING TO BRP, BUT IT IS STILL HAPPENING. THIS 2009 SPYDER WAS BOUGHT BAND NEW AND SHOWS THAT THE DPS WAS CHECK AND OR CHANGED BEFORE IT WAS SOLD TO ME. IT IS APPARENT THAT THE NEW UNIT HAS THE SAME PROBLEM AS THE NEW ONE.   I ALSO WISH TO REPORT THE RANDOM SMELL OF FUEL  WHICH CAUSES ME CONSIDERABLE WORRY SINCE MY 2008 CAN AM SPYDER WAS COMPLETELY DESTROYED WHEN IT UNEXPECTEDLY BURST INTO FLAMES AS I WAS LEAVING MY DRIVEWAY.  *TR",
        "vin": "2BXJAAA119V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/10/2011",
        "dateOfIncident": "09/10/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399837,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CAN-AM SPIDER ROADSTER. THE CONTACT STATED THAT HE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 09V162000 (STEERING) SEPTEMBER 2010 AND HAD BEEN TRYING TO HAVE THE VEHICLE REPAIRED UNDER THE RECALL SINCE THAT TIME. THE DEALER WAS CONTACTED NUMEROUS TIMES AND CONTINUALLY ADVISED THAT THE PARTS NEEDED FOR REPAIRS WERE ON BACKORDER. THE VEHICLE HAS NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN AND THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362478,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 CAN-AM SPYDER ROADSTER MOTORCYCLE. THE CONTACT RECEIVED A RECALL NOTIFICATION UNDER THE NHTSA CAMPAIGN ID NUMBER 09V162000 (STEERING). THE VEHICLE WAS TAKEN TO THE DEALER AND THE RECALL PART WAS ON A MASSIVE BACK ORDER. THE MANUFACTURER WAS UNCERTAIN WHEN THE PART WOULD BECOME AVAILABLE TO PERFORM THE REMEDY REPAIR. THE VEHICLE WAS NOT BEING DRIVEN DUE TO THE SAFETY RECALL DEFECT. THERE WAS NO FAILURE MILEAGE.",
        "vin": "2BXJALA179V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358433,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 CAM-AM SPYDER ROADSTER. THE CONTACT RECEIVED A RECALL NOTICE FOR RECALL 09V162000 (STEERING). THE CONTACT WAS INFORMED BY THE DEALER THAT THE MANUFACTURER WAS SENDING OUT REPLACEMENT PARTS FOR ONE VEHICLE AT A TIME. THE DEALER WOULD REPAIR ONE VEHICLE, RETURN THE PARTS TO THE MANUFACTURER AND THEN RECEIVE PARTS FOR ANOTHER VEHICLE. THE CONTACT WAS TOLD THAT IT WOULD BE EIGHT MONTHS BEFORE THE VEHICLE WAS REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 3,000.   UPDATED 01/03/11",
        "vin": "2BXJALA1X9V"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "02/09/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356543,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CAN AM SPYDER RS.  THE CONTACT STATED THAT THE AUTOMATIC TRANSMISSION WOULD INTERMITTENTLY BECOME LOCKED IN GEAR.  THE MANUFACTURER WAS NOTIFIED AND THEY STATED THAT THERE WERE NO FAILURES AND THE VEHICLE WAS DESIGNED TO RESPOND IN THE MANNER IN WHICH IT WAS.  THE VEHICLE WAS NOT REPAIRED.  THE VIN WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS APPROXIMATELY 1,300.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345340,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 CAN AM SPIDER SE 5 ROADSTER MOTORCYCLE (NA). THE CONTACT STATED WHEN THE ENGINE WAS TURNED ON, THE CHECK ENGINE LIGHT WOULD ILLUMINATE ON THE DASHBOARD. THE CONTACT WOULD SHUT OFF AND RESTART THE VEHICLE SEVERAL TIMES UNTIL THE WARNING LIGHT WAS NO LONGER ILLUMINATED. THE DEALER ADVISED THERE WAS A LOOSE WIRE CAUSING THE FAILURE AND THE DEALER ATTEMPTED TO TIGHTEN THE WIRE. THE FAILURE PERSISTED. IN ADDITION, THE POWER STEERING ASSIST WOULD INTERMITTENTLY FAIL, CAUSING LIMITED STEERING CAPABILITIES. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE DPS SYSTEM WAS DEFECTIVE.  THE DEALER ADVISED THE CONTACT THAT THE VEHICLE WAS UNSAFE TO DRIVE. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,900 AND THE CURRENT MILEAGE WAS 2,005.",
        "vin": "2BXJAXA119V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/03/2010",
        "dateOfIncident": "05/29/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334496,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2009 CAN AM SPYDER.  THERE IS A STEERING PROBLEM WITH THE BIKE.  I WILL BE DRIVING THE BIKE STRAIGHT AND IT WILL ALL OF A SUDDEN GO LEFT WITHOUT MY TURNING THE HANDLE BAR IN THAT DIRECTION.  I HAVE TO THEN PULL THE BAR RIGHT, IT WILL CLICK AND THEN I WILL HAVE CONTROL OVER THE STEERING AGAIN.  IT HAS HAPPENED ABOUT SIX TIMES NOW, AND WHEN IT HAPPENS IT IS RANDOM.  THUS FAR I HAVE NOT HAD AN ACCIDENT BUT IT IS DANGEROUS AND BRP NEEDS TO BE WORKING WITH THE PEOPLE THAT ARE HAVING PROBLEMS, COMPENSATING THEM OR SOMETHING.   NOTHING HAS BEEN DONE TO CORRECT THE PROBLEM, WHEN I TOOK THE BIKE IN FOR REGULAR 3000 MILE MAINTENANCE THEY DID ALL THE CHECKS, HOOKED IT UP TO BUDS AND BASICALLY SAID ALL WAS FINE.  SINCE TAKING IT IN, THE STEERING HAS ACTED UP YET AGAIN.  BRP HAS CALLED AND LEFT A RAMBLING MESSAGE ON MY MACHINE ABOUT HOW THEY ARE WORKING ON THE STEERING ISSUE, BUT THEY HAVE BEEN AWARE OF THE PROBLEM FOR QUITE SOME TIME AND OTHERS HAVE HAD THE SAME ISSUES.  IT IS A DANGEROUS BIKE AS IS, AND NOTHING IS BEING DONE TO CORRECT IT FROM WHAT I CAN SEE.  SOMEONE IS GOING TO GET HURT, IF IT HASN'T ALREADY HAPPENED. *TR",
        "vin": "2BXJAXA119V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "05/05/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329868,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2009 RS SPYDER ON 05/04/2010 AND I HAVE RODE IT 300 SCARY MILES. THIS MACHINE IS DANGEROUS TO RIDE,IT FOLLOWS EVERY SEAM IN THE RODE SURFACE ,JERKING THE MACHINE BACK AND FORTH. SOMETIMES YOU DON'T HAVE GOOD CONTROL OF THE DIRECTION THE BIKE WANTS TO TAKE. I'VE BEEN RIDING MOTORCYCLES ALL MY LIFE AND KNOW HOW TO  RIDE A BIKE,I'VE LOGGED MORE 500,000 MILES ON MOTORCYCLES AND THIS MACHINE IS SCARY TO RIDE. I SPOKE TO THE DEALER ABOUT MY CONCERN AND HE CLAIMS THAT I WILL GET USE TO THE WAY THE MACHINE HANDLES. I DON'T THINK IT'S SEAT TIME, BUT A DESIGN PROBLEM WITH THE DESIGN OF THE FRONT END GEOMETRY. RECALL 09V162000 WAS COMPLETED BEFORE I TOOK DELIVERY OF THE SPYDER. THIS RECALL IS SUPPOSED TO CORRECT A STEERING CONCERN I'VE TRIED TO CONTACT BRP. THE MAKER OF THE MACHINE WITHOUT SUCCESS..WHAT DO I DO? *TR",
        "vin": "2BXJAXA1X9V"
    }
]