[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/20/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362965,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL FILLER NECK LEAKS FUEL.",
        "vin": "JS2YC414596"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269607,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SUCH CAR THE AIRBAG WARNING LIGHTS CAME ON AND STATE SOLID SO I PULL OFF THE STREET TO CHECK WHAT'S GOING AND SHUT OFF THE CAR AFTER THAT THE CAR DO NOT START IMMEDIATELY SO TAKE THREE TIMES TO STARTED IT. SINCE THEN THE AIRBAG WARNING LIGHTS STAY ON.",
        "vin": "JS2YC416X96"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/18/2019",
        "dateOfIncident": "05/31/2019",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244819,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  AIRBAG LIGHT ON, HAS COME OFF AND ON SEVERAL TIMES. NOW ON, LIGHT WILL NOT RESET. INDICATES PASSENGER SEAT CUSHION IS DEFECTIVE.",
        "vin": "JS2YC414796"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154809,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST ISSUE IS THE AIRBAGS - DRIVER SIDE CENSOR LIGHT HAS BEEN ON EVER SINCE I PURCHASED THE VEHICLE BACK IN 2010. I HAD TO GET THE ENGINE REPLACED DUE TO \"ROD KNOCK\" ONLY TO FIND THAT THE USED ENGINE OF 52,XXX MILES HAS A LEAK ON THE REAR MAIN SEAL. IT'S LIKELY THAT ISSUE THAT LEAD TO MY ORIGINAL ENGINE FAILING AT AROUND 74,000 MILES. THE DRIVER AIRBAG LIGHT IS STILL ON AFTER SAID ENGINE REPLACING. AFTER READING THE COMPLAINTS ON HERE, IT'S SAFE TO SAY THAT I'LL NEED TO DISH OUT OVER 1.1K TO FIX IT. I HAD THE RECALL FOR THE PASSENGER SIDE AIRBAG, HAD THAT FIXED AROUND THE 74K MILE MARK. GOT THE CAR UNDER 20K MILES.",
        "vin": "JS2YC414596"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100052,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS BAD CLEAR COAT IS GONE",
        "vin": "JS2YB417495"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "01/16/2017",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955351,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS RUNNING FINE. I WAS DRIVING SOUTHBOUND IN 3 / 6 LANE TRAFFIC 45 MPH IN TOWN  WHEN A LOUD KNOCK STARTED KNOCKING UNDER THE HOOD.  I IMMEDIATELY PULLED OFF THE ROAD AS SOON AS I FOUND A PLACE TO PULL OFF OTHERWISE COULD HAVE STALLED CAUSING A MAJOR CRASH OF VEHICLES.  I CALLED AAA TO HAVE IT TOWED.  THE REPAIR SHOP IN MY NEIGHBORHOOD SAID I NEEDED A NEW ENGINE.  CAR HAS 72,072 MILES ON IT.  THE 7 YEAR WARRANTY RAN OUT JULY 24, 2016. THIS HAPPENED LESS THAN 6 MONTHS AFTER WARRANTY AND 9 MONTHS AFTER LAST CAR PAYMENT. IT HASN'T REACHED 100,000 YET FOR THE DRIVE TRAIN. PRETTY SAD.",
        "vin": "JS2YC414896"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908354,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVEN N THE LIGHTS FROM THE TOP ALL THE ELECTRICAL GOT ON FIRE , I FOUND  OUT SINCE 2005 A BOYFRIEND TOOK MY IDENITY",
        "vin": "303973959"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839342,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PARKING BRAKE LIGHT STAYS ON WHILE DRIVING EVEN THOUGH THE BRAKE IS RELEASED.  COMES ON GOES OFF.  WHAT COULD BE CAUSING THIS?     [XXX]  I BOUGHT THE CAR IN NOV  2015.  IT HAPPENS EVERY TIME THE CAR IS DRIVEN    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *BF  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2015",
        "dateOfIncident": "01/10/2015",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723564,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOT HAD AN INCIDENT. MY AIRBAG LIGHT HAS BEEN ON FOR A LONG TIME. TOOK IT IN FOR RECALL & THAT DID NOT FIX THE PROBLEM. THEY TOLD ME I HAD TO BRING IT BACK IN & PAY $150 DIAGNOSTIC FEE TO HAVE THEM FIGURE OUT PROBLEM WITH AIRBAGS. I HAVEN'T BROUGHT IN. I'M FRUSTRATED THEY DIDN'T FIX IT WITH THE RECALL & FEEL IT COULD BE PART OF THE RECALL ISSUE & WHY SHOULD I HAVE TO PAY FOR DIAGNOSTIC TESTS & SUBSEQUENT REPAIRS.",
        "vin": "JS2YB413196"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/17/2014",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669244,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT THE DRIVE BELT SLIPPED CAUSING A SQUEAKING NOISE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V055000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.   UPDATED 02/18/15*LJ    THE CONSUMER STATED THE VEHICLE'S BLOWER FAN WOULD SLOW DOWN. THE STEERING WOULD BECOME DIFFICULT AND PULL TO THE RIGHT.   UPDATED 4/4/16/2016 *JS",
        "vin": "JS2YB417395"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2014",
        "dateOfIncident": "02/19/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649336,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DIVER AIRBAG LIGHT IS ALWAYS ON.  WHEN TAKEN FOR REPAIRS CODE OFTEN DIFFERS.  AUTHORIZED SUZUKI DEALERSHIP SAYS THAT ENTIRE WIRING SYSTEM WOULD NEED REPLACED FOR $3000, BUT COULD NOT GUARANTEE THAT WOULD FIX IT..  IT CAN BE CLEARED, BUT THAT IS ONLY EFFECTIVE FOR A FEW DAYS.  LIGHT USED TO BE INTERMITTENT, NOW IT IS CONSTANT.  AUTHORIZED SUZUKI DEALERSHIP SAYS WHEN LIGHT IS ON, THE AIR BAG WILL NOT DEPLOY.  I'VE BEEN FORCED TO DRIVE WITH THIS CONDITION FOR 10K MILES OR MORE.   MY PASSENGER SEAT HAD DIFFERENT AIRBAG SENSOR PROBLEMS.  IT HAS BEEN REPLACED.  REPLACEMENT OF PASSENGER SEAT DID NOT AFFECT DRIVER SIDE PROBLEM FOR BETTER OR WORSE.  *TR",
        "vin": "JS2YB417595"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639158,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER AIRBAG WARNING LIGHT COMES ON INTERMITTENTLY. THERE IS A KNOWN RECALL OF THE 2009 SUZUKI SX4 FOR A PROBLEM WITH THE SENSOR IN THE RIGHT FRONT PASSENGER SEAT. I BOUGHT THIS CAR AS A USED VEHICLE IN DECEMBER 2013. I HAVE ATTEMPTED TO CONTACT SUZUKI MOTOR OF AMERICA DIRECTLY BY TWO SEPARATE LETTERS TO INQUIRE ABOUT HAVING THE NECESSARY REPAIR MADE; ALSO I HAVE CALLED THREE DESIGNATED DEALERSHIPS THAT HANDLE SUZUKI WARRANTY REPAIRS IN ORLANDO, TAMPA, AND ST. PETERSBURG, FL TO INQUIRE ABOUT THE STATUS OF THE RECALL. I HAVE RECEIVED NO RESPONSE FROM SUZUKI MOTOR OF AMERICA, AND THE DEALERS KNOW NOTHING ABOUT THE STATUS OF THIS RECALL, OTHER THAN VERIFYING THAT MY VEHICLE IS ONE OF THOSE AFFECTED BY THE RECALL. I AM CONCERNED THAT, SHOULD THIS VEHICLE BE INVOLVED IN AN ACCIDENT WITH A PASSENGER IN THE FRONT PASSENGER SEAT, THAT THE AIRBAG WILL NOT DEPLOY AS IT SHOULD, THUS POTENTIALLY LEADING TO A SERIOUS PASSENGER INJURY. I WOULD LIKE ASSISTANCE IN GETTING SUZUKI TO FOLLOW THROUGH WITH THE RECALL REPAIRS FOR THIS DEFECT.  *TR",
        "vin": "JS2YA413496"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619080,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL *  THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT TOOK THE VEHICLE TO THE DEALER TO HAVE THE PASSENGER SIDE AIR BAG SERVICED. AFTER THE REPAIR, THE CONTACT NOTICED THAT THE DRIVER SIDE AIR BAG INDICATOR WAS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AGAIN. THE FAILURE MILEAGE WAS 97,596.   UPDATED 9/12/14*CN",
        "vin": "JS2YB413395"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "12/04/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593469,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT NHTSA CAMPAIGN ID NUMBER: 13V405000 (AIR BAGS) HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE DEALER STATED THE PART WAS NOT AVAILABLE FOR REPAIR. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG WARNING LIGHT INTERMITTENTLY FAILED TO ILLUMINATE WHEN ACTIVATED BY AN OCCUPANT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 50,000. DR",
        "vin": "JS2YC416496"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2014",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583830,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO TPMS SENSORS FAILED.  THE FIRST SENSOR FAILED AT ABOUT 31000 MILES AND WAS REPLACED UNDER WARRANTY.  THEN AT AROUND 50,000 MILES THE SECOND TPMS SENSOR FAILED AFTER WARRANTY HAD EXPIRED.    THE FAILURE IS MECHANICAL IN NATURE. THE THREADED VALVE STEM OF THE TPMS SENSOR DEVELOPS HAIRLINE CRACKS REFAULTING IN SLOW AIR LEAKS, WHICH DEVELOP INTO LARGER LEAKS WITHIN WEEKS, WHICH LEADS TO THE TPMS WARNING LIGHT GOING OFF IN THE INSTRUMENT PANEL, AND EVENTUALLY, IN THE NEED TO REPLACE TO TPMS SENSOR DUE TO THE AIR LEAK.    FAILURE TO CHECK THE TIRE'S AIR PRESSURE WITHIN A DAY OR TWO CAN RESULT IN A FLAT TIRE.    THERE IS A GREAT DEAL OF EVIDENCE IN INTERNET FORUMS THAT THIS IS A WIDESPREAD SUZUKI SX4 ISSUE, HINTING AT AN UNDERLYING FAULT WITH THE TPMS SENSORS.  *TR",
        "vin": "JS2YC414496"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2013",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552190,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED TWO SAFETY RECALL LETTERS FROM SUZUKI DETAILING A PROBLEM WITH MY AIRBAG SYSTEM THAT MATCHES A PROBLEM THAT I HAVE HAD WITH THE CAR FOR THE LAST TWO YEARS. MY AIRBAG LIGHT IS ALWAYS ILLUMINATED. WHEN I RECEIVED THE FIRST RECALL LETTER, I TOOK MY CAR TO A SUZUKI DEALERSHIP. THEY CONFIRMED THE DEFECT, BUT TOLD ME THAT THE DIAGNOSTIC CODE GENERATED BY THEIR TEST DID NOT MATCH THE ONE THAT SUZUKI HAS SAID THAT THEY ARE COVERING. THE ISSUE IS THE SAME, AND THE FIX IS THE SAME. THE ISSUE CAN BE RESOLVED BY REPLACING A DEFECTIVE COMPONENT IN THE SEAT CUSHION. THIS APPARENTLY REQUIRES THAT THE ENTIRE SEAT BE REPLACED AT A COST OF AROUND $1000. I HAVE CALLED SUZUKI SEVERAL TIMES IN AN ATTEMPT TO GET A RESOLUTION TO THIS PROBLEM, BUT THEY REFUSE TO COVER THE REPAIR. I AM REFUSING TO REPAIR THE ISSUE MYSELF SINCE IT SHOULD BE COVERED, AND I HAVE NO GUARANTEE THAT I CAN BE REIMBURSED FOR THE REPAIR CHARGES. I AM RIGHT NOW RESEARCHING MY LEGAL OPTIONS FOR THIS MATTER SINCE I CANNOT GET SUZUKI TO PAY TO HAVE THE DEFECT REPAIRED. MY ONLINE RESEARCH ON THIS CAR SHOWS THAT THE DEFECT HAS EXISTED IN VARIOUS SUZUKI SX4 MODELS FOR SEVERAL YEARS. ONE ONLINE REVIEW FOR THE 2009 MODEL YEAR NOTED THE DEFECT TO WHICH SUZUKI RESPONDED THAT IT WOULD BE FIXED. APPARENTLY, THEY DID NOT FIX THE PROBLEM. NOW THOUSANDS OF OWNERS ARE DRIVING AROUND WITH DEFECTIVE AIRBAG SYSTEMS. IT SEEMS THAT SUZUKI IS ONLY WILLING TO COVER A FEW OF THEM WHILE LEAVING THE REST OF US TO PAY FOR A VERY COSTLY REPAIR.  *TR",
        "vin": "JS2YC414X96"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2013",
        "dateOfIncident": "09/23/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546004,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "2009 SUZUKI SX4 64,000 AIR BAG LIGHT STAYS ON EVEN THOUGH NEVER IN AN ACCIDENT OR ACTIVATED.  CONTACTED DEALERSHIP AND TOLD ME NOT UNDER WARRANTY.  COSTS WAY OVER $1,000 TO FIX AND UNFORTUNATELY I DON'T HAVE THAT KIND OF MONEY.  I DID SOME RESEARCH AND FOUND AN EXTREMELY HIGH VOLUME OF COMPLAINTS FOR THIS IDENTICAL DILEMMA.  I BELIEVE THERE SHOULD BE A RECALL AND SUZUKI SHOULD RECTIFY THIS PROBLEM AT NO COST TO THE CONSUMER.  WHAT IS IT GOING TO TAKE?  SOMEBODY DYING IN AN ACCIDENT TO GET THEIR ATTENTION?  PLEASE LET'S TAKE CARE OF THIS AND SAVE HUMAN LIVES!  PLEASE LET'S NOT PUT MONEY OVER SAFETY.   *TR",
        "vin": "JS2YB417296"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2013",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543672,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY CAR WAS UNDER WARRANTY,  ON TWO DIFFERENT OCCASIONS  I GOT THE AIRBAG SYMBOL.  NOW THAT MY WARRANTY HAS EXPIRED  NOW THE AIRBAG SYMBOL CAME BACK PLUS THE FRONT PASSENGER SEATBELT UNLOCK  LIGHT SYMBOL,   EVEN WITH THE SEATBELT SECURED.  I WENT TO SUZUKI THEY TOLD ME THAT I HAD TO PAY TO GET MY CAR INSPECTED , I TOLD THEM THAT THIS IS NOT AN ISSUE OF WEAR AND TEAR THIS IS A SAFETY ISSUE.  *TR",
        "vin": "JS2YA413296"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "11/02/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537314,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE AIR BAG SENSOR HAD A PROBLEM EARLY ON..     BROUGHT TO DEALERSHIP THEY RESET...  *TR    AIR BAG LIGT CAME BACK ON, WANTED ME TO PAY TO RESET IT... SO I NEVER DID...    BUT AS I READ OTHER PEOPLE HAVING THE SAME ISSUE WITH A SENSOR THAT SHUTS OFF THE AIRBAG...   AND LEAVES IT OFF WITH NO WAY TO TURN IT BACK ON... AND A DEFECTIVE SENSOR IN THE SEAT AND THEY NOW WANT 1,400 TO REPLACE IT... WHEN IT HAS NEVER FUNCTIONED...",
        "vin": "JS2YB417X95"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2013",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533196,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO SUBMIT A CLAIM ON MY 2009 SUZUKI SX4  DUE TO THE AIRBAG WARNING LIGHT ILLUMINATION  WITH DTC CODE B1318 FAULT.  THIS HAS CAUSED BOTH AIRBAG WARNING LIGHTS, AIRBAG OFF LIGHTS AND SEATBELT LIGHTS, TO COME ON AND NOT GO OFF AT VARIOUS TIMES.  WE WERE SENT A LETTER FROM SUZUKI  ACKNOWLEDGED AN AIRBAG-RELATED ISSUES WITH FRONT PASSENGER SEATS ON THE VEHICLES FOR AN OPEN-CIRCUIT PROBLEM FOR THE SENSOR MAT THAT DETERMINES IF AN ADULT OR CHILD IS SITTING IN THE FRONT SEAT.   I CALLED SUZUKI CUSTOMER SERVICE ON 7/29/13 AND SPOKE TO [XXX].  I INFORMED [XXX] THAT WE PURCHASED THIS VEHICLE DUE TO MY DAUGHTER'S SMALL STATURE IN WHICH SHE IS UNDER 5 FEET TALL AND ONLY WEIGHS 90 POUNDS WHILE HAVING A VALID INDIANA DRIVER?S LICENSE.  HER SMALL STATURE  HAS CAUSED SEVERAL ERRORS WITH THE PASSENGER SIDE AIRBAG WARNING LIGHT TO ILLUMINATE. THE SEAT IS NOT SENSING HER PRESENCE AND SETS OFF THE WARNING LIGHT.  [XXX] ACKNOWLEDGED THAT THERE WAS A PROBLEM BUT WOULD NOT REPAIR THE VEHICLE.  HE STATED THAT AIRBAG ISSUES ARE ONLY COVERED UNDER THE 3 YEAR 36,000 MILE WARRANTY.  I DID NOT AGREE THAT AN ACKNOWLEDGED  ISSUE WITH A SAFETY RELATED COMPONENT FAILURE DUE TO A PERSONS SMALL STATURE IS THE CONSUMERS RESPONSIBILITY.  [XXX] ALSO STATED THAT OUR SMALL STATURE DAUGHTER SHOULD NOT SIT IN THE FRONT PASSENGER SEAT DUE TO THIS VEHICLES ISSUE.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JS2YA413895"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "05/21/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513046,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CHIRPING OF ACCESSORY DRIVE BELT AREAD NOTICED. SUZUKI REPLACED SERPENTINE BELT AND TENSIONER PULLEY OUT OF WARRANTY. SEEMS LIKE SOMETHING IS WRONG WHEN REPLACING A TENSIONER PULLEY BELOW 35000 MILES.  *TR",
        "vin": "JS2YB417896"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/15/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508282,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUZUKI SX-4 HAS SHOWN AN AIRBAG WARNING LIGHT FOR JUST OVER TWO YEARS.  THIS BEGAN JUST SHORTLY AFTER THE WARRANTY PERIOD EXPIRED.  I RESEARCHED THE PROBLEM ONLINE, AND FOUND THAT THIS IS A COMMON ISSUE, AND THAT MOST CASES REQUIRED A REPAIR IN EXCESS OF $1000.  RECENTLY, SUZUKI ISSUED A REPAIR EXTENSION FOR THE AIRBAG SYSTEM, BUT MY SITUATION CONVENIENTLY DOES NOT QUALIFY.  APPARENTLY, THE DIAGNOSTIC CODE IS DIFFERENT FROM WHAT SUZUKI ISSUED THE EXTENSION FOR.  I WAS TOLD THIS MORNING BY A SUZUKI DEALERSHIP THAT I MUST PAY ANOTHER $95 FOR DIAGNOSTICS TO FIND OUT WHAT THE DIAGNOSTIC CODE MEANS.  THIS IS NOT ACCEPTABLE.  I HAVE TRIED TALKING TO REPRESENTATIVES AT SUZUKI'S \"CUSTOMER RELATIONS\" DEPARTMENT, BUT TO NO AVAIL.  THEY INSIST THAT THIS ISSUE IS NOT COVERED UNDER THEIR REPAIR EXTENSION, AND THAT I MUST PAY FOR ADDITIONAL TESTING, AND REPAIR IN ORDER TO RESOLVE THIS ISSUE.  MY ONLINE RESEARCH HAS REVEALED THAT THIS ISSUE IS WIDESPREAD, AND IT SHOULD NOT BE CONSIDERED TO BE A NORMAL WEAR AND TEAR, OUT OF WARRANTY ISSUE.  THIS IS A SERIOUS SAFETY PROBLEM.  *TR",
        "vin": "JS2YC414X96"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "12/13/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503784,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS HE NOTICED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED. THE CONTACT USED A PERSONAL SCAN TOOL WHICH READ THAT THE CATALYTIC CONVERTER FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS TAKEN TO THE DEALER. THE DEALER CLEARED THE CHECK ENGINE LIGHT AND NEVER DIAGNOSED THE FAILURE. APPROXIMATELY 72 HOURS LATER, THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED AGAIN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000. THE CURRENT MILEAGE WAS APPROXIMATELY 23,000.   *TR",
        "vin": "JS2YC417X96"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2013",
        "dateOfIncident": "01/06/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491755,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG DASH LIGHT CAME ON AND STAYED ON.  I TOOK IT TO THE SUZUKI DEALERSHIP.  THEY TOLD ME THERE WAS A RECALL ON THE PASSENGER SEAT SENSOR.  THEY RESET THE LIGHT TO SHUT IT OFF AND CHARGED ME $99.95 LABOR TO DO SO.  I ASKED WHY THIS WAS NOT COVERED UNDER WARRANTY OR THE RECALL.  THEY TOLD ME IT ONLY HAD A 3 YEAR 36,000 MILE WARRANTY.  THEY ALSO RESET AND FIXED THE LIGHT WITHOUT MY AUTHORIZATION TO DO SO SINCE I THOUGHT THIS WOULD BE A WARRANTIED REPAIR.  *TR",
        "vin": "JS2YB413796"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/03/2012",
        "dateOfIncident": "09/03/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473646,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BACK FROM 15 MILE  TRIP TO WALMART, TURNED INTO LONG DRIVEWAY  AND DROVE ABOUT 200 FEET WHEN HEARD NOISE LIKE WE WERE DRAGGING A LARGE WEED ; STOPPED AND SAW THE TIRE HAD FAILED . LOOKED LIKE THE SIDEWALL OF THE TIRE CLOSE TO THE OUTSIDE OF THE RIM HAD SPLIT ALL AROUND THE TIRE. PURCHASED  THESE 4 NEW TIRES ON 6/30/2012 FROM DISCOUNT TIRE  COMPANY IN TYLER, TEXAS  SO THIS TIRE ONLY HAD 3,557 MILES ON IT WHEN THIS HAPPENED. THE TIRE WAS A BFG GFORCE SPORT COMP2, SIZE 205/50ZR17   89W. WILL RETURN TO THE STORE FOR WARRANTY BUT MIGHT HAVE BEEN BAD IF IT HAD HAPPENED ON THE HIGHWAY AT 70MPH RATHER THAN THE DRIVEWAY AT 10 MPH. DID NOT FIND ANY RECALLS ON THIS TIRE IN THE RECALL SEARCH WEBSITE.  *TR",
        "vin": "JS2YC414896"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/27/2012",
        "dateOfIncident": "07/13/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467988,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE ON 6/29/12.  AIRBAG WARNING LIGHT CAME ON TWO WEEKS LATER.  RESEARCH INDICATES THAT MY AIRBAGS ARE NOW DISABLED.  AUTHORIZED SUZUKI DEALER/REPAIR FACILITY IS 125 MILES AWAY.  ON LINE BLOGS AND THIS WEBSITE INDICATE PROBLEMS WITH DISCONNECT IN SEAT SENSOR EMBEDDED WITHIN FRONT PASSENGER SEAT CUSHION.  SUZUKI WILL NOT COVER COSTS TO REPAIR/REPLACE SEAT CUSHION.  SAFETY ISSUE SEAMS TO BE WITH ALL SUZUKI SX4'S. HOW DO WE, THE CONSUMER, GET AMERICAN SUZUKI TO RECALL THIS AIRBAG ISSUE?  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JS2YC414396"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464941,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN DEALER SHOP FOR SAFETY INSPECTION (NEW YORK). DEALER TOLD OF RECALL FOR MIRROR SCREWS, GPS BATTERY, AND PASSENGER SEAT PAD. I INFORMED DEALER OF PASSENGER AIR BAG WARNING LIGHT ON DASH. THE DEALER TOLD ME THEY HAD TO SEND THE GPS BACK TO THE FACTORY, THE SCREWS FOR THE MIRROR WERE ON BACK ORDER AND THE AIR BAG LIGHT WOULD COST ME $85.00 U.S. TO UPDATE THE PROGRAM. ARE AIR BAGS SUPPLIED BY THE MANUFACTURE NOT REQUIRED TO WORK 3000 MILES OUT OF WARRANTY? IF MY WIFE GETS IN AN ACCIDENT AND A PASSENGER DIES BECAUSE OF A DEFECTIVE PROGRAM AM I AT FAULT? WHAT IS MY RECOURSE FOR THIS ASININE SERVICE?",
        "vin": "JS2YB413596"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/17/2012",
        "dateOfIncident": "12/25/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462016,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR'S ISSUE IS THAT AIR BAG LIGHT STAYS ON. WHEN I TOOK THE VEHICLE TO THE LOCAL SUZUKI DEALERSHIP TO FIX AN OTHER ISSUE ON BRAKE SYSTEM, THE AIR BAG LIGHT ALSO HAD STAYED ON.  THE SERVICE MECHANICS SAW THE FRONT PANEL OF MY CAR WHERE THE BRAKE SYSTEM LIGHT AND AIRBAG SYSTEM LIGHTS WERE ON.  HOWEVER, THEY DID NOT WARN ME ABOUT IT.  IF THEY HAD TOLD ME, THE COSTS SHOULD HAVE BEEN COVERED BY WARRANTY.  AT THAT TIME, I DID NOT KNOW WHAT THE AIRBAG LIGHT INDICATED (I.E. AIRBAG WOULD NOT DEPLOY WHEN I GOT AN ACCIDENT) AS A DEALERSHIP WHERE I PURCHASED THE CAR DID NOT WARN ME ABOUT IT ALTHOUGH IT ALREADY STAYED ON WHEN I PURCHASED IT.     THIS IS A SERIOUS SAFETY ISSUE IN TERMS OF QUALITY OF SERVICE TECHNICIANS AND AIRBAG SYSTEM ITSELF OF SUZUKI.  THIS APPEARS TO BE A KNOWN AND WIDE SPREAD ISSUE WITH SUZUKI SX4 AS I HAVE SEEN MULTIPLE COMPLAINTS, WHICH ARE THE SAME AS MY ISSUE, ON SAFECAR.GOVE AND OTHER WEBSITES.  FURTHERMORE, LOOKING AT THOSE INFORMATION, THOSE CARS HAD THE ISSUE AT A QUITE EARLY STAGE OF CAR USAGE (E.G. WHEN PURCHASED AND MILEAGE), WHICH INDICATES THAT THE AIRBAG SYSTEM HAS A DEFECT.      THIS ISSUE COULD LEAD SERIOUS INJURIES OR DEAD SO SUZUKI SHOULD RESOLVE IT AS SOON AS POSSIBLE BY EITHER RECALLING THE AIRBAG SYSTEM OR EXTENDING THE WARRANTY SO THAT CAR OWNERS CAN FIX IT WITH NO COSTS AND SAVER OUR LIVES.  OTHERWISE, CAR OWNERS WHO COULD NOT AFFORD THE COSTS COULD NOT FIX IT.  ALSO, CAR OWNERS WHO ARE NOT FAMILIAR WITH AIRBAG LIGHT/SYSTEM WOULD NOT PAY ATTENTION TO THE DANGEROUS SITUATION.  FROM THAT PERSPECTIVE, SUZUKI SHOULD NOTIFY CAR OWNERS ABOUT THE ISSUE IMMEDIATELY.    I HOPE THAT NHTSA ALSO WOULD TAKE THE ISSUE SERIOUSLY, INVESTIGATE IT AND GIVE THE NECESSARY DIRECTIONS TO SUZUKI TO SAVE OUR NATION OF U.S.A 'S LIVES FROM A DEFECT AIRBAG SYSTEM.  *TR",
        "vin": "JS2YC414196"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/04/2012",
        "dateOfIncident": "05/30/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460510,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT COMES ON AND STAYS ON.  THIS IS APPARENTLY A KNOWN PROBLEM WITH SUZUKI VEHICLES AND THERE ARE MULTIPLE COMPLAINTS ONLINE.  I TOOK THE VEHICLE TO THE LOCAL SUZUKI DEALERSHIP, AND THE AIR BAG SENSOR WAS REPROGRAMMED.  HOWEVER, IT STILL RETURNS A B1311 CODE.  SUZUKI HAS EXTENDED THEIR 3 YR 36000 MI WARRANTY, BUT WILL NOT COVER THIS CODE FOR SOME UNKNOWN REASON. THE ONLY REMEDY IS THE REPLACE THE ENTIRE SEAT BOTTOM AT A COST OF $1,100.    SUZUKI SHOULD RECALL ITS DEFECTIVE SENSORS, THIS IS A SERIOUS SAFETY ISSUE AS I'VE READ THAT THE AIRBAGS MAY NOT OPERATE PROPERLY IF THE SENSOR IS MALFUNCTIONING.  *TR",
        "vin": "JS2YB413595"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/03/2012",
        "dateOfIncident": "06/03/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460417,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE STARTED WAY BEFORE TODAY, BUT THE AIR BAG SENSOR LIGHT CAME ON PROBABLY IN THE FALL OF 2011 ALONG WITH THE PASSENGER SEAT BELT LIGHT. WE MOVED TO A SMALL TOWN AND BEFORE GETTING TWO NEW TIRES WE WENT TO THE SERVICE STATION ONLY TO FIND OUT IT WAS CLOSED BUT I NEED TO GET MY INSPECTION REINSTATED SO I CAN GO TO CLASS AND WORK AND IF SUZUKI KNEW ABOUT ALL THESE ISSUES WITH THE AIR BAG SENSOR ONE WOULD HOPE THAT IT WOULD WARRANT A RECALL. I LOVE MY SX4 BUT EVER SINCE I GOT IT  HAS HAD MANY ISSUES WITH IT, MORE SO THAN MY HUSBANDS CAR WHICH IS A 1999 FORD MUSTANG.  *TR",
        "vin": "JS2YC414096"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2012",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458468,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN FOR A ROUTINE OIL CHANGE. TWO WEEKS LATER, THE AIR BAG AND TIRE PRESSURE WARNING LIGHTS WERE ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE THEY ADVISED THAT THE SENSORS NEEDED TO BE REPLACED FOR BOTH COMPONENTS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 62,000 AND THE CURRENT MILEAGE WAS 63,419.",
        "vin": "JS2YC416396"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2012",
        "dateOfIncident": "03/13/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453694,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 38,000 MILES AND LESS THAN 3 YEARS, MY SUZUKI NEEDS A NEW DRIVE BELT AND TENSIONER ACCORDING TO THE DEALERSHIP. MY WARRANTY JUST RAN OUT. ACCORDING TO RESEARCH I HAVE DONE ONLINE THIS BELT SHOULD LAST AT LEAST 60,000 MILES AND THE TENSIONER MUCH LONGER. THEY ARE QUOTING ME 450.00 TO REPAIR. RIDICULOUS! *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/20/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448554,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT USE TO TURN OFF BY RE FASTING MY SEAT BELT BUT NOW STAYS ON ALL TIME AND MY CAR HAS 40K MILES  AND I CANT GET AN INSPECTION STICKER BECAUSE OF THIS ,I TOOK IT TO REPAIR AND  THE DEALER WANT MORE THAN $2K TO FIX THIS, IN THE MEAN TIME I CAN'T USE THE CAR BECAUSE IS NOT SAFE AND IT HAS NOT INSPECTION STICKER  THIS IS HAPPENING TO ALOT OF PEOPLE IS CLEARLY A FAULT ON SUZUKI,S AIR BAGS SYSTEMS.  *TR",
        "vin": "JS2YC414296"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "01/06/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442883,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE DEALER FOR THE AIRBAG SERVICE LIGHT ON! THEY CHECKED IT AND TURN THAT THE AIRBAG SENSOR FROM THE PASSENGERS SEAT IS DEAD AND WARRANTY WILL NOT COVER IT!!??? I'M VERY DISAPPOINTED WITH THIS, SUZUKI WARRANTY WILL NOT RESPONSE FOR THEIR VEHICLE SECURITY FAILURES?? WHY?? THEY SAID THAT IF I HAVE AN ACCIDENT AIRBAGS WILL NOT COME OFF AND IF I WANT TO HAVE IT REPLACE IT WILL COST 2,000 DOLLARS!!  *TR",
        "vin": "JS2YC416096"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2012",
        "dateOfIncident": "10/30/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443018,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME FROM WORK MY BRAKES FAILED, FOOT WENT TO THE FLOOR AND NO BRAKES, THEN A MOMENT LATER I HAD SOME, I WAS TERRIFIED BUT MADE IT HOME.  MY HUSBAND DID A TEST DRIVE AND TRIED FILLING UP THE FLUID BUT REALIZED IT WAS NOT JUST A FLUID PROBLEM.  I CALLED SUZUKI CUSTOMER SERVICE AND TOLD THEM WE SUSPECTED THE MASTER CYLINDER.  BY NOW THE CAR WAS OUT OF WARRANTY SO THEY TOLD ME TO HAVE IT TOWED TO THE DEALERSHIP WHERE THEY WOULD INSPECT IT AND DECIDE WHETHER TO PAY FOR PARTS OR LABOR OR BOTH OR PERHAPS NOTHING AT ALL.  WITH MY HUSBAND OUT OF WORK WE COULD NOT AFFORD ANY REPAIRS AT ALL NOR COULD WE AFFORD TOWING.  SO OUR MECHANIC COUSIN LOOKED AT THE CAR AND SAID IT WAS DEFINITELY THE MASTER CYLINDER AFTER 27,480 MILES!!  HE REPLACED THE MASTER CYLINDER.  I THEN WROTE A LETTER TO SUZUKI THINKING THEY WOULD WANT TO KNOW THIS FAILED SO SOON, I TOLD THEM THIS SHOULD NEVER HAVE HAPPENED, EXPLAINED WHY I DID NOT GO TO THE DEALERSHIP AND TOLD THEM I HAVE THE PART WE TOOK OFF IF THEY WANTED TO INVESTIGATE.  I HEARD NOTHING BACK.  TODAY I SPOKE TO THEM AFTER GETTING A PHONE CALL CHECKING ON THE ORIGINAL CALL AND ASKING WHAT HAPPENED?  I EXPLAINED TO THE LADY ON THE PHONE EVERYTHING AND SHE SAID BECAUSE I HAD THE CAR DONE LOCALLY I COULD NOT GET ANY REIMBURSEMENT.  I DO NOT AND AM NOT SEEKING REIMBURSEMENT!  I TOLD HER I DON'T WANT ANYTHING FROM SUZUKI BUT THEY SHOULD BE AWARE A PART FAILED SO EARLY AND I HAVE THAT PART FOR INVESTIGATION SHOULD THEY WANT ME TO DROP IT OFF.  THEY DIDN'T CARE! I AM STUNNED!  SO I AM PUTTING IN THIS COMPLAINT IN THE HOPE THAT PERHAPS I SAVE ANOTHER SUZUKI OWNER DYING BECAUSE THEIR BRAKES FAIL DOING 70!!  THANKS.",
        "vin": "JS2YB417295"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/21/2011",
        "dateOfIncident": "11/18/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440836,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT WHILE STOPPED AT A STOP LIGHT, THE ENGINE THROTTLE STARTED TO INCREASE EXCESSIVELY AND THE VEHICLE ACTED AS IF IT WAS GOING TO ACCELERATE ONCE THE CONTACT REMOVED HIS FOOT FROM THE BRAKES. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS INSPECTED THE FAILURE BUT WAS UNABLE TO DIAGNOSE THE PROBLEM. THE MANUFACTURER WAS NOTIFIED WHO SEND OUT AN ENGINEER TO INSPECT THE FAILURE BUT DID NOT INFORM THE CONTACT OF ANY ISSUES. THE FAILURE MILEAGE WAS 45,679.",
        "vin": "JS2YC417296"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2011",
        "dateOfIncident": "12/10/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439357,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE AIRBAG LIGHT IS ON AND TWO DEALERSHIPS LOCALLY HAS SEEN THIS PROBLEM.  $1100 FOR A NEW SEAT.  THIS SOUNDS TO ME THAT THIS NEEDS TO BE LISTED AS A RECALL, NOT TO MENTION HOW MANY OTHER OWNERS HAS THIS SAME ISSUE POSTED ON THE INTERNET.  *TR",
        "vin": "JS2YB417795"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2011",
        "dateOfIncident": "06/06/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406888,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A WINNIPEG STREET, APPROACHING A RED LIGHT @ ABOUT 40/45KM, & CHANGING TO THE LANE ON THE RIGHT, THE STEERING LOCKED.  THIS OCCURRED ON JUNE 6TH, 2011. IT WAS A SUNNY MORNING. HADN'T RAINED FOR AT LEAST 24 HRS. I IMMEDIATELY PUT ON THE HAZARD LIGHT, SHIFTED TO NEUTRAL, RESTARTED & DROVE AWAY WITHOUT FURTHER INCIDENT. THIS HAS NEVER OCCURRED BEFORE;  CAR PURCHASED JULY 2009--CURRENT MILEAGE-12,300 KM.  NO OTHER PROBLEMS.    MY MECHANIC EXAMINED ALL RELEVANT AREAS AND SAID HE FOUND NO WORN PARTS OR DEFECTS.  HE TEST DROVE THE CAR BUT COULD NOT FIND ANYTHING OF CONCERN.  HE STATED THE CAR COMPUTER DID NOT REGISTER THAT ANY SUCH INCIDENT HAD OCCURRED.    HABER SUZUKI TEST DROVE THE CAR ON JUNE 13.  FOUND NO FAULT WITH THE DRIVE; ALSO STATED THAT THE CAR COMPUTER DID NOT INDICATE THAT AN INCIDENT HAD OCCURRED & SAW NO REASON FOR FURTHER INVESTIGATION. THEY INFORMED ME THAT THE CAR HAD STALLED & THAT CAUSED THE STEERING TO LOCK. THE MANAGER THERE STATED THAT NO FURTHER INVESTIGATION WAS NECESSARY. *TR",
        "vin": "KL5TJ66E29B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "02/24/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401380,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "BELT TENSIONER ON 2009 SUZUKI FAILED. THE CAR HAD 18000 MILES ON IT. THE FAILURE WAS A NOISY BELT, WHICH GRADUALLY GREW LOUDER. THE BELT FELL OFF BEFORE I COULD GET IT TO THE DEALER. LOST POWER STEERING AND CHARGING SYSTEM. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401424,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THE FRONT PASSENGER AIR BAG LIGHT CONTINUED TO ILLUMINATE STATING THE AIR BAG WOULD NOT DEPLOY. THERE WAS A DEFECT IN THE SEAT CUSHION WHERE THE AIR BAG SENSORS ARE LOCATED. THE DEALER STATED THAT HE COULD NOT REPROGRAM THE SENSORS INSTEAD THEY HAD TO REPLACE THE ENTIRE SEAT WHICH COST $1,100. THERE ARE NO RECALLS OR WARRANTIES FOR THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, STATED THERE WERE NO RELATED RECALLS AND OFFERED NO ASSISTANCE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 40,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/24/2011",
        "dateOfIncident": "01/22/2011",
        "fire": true,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378512,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 SUZUKI SX4/CONVENIENCE (NA). THE CONTACT STATED THAT THE VEHICLE STALLED AND A FIRE IGNITED UNDER THE HOOD; THE ENTIRE CAR BURST INTO FLAMES. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS CONTACTED WHO ADVISED THE CONTACT TO CALL THE INSURANCE COMPANY. A POLICE REPORT WAS FILED. THE FAILURE AND CURRENT MILEAGES WERE 22,000.",
        "vin": "JS2YB413895"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329081,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE # 1 WILL BE THE ONE WE HAVE A COMPLAINT ABOUT.  VEHICLE # 2 IS THE OTHER INVOLVED PARTY.   VEHICLE # 2 RAN A RED LIGHT AND WAS T-BONED BY VEHICLE # 1.  VEHICLE # 1 IS EQUIPPED WITH FRONT, PASSENGER, SIDE, AND TWO OTHER KINDS OF AIRBAGS.  NO AIRBAGS DEPLOYED.  FRONT DRIVERS SEATBELT DID NOT \"CATCH\", RESULTING IN DRIVER HITTING CHEST ON STEERING WHEEL. *TR",
        "vin": "JS2YB417695"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2010",
        "dateOfIncident": "04/21/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326910,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"AIRBAG IS DISABLED\" LIGHT KEEPS COMING ON  OUR 2009 SUZUKI SX4 CROSSOVER. WE ARE TOLD THAT THIS MEANS THE AIRBAGS ARE NOT FUNCTIONING. THE DEALERS HAVE WORKED ON IT THREE TIMES AND THE UNIT IS SUPPOSED TO BE FIXED. IT JUST CAME ON AGAIN FOR THE 4TH TIME. IT WAS LAST REPAIRED MARCH 17, 2010. *TR",
        "vin": "JS2YB417295"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2010",
        "dateOfIncident": "12/02/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324530,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER 2009, AIR BAG ERROR LIGHT CAME ON AND I TOOK IT TO THE DEALERSHIP AND THE COMPUTER WAS RESET.  IN DECEMBER 2009, I WAS IN AN ACCIDENT WITH A DEER GOING 55 MPH HEAD ON AND THE AIR BAGS DID NOT DEPLOY, WHICH WAS NOTED ON THE ACCIDENT REPORT.  AFTER RECEIVING THE VEHICLE BACK AFTER REPAIRS WERE MADE WITH OEM PARTS, THE AIR BAG ERROR LIGHT CAME ON AGAIN AND I TOOK IT BACK TO THE DEALER, WHO THEN RESET THE COMPUTER AGAIN.  I AM CONCERNED. *TR",
        "vin": "JS2YB413395"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/06/2009",
        "dateOfIncident": "12/03/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10294631,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A 2009 SUZUKI SX4 CROSSOVER AND WAS RECENTLY IN A COLLISION. I WAS GOING APPROXIMATELY 40 MPH IN A FORWARD DIRECTION WHEN ANOTHER VEHICLE CROSSED FROM ONE PARKING LOT ON THE LEFT SIDE OF THE ROAD TRYING TO GET INTO A PARKING LOT DIRECTLY ACROSS TO MY RIGHT. I APPLIED THE BRAKES BEFORE WE COLLIDED, BUT STILL ENDED UP COLLIDING WITH THE OTHER VEHICLE IN A T-BONE POSITION. I HAVE FRONT, PASSENGER, AND SIDE SKIRT AIRBAGS IN MY VEHICLE AND NOT ONE OF THE AIRBAGS DEPLOYED. THE FRONT ENGINE COMPARTMENT TO MY VEHICLE WAS COMPLETELY SMASHED IN AND THE OTHER VEHICLE HAD EXTENSIVE DAMAGE TO THE PASSENGER SIDE BETWEEN THE FRONT AND REAR DOORS. BOTH MY PASSENGER AND I WERE WEARING SEATBELTS, SO WE WERE WIPED FORWARD AND BOTH HAD OUR HEADS COLLIDE WITH THE HEADRESTS OF OUR SEATS. WE WERE BOTH TAKEN ON BACKBOARDS BY AMBULANCE TO THE LOCAL HOSPITAL. BOTH POLICE OFFICERS AND THE EMT'S AT THE SCENE STATED THAT THE AIRBAGS SHOULD HAVE DEPLOYED WITH SUCH EXTENSIVE DAMAGE. *TR",
        "vin": "JS2YB413096"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "11/25/2009",
        "fire": true,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294059,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT AN OIL CHANGE AT GOSS SUZUKI IN MADISON, TENNESSEE. APPROXIMATELY 1.5 MILES DOWN THE ROAD FROM THE DEALERSHIP. MY BRAKES WENT OUT AND THE CAR WAS ENGULFED IN FLAMES UNDERNEATH. WHEN I GOT THE CAR STOPPED FINALLY, THE HOOD BURST INTO FLAMES. *TR",
        "vin": "JS2YC414496"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/27/2009",
        "dateOfIncident": "10/16/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10289995,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 SUZUKI SX4. WHILE DRIVING  20 MPH THE STEERING COLUMN LOCKED. AS A CONSEQUENCE SHE CRASHED INTO A DITCH AND WAS TAKEN TO THE HOSPITAL DUE TO HER INJURIES. THE VEHICLE WAS TOWED TO THE DEALER. A POLICE REPORT IS AVAILABLE. THE DAMAGE TO THE VEHICLE WAS OVER $17,000 AND WAS IN THE PROCESS OF BEING REPAIRED  BY THE DEALER. THE TECHNICIAN COULD NOT IDENTIFY THE CAUSE OF THE FAILURE. THE FAILURE MILEAGE WAS 945.",
        "vin": "JS2YB417096"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2009",
        "dateOfIncident": "10/14/2008",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283309,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 SUZUKI SX4. THE CONTACT STATED THAT WHEN ANYTHING WAS PLACED IN THE DRIVERS SIDE PASSENGER SEAT, THE AIR BAG LIGHT ILLUMINATED WHICH INDICATED THAT THE AIR BAG SYSTEM HAS BEEN DEACTIVATED. THE DEALER INSPECTED THE VEHICLE AND DETERMINED THAT THE BATTERY FAILED. THE BATTERY WAS REPLACED AND THE COMPUTER SYSTEM WAS RESET. THE CONTACT HAS CONTINUOUSLY EXPERIENCED  FAILURES WITH THE AIR BAG SYSTEM AND HAS HAD THE COMPUTER SYSTEM RESET MULTIPLE TIMES. THE MANUFACTURER HAS NOT OFFERED ANY RESOLUTIONS FOR THE FAILURES. THE DEALER ADVISED THE CONTACT THAT HE SHOULD NOT PLACE ANYTHING IN THE DRIVERS SIDE PASSENGER SEAT. THE CONTACT STATED THAT THE FAILURE COULD RESULT IN A CRASH AND THE AIR BAGS WILL NOT DEPLOY. THE FAILURE MILEAGE WAS 50 AND THE CURRENT MILEAGE WAS 18,000.",
        "vin": "JS2YB417095"
    }
]