[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157293,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1989 FORD F-250. WHILE DRIVING APPROXIMATELY 10 MPH, ONE OF THE FUEL TANKS OVERFLOWED WITHOUT WARNING AND CAUSED FUEL TO LEAK FROM THE FILLED TUBE. THE CONTACT CALLED SHULTS FORD LINCOLN AT 724-934-2388 (LOCATED AT 10401 PERRY HWY, WEXFORD, PA 15090) AND WAS INFORMED THAT THERE WAS NO RECALL FOR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "1FTHX26G0KK"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "04/25/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090005,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTENT OF REPORTING THIS ISSUE IS TO STRESS THE IMPORTANCE OF OLDER VEHICLES (PAST THE 15 YEAR MARK) HAVING RECORD AND STATUS OF SAFETY RECALLS.  IT IS JUST AS VITAL FOR OLDER VEHICLES TO HAVE RECORD AS IT IS FOR NEWER VEHICLES.  EVERYONE WANTS SAFE VEHICLES OUT ON THE ROAD. AS MY VIN INDICATES, I PURCHASED A 1989 FORD F250 6 MONTHS AGO AND AM FIXING PROBLEMS THAT I FOUND ARE ON A RECALL.  THE PROBLEM IS I CANNOT FIND OUT THE STATUS OF THOSE RECALLS.  THIS SYSTEM IS FLAWED.  PLEASE RESPOND IF THERE IS ANYWAY I CAN FIND THE INFORMATION.  I WOULD LIKE TO KNOW MYSELF AND MY FAMILY ARE IN A SAFE VEHICLE.  THANK YOU.",
        "vin": "1FTEF25N7KP"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/25/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838707,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PRIMARY FUEL TANK OVERFLOWS AFTER FILLING SECONDARY TANK. I HAVE READ THERE WAS A RECALL ON THIS TYPE OF ISSUE FOR THIS TRUCK.",
        "vin": "1FTHF25H2KL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "01/21/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678275,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG NO INDICATION OF ANY PROBLEM AND ENGINE STOPPED.  TRIED STARTING SEVERAL TIMES AND NOTICED IGNITION SWITCH SEEMED VERY STIFF AND WOULD NOT FIRE OFF STARTER, LIGHTS WORKED, DOOR BELL WORKED, NO IGNITION.  INSPECTED ENGINE COMPARTMENT AND DID NOT NOTICE ANYTHING UNUSUAL, BATTERY CABLES WERE TIGHT, CHECKED RADIATOR AND FOUND IT WORKING JUST FINE.  AFTER A WHILE TRIED IGNITION AGAIN AND STARTED, DROVE A COUPLE MORE MILES TO HOME SAFELY.  NEXT AM COULD NOT GET THE IGNITION TO WORK AT ALL, IGNITION SWITCH FELT LIKE IT WAS BROKEN WHEN KEY TURNED TO THE MAXIMUM POSITION...  RECONFIRMED BATTERY TESTED GOOD BUT BOUGHT A NEW BATTERY ANY WAY, INSTALLED AND STILL NO RESPONSE FROM IGNITION.  *TR",
        "vin": "1FTHX25G9KK"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL YEARS AGO AFTER FILLING THE REAR TANK OF MY DUAL TANK 1989 FORD F250, I STOPPED AT A RED LIGHT AND SOON NOTICED FUEL POURING OVER THE LEFT REAR TIRE.  I FIGURED IT WAS DUE TO A LEAK IN THE FUEL FILLER NECK AND STOPPED USING THE REAR TANK FOR THE NEXT 5 OR 6 YEARS ONCE BURNING OUT ALL THE FUEL.  A FEW MONTHS AGO I DECIDED TO GET A FEW THINGS FIXED ON THE TRUCK AND ASKED THE MECHANIC TO SEE IF HE COULD ISOLATE THE LEAK IN THE REAR TANK. SURPRISINGLY AFTER DOING A PRESSURE AND SMOKE CHECK, HE FOUND NO LEAK AND RECOMMENDED I PUT A FEW GALLONS IN AND SEE HOW THE TRUCK RAN.  THE TRUCK RAN FINE FOR A FEW WEEKS BUT, WHILE RUNNING ON THE FRONT TANK, I HAD SOME HESITATION PROBLEMS AND TOOK THE VEHICLE BACK TO THE SHOP.  THE MECHANIC CLEANED THE FUEL INJECTORS AND CHANGED THE FUEL PUMP IN THE REAR TANK (BASED ON A LOW PRESSURE READING) IN ORDER TO TRY TO ISOLATE THE PROBLEM POSSIBLY TO ONE OF THE TANKS.  HE ALSO CHANGED THE FUEL QUANTITY SENSOR SINCE IS HAD FAILED YEARS AGO.  I FILLED THE REAR TANK (18 GALLONS TOTAL) AND AFTER DRIVING A 30-MILE ROUND TRIP FOR SOME CHRISTMAS SHOPPING, NOTICED THE REAR FUEL GAUGE ONLY SHOWED 3/8 OF A TANK.  I FIGURED I HAD RECEIVED A BAD FUEL SENSOR AND DECIDED TO FILL THE TANK TO MAKE SURE.  THE TRUCK TOOK A TOTAL OF 7.5 GALLONS OF FUEL.  SINCE AT NO TIME DID I NOTE ANY FUEL LEAKAGE, I FIGURED THE FUEL HAS FLOWED TO THE FRONT TANK.  DOING SOME RESEARCH ON THE WEB I FOUND NHTSA RECALL 91V146 (FORD #91S39) WHICH DESCRIBED THE PROBLEM TO A TEE.  THE RECALL INCLUDES 1989 F250 PICKUPS BUT ONLY THOSE SOLD AFTER FEBRUARY 28, 1989.  I PURCHASED MINE IN NOVEMBER 1989; HOWEVER, I HAVE A PROBLEM WITH THE EXACT SYMPTOMS AND SAFETY ISSUES.  I RECOMMEND THE NHTSA BROADEN ITS RECALL 91V146 TO INCLUDE 1989 F-250S PURCHASED PRIOR TO THE FEBRUARY 1989 START DATE TO PREVENT A POSSIBLE SAFETY INCIDENT OR WORSE.  THANK YOU.  *TR",
        "vin": "1FTEF26Y7KN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2013",
        "dateOfIncident": "06/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP CONTINUES TO RUN AFTER IGNITION SWITCH IS TURNED OFF.  THIS CAUSES EVENTUALLY THE BATTERY TO GO DEAD.  I CAN HEAR THE FUEL PUMP CONTINUE AFTER IGNITION IS TURNED OFF AND PUMP CHANGES PITCH IN SOUND WHEN SWITCHING BACK AND FORTH FROM FRONT FUEL TANK TO REAR.  *TR",
        "vin": "1FTHF25G0KP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503487,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT AN INTERSECTION WAITING FOR TRAFFIC TO CLEAR SO I COULD PULL ON TO THE HIGHWAY, I SMELLED GAS. I LOOKED IN MY SIDE MIRROR AND SAW GASOLINE GUSHING OUT OF MY FRONT FUEL TANK. IT WAS OBVIOUSLY UNDER PRESSURE BUT THE FUEL DOOR FORTUNATELY KEPT IT FROM SPRAYING ACROSS THE ROAD. I APPEAR TO HAVE THE SAME PROBLEM THE OTHER TWO COMPLAINT FILERS HAVE HAD AND REFERENCED THE SAME FORD RECALL CAMPAIGN OF  91V146000. IF I AM EVER ABLE TO GET THROUGH TO THE NUMBER FOR THE FORD RECALL (313) 446-4654 I AM SUPPOSED TO REFERENCE RECALL NUMBER 91S39. I AM THE ORIGINAL OWNER OF THIS TRUCK AND HAVE ONLY 22000 TOTAL MILES ON IT SO THE FAILURE CANNOT BE DUE TO MILEAGE. THIS RECALL APPLIED TO QUITE A FEW MODELS OF FORD FOR 1989. THE TWO PRIOR COMPLAINTS HAVE APPARENTLY BEEN IGNORED-------PROBABLY NOT ENOUGH 1989'S AROUND TO REALLY WORRY ABOUT UNLESS SOMEBODY GETS KILLED AT WHICH TIME I HOPE SOMEBODY REMEMBERS THIS WEBSITE.  *TR",
        "vin": "1FTHF26G3KP"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2012",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1989 FORD F-250. THE CONTACT STATED THAT WHILE TRAVELING 60 MPH, THE VEHICLE SUDDENLY STALLED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND WAS NOT TAKEN TO A MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NHTSA 91V146000 (FUEL SYSTEM, GASOLINE:STORAGE:AUXILIARY TANK:SELECTOR DEVICES). THE FAILURE AND CURRENT MILEAGES WERE 448,021.",
        "vin": "1FTHF25G7KP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2012",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476182,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "1989 FORD F250. CONSUMER WRITES IN REGARDS TO SAFETY RECALL CONCERNING FUEL RESERVOIR *TGW  THE CONSUMER STATED FORD MOTOR COMPANY  REFUSED TO HONOR A SAFETY RECALL. FORD INFORMED THE CONSUMER, THEY COULD NOT FIND HIS VEHICLE IDENTIFICATION NUMBER IN THEIR RECORDS AND THERE WAS NOTHING THEY COULD DO. THE CONSUMER STATED EARLIER THIS YEAR. WHILE STOPPED AND IDLING AT A TRAFFIC LIGHT SIGNAL, GAS FLOWED PROFUSELY FROM THE FRONT TANK FILLER CAP ONTO THE SIDE OF THE VEHICLE, AND  THE GROUND BENEATH THE BED THAT SURROUNDED THE REAR WHEELS. HE SWITCHED THE TANK SELECTOR FROM THE FRONT TANK TO THE REAR TANK AND RETURNED HOME. HE RESEARCHED THE PROBLEM AND DISCOVERED IT WAS NOT UNIQUE TO HIS VEHICLE, IN WHICH FORD HAD ISSUED A SAFETY RECALL. RECALL # 91V146000",
        "vin": "1FTHF25H4KN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/24/2012",
        "dateOfIncident": "10/29/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467463,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "1989 FORD F250. CONSUMER STATES RUBBER PEELED OFF TIRE *TGW  THE CONSUMER STATED THE TREAD PEELED OFF THREE OF THE FOUR NEW TIRES HE PURCHASED. THE CONSUMER STATED THE INCIDENT HAPPENED ON OCTOBER 29, 2011, WHILE TRAVELING APPR 65-70 MPH. THE CONSUMER STATED HE HEARD A LOUD NOISE AS THE RIGHT REAR TIRE TREAD BEGAN TO PEEL AWAY FROM THE TIRE AND DAMAGED HIS VEHICLE IN THE PROCESS. SHORTLY THEREAFTER, THERE WAS A LOUD BANG AND THEN THE TIRE BLEW OUT. JP",
        "vin": "1FTHX25M1KK"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2011",
        "dateOfIncident": "11/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436553,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 1989 FORD F250 THAT I RECENTLY PURCHASED ON NOVEMBER 14TH 2011 AND WHEN I GOT HOME I SMELLED GASOLINE, UPON FURTHER INVESTIGATION I SAW FUEL RUNNING OUT OF THE FRONT FUEL TANK FILLER NECK PAST THE GAS CAP. I WAS USING THE REAR TANK AT THE TIME. I WENT ONLINE TO SEE IF ANYONE ELSE HAD ENCOUNTERED THIS PROBLEM AND FOUND THAT THERE WAS ACTUALLY A SAFETY RECALL ISSUED ON THIS PROBLEM FOR THIS TRUCK. I LOOKED UP THE VIN ON FORDS' WEBSITE AND IT SAID THERE WERE NO RECALLS ASSOCIATED WITH MY TRUCK, MY THOUGHT WAS THAT IT WAS PROBABLY BECAUSE IT WAS SO OLD IT WAS NO LONGER IN THEIR DATABASE. I CALLED MACE FORD IN TERRE HAUTE AND SPOKE WITH LANDIS IN THE SERVICE DEPARTMENT ON 21 NOVEMBER 2011 HE CHECKED AND SAID THERE WASN'T ANYTHING THEY COULD DO AND REFERRED MY TO THE FORD CUSTOMER SERVICE NUMBER WHICH I CALLED AND SPOKE TO [XXX] ALSO ON 21 NOVEMBER 2011, HE ALSO TOLD ME IT WAS NOT LISTED AND CHECKED WITH HIS SUPERVISOR'S AND THEY SAID IT DID NOT APPLY TO MY TRUCK. WHAT I DON'T UNDERSTAND IS MY TRUCK MEETS ALL OF THE CRITERIA THAT I CAN FIND LISTED IN THE FORD SAFETY RECALL NUMBER 91S39. IT IS A 1989 FORD F250 WITH DUAL FUEL TANKS AND ACCORDING TO THE DOOR PLATE IT WAS MANUFACTURED IN APRIL OF 1989. CAN YOU HELP ? THE SYMPTOMS ARE ACTUALLY AS DETAILED IN THE RECALL, THE BEING THAT FUEL IS FORCED FROM ONE FUEL TANK INTO ANOTHER OVERFLOWING THE TANK.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FTEF25N9KL"
    }
]