[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Aprilia USA, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899480,
        "products": [
            {
                "manufacturer": "Aprilia USA, Inc.",
                "productMake": "APRILIA",
                "productModel": "RSV4 R",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY MOTORCYCLE IS 6 YRS OLD IT ONLY HAS <3K MILES.  THERE IS ZERO STOPPING ABILITY OF THE REAR BRAKE.  I HAVE FLUSHED THE SYSTEM TO MANUFACTURE SPECIFICATIONS AND HAVE BLEED IT NUMEROUS TIMES.  I HAVE TRIED NUMEROUS BRANDS OF BRAKING FLUID TO SEE IF RESULTS VERY, BUT TO NO AVAIL.  IT WILL STOP THE BIKE WHILE ON A REAR STAND BUT IF THE BIKE IS MOVING EVEN AT SLOW SPEEDS OF < 20 MPH THE REAR BRAKE IS INEFFECTIVE AND NON-EXISTENT, LET ALONE AT NORMAL TRAFFIC SPEEDS.  I HAVE SPOKE WITH NUMEROUS MOTOTCYCLE MACHANICS WHO HAVE STATED THAT APRILIA HAS COMMONLY HAD THIS BRAKE ISSUE EVEN ACROSS DIFFERENT MODELS.  THIS IS UNEXCEPTABLE!  WHILE A MAJORITY OF MY BRAKING IS DONE USING THE FRONT BRAKES(80/20) IN EMERGENCY OR PANIC BRAKING SITUATIONS THE REAR BRAKE IS IMPORTANT.  I WAS ALMOST INVOLVED IN AN ACCIDENT DUE TO THE POOR BRAKING PERFORMANCE OF THE REAR BRAKE. WHILE RIDING IN WET CONDITIONS I NEEDED TO STOP AT SLOW SPEEDS FOR A STOP LIGHT.  MY BRAKING DISTANCE WAS ALREADY EXTENDED DUE TO WET CONDITIONS BUT WHEN I FINALLY WAS ABLE TO STOP I WAS ALREADY IN TO THE INTERSECTION AT A BUSY TRAFFIC LIGHT.  WHEN I SPOKED I WAS IN THE CROSS TRAFFICS LANE, THIS WAS THE SAFER OPTION, RATHER THAN RUNNING THE LIGHT OR GRABBINICAL A HANDFULL OF FRONT BRAKE.  APRILIA NEEDS TO CORRECT THIS ISSUE BY CHANGING TO A LARGER AND MORE SUFFICIENT REAR BRAKE MASTER CYLINDER THAT CAN DELIVER STRONGER BRAKING POWER FOR THIS MOTORCYCLE .  THIS SAFETY ISSUE CAN NOT GO OVERLOOKED OR UNCORRECTED.  THIS NEEDS TO BE FIXED BEFORE IT CAUSE SERIOUS BODY INJURY OR DEATH.  ISSUES LIKE THIS ON MOTORCYCLES IS NO LIGHT MATTER.  I HAVE PUT A LOT OF TIME AND MY OWN MONEY TO HELP INSURE MY SAFETY BUT SO FAR THE ONLY SAFE BET IS TO KEEP IT OFF THE ROAD UNTIL APRILIA ADDRESSES THIS CONCERN.",
        "vin": "ZD4RKC019AS"
    }
]