[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441283,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Audi Q7. The contact stated that after having the car washed, the radio was operating on and off independently. The contact mentioned that every time that it rained the failure recurred and the heated seat was operating on and off independently. The vehicle was taken to the dealer where it was diagnosed that the amplifier needed to be replaced. The vehicle was repaired. The manufacturer was notified of the failure. The approximate failure mileage was 76,000.",
        "vin": "wa1lyafe0ad"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406727,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE IS SIMILAR TO NHTSA CAMPAIGN ID 16V660000, THE FUEL CAP FLANGE HAS BUTYL TAPE ON IT AND HAS STARTED LEAKING FUEL. THE GARAGE HAS A STRONG FUEL ODOR AND IS A FIRE HAZARD. THE PART IS ABOUT 250 DOLLARS, DIAGNOSIS WAS 150 AND INSTALLATION IS ABOUT 1.5 HOUR WHICH IS A GRAND TOTAL OF 750 DOLLARS. WHY IS MY VIN NOT IN THE RECALL, IF ITS A DEFLECTIVE PART, RECOGNIZED BY AUDI.",
        "vin": "WA1LYAFE5AD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384863,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP CRACKED AND WAS LEAKING FUEL ON MY GARAGE FLOOR WHICH COULD CASE A CATASTROPHIC FIRE.",
        "vin": "WA1LYAFE9AD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373217,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 AUDI Q7 WITH 59K MILES ENGINE LIGHT CAME ON AND IT WAS STARTING PRETTY ROUGH. I BROUGHT IT 200 YARDS UP THE STREET TO MY LOCAL GARAGE AND THEY SAID IT'S A BIGGER DEAL AND TO BRING IT TO THE DEALERSHIP. THEY TOLD ME IT'S A TIMING CHAIN ISSUE AND I LOOKED IT UP AND SAW THE CLASS ACTION LAWSUIT, RECALL, AND SETTLEMENT ON MOST AUDI'S - BUT SEEMED TO EXCLUDE Q7. RESEARCHING, I FOUND OUT AUDI DECIDED IN 2008 TO CHANGE THEIR TIMING CHAIN. EVEN THO I SHOWED THEM THE MAINTENANCE RECORDS OF OIL CHANGES LESS THAN 10K MILES, THEY DECLINED TO PICK UP THE COST OF THE REPAIR.THIS IS CLEARLY A RECALL ISSUE.",
        "vin": "WA1LYAFE4AD"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "03/11/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339441,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 AUDI Q7 HAS A SERIOUS BRAKING ISSUE.  WHEN THE ENGINE IS STARTED, IF YOU PUT THE VEHICLE INTO DRIVE, IT WILL ROLL FORWARD AND THE BRAKE WILL NOT STOP THE ROLLING.  YOU MUST WAIT ROUGHLY 1 MINUTE FOR THE VEHICLE TO NOT ROLL.  THE TIME IS SHORTER IN THE SUMMER, AND LONGER IN THE WINTER.  THE BRAKES DO NOT WORK, AND IT IS AS IF THE COMPUTER HAS A GLITCH.  I WILL DEPRESS THE BRAKE, AND THE VEHICLE WILL ROLL FORWARD ABOUT 10 FEET.  THIS HAPPENS IN BOTH REVERSE AND FORWARD.      MY CONCERN IS THAT ONE COULD START THE CAR, IMMEDIATELY PUT IT INTO GEAR, AND HIT A PENDESTRIAN, CHILD, OR OTHER PROPERTY AND NOT BE ABLE TO STOP THE CAR UNLESS THEY INTUITIVELY KNOW TO PUT THE CAR IN NEUTRAL OR PARK, WHICH MOST DRIVERS WILL NOT DO.      I AM WILLING TO SHOW THIS TO AN NHTSA REPRESENTATIVE.  I BELIEVE THIS NEEDS TO BE INVESTIGATED AND AUDI NEEDS TO RECALL THESE CARS FOR A PROPER FIX.      I CALLED AUDI'S NORTH AMERICAN HOTLINE TO REPORT THIS, AND THE RECEPTIONIST DID NOT PUT ME IN TOUCH WITH A MANAGER OR A SAFETY REPRESENTATIVE.  SHE SAID THE CAR NEEDS TO GO TO THE SHOP AND BE REPAIRED.  MY AUTO MECHANICS SAY THEY CAN'T REPAIR THIS, AND IT IS A MANUFACTURER PROBLEM.  AUDI NORTH AMERICA STAFF SHOULD HAVE TAKEN MY INFORMATION, PASSED IT TO A MANAGER, AND CONTACTED ME, BUT THEY REFUSED TO, SAYING IT WAS A MECHANICAL ISSUE WITH MY VEHICLE.  I HAVE NO OTHER OPTIONS BUT TO CONTACT NHTSA.      I HAVE OWNED THIS CAR SINCE 2014, I FIRST NOTICED THE PROBLEM THEN, AND ADAPTED TO THIS PROBLEM.  I SHOULD HAVE TOLD YOU MUCH SOONER THAN NOW.  I APOLOGIZE.  I KNOW HOW TO DEAL WITH THIS PROBLEM, BUT IF IT IS IN ANY OTHER AUDIS, THERE MAY BE PEDESTRIAN INJURIES OR DEATHS.",
        "vin": "WA1LYAFE3AD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289828,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT NIGHT ON THE HIGHWAY IN RAIN WITH WIPERS ON, THE PASSENGER SIDE WIPER ARM SNAPPED IN HALF CREATING A DANGEROUS SITUATION. REMAINING CALM, DROVE TO MY DESTINATION WHERE I SAW THE WIPER ARM SNAPPED OFF.",
        "vin": "WA1LYAFE4AD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255936,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q7. THE CONTACT NOTICED A STRONG FUEL ODOR NEAR THE REAR DRIVER'S SIDE DOOR. THE CONTACT MENTIONED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V660000 (FUEL SYSTEM, GASOLINE) IN 2016. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. AUDI ALBUQUERQUE (8900 PAN AMERICAN FWY NE, ALBUQUERQUE, NM 87113,  (505) 821-4000) WAS CONTACTED AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN THE SECOND RECALL FOR THE FAILURE. THE DEALER STATED THAT THE VEHICLE NEEDED TO BE DIAGNOSED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 135,000.",
        "vin": "WA1LYAFE9AD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230008,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONERY IN HEAVY RAIN. TURN WINDSHIELD WIPERS ON AND WITHIN A FEW SECONDS PASSENGER SIDE WIPER ARM BROKE IN HALF.",
        "vin": "WA1MYAFE9AD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088725,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q7. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE FAILED TO ACCELERATE AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT COASTED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED AND WAS ABLE TO DRIVE AS INTENDED. THE VEHICLE WAS TAKEN TO AUDI OF LYNBROOK (855 SUNRISE HWY, LYNBROOK, NY 11563, (516) 887-5300) WHERE IT WAS DIAGNOSED THAT THE AIR FILTER WAS CLOGGED AND THERE WAS A TEAR IN THE TURBO THAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 119,000.",
        "vin": "WA1LMAFE6AD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071784,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DECELERATES RAPIDLY WHILE DRIVING EVEN THROUGH YOU HAVE PRESSURE ON THE ACCELERATOR. THEN FEW JERKS HAPPEN AND CAR RETURNS BACK TO NORMAL ACCELERATION. THIS WHOLE PROCESS REPEATS INTERMITTENTLY. THIS FIRST HAPPENED ON A BUSY FREEWAY. THEN THIS HAS BEEN REPEATING FREQUENTLY. AUDI IS UNABLE TO FIGURE OUT THE PROBLEM AND ARE SUGGESTING REPLACING THE WHOLE FUEL SYSTEM WHICH MAY POTENTIALLY FIX THE PROBLEM. THEY ARE NOT SURE. I AM NOT SURE IF THIS IS A MANUFACTURING ISSUE WHICH CAN START HAPPENING TO OTHER VEHICLES. BUT THIS IS DEFINITELY A DANGEROUS SAFETY ISSUE.",
        "vin": "WA1LYAFEXAD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "04/21/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979868,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON RT 93 SOUTHBOUND IN MA DURING A HEAVY RAINSTORM THE PASSENGER SIDE WIPER ARM SNAPPED OFF COMPLETELY AT THE BASE.  I WAS ABLE TO CONTINUE DRIVING AFTER THE INITIAL SHCCK OF THE ARM BREAKING OFF.",
        "vin": "WA1CYAFE8AD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2015",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735110,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q7. WHEN THE BRAKE PEDAL WAS DEPRESSED AND RELEASED, THERE WAS AN ABNORMAL ODOR OF FUEL INSIDE THE VEHICLE. THE FAILURE RECURRED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP CAP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.  MA 10/16/15     UPDATED 11/28/217*CN",
        "vin": "WA1LYAFE5AD"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630260,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FAMILY VEHICLE IS A 2010 AUDI Q7 TDI, PRESTIGE EDITION.  THIS IS THE VEHICLE WE ALWAYS TAKE WITH THE CHILDREN, AGES 1 AND 2.  RECENTLY, WE HAD AN UNKNOWN BATTERY DRAIN, AND SO TODAY I TOOK THE VEHICLE TO THE DEALERSHIP TO BE SERVICED.  APPROXIMATELY 20 MINUTES INTO THE DRIVE, I HEARD WHAT SOUNDED LIKE A GUNSHOT INSIDE THE VEHICLE.  I THEN REALIZED THE SUNROOF HAD EXPLODED FROM THE INSIDE AND THERE WAS GLASS EVERYWHERE.  THERE WERE NO ROCKS, AND ONLY A FEW VEHICLES A SAFE DISTANCE AHEAD OF ME - EVEN SO, A ROCK WOULD HAVE HAD TO TRAVEL STRAIGHT UP AND THEN STRAIGHT DOWN TO SHATTER THE SUNROOF IN THIS MANNER.  THERE WERE NO BRIDGES OR UNDERPASSES.  I WAS ABLE TO MAINTAIN CONTROL OF THE CAR, DESPITE HAVING SHATTERED GLASS ALL OVER MYSELF, IN MY HAIR, COFFEE MUG, ETC.  THIS IS PROBABLY THE ONLY TIME I'VE DRIVEN THE VEHICLE WITHOUT THE CHILDREN, AND AM ABSOLUTELY THANKFUL THEY WERE NOT IN THE VEHICLE AS BOTH CAR SEATS WERE COVERED IN GLASS.  THE CAR WILL HAVE TO BE DETAILED BEFORE THEY CAN RIDE IN IT AGAIN DUE TO THE SHEER VOLUME OF BROKEN GLASS.  I TOOK PHOTOS OF THE DAMAGE, AND THE REMAINING GLASS BENDED UPWARD ON THE EDGE OF THE DAMAGE - INDICATING IT BROKE FROM THE INSIDE-OUT.  ONE DOES AS MUCH RESEARCH AS HUMANLY POSSIBLE BEFORE PURCHASING A FAMILY VEHICLE BUT AN EXPLODING SUNROOF (PANORAMIC) IS NOT SOMETHING ONE WOULD ANTICIPATE.  THIS SHOULD NEVER HAVE HAPPENED - NOT EVEN ONCE - AND IS EXTREMELY DANGEROUS.    *TR",
        "vin": "WA1VMAFE0AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "06/14/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUDI Q7 2010. JUNE 2013, MY HUSBAND, 4 YR OLD SON AND I WERE DRIVING ON THE FREEWAY GOING WITH THE FLOW OF TRAFFIC. THE CAR STARTED SHAKING VIOLENTLY AND DECELERATED TO 20 MILES PER HOUR. MY HUSBAND PUSHED THE GAS PEDAL OVER AND OVER AND THE CAR WOULD NOT SPEED UP. LUCKILY NO ONE WAS HURT, HOWEVER WE WERE VERY SCARED. WE WERE ABLE TO PULL TO THE EMERGENCY LANE AND MAKE IT TO THE AUDI DEALERSHIP CLOSE BY.   JANUARY 2014, I WAS HEADING TO PICK UP MY SON FROM SCHOOL AND THE CAR STARTED SHAKING VIOLENTLY AGAIN- THIS TIME WORSE THEN BEFORE AND CAME TO A COMPLETE STOP IN THE MIDDLE OF TRAFFIC. THE STEERING WHEEL LOCKED UP AND I WAS STUCK. THE POLICE WERE CALLED BECAUSE I WAS NOT IN A SAFE PLACE AND THE CAR HAD TO BE TOWED TO THE DEALERSHIP. DEALER STATED THAT THEY FOUND FAULT IN THE FUEL SYSTEM, METAL SHAVINGS IN THE FUEL FILTER IN ADDITIONAL TO LOW FUEL PRESSURE. ALSO CONFIRMED METAL SHAVINGS IN THE N290 VALVE. THEY HAD TO GET AUTHORIZATION FROM GERMANY TO REPLACE ENTIRE FUEL SYSTEM.  JULY 2014- YES IT HAPPENED AGAIN. THIS TIME MY HUSBAND AND SON WERE HEADED TO GO ON A FATHER-SON CAMPING TRIP AND RIGHT BEFORE THEY LOST ALL CELL SERVICE THE CAR STARTED VIOLENTLY SHAKING AGAIN AND DECELERATED. MY HUSBAND LEFT THE CAR IN A SAFE PLACE AND HAD FRIEND COME GET THEM. THE CAR IS A LEMON. I HAVE ASKED THAT AUDI AMERICA TO REPLACE THE CAR AND THEY SENT A TECHNICIAN TO THE DEALERSHIP WHO REPLACED THE FUEL FILTER AGAIN AND HAS DECIDED THE CAR IS REPAIRED AND SAFE TO DRIVE. THIS IS AFTER THE MANAGER OF THE SERVICE DEPARTMENT TOLD AUDI AMERICA THAT THE CAR IS NOT SAFE AND RECOMMENDED THEY REPLACE THE CAR. HE SAID \" I WOULDN'T LET MY WIFE DRIVE YOUR CAR\".   THIS HAPPENED TO A FRIEND OF MINE WITH AN AUDI Q7 AND AUDI HAD TO BE FORCED TO AN ARBITRATION. SHE ENDED UP WITH A NEW DIESEL AND IT HAPPENED AGAIN! SHE IS NOW ON HER 3RD AUDI. THIS TIME NO DIESEL.  *TR",
        "vin": "WA1MMAFE6AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/10/2014",
        "dateOfIncident": "05/04/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559349,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FILLED AUDI Q7 TDI 2010 MODEL ON 5/4/2011 WITH DIESEL FUEL AND MADE IT ABOUT 3/4 OF A MILE AND THE VEHICLE STARTED TO RATTLE AND SHAKE HARD, FELT ALMOST LIKE A FLAT TIRE.....BUT THEN STARTED TO SPUTTER AND GURGLE AND THEN SHUT DOWN COMPLETELY, THIS TOOK ALL BUT ABOUT 60 SECONDS ONCE I FELT THE SHAKING, TO THE SHUTDOWN.......STEERING LOCKED....NOT GOOD....ALMOST HIT A PARKED CAR ON THE SIDE OF THE ROAD. VEHICLE DIED AND STALLED IN THE SLOW LANE (FOR AN HOUR) AND WOULD NOT RESTART.... WHAT COULD HAVE HAPPENED ON A FREEWAY....I HATE TO THINK....FLATBED TOW TRUCK TO DEALERSHIP AND WAS ADVISED (3) THREE DAYS LATER THAT THE HPFP ATOMIZED INTO THE FUEL SYSTEM AND THE SYSTEM WOULD HAVE TO BE REPLACED....INJECTORS, FUEL LINES, FUEL TANK, GAS FILLER NOZZLE, ETC. ETC., I HAVE AN INVOICE 5 PAGES THICK FOR THIS!! WELL, 28 DAYS LATER SUZIE Q, AS WE CALLED HER, WAS BACK.     NOW..NOW..NOW... AGAIN!!  YES, AGAIN, THIS HAS HAPPENED.....WED., JANUARY 8, 2014....ALMOST AN IDENTICAL SITUATION OCCURRED.....FILLED AUDI Q7 TDI 2010 MODEL WITH DIESEL FUEL AND MADE IT APPROX. 3/4 MILE....(GEESE WHAT A SURPRISE!!) AND SOUNDING SO FAMILIAR...YES?? JUST READ AGAIN THE PREVIOUS PARAGRAPH AND PLACE IT HERE.... IDENTICAL, IDENTICAL, SITUATION TO THE \"T\" THIS TIME AROUND, EXCEPT A DIFFERENT GAS STATION. DEALER TODAY, JANUARY 10, 2014 HAS INFORMED ME THAT, YES, INDEED THE HPFP HAS ATOMIZED AGAIN,....AGAIN,.. REALLY. I WANT TO LEMON THIS POS THAT I PAID $78,510.38 FOR AND WAS TOUTED BY THE DEALERSHIP AS ALMOST BULLET PROOF!! HAH  LOL...I WAS A FOOL. NEVER AGAIN BUYING AN AUDI...UNLESS THIS IS MADE RIGHT. TRADE IN FOR FULL VALUE MINUS A LITTLE....SOUND OK??  *TR",
        "vin": "WA1VMBFE3AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/10/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559356,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HPFP HAS ATOMIZED...AGAIN!!.... YES, AGAIN!!...STEERING LOCKED UP WHILE VEHICLE HAD SHUT DOWN AND WAS STILL MOVING ....APROX. 15 MPH...ALMOST HIT ANOTHER VEHICLE !!! MY 3 CHILDREN,9,12,14, WERE IN THE VEHICLE THIS TIME!! VERY DANGEROUS!! PLEASE SEE FIRST COMPLAINT...  *TR",
        "vin": "WA1VMBFE3AD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/12/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511796,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST ACCELERATION, WOULD NOT TAKE ANY THROTTLE INPUT. STARTED TO SLOW DOWN, EPC LITE CAME ON AN STARTED FLASHING. SPEED CONTINUED TO DROP FOR THE NEXT 10 MILES. GOT OFF AT THE FIRST EXIT THAT CAME UP ON THE I5. AS I CAME OFF THE FWY I WAS DOWN TO 25 MPH. AT THE FIRST LITE I HAD TO STOP, THE ENGINE QUIT, I THEN TURNED RIGHT IT WAS DOWN HILL SO THE CAR GLIDED WITH NO POWER STEERING OR BRAKES. MADE IT INTO A PARKING LOT TO A SAFE PLACE TO PARK. CAR WOULD NOT RESTART. HAD IT TAKEN BY FLAT BED TO OUR AUDI DEALERSHIP 107 MILES AWAY. DEALER SAID THAT THE HIGH PRESSURE FUEL PUMP FAILED AND CONTAMINATED THE COMPLETE FUEL SYSTEM.  *TR",
        "vin": "WA1LMAFE2AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2012",
        "dateOfIncident": "10/25/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482623,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TDI HIGH PRESSURE FUEL PUMP FAILURE WHILE ACCELERATING FROM RED LIGHT.  THIS RESULTED IN LOSS OF POWER STEERING, POWER BRAKES AND STEERING WHEEL LOCKED WHILE PULLING CAR OVER.  HAD CAR BEEN TRAVELING AT HIGH SPEED OR LESS EXPERIENCED DRIVER IT WOULD HAVE RESULTED IN AN ACCIDENT. *TR",
        "vin": "WA1WMBFE7AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2012",
        "dateOfIncident": "06/02/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480946,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A TDI VERSION OF THE Q7.  THE HIGH PRESSURE FUEL PUMP FAILED DURING NORMAL USE AND SENT METAL PARTS THROUGH THE FUEL LINES, THROUGH THE FUEL FILTER AND INTO THE COMBUSTION CHAMBERS.  AS A RESULT, THE ENGINE CEASED AND WE WERE LEFT STRANDED IN THE MIDDLE OF THE ROAD ON A WINDING CANYON ROAD.  THE ENGINE BLOCK WAS DAMAGED; THE CRANK SHAFT BENT, THE PISTONS DAMAGED THE HEADS AND MANY OTHER PARTS WERE DESTROYED.  THE CAR WAS REPAIRED BY AN AUDI DEALER AND REQUIRED ALL NEW FUEL COMPONENTS (BUMPER TO BUMPER) AND A NEW ENGINE.  THE CAR WAS IN THE SHOP FOR OVER A MONTH.   *TR",
        "vin": "WA1LMAFE7AD"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/16/2011",
        "dateOfIncident": "09/22/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436138,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING INCIDENT HAS OCCURRED TWICE. THE ONLY COMMON FACTOR I CAN IDENTIFY IS A GREAT DEAL OF RAIN PRIOR TO THIS. MY TAILGATE HAS OPENED TWICE BY ITSELF. WHEN THIS OCCURS, IT TAKES SEVERAL MINUTES TO CLOSE. I'VE HAD THE DEALER LOOK AT IT. THEY CLAIMED TO HAVE VIRTUALLY TAKEN THE WHOLE THING APART, AND CANNOT FIND THE SOURCE OF THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/21/2011",
        "dateOfIncident": "10/08/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432391,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS DRIVING ONTO THE HIGHWAY, WHEN ACCELERATING TO GET TO HIGHWAY SPEED VEHICLE LOST POWER WENT INTO LIMP MODE AND WAS NOT ABLE TO ACCELERATE. WAS ALMOST REARENDED BY TRACTOR TRAILER BECAUSE OF THIS ( HAD TO PULL ONTO THE SHOULDER TO GET OUT OF THE WAY). ALSO THE GLOW PLUG INDICATOR LIGHT STARTED FLASHING AND CHECK ENGINE LIGHT CAME ONE. TOOK THE CAR TO THE DEALER ( AUDI OF FAIRFIELD CT) THEY FOUND THAT THERE WAS A PROBLEM WITH THE HPFP METAL SHAVINGS IN THE FUEL SYSTEM AND THEY HAVE TO REPLACE THE ENTIRE FUEL SYSTEM. THEY ALSO SAID THAT IT MIGHT BE FROM PUTTING GASOLINE INSTEAD OF DIESEL FUEL, BUT I AM SURE I HAVE ALWAYS USED DIESEL AS I KEPT ALL RECEIPTS FROM GASSTATIONS. THEY WILL REPLACE THE ENTIRE FUEL SYSTEM AT NO COST TO ME, UNDER THE WARRANTY, BUT I THINK IT IS A PROBLEM THAT NEEDS TO BE ADDRESSED! THANK YOU  *TR",
        "vin": "WA1LMAFE5AD"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/13/2011",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406681,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXCESSIVE HIGH IDLE SPEED AFTER WARM UP IN GEAR OF 800-850 RPM IS EXCESSIVE.  THIS HIGH IDLE SPEED MAKES CONTROLLING THE CAR IN STOP AND GO TRAFFIC DIFFICULT DUE TO THE HIGH BRAKE PEDAL PRESSURE TO KEEP THE CAR FROM MOVING.  THE MOST DIFFICULT CIRCUMSTANCE WAS HAVING THREE TIRES ON ICE AND ONE ON DRY PAVEMENT.  THE QUATTRO DRIVE TRANSFERRED ALL THE POWER TO THE ONE TIRE THAT HAD TRACTION.  I WAS UNABLE TO HOLD THE CAR AND BUMPED THE CAR IN FRONT OF ME.  NO DAMAGE.  THE CAR HAS BEEN IN TO THE DEALER TWICE TO HAVE THIS CORRECTED AND I HAVE BEEN INFORMED THAT SINCE MODEL YEAR 2008 THE IDLE SPEED IS NOT ADJUSTABLE.",
        "vin": "WA1DVBFE1AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341602,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI 2010 Q7 TDI FUEL FILLER PROBLEMS.     ON SEVERAL OCCASIONS, APPROXIMATELY 1 IN 4 FUEL STOPS (CURRENT MILEAGE 9,200 MILES), I HAVE BEEN UNABLE TO INSERT A FUEL PUMP NOZZLE INTO THE FUEL FILLER NECK ON THE VEHICLE DUE TO A VERTICAL BAR JUST INSIDE THE FILLER OPENING.  IF FUEL IS DISPENSED, ITS IS REJECTED ONTO THE OUTSIDE OF THE VEHICLE AND GROUND.  POSSIBLE FIRE RISK.  IN ADDITION, USING THE VEHICLE IN URBAN AND RURAL SETTINGS ALL OVER THE WESTERN US, I HAVE BEEN LOW ON FUEL AND UNABLE TO REFUEL THE VEHICLE RISKING RUNNING OUT OF FUEL FAR FROM ANOTHER STATION.  PERSONAL SAFETY RISK.  AUDI DOES NOT HAVE ANY EXPLANATION FOR THE PROBLEM YET IT SHOULD BE CORRECTED.  I HAVE CALLED THE DEALER AND SEARCHED THE WEB FOR INFORMATION AND/OR A SOLUTION TO THE PROBLEM.    MOST RECENTLY, AT A STATION AT WEST YELLOWSTONE NATIONAL PARK, I WAS ABLE TO OVERCOME THE LOCKING BAR WITH A KNIFE AND THE FUEL FILLER NOZZLE COMBINED SO I COULD RELEASE THE BAR AND INSERT THE FUEL FILLER NOZZLE.    AUDI SAYS IT IS DUE TO DAMAGED FUEL PUMP NOZZLES AT FUEL STATIONS BUT THIS DOES NOT HOLD TRUE SINCE IT OCCURS AT STATIONS WHERE NOZZLES ARE NEARLY NEW AND PERFECTLY ROUND. *TR",
        "vin": "WA1VMAFE6AD"
    }
]