[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2021",
        "dateOfIncident": "06/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389519,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A STRONG SMELL OF GASOLINE INSIDE( AIR VENTS) AND OUTSIDE THE VEHICLE, WHILE DRIVING AND STATIONARY.",
        "vin": "WA1LKBFP2AA"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377566,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED PASSENGER SIDE FLOOR BOARD IS SOAKED AFTER IT RAINS. THIS HAPPENS IF IT IS PARKED OR IF YOUR DRIVING.  ALL DRAINS ARE CLEAR AND WHEN DROPPING HEADLINER, NOTICED A \"WATER\" WAY RUNNING DOWN TOWARDS PASSENGER PILLAR, ON PILLAR AIRBAG AND DOWN TO FLOOR BOARD.  DEALERSHIP TOLD ME THAT MANY OTHER 2010 AUDI Q5'S HAVE THE SAME ISSUE AND IMPLIED THIS IS PROBABLY WHY MY SUNROOF MOTOR IS NOT FUNCTIONING ANYMORE DUE TO WATER GETTING IN AND THEY QUOTED ME $2500 TO FIX THIS MANUFACTURE FLAW.  IF MY VEHICLE HASN'T BEEN IN A WRECK AND THE SUNROOF FRAME IS BAD, WHY ISN'T THERE A RECALL FOR THIS?",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362652,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 AUDI Q5 THAT IS LEAKING GAS ON THE GROUND WHILE ENGINE IS RUNNING WHILE SITTING STILL OR DRIVING DOWN THE ROAD.. I REMOVED THE PASSENGER REAR SEAT WHICH IS DIRECTLY ON TOP OF WHERE THE LEAK IS COMING FROM. I THEN REMOVED THE ACCESS PANEL FOR THE FUEL PUMP . GAS WAS SITTING ON TOP OF THE FUEL PUMP IN PUDDLES.  I DECIDED TO START THE CAR WITH THE ACCESS PANEL REMOVED TO SEE WHERE EXACTLY THE LEAK WAS COMING FROM AND HOW BIG OF LEAK IT WAS. UPON STARTING THE ENGINE GAS SPRAYED DIRECTLY OUT OF THE TOP OF THE FUEL PUMP'S WHITE PLASTIC DOME TOP, NOT THE FUEL PUMP FLANGE. PERIMETER. IT IS A LARGE LEAK, IT SPRAYS LIKE A GEYSER UNHINDERED HITTING THE TOP OF THE ACCESS PANEL AND RUNNING ONTO THE GROUND. YOU CAN SEE VISIBLE CRACKS IN THE TOP OF THE FUEL PUMP. MY GAS MILEAGE WHICH WAS 21 MPG PER TANK IS NOW14 MPG  ON LAST FILL UP SO MY GUESS IS ABOUT 7 GALLONS OF GAS LEAKS ONTO THE GROUND PER FILL UP. I AM AFRAID TO DRIVE THE VEHICLE IN THIS CONDITION AND THE FUMES ARE OVERWHELMING IN THE CABIN OF THE VEHICLE AND IF YOU ROLL DOWN THE WINDOW THE SMELL GETS WORSE...IN THE PICS UPLOADED YOU CAN SEE THE SPRAY AND VISIBLE CRACKS.",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361163,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED LEAKING FUEL SUDDENLY AND UNEXPECTEDLY AFTER STARTING  CAR IN GARAGE  FOR NO APPARENT REASON..STRONGLY BELIEVE IT'S A DEFECT SOMEWHERE. I SINCERELY BELIEVE WITH THIS TYPE OF PROBLEM THERE IS A SAFETY HAZARD  FOR TO DRIVE.  *TR",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "08/19/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353734,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A FUEL SMELL EMANATING FROM THE REAR SEAT AREA ON THE PASSENGER SIDE OF THE VEHICLE, A 2010 AUDI Q% WITH 104,500 MILES. THIS WAS NOTICEABLE BOTH WHILE DRIVING AND STATIONARY WHILE PARKED IN THE GARAGE.  AFTER FURTHER INVESTIGATION I VISUALLY SAW FUEL DROPS AROUND THE REAR PASSENGER SEAT ON THE BOTTOM OF THE VEHICLE.  I VISITED THE NATIONAL HIGHWAY SAFETY WEBSITE AND FOUND A RECALL THAT MATCHED THE SYMTOMS I DESCRIBED ABOVE. I CONTACTED MY AUDI DEALER AND THEY INDICATED A FIX FOR THAT RECALL WAS COMPLETED IN 2016 ON MY VEHICLE. I AM NOT SURE WHAT WAS ACCOMPLISHED BUT IT SEEMS IT DIDN'T WORK.  I HAVE BEEN TOLD BY THE AUDI SERVICE DEPARTMENT THAT THE FUEL FLANGE AND VARIOUS OTHER ITEMS WILL NEED TO BE REPLACED.  AS THIS IS A SAFETY ITEM AND THE CAR CAN'T BE DRIVEN UNTIL REPAIRED I AUTHORIZED THE REPAIR AT SUBSTANTIAL EXPENSE. I FEEL AS IF A TEMPORARY FIX WAS COMPLETED IN 2016 AND NOT A PERMANENT FIX WHICH SHOULD HAVE BEEN ACCOMPLISHED.",
        "vin": "WA1LKAFP4AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341708,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI DIDN'T FINISH THEIR RECALL 20W9.     THE Q5 WE HAVE HAD THE FIRST STEP DONE BUT NOT THE REST.    THIS IS FROM THE TSB :       AUDI WILL NOTIFY OWNERS, AND DEALERS WILL CLEAN THE PUMP FLANGE AND INSTALL A BUTYL RUBBER BAND TO PROTECT THE PUMP, FREE OF CHARGE. PARTS ARE NOT CURRENTLY AVAILABLE. INTERIM NOTICES WILL SENT IN EARLY NOVEMBER 2016. A SECOND NOTICE WILL BE SENT WHEN PARTS ARE AVAILABLE. OWNERS MAY CONTACT AUDI CUSTOMER SERVICE AT 1-800-253-2834. VOLKSWAGEN'S NUMBER FOR THIS RECALL IS 20W9.    OUR BACK SEAT IS FULL OF FUEL. THE PUMP CRACKED.    THE LOCAL AUDI SHOP SAID THE RECALL HAS BEEN DONE, BUT AFTER I INVESTIGATED THE AUDI DEALERSHIP THAT DID THE RECALL, THEY MENTIONED ONLY A PROTECTIVE KIT WAS PUT ON.",
        "vin": "WA1CKAFPXAA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288018,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT NOTICED A FUEL ODOR INSIDE THE VEHICLE AFTER IT WAS SERVICED PER NHTSA CAMPAIGN NUMBER: 16V660000 (FUEL SYSTEM, GASOLINE) AT INSKIP'S WARWICK AUTOMALL (1515 BALD HILL RD, WARWICK, RI 02886). THE VEHICLE WAS TOWED TO AUDI NATICK (549 WORCESTER ST, NATICK, MA 01760) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RESEARCHED THE FAILURE ONLINE AND FOUND THE RECALL. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE HAD ALREADY BEEN REPAIRED PER THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "WA1CKAFP1AA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287072,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT STATED THAT THE VEHICLE MISFIRED WHILE DRIVING AND THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI NYACK (127 NY-59, NYACK, NY 10960, (845) 353-7300) WHERE THE INTAKE COIL AND SPARK PLUGS WERE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.  *TR",
        "vin": "WA1CKAFP1AA"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286450,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS MISFIRING MOST OF THE TIME , AFTER TUNE AND CHANGING THE INTAKE AND THE COILS AT THE DEALER.  IT ALMOST STOPS",
        "vin": "WA1CKAFP1AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS RECALLED FOR A FUEL PUMP ISSUE WHICH WAS REPAIRED WITH TAPE IN 2018. THE FUEL PUMP IS NOW LEAKING FUEL CAUSING A FUEL SMELL IN THE VEHICLE AS WELL AS IN MY GARAGE AND HOUSE WHILE THE CAR IS PARKED IN THE GARAGE.   WHEN I TOOK MY VEHICLE TO BE INSPECTED AND REPAIRED I WAS TOLD THE ORIGINAL REPAIR WAS NOT SUBSTANTIAL ENOUGH TO FIX THE ORIGINAL DEFECT. AUDI REPORTS NO NEW RECALLS ON THE VEHICLE AND THAT THERE WAS A RECALL ON A SMALL SELECTION OF VEHICLES IN THE ORIGINAL RECALL. THIS IS A HAZARD AND COULD CAUSE A FIRE. ALL VEHICLES IN THE ORIGINAL RECALL SHOULD BE RECALLED AGAIN AND REPAIRED PROPERLY, WITH MORE THAN TAPE.",
        "vin": "WA1LKAFP7AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF GAS INSIDE THE CABIN AND OUTSIDE THE CAR WHILE MOVING AND WHILE STATIONARY. VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA RECALL 16V-660. DEALER STATES THE RECALL 18V818000 DOES NOT APPLY, EVEN THOUGH THE PREVIOUS RECALL SOLUTION WAS \"INTERIM\". DEALER REFUSES TO CLAIM RESPONSIBILITY.",
        "vin": "WA1MKAFP3AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220505,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2010 AUDI Q5 PRESTIGE . I HAD IT FROM 7 DAY AND PUT FUEL IN IT MAYBE 4 TIMES . THE VERY LAST TIME I PUT FUEL IN IT THERE WAS A STRONG GAS SMELL COMING THROUGH THE VENTS . IT GETS STRONGER AND STRONGER.",
        "vin": "WA1VKAFPXAA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194357,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICEABLE SCENT OF GASOLINE INSIDE THE VEHICLE.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181528,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 20W9 - IN LATE JULY OF 2017 I NOTICED A VERY STRONG SMELL OF FUEL IN MY CAR.  I TOOK IT TO MY LOCAL REPAIR SHOP ON 8/1/19 AS I COULD NO LONGER TOLERATE THE STRONG SMELL AND BECAME VERY WORRIED OF MY CAR EXPLODING.  THEY FOUND THAT MY FUEL FLANGE WAS BROKEN.   I DID NOT KNOW THERE WAS AN OPEN RECALL ON THIS PROBLEM. IT WAS ONLY AFTER I RECEIVED A RECALL ON MY AIRBAG IN DECEMBER 2018, AND TOOK IT AS INSTRUCTED TO MY AUDI DEALER, THAT I WAS TOLD THERE WAS AN OPEN RECALL. I CALLED AUDI AND ASKED WHAT I NEEDED TO DO AS I ALREADY HAD THE REPAIR MADE.  I WAS TOLD AUDI WOULD REIMBURSE ME.  I THEN RECEIVED A DENIAL LETTER FROM AUDI DATED 2/1/19.  I CALLED AUDI AND WAS TOLD I WAS DENIED BECAUSE I DIDN'T TAKE IT TO A DEALERSHIP THAT WAS WITHIN 15 MILES FROM MY HOME.  I EXPLAINED TO THEM THAT WHAT SHE SAID WAS THE DENIAL IS DIFFERENT THAN WHAT WAS STATED IN THE LETTER.  THE DENIAL LETTER STATES \"THE REIMBURSEMENT PERIOD FOR THIS SAFETY RECALL HAS ENDED.\"   YOU WILL NOTE ON THE TOP OF THE INVOICE I SUBMITTED THAT I DID NOT TAKE IT TO HAVE THE FUEL FLANGE REPAIRED (WHICH WAS THE RECALL).  IT CLEARLY STATES MY REASON FOR CONCERN -   CK FOR GAS FUMES/REAR HATCH AREA .  SHE THEN CALLED ME BACK ON 2/14/19 AND STATED SHE DID \"INTERNAL RESEARCH\" AND THE REIMBURSEMENT PERIOD FOR THIS RECALL HAD ENDED.  THEY WOULD NOT BE REIMBURSING ME.  SHE STATED I COULD APPEAL TO MY LOCAL AUDI DEALER THAT I HAD TO HAVE AN EMERGENCY REPAIR AND WHY I COULDN'T TAKE IT TO MY LOCAL AUDI DEALER TO HAVE THIS ISSUE FIXED.  I THEN STARTED RECEIVING EMAILS AND NOTICES IN THE MAIL TO HAVE THIS ISSUE FIXED AT MY LOCAL AUDI DEALER.  HOWEVER, IT WAS NOT UNTIL AFTER I HAD MY AIR BAG RECALL REPLACED THAT I STARTED RECEIVING THESE NOTICES.  I HAD NO IDEA THERE WAS A RECALL FOR THIS PROBLEM.  I HAD NO CHOICE AT THE TIME TO HAVE THE REPAIR MADE AT MY NORMAL REPAIR SHOP AS IT CAUSED A SIGNIFICANT HAZARD TO ME.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170619,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI SOUTH HAMPTON (51 MONTAUK HWY, WATER MILL, NY 11976, (631) 283-0888) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL  REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157202,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE MAKE NOISES  AND DON'T MAKE SHIFT NORMAL IS LIKE A LACK POWER.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154764,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI Q5 PREMIUM PLUS. ORIGINAL WINDSHIELD IS LEAKING.  UPPER RIGHT CORNER IS NOT SEALED PROPERLY SO THE WATER IS LEAKING ON THE A PILLAR. SERVICE ADVISER FROM LOCAL AUDI DEALERSHIP TOLD US AFTER CHECKING AND TESTING THEY SAID THAT THE ORIGINAL WINDSHIELD IS LEAKING.",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144435,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF HAS A LEAKAGE WHICH AS CAUSES DAMAGE TO SUNSCREEN.  THE WATER FROM THE SUNROOF HAS LEAKED INTO VEHICLES ELECTRICAL SYSTEM AND HAS CAUSED BACK UP CAMERA, PARKING, THE STEREO SYSTEM TO MALFUNCTION.  WATER FROM THE ROOF HAS ALSO AFFECTED THE ENGINE'S BLOWER IT HAS SHORT-CIRCUITED SO THAT THE AC AND HEATER NO LONGER PUT OUT AIR.",
        "vin": "WA1VKAFP4AA"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141353,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS AGO, MY WIFE AND I OBSERVED WATER ON DRIVER'S SIDE OF THE DASHBOARD AFTER IT RAINED. I THEN CHECKED THE FLOOR CARPET IN THE DRIVER'S FOOT WELL -IT WAS WET.    AFTER REMOVING THE DRIVER'S SIDE GRAB HANDLES, A-PILLAR TRIM AND THE VISOR IN ORDER TO LOWER THE HEADLINER, I OBSERVED WATER DRIPPING AT THE JUNCTION OF THE DRAIN HOSE TO THE SUNROOF.   I ALSO OBSERVED MORE WATER LEAKING INTO THE CAR BETWEEN THE TOP SIDE OF THE WINDSHIELD AND THE BODY OF THE CAR. I ALSO NOTICED THAT THE DRIVER'S SIDE CURTAIN AIRBAG WAS WET FROM THE WATER DRIPPING FROM THE SUNROOF / DRAIN HOSE CONNECTION.    ON 10/15/18, I CALLED AUDI OF AMERICA AND INFORMED THE REPRESENTATIVE OF THE PROBLEMS WITH THE VEHICLE THE REPRESENTATIVE TOOK MY INFORMATION AND SAID, \"SOMEBODY WILL GET IN TOUCH WITH YOU\".    ON 10/17/18, I RECEIVED A PHONE CALL FROM MRS. SHEMONIA. I INFORMED MRS. SHEMONIA THAT OUR Q5 HAS LEAKING SUNROOF DRAIN THAT CAUSES WATER TO DRAIN OVER THE DRIVER'S SIDE CURTAIN AIRBAG, WHICH MAY PREVENT THE AIRBAG FROM DEPLOYING PROPERLY.  I ALSO INFORMED MRS. SHEMONIA V. THAT THE WINDSHIELD IS LOSE WHICH CASES WATER TO LEAK INTO THE CAR AS WELL. LOSE WINDSHIELD IS ALSO A SAFETY DEFECT BECAUSE IT MAY PREVENT THE PASSENGER'S SIDE FRONT AIRBAG FROM DEPLOYING PROPERLY.  MRS. SHEMONIA STATED THAT AUDI DECLINED TO PROVIDE ANY ASSISTANCE WITH REPAIRING THESE TWO PROBLEMS SINCE THE Q5 IS OUT OF THE FACTORY WARRANTY PERIOD.    I CALLED BELL AUDI AND SPOKE TO SERVICE ADVISOR TOM WHO STATED THAT HE WAS AWARE OF THE LEAKING SUNROOF DRAINS DUE TO DRY ROT AND THAT THE REPAIR WOULD COST ABOUT $800.00.  ACCORDING TO TOM, THE WINDSHIELD REPAIR WOULD COST $1200.00 BECAUSE \"THE OLD WINDSHIELD CANNOT BE TAKEN OUT WITHOUT BREAKING IT SO A NEW WINDSHIELD WOULD HAVE TO BE INSTALLED.\"    IT APPEARS THAT AUDI OF AMERICA DOES NOT CARE ABOUT THEIR VEHICLES BEING UNSAFE.",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118649,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEAR (VOLKSWAGEN) IS RECALLING CERTAIN MODEL YEAR 2009-2012 AUDI Q5, AND 2007-2012 AUDI Q7 VEHICLES EQUIPPED WITH GASOLINE ENGINES. THE FUEL PUMP FLANGE ON THE AFFECTED VEHICLES MAY CRACK, ALLOWING FUEL TO LEAK. MY Q5 HAVE THE SAME PROBLEM I DON'T KNOW WHY I DIDN'T GET THE RECALL.",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "04/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098138,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL COMPLAINT:  I RECEIVE WARNING LETTERS AND REMINDER CARDS, BUT THE LOCAL DEALER SEEMS NOT TO HAVE PARTS.  THE RESPONSE SPECIFICALLY WAS TO \"CALL BACK IN A MONTH - WE SHOULD HAVE PARTS THEN\".  IT WOULD SEEM THEY SHOULD BE CALLING ME!  I EXPLAINED I WAS DRIVING A 2,000 MILE TRIP AND THERE WAS NO CONCERN, OR A WARNING THAT THE VEHICLE SHOULD NOT BE DRIVEN.  I NOW HAVE A SCHEDULE THIS WEEK TO HAVE THE WORK DONE AT ANOTHER DEALERSHIP.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089107,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (AUDI ALLENTOWN, 4725 HAMILTON BLVD, ALLENTOWN, PA) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKAFP4AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088962,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    MY AUDI DEALERSHIP DOES NOT HAVE MY REMEDY READY AND REFUSES TO OFFER A TIMELINE OR A LOANER VEHICLE.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079389,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI Q5. CONSUMER WRITES IN REGARDS TO TAKATA AIRBAG SAFETY RECALL. *LD    THE CONSUMER STATED THE PARTS NECESSARY TO COMPLETE THE RECALL REPAIR WERE NOT YET AVAILABLE. *JS",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2018",
        "dateOfIncident": "02/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078558,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE CONTACTED ATLANTA AUDI SERVICE DEPARTMENT TO GET MY AIRBAG REPLACED, AND HAVE BEEN TOLD THIS OVER IEMAIL: \"REGARDING REPLACEMENT PARTS, I WISH I HAD A DATE FOR YOU'AND FOR ME! THIS RECALL HAS BEEN OUT SINCE THE SPRING OF 2016. TAKATA TOOK SEVERAL MONTHS TO PROVIDE REPLACEMENT PARTS IN 2016/2017 AND WE REPLACED MANY. SHORTLY AFTER, THEY SHUT DOWN IN 2017 DUE TO BANKRUPTCY. FROM THAT POINT, AUDI OF AMERICA TOOK OVER AND HAVE HAD NEW PARTS MADE, WHICH HAS TAKEN SEVERAL MONTHS. THEY'RE STARTING DISTRIBUTION THIS YEAR. IT'S BEEN QUITE THE PROCESS!     PARTS HAVE BEEN INCREDIBLY LIMITED AND I AM UNABLE TO PROVIDE A STOCK DATE. YOU'RE WELCOME TO REACH OUT PERIODICALLY, OTHERWISE, WE'LL KEEP YOU ON OUR CALL BACK LIST. FOR MORE INFORMATION REGARDING THE RECALL, FEEL FREE TO CONTACT AUDI CUSTOMER RELATIONS.\"    I DO NOT FEEL SAFE DRIVING MY CAR. HOW IS THIS POSSIBLE TO NOT HAVE PARTS FOR A FATAL RECALL LIKE THIS?",
        "vin": "WA1VKAFP5AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076291,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUDI LAS VEGAS AT (702) 822-7000 (6335 W. SAHARA AVE, LAS VEGAS, NV 89146) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1CKAFP1AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075729,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE OF RECALL FOR MY VEHICLE DUE TO POSSIBILITY OF LEAKING FUEL. CALLED THE DEALER TO COMPLETE THE RECALL IN NOVEMBER 2016 ALONG WITH AN REGULAR MAINTENANCE, TOOK THE CAR IN AND WAS NOT ADVISED OF ANY ISSUES WITH COMPLETING EITHER SERVICE. PICKED THE CAR UP AND WAS TOLD THAT THE PART REQUIRED FOR THE RECALL WAS NOT AVAILABLE AND THAT I WOULD BE CALLED BY THE DEALER ONCE THE PART BECAME AVAILABLE SO THE REPAIR COULD BE COMPLETED. IT IS NOW MARCH OF 2018 AND I HAVE YET TO RECEIVE A CALL TO SCHEDULE THE REPAIR OF THE RECALL.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074318,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS) WAS RECEIVED IN JANUARY OF 2018. AFTER CONTACTING THE DEALER (AUDI OF WALLINGFORD, 800 S. COLONY RD, WALLINGFORD, CT 06492) AND THE MANUFACTURER, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE DEFECT WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LKAFP6AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062466,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR AS THE RECALL NOTICE WAS RECEIVED OVER A YEAR AGO. THE DEALER (PRESTIGE IMPORTS, 9201 W COLFAX AVE, DENVER, CO 80215, (303) 872-9990) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT RECEIVED A POSTCARD FROM TK HOLDINGS, ALERTING HIM THAT THEY FILED FOR BANKRUPTCY. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045872,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    UNABLE TO EVEN GET ANY DETAILS ON HOW/WHEN TO GET THIS REMIDIED BY EITHER THE DEALER OR AUDI OF AMERICA.  BOTH SAY THEY DON'T KNOW WHAT TO TELL ME, THE DEALER TELLS ME TO CALL AUDI OF AMERICA AND AUDI TELLS ME TO CALL THE DEALER.  IT'S BEEN INFORMATION BLACKOUT FROM BOTH OF THEM.  THIS WHOLE SAGA HAS BEEN GOING ON FOR A VERY EXTENDED PERIOD OF TIME, YEARS NOW.",
        "vin": "WA1WKAFP5AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044200,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TACIT RECALL: I HAVE TRIED UNSUCCESSFULLY TO GET MY CLOSEST DEALERSHIP TO ADDRESS THIS ISSUE BECAUSE THEY ARE TELLING ME THAT THEY CANNOT GET THE PART. MEANWHILE I'M TAKING A RISK EACH TIME I DRIVE MY CAR. NO ONE SEEMS TO CARE. I HAVE TALKED TO AUDI USA WHO PUT ME IN TOUCH WITH A TAKATA SPECIALIST AND THEY PUT ME BACK IN TOUCH WITH AUDI OF MELBOURNE FLORIDA. I GET THE SAME ANSWER, THE PART IS HARD TO GET AND ONCE WE RECEIVE THE PART THEY WILL CONTACT ME. HOW LONG MUST THIS GO ON. I HAVE IN CHRONOLOGICAL ORDER THE SERVICE ADVISOR'S I HAVE TALKED TO AND WHEN. I'AM STILL WAITING ON THIS DEALERSHIP TO CONTACT ME TELLING THEY HAVE RECEIVED THE PART.",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "03/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - ABOUT 6 MONTHS AGO, I ASKED THE AUDI DEALER ABOUT THIS RECALL AND WAS TOLD THEY DIDN'T HAVE THE PARTS YET AND THEY WOULD NOTIFY ME WHEN THEY DID.  NOW I'VE RECEIVED A LEGAL NOTICE IN THE MAIL, REGARDING TAKATA INFLATORS.  I WOULD LIKE ASSISTANCE WITH GETTING MINE REPLACED.  I HAVE NOT BEEN IN AN ACCIDENT, BUT WOULD LIKE TO PREVENT PROBLEMS.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041121,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I AM BEEN ATTEMPTING TO GET THE AIRBAGS REPLACED AT MY AUDI DEALER IN ROCKVILLE, MARYLAND FOR OVER A YEAR.  I ROUTINELY RECEIVED NOTICES ON BEHALF OF TAKATI AND THE DEALERSHIP, BUT WHEN I CALLED THE LATTER THEY INDICATED THEY DIDN'T HAVE ANY REPLACEMENTS.  A COUPLE OF MONTHS AGO ROCKVILLE AUDI SENT ANOTHER NOTICE.  I MADE AN APPT TO GET THE AIRBAGS REPLACED AND ADDED SOME OTHER SERVICE ITEMS WHILE THE CAR WAS IN THE SHOP.  WHEN I BROUGHT THE CAR IN THEY NOTED THEY HAD NO MORE AIRBAGS IN STOCK.  I HAD THE OTHER SERVICE DONE TO THE TUNE OF $2K.  STILL NO AIRBAGS.  I NOW HAVE A TEENAGER DRIVING THE CAR AND AM VERY CONCERNED FOR HER SAFETY AS WELL AS MINE.",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/03/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025233,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE IN FOR TAKATA AIRBAG RECALL  SINCE THAT TIME, I HAVE BEEN SMELLING GAS ON THE OUTSIDE OF MY VEHICLE.  AT FIRST I THOUGHT IT WAS ME FUELING THE VEHICLE BUT THE SMELL GETS A BIT LOUDER UPON DRIVING.  I TOOK THE VEHICLE IN TO DEALER A WEEK AGO BUT THEY ADVISE IT WAS TOO LATE IN THE DAY TO CHECK.  I FEEL LIKE THERE IS SOMETHING THAT IS NOT  RIGHT.  PLEASE HELP",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "08/26/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025240,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT STATED THAT THE VEHICLE EMITTED A FUEL ODOR FROM OUTSIDE OF THE VEHICLE. THE FAILURE OCCURRED WITHOUT WARNING. THE CONTACT DID NOT SMELL THE FUEL ODOR UNTIL NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) WAS REMEDIED AT AUDI LYNBROOK (855 SUNRISE HWY, LYNBROOK NY). THE VEHICLE WAS NOT DIAGNOSED FOR THE ADDITIONAL FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015895,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V078000 AND 16V660000 (AIR BAGS, FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (CLASSIC AUDI, LOCATED AT 541 WHITE PLAINS RD, EASTCHESTER, NY 10709; (855) 977-2266) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKAFP3AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUDI NORTH SCOTTSDALE AT 18088 N SCOTTSDALE RD, PHOENIX, AZ 85054, PHONE NUMBER: (480) 538-4000 WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. UPDATED 08/29/17*LJ    *CN",
        "vin": "WA1LKAFP3AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001597,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  WE WERE NOTIFIED OF THE TAKATA AIRBAG RECALL IN FEBRUARY 2016 AND HAVE BEEN REPEATEDLY TOLD, MOST RECENTLY ON JUNE 27, 2017, THAT THE PARTS NECESSARY TO COMPLETE THE REPLACEMENT HAVE NOT BEEN RELEASED TO AUDI YET.",
        "vin": "WA1LKAFP4AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001391,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I CONTACTED DEALER MULTIPLE TIMES BUT THEY ARE NOT FIXING THE CAR.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990967,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V660000 (POWER TRAIN) AND 16V078000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKBFP6AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985813,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I CAN NOT SELL OR GIFT MY CAR , BECAUSE I HAVE BEEN WAITING ONE YEAR FOR AN AIRBAG FROM MY DEALER IN NORWELL, MA. THEY ARE WILLING TO TAKE CAR IN TRADE FOR A VERY LOW-LOW TRADE IN. I WANT MY REPAIR.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983767,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT REPAIRED. THE MANUFACTURER STATED THAT THE PART WAS ON BACKORDER AND DID NOT KNOW WHEN IT WOULD ARRIVE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "02/21/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970312,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE AWARE THAT THERE WAS A DIFFERENT RECALL THAT DID NOT INCLUDE OUR CAR THAT CAUSED CORROSION IN THE PANELING OF THE CAR FROM THE MOON ROOF AND IT WAS POSSIBLY CAUSING AIR BAGS TO DEPLOY. WE HAVE BEEN TO THE DEALERSHIP TO BE SERVICED AND THEY HAVE EXPLAINED TO US THAT THERE IS EXCESSIVE AMOUNT OF CORROSION IN THE PANELS OF THE CAR AND ALSO THE CORROSION AND WATER LEAKAGE HAS DESTROYED THE ELECTRICAL COMPONENTS OF OUR BACKUP CAMERA/SYSTEM.   WE ARE WONDERING IF THIS HAS BEEN BROUGHT UP BY OTHER PEOPLE BECAUSE, ALTHOUGH OUR CAR'S VIN WAS NOT INCLUDED IN THE RECALL I AM REFERRING TO, IT SEEMS STRANGE THAT MY CAR HAS THESE EXACT SAME ISSUES.   THERE IS NOT AN EXACT DATE ATTACHED TO THESE ISSUES BECAUSE IT MUST HAVE BEEN HAPPENING FOR QUITE SOME TIME. THE ONLY REASON WE KNOW OF THE CORROSION IS BECAUSE THE DEALERSHIP EMPLOYEE CRASHED INTO OUR CAR AND THEY HAD TO FIX THE DAMAGE. IN DOING SO THEY DISCOVERED THE EXCESSIVE AMOUNTS OF CORROSION AND COULD NOT EXPLAIN THE REASONING/CAUSE BEHIND IT.",
        "vin": "WA1VKAFP5AA"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "03/26/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968683,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, DEALER HAS NO IDEA WHEN THEY WILL BE ABLE TO REPLACE THE SAFETY HAZARD.    ISSUE #2 FUEL FUMES FILLING THE CAR AS YOU ARE DRIVING AND THIS IS AFTER THE DEALER CLAIMS THEY FIXED IT BY PUTTING A PATCH ON THE GAS TANK FLANGE, WHICH HAS NOT CORRECTED THE PROBLEM.",
        "vin": "WA1CKAFP9AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967701,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V660000 (FUEL SYSTEM, GASOLINE); HOWEVER  THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 06/02/2017*LJ  UPDATED 08/08/2017*JS",
        "vin": "WA1LKBFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957620,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL + WATER INSIDE CAR: AUDI IS NOT FIXING THE TAKATA AIRBAG ISSUE, ANYTIME I ASK ABOUT IT TO DEALER, THEY ARE JUST SAYING, THEY DONT HAVE ANY FIX YET AND THEY DONT KNOW WHEN FIX WILL BE AVAILABLE. I WAS TRYING TO TRADE MY CAR SO I CAN BUY NEW ONE BUT DUE TO THIS ISSUE, NO ONE GIVING ITS REAL VALUE. RECENTLY THIS CAR ALSO FLOODED WITH WATER DUE TO THEIR INTERNAL PIPE BUSTED AND I WAS LOOKING ONLINE AND SEE THEY HAD ISSUE WITH SOME OF THE MODELS AND THEY RECALLED BUT THIS MODEL WAS NOT INCLUDED AND I END UP SPENDING ALMOST $1000 TO FIX THE ISSUE. I DON'T REMEMBER EXACT DATE SO JUST PUTTING LAST YEAR'S DATE BELOW.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956310,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY AUDI HAS THE DRIVER SIDE AIRBAG RECALL. THE ONE THAT HAS BEEN KNOWN TO DEPLOY AND KILL PEOPLE. I AM VERY UPSET WITH AUDI AND MADE IT VERY CLEAR TO THEM OF HOW UPSET I AM AND THEY COULD CARE LESS. IT HAS BEEN OVER A YEAR SINCE AUDI DRIVERS WERE MADE AWARE OF THIS SAFETY RECALL. AUDI HAS GIVEN NO SOLUTION TO THEIR DRIVERS AND COULD CARE LESS ABOUT THE SAFETY OF THEIR DRIVERS. I WAS TOLD OVER THE SUMMER THE PART WOULD BE REPAIRED BY FALL. IT IS NOW FEBRUARY AND SPOKE TO SOMEONE TODAY WHO SAID THEY HAVE NO CLUE WHEN IT WILL BE IN AND MY ONLY OPTION IS TO TRADE THE CAR IN FOR A MORE EXPENSIVE CAR. THIS OFFER IS ONLY AVAILABLE ON NEW CARS!! WHAT A SCAM!! FORCE CLIENTS TO TRADE IN THEIR CAR, NOT GETTING FAIR MARKET VALUE FOR THE TRADE, AND SPEND MORE MONEY ALL SO WE CAN BE SAFE!!! I HAVE NOW READ AN ARTICLE THAT STATES THESE RECALLS MAY NOT ALL BE REPLACED TILL 2020!! I AM PREGNANT WITH TWINS IN A CAR THAT IS ESSENTIALLY A DEATH TRAP!! WE ARE TRYING TO GET RID OF THIS CAR WHICH SHOULD SELL FOR 10K OVER WHAT A DEALERSHIP WILL EVEN TOUCH IT FOR ON TRADE IN. IT HAS BEEN WELL OVER THE REASONABLE TIME FOR THIS SAFETY RECALL. DEALERSHIPS SHOULD BE FORCED TO BUY BACK THESE CARS AT FAIR MARKET VALUE AND DEAL WITH IT!!! IT WOULD BE A LOT CHEAPER THEN THE NUMEROUS LAW SUITS THAT WILL HAPPEN IF I GET IN A CAR ACCIDENT OR SOMEONE ELSE FOR THAT MATTER!! THEY ARE OFFERING ZERO HELP TO THEIR CUSTOMERS AND SHOULD BE ASHAMED OF THEIR SELVES!! THE FACT THAT THIS HAS BEEN KNOWN ABOUT SINCE 2004 AND THESE DISGUSTING COMPANIES ARE PUTTING PEOPLES LIVES AT RISK IS DISGRACEFUL!! THIS ISSUE NEEDS TO BE RESOLVED IN A TIMELY MANNER AND I AM DEMANDING A SOLUTION!! BUY BACK MY CAR OR FIX IT WITHIN 1 MONTH!! DON'T GAMBLE WITH THE LIVES OF YOUR CUSTOMERS!!",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955247,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS ADVISED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LKAFP6AA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "01/29/2017",
        "dateOfIncident": "01/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10948173,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR AUDI Q5 JUST LAST NIGHT FRI. 1.27.17 AT 10PM LOST POWER AND WITHIN 30 SECONDS COMPLETE STOP AND STALL. I WAS TRAVELING WITH MY WIFE AND 4 YR. OLD SON ON OUR WAY HOME ON 210 FWY AND 57 INTERCHANGE WITHIN SECONDS WE ARE STUCK RIGHT IN THE MIDDLE OF A 4 LANE HIGHWAY WITH CARS AND BIG RIGS ZOOM BY US AND SWERVING AROUND US. WE COULD DO NOTHING EXCEPT SIT IN THE CAR AS WE SEE A CAR HEADING RIGHT FOR US AND BRACE FOR THE COLLISION. THANK GOD WE WALKED AWAY WITH OUR LIVES AND ONLY WHIPLASH AND NOT KILLED LEAVING MY 8YR OLD DAUGHTER ALL ALONE. THE CAR AS TOWED AWAY AND TAKEN TO A BODY SHOP FOR NOW. CAR MAYBE TOTALED UNSURE AS OF YET. ALSO MAN AT THE BODY SHOP READ THE CAR CODES WHICH ONE WAS THE FUEL PRESSURE REGULATOR ERROR CODE. THIS WAS AN EXTREMELY TRAUMATIC EXPERIENCE FOR MY MYSELF, WIFE AND CHILD. WE ARE GOING TO AUDI AND REPORT THIS TO THEM ON MONDAY. THIS SEEMS TO BE THE SAME ISSUE OTHERS REPORTED IN PAST AND TO THE NHTSA HERE IS A REPORT OF A CRASH THAT MAYBE FROM THE SAME REPORTS AS OTHERS.  *TR",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2017",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939120,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKAKA RECALL: I HAVE BEEN DRIVING AN AUTOMOBILE WITH A POTENTIALLY LETHAL SAFETY DEVICE FOR ALMOST 7 YEARS SINCE PURCHASE AND ALMOST 1 YEAR SINCE RECALL. THE MANUFACTURER SHOULD EITHER PROMPTLY INSTALL A REPLACEMENT BY THE 1-YEAR ANNIVERSARY OF THE ANNOUNCEMENT OR REPURCHASE OR EXCHANGE THE VEHICLE BY THE 7-YEAR ORIGINAL PURCHASE DATE ANNIVERSARY.  *TR",
        "vin": "WA1LKAFP2AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTIFIED OF RECALL 69N1 - TAKATA SDI DRIVE FRONTAL AIRBAG IN APRIL 2016.  AS OF DECEMBER 2016, NO REMEDY PROVIDED",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/16/2016",
        "dateOfIncident": "02/26/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935872,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935482,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE NOT RECEIVED A NOTICE OF THIS RECALL FROM AUDI NORTH AMERICA.  I AM THE ORIGINAL OWNER.",
        "vin": "WA1LKAFP1AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "12/13/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934961,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MANUFACTURER STATES \"REMEDY NOT AVAILABLE\" THE RECALL HAS BEEN ANNOUNCED IN FEBRUARY, IT IS DECEMBER NOW - NOT ACCEPTABLE.",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "02/15/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934695,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.   STILL NO REPLACEMENT AIRBAG FOR THIS VEHICLE.     THE CONSUMER STATED THE FUEL PUMP FLANGE RECALL PART WAS NOT AVAILABLE. *JS",
        "vin": "WA1LKAFP4AA"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927124,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY CONCERNED ABOUT MY SAFETY AT THIS POINT , THE RECALL IS THE SDI DRIVER FRONTAL AIR BAG AND FUEL PUMP FLANGE, FOR THE AIRBAG IT HAS BEEN OVER 8 MONTH AND THE PARTS ARE STILL NOT AVAIALBLE??????????????? WHAT?",
        "vin": "WA1CFAFP1BA"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926189,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WITH NO FIX, ALSO A PROBLEM WITH THE FUEL PUMP WHICH THE CAR CAN LIGHT ON FIRE THERE IS ALSO NO CURRENT REPAIR. THE DEALER SAID WE ARE SCREWED THERE'S NOTHING THEY CAN DO.MY WIFE GOT INTO AN ACCIDENT WITH THE LOANER CAR IF IT WAS OUR CAR THAT IS PLAGUED BY THE RECALL THINGS COULD HAVE BEEN WORST",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2016",
        "dateOfIncident": "11/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925273,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I GOT NOTICED OF MY CAR IN NEED OF A RECALL VIA LETTER IN FEBRUARY, 9 MONTHS LATER NOTHING HAS HAPPENED AND AUDI STILL SAYS \"NO REPAIR AVAILABLE YET\"",
        "vin": "WA1LFAFP5BA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/05/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924401,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES  FAILED ON TWO OCCASIONS. WHEN THE BRAKE WAS PRESSED, THE PEDAL SANK ALL THE WAY TO THE FLOOR. THIS HAPPENED WHILE THE VEHICLE WAS IN MOTION. LUCKILY, ON BOTH OCCASIONS, THE CAR WAS MOVING AT LESS THAN 25 MPH. MY ABILITY TO SLOW DOWN WAS SIGNIFICANTLY REDUCED.     ULTIMATELY LEARNED THAT THE MASTER CYLINDER WAS DEFECTIVE AND HAD TO BE REPLACED.",
        "vin": "WA1VKAFP7AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918008,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS NOW BEEN 8 MONTHS WITH A DRIVER SIDE TAKATA AIRBAG RECALL ON MY VEHICLE AND MY AUDI DEALERSHIP IN LATHAM, NY AND AUDI USA STATE THEY HAVE NO IDEA WHEN REPAIRS WILL BE MADE.  THEY OFFER NO HELP WHEN I EXPLAINED TO THEM I FEEL UNSAFE DRIVING THIS VEHICLE ANYMORE.  I EXLPAINED TO THEM I TRIED TO YRADE IT IN FOR ANOTHER VEHICLE, HOWEVER THE DEALERSHIP DOESNT EVEN WANT TO TAKE IT IN ON A TRADE DUE TO THIS RECALL BUT THE DEALERSHIP WILL OFFER ME CONSIDERABLE LESS THAN WHAT I OWE ON IT.  WHEN WILL THIS MATTER GET RESOLVED.  I FEEL LIKE I AM STUCK WITH A DEATH TRAP THAT I CANT GET OUT FROM UNDER.",
        "vin": "WA1LKAFP2AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917364,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. DG",
        "vin": ""
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/06/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915990,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HORRIFIED MOTHER OF 2 SMALL CHILDREN. RECENTLY NOTICED WHEN DRIVING THE VEHICLE, A GAS/FUEL SMELL CONSUMES THE ENTIRE CAR. THE SMELL WAS SO BAD IT MADE ME SICK AS WELL AS SET OFF THE CARBON DIOXIDE ALARM IN MY GARAGE. MY TODDLER SON SITS ON THE SIDE WHERE THE TANK IS AND OF COURSE THAT IS WHERE THE SMELL IS THE STRONGEST. I FEARED THAT A EXPLOSION WOULD HAPPEN IN MY HOUSE DUE TO SMELL BEING SO STRONG...WE FINALLY TOOK THE SUV IN AND REPAIR COMPANY STATED THAT I HAD A FUEL LEAK. HE STATED THAT THE PUMP HAD A CRACK IN IT AND WAS SPRAYING FUEL ALL UNDER THE CAR.  REPAIR HAS COST ME $900 TO REPLACE THE FUEL PUMP, ADAPTOR, AND RINGS.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "04/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914456,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906881,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    VEHICLE HAD A RECALL OF THE TAKATA AIR BAGS, BUT THE RECALL NOTICE STATES THAT NO SOLUTION IS CURRENTLY AVAILABLE.  I KNOW THAT 100 MILLION VEHICLES HAVE BEEN RECALLED SO THERE IS A BACKLOG.  I AM CONCERNED BY THIS DELAY AS THE RECALL WAS ISSUED MONTHS AGO AND STILL NO WORD ON THE REPLACEMENT AIR BAGS.  WE LIVE IN A HOT HUMID CLIMATE WHERE THESE INFLATORS ARE MORE PRONE TO FAILURE.  PLEASE PUT PRESSURE ON TAKATA TO EXPEDITE THIS RECALL.  MY FAMILIES LIVES ARE AT RISK.",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898511,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LKAFPXAA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893750,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE CALLED ME WHILE I WAS AWAY ON BUSINESS AND SAID THAT THERE WAS A SMELL OF FUEL IN THE HOUSE.  I ASKED HER TO MAKE SURE TO CHECK THE OVEN AND SHE SAID IT WAS NOT THAT TYPE OF GAS AND THAT IT SMELLED LIKE AUTO FUEL.  I CAME HOME AND WE HAD APPOINTMENTS TO CHECK OUT NEW HOMES AND WE NOTICED THAT THE INSIDE OF THE CAR SMELLED LIKE FUEL AND I HAD TO DRIVE WITH THE WINDOWS DOWN AND NO A/C BECAUSE WE HAVE TWO SMALL CHILDREN AS WELL AND THE ODOR WAS STRONGER WHEN WE HAD THE A/C ON.  WE PARK OUR 2010 AUDI Q5 IN OUR GARAGE AND WHEN WE GOT HOME FROM OUR APPOINTMENTS I COULD SMELL A VERY STRONG SMELL OF FUEL COMING FROM THE REAR PASSENGER WHEEL WELL.  WE HAVE NOT OVERFILLED THE CAR AND THERE MUST BE SOME KIND OF LEAK.  THIS IS MY WIFE'S CAR AND SHE HAS BEEN COMPLAINING OF BAD HEADACHES AND NAUSEA OVER THE PAST COUPLE OF WEEKS AND MY CHILDREN RIDE IN THIS CAR AS WELL SO THIS TO ME IS A HEALTH CONCERN THAT IF THE FUEL PUMP OR SOME OTHER FUNCTION OF THE FUEL SYSTEM FAILS THAT HARMFUL GASOLINE FUMES COULD ENTER THE CABIN OR EVEN INTO OUR HOME AND CAUSE DAMAGING EFFECTS TO MY FAMILIES HEALTH.  I WILL BE TAKING IT INTO THE DEALERSHIP IN RENO NEVADA AND WILL UPDATE YOU ON WHAT THE OUTCOME IS.",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891647,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WA1LKAFP9AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886149,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA SDI DRIVER FRONTAL AIRBAG SAFETY RECALL 69N1; NHTSA: 16V078; RECEIVED NOTICE IN APRIL 2016.    I HAVE NOT RECEIVED A RESPONSE TO MY VOICEMAIL A FEW DAYS AGO TO AUDI'S 1-800 NUMBER. I RECEIVED THE NOTICE OF THE RECALL IN APRIL, BUT TO DATE, HAVE NOT BE CONTACTED TO SCHEDULE A REPAIR. I THINK OVER THREE MONTHS OF NO CONTACT FROM AUDI REGARDING THIS SAFETY REPAIR IS UNREASONABLE AND DANGEROUS.  AT THE VERY LEAST, I WOULD LIKE A STATUS ON THE REPAIR FOR MY VEHICLE IMMEDIATELY. I SEE THAT A NEGATIVE NOTATION ON MY CARFAX RECORD WAS IMMEDIATELY MADE WHEN THIS RECALL WAS ISSUED AND IT INDICATES THAT THIS REPAIR HAS NOT TAKEN PLACE. THIS IS THROUGH NO FAULT OF ME THE OWNER AND I WOULD LIKE THIS NEGATIVE MARK REMOVED FROM MY CARFAX RECORD AS SOON AS POSSIBLE AS IT IS AUDI'S RESPONSIBILITY TO REMEDIATE THE DEFECT. THE NEGATIVE REPORT AFFECTS MY ABILITY TO SELL MY CAR AT TRUE MARKET VALUE DUE TO AUDI'S DELAY. I HAVE ALSO SUBMITTED AN ONLINE REQUEST THROUGH AUDIUSA.COM REGARDING THIS RECALL AND NOT BEEN CONTACTED REGARDING WHEN/IF IT WILL BE SCHEDULED.  PLEASE ASSIST WITH OBTAINING A RESPONSE FROM AUDI REGARDING THIS SAFETY ISSUE. THANK YOU  *TR",
        "vin": "WA1WKAFP2AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE MY WIFE NOTED STRONG ODOR OF GAS. MY MECHANIC FOUND THAT THE FUEL PUMP CRACKED CAUSING GAS SPILLING OUT FROM THE TOP OF THE GAS TANK THAT MAY HAVE RESULTED IN FIRE OR EXPLOSION SINCE THE GAS TANK IS NEAR THE HOT EXHAUST PIPE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882370,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS TWO FOLD. 1. WHY IS THE NHTSA ISSUING A RECALL AND TELLING AUDI OWNERS NOT TO DRIVE THEIR CARS? 2. AUDI OF AMERICA. AS OF 7/2/2016 AUDI IS STATING ITS NOT THAT SERIOUS? WE HAVE HAD NO INCIDENTS ACCORDING TO AN AUDI REPRESENTATIVE. THIS MAY BE TRUE BUT I WOULD THINK SOME PLACE IN THE USA THEIR HAD TO HAVE BEEN AN ACCIDENT INVOLVING ONE OF AUDI'S MODELS.NHTSA'S RECALL NOTICE STATES AGE, CLIMATE CONDITION AND CERTAIN AREAS OF THE USA AS THE GOVERNING FACTORS. IF THE AIRBAG GOES OFF DURING AN ACCIDENT THE OUTCOME IS THE SAME REGARDLESS OF THESE FACTORS LISTED IN THE RECALL NOTICE. I WANT TO KNOW WHY THE PEOPLE YOU ARE PROTECTING ARE STILL ALLOWED TO DRIVE A VEHICLE THAT IS A GRENADE WITH THE PIN PULLED OUT? THESE VEHICLES SHOULD BE OFF THE ROAD. WHY DO I PAY THE COMMONWEALTH OF MASSACHUSETTS EVERY YEAR FOR A SAFETY INSPECTION STICKER. IF THEY WILL NOT ISSUE ONE FOR TIRE THREAD DEPTH, HEADLIGHT OUT OR SEAT BELT PROBLEM. THAN WHY ARE THEY ALLOWED TO ISSUE AN INSPECTION STICKER WITH A DEFECTIVE AIR BAG?",
        "vin": "WA1LKBFP2AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881824,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  NOTICE OF \"IMPORTANT SAFETY RECALL\" RECEIVED IN APRIL 2016.  TO DATE, IT HAS NOT BEEN POSSIBLE TO SCHEDULE A REPAIR BECAUSE THE PARTS ARE ALLEGEDLY NOT AVAILABLE.  IF IT IS A \"SAFETY\" RECALL, AND IF IT IS \"IMPORTANT\", THE REPAIR SHOULD BE MADE NOW.  I WAS ADVISED YESTERDAY THAT THE DEALER DID NOT HAVE PARTS AVAILABLE.",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT HEADLIGHT DIP LIGHT COMES ON WHEN I AM DRIVING AND HIT A HIGHWAY BUMP AND THEN THE LEFT HEADLIGHT FAILS.  WHEN I SHUT THE CAR OFF AND THEN TURN THE CAR BACK ON THE LIGHT WORKS AND THE DIP WARNING LIGHT GOES OFF.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872010,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI Q5.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER  FRONTAL AIRBAG RECALL NOTICE.  *SMD",
        "vin": "WA1VKAFP9AA"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870781,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT STATED THAT THERE HAD BEEN STRONG FUMES OF FUEL EMITTING INTO THE INTERIOR OF THE VEHICLE. THE CONTACT STATED THAT THE FAILURE PROGRESSED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THERE WAS A PREMATURE CRACK IN THE HEADLINER FOR THE FUEL INJECTOR CAUSING THE FUEL TO LEAK INTERNALLY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. IN ADDITION, THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) BUT THE PART WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 94,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 10/19/16*LJ    *CN",
        "vin": "WA1LKAFP7AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/29/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862224,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    HEARD FROM THE CALL, DON'T FEEL SAFE TO DRIVE ANYMORE. CALLED THE AUDIUSA CUSTOMER SERVICE THREE TIMES, THEY WERE ASKING THE DEALER TO TAKE CARE OF IT, BUT THE DEALER DID NOT CALL ME.  THE AUDIUSA CUSTOMER SERVICE WAS NOT ABLE TO  ANSWER MY QUESTION ABOUT WHETHER THE DEALER IS OBLIGED TO DO THAT OR SO. I AM EXTREMELY FRUSTRATED/DISAPPOINTED WITH THE AUDIUSA. AUDIUSA ESSENTIALLY PUTS THEIR CUSTOMERS' LIVES IN DANGER WITH NO MERCY. I WISH SOMEONE IN THE WORLD CAN TAKE SOME RESPONSIBILITY.",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2016",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836667,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED TO NOTICE A FUEL SMELL INSIDE THE CABIN OF THE VEHICLE WHILE DRIVING.  IT BECAME SO BAD THAT THE CAR WAS UNDRIVEABLE. UPON INSPECTION THE TOP OF THE FUEL FILTER, (WHICH IS PART OF THE FUEL PUMP ASSEMBLY), IN THE GAS TANK WAS LEAKING PROFUSELY ALONG A MOLD INJECTION LINE ON THE TOP OF THE FILTER.  THE FILTER IS MADE OUT OF HARD PLASTIC. IT WAS SPRAYING GAS ON THE ACCESS PLATE UNDERNEATH THE REAR PASSENGER SEAT. SO MUCH SO THAT THE BOTTOM OF THE SEAT WAS SOAKED IN GASOLINE AND HAD POOLED ON TOP OF THE ACCESS PLATE. ATOMIZED GAS IS VERY DANGEROUS INSIDE THE CABIN OF THE VEHICLE.  THE SEAL ON THE ACCESS PLATE WAS SOAKED IN GAS TO WHERE IT NO LONGER SEALED AND HAD EXPANDED TO TWICE ITS SIZE; (VERY POOR DESIGN).  I PURCHASED A NEW FUEL FILTER AND REPLACED WHICH FIXED THE PROBLEM.  I THEN COMPLAINED TO AUDI USA AND THEY ACTED VERY QUICKLY BY HAVING THE CAR BROUGHT INTO THE DEALERSHIP AND INSPECTED.  AUDI USA ALSO COVERED ALL MY EXPENSES FOR THIS REPAIR EVEN THOUGH THE CAR IS OUT OF WARRANTY.  THE ORIGINAL FUEL FILTER WAS SUPPOSEDLY SENT BACK TO GERMANY SO THAT AUDI ENGINEERS COULD STUDY THE FAILED PART.  I BRING ALL THIS UP AS I KNOW I AM NOT THE ONLY AUDI OWNER TO EXPERIENCE THIS PROBLEM. A QUICK GOOGLE SEARCHED TURNED UP MULTIPLE SIMILAR INSTANCES.  I BELIEVE IT WAS CAUSED BY THE MANUFACTURING PROCESS OF THESE FUEL FILTERS AND I THEORIZE THAT THE MENTHANOL CONTENT IN OUR FUEL HERE IN THE US COULD CONTRIBUTE TO THIS FAILURE.  IT IS NOT RELATED TO UV BECAUSE OF THE LOCATION OF THE PART. THE WAY AUDI HANDLED THIS PROBLEM MADE ME FEEL THAT IT IS A KNOWN ISSUE WITH THEM AND THEY WANTED TO MAKE EVERYTHING RIGHT AS QUICK AS POSSIBLE.  HOWEVER, NO RECALL WAS EVER ISSUED BY AUDI FOR THIS PROBLEM.  IT MAY BE LARGER THAN ANYONE BELIEVES. AUDI CASE NUMBER: 715005998",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2015",
        "dateOfIncident": "08/27/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787474,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LH DIPPED LIGHTING FLICKERS OFF AFTER ABOUT 1 MIN.  IT WILL NOT COME BACK UNTIL THE VEHICLE IS RESTARTED.  PROBLEM WILL REOCCUR AS PER ABOVE.  IT SOUNDS LIKE A COMMON PROBLEM THAT SHOULD BE REPAIRED BY THE MANUFACTURER.",
        "vin": "WA1LKAFP7AA"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2012",
        "dateOfIncident": "02/26/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483936,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SUDDENLY STOPPED NOT LETTING ME START THE ENGINE OR MOVE THE CAR AGAIN AFTER TWO MINUTES. IT WAS SOMETHING VERY DANGEROUS BUT I WAS LUCKY THAT NO OTHER CAR WAS BEHIND US AT THAT MOMENT. WHEN WE HAD THE CHANCE TO SWITCH THE CAR ON AGAIN, THERE WAS AN ALERT SYMBOL SHOWN TELLING US TO DRIVE CAREFULLY AT VERY SLOW SPEED AND PREFERABLY TO TAKE IT TO THE DEALER FOR SERVICE. THE DEALER HAD THE CAR FEW WEEKS WHERE THEY CHANGED SOMETHING IN THE AUTOMATIC GEAR SYSTEM AND ITS SOFTWARE. THIS CAR HAD PREVIOUSLY AN ENGINE CHANGE MORE THAN A YEAR AGO FOR PROBLEMS IN THE OIL CONSUMPTION. ALL THIS HAPPEN IN COSTA RICA (NOT USA). *TR",
        "vin": "WAUZZZ8R6AA"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400557,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI Q5. THE CONTACT STATED THAT WHILE DRIVING IN INCLEMENT WEATHER, THE WINDSHIELD WIPERS ALMOST FRACTURED FROM THE VEHICLE. IN ADDITION, HE STATED THAT THE VEHICLE WENT THROUGH A CAR WASH AND THE WIPERS COMPLETELY FRACTURED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO RECOMMENDED HAND WASHING THE VEHICLE SINCE THE CAR WASH BRUSHES WOULD PULL THE WIPERS FROM THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO CONCLUDED THAT THE AUTOMATIC RAIN SENSOR WAS TURNED ON WHICH CAUSED THE WIPERS TO ACTIVATE. THEY DID NOT OFFER ANY ASSISTANCE SINCE THEY STATED THAT THEY WERE NOT RESPONSIBLE FOR THE FAILURE. THE VIN WAS NOT AVAILABLE AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 23,600.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/21/2010",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371909,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI Q5 HAS BARELY 5000 MILES ON THE ODOMETER AND HAS BEEN THROUGH ITS FIRST SERVICE A WEEK BACK. THIS MORNING WHILE DRIVING TO WORK THE COOLANT LIGHT CAME ON AND THE VEHICLE HAD TO BE TOWED TO THE DEALER. WAS LATER INFORMED THAT IT WAS THE WATER PUMP THAT WAS THE CAUSE OF THE PROBLEM AND I WILL NEED TO WAIT FOR THREE DAYS WHILE THE SERVICE CENTRE PROCURES ONE. GIVEN THE INCREASING OCCURRENCE OF WATER PUMP FAILURE WITH THE Q5, I FEEL AUDI NEEDS TO BE MORE PROACTIVE IN ADDRESSING THIS ISSUE THEREBY AVOIDING INCONVENIENCE TO ITS CUSTOMER BASE. *TR",
        "vin": "WA1LKBFP7AA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2010",
        "dateOfIncident": "12/19/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371227,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN COLD WEATHER VEHICLE BECAME DISABLED. PULLED OVER AND FOUND  COOLANT ALL OVER THE ENGINE. VEHICLE HAD TO BE TOWED TO THE DEALER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368429,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SUDDENLY LOST ALL ITS COOLANT FLUID WITH ABOUT 15000 MILES ON THE ODOMETER. *TR",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2010",
        "dateOfIncident": "11/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366974,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI Q5 WITH CAMSHAFT SENSOR FAILURE RESULTING IN THE EPC SYSTEM ENGAGING WHICH PUTS THE VEHICLE IN SAFE-MODE. FIRST ATTEMPT AT REPAIR FIXED NOTHING. AUDI DID NOT ALLOW THE DEALER TO REPLACE THE FAILED SENSOR ON THE FIRST REPAIR VISIT, RATHER THEY INSTEAD SWAP LIKE-SENSORS AROUND, THE SEEMING EQUIVALENT OF RE-ARRANGING A BURNED OUT LIGHT BULB.  IT IS QUITE FRIGHTENING WHEN THE EPC SYSTEM DEPLOYS, AND A MORE PROACTIVE APPROACH FROM AUDI ON DEALING WITH THIS FAIRLY COMMON PROBLEM SHOULD BE MANDATED. *TR",
        "vin": "WA1VKBFP9AA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/14/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS SITTING OVERNIGHT IN SUB FREEZING TEMPERATURES (APPROX 30 DEGREES F).  STARTED THE VEHICLE AND DROVE THE VEHICLE FOR APPROXIMATELY 15 MINUTES WHEN ALL OF A SUDDEN THE BLOWER MOTOR WAS NO LONGER BLOWING HOT AIR INTO THE INTERIOR OF THE CAR, AND SOON THE LOW COOLANT LIGHT FLASHED.  I PULLED OVER QUICKLY, OPENED THE HOOD AND SAW THAT THERE WAS COOLANT SPREAD THROUGH OUT THE ENGINE BAY DUE TO THE WATER PUMP FAILING.  I WAS NO LONGER ABLE TO DRIVE THE VEHICLE.   THIS SEEMS TO BE A COMMON ISSUE WITH THIS PARTICULAR ENGINE IN THIS VEHICLE.  AUDI SEEMS TO BE AWARE OF THE ISSUE, AND IS REPLACING SOME WATER PUMP'S PRIOR TO THEM FAILING, AND NOT REPLACING OTHERS.  I CONTACTED 2 SEPARATE AUDI SERVICE CENTERS IN AN ATTEMPT TO HAVE MY WATER PUMP REPLACED AS I WAS ABOUT TO TRAVEL TO CANADA WITH THE CAR FOR A VACATION AND DID NOT WANT TO BE STRANDED.  BOTH TIMES I WAS TOLD THERE WAS NO ISSUE.  OBVIOUSLY THERE IS.  SUCH A HIGH RATE OF FAILURE FOR SUCH AN IMPORTANT ENGINE COMPONENT CANNOT BE TOLERATED, ESPECIALLY WHEN FAILURES ARE OCCURRING ON ENGINES WITH SUCH LOW MILEAGE.  A RECALL SHOULD BE ISSUED TO CORRECT THIS ISSUE.  FORTUNATELY THE FAILURE OCCURRED IN A LARGE CITY WHERE I HAD ACCESS TO AN AUDI SERVICE CENTER.  IF IT OCCURRED WHILE I WAS IN TRANSIT TO MY DESTINATION I MAY HAVE BEEN IN A REMOTE LOCATION WHERE I COULD NOT EASILY RECEIVE HELP IN A TIMELY MANNER, PUTTING MY LIFE IN RISK, ESPECIALLY DURING THE WINTER SEASON.  PLEASE SEE THIS THREAD FOR MORE INFORMATION ON OTHER KNOWN OCCURRENCES OF FAILURE:  HTTP://FORUMS.AUDIWORLD.COM/SHOWTHREAD.PHP?T=2791558",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329087,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SOMETIMES HAS A HARD DOWNSHIFT FROM 2ND TO 1ST AND A HARD UP SHIFT FROM 1ST TO 2ND. IT MAKES A CLUNK NOISE AND CAUSES TO CAR TO JERK AND OR LUNGE.  I SEE MANY COMPLAINTS ON THE INTERNET FOR THIS ISSUE AND I THINK I WAS SOLD THIS AUTO WITHOUT DISCLOSURE OF AN KNOWN ISSUE. *TR",
        "vin": "WA1LKAFP5AA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324399,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HESITATION/LACK-OF-ACCELERATION WHEN MOVING FROM A STOP OR FROM LOW SPEEDS.  ESSENTIALLY, I'M EITHER MOVING VERY SLOWLY OR I HAVE TO FLOOR THE GAS PEDAL TO FORCE THE TRANSMISSION TO CHANGE GEARS, AND THEN THE CAR 'TAKES OFF'.  THERE IS NO MIDDLE GROUND (I.E. I CAN'T SIMPLY ACCELERATE 'NORMALLY').  IT IS DANGEROUS WHEN MERGING ON TO A HIGHWAY OR OUT OF A DRIVEWAY OR SHOPPING CENTER AND ONTO A BUSY ROAD. *TR",
        "vin": "WA1LKAFP8AA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302595,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2010 AUDI Q5 EXHIBITED TWO DANGEROUS TRANSMISSION RELATED PROBLEMS WITHIN THE FIRST COUPLE WEEKS OF OWNERSHIP IN JANUARY 2010.  BOTH ISSUES WERE INTERMITTENT AND UNPREDICTABLE.  FIRST, UPON SLOWING TO A STOP, JUST PRIOR TO COMPLETE STOP THE CAR WOULD SUDDENLY SURGE FORWARD ON ITS OWN WITH ALMOST ENOUGH FORCE TO OVERPOWER BREAKING IF YOU DIDN'T REACT QUICKLY BY APPLYING MORE BREAK PRESSURE.  SECONDLY, THE CAR WOULD EXPERIENCE A LAG IN ENGAGING GEARS WHEN ATTEMPTING TO ACCELERATE FROM A STOP OR NEAR STOP.  MY WIFE ALMOST GOT IN AN ACCIDENT WITH ONCOMING TRAFFIC WHILE INITIATING A LEFT TURN AT A BUSY TRAFFIC INTERSECTION BECAUSE SHE APPLIED THE GAS PEDAL AND THE CAR MERELY IDLED FORWARD INTO ONCOMING TRAFFIC.  AFTER A LONG LAG THE GEARS ENGAGED AND THE CAR ACCELRATED JUST IN TIME TO CLEAR THE INTERSECTION BEFORE GETTING HIT.  MY WIFE AND I EACH SEPARATELY AND TOGETHER EXPERIENCED BOTH ISSUES MULTIPLE OCCASIONS.  WE BROUGHT THE Q5 BACK TO SANTA MONICA AUDI.  THEY TOOK A LOOK AND FOUND THAT A TRANSMISSION VALVE AND FILTER WERE \"OBVIOUSLY INSTALLED INCORRECTLY AT THE FACTORY\".  BOTH PARTS NEEDED REPLACEMENT.  THEY DID THE WORK BETWEEN JAN. 11 - JAN. 25 2010.  I ONLY HAD THE CAR BACK FOR 24 HOURS BEFORE NOTICING THE SAME ISSUES AGAIN.  I BROUGHT IT BACK TO THEM ON JAN. 26TH.  THE CAR IS AT THIS TIME STILL AT THE DEALERSHIP AND AN AUDI ENGINEER FROM AUDI OF AMERICA IS ON HIS WAY TO TAKE A LOOK AT IT THIS WEEK.  I HAVE BEEN IN COMMUNICATION WITH AT LEAST 5 OTHER Q5 OWNERS WHO HAVE EXPERIENCED SIMILAR TRANSMISSION ISSUES TO VARYING DEGREES.  SOMETHING SHOULD BE DONE ABOUT THIS BEFORE IT CAUSES A MAJOR ACCIDENT.  *CN",
        "vin": "WA1LKAFP0AA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2009",
        "dateOfIncident": "11/26/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293752,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HESITATION AND \" JERKING\". *TR",
        "vin": "WA1CKAFP0AA"
    }
]