[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160532,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CANNOT GET AUDI TO REPLACE AIRBAG. HAVE WAITED OVER A YEAR. CALLED DOZENS OF TIMES.",
        "vin": "WAUCGAFH9AN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI S5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (AUDI FREMONT, 43191 BOSCELL RD, FREMONT, CA 94538) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046462,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I'VE RECEIVED CARDS IN THE MAIL STATING THAT I'M OVERDUE ON GETTING THE AIRBAG RECALL COMPLETED.  MY CAR HAS BEEN TO DAY AUDI IN MONROEVILLE, PA 3 TIMES IN THE LAST 1.5 YEARS AND THEY INFORM ME THAT THEY HAVE NO AIRBAGS IN STOCK.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030093,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OVERHEATED AUGUST 21, 2017. IT LEFT ME STRANDED ON THE SIDE OF A BUSY HIGHWAY. I TOOK IT TO DAY AUDI MONROEVILLE, PA. THE DEALER ADVISED THAT AN AUDI THERMOSTAT RECALL WAS JUST ISSUED. I PAID FOR THE REPAIR $999.71 AND WAS PROMISED BY AUDI CUSTOMER CARE THAT I WOULD BE REIMBURSED. AS OF SEPTEMBER 27, 2017, I WAS ADVISED THAT MY VIN NUMBER DOES NOT FALL UNDER THE THERMOSTAT RECALL AND THAT THE RECALL HAS TO BE ISSUED BY THE NHTSA.  THEREFORE I RECEIVED AN EMPTY PROMISE FROM AUDI THAT I WOULD BE REIMBURSED.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993527,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A \"GEARBOX MALFUNCTION\" INTERMITTENTLY OCCURS, LEAVING THE CAR IN A \"NON-MOVING\" STATE.  WHEN THIS ISSUE OCCURS, AN ATTEMPT TO START THE VEHICLE FROM A DEAD STOP WILL MOVE THE VEHICLE ONLY ENOUGH TO GET YOU INTO TRAFFIC AND POTENTIALLY GET BROADSIDED OR REAR-ENDED. THE CAR SIMPLY \"STOPS MOVING\" RIGHT WHEN YOU NEED IT TO MOVE IN ORDER TO MERGE INTO TRAFFIC. IT WILL NOT MOVE BUT REMAINS RUNNING AND IN GEAR.  I'VE SPENT OVER $3000 DOLLARS TO FIX THE ISSUE (REPLACED MECHATRONIC UNIT AND BATTERY) BUT THE ERROR STILL OCCURS. THE CAR IS EFFECTIVELY USELESS AND COUNTLESS OTHERS HAVE THE SAME ISSUE AS SEEN WITH ANY SIMPLE GOOGLE SEARCH.  AFTER TURNING THE CAR OFF FOR APPROXIMATELY 5 MINUTES, THE ISSUE WILL STOP, ONLY TO REAPPEAR AGAIN RANDOMLY AT ANOTHER INTERSECTION.",
        "vin": "WAUVGAFH8AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN TRAFFIC THE CAR WILL LOSE POWER WITHOUT WARNING. WHICH MAKES IT VERY DANGEROUS TO PULL OVER ALMOST HITTING UPCOMING TRAFFIC WITH NO ACCELERATION. AUDI SAYS IT'S A MECHATRONIC UNIT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940030,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED OF GOING ON LIMP MODE ABOUT ONCE A MONTH THEN IT STARTED TO GET MORE FREQUENT. LIMP MODE WAS SUPPOSED TO BE DESIGNED TO PUT YOUR CAR INTO A LOWER GEAR TO PROTECT THE TRANSMISSION, BUT INSTEAD OF DOING THAT THE CAR WOULD SHIFT ITSELF INTO NEUTRAL POSITION WHILE ON THE FREEWAY CAUSING ME NOT HAVE A FULL CONTROL OF THE CAR MAKING IT VERY DANGEROUS TO PULL OVER. AS SOON AS I TURN OFF THE CAR AND TURN IT ON THE CAR WOULD RUN NORMAL AGAIN. WHILE DRIVING ON THE FREEWAY IT WILL GO OFF ON LIMP MODE INTO THE NEUTRAL WITHOUT WARNING. RIGHT AFTER THAT THE CAR WOULD START HAVING STARTING UP PROBLEMS SO I HAD TO PAY MONEY OUT OF MY POCKET TO HAVE THE ECU REPLACED AND THE FUEL REGULATOR REPLACED AS WELL. AS OF DECEMBER 2016 I STARTED HAVING NEW PROBLEMS WITH THE FUEL SYSTEM. SEEMS TO ME LIKE THAT LIMP MODE HAS AFFECTED MY WHOLE CAR AND IT HAS TO BE FIXED. THE CAR IS NOT SAFE TO DRIVE BUT IT IS MY ONLY FORM OF TRANSPORTATION. I TOOK IT TO AUDI DEALERSHIP AND THEY SAID THE LIMP MODE WAS RELATED TO THE TRIPTRONIC MODULE THAT WAS LOCATED INSIDE THE TRANSMISSION AND IT WAS A $5,000 FIX. I HAVE FOUND OUT THAT PUTTING THE CAR INTO SPORT MODE WOULD MAKE IT LESS LIKELY TO GET ITSELF INTO LIMP MODE THAN DRIVING THE CAR NORMALLY BUT EVEN THOUGH DRIVING THE CAR INTO SPORT MODE WHILE DRIVING ON THE FREEWAY THE CAR WILL STILL GET ITSELF INTO LIMP MODE MAKING THE CAR UNSAFE TO PULL OVER THE CAR. I ALMOST GOT HIT ONCE TRYING TO CHANGE LANES WHILE THE CAR WAS SHIFTED INTO NEUTRAL WITHOUT WARNING.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934858,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- I WAS INFORMED IN FEBRUARY, IT'S NOW DECEMBER WILL THIS EVER GET FIXES?",
        "vin": "WAUVGAFH8AN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908811,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -  NOTICE DATED FEB. 9, 2016 - UNREASONABLE DELAY IN REPLACING DRIVERS SIDE AIRBAG INFLATOR WHEN DEATH OR SERIOUS INJURY COULD OCCUR. WHY ISN'T AUDI EXPEDITING THIS RECALL?",
        "vin": "WAUCGAFHXAN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2016",
        "dateOfIncident": "08/02/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN HOT WEATHER, ON A BUSY BOULEVARD, COMING TO A RED LIGHT, AS AUTOMATIC TRANSMISSION SHIFTS DOWN TO FIRST GEAR, CAR LURCHES FORWARD WITH A STRONG BANG IN THE TRANSMISSION. ALMOST HIT  PEDESTRIANS IN THE CROSSWALK. IF I WAS NOT HEAVY ON THE BRAKE PEDAL THERE WOULD NO DOUBT HAVE BEEN INJURIES. THIS IS NOT AN ISOLATED INCIDENT. IT HAS HAPPENED MANY TIMES AND WITHOUT WARNING. AUDI SERVICE TELLS ME IT IS THE MECHATRONIC UNIT IN THE TRANSMISSION MALFUNCTIONING WHEN IT GETS HOT. NEEDS TO BE REPLACED. I HAVE BEEN COMPLAINING ABOUT THIS TO AUDI SERVICE FOR MORE THAN FOUR YEARS AND IT IS GETTING WORSE. AUDI HAS BEEN STALLING AND HAS REFUSED TO REPLACE THE MECHATRONIC UNIT UNDER WARRANTY.",
        "vin": "WAUVGAFH4AN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "04/07/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 AUDI S5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUCGAFHXAN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864720,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI S5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS UNAVAILABLE.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851241,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI S5 S-TRONIC TRANSMISSION JUMPS AND JERKS WHEN COMING TO A COMPLETE STOP.",
        "vin": "WAUCGAFH1AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795144,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 AUDI S5. THE CONTACT STATED THAT THE VEHICLE LUNGED FORWARD WITHOUT WARNING WHEN THE GEAR ENGAGED. THE DEALER DIAGNOSED THAT THE MECHATRONICS WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE PERSISTED. THE CONTACT MENTIONED THAT THE VEHICLE WENT BACK TO THE DEALER TWO MORE TIMES AND THE TECHNICIAN DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "WAUVGAFH4AN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/20/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789693,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A FOLLOW-UP TO COMPLAINT 10785783; AFTER RETRIEVING THE VEHICLE HISTORY IT REVEALED THE PROBLEMS DESCRIBED IN THE INITIAL COMPLAINT HAVE OCCURRED IN THE PAST AS WELL AND THIS CLEARLY INDICATES COMMON AND REOCCURRING MANUFACTURING ISSUES THAT SHOULD BE ADDRESSED BY VAG:  1) THE TRANSMISSION 0B5 DL501 HAD BEEN ALREADY SERVICED FOR MECHATRONICS ISSUES AT 58.273 MILES. PLEASE NOTE THAT THIS TRANSMISSION IS ALSO USED ON SIMILAR AND MORE COMMON MODELS: A4,S4, A7...IN THE PAST VW HAD ISSUED AN EXTENDED WARRANTY FOR DSG TRANSMISSION BUT DID NOT INCLUDE THESE MODELS ALTHOUGH IT SHOULD.    2) THE THERMOSTAT HAD ALSO FAILED BEFORE AT 22.415 MILES...ALTHOUGH THERE WAS A CAMPAIGN FOR THE SAME PART NUMBER IT DIDN'T COVER THIS SPECIFIC MODEL. A TECHNICIAN ACTUALLY SAID THEY ARE KNOW TO FAIL.    3) FOR THE BRAKES AUDI SAYS IT IS SOMEHOW \"NORMAL\"",
        "vin": "WAUVGAFH7AN"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2015",
        "dateOfIncident": "05/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785783,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "1) THE MAIN SAFETY CONCERN IS THE 7 SPEED DSG/S-TRONIC AUTOMATIC TRANSMISSION WHICH FEELS JERKY WHEN REACHING TO A STOP; THE BREAKS FULLY ENGAGED AND THE VEHICLE TRIES A SUDDEN MOVE FORWARD DUE TO THIS. VARIOUS TPI'S RELATED TO THE PROBLEM (TPI 2023830/1 JERK WHEN STOPPING, HARD 2-1 SHIFT, S-TRONIC). AUDI DEALERSHIPS ARE ASKING FOR ABOUT 500$ JUST TO UPGRADE THE SOFTWARE ON THE TRANSMISSION WITHOUT A GUARANTEE THIS WILL FIX THE PROBLEM.    ALSO WHEN SHIFTING FROM N TO D IT IS VERY SUDDEN AND FORCEFUL WHICH FEELS UNSAFE.    2) BRAKE SAFETY CONCERN: THE BREAK PEDAL SINKS SLOWLY TO THE FLOOR UNDER PRESSURE ALTHOUGH THE BREAKS WERE COMPLETELY SERVICED (NEW ROTORS, PADS, MASTER BREAK CYLINDER AND BRAKE FLUID). TESTED OTHER AUDI VEHICLES AND A SIMILAR BEHAVIOR WAS NOTICED.    3) I HAD ALSO A FAILED THERMOSTAT WHICH I FOUND TO BE UNDER WORKSHOP CAMPAIGN 19H3 2024932/1 THAT INDICATED SAME PART NUMBER FOR THE THERMOSTAT TO FAIL BUT THE DEALERSHIP REFUSED TO REPLACE IT FOR FREE BECAUSE THE CAMPAIGN DID NOT INCLUDING MY CAR'S VIN. INITIALLY I WAS TOLD TO TAKE IN THE CAR AND THEY WILL FIX IT FOR FREE BUT THAT DIDN'T HAPPEN. WHY DOES IT MATTER IF THE CAMPAIGN DOES NOT INCLUDE A CERTAIN VIN WHEN THE SAME PART NUMBER WAS INVOLVED IN THE FAILURE.    AS A FINAL NOTE I FIND OUTRAGEOUS THE FACT THAT AUDI REFUSES TO PROVIDE FREE SOFTWARE UPDATES TO FIX DESIGN ISSUES RELATED TO THE GEARBOX AND INSTEAD CHARGE A CONSIDERABLE AMOUNT FOR FIXING SAFETY ISSUE ON THEIR VEHICLES.",
        "vin": "WAUVGAFH7AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "09/17/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781020,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A KNOWN PROBLEM WITH THE AUDI S-TRONIC TRANSMISSION WHERE THE MECHATRONICS UNIT WHICH CONTROLS THE SHIFTS IS DEFECTIVE. THIS WILL RESULT IN THE MECHATRONIC NEEDING TO BE REPLACED TO THE TUNE OF 4 THOUSAND DOLLARS OR AT WORST THE TRANSMISSION TO BE REPLACED FOR 11 THOUSAND DOLLARS. THE CAR WILL START DOING HARD 2 TO FIRST SHIFTS AND ALMOST THROW YOU INTO THE CAR IN FRONT OF YOU IF YOU DO NOT PUSH DOWN HARD ON THE BRAKES. THIS HAPPENS ON A CITY STREET OR IN HEAVY TRAFFIC ON THE HIGHWAY AND BEGINS WHEN THE TRANSMISSION OIL GETS HOT. TECHNICALLY THE VEHICLE CAN BE IN MOTION OR STATIONARY AS IT HAPPENS WHEN IT SHIFTS DOWN TO FIRST GEAR. THIS TRANSMISSION IS IN THE 2010 AUDI S5 CABRIOLET ONLY AS THE COUPE HAS A DIFFERENT DRIVETRAIN. THE AUDI S4 HAS THE TRANSMISSION AS WELL AND EXPERIENCES THE SAME ISSUES.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "05/05/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764105,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING IN STOP AND GO DRIVING FOR A PERIOD OF TIME THE TRANSMISSION STARTS TO ACT UP. WHEN COMING TO A COMPLETE STOP THE CAR WILL SHIFT DOWN INTO FIRST GEAR AFTER THE STOP AND CAUSE THE CAR TO LEAP FORWARD. I HAVE ALMOST REAR ENDED SEVERAL CARS AS A RESULT OF THIS. IT IS A WELL KNOW PROBLEM WITH THE AUDI S-TRONIC TRANSMISSIONS FOUND IN THE AUDI S5 CABRIOLET AND THE AUDI S4 MODELS. THE OIL IN THE MECHATRONICS UNIT HEATS UP AND CAUSES PROBLEMS WITH THE CIRCUITRY WHICH CAUSES THE ISSUE. I HAVE ALREADY HAD IT IN ONCE FOR A \"SOFTWARE UPDATE\" TO THE TUNE OF 800 DOLLARS WHICH DID NOTHING. NOW IT IS LOOKING LIKE THEY WILL NEED TO REPLACE THE COMPONENT WHICH CAN COST UP TO 11 THOUSAND DOLLARS IF THE TRANSMISSION HAS BEEN DAMAGED.",
        "vin": "WAUVGAFH0AN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/07/2011",
        "dateOfIncident": "12/06/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375105,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 AUDI S5 OVERHEATED ON DEC. 6, 2010 IN COLD WEATHER (20 DEGREES) WHILE DRIVING ON HIGHWAY. AUDI REPORTED A WATER PUMP CRACK AND ORDERED THE PART.  SAME PROBLEM OCCURRED ON DEC. 31, 2010, RENDERING CAR DISABLED.  AUDI REPORTED THAT THERMOSTAT REPLACED.  I'VE SEEN NUMEROUS OTHER COMPLAINS ON AUDI S4 VEHICLES AND DEFECT IN WATER SEAL AND/OR PUMP, YET AUDI HAD DONE NOTHING TO WARN THE PUBLIC OR RECALL VEHICLES TO CORRECT THE PROBLEM. NHTSA SHOULD INVESTIGATE BEFORE SOMEONE GETS SERIOUSLY HURT OR KILLED, WHETHER BY THE CAR BREAK DOWN OR GETTING STRANDED SOMEWHERE OUT OF CELL PHONE RANGE IN COLD WEATHER. *TR",
        "vin": "WAUCGAFH6AN"
    }
]