[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360019,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010, R1200RT MOTORCYCLE THAT IS SPRAYING LARGE AMOUNTS OF ATOMIZED GAS OUT FROM THE TOP OF THE PLASTIC FUEL PUMP HOUSING FROM A HAIRLINE CRACK NEAR THE HIGH PRESSURE OUTLET. THE HOUSING IS A NON WEAR PART. IN LOOKING AT THE RECALLS I SEE THAT ON DECEMBER 12, 2013 THERE WAS A RECALL CAMPAIGN (NHTSA # 13V617000) ON FUEL LEAKS FOR MY MOTORCYCLE THAT DESCRIBES MY ISSUE EXACTLY. I REQUESTED THAT BMW TAKE ACTION AND FIX THE PROBLEM FREE OF CHARGE. THEY HAVE REFUSED. I BELIEVE THAT THEIR SCOPE ANALYSIS OF THE VINS WITH THIS PROBLEM WAS TOO NARROW. I SEE THAT I WILL NOW BE THE 4TH COMPLAINT FILED THIS YEAR AND IS A PATTERN THAT NEEDS ADDRESSED. WHEN THIS HAPPENS, THERE IS A VERY DANGEROUS SITUATION OF A FIRE DEVELOPING WHILE PEOPLE ARE DRIVING OR STOPPED. THIS IS NOT A SITUATION WHERE SOMEONE CAN SEPARATE THEMSELVES FROM THE FLASH FIRE WHILE DRIVING. IT'S EFFECTS (BURNS, LOSING CONTROL) ARE INSTANT TO THE MOTORCYCLE DRIVER.",
        "vin": "WB1044005AZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210483,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE MISREAD THE ACTUAL AMOUNT OF FUEL IN MY TANK CAUSING ME TO RUN OUT OF GAS AT A DANGEROUS INTERSECTION.  I HAD TO GET OFF THE MOTORCYCLE AND PUSH IT ACROSS ONCOMING TRAFFIC (THE ONLY DOWNHILL OPTION) TO A SAFE PLACE ON THE SIDE OF THE ROAD.  I HAD TO WALK FOR 2 MILES TO PURCHASE A GAS CAN AND FUEL IN ORDER TO RESTART AND MOVE THE BIKE.  THIS WAS THE FIRST TIME MY GAS GAUGE FAILED.  THE SENSOR FOR THE GAS GAUGE HAS NOW FAILED 3 TIMES.  THE SECOND TIME I WAS ABLE TO COAST UP A DRIVEWAY HILL INTO A SAFE CHURCH PARKING LOT.  THIS WAS SO LUCKY AS NO SHOULDER WAS AVAILABLE.  RECENTLY, THE THIRD TIME IT FAILED I NOTICED THE FUEL GAGE WAS ACTUALLY GOING UP AS I WAS OPERATING THE VEHICLE.  IT WENT FROM 1/2 TANK TO ALMOST FULL.  THE FUEL STRIP (FUEL SENSOR) IN THE GAS TANK IS THE ROOT CAUSE OF FAILURE.  I NOW HAVE THE 3RD FUEL STRIP REPLACEMENT SCHEDULED FOR 7/12/2019.      IF I RUN OUT OF FUEL IN THE MIDDLE OF A HIGHWAY DURING A RUSH HOUR TIME PERIOD, I COULD LITERALLY BE KILLED (EXAMPLE: I LIVE IN ATLANTA AND HAVE BEEN IN RUSH HOUR ON I-75 / I-285 WHICH IS ABOUT 8-9 LANES WIDE WITH TIGHT AND FAST MOVING CARS AND TRUCKS).    THE FUEL TANK ON THE 2010 BMW R 1200 RT DOES NOT HAVE AN EMERGENCY FUEL RESERVE PETCOCK.  IF THE FUEL GAUGE OVERSTATES THE REMAINING FUEL, AND THE BIKE RUNS OUT OF FUEL, THERE IS NO AVAILABLE RESERVE.  THERE IS NO SAFETY MARGIN.      I JUST PURCHASED A FUEL BOTTLE TO CARRY ON THE MOTORCYCLE FOR AN EMERGENCY.  I DO NOT LIKE THE IDEA OF CARRYING FUEL IN THIS MANNER, NOR SHOULD I HAVE TO.  I CANNOT LOCK IT SAFELY LEAVING OPEN AN OPPORTUNITY FOR VANDALISM, AND I CANNOT GUARANTEE IT WILL NOT LEAK OR RUPTURE.      PHOTOS: PHOTOS WERE TAKEN WHEN BIKE WAS OUT OF FUEL AND DISPLAYING MILES REMAINING AND FUEL LEVEL.  TANK HOLDS 6.6 GL AND I SEE 43 MPG.  THERE SHOULD BE ABOUT A GALLON LEFT IN THE TANK... THIS IS A SIGNIFICANT PERCENTAGE.",
        "vin": "WB1044001AZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949999,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE FAILURE  COMMON PROBLEM ON THIS MOTORCYCLE  GAUGE FAILED WHILE TRAVLING.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704743,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MANY OTHER BMW OWNERS HAVE EXPERIENCED, I EXPERIENCED A FAILURE OF THE FINAL DRIVE (REAR END).  I ENDED A SHORT TRIP AND BECAME AWARE OF HIGH HEAT COMING FROM THE REAR AXLE.  I TRAILERED IT TO THE DEALERSHIP WHERE I WAS INFORMED IT WAS A FINAL DRIVE FAILURE, WORN BEARINGS AND A WOBBLY REAR WHEEL.  THEY INFORMED ME IT WAS A DRY PARK REQUIRING NO MX ON MY PART AND COULD OFFER NO EXPLANATION FOR ITS PREMATURE FAILURE.  UPON MY WEB RESEARCH, THE \"DREADED FINAL DRIVE FAILURE\" IMMEDIATELY POPS UP ON MANY SITES AND ONE SUGGESTED I FILE A COMPLAINT HERE.   *TR",
        "vin": "WB1044003AZ"
    }
]