[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "07/22/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536546,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE INCIDENTS ON THE SAME DAY WITHIN 35 MILES. THE AMBIENT AIR TEMPERATURE WAS 95 DEGREES FOR THE FIRST INCIDENT, AND IN THE MID- 80S (WHILE GRADUALLY RISING IN ALTITUDE ON A MOUNTAIN ROAD) FOR THE 2ND AND 3RD.  THE GAS TANK WAS HALF EMPTY-ABOUT 2 GALLONS REMAINING:  1ST INCIDENT) RODE THREE MILES ON A FLAT, PAVED ROAD. STOPPED AND TURNED OFF IGNITION TO DISABLE ABS AT START OF DIRT ROAD.  BMW WOULD NOT RESTART FOR ABOUT 10 MINUTES.  2ND & 3RD INCIDENTS) 10 MILES LATER WHILE RIDING IN 2ND OR 3RD GEAR IN THE RANGE OF 20 - 30 MPH, THE BMW LOST ALL POWER AND THE ENGINE STOPPED.  I WAS ABLE TO RESTART BMW AFTER SEVERAL MINUTES EACH TIME.    THIS IS A SAFETY ISSUE: HAD THE ENGINE STOPPED WHILE TURNING A CORNER AT A BUSY INTERSECTION IN A CITY, THE MOTORCYCLE COULD FALL OVER WITHOUT POWER. ALSO, WITHOUT POWER, A RIDER MIGHT NOT BE ABLE TO SAFELY MANEUVER AWAY FROM TRAFFIC.    THIS ISSUE HAS BEEN WELL REPORTED ON BMW OWNER AND RIDER FORUMS IN THE U.S., IN THE U.K. AND IN AUSTRALIA. BMW DEALERS HAVE SEEN CUSTOMER COMPLAINTS, YET THE DEALERS AND THE MANUFACTURER, BMW THROUGH ITS REGIONAL AND NATIONAL MANAGERS, DENY KNOWLEDGE OF THE PROBLEM.  REPORTED FIXES HAVE INVOLVED FUEL PUMP REPLACEMENT AND ELECTRONIC FUEL RE-MAPPING AT CUSTOMER COST.  THIS IS A SAFETY ISSUE AND SHOULD BE A REQUIRED MANUFACTURER RE-CALL, REGARDLESS OF WARRANTY DATE.  *TR",
        "vin": "WB1022804AZ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342947,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW R1200RT MOTORCYCLE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE STALLED. THE CONTACT WOULD SHUT OFF THE ENGINE AND WHEN RESTARTING, THE VEHICLE WOULD RESUME NORMAL OPERATION. THE DEALER ADVISED THERE WAS A DEFECTIVE CAM GEAR IN HIS YEAR, MAKE AND MODEL AND THE MANUFACTURER WAS AWARE OF THE FAILURE. THE DEALER ADVISED THE TOOL NEEDED TO MAKE THE REPAIR TO THE VEHICLE WAS NOT AVAILABLE YET WAS EXPECTING IT TO ARRIVE WITHIN TWO WEEKS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED BUT DID NOT PROVIDE ANY ASSISTANCE.  THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 700.",
        "vin": "WB1044003AZ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343018,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW F650 GS MOTORCYCLE. THE CONTACT STATED THE VEHICLE WOULD STALL WITHOUT WARNING.  THE VEHICLE WAS  TAKEN TO THE DEALER FOR REPAIRS UNDER NHTSA RECALL CAMPAIGN ID NUMBER: 09V499000 (ENGINE AND ENGINE COOLING) BUT DID NOT CORRECT THE FAILURE. AFTER REPAIRS, THE VEHICLE STALLED WITHOUT WARNING WHILE TRAVELING AT 55 MPH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER IN CANADA WHERE THE HOSES WERE RE-ROUTED. THE FAILURE DID NOT RECUR.  THE MANUFACTURER WOULD NOT OFFER ANY ASSISTANCE. THE FAILURE MILEAGE WAS 3,000 AND THE CURRENT MILEAGE WAS 10,600.",
        "vin": "WB1022804AZ"
    }
]