[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221451,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LINE ADAPTER  LEAKING BRAKE FLUID. THIS IS AN ALUMINUM FITTING THAT CONNECTS THE STEEL BRAKE LINE TO THE FLEXIBLE LINE GOING TO THE REAR WHEEL. CRACKS FORMED ON BOTH  THREADED ENDS.  BMW PART NUMBER 34327679297.  I  REPLACED  THIS PART MYSELF .   THE REAR BRAKE RESERVOIR  WAS EMPTY .",
        "vin": "WB1044000AZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "12/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933861,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENSOR SHOWS YOU HAVE FUEL WHEN IT HAS NONE AND LET'S YOU RUN OUT AND STALL IN THE MIDDLE OF THE INTERSTATE. BMW HAS AN EXTENDED RECALL WHERE THEY WILL REPLACE THE DEFECTIVE FUEL STRIP WITH THE SAME DEFECTIVE FUEL STRIP. I HAVE HAD THIS DONE FOR THE PAST THREE YEARS AND THEY SAY THEY HAVE NO INTENTIONS OF COMING UP WITH A REPLACEMENT PART THAT ACTUALLY SOLVES THE PROBLEM. THEY SEEM TO THINK THEY ARE UNTOUCHABLE BECAUSE THEY HAVE MADE THIS EXTENDED WARRANTY WHICH KEEPS PROCESSES WHICH COULD BE PUT IN PLACE TO MAKE THEM REPAIR THE PROBLEM OTHER THAN IF ENOUGH PEOPLE WOULD CONTCACT THE FEDERAL TRADES COMMISSION AT 1-877-382-4357 AND MAKE A COMPLAINT AND IF ENOUGH PEOPLE DID THEY COULD MAKE THEM STRAIGHTEN OUT THIS PROBLEM WHICH THEY ARE CALLING A DEFECTIVE PRODUCT. THANKS FOR ANY HELP OR INPUT.",
        "vin": "WB1039800AZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892626,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2010 BMW R1200RT MOTORCYCLE AND THERE IS A SERIOUS SAFETY ISSUE WITH THE HANDLEBAR MOUNTED SWITCH GEAR. THE SAID COMPONENTS HAVE BEEN AN ISSUE CAUSING INOPERABLE HIGH BEAMS, CRUISE CONTROL, TURN SINGLES, AND HORN, BUT THE REAL ISSUE IS THE START/RUN SWITCH AND THE INTERMITTENT FAILURE CAUSING A NO START CONDITION AT THE VERY LEAST THE REAL DANGER IS WHEN THE SWITCH FAILS WHEN UNDER POWER WHICH HAPPENED TO ME TWICE AT HIGHWAY SPEEDS! SOMEONE WILL BE KILLED IT IS JUST A MATTER OF TIME.",
        "vin": "WB1044000AZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2012",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483688,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME MY MOTORCYCLE RAN OUT OF FUEL EVEN THROUGH THE FUEL GAUGE WAS READING 1/4 TANK.  IT OCCURRED AT HIGHWAY SPEEDS.  THE ENGINE JUST STOPS RUNNING WITHOUT WARNING. THIS IS THE 4TH TIME THAT MY MOTORCYCLE FUEL SENSOR HAS FAILED.  WE NEED BMW TO RECALL AND INSTALL A FLOAT SYSTEM SIMILAR TO THE NEW MODELS.  BMW HAS BEEN AWARE OF THIS PROBLEM FOR YEARS AND REFUSES TO TAKE RESPONSIBILITY. *TR",
        "vin": "WB1044007AZ"
    }
]