[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441363,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle was covered under a 10 year BMW limited extended warranty to address factory defective bolts that caused a dangerous failure of the VANOS system (bolts backing out) - which can be read about in service bulletin SB-10057335-7958 or SI B01 10 14.  I started experiencing the symptoms (warning lamps, rough engine, engine noise, stalling) outlined in this bulletin in 2018, then in 2020, after several failed repairs, I was made aware of the warranty. I immediately scheduled an appointment at my local BMW dealership (BMW of Rochester) and when they called to give me the diagnosis they told me that my car needed an oil change and that if I wanted them to check for the broken bolts they would need to take apart the motor, potentially costing me hundreds of more dollars in labor if the part in question (bolts, covered under warranty) was not broken. They told me the car was running as designed and not to worry about it.  I spent the following year and a half attempting to fix persistent issues I thought were unrelated to the part in question. I recently replaced some major parts and upon the mechanic concluded to me that in fact the remaining issues could only be related to the part in question, and to have BMW take another look.  I made a new appointment with the dealership to diagnose the issue once again, only this time explaining that I was confident they had misdiagnosed it originally. This time they did not threaten extra costs to take the motor apart and in fact told me it only took them 10 minutes to \"scope\" the motor with a camera. They confirmed the part in question is broken and are now charging me $6000 out of pocket to fix it, even though the part was under warranty just months ago, the first time I brought it to them.  The part being broken makes my car unsafe to drive, and BMW recommends not driving it until it is fixed. BMW NA refuses to honor the warranty due to expiration, and the dealership is also refusing to pay for the repairs. Car is UNSAFE.",
        "vin": "5uxfe4c58al"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "11/21/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441212,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlight wiring loom insulation on both passenger and driver sides degrading heavily to the point of disintegration on touch. My driver side headlights have stopped working despite best attempts at isolating wires. I have received multiple headlight(low/DRL) warnings and errors because of this issue. It has been verified by countless independent mechanics and hobbyists on this generation of car with no aftermarket or OE solutions. I have since almost collided with objects in the road while driving at night due to this faulty manufacturing. I also fear for an electrical fire which is bound to happen due to exposed wiring. This has been happening for a few months with no improvement and further degradation. I have not had it inspected by BMW.",
        "vin": "5ymgy0c56al"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434188,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 BMW X5. The contact stated that while his wife was driving at 55 mph, the engine temperature warning light was illuminated. The contact's wife pulled over to a service station to let the engine cool off before restarting the vehicle. The vehicle was taken to an independent mechanic and diagnosed as a water pump failure. The dealer was made aware of the failure and informed the contact that there was no recall associated with the VIN. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 150,000.",
        "vin": "5uxfe4c50al"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432658,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER",
                "productYear": "9999",
                "size": "255/50R19",
                "type": "Tire"
            }
        ],
        "summary": "Bridgestone Dueler 255/50R19 107H runflat, DOT EJVUDJE2013 Tire failure: local tread separation in a valley between road contact ridges. Tread separation from underlying belts suggest manufacturing defect. No human life was in danger due to early detection of the fault",
        "vin": "5UXFF0C56AL"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421568,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Front passenger seat occupancy mat (OC3) problem safety code.  Supplemental Restraint System (SRS/AIR BAG SYSTEM)  I contacted BMW OF NORTH AMERICA and they stated my 2010 BMW X5 is to old, one way to look at it. I requested assistance and BMW will not help out.  I am the original owner and MY VEHICLE is garage kept.   This air bag will not deploy and the passenger could be killed and or injured in a accident.",
        "vin": "5UXFE4C53AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2021",
        "dateOfIncident": "06/19/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421514,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS failure on the passenger front seat air bag.  BMW has many safety issues with the Code OC3.  Passenger seat occupancy mat failure, seat pad requires replacement at a cost of $2,000  BMW is aware and is tone deaf to this safety defect. BMW should care about people possible  dying from the airbag failure to deploy.",
        "vin": "5UXFE4C53AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/14/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420797,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 BMW X5. The contact stated that while operating the vehicle with a front-seat passenger in the vehicle, the SRS airbag light remained illuminated, indicating that the front passenger’s side airbag was deactivated. The vehicle was taken to the local dealer who diagnosed that the front passenger’s side seat pad was faulty and needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure. The failure mileage was 30,000.",
        "vin": "5UXFE4C53AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420849,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger Seat Occupancy Mat is not working when a passenger is seated in the car.  The result is the SRS Air Bang will not deploy in a auto accident.   The vehicle was taken to a BMW Dealer Service Department and all they did was reset the code. The problem never was resolved, because the SRS warming light comes on when there Is a passenger sitting in the passenger seat.   I am scared to permit anyone from sitting in the seat.  I contacted BMW OF North America and they stated only the 2005-2008 models are being repaired by BMW.   INDEPENDENT IMPORTED CAR SERVICE STATED THIS IS A COMMON PROBLEM ON THE 2010 BMW X5 models…….the faulty code is OC3.  Please help me, thank you.",
        "vin": "5UXFE4C53AL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352751,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VALVE COVER AND CRANKCASE ARE MANUFACTURED BAD THE CRANKCASE IT'S CRACKED AND LICKING, WHICH IT DAMAGE MY VALVE COVERS, MY CAR WAS DRIVING GOOD ALL OF THE SUDDEN IT DOESN'T DRIVE SMOOTH",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329296,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A SHORT DISTANCE AT LOW SPEEDS THROUGH A CITY, A YELLOW WARNING MESSAGE CAME ONTO THE SCREEN, ALERTING ME THAT THE VEHICLE WAS OVERHEATING AND TO DRIVE CAREFULLY. ONLY SECONDS LATER A SECOND WARNING MESSAGE CAME ONTO THE SCREEN, THIS TIME RED, TELLING ME THAT THE ENGINE HAS OVERHEATED AND I NEED TO STOP DRIVING IMMEDIATELY. AS I SLOWED I COULD HEAR A LOUD FAN NOISE AND BEGAN TO SMELL BURNING PLASTIC. I IMMEDIATELY CONTACTED A TECHNICIAN TO SCHEDULE A REPAIR. I WAS TOLD IT IS A VERY COMMON PROBLEM WITH THE COOLANT PUMP, AND UPON FURTHER INVESTIGATION, I DISCOVERED THAT IT HAS LED TO VERY COSTLY REPAIRS ON TOP OF POTENTIALLY DANGEROUS SITUATIONS. I EVEN DISCOVERED THAT THERE MAY BE A CLASS ACTION LAWSUIT FOR THE FAULTY PARTS, AND IN SOME MODELS HAVE BEEN RECALLED. I CONTACTED BMW DIRECTLY AND THEY TOLD ME MY VEHICLE WAS NOT ELIGIBLE FOR ANY EXTENDED WARRANTY OR RECALL.  *TR",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328567,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER AN UNKNOWN AIR BAG RECALL. AFTER THE VEHICLE WAS REPAIRED, THE AIR BAG WARNING LIGHT ILLUMINATED AND REMAINED ILLUMINATED. THE CONTACT STATED THAT THERE WAS AN UNKNOWN AIR BAG RECALL HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE AIR BAG MODULE AND SEAT SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "5UXFE4C50AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325192,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED EGR COOLER. MECHANIC SAID HE HAS NOTICED THIS IS BECOMING A PATTERN.  *TR",
        "vin": "5UXFF0C56AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/13/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320943,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING VEHICLE THERE IS LOUD KNOCKING/SHIFTING NOISE THAT LASTS A COUPLE SECONDS. THIS HAPPENS 7 OUT OF 10 START-UPS AND OCCURS BEFORE THE VEHICLE IS PUT IN GEAR.  *BF",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320195,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I GO TO THE DEALER  AND THIS DEALER  STAY WITH MY WITH MY CAT OVERNIGHT  . WHEN I PICKUP MY CAR TGE DEALER NO FUND MY CAR, LATER I SEE ON THE DASH CONTINUE SAY THE SAME WARNING  ABOUT RECARD WARNINGS.  I CALL NEXT DAY (DEALERSHIP)  AND THE DEALERSHIP  NO WANT CHECK MY CAR AGAIN ONLY SAY I FIX THE PART STATE SAY NEED FIX. SAY MY CAR NEED MORE PIECE FOR FIX THE PROBLEM ON AIR BAG AND THAT IS NOT TRUE. AND SAY I NEED GO ANOTHER DEALER IAM NOT HAPPY FOR THAT SERVICE. MY CAR , CARFAX, AND HERE (NHTSA) CONTINUE SAY NO REPAIR THE RECALLS ISSUE . I SEND EMAIL THAT DEALER SHIP AND NO RECIEVED  ANSWER.  BMW OF SCHERERVILLE   1400 US-41, SCHERERVILLE, IN 46375",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLEAN DIESEL SYSTEM HAD SOME FAILURE AND GAVE A WARNING THAT THE CAR CANNOT BE RESTARTED IN 200 MILES. WIFE WAS OUT OF STATE ON VACATION IN THE CAR. HE HAD TO DRIVE NON-STOP HOME AND NOW THE CAR SOFTWARE HAS LOCKED OUT THE ABILITY TO START THE VEHICLE. I CAN'T EVEN DRIVE IT TO THE DEALER. HAS TO DO WITH THE SRC SYSTEM THAT BMW EXTENDED THE WARRANTY TO 10 YEARS BECAUSE OF KNOWN PROBLEMS. I CALLED THEM TO REPORT THE PROBLEM BEFORE THE WARRANTY EXPIRED BUT COULD NOT BRING IN BECAUSE MY WIFE WAS DRIVING IT OUT OF STATE. CALLED 12/28/2019 AND WARRANTY EXPIRED ON 12/30/2019. NOW THEY REFUSE THE HONOR THE WARRANTY AND I HAVE TO HAVE THE CAR TOWED FOR REPAIR. INDEPENDENT MECHANICS DO NOT WANT TO TOUCH THIS PROBLEM.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "10/30/2019",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286658,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY BMW X5 TO WORK WAS THERE FROM 1045 AM TO AROUND 730PM DROVE TO THE STORE ABOUT A MILE AWAY THEN DROVE TO THE GAS STATION PUT GAS IN, THEN DRIVE TO A NEAR BY OUTSIDE MALL. WENT IN FOR ABOUT 15 MINS CAME OUT MY WINDOWS WERE COMPLETELY \"FOGGED\" OPEN THE DOOR AND SMOKE CAME ROLLING OUT. OPEN ALL THE DOORS TO LOCATE THE FIRE OPEN THE BACK AND FLAMES CAME SHOOTING OUT FROM UNDER THE BACK PANEL. I OPEN IT AND TRIED TO PUT OUT THE FIRE WITH SOME NEAR BY CLOTHES. A BYSTANDER RAN INTO THE STORE TO GET A FIRE EXTINGUISHER AND PUT OUT THE FIRE. THE FIRE DEPARTMENT WAS CALLED. TOOK PICTURES AND SAID IT WAS THE BATTERY THAT STARTED ON FIRE.",
        "vin": "5UXFF0C57AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230829,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING CHECK ENGINE LIGHT (CEL) PROBLEMS FOR YEARS.  HAVE BEEN TOLD IT WAS FROM THE EGR SYSTEM.  BMW FIRST CHARGED ME OVER $1500 FOR A REPAIR THAT DID NOT WORK. THEN THEY REPLACED THE WHOLE SYSTEM AND SAID IT WAS \"UNDER WARRANTY\" WHEN THE PROBLEM RESURFACED .  NOW THE DIAGNOSTICS ARE AGAIN SAYING THE EGR SYSTEM IS FAULTING AND CAUSING THE CEL AGAIN.  I FEEL BMW NEEDS TO RECALL THIS SYSTEM AND CONTINUALLY REPAIR IT AS IT IS AN ENGINEERING FAULT OF THEIRS",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220713,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS AT HIGH SPEED, FUEL PUMP WARNINGS LIGHT COMES ON. CAR WILL RESET AFTER 30 MINS BUT WILL CONTINUE TO SHUT OFF DURING DRIVING. BOTH FUEL PUMPS HAVE BEEN REPLACED",
        "vin": "WBANW1C51AC"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203261,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON A BRIDGE MY CAR COMPLETELY WENT INTO A STOP. BREAKS INSTANTLY LOCKED AND MY CAR WOULD NOT DRIVE, TURN ON, OR GO ON NEUTRAL THE BREAKS STAYED IN LOCK. POLICE OFFERUP EVEN TRIED TO SEE IF IT'S A SIMPLE BREAK BUTTON. NOTHING WORKED I WAS IN THE MIDDLE OF A BRIDGE LUCKY THE CAR BEHIND ME SWERVED RIGHT AWAY AND MYSELF AND MY DAUGHTER WERE SAFE. I CALLED MY SISTER WHO LIVED DOWN THE STREET, SHE CAME RIGHT AWAY AND PARKED BEHIND ME WITH HER EMERGENCY SAFETY LIGHTS ON. THE CAR WENT INTO SHOCK I COULDN'T EVEN PUT IT IN NEUTRAL SO I CAN MOVE IT FROM THE MIDDLE OF THE BRIDGE. TOWED IT TO BMW NOW THEY SAY IT'S THE COMPUTER SYSTEM AND THE WIRES OF THE CAR THAT CONNECTS TO THE COMPUTER. COST TO FIX IS OVER 3,500 I CAN NOT AFFORD TO FIX. I HAVE 4 TEENAGE KIDS AND NOW NO CAR BECAUSE I CANNOT AFFORD TO PAY FOR THE CAR SERVICES. IN THE PAST 3 YEARS I HAVE PAID OVER 8K IN REPAIRS BY BMW DEALERSHIP SERVICES. THIS IS NOT FAIR",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186005,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICAL WENT IN FOR ECCENTRIC SHAFT SENSOR REPLACEMENT - UPON PICKING UP CAR WAS ADVISED BY JOHN STEEL AT TULLEY BMW TO GO TO SEE NICOLE TO PAY FOR SERVICES AGREED.   I NOTICED THERE WAS A CUSTOMER DECLINED REPAIR FOR A HOOD LATCH.  THIS WAS NEVER DISCUSSED WITH ME PRIOR BY JOHN STEEL - HE MENTIONED IT IS CORRODED AND WILL NEED TO BE REPAIRED AT SOME POINT IN TIME.  THE TECHNICIAN PLAYED WITH IT A BIT AND IT SEEMS OK \"       SENSOR IS NOW ON THE CAR AFTER DRIVING UNDER 5 MILES.   VEHICLE WAS MOVING FELT A VIBRATION",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185008,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR AT 44K MILES REPORTED STALLING WHILE DRIVING.   DEALER DIAGNOSED ECCENTRIC SHAFT SENSOR FAILURE.  I HAVE CONTACTED BMW OF NORTH AMERICA AND MY CAR IS PRESENTLY IN THE DEALERHIP FOR A SECOND RECALL OVER 3 MONTHS.    THIS IS NOT A MAINTENCE ISSUE.   I FEEL IT IS A PRODUCT FAILURE.   I HAVE REQUESTED RELIEF FROM THIS MASSIVE EXPENSIVE AND HAVE ASKED TO BE ALLOWED TO PURCHASED AN EXTENDED SERVICE WARRANTY AT A DISCOUNTED PRICE.   NO RESPONSE AS OF YET.",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184345,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANTLY RECEIVE MESSAGE \"PASSENGER RESTRAINT SYSTEM MALFUNCTION:  FAULT IN PASSENGER-RESTRAINT SYSTEM AFFECTING AIRBAG, BELT TENSIONER OR BELT FORCE LIMITER.\"",
        "vin": "5UXFE8C54AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181946,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS HAD AN OPEN RECALL 18V-336 SINCE MAY OF 2018 . THE VEHICLE MANUFACTURER HAS YET TO PROVIDE A REMEDY TO CORRECT THIS DANGEROUS DEFECT IN THE VEHICLE. WHEN WILL A REMEDY BE PROVIDED? IT SEEM ALMOST A YEAR WOULD BE ENOUGH TIME TO FIX THIS DEFECT .",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179731,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT MAT SENSOR FAULTY LEAVING THE FRONT PASSENGER WITHOUT AIRBAG PROTECTION. I'LL INSTALL A BYPASS DEVICE BECAUSE THEY ARE COMMON AND INEXPENSIVE AND AVAILABLE BECAUSE SO MANY BMWS HAVE THIS ISSUE. THE BYPASS DEVICE WILL ALLOW THE PASSENGER AIRBAGS TO DEPLOY WHETHER A PASSENGER IS IN THE SEAT OR NOT. THE YEARS 2006 AND 2007 SAW RECALL ON THE PASSENGER SEAT SENSOR. THIS NEEDS TO BE ADDRESSED.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170653,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT COMES ON AND I FEELS A DECREASE IN THE ENGINE POWER. I COULD STILL DRIVE, BUT NOT ACCELERATE AS FAST. ERROR CODE READS P2457. TOOK TO DEALER WHO RECOMMEND TO REPLACE THE EGR COOLER, NOT COVERED BY WARRANTY. I ALSO HAVE BEEN EXPERIENCING FOUL ODOR IN THE PASSENGER COMPARTMENT WHEN I TURN ON THE FAN OR HEAT FOR A WHILE PRIOR TO THE CHECK ENGINE LIGHT. I THINK THE ODOR AND THE EGR COOLER MALFUNCTION MAY BE RELATED. I HAVE READ ABOUT EGR COOLER FIRE HAZARD IN UK IN LATER MODELS OF BMW X5 35D DIESEL. BUT MY CAR IS BEFORE THOSE AFFECTED MODELS. I THINK BMW NA SHOULD EXTEND WARRANTY OF THE EGR COOLER TO MY MODEL (2010, E70) BECAUSE IT IS A NECESSARY PART OF THE EMISSION CONTROL SYSTEM AND ENGINE AIR INTAKE SYSTEM. I HAVE CONTACT BMW NA DIRECTLY BY PHONE, AND THEY HAVE NOT BEEN HELPFUL AT ALL.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/24/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163314,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE ELECTRIC RECALL FOR ELECTRIC WATER PUMP.    CAR WAS BROUGHT INTO SERVICE AT TULLEY BMW IN NASHUA FOR ISSUE WITH WATER PUMP.   SERVICE ADVISOR SAID \" ONLY NEED TO REPLACE A FEW BOLTS \"   I FEEL THE CAR HAS ONLY 46,000 AND IS OVERHEATING TO EXCESS SHOWING TEMPERATURE GAGE.   HAD VEHICAL TOWED OVER 100 MILES TO LOCAL SERVICE STATION - FAILED ELECTRIC WATER PUMP -  \" RECALL ISSUE \"   DEALER FAILED TO SERVICE.   ENGINE IS OVERHEATING  - DEALER WANTS TO CHARGE $ 1,500.00 TO REPAIR",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132422,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSION ALWAYS HAD PROBLEM. I HAVE TWO BMW X5 35D HAD SAME PROBLEMS. ACTIVE TANK AND REDUCTANT T ANK LEVEL SENSOR AND TEMPERATURE SENSOR BROKEN AND NEED TO REPLACE WHOLE TANK COST A LOT OF MONEY.",
        "vin": "5UXFF0C52AL"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128649,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEB 2016 DURING DRIVING ON THE HIGHWAY, LOST POWER STEERING AND BATTERY LIGHT COME ON. CAR WAS TOWED TO THE GARAGE TO DETERMINATE CAUSE AND FIX THE PROBLEM. BOLT THAT HOLD PULLEY  TENSIONER WAS BROKEN AND BELT FELL OFF. THERE WAS NO EASY WAY TO REMOVE BRONEK HEAD BOLT OFF FROM ENGINE BLOCK. CAR WAS AT MECHANIC FOR A WEEK, REPLACEMENT BOLT WAS AROUND $6 BUT THE LABOR WAS ALMOST $700.",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124259,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V336000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114753,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 18V336000 (ENGINE AND ENGINE COOLING) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION THE THIRD WEEK ON MAY 23, 2018. THE MANUFACTURER STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE DEALER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2018",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104935,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST POWER STEERING AS CAR WAS DRIVING APPROX 50 MPH ON GARDEN STATE PARKWAY AT TOP OF BRIDGE OVER THE RARITAN RIVER. BATTERY WARNING CAME ON DASH, CAR LOST POWER AND THEN STOPPED. NO COLLISION OR INJURY.  CAR WAS TOWED AND REPAIRED BY C&T TOWING AND AUTO REPAIR, RAHWAY NJ. DAMAGE OBSERVED WAS PARTIALLY MELTED IDLER PULLEY AND SHREDDED DRIVE BELT.  REPAIR INCLUDED REPLACEMENT OF DRIVE BELT, A.C. STRETCH BELT, IDLER PULLEY, DRIVE BELT TENSIONER AND SERPENTINE TENSIONER.",
        "vin": "5UXFF0C5XAL"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097562,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BELT IDLER PULLEY BOLT BROKE CAUSING A SUDDEN LOSS OF POWER STEERING WHEN THE SERPENTINE BELT CAME OFF THE ALTERNATOR AND POWER STEERING PUMP. THIS IS THE SAME PROBLEM ASSOCIATED WITH RECALL 12V550000 A FEW YEARS AGO.  THE DEALER SAID THE VEHICLE WAS FIXED UNDER THE RECALL BUT IT WAS BEFORE I OWNED IT SO I DON'T KNOW FOR SURE.  I BELIEVE THE RECALL SHOULD BE REINSTATED. THE VEHICLE WAS MOVING ON A RESIDENTIAL STREET AT LESS THAN 25 MPH AND MY MOM WAS DRIVING.  IF SHE HAD BEEN GOING ANY FASTER SHE WOULD HAVE CRASHED.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091513,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A BOLT CONNECTING THE ALTERNATOR TO THE MOTOR HAS BROKEN OFF CAUSING THE SERPENTINE BELT TO COME OFF RESULTING IN THE LOSS OF POWER STEERING. THIS ISSUE RESULTED IN A RECALL AND THE VEHICLE WAS ALLEGEDLY REPAIRED IN CALIFORNIA BACK IN 2013. HOWEVER, THIS HAS HAPPENED AGAIN AND HAS PUT THE SAFETY OF MY FAMILY AT RISK. I AM AWARE THAT THERE HAS BEEN AN INVESTIGATION THAT HAS BEEN OPENED IN ABOUT APRIL OF 2018 AND WE WANT OUR CIRCUMSTANCES TO BE INCLUDED IN THIS INVESTIGATION. BMW IS CURRENTLY REFUSING TO COVER THE REPAIRS.",
        "vin": "5UXFF0C5XAL"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074047,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. IN ADDITION, THE BATTERY FAILED WITHOUT WARNING. THE FAILURE ONLY OCCURRED WHEN THE VEHICLE HAD BEEN PARKED IN BELOW FREEZING TEMPERATURES. THE VEHICLE WAS TAKEN TO THE DEALER (SANDIA BMW, 6001 PAN AMERICAN FWY, ALBUQUERQUE, NM 87109), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 13V339000 (FUEL SYSTEM), BUT THE VIN WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS NOTIFIED AND STATED. THE FAILURE MILEAGE WAS 57,000. *TT  *TR",
        "vin": "5UXFF0C56AL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "02/06/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071587,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNED A 2010 BMW X5. WHILE DRIVING 35 MPH, THE CONTACT OBSERVED AND SMELLED SMOKE. THE CONTACT PULLED THE VEHICLE INTO A PARKING LOT WHERE IT CAUGHT FIRE. THERE WERE NO WARNING INDICATORS ILLUMINATED PRIOR TO THE FAILURE. THERE WERE NO INJURIES. THE VEHICLE WAS DESTROYED. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING) AND WAS INFORMED PARTS WERE NOT AVAILABLE. THE FAILURE MILEAGE WAS 47,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062830,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AIR CONDITIONING IS RUNNING ON ANY SPEED, HOT AIR IS BLOWING FROM FLOOR AND DASHBOARD.",
        "vin": "5UXFE4C54AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061142,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING APPROXIMATELY 65 MPH ON THE HIGHWAY, THE AIR BAGS DEPLOYED WITHOUT WARNING OR IMPACT. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE THE FAILURE. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS TOWED TO THE DEALER (HENDRICK BMW NORTHLAKE, 10720 NORTHLAKE AUTO PLAZA BLVD, CHARLOTTE, NC 28269, (704)-321-8126), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT RECEIVED A RECALL LETTER FROM THE MANUFACTURER REGARDING NHTSA CAMPAIGN NUMBER: 16V364000 (AIR BAGS) AFTER THE FAILURE. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "5UXFE4C56AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057797,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE AIR CONDITIONER IS ON HOT AIR BLOWS OUT THROUGH THE DASH AND FLOOR VENTS. HAPPENS WHILE STATIONARY, IN MOTION, HIGHWAY AND CITY DRIVING. SUSPECT IT IS THE PCV VALVE.",
        "vin": "5UXFF0C53AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "12/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056120,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY 12/03 I SUDDENLY HEARD A KNOCKING NOISE WHILE ACCELERATING AND IMMEDIATELY REACHED THE DEALERSHIP TO HAVE THE CAR CHECKED. THE DIAGNOSIS I RECEIVED IS THAT THERE HAS BEEN A FATAL FAILURE OF BEARING THAT CAUSE THE ENGINE TO GET DAMAGED AND IN NEED TO BE REPLACED.  I LOOKED UP ON THE WEB AND FOUND OUT THAT IN 2014 BMW HAD A WORLDWIDE RECALL OF 2010 5 SERIES MODELS FOR A DEFECT IN THE ENGINE WHICH WOULD HAVE GENERATED THE SAME FAILURE I HAVE EXPERIENCE, SUDDENLY, ON SUNDAY.  MY CAR WAS NEVER RECALLED, BUT THE FAILURE MODE AND THE YEAR OF THE MODEL ARE STRIKINGLY SIMILAR. THE  RECALL I AM  REFERENCING IS 14V-176 FOR THE VANOS.  THE AFFECTED 5 SERIES MODELS WERE PRODUCED BETWEEN FEBRUARY 2010 ' AUGUST 2011.  MY 5 SERIES WAS MANUFACTURED ON OCTOBER 2009, THEREFORE NOT INCLUDED IN THE RECALL. HOWEVER THE FAILURE IS IDENTICAL TO THE ONE DESCRIBED BY THE RECALL AND I FEEL THAT THE RECALL SHOULD HAVE BEEN MORE INCLUSIVE. MY 535 HAD 130 K MILES, WHICH DO NOT WARRANT SUCH A DRASTIC FAILURE, ESPECIALLY SINCE HAS BEEN DILIGENTLY SERVICED BY THE DEALERSHIP SERVICE. LAST OIL CHANGE HAD STILL 9000 MILES TO SPARE AND WHEN THEY REPLACED THE FILTER NOTHING WAS NOTICED. SUCH A DRASTIC AND RAPID FAILURE IT IS NOT OTHERWISE EXPLAINABLE.",
        "vin": "WBANW1C50AC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054582,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REPAIRING THE TWIN-TURBO IN MY CAR AGAIN IN LESS THAN A YEAR. LAST YEAR THE HOSES WERE ALL REPLACED THIS YEAR THE DEALER SAYS ONE OF THE TWO TURBO UNITS IN THE VEHICLE NEEDS TO BE REPLACED (SMALLER ONE). THE CAR IS DOING THE SAME THING IT DID LAST YEAR LOSING POWER AND MAKING IT DANGEROUS TO DRIVE IN TRAFFIC. IF I AM AT A LIGHT, IT TAKES ABOUT HALF A BLOCK FOR IT TO ACCELERATE TO NORMAL SPEED.  I ENDED UP HAVING THE CARE TOWED TO THE BMW DEALER BECAUSE IT WAS NOT SAFE TO DRIVE IN TRAFFIC.     AFTER DOING SOME RESEARCH, THE TURBO HAS BEEN AN ONGOING PROBLEM IN THE X5D.  THE CAR IS JUST UNDER 85,000 ORIGINAL MILES AND SINCE I PURCHASED TWO YEARS AGO, HAVE LOGGED LESS THAN 20,000 MILES.     .",
        "vin": "5UXFF056ALT"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051321,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V364000 (AIR BAGS) DID NOT HAVE THE PARTS AVAILABLE FOR THE RECALL REMEDY. THE CONTACT TOOK THE VEHICLE TO ROCKVILLE BMW DEALER LOCATED AT 1300 ROCKVILLE PIKE, ROCKVILLE, MD 20852 BUT THE PARTS WERE NOT AVAILABLE AND NO AVAILABILITY DATE. IT WAS UNKNOWN IF THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "02/15/2013",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029977,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING 30 MPH, THE ENGINE SHOOK, SMOKE APPEARED, AND THE ENGINE STALLED. THERE WAS NO FIRE. THE ENGINE MALFUNCTION INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO BMW OF DENVER DOWNTOWN (1040 S COLORADO BLVD, DENVER, CO 80246 (303) 954-4856) WHERE IT DIAGNOSED THAT THE SECONDARY FUEL PUMP AND THE FUEL INJECTORS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 53,220.",
        "vin": "5YMGY0C58AL"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024812,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THAT THE POWER MALFUNCTION WARNING LIGHT ILLUMINATED AND THE POWER STEERING FAILED. IN ADDITION, THE 'POWER LOSS PLEASE REDUCE SPEED' WARNING MESSAGE ILLUMINATED. THE CONTACT WAS ABLE TO PULL THE VEHICLE TO THE SIDE OF THE ROAD. THE CONTACT TURNED THE IGNITION OFF AND ATTEMPTED TO RESTART THE VEHICLE BUT FAILED TO START. THE VEHICLE WAS NOT ABLE TO RESTART. THE VEHICLE WAS LEFT IN THAT AREA, AND WAS NOT TOWED AT THE TIME. THE LOCAL DEALER (SANTA MONICA BMW,  SANTA MONICA BLVD, SANTA MONICA, CA, 90401) WAS CONTACTED AT 310-829-3535 AND MADE AWARE OF THE FAILURE, WHERE THEY ADVISED TO SCHEDULE AN APPOINTMENT TO HAVE THE VEHICLE DIAGNOSED. THE CONTACT WAS DELIBERATED ON THE USE OF AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V550000 (STEERING, ENGINE AND ENGINE COOLING), AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 79,000.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020720,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 10, 2017 WE PURCHASED A 2010 BMW X5 WITH APPROX 70KMILES FROM EAST PROVIDENCE AUTO FOR $16,000. TWO DAYS LATER WE BROUGHT THE VEHICLE BACK BECAUSE THE WINDSHIELD WIPER FLUID LEAKED ONTO THE DRIVER SIDE FLOOR, THE SUNROOF WOULDN'T CLOSE AND A BURNING OIL SMELL WAS COMING FROM THE INSIDE OF THE VEHICLE. AFTER INSPECTING, THE MECHANIC SAID THE HOSE FROM THE WINDSHIELD WIPER TANK WAS NEEDED REPLACEMENT,  HE UNJAMMED THE SUNROOF AND ADDED 2 QUARTS OF OIL; HOWEVER, HE COULDN'T FIX ANYTHING. MAY 22 WE RETURNED B/C THE OIL LIGHT WAS ON AND THE BURNING OIL SMELL STILL EXISTED. BUT THE GARAGE WAS LOCKED. THE SALESMAN SAID WE WOULD HAVE TO COME BACK. MAY 24 WE RETURNED AFTER BLUE SMOKE WAS COMING FROM THE EXHAUST. THE MECHANIC SAID THE OWNER WAS IN PORTUGAL FOR TWO WEEKS AND HE COULDN'T WORK ON THE VEHICLE WITHOUT PERMISSION. AFTER RETURNING AND CALLING MANY TIMES OVER THE NEXT MONTH WE MET WITH THE OWNER WHO SAID HIS MECHANIC LEFT, WE WOULD HAVE TO WAIT. JULY 3 WE HAD THE VEHICLE INDEPENDENTLY INSPECTED (SEE ATTACHED REPORT).  HE INSPECTED THE ENGINE AND  DRAINED THE OIL. HE RECOMMENDED THE ENGINE BE REMOVED FOR FURTHER DIAGNOSIS AND IF NOT RESOLVED THE ENGINE WILL EVENTUALLY NEED TO BE REPLACED. AFTER RETURNING TO EP AUTO THE OWNER SAID THE 30 DAY WARRANTY WAS UP SO WE FILED A COMPLAINT WITH THE RHODE ISLAND DEALERS LICENSE AND REGULATIONS OFFICE (COMPLAINT NUMBER AM-1702213). WE ARE AWAITING A RESPONSE FROM THE HEARING BOARD. THE CASE MANAGER ADVISED THAT IT'S IMPOSSIBLE TO FORCE  EP AUTO TO TAKE THE VEHICLE BACK BECAUSE WE HAVE TO PROVE THE ISSUES ARE PRE-EXISTING  AND SHE IS ANTICIPATING THE HEARING BOARD WILL NOT RULE IN OUR FAVOR. AT THIS POINT WE ARE EXTREMELY RELUCTANT TO DRIVE THE VEHICLE DUE TO THE SAFETY CONCERNS. I RECENTLY RECEIVED A RECALL NOTICE FROM YOU ALLEGING DEFECTIVE AIRBAGS MADE BY TAKATA.  PLEASE FEEL FREE TO CONTACT ME. THANK YOU FOR YOUR HELP.",
        "vin": "5UXFE8C53AL"
    },
    {
        "components": "AIR BAGS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018920,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING VARIOUS SPEEDS, ABNORMAL FUMES ENTERED THE VEHICLE AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AUTOGERMANA BMW (LOCATED AT 298 CALLE CARLOS F CHARDON, HATO REY, PR 00919), BUT WAS NOT REPAIRED DUE TO LACK OF PARTS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS), 16V364000 (AIR BAGS), AND 16V746000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS NEEDED FOR THE REPAIRS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 48,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016294,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKADA RECALL- TRYING TO UNDERSTAND WHY SUCH A IMPORTANT SAFETY RECALL IS TAKING SO LONG TO RECTIFY. I BOUGHT THE VEHICLE NOT KNOWING THIS VEHICLE HAD 3 RECALLS. WE WERE TOLD THAT BMW DOESN'T KNOW WHEN PARTS COULD BE AVAILABLE.",
        "vin": "5UXFE4C5XAL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014071,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS HAVING ENGINE LIGHT AND STRON FUEL SMELL. I TOOK VECHIE TO BMW SERVICE CENTER AND BEEN TOLD THAT CAR HAS EGR  COOLANT PROBLEM. ACCORDING TO SERVICE CENTER THAT REPAIR FOR RECALL #11E-A03 FOR EGR VALVE WAS PERFOMED IN 2016 WHICH I NOT BEEN TOLD. NOW I AM GETTING EGR COOLANT ISSUE AND BMW IS RECOGNIZED THAT THIS IS RELATED TO EGR SYSTEM RELATED ISSUE. IT IS COMMON COMPLIANT AMONG VEHICLE OWNERS BUT BMW IS NOT ACCEPTING THAT THIS MANUFACTURING FAULT AND MAY CAUSE SOME TERRIBLE OUTCOME IF VEHICLE STOPPED WHILE DRIVING ON THE FREEWAY. I AM REQUESTING NHTSA TO DEMAND BMW TO RECOGNIZE THIS ISSUE AND FIX IT AS RECALL OR UNDER WARRANTY.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "08/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013054,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS AND FUEL PUMP RECALLS. BMW STILL HAS NO FIX FOR THESE ISSUES WHICH IS A TICKING TIME BOMB FOR ANY OCCUPANTS IN THE VEHICLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006695,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS), 16V364000 (AIR BAGS), AND 16V746000 (FUEL SYSTEM, GASOLINE) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE DEALER (BMW OF DALLAS, 6200 LEMMON AVE, DALLAS, TX, 75209)  STATED THAT THEY WERE SCHEDULING APPOINTMENTS FOR PARTS WITHIN THE NEXT THREE MONTHS, WHEN THE CONTACT CALLED THREE MONTHS LATER SHE WAS INFORMED THE SAME INFORMATION, AND ALSO MADE AWARE THAT THE PARTS FOR THE RECALL REPAIR WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT STATED HER VEHICLE SLOWED DOWN WHILE DRIVING ON THE EXPRESSWAY AND THEN STALLED. THE VEHICLE WAS UNABLE TO RESTART. THE VEHICLE WAS TOWED TO THE SAME DEALER BMW OF DALLAS WHERE THE VEHICLE WAS REPAIRED BUT THE REPAIRS PERFORMED WERE UNKNOWN. THE FAILURE MILEAGE WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT AND VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006077,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS) AND 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (CRITZ BMW OF SAVANNAH, GEORGIA) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 08/11/17 *BF    THE CONSUMER STATED THE FUEL THROTTLE ALSO MALFUNCTIONED.  UPDATED 08/23/2017*JS",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004135,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 AND 16V364000 (AIR BAGS). THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE DEALER (BMW OF AUSTIN LOCATED AT 7011 MCNEIL DR, AUSTIN, TX 78729; (512) 343-3500) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT AND VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002789,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS) AND 16V364000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT DID NOT NOTIFY A DEALER. THE MANUFACTURER WAS NOTIFIED IN OCTOBER OF 2016. THE MANUFACTURER STATED THAT THE PARTS WERE GOING TO BE SHIPPED IN JANUARY OF 2017 AND THAT A DEALER WOULD CALL THE CONTACT. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE AIR BAG INDICATOR MALFUNCTIONED AND ILLUMINATED. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5UXFE4C57AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995496,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS), 16V364000 (AIR BAGS), AND 16V746000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SARASOTA BMW OF SARASOTA, FLORIDA WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER STATED THAT THE PARTS WERE UNAVAILABLE AND THAT THE CONTACT COULD NOT RECEIVE A LOANER VEHICLE FOR SIX MONTHS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE....UPDATED 08/31/17 *BF    *CN",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986317,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SAT IN THE DRIVEWAY FOR A COUPLE OF DAYS AND WHEN I WENT TO USE IT, I DISCOVERED THAT THE INTERIOR RIGHT REAR QUARTER PANEL WAS MELTED AND THE INTERIOR WAS COVERED IN SOOT. I CONTACTED MY INSURANCE COMPANY AND IT WAS TOWED TO A REPAIR SHOP FOR EVALUATION. IT WAS DECLARED A TOTAL LOSS.",
        "vin": "5UXFE4C50AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985830,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS) AND 16V364000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT AND VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10982955,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS AN EXCESSIVE OIL CONSUMPTION ISSUE THAT THE MANUFACTURER WAS AWARE OF WHICH EXPLAINS WHY THEY NO LONGER MAKE THIS ENGINE. IN A 30 DAY PERIOD I PUT ABOUT 2 ADDITIONAL QUARTS OF OIL IN THE VEHICLE. THE TAIL PIPE IS SMOKING AND LIQUID IS COMING OUT OF IT WHEN THE VEHICLE IS RUNNING FOR A LONG PERIOD OF TIME AND IS IDLE.  THE COST TO REPAIR IT AT A BMW DEALER IS $6,000.  I HAVE ALREADY PAID $2,500 TO REPLACE THE VACCUM PUMP AND O RINGS DUE TO AN OIL LEAK.  ALSO HAVE ALSO EXPERIENCED A TOTAL ENGINE SHUT DOWN WHICH COST ME $3,300 TO REPLACE THE BELT TENSIONER AND DEFLECTION PULLEY AND RIBBED  V BELT AND AIR COMPRESSOR.  THE CAR GAVE NO WARNINGS AND IT THE ENGINE JUST STARTED STALLING AND THEN IT JUST DIED AND AT THAT POINT A COOLANT LIGHT CAME ON BUT IT WOULD NOT DRIVE ANYMORE AT THAT POINT.  THIS ISSUE SHOULD BE COVERED BY THE MANUFACTURER.  THE ENTIRE ENGINE NEEDS TO BE REPLACED.",
        "vin": "5UXFE8C51AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980511,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS) AND 16V746000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. ..UPDATED 07/21/17 *BF  UPDATED 10/12/2017*JS",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "03/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979268,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING AT LOW SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. WHEN THE IGNITION KEY WAS TURNED TO THE ON POSITION, THE VEHICLE HESITATED TO START. THE FAILURES RECURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE INTAKE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS), 16V364000 (AIR BAGS), AND 16V746000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 69,800. VIN TOOL CONFIRMS PARTS NOT AVAILABLE AND PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971997,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CAR IN 2/4/2017, ON SECOND DRIVING, THE CAR STALL ON THE GREEN LIGHT. I DID CONTACT DEALERSHIP NAMED SHARPEST RIDES, TO ASK WHAT CAUSE THE PROBLEM, AS THEY TOLD ME TO DROP CAR AT THEIR PLACE TO INVESTIGATE AND DIAGNOSIS. I DID DROP, AFTER DAY THEY CONTACT ME AND MENTIONED THAT THEY CANNOT DUPLICATE THE PROBLEM, BECAUSE NOT ENOUGH TOOLS, SO THEY REFER TO BMW OF DENVER DOWNTOWN. THE BMW DEALER DID TEST AND DIAGNOSIS OF COUPLE DAYS AND RESPOND WITH \"WE CANNOT DUPLICATE OF PROBLEM\", SO THEY RETURN MY CAR TO ME WITH UNSAFE CONDITION. AFTER WHILE I STARTING HAVE SAME PROBLEM WITH STALL ENGINE IN THE MIDDLE OF ROAD, AT PARKING LOT, OR ONE DAY WASN'T EVEN START ENGINE, OR WHEN CAR STALL AND I AM LUCKY THE GUY DIDN'T HIT ME IN THE BACK, BUT HE DID HORNED ON ME, SHOWED ME FINGER, AND SO ON. I DID CONTACT MULTIPLE TIMES WITH DEALERSHIPS, WITH CORPORATE HEADQUARTER AT US NORTH AMERICA AND DID HAVE A CHANCE OPEN A CASE, HAVE A CHANCE TALK TO SUPERVISING, BUT EVERYONE SAYING TO ME BECAUSE CAR DIDN'T SHOWED ERROR MASSAGE AND THEY CANNOT DUPLICATE PROBLEM THEY WONT REPLACE FUEL PUMP, EVEN THEY KNEW THIS IS A FUEL PUMP CAUSING A PROBLEM. IN ADDITION, THEY DID RECALL 136000 FUEL PUMP, BUT THEY DIDN'T WANT CHANGE NOW, AND I DID TRY EXPLAIN THEM EVERYDAY WE ARE ON THE ROAD, WE MUST KEEP OUR LIFE SAFE AND KEEP OUR ENVIRONMENT SAFE, BUT THEY STILL TELLING ME WE CANNOT DUPLICATE A PROBLEM. MY CAR WAS A SECOND TIME AT SAME DEALERSHIP ON 4/72017 WITH SAME PROBLEM, AND THEY STILL TELLING ME EVERYTHING FINE WITH YOUR CAR, JUST DRIVE, I HAVE FOUR WITNESS THAT  CAN VERBALLY IN WRITING PROOF  THAT MY CAR STALL. MAYBE THE CAR IS DRIVE-ABLE BUT UNSAFE, BECAUSE YOU CANNOT PREDICT WHERE IT CAN BE STOP. PLEASE REVIEW AND SEE IF MANUFACTURE OR DEALERSHIP FOLLOWING ON ALL SAFETY PROCEDURE TO LET PEOPLE DRIVE IN HIGH RISK AND DANGEROUS OF LIFE ON ROAD. PLEASE CALL ME [XXX]. THANK YOU    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967589,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I AM GOING ON NEARLY 2 YEARS SINCE I WAS FIRST NOTIFIED OF THE RECALL.  BMW OF SAN RAFAEL KEEPS TELLING ME THEY CANNOT FIX THE AIRBAG PROBLEMS.",
        "vin": "5UXFF0C57AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS), 16V364000 (AIR BAGS), AND 16V746000 (FUEL SYSTEM, GASOLINE). HE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXFE4C56AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954952,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING 40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE TIMING CHAIN FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "5UXFF0C59AL"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945770,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH AIRBAGS HAVE BEEN ON THE RECALL FOR OVER A YEAR....ARE THEY NOT REQUIRED TO BE IN THE VEHICLE, BUT WORKING CORRECTLY?  TO WAIT FOR A RECALL OVER A YEAR ON SOMETHING SO IMPORTANT IS VERY WRONG!  IN ADDITION THERE IS ANOTHER RECALL (OCT 2016) ON A FUEL PUMP \"COULD LEAK FUEL DURING REFUELING OR CORNERING\"   I'VE SET UP A SERVICE APPOINTMENT  JAN 20, 2017 AND I'M TOLD NEITHER RECALL ITEMS WILL BE ADDRESSED OR REPAIRED BECAUSE PARTS.    I'M ALSO NOT OFFERED A SOLUTION OUTSIDE OF \"CAREFULLY MOVE AWAY FROM TRAFFIC\"  ANYONE DRIVING THE CAR, NEAR THE CAR OR AT THE REFUELING LOCATION IS AT RISK...HOW MANY OF THESE VEHICLES ARE OUT THERE?     MORE HAS TO BE DONE!!  BMW SHOULD REPAIR THESE ASAP OR HAVE THEM TAKEN OFF THE ROAD.    A YEAR IS UNACCEPTABLE  *TR",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943862,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    AS STATED IN THE NOTICE, \"IF THE MANUFACTURER HAS FAILED OR IS UNABLE TO REMEDY THIS SAFETY RECALL FOR YOUR VEHICLE IN A TIMELY MANNER...FILE AN ONLINE COMPLAINT WITH NHTSA.\"     THE RECALL IS COMING UP ON A ONE-YEAR ANNIVERSARY.    ALTERNATIVE TRANSPORTATION IS NOT AVAILABLE, AND NOW HAVE A TEENAGE DRIVER WITH LEARNER'S PERMIT, INCREASING ODDS/RISK OF ACCIDENT.    WHILE NOT \"TECHNICALLY\" IN THE FIRST ZONE PRIORITY, NORTH CAROLINA'S CLIMATE IS ONE OF HIGH TEMPERATURES AND HUMIDITY FOR A SIGNIFICANT PORTION OF THE YEAR, AND THE VEHICLE DOES SPEND TIME AT THE COAST.    DEALER WAS CONTACT IMMEDIATELY UPON RECEIPT OF NOTICE IN FEBRUARY 2015, AND SEVERAL ADDITIONAL TIMES. DEALER RESPONSE IS THAT PARTS ARE NOT AVAILABLE OR THE VEHICLE VIN HAS NOT BEEN SELECTED FOR REPLACEMENT YET.  *TR",
        "vin": "5UXFF0C53AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "12/14/2016",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940121,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND A FUEL AND SMOKE ODOR WAS PRESENT. IN ADDITION, BLACK SMOKE EMITTED FROM THE EXHAUST PIPE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 89,000.",
        "vin": "5UXFE8C5XAL"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936182,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A KNOWN DEFECT OF AN ENGINE COMPARTMENT PARTITION/SEAL CAUSED OUTSIDE WATER TO ENTER THE ENGINE COMPARTMENT. THE WATER DRIPS AND ACCUMULATES OVER THE LAST FUEL INJECTORS, LEADING TO AN EVENTUAL SHORT. WHEN THE SHORT OCCURS, THE VEHICLE LOOSES ALL POWER. THE ENGINE SHUTS OFF PREVENTING ACCELERATION, POWER STEERING NO LONGER FUNCTIONAL, POWER BRAKES NO LONGER ASSISTED. THE SHORT OCCURRED WHILE DRIVING THROUGH AN INTERSECTION. THE CAR STALLED IN THE MIDDLE OF THE INTERSECTION AND NEEDED TO BE TOWED. FORTUNATELY, TRAFFIC WAS MINIMAL AND OTHER VEHICLES WERE ABLE TO SLOW DOWN AND DRIVE AROUND MY VEHICLE, PREVENTING A COLLISION.  *TR",
        "vin": "5UXFF0C59AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928718,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2010 BMW X5 XDRIVE30I, ON MONDAY, NOVEMBER 28, 2016 AT 5:50AM, WHILE THE VEHICLE WAS STATIONARY, IGNITION OFF, KEY IN THE IGNITION, RADIO ON AND REFUELING AT THE GAS STATION, I HEARD A CHIME COMING FROM THE CABIN AND NOTICED THE MESSAGE THAT STATED \"RESTRAIN SYSTEM MALFUNCTION AFFECTING THE FRONT PASSENGER AIRBAG\" THE MESSAGE ALSO STATED THAT THE MALFUNCTION WOULD LIMIT THE INFLATOR, TENSSIONER AND ANOTHER COMPONENT WHICH I DO NOT RECALL NOW, TO PROPERLY INFLATE THE PASSENGER SIDE AIRBAG. I MADE SOME INQUIRING ON LINE AND FOUND THAT THIS IS A COMMON PROBLEM WITH DIFFERENT MODELS OF BMWS, AS WELL AS OTHER BRANDS. I CONTACTED BMW USA AND WAS TOLD THAT THERE WAS A RECALL FOR THE DRIVER SIDE AIRBAG BUT NOTHING FOR THE PASSENGER SIDE. MY VEHICLE ONLY HAS 85,000 MILES, RELATIVELY NEW, FOR A BMW, AND IS FACING THIS TYPE OF MALFUNCTION. I BELIEVE THAT AN INVESTIGATION SHOULD BE LAUNCHED BY YOUR AGENCY AND EXPLORE THE POSSIBILITY OF ISSUING A RECALL TO FORCE BMW USA TO TAKE RESPONSIBILITY IN THIS MATTER. THESE TYPE OF REPAIRS ARE VERY PRICEY AND SHOULD BE COVERED BY BMW, SINCE ITS HAPPENING TO SO MANY MODELS AND AROUND THE SAME AMOUNT OF MILES.",
        "vin": "5UXFE4C51AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/23/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927717,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V071000 (AIR BAGS) AND 16V746000 (FUEL SYSTEM, GASOLINE). THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT..UPDATED 01/04/17 *BF*DT  *TR",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926802,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF THE BMW X5 2010 WITH SPORT SEAT, I HARDLY SEAT ANY PASSENGER IN THERE, AND A COUPLE MONTHS AGO THE PASSENGER SEAT TRIGGER THE SCREEN TO SHOW MESSAGE OF RESTRAIN AIRBAG ERROR ON SCREEN, HOWEVER I THOUGH THIS HAVE SOMETHING TO DO WITH THE AIRBAG RECALL, I DIAGNOSE MY CAR WITH MY MECHANIC, THE CONCLUSION WAS THE \"SEAT MAT SENSOR PASSENGER DEFECTIVE\", THIS CAR AS YOUR RECALL AT THE BOTTON SHOWS THAT WAS A PREVIOUS RECALL WITH THIS TYPE OF SEAT \"SPORT\" SAME AS I HAVE, I CALL BMW, THEY SAID MY CAR IS NOT AFFECTED AND THEY CAN NOT HONOR THIS RECALL, I HOPE YOU GET MORE ISSUES SIMILAR SO YOUR AGENCY LOOKS INTO THIS.      REPORT RECEIPT DATE: NOV 12, 2013  NHTSA CAMPAIGN NUMBER: 13V564000  COMPONENT(S): AIR BAGS  POTENTIAL NUMBER OF UNITS AFFECTED: 76,565  MANUFACTURER: BMW OF NORTH AMERICA, LLC",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "10/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925403,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ISSUE WITH MY 2010 BMW X5 CONCERNING THE ENGINE STALLING WHILE IN A PARKING LOT AFTER THE CHECK ENGINE LIGHT ILLUMINATED. WE HAD IT TOWED TO A BMW DEALERSHIP TO ADDRESS THE PROBLEM. AFTER THE DEALER INVESTIGATED THE PROBLEM, THEY FOUND THAT THE VANOS BOLTS TO THE EXHAUST CAMSHAFT HAD FALLEN OUT AND CAUSED THE ENGINE TO SHUT DOWN. AFTER DOING SOME ONLINE INVESTIGATION, WE SOON REALIZED THAT A RECALL HAD BEEN INITIATED FROM BMW FOR THIS EXACT FAULT AND ALL AFFECTED VEHICLES WERE TO BE BROUGHT TO A NEARBY SERVICE CENTER FOR REPAIR. THE RECALL NUMBER IS 14V-176. THE RECALL ALSO SPECIFICALLY STATES THAT THERE IS AN EXTENDED WARRANTY FOR ANY VEHICLE WITHIN THIS MODEL YEAR RANGE AND ENGINE TYPE. DUE TO THE FACT THAT THIS VEHICLE WAS PURCHASED IN GERMANY FROM A US AFFILIATED DEALER AS A US SPEC VEHICLE, THIS RECALL WAS NEVER ACKNOWLEDGED BECAUSE THE VEHICLE WAS REGISTERED IN GERMANY AND NEVER WARRANTY REGISTERED IN THE US. THIS VEHICLE IS CURRENTLY NOT OPERATIONAL AND BMW CORPORATE IN GERMANY DOES NOT RECOGNIZE THIS VEHICLE FOR RECALL OR WARRANTY REPAIRS BECAUSE THEY DO NOT RECOGNIZE BMW USA SPEC VEHICLES. WE CANNOT GET THIS VEHICLE REPAIRED UNLESS WE SHIP THIS INOPERABLE VEHICLE BACK TO THE USA AT OUR OWN EXPENSE. THIS IS A HUGE LOOPHOLE THAT OUR VEHICLE HAS FALLEN INTO AND THERE ARE OPEN RECALLS AFFECTED ON THIS VEHICLE THAT WE CANNOT GET REPAIRED UNTIL IT IS RETURNED BACK TO THE USA. THIS IS COMPLETELY UNACCEPTABLE THAT A MAJOR SAFETY ISSUE CAN GO UNADDRESSED AND BMW WILL NOT HONOR IT. THERE NEEDS TO BE RESOLUTION ON THIS FROM BMW TO NOT ONLY ADDRESS THIS OUTSTANDING SAFETY ISSUE BUT TO CAPTURE FUTURE RECALL CONCERNS ON OTHER VEHICLES IN THIS SITUATION. AS AN AGENCY THAT ENFORCES SUCH REGULATIONS PERTAINING TO THESE ISSUES, I'M HOPING THAT YOUR ORGANIZATION WILL BE ABLE TO HELP ME. THE VEHICLE STALLED WHILE TRAVELING IN A PARKING LOT, WE HAD JUST LEFT THE AUTOBAHN",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924699,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5UXFF0C53AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916123,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5YMGY0C51D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911259,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5UXFE8C57AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/18/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907454,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS/AIR BAGS - EXCEPT FOR RECEIVING A COUPLE GENERIC LETTERS ABOUT THE RECALL ABSOLUTELY NOTHING SEEMS TO BE HAPPENING TO EXPEDIENTLY RESOLVE THE ISSUE.   SEEMS LIKE LAWYERS HAVE DONE THE PAPERWORK TO COMPLY WITH RECALL BUT THE PROCESS IS IN STALL MODE NOW AND NOTHING IS BEING DONE?  IT WOULD BE NICE IF THERE WAS SOME ACCOUNTABILITY TO MAKE SOME PROGRESS AND THE CONSUMERS ARE BEING INFORMED AND PROVIDED SOME ACTUAL PROOF THIS RECALL IS GOING TO BE FIXED WITHIN A REASONABLE TIMEFRAME.  GIVEN THAT MOST CARS LAST 10 YEARS TYPICALLY BEFORE GETTING NEW ONE, HOW LONG IS IT REASONABLE TO WAIT?   I CAN TELL YOU IF BMW DOES NOT TAKE ACTION AND RESPONSIBILITY TO FIX THIS RECALL SOON ... IT WILL BE MY LAST BMW I PURCHASE NEW OR USED.  IT JUST LOOKS LIKE A TOTAL LACK OF CONCERN, LACK OF ACTION, LACK OF ACCOUNTABILITY.",
        "vin": "5UXFF0C56AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897137,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE FUEL HEATER REPLACED AND BATTERY ON MY BMW X5-35D A COUPLE OF MONTHS AGO AT CONSIDERABLE COST.  THE ENGINE WAS ALSO THROWING THE FUEL HEATER ACTIVATION CODE.  I HAVE DOCUMENTATION OF THE REPAIR.  I HAVE RECENTLY LEARNED OF RECALL 13V-339 THAT COVERS THIS PART FOR THIS EXACT REASON WITH A BUILD DATE WINDOW MERE WEEKS FROM THE BUILD DATE OF MY VEHICLE.  THE BUILD DATE RANGE ON THIS RECALL IS JUNE 13, 2009- NOVEMBER 9, 2009.  THE BUILD DATE FOR MY VIN IS LISTED AS DECEMBER 2009.  BMW DID NOT COVER DESPITE THE PROXIMITY OF THE BUILD DATE AND THE EXACT SAME PROBLEM.  I CAN SEE THAT THERE ARE OTHER COMPLAINTS ON THE NHTSA.DOT.GOV WEBSITE FOR THIS PROBLEM FOR VEHICLES WITH A DECEMBER 2009 BUILD DATE'",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896105,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING 50 MPH, THE ENGINE LOST POWER AND THE VEHICLE WOULD NOT MOVE FORWARD. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE TRANMISSION HAD TO BE CHANGED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "5UXFE8C56AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875705,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CALLED NEW CENTURY BMW. TALKED TO SERVICE MANAGER, TONY HAWKINS. HE CLAIMS HE CAN'T FIXED MY CAR, PARTS UNAVAILABLE. ASKED WHAT HAPPENS IF I'M INVOLVED IN AN ACCIDENT AND DUE TO FAILURE OF SERVICING THE RECALL I OR MY FAMILY BECOME SERIOUSLY INJURED OR IT RESULTS TO DEATH... HE SAID SORRY, CAN'T HELP. ASKED WHAT OTHER OPTIONS DO I HAVE, HE SAID I HAVE TO FIND OUT THE PARTS NUMBER THAT NEEDS TO BE REPLACED. I TOLD HIM I DON'T KNOW ANYTHING ABOUT CARS, NOR PARTS NUMBER AND WHERE IN THE WORLD WOULD I FIND OUT THE INFO. HE SAID HE CAN'T HELP.",
        "vin": "5UXFE4C59AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875276,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE AIR BAG LIGHT REMAINED ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) AND 16V364000 (AIR BAGS) AND STATED THAT THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 97,626. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 09/06/16*LJ",
        "vin": "5UXFE4C5XAL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874460,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LOSS POWER AND SHUTDOWN WITH ME TWICE WHILE DRIVING ON THE HIGHWAY.  (95 NORTH)ERROR MESSAGES \"ELECTRICAL SYSTEM MALFUNCTION CONTINUE DRIVING IS NOT POSSIBLE. HAVE THE SYSTEM CHECKED BY THE NEAREST BMW CENTER\",     \"TRANSMISSION MALFUNCTION\",\" RESTRAINT SYSTEM MALFUNCTION\", \"FAULT IN PASSENGER-RESTRAINT SYSTEM\" THE SECOND TIME THAT HAPPENED TO ME , I HAD THE CAR TOWED BY AAA  AT 5AM AFTER WORK. THE CAR PARKING BRAKE WAS LUCK , SO AAA HAD TO DRAG THE INTO THE FLAT BED, THIS IS A SERIOUS ISSUE BMW MAKES A LOT OF MONEY THEREFORE SHOULD BE HELD ACCOUNTABLE AND FIX THE ISSUE BEFORE SOMEONE GET KILL.      THE CAUSE IS WATER GETTING INTO THE TRUNK AND SOCKING ALL THE ELECTRICAL WIRES IN THE TRUCK OF THE CAR  CAUSING EVERYTHING TO GO CRAZY. BMW IS AWARE OF THE ISSUE. I   SAW A FEW CLASS ACTION CASE AGAINST BMW FOR THE ISSUES I HAVE HERE.",
        "vin": "5UXFE4C58AL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874468,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M REPORTING A QUALITY ESCAPED ISSUE ON MOST OF BMW CARS EQUIPPED WITH REAR VIEW CAMERA SYSTEM. I'M MILD TO HOT DAYS, THE CAMERA STARTS TO FLICKER RAPIDLY AND SHORTLY IT BLANKS OFF INTERMITTENTLY. IT'S MORE NOTICEABLE ON HOT DAYS BUT NORMAL DURING COLD DAYS. THIS ISSUE IS ALSO ON MOST OF BMW CARS AND YET TO BE RECOGNIZED NOR RECALLED BY THE MANUFACTURER.     IT'S UNFAIR FOR A CONSUMER TO PAY SO MUCH MONEY AND CAN'T CAN'T BE REIMBURSED FOR THE FIX THIS DISCREPANCY. I BELIEVE THE COST OF THIS PROBLEM SHOULD BE COVERED BY A BMW DEALER.  I FELL LIKE I'VE BEEN ROBBED OUT OF MY WALLET PAYING SO MUCH FOR ALL THESE ISSUES POPPING UP FROM TIME TO TIME ON SCAR THAT WAS NOT EVEN 75K MILES.    THIS IS A SERIOUS DEFECT THAT COULD LEAD TO CRASH DURING REVERSE DRIVING OR DURING PARALLEL PARKING",
        "vin": "5UXFE454AL3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872133,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V364000 (AIR BAGS) AND 16V071000 (AIR BAGS); HOWEVER, THE PARTS WERE UNAVAILABLE TO PERFORM THE REPAIRS. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 07/27/16*LJ  UPDATED 08/01/16.*JB",
        "vin": "5UXFE4C53AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863027,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL...RECEIVED LETTER INFORMING THAT RECALLED TAKATA AIRBAGS ARE ON MY CAR. I CALLED DEALER TO GET IT FIXED AND WAS TOLD THEY HAVE NO PARTS. I CALLED MAIN BMW CORPORATE HQ AND WAS TOLD THEY HAD NOTHING FOR ME AND OFFERED NO HELP. I EXPLAINED THAT THIS MAKES ME FEARFUL SINCE WE LIVE IN HIGH-HUMIDITY TEXAS (CAR CAME FROM FLORIDA) AND RESEARCH INDICATES HUMIDITY MAY PLAY A ROLE IN AIRBAG FAILURES. BOTH DEALER AND HQ JUST SAID CAN'T DO ANYTHING. WE'RE FORCED NOW TO DRIVE A DANGEROUS CAR OR GET THE BAGS TURNED OFF. EITHER WAY, THEY'RE PLAYING RUSSIAN ROULETTE WITH OUR LIVES! WANT FEDERAL PRESSURE ON THEM TO GET ON IT TO FIX THIS PROBLEM. SURELY, SAFE AIRBAGS CAN BE MANUFACTURED BY OTHERS BESIDES TAKATA.  WHATEVER IT TAKES, THIS IS URGENT TO FAMILIES DRIVING THESE CARS.",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "04/26/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862017,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL FILTER HEATER WAS RECALLED (RECALL NO. 13V-339).   WE HAD TO HAVE OUR FUEL FILTER HEATER REPLACED AND WAS NOT COVERED UNDER WARRANTY BECAUSE THE RECALL WAS FOR VEHICLES PRODUCED FROM 6/2009 - 11/2009 AND OUR CAR WAS PRODUCED IN 12/2009.  WE HAD OUR FUEL FILTER HEATER REPLACED BECAUSE WE HAD A CHECK ENGINE LIGHT ON AND WHEN WE TOOK TO DEALER WE WERE TOLD THAT WE NEEDED A NEW FUEL FILTER HEATER, THEREFORE WE FEEL WE ARE INTITLLED TO THE RECALL.",
        "vin": "5UXFF0C58AL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2016",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855687,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY/PARKING BRAKE HAS FAILED ON THE VEHICLE.  THE MODULE (EMF) WAS REPLACED ONCE 2012 BY BMW UNDER WARRANTY.  IT APPEARS TO HAVE FAILED AGAIN.  THIS IS A SAFETY CONCERN.  THE EMERGENCY BRAKE SHOULD NOT BE FAILING THIS OFTEN.  BMW WENT TO THE ELECTRONIC EMERGENCY BRAKE AND JUDGING FROM OTHER COMPLAINS ONLINE, THE MODULES AND OTHER COMPONENT FAIL FREQUENTLY.",
        "vin": "5YMGY0C57AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "04/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854161,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS), HOWEVER THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXZV4C59BL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/23/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822416,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE FREEWAY AT 100 KM / H WHEN THREE HIGH POP ARRIVAL. WENT OUT TO EDGE. THERE WAS OIL ON THE ROAD. I GOT A TOW TRUCK AND MOVED THE CAR TO THE WORKSHOP. IT FOUND THAT OUT THE DRIVE SHAFT HAD GIVEN HIM. IT ENTERED AND BROKE THE OIL PAN OF THE MACHINE. I'VE SEEN MANY POSTS ABOUT THIS PROBLEM BUT MY CAR IS NOT UNDER WARRANTY. BUT I SEE MANY BMW OWNERS AROUND THE WORLD HAVE RECEIVED THIS REPAIR OF BMW. THIS IS A VERY EXPENSIVE REPAIR.",
        "vin": "WBAZW41090L"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817406,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE ON CITY STREETS I LOST POWER STEERING AND HAD TO BRING THE VEHICLE TO A STOP. I WAS UNABLE TO STEER THE CAR AND DISCOVERED THE SERPENTINE BELT HAD COME OFF. BMW HAD ALREADY DONE A RECALL FOR THIS AND I DID UPON DEALER INSPECTION DISCOVER THE SAME BOLT SHEARED CAUSING THE PROBLEM. THE ORIGINAL RECALL NOTICE WAS 12V550. I'M BEING CHARGED 700 HUNDRED DOLLARS NOW TO HAVE THE VEHICLE FIXED.",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "09/12/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789951,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING AT VARIOUS SPEEDS, FUEL WAS LEAKING UNDER THE FRONT OF THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE TIMING COVER CASES FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 82,000.",
        "vin": "5UXFE8C52AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "09/29/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780096,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW X5 DIESEL.  MY CAR HAS BEEN IN THE SHOP FOR A WEEK.  BMW WILL NOT REPLACE A PART THAT WAS PART OF A VOLUNTARY RECALL.  THIS IS THE SECOND TIME.  SCR METERING VALVE - SERVICE ACTION: REPLACE THE SELECTIVE CATALYST REDUCTION (SCR) METERING UNIT. SI B18 04 12  EXHAUST SYSTEMS",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2015",
        "dateOfIncident": "06/27/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778545,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER DOOR GOT LOCKED - UNABLE TO OPEN. DELER HAD TO TAKE DOOR OUT TO FIX. THIS MAJOR SAFETY ISSUE WITH VERY EXPENSIVE REPAIR FROM BMW DEALER. GOT ENGINE LIGHT FOR DIESEL FUEL TANK SENSOR. BMW TOLD ME TO TAKE TWO MONTH TO GET PART FROM GERMANY. WAITING FOR PART AND HIGH REPAIR BILL. AGAIN GOT ENGINE LIGHT FOR OTHER REASON. I AM COM EARN ABOUT SAFEST OF MY 2010 BMW X5 DIESEL MODEL AND LIKE HELP FROM NHTSA. THANKS.",
        "vin": "5UXFFOC52AL"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762565,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT AND PASSENGER RESTRAINT SYSTEM INDICATORS WERE ILLUMINATED ON THE INSTRUMENT PANEL. THE DEALER WAS NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 36,000.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746486,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OK, SO I OWN MY 2010 BMW X5 35D AND PRETTY MUCH SINCE THE OWNERSHIP I FOUND THAT BACK UP CAMERA I HAVE IS WORKING PRETTY STRANGE: WITH WORM WEATHER OUTSIDE IT SHOWS FUZZY, STATIC, JUMPING PICTURE. THE WARMER IS OUTSIDE THE MORE FUZZIER IT IS. SO, I TOOK IT TO THE DEALER AND THEY FOUND THAT CABLE COMING FROM CAMERA TO HEAD UNIT IS GETTING BAD FROM RUBBING FROM CHASSIS! I WENT ONLINE AND FOUND TONS OF COMPLAINS LIKE THAT - IN 2-3 YEARS OLD CAR AND UP ALL OVER THE PLACE - BAD CABLE. IT TURNED OUT THAT LOCATION FOR IT IS VERY BAD AND IT ALWAYS RUB ON PART OF CHASSIS. DEFINITELY BAD DESIGN ISSUE. FURTHER MORE, TO FIX IT I WAS QUOTED $1200, NO MORE NO LESS, SOMETHING THAT IS BADLY DESIGNED SHOULD BE FIXED FOR FREE! THIS IS DEFINITELY SAFETY CONCERN AS MAIN IDEA FOR THAT CAMERA - SAFETY, BUT HAVING IT FAULTY AFTER FEW YEARS DOESN'T FOLLOW IT MAIN GOAL. PLEASE INVESTIGATE THIS AND RECALL FOR THE CABLE SHOULD BE GOOD SOLUTION.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2015",
        "dateOfIncident": "05/09/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723867,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS MY BMW X5 HAS LOST ENGINE POWER ON THE HIGHWAY. IT HAS HAPPENED AFTER DRIVING A FEW HOURS. THE ENGINE SUDDENLY LOSES POWER. THE LAST TIME IT HAPPENED THE TRANSMISSION PROBLEM LIGHT WENT ON. OUR CAR HAS NOW BEEN AT THE FRESNO BMW DEALERSHIP FOR ONE MONTH. NOTHING HAS BEEN FIXED AND WE ARE NOT GETTING ANY INFORMATION FROM THE SERVICE DEPARTMENT. THIS CAR IS UNSAFE TO DRIVE.",
        "vin": "5UXFE8C56AL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/01/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10722636,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE CONTACT CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. AS A RESULT, THE CONTACT SUSTAINED CHEST, NECK, AND ARM INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/30/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10722426,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING 40 MPH HIT AN ON COMING VEHICLE IN THE FRONT AIR BAGS DID NOT DEPLOY. ENTIRE FRONT OF TRUCK IS DESTROYED VEHICLE CAN NOT BE DRIVEN.",
        "vin": "5UXFE4055AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2015",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712272,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 BMW X5 DIESEL  SERVICE DATE    SERVICE ISSUE  7/5/10  PROGRAMMING CONTROL UNITS REPLACING CHARGE-AIR TEMPERATURE SENSOR  7/24/12 CHECK ENGINE LIGHT ON  10/10/12        CHECK ENGINE LIGHT ON - CAR FAILED SUNOCO EMISSIONS  INSPECTION 3X.  BROUGHT THE CAR TO BMW TO FIGURE OUT WHY.  BMW STERLING PASSED IT.  NO REASON ANSWER PROVIDED FOR EMISSIONS FAILURE  1/11/13 CHECK ENGINE LIGHT IS ON  2/5/13  CHECK ENGINE LIGHT IS ON  8/21/13 CHECK ENGINE LIGHT IS ON  11/28/14        CHECK ENGINE LIGHT IS ON  1/28/15 CHECK ENGINE LIGHT ON    SERVICE BULLETINS AND VOLUNTARY RECALLS:  ONE IN PARTICULAR: SI B18 05 12 EXHAUST SYSTEMS  NHTSA ACTION NUMBER  10045284 AND 10054008.  THERE ARE SEVERAL OTHER SB'S THAT RELATE, AS WELL.    EGR, SCR CATS, O2 SENSORS, AIRFLOW,CHARGE AIR TEMP, INTAKE TEMP SENSOR, SOFTWARE, ETC, ETC...ALL OF IT CENTERS   AROUND THE CONTROL AND BALANCE OF EMISSIONS CONTROL.   THE PROBLEM HAS BEEN IGNORED BY BMW, FOR FAR TOO LONG.  JAN. 2014 REPAIRS:  1. PERFORM CARBON CLEANING AND REPLACE INTAKE MANIFOLD  2. CARBON SCRAPE, EGR AND MANIFOLD R&R  (2ND TIME EGR REPLACED)     4. BM11-12-7-796-378       PROFILE-GASKET           5. BM13-53-7-794-553       O-RING     6. BM13-53-7-787-236       O-RING   7. BM13-53-2-247-156       GASKET RING  8. BM11-61-8-519-140       INTAKE MANIFOLD WITH  9. BM11-71-8-517-217       EGR-VALVE   10. INJECTORS  11. CATALYTIC CONVERTER AND NOX SENSORS WERE NOT REPLACED AT THIS TIME, BUT SHOULD HAVE BEEN.  APRIL 2014  CATALYTIC CONVERTER NEEDS TO BE REPLACED NOW. NOX SENSORS ARE NOT FAILING, BUT NEED TO BE REPLACED BECAUSE THEY ARE UNDERPERFORMING. NOT COVERED UNDER WARRANTY, EVEN THOUGH THEY WERE REPLACED ONCE.   *TR",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2015",
        "dateOfIncident": "03/21/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702323,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THIS PROBLEM WITH MY 2010 BMW X5 35D BREAKDOWN. IT SAID THE CHARGING MALFUNCTION ON THE SCREEN. POWER STEERING WAS LOST. WHEEL STEER WAS HARD TO MANEUVER. HARD TO MOVE. I ALMOST GOT IN AN ACCIDENT. THE BATTERY DIED. EVERYTHING JUST NOT FUNCTION BC OF LOST IN POWER STEERING. WHEN I TOWED MY CAR TO BMW MANHATTAN, THE SERVICE ADVISOR TOLD ME THERE WAS NO RECALL FOR MY BMW X5 35 D. SHE TOLD ME THE DEALER WOULD CHARGE ME ABOUT $900 TO REPLACE PULLEY BELT BOLT AND BATTERY AND ETC . I TOLD HER IT'S ONE OF RECALL. AFTER THAT THE SERVICE ADVISOR TOLD ME THAT SHE WILL CALL ME BACK ON THAT WHICH SHE NEVER DID, MY CAR WAS STILL AT BMW MANHATTAN. IT'S BEEN A WEEK IN THE DEALER. I'M STILL WAITING TO KNOW WHAT HAPPEN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691693,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER CHANGING THE BATTERY, THE VEHICLE HAS NO OPERATING DASH LIGHTS, GAUGE INDICATIONS, TURN SIGNALS, OR BRIGHT LIGHTS.  ADDITIONALLY, THE WINDSHIELD WIPER CONTINUOUSLY SWIPES, BUT HAS NO ABILITY TO SPRAY WASHER FLUID OR CHANGE THE SPEED OF THE SWIPE.  THESE CONDITIONS RENDER IT DIFFICULT TO DRIVE AND SEE THROUGH THE WINDSHIELD, ESPECIALLY AT NIGHT, AND PREVENTS THE OPERATOR FROM MONITORING THE VEHICLE, IDENTIFYING ONES SPEED, OR SIGNALING A TURN.  MOREOVER, THE CONTINUOUS WINDSHIELD WIPER ACTION IMPAIRS ONE'S ABILITY TO SEE AND IS ALSO DISTRACTING; MAKING IT DANGEROUS TO DRIVE THE VEHICLE.  *TR",
        "vin": "5UXFF0C53AL"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2015",
        "dateOfIncident": "01/03/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669882,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ENGINE LOSS POWER AND PUT THE CAR INTO NEUTRAL.  ALL POWER STEERING WAS LOSS AS WELL. THANKFULLY I WAS ABLE TO PULL OFF THE ROAD SAFELY.  THE CAR RESTARTED ONCE, THEN LOSS POWER WHEN ONE TRIED TO ACCELERATE. THE CAR WOULD NOT RESTART. DURING THIS WHOLE TIME NO WARNING OR SERVICE LIGHTS CAME ON, THE VEHICLE STATUS SAID ALL SYSTEMS WERE OK, WHEN OBVIOUSLY THEY WERE NOT SINCE THE CAR JUST STOPPED WORKING WHILE DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/28/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661614,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED AND THE POWER STEERING WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE LOWER IDLER PULLEY BOLT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V550000 (ENGINE AND ENGINE COOLING , STEERING). THE FAILURE MILEAGE WAS 57,000. ...UPDATED 01/07/15 *BF       THE CONSUMER STATED THERE ARE OTHER POSTS WHERE PRIOR YEAR VEHICLES LIKE MY 2010 BMW X5 HAD RECALLS TO HAVE THE LOWER IDLER PULLEY REPLACED DUE TO POTENTIAL FAILURE.   UPDATED 9/28/2015*JS",
        "vin": "5UXFF0C51AL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "12/17/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659078,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUAL PROBLEM - CAR HESITATES WHEN ACCELERATING FROM A STOP OR LOW SPEED. THERE IS A PAUSE BETWEEN STEPPING ON THE ACCELERATOR AND RESPONSE FROM THE ENGINE. COMPLAINED NUMEROUS TIMES OVER THE YEARS TO SEVERAL DEALERS - SOME ACKNOWLEDGED THE PROBLEM BUT STATED THAT IT WAS NORMAL FOR THAT ENGINE. THEY SEEMED TO HAVE FIXED THE PROBLEM IN LATER MODELS BUT DID NOT EVEN TRY IN THE EARLIER ONES.     IT CAN BE A SERIOUS SAFETY ISSUE WHEN ACCELERATION IS NEEDED.  *TR",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654004,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR EXHAUST SMELL BUILD UP IN THE CABIN OF THE VEHICLE WHEN BACKING UP, STOPPING OR SLOWING DOWN FOR A CORNER/TURN.  *TR",
        "vin": "5UXFF0C5XAL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628176,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR AND I RECEIVED AN OVERHEATING SIGNAL ON THE DASH. I TURN CAR OFF AND LET IT COOL OFF BUT UT DID NOT WOKRD. I KEPT HAVING THE SAME OVERHEATING ISSUED. I NOTICED THERE IS A RECALL BUT BMW X5 2010 TO 2011 FOR THE SAME ISSUED OF THE WATER PUMP. I TOOK IT TO THE DEALERSHIP AND THE DO NOT WANT TO FIX IT STATING MY CAR IS NOT PART OF THE RECALL. I ARGUED THAT IS THE SAME MAKE, MODEL AND YEAR OF THE RECALL. I WAS TOLD THERE WAS NOTHING HEY CAN DO. I CALLED BMW OF AMERICA AND STATED THE SAME PROBLEM BUT NO HELP. MY CONCERN IS IF THOSE 2010 TO 2011 BMW X5 ARE HAVING THE SAME PROBLEM, WHY IS MINE NOT INCLUDED IN THE RECALL WHEN IS HAS BEEN CLEARLY DIAGNOTIC BY BMW THAT THE WATER PUMP IS THE PROBLEM.   *TR",
        "vin": "5UXFE4C5XAL"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617626,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON FREEWAY TO THE AIRPORT WHEN MY WIFE AND I HEARD A LOUD BOOM AND SUDDENLY HEARD LOUD AIRFLOW. I PULLED OFF TO SIDE OF ROAD AND INSPECTED CAR. THE SUNROOF HAD EXPLODED AND SHATTERED. THE CAR TRAVELING BEHIND ME ALSO STOPPED TO INSPECT HIS VEHICLE BECAUSE OF FLYING GLASS. THE CABIN DOOR TO THE SUNROOF HAD LUCKILY HAD BEEN CLOSED SO AS MY WIFE AND I AVOIDED THE FLYING GLASS. WHEN WE RETURNED FROM OUR TRIP I TOOK VEHICLE TO DEALER, THE VEHICLE WAS UNDER WARRANTY. THE DEALER SAID THIS PART WAS NOT COVERED AND WOULD COST $3600 TO REPAIR. WE GOGGLED BMW5 SERIES EXPLODING SUNROOFS AND DISCOVERED WE WERE NOT THE ONLY ONES TO EXPERIENCE EXPLODING SUNROOFS. SURELY BMW KNOWS ABOUT THIS POTENTIALLY GRIEVOUS PROBLEM. WE CALLED BMW NORTH AMERICA AND FILED A COMPLAINT WITH THE RESOLUTION DEPARTMENT. THE NEXT DAY BMW TO MY CHAGRIN WAS WILLING TO PAY 50 PERCENT OF THE REPAIR COST. I EXPECTED FULL COVERAGE. I NEEDED THE CAR BACK AND EXCEPTED OFFER VOWING NEVER TO BUY A BMW AGAIN. I EXPECTED TO BECOME WHOLE AND NOT EXPECTING BMW IGNORING THE PROBLEM THUS ENDANGERING THEIR DRIVERS FOR ECONOMIC REASONS. ONCE AGAIN   GOGGLE   BMW 5 SERIES EXPLODING SUNROOFS.  I TOOK VEHICLE TO LEXUS DEALER AND TRADED IT. I WANTED NOTHING TO DO WITH THAT CAR. UNFORTUNATELY I OWN ANOTHER BMW5. WHAT I WANT FROM NHTSA IS TO INSPECT THE PROBLEM AND I STILL WANT TO BE COMPENSATED FOR THE ENTIRE COST OF THE PROBLEM NOT JUST 50 PERCENT.    *TR",
        "vin": "WBANU5C59AC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "01/16/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616827,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5.  THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "5UXFF0C50AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2014",
        "dateOfIncident": "04/22/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587162,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLS ESPECIALLY WHEN STARTING TO DRIVE IN THE MORNING, OR AFTER STOPPING AT A LIGHT. IT RUNS ON REDUCED POWER JERKING FOR A FEW MILES WITH THE ENGINE LIGHT FLICKERING ON AND OFF AT TIMES. THE DEALERSHIP ADVISED ME TO USE ONLY SHELL GASOLINE, NEVER LET THE TANK BE LESS THAN A QUARTER TANK, BUT THAT DID NOT IMPROVE THE PROBLEM.  *TR",
        "vin": "5UXFE4C55AL"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566760,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION FAILED TO RESTART ENGINE DUE TO BATTERY DRAIN. IN ONE INSTANCE, BATTERY DISCHARGED DESPITE CAR HAVING BEEN DRIVEN FOR >1HR AND THEN STOPPED FOR LESS THAN 15 MINUTES BEFORE FAILURE TO RESTART. TWO OTHER OCCASIONS WERE FAILURE TO START ON THE MORNING AFTER VEHICLE LAST DRIVEN. AVERAGE OUTSIDE AIR TEMPS 5-30 DEGREES F. VEHICLE HAD LESS THAN 25K MILES AT FIRST OCCURRENCE AND LESS THAN 34K AT TWO MOST RECENT OCCURRENCES. BATTERY THIS NEW SHOULD NOT HAVE ISSUES HOLDING A CHARGE. SUSPECT DIESEL FUEL FILTER HEATER FAILURE TO SHUT OFF, RESULTING IN BATTERY DRAIN (SEE NHTSA CAMPAIGN NUMBER: 13V339000). 3 OCCURRENCES TO DATE, ALL WERE DURING COLD TEMPERATURES WHEN FFH WOULD HAVE BEEN ACTIVATED. JAN 2013, JANUARY 3, 2014 AND FEBRUARY 17, 2014.   ADDITIONAL ELECTRICAL SYSTEM FAILURES NOTED AS A RESULT OF BATTERY DRAIN ISSUES INCLUDE MULTIPLE WARNING INDICATORS (PASSENGER AIRBAG, DIESEL EXHAUST FLUID INDICATOR WARNING, BRAKE PAD WARNING, AMONG OTHERS).  *TR",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2014",
        "dateOfIncident": "10/02/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564305,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BY BMW THAT IT WAS THE EGR HIGH PRESSURE HEATER LEAKING, WHEREIN THE LEAK CAUSES DIESEL EXHAUST FUMES TO ENTER THE CABIN WHILE DRIVING WITHOUT WARNING. I OBSERVED THIS MOSTLY AS I PULL BACK FROM MY GARAGE, WHEN IDLING AND RANDOMLY AS I DRIVE. I'VE NOTICED A STRONG NOXIOUS SMELL IN THE CABIN, WHICH GAVE ME NAUSEA AND HEADACHE. I REMEDIED IT BY VENTING THE CABIN THEN RECIRCULATING THE AIR. IT HAPPENS CONSTANTLY EXCEPT WHEN I CIRCULATE THE AIR IN THE CABIN REGARDLESS OF WHEN I'M IN THE ROAD OR PARKED IN FRONT OF MY GARAGE. (I FIGURED THIS PREVENTS THE FUMES FROM THE HOOD ENTERING THE CABIN).I AM FINALLY HAVING IT REPAIRED FOR $800 MAYBE MORE AS I WILL FIND OUT TOMORROW THE FINAL COST. I'VE READ IN THE FORUMS THAT THIS IS NOT UNCOMMON EVEN BELOW 15K MILEAGE X5S WHICH IS VIRTUALLY NEW AND HAS OCCURRED IN DIFFERENT VEHICLE MILEAGES. THIS IS POTENTIALLY DANGEROUS AND A HEALTH HAZARD TO DRIVERS AND INFANTS. BMW SHOULD BE SHOULDERING THIS UNACCEPTABLE HARDWARE FAILURE!  *TR",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2014",
        "dateOfIncident": "01/23/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562332,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST IS ENTERING THE CABIN THROUGH THE VENTING FILLING THE CAR WITH HARMFUL GASES.  I BROUGHT IT TO THE DEALER AND THEY DIAGNOSED IT AS A EGR COOLER/VALVE ISSUE.  THERE IS CURRENTLY AN \"OPEN CAMPAIGN\" FOR THE ERG BRACKET TO BE REPLACED BY BMW BUT NO SAFETY RECALLS ON THE EGR COOLER OR VALVE.    I AM CONCERNED ABOUT THE SAFETY OF THIS ISSUE SINCE THE LEAK STARTS OFF SLOW AND UNDETECTABLE AT FIRST THEN GROWS TO BE A SERIOUS BURN IN YOUR EYES AND NOSE.  THIS COULD BE ESPECIALLY HARMFUL TO FAMILIES WITH YOUNG CHILDREN.  *TR",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/18/2013",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552773,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST STEERING CONTROL. ON THE NIGHT OF JULY 12 I WAS MAKING A LEFT TURN AND ALL OF A SUDDEN STEERING BECOME EXTREMELY DIFFICULT TO TURN AND EXTREMELY STIFF. I TRIED TO TURN THE STEERING WITH FULL FORCE IN MY BODY TO AVOID HITTING THE POLE AND AND BARELY MISSED HITTING THE STREET LIGHT POLE. THIS INCIDENT SHAKED ME FOR A WHILE.  CAR WAS TOWED TO THE DEALERSHIP AND DETERMINED AND FOUND THAT ALTERNATOR BOLT FROM RECALL 11 11 12 (NHTSA CAMPAIGN NUMBER: 12V550000) HAD SNAPPED CAUSING BELT TO COME OFF AS WELL AS TENSION-ER. IT WAS VERY DISAPPOINTING FOR ME THAT  A 60 GRAND LUXURY VEHICLE BECAME A LIFE THREATENING HAZARD. AND EVEN AFTER THE SAFETY RE-CALL, IT'S A BIG HAZARD.I HAD CALLED CUSTOMER RELATIONS OF BMW ABOUT THIS AND APPARENTLY THEY TOOK IT VERY LIGHTLY.   *TR",
        "vin": "5UXFF0C53AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2013",
        "dateOfIncident": "08/23/2013",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537589,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW 2010 X5 DIESEL CAUGHT ON FIRE IN THE CENTER CONSOLE AREA AFTER ONLY A FEW MINUTES AFTER DRIVING CAR.  THE SOURCE OF THE FIRE SEEMED TO ORIGINATE UNDER THE CENTER CONSOLE CARGO AREA AS A HOLE ABOUT THE SIZE OF THE QUARTER WAS BURNED UP THOUGH THE BOTTOM OF THE CARGO AREA. THE INITIAL INDICATOR OF THE PROBLEM INCLUDED SMOKE COMING THROUGH VENTS.  ADDITIONAL PROBLEMS OCCURRED WHEN ATTEMPTING TO STOP THE CAR AS IT WAS DIFFICULT TO PUT IT IN PARK WHILE IT WAS ON FIRE.  WHEN EXITING THE VEHICLE FLAMES WERE COMING OUT OF THE CARGO AREA.    THE CAR WAS VERY GOOD SHAPE OTHERWISE WITH NO PROBLEMS AND THE CAR HAS BEEN IN FOR SERVICE IN THE BEGINNING OF THE YEAR.  THE CAR IS CURRENTLY STILL UNDER WARRANTY.  *TR",
        "vin": "5UXFF0C57AL"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2013",
        "dateOfIncident": "02/19/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499780,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY X5, 90 MINUTES FROM HOME, WHEN I NOTICED MY STEERING WAS UNUSUALLY STIFF. IT WAS 5 DEGREES OUTSIDE, SO I ASSUMED IT MIGHT HAVE BEEN TOO COLD. I WAS ABLE TO MOVE OVER TO THE RIGHT LANE, AND TURN ONTO THE NEAREST SIDE STREET. AT THAT POINT I GOT A CODE SAYING \"BATTERY DISCHARGE\".  I ASSUMED IT HAD SOMETHING TO DO WITH THE KEYLESS IGNITION, SO I SHUT IT OFF AND TRIED TO TURN IT BACK ON. IT DIDN'T WORK, AND IT GAVE ME THE SAME WARNING AGAIN.  IN ADDITION, THE ONBOARD SYSTEM WAS GIVING MESSAGES OF EACH OF THE SYSTEMS THAT WAS SHUTTING DOWN, ULTIMATELY, WITH EVERYTHING SHUTTING OFF, INCLUDING THE EMERGENCY LIGHTS. I HAD TO HAVE THE CAR TOWED.    AFTER THE DEALERSHIP LOOKED AT THE CAR THE NEXT DAY, THEY TOLD ME THIS WAS PART OF A RECALL FOR THE IDLER PULLEY BOLT. I LOOKED THIS UP, AND DISCOVERED THE LETTER DATED NOV. 26TH DESCRIBING THIS RECALL FROM BMW TO NHTSA. WE STARTED THE PURCHASING PROCESS OF THIS VEHICLE ON NOV. 26TH, ULTIMATELY PURCHASING IT ON NOV. 30TH. THE CARFAX DID NOT SHOW THIS RECALL REPAIR WHEN WE PURCHASED IT. MY DEALERSHIP IS CLAIMING THEY REPAIRED IT THAT WEEK, BEFORE WE PICKED IT UP, (AGAIN, NO MENTION OF A REPAIR). MY CONCERN IS THIS: IF IT WAS REPAIRED IN NOVEMBER, THIS REPAIR FAILED. IF THEY IGNORED THIS RECALL AND SOLD ME THE CAR, THAT WOULD BE NEGLIGENT. FURTHERMORE, WE HAD THE CAR INTO THE DEALERSHIP IN JANUARY 2013 FOR A TIRE ISSUE. IF THEY HAD NOT DONE THE REPAIR IN NOVEMBER, CERTAINLY THEY WERE RESPONSIBLE TO REPAIR IT THEN.  OBVIOUSLY THEY DIDN'T.  NOW, THE CAR COMPLETELY FAILS, AND IS IN THE SHOP. THIS REPAIR TOOK 3 DAYS! I AM UNSURE OF THE SAFELY, AS WELL AS THIS FAILURE BEING JUST A PULLEY BOLT. I AM AWARE OF THE MOST RECENT RECALL OF FEB.19TH, FOR ELECTRICAL PROBLEMS, BUT AT THIS TIME, DOESN'T INCLUDE THE X5? THE PULLEY BOLT PROBLEM DOESN'T SEEM TO FULLY DESCRIBE THE LOSS OF STEERING AND POWER I EXPERIENCED.  *TR",
        "vin": "5UXFF0C52AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499597,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 BMW X5 3.5 DIESEL WAS BROUGHT IN FOR SERVICE TO DIAGNOSE EXHAUST SMELL IN THE CABIN. DIAGNOSTICS UNVEILED A CRACKED EGR COOLER THAT ALLOWED RAW EXHAUST FUMES TO ENTER THE CABIN, POTENTIALLY RESULTING IN CARBON MONOXIDE POISONING TO DRIVER AND PASSENGERS. *TR",
        "vin": "5UXFF0C55AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2012",
        "dateOfIncident": "12/26/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490253,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE VEHICLE SUDDENLY STALLED. THE VEHICLE WAS TOWED TO THE DEALER AND THE CONTACT WAS AWAITING DIAGNOSIS. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 38,000.",
        "vin": "5UXFF0C57AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478912,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ENGINE START, MESSAGE DISPLAYS ON CONTROL DISPLAY INDICATING INCREASED BATTERY DRAIN AND THAT THE VEHICLE SHOULD BE SERVICED SOON.  DISPLAY SHOWS VEHICLE ON WHAT APPEARS TO BE A LIFT.  CONTACTED BMW AT ST. ALBANS WHO RECOMMENDED THAT I PURCHASE A BATTERY CHARGER SO THAT I MAY CHARGE THE VEHICLE AT NIGHT!  PROBLEM HAS REAPPEARED SEVERAL TIMES WITH NO SPECIFIC CAUSAL FACTOR (LEAVING THE IGNITION ON AFTER ENGINE STOP, LEAVING DOORS OPEN, ETC.)  *TR",
        "vin": "5UXFF0C58AL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2012",
        "dateOfIncident": "10/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478913,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PARK DISTANCE CONTROL ISSUE.  UPON SELECTION OF REVERSE, PARK DISTANCE CONTROL (PDC) SEEM TO FUNCTION PROPERLY, GIVING CORRECT VISUAL AND AUDIBLE ALERTS TO OBJECTS.  UPON TRANSITION TO DRIVE, HOWEVER, PDC MALFUNCTIONS IN THE FOLLOWING MANNER:  1) VISUAL ALERT ON CONTROL DISPLAY INDICATES IN RED, ALERTING ME TO AN OBJECT IN CLOSE PROXIMITY, EVEN WHEN NO OBJECT IN NEAR 2) CONTINUOUS AUDIBLE TONE CORRESPONDING TO RED DISPLAY.  THIS CONTINUOUS TONE/ALERT IS DISPLAYED FOR UP TO 20 SECONDS, UPON WHICH TIME BOTH INDICATIONS CEASE.  *TR",
        "vin": "5UXFF0C58AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2011",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428921,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REPORTS HIGH BATTERY DRAIN MESSAGE AND SOS MALFUNCTION ERROR MESSAGES. BMW NOT ABLE TO CORRECT.  *TR",
        "vin": "SUXFF0C52AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415863,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE HITS 100 DEGREES AS IT DOES IN THE DESERT 5 MONTHS OR SO PER YEAR, THE INTERIOR CABIN FILLS UP WITH VERY HARMFUL GAS FUMES.  WE OWNED A 2008 AND THE SAME SITUATION.  AS A RESULT OF THIS AND PROBLEMS WITH THE FUEL PUMP ON THE 2008, THE DEALERSHIP BOUGHT THE CAR BACK.  MY HUSBAND REALLY WANTED ANOTHER BMW AND WHEN HE WAS LOOKING AT BUYING THE 2010 HE WAS TOLD ALL THE PROBLEMS INCLUDING THE GAS FUMES HAD BEEN RESOLVED.  NOT SO.  THE CAR HAS BEEN BACK TO SERVICE TWICE FOR THE GAS FUMES AND NO ONE CAN SHED ANY LIGHT ON THE SITUATION.  WHEN THIS HAPPENS YOU CANNOT DRIVE THE CAR AS THE FUMES WILL KNOCK YOU OUT.  THE CAR HAS TO SIT ON THE DRIVEWAY AND AIR OUT FOR A FEW DAYS.  YOU CAN'T PARK IN THE GARAGE AS THE GAS FUMES ENTER THE HOUSE.  FOR A CAR OF THIS CALIBER IT IS NOT ACCEPTABLE.  PLUS IT IS VERY DANGEROUS TO YOUR HEALTH.",
        "vin": "WBANW1C5XAC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "10/13/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376725,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 BMW X5 DIESEL. THE CONTACT STATED THAT THE DRIVER SIDE SEAT BELT WOULD NOT RETRACT AND TWIST WHEN SECURING THE SEAT BELT. THE CONTACT STATED THAT HE WOULD HAVE TO DRIVE WITHOUT THE SEAT BELT SECURED.  THE FAILURE OCCURRED ON AN INTERMITTENT BASIS FOR FOUR MONTHS. THE VEHICLE WAS INSPECTED BY A DEALER WHO INFORMED THE CONTACT THAT HE WOULD NEED TO REPLACE THE SEAT BELT. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000.   UPDATED 2/23/11 *CN  THE CONSUMER STATED OVER TIME, HE WAS UNABLE TO USE THE SEAT BELT BECAUSE IT WOULD NOT RELEASE FROM THE PILLAR. BMW INFORMED THE CONSUMER THEY WOULD COVER FIFTY PERCENT OF THE COST, BECAUSE IT WAS HIS FAULT THE SEAT BELT WAS TWISTING DUE TO HIM NOT RELEASING IT PROPERLY. UPDATED 04/28/11*JB",
        "vin": "5UXFF0C58AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "12/08/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369896,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME THIS PARTICULAR PROBLEM HAPPENED. THE FIRST TIME THE CAR LOST POWER WHEN REVS WENT UP ABOVE 3.5K RPM AND RECOVERED AS SOON AS REVS FELL BELOW THIS RANGE. THIS ALMOST RESULTED IN AN ACCIDENT SINCE THE DRIVER BEHIND ME WAS TAKEN BY SURPRISE WITH THE ABRUPT REDUCTION IN SPEED. I TOOK THE CAR TO BMW FOR SERVICE AND THEY REPORTED IT HAD BEEN FIXED. THE SECOND INCIDENT OCCURRED WHILE DRIVING AT 60MPH ON THE LEFTMOST LANE OF A THREE LANE HIGHWAY. THE CAR COMPLETELY LOST POWER AND A WARNING WAS DISPLAYED INDICATING: \"ENGINE MALFUNCTION, YOU MAY BE ABLE TO CONTINUE AT REDUCED POWER\". THERE WAS NO POWER AT ALL. THE ENGINE WAS COMPLETELY OFF, CAR SWITCHED TO NEUTRAL. I TURNED THE HAZARD LIGHTS ON SINCE THERE WAS A LOT OF COMMUTING TRAFFIC AND THE QUICK REDUCTION IN SPEED COULD HAVE AGAIN RESULTED IN A SERIOUS ACCIDENT. I MANAGED TO COAST TO THE SHOULDER ON THE RIGHT AND CALLED ROADSIDE ASSISTANCE. CAR WAS TOWED AND IS BEING SERVICED BY BMW. SEARCHING THE WEB I FOUND NUMEROUS REFERENCES TO THIS EXACT PROBLEM REPORTED AS EARLY AS 2008. SOME OF THE REPORTS INDICATE THAT THIS ISSUE HAPPENED A FEW TIMES TO THE SAME CAR EVEN AFTER THE ISSUE WAS DECLARED RESOLVED. I AM DUMBFOUNDED BY THE FACT THAT A RECALL HASN'T BEEN ISSUED. DOES IT TAKE SOMEONE DYING FOR ANYONE TO PAY ATTENTION AND DO THE RIGHT THING? *TR",
        "vin": "WBANV9C50AC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2010",
        "dateOfIncident": "09/14/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370053,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5-SERIES",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT ILLUMINATES WITH ADULT PASSENGER FIRMLY BELTED INTO PASSENGER SEAT. LIGHT REMAINS ILLUMINATED FOR PERIODS WHICH VARY FROM 5 MINUTES TO 30 MINUTES. THERE IS NO WAY TO TELL IF THIS IS A DEFECTIVE LIGHT ONLY OR IF THE AIR BAG IS INOPERATIVE. AN ADDITIONAL SAFETY CONCERN IS THAT BMW DIAGNOSTIC TECHNIQUES ARE NOT ABLE TO DETECT THIS FAILURE. BMW REFUSES TO CORRECT THE DEFECT.",
        "vin": "WBANW5C55AC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325395,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW I AM DRIVING DOES NOT HAVE AN ADJUSTMENT FOR THE SEAT BELT HEIGHT. THE SEAT BELT DOES NOT PROPERLY FIT ME AS I AM 5' 2\". IT COMES ACROSS MY NECK, NOT MY SHOULDER, NO MATTER HOW I ADJUST THE SEAT. IT IS UNCOMFORTABLE AND MAY POSE A SAFETY RISK. THERE HAS BEEN NO PARTICULAR INCIDENT OR ACCIDENT. I AM MAKING THIS COMPLAINT TO LET YOU KNOW THAT THERE MAY BE A FUTURE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308754,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2010 BMW X5 35D HAS STALLED MULTIPLE TIMES, IN MAJOR INTERSECTIONS COMPLETELY OUT OF THE BLUE. THE VEHICLE FLASHES \"ENGINE MALFUNCTION\" AND \"REDUCED POWER.\" THERE IS NO WAY TO CURE THIS ISSUE, AND IT ONLY SELF-CORRECTS AFTER A MATTER OF MANY MINUTES. WHEN THROTTLE IS APPLIED, DURING SUCH AN INCIDENT, THE VEHICLE BUCKS WILDLY, BETWEEN STALLING AND STARTING.  THERE ARE MANY OTHER BMW X5 OWNERS HAVING THIS ISSUE.  NO FAULT CODES ARE REGISTERING ON THE COMPUTER AND THE VEHICLE SELF-CORRECTS AFTER STARTING AND STOPPING THE ENGINE MULTIPLE TIMES VIA THE PUSH-BOTTOM STOP BUTTON. ONCE THIS TOOK 3-HOURS TO RECTIFY, WHILE I WAS STUCK ON THE SIDE OF A BUSY HIGHWAY. THIS HAS ALSO HAPPENED AT TIMES IN WHICH I'M MAKING LEFT-HAND TURNS IN BUSY INTERSECTIONS, NARROWLY AVOIDING A HIGH-SPEED IMPACT. MY VEHICLE HAS ONLY 4,000 MILES ON IT.  MY DEALER HAS BEEN UNRECEPTIVE TO THE ISSUE.  I CONTACTED BMW NORTH AMERICA'S CUSTOMER SERVICE TWICE AND THEY TOOK A REPORT BUT NEVER CONTACTED ME BACK.  I'VE LEFT MESSAGES WITH THE CUSTOMER SERVICE DEPARTMENT AT BMW NORTH AMERICA AND STILL NO RESOLVE.     THIS IS A VERY DANGEROUS SITUATION.  I HAVE NO IDEA AS TO WHEN THE VEHICLE WILL STALL OR MALFUNCTION.  I FEEL I CAN HANDLE AN EMERGENCY, OR AT LEAST LESSEN A POTENTIAL IMPACT IN A WORST CASE SCENARIO, BUT I DO NOT FEEL THE SAME ABOUT MY WIFE.  THE CAR LOOSES ALL BRAKE AND STEERING PRESSURE, AND I FEEL VERY UNSAFE DRIVING MY FAMILY IN THIS VEHICLE.  MULTIPLE OTHER OWNERS HAVE SOLD THEIR VEHICLES AS A RESULT, BUT THOSE VEHICLES ARE GOING TO END UP IN THE HANDS OF OWNERS WHO WILL EXPERIENCE THE SAME ISSUES.  IT'S ONLY A MATTER OF TIME BEFORE SOMEONE EXPERIENCES THIS ISSUE, IN AN INTERSECTION, AND IS KILLED BY ONCOMING TRAFFIC.     PLEASE ASSIST US IN OBTAINING RELIEF TO THIS KNOWN ISSUE.  YOU CAN VISIT THIS FORUM, WHICH IS ONE OF DOZENS, THAT COMPLAINS ABOUT THE ISSUE IN QUESTION. HTTP://WWW.XOUTPOST.COM/BMW-SAV-FORUMS/X5-E70-FORUM/68822-ENGINE-WARNING-BATTERY-FAILURE-SAME-TIME.HTML. *TR",
        "vin": "5UXFF0C53AL"
    }
]