[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "12/16/2013",
        "fire": true,
        "manufacturer": "Carriage Industries",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568426,
        "products": [
            {
                "manufacturer": "Carriage Industries",
                "productMake": "CARRIAGE",
                "productModel": "CAMEO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY IN A CAMPGROUND, WATCHING TV, THE MICROWAVE/OVEN TURNED ITSELF ON AND BEGAN SPARKING AND THE SMELL OF AN ELECTRICAL FIRE AND HAZE FILLED THE COACH.  LATER INSPECTION AT AN RV REPAIR SHOP REVEALED THE IOTA AUTOMATIC TRANSFER SWITCH ITS-50R HAD OVERHEATED, SHORTED OUT CAUSING A FIRE, MELTING WIRES, GFI AND 50 AMP BREAKER BOXES AND CAUSING APPROXIMATELY $2,400.00 IN DAMAGES.  THIS TRANSFER SWITCH WAS LOCATED IN A 2010 CARRIAGE CAMEO FIFTH WHEEL.  PICTURES WERE OBTAINED.",
        "vin": "16F62E4R3A1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/03/2013",
        "dateOfIncident": "01/17/2011",
        "fire": false,
        "manufacturer": "Carriage Industries",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510528,
        "products": [
            {
                "manufacturer": "Carriage Industries",
                "productMake": "CARRIAGE",
                "productModel": "CAMEO",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DURO TIRE & WHEEL",
                "productMake": "DURO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": "225/75D15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CARRIAGE CAMEO FIFTH WHEEL. THE VEHICLE WAS EQUIPPED WITH DURO RADIAL TIRES, TIRE SIZE ST235/80/16.  THE CONTACT NOTICED THAT ALL FOUR TIRES EXHIBITED SEVERE TREAD SEPARATION. THE DEFECTIVE TIRES HAD NOT BEEN REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 3,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/26/2012",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "Carriage Industries",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477218,
        "products": [
            {
                "manufacturer": "Carriage Industries",
                "productMake": "CARRIAGE",
                "productModel": "CAMEO",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DURO TIRE & WHEEL",
                "productMake": "DURO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": "225/75D15",
                "type": "Tire"
            }
        ],
        "summary": "BOUGHT NEW 2010 CARRIAGE CAMEO 37 FT 5TH WHEEL IN OCT OF 2011.  HAD APPROX. 2000 MILES ON AND WAS 600 MILES FROM HOME WHEN NOTICED BULGES IN ALL FOUR DURO TIRES.  CALLED DURO TIRE AND WAS TOLD THIS WAS COMMON.  NO DURO TIRE STORES IN AREA, BUT WAS TOLD THEY WOULD SHIP 5 NEW TIRES TO ME.  WOULD TAKE ONE OR TWO WEEKS.  EXPLAINED THIS WOULD NOT WORK AND THEY SAID TO TAKE PICTURES OF BULGES & COULD FILE A CLAIM WHEN I RETURNED HOME.  I SENT PICTURES OF TIRE DAMAGE AND PICTURE OF 5 TH WHEEL BILL OF SALE TO DURO TIRE.  WAS THEN TOLD THEY ALSO WANTED PICTURES OF DOT AND ALL NUMBERS FROM ALL TIRES.  I EXPLAINED TIRES WERE 600 MILES AWAY AND I WAS NOT INFORMED OF THEIR NEED FOR EXTRA PICTURES.  THEY THEN SAID SORRY FOR POOR COMMUNICATION, BUT THERE COULD BE NO CLAIM WITHOUT DOT INFORMATION.  THE TIRES ARE 235 80R16 E LOAD RATED AT 3520LBS EACH @ 85PSI.  THE HITCH WEIGHT IS 2,200 LBS.  THE TIRES WERE NOT OVER LOADED!  JUST POOR QUALITY TIRES.  I DO NOT APPRECIATE GETTING JERKED AROUND BY THIS TIRE CO. BUT MORE THAN THAT   I AM VERY UPSET ABOUT BEING PUT IN SUCH A DANGEROUS POSITION OUT ON OUR HIGHWAYS.  *TR",
        "vin": "16F62E4R2A1"
    }
]