[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/15/2014",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "Coachmen RV Company, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10582832,
        "products": [
            {
                "manufacturer": "Coachmen RV Company, LLC",
                "productMake": "COACHMEN",
                "productModel": "FREELANDER",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "LTX M/S",
                "productYear": "9999",
                "size": "LT225/75 R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 COACHMAN FREELANDER. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 65 MPH, THE FRONT DRIVERS TIRE WENT FLAT WITHOUT WARNING. THE TIRE WAS REPLACED WITH A NEW TIRE. THE CONTACT RECEIVED THE RECALL NOTIFICATION RELATED TO NHTSA CAMPAIGN ID NUMBER 13T012000 (TIRE).  THE MANUFACTURER WAS NOTIFIED OF THE DEFECT AND STATED THE CONTACT WOULD NOT BE REIMBURSED FOR REPLACEMENT OF THE TIRE. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "1FDXE4FS6AD"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Coachmen RV Company, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433994,
        "products": [
            {
                "manufacturer": "Coachmen RV Company, LLC",
                "productMake": "COACHMEN",
                "productModel": "FREELANDER",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH PRESSURE PROPANE GAS LINE FROM THE PROPANE TANK TO THE STOVE HAS CRACKED.  I JUST DISCOVERED THIS YESTERDAY NOV 1, 2011 WHILE LOOKING FOR THE REASON THE GAS TO THE STOVE WAS SHUTTING DOWN WHILE THE SLIDE WAS RETRACTED.  WHAT I FOUND WAS THE GAS LINE PINCHED AT A 180 DEGREE ANGLE, FOLDED BACK ON ITSELF.  WHEN THE SLIDE-OUT IS EXTENDED THE GAS LINE STRAIGHTENS ENOUGH TO ALLOW GAS TO FLOW.  WHEN THE SLIDE-OUT IS DRAWN BACK IN TO MOVE THE MOTORHOME, THE GAS LINE IS FOLDED AND PINCHED CLOSED.  I INSPECTED THE GAS LINE AT THE FOLD/PINCH POINT AND DISCOVERED A CRACK ON THE OUTSIDE OF THE HIGH PRESSURE RUBBER TUBING.  THE SLIDE-OUT HAS BEEN MOVED, IN AND OUT, APPROXIMATELY 100 TIMES SINCE PURCHASING NEW IN SEPTEMBER 2002.  THE SMALLEST HOLE IN THIS LINE WOULD PRODUCE A MAJOR LEAK RESULTING IN POSSIBLE EXPLOSION WITH SEVERE BODILY BURNS OR DEATH.  I CONTACTED RON ROFF IN CUSTOMER SUPPORT AT THE FORREST RIVER FACTORY AND HE SEEMED LESS THAN CONCERNED, TELLING ME NOT TO WORRY, THE GAS ALARM WOULD SOUND IF A LEAK SHOULD DEVELOP AT THE CRACKED AREA.  AND HIS POSITION, ACTING IN BEHALF OF THE COMPANY, IS TO SEND ME A NEW HOSE, CASE CLOSED.  THIS REPAIR/REPLACEMENT NEEDS SPECIAL TOOLS, QUALIFIED UNDERSTANDING OF CONNECTING GAS LINES AND HOW THE GAS LINE SHOULD BE PLACED BENEATH THE SLIDE-OUT FLOOR SO THIS PROBLEM WILL NOT HAPPEN AGAIN.  ALSO, THE SLIDE-OUT HAS TO BE LIFTED TO MAKE THE CONNECTIONS UNDER THE FLOOR OF THE SLIDE-OUT.   I'M SURE THERE ARE MANY OTHER SIMILAR SITUATIONS WITH FREELAND SLIDE-OUT MODELS.  I SURE HOPE THESE DEFECTS ARE CORRECTED BEFORE SOMEONE IS BLOWN UP AND DIES.  I TURNED MY GAS TANK OFF AND AM TAKING IT TO A RV DEALER.   I WISH I COULD MAKE THE REPAIRS MYSELF BUT IT IS BEYOND MY CAPABILITY.   THANK YOU     UPDATED 11/10/11  *BF  *TR  UPDATED IVOQ 03/12/12  UPDATED IVOQ 06/05/12",
        "vin": "1FDXE45S78D"
    }
]