[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118986,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AS USUAL IN MY NEIGHBORHOOD AROUND 40 MPH WHEN CAR RPM STARTED ACCELERATING PAST 4 RPM WHEN I WAS AT 1RPM. I HIT THE BRAKES WHICH DIDN'T SEEM TO WORK AND PULLED TO THE SHOULDER AND PUT IT IN PARK. I STARTED CAR AGAIN AND DROVE 1 MILE TOWARDS HOME. LUCKILY, I DIDN'T TRAVEL FAR. WHEN I STARTED THE CAR AGAIN IT WAS ACCELERATING WHILE IN PARK. I HAD 2 CHILDREN AND AN INFANT IN THE CAR. I WILL NEVER SET FOOT IN THIS CAR AGAIN! NORMALLY TRAFFIC IS HEAVY, BUT I WAS LUCKY THAT I DIDN'T HIT ANYONE",
        "vin": "2A4RR2D18AR"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003614,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CHRYSLER 200. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V668000 (SEAT BELTS, AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1C3CC4FB2AN"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002763,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CHRYSLER 200. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V668000 (AIR BAGS, SEAT BELTS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VICTORY CHRYSLER DODGE DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1C3CC4FB1AN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986369,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CHRYSLER 200. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V668000 (ELECTRICAL SYSTEM) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN MARCH OF 2016. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1C3CC4FB2AN"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CHRYSLER 200. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V668000 (SEAT BELTS, AIR BAGS) HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1C3CC4FB6AN"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948858,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 CHRYSLER 200. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V668000 (AIR BAGS, SEAT BELTS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1C3CC4FB3AN"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/25/2016",
        "dateOfIncident": "02/25/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838448,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN MOTION IT TURNS OFF LEAVING ME WITHOUT CONTROL ON STEERING, I HAVE TO PUT IN NEUTRAL TO START AGAIN! IT HAPPENS ALMOST EVERY DAY",
        "vin": "2A4RR8DX5AR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/27/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816741,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 (NA) CHRYSLER 200. THE CONTACT STATED THAT THERE WAS NO RESPONSE WHEN THE KEY FOB WAS USED TO LOCK AND UNLOCK THE DOOR. UPON TURNING OFF AND RE-ENTERING THE VEHICLE, THE HORN SOUNDED. THE CONTACT TOOK THE VEHICLE TO A REPAIR SHOP FOR INSPECTION. THE KEY WAS TURNED AND THE VEHICLE CONTINUED TO MAKE AN ABNORMAL NOISE. THE VEHICLE WAS TO BE TAKEN TO A DEALER FOR INSPECTION AND DIAGNOSIS TO DETERMINE THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1C3LC46K78N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789097,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE DOOR WILL SOMETIMES NOT CLOSE.",
        "vin": "IC3CC4FBOAN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763522,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 09/10 DURING RUSH HOUR. I WAS TRAVELING NORTH ON THE FLORIDA TURNPIKE AND ALL OF A SUDDEN MY CAR KICKS BACK AND  THE CAR BEHIND ME ALMOST HITS ME AND THEN MY CAR RESUMES TO DRIVING  BUT THE CAR WOULD NOT ACCELERATE NO MORE THE 60 MPH. THE ENGINE LIGHT KEEP FLASHING AND THEN STARTED TO BEEP. I KEEP DRIVING WITH THE HAZARD LIGHTS THIS WAS IN THE MIDDLE OF THE NIGHT AS I ALMOST GOT HIT BY A SEMI-TRUCK BECAUSE THE SPEED ALL OF A SUDDEN STARTED TO DECREASE THERE WAS NOWHERE WERE I WAS ABLE TO PULL OVER TO THE SIDE THEN MY SPEED DECREASE TO 40 AND ONCE AGAIN IT KICKED BACK AND ALMOST GOT HIT BY ANOTHER CAR SINCE IT WAS LATE AT NIGHT ALREADY. THEN ALL OF A SUDDEN I WAS UNABLE TO CONTROL THE CAR AS IT STARTED TO DIE AND THE BREAKS WERE NOT WORKING AND MANAGED TO STEER TO THE RIGHT AND THE CAR STOPPED AS IT ALMOST HIT A RAIL. I CALLED EMERGENCY ROAD SIDE SERVICE AND THEY TOWED THE CAR TO THE PLANET DODGE IN MIAMI AND IT WAS LEFT THERE SO THEY CAN SERVICE THE CAR THE NEXT DAY. IT WAS NOT UNTIL SAT. 09/12 I WAS TOLD IT WAS THE PCM MAIN COMPUTER ON THE CAR AND IT WAS ON BACK ORDER AND THEY DID NOT KNOW WHEN THEY WOULD HAVE IT AVAILABLE. TODAY 09/14 THE DEALERSHIP FINALLY ORDERED THE PCM BUT HAVE NO IDEA WHEN IT WOULD BE IN TO REPAIR MY CAR. GOD KNOWS HOW MANY 2010 SEBRING CHRYSLERS ARE OUT THERE WITH THIS SAME PROBLEM SINCE THIS PCM COMPUTER IS ON BACK ORDER. MY CAR IS 5 YEARS OLD THIS SHOULD NOT HAVE HAPPENED I COULD HAVE KILLED MYSELF OR SOME OTHER INNOCENT PEOPLE ON THE ROAD. I FEEL THIS IS VERY DANGEROUS AND I COULD HAVE KILLED MYSELF. I BELIEVE THIS IS A PROBLEM BY CHRYSLER AND THIS SHOULD BE ON RECALL. I DO NOT UNDERSTAND WHY I WOULD HAVE TO PAY FOR THIS FAULTED COMPUTER PLACED IN MY CAR THIS HAZARDOUS TO ANYONE ON OWING THIS CAR. PLEASE RECALL THE PCM COMPUTER ON ANY 2010 SEBRING CHRYSLER. LET'S SAVE A LIFE!",
        "vin": "2C3CCAAG7EH"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2015",
        "dateOfIncident": "04/13/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CALLED CHRYSLER GROUP LLC STARTING BACK IN APRIL CONCERNING MY AIRBAG LIGHT COMING ON AS WELL AS MY POWERTRAIN FEELING WEIRD WHILE DRIVING.  THE INDIVIDUALS AT CHRSLER GROUP \"SUPPOSEDLY\" SET UP ME SEVERAL APPOINTMENTS WITH LOCAL CHRYSLER DEALERSHIPS, NO ONE THERE HAS TALKED TO ANYONE AT CHRYSLER GROUP LLC.  I HAVE BEEN TRYING TO GET MY CAR REPAIRED UNDER THE WARRANTY THAT IS ABOUT EXPIRE AUGUST 20TH, 2015 AND I STILL HAVEN'T HAD MY CAR LOOKED AT.  THIS IS A SAFETY ISSUE FOR ME AND MY SON, AS I TRAVEL QUITE A BIT.  I REALLY CAN'T DRIVE MY CAR BECAUSE I AM AFRAID OF SOMETHING HAPPENING WHILE I AM DRIVING.  I WOULD LIKE MY CAR REPAIRED UNDER MY WARRANTY AS I HAVE TRIED TO GET IT REPAIRED SINCE APRIL.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "02/05/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR HANDLE BROKE WHEN I ATTEMPTED TO ENTER THE VEHICLE.",
        "vin": "2C3CA5CV4AH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583232,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "200",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER FAILED.  I HAD FILLED THE TANK WITH GAS AND WAS PROCEEDING HOME IN TRAFFIC ON CONNECTICUT AVENUE IN WASHINGTON, DC.  WE WERE STOPPED DUE TO THE TRAFFIC LIGHTS.  THE DRIVER OF THE CAR BESIDE ME TO THE RIGHT MOTIONED FOR ME TO OPEN MY WINDOW.  HE TOLD ME THE GAS CAP WAS NOT ON AND WAVING AT THE SIDE.  I THANKED HIM AND THEN TRIED TO MANEUVER THE CAR.  THE CAR HAD NO POWER.  I TRIED MOVING THE GEAR INTO LOW, BUT THAT DID NOTHING.   THE CARS BESIDE ME AND BEHIND ME MOVED ON AS I SAT THERE.  I PUT THE GEAR IN NEUTRAL.  AS THE STREET WAS ON A DOWNHILL SLANT, ONCE THE CARS WERE GONE, THE CAR COULD SORT OF COAST AND I MANAGED TO STEER IT THROUGH FORCE ON THE STEERING WHEEL HEADING TO THE CURB SIDE WHERE THERE WAS A SIDE STREET.  AS THE CAR CAME TO A STOP JUST INTO THE SIDE STREET, A YOUNG WOMAN ON THE SIDEWALK COMMENTED ON THE GAS CAP. I ASKED IF SHE COULD PUT IT IN AND SAID THAT THE POWER HAD GONE OFF.  WE WONDERED IF THAT WOULD HELP.  SHE CLOSED THE GAS CAP.  I SHOVED THE GEAR INTO PARK AND IT JERKED AS I DID THAT.  I THEN TRIED TURNING THE KEY TO NO AVAIL.  I TOOK OUT THE KEY, REINSERTED AND TURNED IT AGAIN.  I BELIEVE IT WAS THEN THAT THE CAR STARTED AND I WAS ABLE TO TURN IT AROUND AND HEAD TO MY RESIDENCE THREE BLOCKS AWAY.  *TR",
        "vin": "1C3BC1FG5BN"
    }
]