[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268082,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A 2010 FLEETWOOD JAMBOREE SPORT 25G MOTOR HOME ON FORD E450 CHASSIS.  THE MOUNTING BRACKETS FOR THE PROPANE TANK CRACKED AND THE PROPANE TANK WAS CLOSE TO FALLING OFF THE VEHICLE.  IF THE TANK FALLS OFF WHILE DRIVING IT WILL BREAK THE HOSE ON THE WAY OUT, LEAK HIGH PRESSURE PROPANE, BE HIT BY THE REAR TIRES AND LIKELY LEAD TO A CRASH AND FIRE.  ITS OBVIOUS WITH ONE LOOK THE BRACKETS ARE POORLY ENGINEERED AND LIKELY TO FAIL WITH TIME.  THE PROPANE TANK IS SUSPENDED FROM TWO SIMPLE L-SHAPED ANGLE IRON BRACKETS WITH NO GUSSETS AND NO SUPPORT OF THE FAR END OF THE BRACKETS.",
        "vin": "1FDXE4FS3AD"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11171918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS LETTER TO EXPRESS CONCERN ABOUT THE BUS ACCIDENT IN WHICH MY FELLOW DRIVER, ARRIANA (BUS #502, LICENSE PLATE NUMBER (XXX) VIN NUMBER 1FDFE4FS9ADB(XXX)) WAS INVOLVED IN ON JANUARY 15, 2019 AT APPROXIMATELY 1:07 PM ON HIGHWAY 99 NORTHBOUND NEAR/AROUND THE (XXX) RAMP. ACCORDING TO THE ACCIDENT VIDEO THAT WAS SHOWN TO ME DURING A DRIVERS SAFETY MEETING HELD BY GARY VICKERS TRANSPORTATION OPERATION MANAGER OF PARATRANSIT INC SACRAMENTO CA AT 9:30 AM JANUARY 23 2019, BUS #502 WAS TRAVELING AT APPROXIMATELY 45 MPH OR HIGHER, AND AT IMPACT THE DRIVER'S AIRBAG DID NOT DEPLOY. THIS BUS IS ENDANGERING OUR LIVES AND SERIOUS INJURE WITH IMPROPER FUNCTIONING VEHICLES. AFTER TODAY I DO NOT FEEL SAFE TO DRIVE ANY OF THE PARATRANSIT BUSE. I ALSO RECOMMEND THAT ALL PARATRANSIT INC BUSES ARE RE-INSPECTED AN TO ENSURE THAT ALL BUSES ARE WORKING APPROPRIATELY AND THAT AIRBAGS ARE WORKING PROPERLY. LASTLY, I ALSO RECOMMEND THAT US HIGHWAY SAFETY ADMINISTRATION CONDUCT A THOROUGH INVESTIGATION WITH THE MANUFACTURE WHO BUILT THESE BUSES TO DETERMINE IF THE BUSES' AIRBAGS ARE ON RECALL SINCE THE ABOVE VEHICLE DID NOT DEPLOY. AGAIN, AS BUS DRIVER I AM CONCERNED FOR ALL BUS DRIVERS, PASSENGERS, AND THE PUBLIC'S SAFETY. I HOPE THAT MY RECOMMENDATIONS ARE TAKEN SERIOUSLY AND CONSIDERED FOR FURTHER INVESTIGATION.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *CW",
        "vin": "1FDFE4FS9AD"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN MOTION GOING UP HILL.  STALLED OUT BECAUSE OF FUEL FILTER PLUGGED, LOCATED IN FUEL TANK. ALMOST WAS HIT BY SEMI BECAUSE VEHICLE STOPPED RUNNING. JULY 9, 2018. FORD NO LONGER PUTS FILTER IN TANK.  MOST FUEL FILTERS ON THIS TYPE OF VEHICLE  ARE LOCATED ON FRAME OUTSIDE OF FUEL TANK.  ENGINEER'S MISTAKE? REPAIRS HAD TO BE MADE AND CHARGE WAS $1414. CONTACTED FORD COMPLAINT DIV. JULY 20.  THEY HAVE NOT REPLIED OR ANSWER MY COMPLAINT.  THESE VEHICLES SHOULD HAVE BEEN RECALLED YEARS AGO, HOWEVER SEEMS AS IT HAS GONE UNNOTICED.  MECHANIC WHO  REPAIRED VEHICLE AGREED THAT IT WAS NOT A GOOD PLACE TO PUT THE FILTER, DO TO OWNERS RELUCTANCE TO CHANGE FILTER ON A REGULAR BASIS, BECAUSE OF THE EXTRA COST TO DROP THE FUEL TANK TO ACCESS THE FUEL FILTER AND PUMP.  I AM SURE OTHER OWNERS HAVE  EXPERIENCED THIS PROBLEM, BUT IGNORED IT AND HAD THEIR VEHICLE FIXED.  AGAIN WITH LOSS OF POWER GOING UP A HILL AND STALLING IN FRONT OF HEAVY TRAFFIC COULD RESULT IN INJURY OR DEATH IF ONE WOULD BE REAR ENDED.  AGAIN... FORD HAS NOT CALLED OR WRITTEN WITH AN EXPLANATION OR REPLY.  YOUR ATTENTION WOULD BE APPRECIATED.  SINCERELY,  [XXX]      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *CC *TR",
        "vin": "1FDXE4FSXAD"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/02/2015",
        "dateOfIncident": "11/22/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER DISCOVERER H/T",
                "productYear": "9999",
                "size": "LT225/75R16",
                "type": "Tire"
            }
        ],
        "summary": "TREAD SEPARATED FROM TREAD.",
        "vin": "1FDXE45S79D"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "07/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692248,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 FORD E-450. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH, THE BRAKE PEDAL WAS DEPRESSED AND VEHICLE ACCELERATED AT THE SAME TIME. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.   UPDATED 5/28/15*CN",
        "vin": "1FDXE4FS3AD"
    }
]