[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447150,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The rubber body mounts that are used between the body and chassis have deteriorated and crumbled to the point that there is nothing left but the bolt where a mount or bushing once was and this has happened within 100,000 or less on this vehicle when first noticed due to very harsh ride, body roll, popping and screeching noise from underneath van due to the rubber missing in places. This has been a constant problem with our f-250 Ford trucks as well and we do not drive the van or trucks off road and do not tow either and never drive in salt on roads in the winter so this is not due to road salt or muddy wet conditions of off roading as we are in the house cleaning business and never drive on anything other than paved or solid driveways on all jobs and do not work if bad weather is present. The bad mounts cause severe body roll, radiator damage due to bottom of radiator making contact with frame because rubber eventually fell apart and caused body to contact chassis cracking the radiator on bottom and the flexing due to instability cracked the side casing on radiator as well. This has been a safety issue for years and the new Ford trucks are still having this issue as we are dealing with this again on the new truck with less than 60,000 miles and this is the truck that we use to estimate jobs so it's basically a town truck and shouldn't be having failing body mounts. I believe during an accident the body could separate from chassis if this isn't corrected and it greatly affects the handling and ride of the vehicle when body contacts the chassis and also damages other components such as radiator. Reapirs about 2000.00 for new mounts replacement.",
        "vin": "1FTNS2ELXAD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "07/11/2016",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075670,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 FORD E-250. THE CONTACT STATED THAT THE ELECTRICAL WIRES MELTED ON HIS VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE OR AFTER THE FAILURE. THE VEHICLE WAS TAKEN TO TONY BETTEN & SON'S FORD INC (3839 PLAINFIELD AVE NE IN GRAND RAPIDS, MI) WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL WIRE HARNESS AND BLOWER SWITCH FAILED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "1FTNE2EW3AD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING IN MY TRUCK , MANY TIMES , WITH THE WINDOWS UP , I CAN SMELL EXHAUST IN MY CAB . MANY TIMES ON THE HIGHWAY , WHETHER THE WINDOWS ARE UP OR DON , WHEN I ACCELERATE , STRONG FUMES ENTER MY CAB AREA . THIS SITUATION ALWAYS HAPPENS AND CONTINUES TO HAPPEN !!",
        "vin": "1FTNE2EW3AD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023428,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 FORD E-250. THE CONTACT STATED THAT WHILE DRIVING AT ABOUT 50 MPH, THE FRONT END OF THE VEHICLE VIBRATED VIOLENTLY. THE FAILURE RECURRED. THE RANDALL REEDS PARK CITIES DEALER IN FORD, DALLAS WAS CONTACTED AT PHONE NUMBER: 214-358-8800, BUT THE DEALER DID NOT RETURN THE CALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 49,900.",
        "vin": "1FTSW2BR5AE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2017",
        "dateOfIncident": "09/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG WAS PUSHED OUT OF THE CYLINDER HEAD BY CYLINDER COMPRESSION RESULTING IN POWER LOSS AND FIRE CONCERN.  THESE ARE FACTORY INSTALLED SPARK PLUGS AND HAVE NEVER BEEN SERVICED. THE CONDITION OCCURRED AFTER A 200 MILE TRIP.  THIS VEHICLE HAS 95K MILES AND HAS BEEN ROUTINELY SERVICED.",
        "vin": "1FDNE2ELXAD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEATH WOBBLE OCCURS WHEN YOU HIT A BUMP IN THE ROAD LARGE OR SMALL .   I HAVE BEEN REPLACING EVERYTHING ON THE FRONT END  .   JUST ROTATED TIRES GOING TO SEE IF THAT WORKS",
        "vin": "1FTSW2BR9AE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565131,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MICHELIN LT 225 75R 16",
                "productYear": "1989",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2010 FORD E250.  CONSUMER WRITES IN REGARDS TO VEHICLE TIRES RECALL NOTICE.  CONSUMER REQUESTS REIMBURSEMENT FOR REPLACEMENT TIRES.  *SMD  THE CONSUMER STATED ON MARCH 15, 2013, SHE EXPERIENCED A PROBLEM WITH ONE OF THE TIRES. AN INSPECTION REVEALED A BULGE ON THE SIDEWALL. THE TRUCK WAS TAKEN TO A REPAIR SHOP, WHERE SHE WAS INFORMED THE TIRES DID NOT MEET THE OEM SPECIFICATIONS. ALL OF THE TIRES WERE REPLACED AT A COST OF $ 862.94. UPON RECEIPT OF THE RECALL, THE CONSUMER CHECKED THE SPARE TIRE ON THE VAN, AND DISCOVERED IT WAS ONE OF THE RECALLED TIRES IN THE NOTICE, AS VERIFIED BY THE LOCAL FORD DEALERSHIP. THE DEALERSHIP WAS ADDRESSING THE REPLACEMENT TIRE OF THE SPARE TIRE, THAT WAS STILL IN HER POSSESSION. THE CONSUMER STATED THE TIRES THAT WERE REPLACED BACK IN MARCH, WERE THE SAME AS THE SPARE TIRE, THAT WAS RECALLED. THE CONSUMER IS SEEKING REIMBURSEMENT.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/14/2013",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LOCKED UP AND WOULD NOT RELEASE NOR SLOW THE VEHICLE RESULTING IN CRASH.  *TR",
        "vin": "1FTNE2EW4AD"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/07/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378797,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-250",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE DRIVER OWNS A 2010 FORD E-250. WHILE DRIVING APPROXIMATELY 15 MPH THE DRIVER ATTEMPTED TO APPLY THE BRAKES BUT THE PEDAL WOULD NOT ENGAGE. THE VEHICLE THEN SURGED FORWARD UNTIL IT CRASHED.  THE CONTACT WAS UNAWARE IF A POLICE REPORT WAS FILED OR NOT. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE FAILURE WAS NOT DIAGNOSED WHEN THE COMPLAINT WAS FILED.  THE FAILURE AND CURRENT MILEAGES WERE UNAVAILABLE.",
        "vin": "1FTNF2B59AE"
    }
]