[
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442125,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Two component issues on 2010 Forest River 31THSB 1 - Lippert axle hub brake drum failure. Multiple failures of these axles and Lippert have not issued a recall. My trailer lost the wheel from the axle, with the brake drum still attached to the wheel. Fortunately, we were not traveling at highway speed. Tire rolled underneath the trail causing damage to the side and underside of trailer. Lippert are aware of these constant axle failures and their solution is to sell you two axles for the price of one. 3-to-4-week delivery! Does not include the property damage, or take in account we where 3000 miles from home.  2 – Lippert frame and wing supports, where pin box is mounted to the frame of trailer, failed. Front and back welds on wings to main frame broke. Huge safety issue. Repairs to the failed frame and wing supports were completed at an RV dealership. The dealership and welder commented that the manufacture welds were poorly done. Lippert rep has heard of this happening to other Forest River RVs but very few, but does happen! Fortunately no one was injured.  Just what you want to be doing while on vacation.",
        "vin": "4X4FWCG20AV"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084747,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 FOREST RIVER WILDCAT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V756000 (EQUIPMENT); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN RECREATIONAL VEHICLE DEALER IN SANTA ROSA, CALIFORNIA WAS MADE AWARE OF THE RECALL AND STATED THAT THE PART WAS UNAVAILABLE. THE KIDDE MANUFACTURER WAS CONTACTED AT 1-855-262-3540. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN FOR THE RECREATIONAL VEHICLE AND THE MODEL NUMBER FOR THE FIRE EXTINGUISHER WERE NOT AVAILABLE. *TT  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "07/19/2015",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778860,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRAILER BLEW TIRES ON OPPOSITE SIDES TRAVELING ON I-35 IN A STRAIGHT DIRECTION, IN ONE WEEK. REPAIR SERVICE SAID THAT THE BEARING HAD FAILED WITH NO REPLACEMENTS AVAILABLE NEW AXLES WOULD NEED PURCHASED. I FOUND REPLACEMENT BEARINGS AND NOW THE SERVICE PROVIDER SAYS THE HUBS ARE BAD. MANUFACTURER SAYS THEY DON'T HAVE A RECALL SET-UP BUT WILL SALE AXLES TWO FOR ONE. FORUMS ARE SHOW THIS AS A PROBLEM EXPERIENCED BY MANY. THIS IS WHY LIPPERT HAS DISCONTINUED REPLACEMENT PARTS.",
        "vin": "4Y4FWCG24AV"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "11/28/2011",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444211,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC#I11C0582A. 2010 FOREST RIVER WILDCAT TRAILER. CONSUMER STATED THE REAR AXLE HUB CAUGHT FIRE AND THE FACE OF THE HUB COMPLETELY CAME APART. *LN  THE CONSUMER STATED THE PART THAT CAME OFF, WAS THE PART THAT HELD THE LUG BOLTS TO WHICH THE TIRE WAS ATTACHED.",
        "vin": "4X4FWCF22AV"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2012",
        "dateOfIncident": "11/28/2011",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442971,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC#I11B0689A. FIFTH WHEEL TRAILER. CONSUMER STATED THE WHEEL HUB CAUGHT FIRE ON THE INTERSTATE AND THE WHEEL CAME OFF. *LN  ...UPDATE 01/20/12 *BF  THE AXLES WERE REPLACED. UPDATED 03/21/12",
        "vin": "4X4FWCF22AV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/28/2011",
        "dateOfIncident": "07/02/2011",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415549,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LIPPERT COMPONENT INDUSTRIES BUILDS FRAMES FOR RECREATIONAL VEHICLES, TRAVEL TRAILERS, AND FIFTH WHEELS.  THEY DID INSTALL (HAVE SINCE STOPPED INSTALLATION) AXLES WITH SEALED BEARING SYSTEMS AS PART OF THE FRAME BUILD.  IN READING NUMEROUS MESSAGE BOARDS (AND THROUGH PERSONAL EXPERIENCE) THESE ARE EXTREMELY PRONE TO FAILURE AND FAILURE WHILE TRAVELING ON THE HIGHWAY COULD CAUSE FIRES, LOSS OF CONTROL OF TRAILER, AND POSSIBLE WHEEL SEPARATION FROM TRAILER (FOR MORE EXPERIENCES SEARCH FOR SEALED BEARING SYSTEM ON THE WEB).  LIPPERT IS AWARE OF THE HIGH FAILURE RATE AND THIS IS EVIDENCED BY HOW QUICKLY THEY WILL REPLACE NOT ONLY THE AXLE THAT CONTAINS THE FAILED BEARING, BUT ALL AXLES ON THE TRAILER AND THEY DO IT WITHOUT EVEN QUESTIONING THE FAILURE (THEY REPLACED BOTH AXLES ON MY TRAILER AS WELL .  I FEEL (AS DO OTHERS) THAT LIPPERT SHOULD HAVE A SAFETY RECALL FOR THESE AXLES AS A FAILURE DOES CAUSE PROPERTY DAMAGE, AND COULD CAUSE SERIOUS INJURY OR DEATH.  MY TRAILER ONLY HAD 2800 MILES AND WAS ONLY 14 MONTHS OLD WHEN THE FAILURE OCCURRED.  I HAVE SEEN OTHER INSTANCES WHERE THESE BEARINGS FAIL AFTER ONLY 1000 MILES.  THE ONLY MAINTENANCE FOR THESE BEARINGS IS TO RAISE THE TRAILER AND CHECK THE WHEELS FOR EXCESSIVE PLAY, NO GREASING IS REQUIRED.  *TR",
        "vin": "4X4FWCD26AV"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/20/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402171,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "RFD COMPONENTS, INC.",
                "productMake": "RFD",
                "productModel": "TRAIL EXPRESS",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 FOREST RIVER WILDCAT WITH TRAIL EXPRESS POWER TOURING TIRES, SIZE ST225/75/R15 AND DOT 1KMM16A. WHILE THE VEHICLE WAS PARKED, THE CONTACT INSPECTED THE VEHICLE AND NOTICED THERE WERE CRACKS IN THE TIRES. THE VEHICLE WAS TAKEN TO A TIRE INSPECTION SHOP WHERE THE TECHNICIANS STATED THE TIRE TREAD WAS SEPARATING AND THERE WERE CRACKS ON THE SIDE OF THE TREAD. THE TIRE WAS REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 6,000.",
        "vin": "4X4FWCH23AV"
    }
]