[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210508,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN RIDING FOR UNDER FIVE MINUTES, CITY TRAFFIC, SPEED LIMIT 25MPH. AS I SLOWED FOR A TURNING CAR MY REAR BRAKE FAILED BY THE PEDAL LOCKING.   I CONTROLLED THE STOP AND RETURNED HOME.   I'VE NOW BEEN TOLD THE ABS CONTROL MODULE HAS FAILED AND THE REPAIR COST ARE TO BE AROUND 900.00. I FIND IT INCREDIBLY HARD TO BELIEVE THAT A MODULE FAILURE DEFAULTS TO A TOTAL LACK OF BRAKES! ONE MIGHT BE INCLINED TO THINK YOUD LOSE ABS FUNCTION, NOT TOTAL BRAKING!",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "04/29/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984573,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF GARAGE FRONT BRAKE WAS HARD AND WOULD NOT COMPRESS LUCKILY THERE WAS NO ONE COMING DOWN ROAD. IT RESULTED IN ME CRASHING MY BIKE IN THE ROADWAY.",
        "vin": "1HD1FC415AB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/03/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780882,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDE ABOUT 65 MPH ON MAJOR HWY WITH LOTS OF TRAFFIC. THE BIKE JUST LOST POWER, MOTOR WENT INTO IDLE OR LIMP HOME MODE. RIDING IN LEFT LANE, WITH SHOULDER ONLY ABOUT 2 FOOT WIDE, I COULD NOT PULL OVER TO LEFT SHOULDER. WITH TRAFFIC PASSING ME @65 TO 70 MPH  I WAS DOWN TO 15 MPH BEFORE I HAD ENOUGH CLEAR TRAFFIC BEFORE I COULD CHANGE LANES TO GET TO THE RIGHT SHOULDER OF THE ROAD. TRAFFIC BEHIND ME PARTICULAR  A 18 WHEELER BEHIND ME ALMOST CAME TO A STOP TO KEEP FROM RUNNING OVER ME. I HAVE FOUND OUT FROM FRIENDS AND HD FORUMS THAT THIS IS A COMMON OCCURRENCE  ON THIS MODEL BIKE, FROM 08 THRU 12  IF SOME ONE IS IN THE WRONG PLACE GOING UP OR DOWN A HILL, GOING THRU  INTERSECTION OR ON MAJOR HWY  WHEN THIS OCCURS DEATH OR INJURY COULD OCCUR. HARLEY DAVIDSON IS AWARE OF THIS ISSUE AND HAS ISSUED A SERVICE BULLETIN TT418A ON FIXING THE (TBW) THROTTLE BY WIRE, EITHER  THROTTLE POSITION SENSOR OR THE SENSOR WIRING. NO RECALL HAS BEEN ISSUED AND NEEDS TOBE BEFORE SOMEONE IS KILLED OR INJURED .",
        "vin": "1HD1FC413AB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2013",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523534,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SPROCKET ASSEMBLY HAS FAILED 2 TIMES.DEALER IS FIXING AT OWN EXPENSE WITH NEW IMPROVED SCREAMING EAGLE VERSION THAT WAS DEVELOPED TO FIX THIS PROBLEM. THIS NOW COMES STANDARD ON 20121 AND BEYOND MODELS. COULD CAUSE FATALITIES IF FAILS AT HIGHWAY SPEEDS. HD PUTS ON NEW BIKES BUT WILL NOT FIX PREVIOUS MODELS.  *TR",
        "vin": "1HD1FF414AB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2010",
        "dateOfIncident": "07/13/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343700,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 HARLEY-DAVIDSON FLHTC, AFTER ONLY 1025 MILES, EXPERIENCED A SERIOUS MECHANICAL BREAK DOWN IN THE TRANSMISSION.  THE MAIN SHAFT BROKE.  THIS IS A MAJOR COMPONENT TO THE OPERATION OF THIS VEHICLE.  I HAVE BEEN RIDING MOTORCYCLES (MAINLY HARLEYS) FOR THE PAST 34 YEARS AND HAVE NEVER HAD SOMETHING LIKE THIS HAPPEN ON A BIKE AFTER THOUSANDS OF MILES, LET ALONE ON ONE THAT WAS ONLY A MONTH OLD.  I WAS LUCKY THAT WHEN IT BROKE, I WAS STOPPED AT MY MAIL BOX.  IF THIS WOULD HAVE OCCURRED ON THE HIGHWAY AT GREATER SPEEDS, IT WOULD HAVE BEEN DISASTROUS.  AFTER HAVING IT TRANSPORTED TO THE DEALER, THEY INFORMED ME OF THE PROBLEM, OF WHICH I DIDN'T REALIZE WAS THAT SERIOUS AT THE TIME.  MAKE NO MISTAKE, THIS IS A SERIOUS MECHANICAL DEFECT AND SHOULD BE PRESENTED TO ALL HALEY-DAVIDSON OWNERS WITH THIS SIMILAR TYPE OF TRANSMISSION.  IT HAS BEEN 4 DAYS SINCE THIS INCIDENT AND ALL I KNOW IS THAT THE DEALER SAID THEY WOULD REMOVE THE TRANSMISSION AND SEND IT BACK TO THE FACTORY WITH NO EXPLANATION OF WHY IT FAILED.  THEY HAVE PROMISED TO REPLACE IT WITH A NEW ONE, WHICH IS THE SAME TYPE.  HOW DO I KNOW IT DOESN'T HAVE THE SAME TYPE OF DEFECT?  I BELIEVE THIS NEEDS INVESTIGATION BY SOMEONE THAT DEALS WITH VEHICLE MECHANICAL FAILURES THAT  WOULD CAUSE SERIOUS INJURY OR EVEN DEATH.  I HAVE EVEN SPOKE WITH THE FACTORY CUSTOMER SERVICE DEPARTMENT AND HAVE NOT HEARD BACK FROM THEM, EITHER.    *TR",
        "vin": "1HD1FF417AB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/24/2009",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296882,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE ENGINE AND EXHAUST HEAT. *TR",
        "vin": "1HD1FF413AB"
    }
]