[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2015",
        "dateOfIncident": "04/29/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713538,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE AND EXHAUST PRODUCES EXCESSIVE HEAT WHICH I BURNED MY PANTS ON AND THE HEAT IS OVERWHELMING .  I TALKED TO HD AND THEY WILL NOT ADMIT THERE IS A PROBLEM AND WANT TO BRUSH IT UNDER THE RUG.  PLEASE HELP THIS IS A MAJOR INCIDENT BURN JUST WAITING TO HAPPEN.  *TR",
        "vin": "1HD1MAM16AB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/27/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10432972,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE HEAT FROM EXHAUST SYSTEM CAUSES SEVERE BURNS TO UNDERSIDE OF RIGHT THIGH, KNEE AND CALF.  PAINFUL BLISTERING OF THE SKIN IN MANY PLACES ON RIDER'S RIGHT LEG FROM HEAT, (NOT FROM CONTACT WITH HEATED OR HOT COMPONENTS) WHILE WEARING LONG JEANS OR OTHER RIDING GEAR.  BURNS ARE SEVERE, WHICH MAKES RIDING IMPOSSIBLE WHILE BURNS ARE PRESENT (RUNNING RISK OF INFECTION AS WELL AS INCREASING NUMBER OF AND SEVERITY OF BURNS).  SCARRING HAS OCCURED.  THIS HAS HAPPENED ON SEVERAL OCCASIONS.  *TT",
        "vin": "1HD1MAM14AB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/19/2011",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421848,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREME HIGH HEAT FROM THE EXHAUST SYSTEM, CAUSING BURNS TO RIDER AND PASSENGER RIGHT LEGS.",
        "vin": "1HD1MAM11AB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10400369,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTORCYCLE HAS RUN VERY HOT FROM THE DAY I BOUGHT IT 5/10/2011.  EVERY TIME I HAD SERVICE, I COMPLAINED ABOUT THE HEAT FROM THE PIPES.  I STOPPED AT A HD DEALER IN ALEXANDRIA, LA ON 9/17/2010, AND ASKED THEM TO CHECK THE BIKE.  I WAS TOLD AT INSTALLATION THE PIPES HAD BEEN INSTALLED WITH NO REMAP OR HIGH FLOW FILTER. I WAS CHARGED $413.57 TO INSTALL THE NEEDED FILTER AND DOWNLOADED A NEW REMAP.  I LEFT ABOUT 5:30 P.M. TO RETURN TO MADISON, MS.  THE ONLY STOPS WERE AT GAS STATIONS TO FILL UP.  THE VENTS ON THE FAIRINGS WERE WIDE OPEN.  I RODE WITH MY LEGS UP FROM THE PEDALS BUT COULD FEEL MY RIGHT LEG GETTING UNCOMFORTABLY HOT.  WHEN I REACHED MY DESTINATION, I PULLED UP MY PANT LEG. I SAW MY RIGHT CALF WAS BLISTERED FROM THE EXCESSIVE HEAT FROM THE PIPES. (I HAVE A PICTURE OF MY BLISTERED LEG.) I CALLED HD HEADQUARTERS AND THEY SAID I SHOULD TAKE IT TO A DEALER FOR SERVICE.  THE LOCAL DEALER WAS NOT COOPERATIVE WHEN I CALLED TO TALK TO THE SERVICE DEPARTMENT.  THEY SAID THE TRIKES RUN HOT .  APRIL 2011, I WENT TO WILDCAT HD IN LONDON, KY BECAUSE THEY HAVE A TRIKE DYNAMOMETER.  THEY TESTED THE BIKE AND IT SHOWED IT RAN A FEW DEGREES ABOVE ACCEPTABLE LIMITS.  HD HEADQUARTERS REFUSED TO PAY FOR ANY MODIFICATIONS TO THE BIKE.  IT COST ME $1470 TO INSTALL POWER DUAL HEADPIPES AND A SUPER TUNER AS WELL AS THE COST OF THE DIAGNOSTIC TEST ON THE DYNAMOMETER.  THIS IS THE FIRST TIME SINCE I BOUGHT THE TRIKE THAT IT HAS BEEN A COMFORTABLE RIDE WITHOUT EXCESSIVE HEAT COMING FROM THE PIPES.  IT IS STILL UNDER WARRANTY YET, HARLEY DAVIDSON DOESN'T CONSIDER THIS TO BE COVERED BY THE WARRANTY.  I HAVE LOOKED AT THE WEB PAGES AT HDFORUMS.COM AND FOUND THIS TO BE A COMMON COMPLAINT WITH OTHER TRIKE OWNERS.  THEY HAVE RECEIVED NO HELP FROM HD HEADQUARTERS.  I FEEL THIS IS A SAFETY ISSUE THAT HARLEY DAVIDSON NEEDS TO ADDRESS AND FIX.",
        "vin": "1HD1MAM19AB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/23/2010",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10362084,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A ACCIDENT DO TO THE BRAKES ON MY 2010 HARLEY TRIKE NOT BEING ABLE TO STOP. ON 6-5-10 I REAR ENDED A FORD EXPLORER AT 50 MPH. AFTER LOCKING UP THE FRONT BRAKES, THE REAR BRAKES DIDN'T LOCK UP OR HELP STOP MUCH AT ALL.  I  COMPLAINED ABOUT THEM SQUEALING, AND THEM NOT ABLE TO STOP LIKE THEY SHOULD ,BUT I NEVER HAD TO STOP LIKE I NEEDED TO THAT DAY.. IT IS TOTALLY IMPOSSIBLE TO LOCK UP THE REAR BRAKES OR TO STOP HARD WITH THE REAR BRAKES. AFTER HAVING THE BRAKES LOOKED AT 6 TIMES AT LEAST AND TWO DEALERS DOING WHAT THEY COULD, INCLUDING REPLACING THE PADS WITH NEW STOCK PADS. STILL NOT HAPPY I HAD THEM REPLACED WITH LYNDALL BRAKES. THEY STOPPED THE SQUEALING BUT DIDN'T SEEM TO HELP WITH THE STOPPING BUT DIDN'T HURT ANYTHING EITHER. I CALLED H.D. ABOUT THIS PROBLEM BUT THEY MADE IT SEEM LIKE I WAS THE ONLY ONE WITH ANY PROBLEMS AND DIDN'T HEAR FROM THEM AFTER. MY INJURIES CONSISTED OF 4 BROKEN RIBS, TORN MENISCUS IN MY KNEE THAT NEEDS TO BE SCOPED OUT, I HAD PRIOR HIP PAIN BUT BECAUSE OF THE ACCIDENT I NEED A HIP REPLACEMENT 15-20 YEARS SOONER. FRACTURED A BONE OFF IN MY SPINE BUT THEY SAID WERE IT WAS WASN'T IN A SPOT THAT NEEDED SURGERY. ROAD RASH ON BOTH ARMS. HAD TO HAVE A TATTOO REDONE. MY BACK, LOWER BACK, HIP AND RT FOOT WAS BRUISED BADLY. THREE MONTHS OFF OF WORK, 17,000 DAMAGE TO BIKE, AND 18,000 DAMAGE TO MYSELF. I JUST GOT MY BIKE BACK 10-8-10 I KNEW AT THE TIME  OF THE ACCIDENT I HAD PLENTY OF DISTANCE. I ALWAYS SAID I JUST COULDN'T STOP. IT WAS SAID THAT I MUST HAVE BEEN FOLLOWING TO CLOSE. I REMEMBERED  THE FRONT BRAKE LOCKING UP AND PUSHING AS HARD AS I COULD ON THE REAR PEDAL. I KNEW FOR 3-5 SEC. I WAS GOING TO HIT THE TRUCKS BUMPER. 10-8-10 I PICKED THE BIKE UP AND ON THE WAY HOME I KNEW SOMETHING WAS WRONG WITH THE REAR BRAKES. LONG STORY SHORT ON MY WAY BACK TO THE DEALER I HAD TO STOP FAST  AND ONCE AGAIN COULDN'T STOP. I KNOW FOR A FACT MY ACCIDENT WAS DUE TO THE REAR BRAKE SYSTEM  NOT BEING BIG ENOUGH TO STOP THE TRIKE.  *TR",
        "vin": "1HD1MAM18AB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10342784,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HARLEY DAVIDSON TRI GLIDE ULTRA CLASSIC  THAT WHILE MY WIFE AND I WERE RIDING, THE LEFT SIDE SUDDENLY A HAD A TREMENDOUS DRAG I BELIEVED CAUSED BY THE REVERSE COMING ON WHILE GOING DOWN THE ROAD AT AROUND 55 MILES PER HOUR.  WE WERE THROWN INTO THE ON COMING TRAFFIC JUST MISSING A PICKUP AND WENT DOWN INTO THE DITCH JUST MISSING A LARGE CULVERT. MY WIFE WAS THROWN OFF AND RECEIVED MANY BROKEN BONES AND BRUISES.  SHE WILL BE IN THE HOSPITAL FOR 6 WEEKS AND THEN MANY MONTHS OF TERAPHY. I WAS ABLE TO STAY ON AND ONLY RECEIVED A LITTLE BACK PAIN. WE WERE BOTH VERY LUCKY NOT TO BE KILLED.  HARLEY HAS A BIG PROBLEM THAT NEED ATTENTION BEFORE SOMEONE IS KILLED. *TR",
        "vin": "1HD1MAM13AB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325600,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE HEAT COMING FROM THE EXHAUST BURNS LEG WHEN RIDING EVEN THOUGH I'M RIDING WITH  JEANS ON. *TR",
        "vin": "1HD1MAM14AB"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2010",
        "dateOfIncident": "03/18/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321280,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2009 HARLEY DAVIDSON CUSTOM CLASSIC TRIKE. THIS BIKE IS EQUIPPED WITH ELECTRONIC THROTTLE CONTROL (SO CALLED FLY BY WIRE) ON MARCH 18 WHILE RIDING IN MEDINA COUNTY IN OHIO AT 50 MPH THE ETC HAD SOME FORM OF FAILURE AND THE THROTTLE CUT THE RPM TO LESS THAN 1000 AND THE BIKE ABRUPTLY SLOWED TO A CRAWL. I WAS ABLE TO PULL OFF THE ROADWAY SHUT DOWN THE BIKE AND AFTER FIVE MINUTES RESTART AND THE THROTTLE WORKED AS DESIGNED. I ROAD THE BIKE TO CENTURY HARLEY DAVIDSON AND THEY ADVISED I HAD A CODE WHICH VERIFIED THE ETC HAD MALFUNCTIONED. THEY ADVISED THEY ARE NOT SURE WHAT IS WRONG BUT THEY REPORTED THIS IS AN ONGOING PROBLEM WITH THE H D ETC. I AM SCHEDULED TO HAVE THE SYSTEM CHECKED AND REPAIRED ON MARCH 29, 2010. I WAS ADVISED THE BIKE IS SAFE TO RIDE AS IS.  ON MARCH 21, THE EXACT SAME THING OCCURRED. MY CONCERN IS THAT IF I WERE RIDING ON THE INTERSTATE IN THE MIDDLE LANE, IN HEAVY TRAFFIC AND THIS HAPPENS I WOULD BE A SITTING DUCK AND COULD BE KILLED. I BELIEVE HARLEY DAVIDSON IS WELL AWARE OF THIS PROBLEM BUT IS DOING NOTHING TO GET THE WORD OUT AND TO FIX THE PROBLEM. *TR",
        "vin": "1HD1MAM149Y"
    }
]