[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154532,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY-DAVIDSON FLHP. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V076000 (SERVICE BRAKES, HYDRAULIC); HOWEVER, THE PARTS WERE NOT AVAILABLE. THE DEALER (REPUBLIC HARLEY-DAVIDSON, 12707 SOUTHWEST FWY, STAFFORD, TX 77477, 281-295-1000) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1HD1FC410AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891699,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE LEVER FROZEN IN PLACE RESULTING IN NO BRAKING ACTION FOR FRONT WHEEL.  WHILE BACKING VEHICLE (VEHICLE IN MOTION) OUT OF MY GARAGE DOWN DRIVEWAY INCLINE, COULD NOT STOP VEHICLE AND LOST CONTROL.  VEHICLE TIPPED OVER RESULTING IN MINOR DAMAGE.  LUCKILY NO INJURY TO ME EXCEPT FALLING TO GROUND. ..UPDATED 02/10/17 *BF  *TR",
        "vin": "1HD1FC412AB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/05/2012",
        "dateOfIncident": "08/03/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10473966,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BERKELEY POLICE DEPARTMENT PURCHASED SIX 2010 HARLEY DAVIDSON ROAD KINGS.  THREE OF THE SIX ROAD KINGS HAD THE CLUTCH CABLE BROKE WHILE BEING DRIVEN.  IN ONE INSTANCE, AN OFFICER WAS AT A RED SIGNAL LIGHT.  THE CLUTCH CABLE BROKE AND CAUSED HIM TO PROPEL FORWARD.  HIS RIGHT HAND WAS ON THE ACCELERATOR AND WHEN HE WAS PROPELLED FORWARD, HE ENGAGED THE ACCELERATOR.  THE MOTORCYCLE CHOKED OUT AND DIED.  LUCKILY NO ONE WAS IN FRONT OF HIM.  THE CLUTCH CABLE BROKE ON ANOTHER OFFICER AS HE WAS RIDING IT.  NO ONE WAS IN FRONT OF HIM AND HE WAS ABLE TO STOP.  ON 9/5/12, I WAS COMING TO A RED SIGNAL LIGHT.  MY CLUTCH CABLE BROKE AS I WAS COMING TO A STOP.  I HAD TO TURN AWAY FROM A VEHICLE IN FRONT OF ME.  LUCKILY, THE LEFT TURN POCKET WAS EMPTY AS THAT IS WHERE I TURNED.  I SLAMMED ON MY BRAKES AND TURNED THE ENGINE SWITCH TO OFF.  A FOURTH ROAD KING HAD POWER LOSS AND MAY BE CLUTCH RELATED.  OVERALL, 3 OF 6 ROAD KINGS HAD THE CLUTCH CABLE SNAP THAT CAUSED LOSS OF CONTROL.  I HAVE CONTACTED HARLEY DAVIDSON AND REPORTED THE PROBLEM, UNDER REFERENCE #[XXX].  THIS IS AN OFFICER SAFETY ISSUE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1HD1FHM18AB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "03/11/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331517,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY DAVIDSON ROAD GLIDE MOTORCYCLE (NA). THE CONTACT STATED THAT THE STEERING WAS DIFFICULT TO CONTROL AND WOULD INTERMITTENTLY PULL FROM SIDE TO SIDE WHEN ATTEMPTING A TURN. HE STATED THAT THE FRONT FORK HAD NOT BEEN MODIFIED AND WAS PREVENTING THE VEHICLE FROM STAYING IN A STRAIGHT LINE. THE DEALER TOOK THE VEHICLE FOR A TEST DRIVE BUT WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER ADVISED THEY COULD NOT ASSIST BECAUSE THERE WERE NO FAILURE FOUND WITHIN THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 10.",
        "vin": "1HD1MBM19AB"
    }
]