[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382745,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE BY WIRE CONNECTOR HOOKS IN BEHIND THE BREATHER. DUE TO THE HARD TURN OF THE CONNECTOR GOING INTO THE PLUG IT BENDS THE WIRES RESULTING IN THEM BREAKING OVER TIME. THIS CAUSES THE MOTORCYCLE TO LOSE THROTTLE AND GO INTO LIMP MODE CAUSING ME TO VERY CLOSELY COME TO GETTING RUN OVER ON THE HIGHWAY. IT HAPPENED MULTIPLE TIMES ON THE HIGHWAY, TURNING. AND ON CITY STREETS.",
        "vin": "1HD1KB411AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219330,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY-DAVIDSON STREET GLIDE (FLHX). THE CONTACT STATED THAT AFTER THE BRAKE FLUID WAS PURGED, THE BRAKE LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO BUMPUS HARLEY-DAVIDSON OF JACKSON (326 CARRIAGE HOUSE DRIVE, JACKSON, TN 38305, (731) 248-0091) WHERE IT WAS DETERMINED THAT THE BRAKE FLUID NEEDED TO BE CHANGED EVERY TWO YEARS. IF NOT, THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "1HD1KB419AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144015,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY- DAVIDSON FLHX. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE ABS SYSTEM FAILED WITHOUT WARNING. THE CONTACT STATED THAT THE REAR BRAKES FAILED TO OPERATE. THE CONTACT STATED THAT THE FRONT BRAKES WAS ENGAGED TO GET THE MOTORCYCLE TO COME TO A COMPLETE STOP. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR A DIAGNOSTIC TEST OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "1HD1KB416AB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122932,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY-DAVIDSON FLHX. THE CONTACT STATED THAT THE THROTTLE CONTROL ACTUATOR/INDUCTION MODULE FRACTURED INTERNALLY ON TWO OCCASIONS. THE CONTACT STATED THAT THE COMPONENT WAS NOT STRUCTURALLY SOUND. IN ADDITION, WHILE MAKING A LEFT TURN, THE PART FAILED AGAIN AND HAD TO BE REPLACED. AN UNKNOWN DEALER REPLACED THE PART TWICE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND SUGGESTED THAT THE DEALER REPLACE THE PART. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102156,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HARLEY DAVIDSON HAS ISSUED A RECALL FOR THE BRAKE FLUID ON SELECT TOURING MODELS OF WHICH I OWN.  UNFORTUNATELY THEIR INFERIOR BRAKE FLUIDE CAUSED MY FRONT BRAKES TO LOCK UP AND BECOME UNUSABLE, THE ABS HYDRAULIC CONTROL MODULE FAILED DUE TO THE BRAKE FLUID.  IN AN ATTEMPT TO REPAIR THE ISSUE, I ORDERED A NEW HYDRAULIC MODULE.  HARLEY DAVIDSON REFUSES TO SHIP THE PART WHICH HAS BASICALLY CAUSED MY BIKE TO BECOME A BIG BRICK IN MY GARAGE BECAUSE ITS UNRIDEABLE. I HAVE PAID FOR THE PART THAT WAS DESTROYED BY INFERIOR PARTS AND FLUIDS BUT AM UNABLE TO RECEIVE THE PURCHASED ITEMS.",
        "vin": "1HD1KB411AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11092791,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HARLEY DAVIDSON HAS DONE A VOLUNTEER RECALL ON THE ABS BRAKE SYSTEM ONLY OFFERING TO REPLACE BRAKE FLUID.  UNFORTUNATELY DUE TO TYPE OF BRAKE FLUID USED THE PROBLEM HAS CAUSED THE ABS HYDRAULIC CONTROL UNIT (HCU) TO FAIL AND LOCK UP RESULTING IN LOSS OF BRAKES FRONT OR BACK OR BOTH.  THIS RESULTS IN LOSS OF STOPPING ABILITY AND SAFE OPERATION.  HARLEY DAVIDSON NEEDS TO ADDRESS THE REAL SAFETY ISSUE THAT IS THE END RESULT OF USING POOR QUALITY BRAKE FLUID AND REPAIR REPLACE ABS HYDRAULIC CONTROL UNIT (HCU) WITH UPDATED COMPONENTS.  IN MY CASE I HAVE COMPLETE LOST THE USE OF MY FRONT BRAKES, THE BRAKE HANDLE IS IMPOSSIBLE TO SQUEEZE AND RESULTS IN SIGNIFICANTLY REDUCED STOPPING ABILITY.  MY BRAKE FLUID HAS BEEN REPLACED IN ACCORDANCE WITH THE MANUFACTURER BUT STILL HAS RESULTED IN A CATASTROPHIC FAILURE OF THE SYSTEM.  WHEN IT HAPPENED I WAS ON THE HIGHWAY AT HIGHWAY SPEEDS AND WAS ATTEMPTING TO SLOW DOWN FOR MY EXIT WHEN I REALIZED MY FRONT BRAKES WERE INOPERABLE.",
        "vin": "1HD1KB411AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011622,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS OUT RIDING STOPPED TO GET GAS TURNED THE BIKE OFF FILLED UP STARTED THE BIKE BACK UP WENT TO PULL OUT ONTO THE STREET AND HAD NO REAR BRAKES THE PEDAL WAS LOCKED IN THE UP POSITION AND HARD A ROCK I COULD NOT DEPRESS IT.I RODE BACK HOME WITH ONLY THE FRONT BRAKES WORKING I DID SOME RESEARCH AND FOUND THAT THIS IS A COMMON PROBLEM IN MY YEAR MAKE AND MODEL THAT THE ABS HYDRAULIC CONTROL UNIT GOES BAD AND EITHER THE FRONT, REAR OR BOTH BRAKES WILL NOT WORK. THANK GOD I WAS NOT THAT FAR FROM HOME AND DID NOT HAVE TO MAKE AND SUDDEN STOPS.I DID BUY THE BIKE USED FROM RAY PRICE HARLEY DAVIDSON 1 YEAR AGO.",
        "vin": "1HD1KB416AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002558,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY MOTORCYCLE AND WENT TO HIT THE FRONT BRAKE LEVER TO SLOW DOWN IN INTERSTATE TRAFFIC WHEN I COULD NOT PULL MY FRONT BRAKE LEVER. I HAD TO REMOVE MY FEET FROM THE HIGHWAY PEGS QUICKLY TO HIT THE BACK BRAKE PEDAL TO KEEP FROM HITTING THE CAR IN FRONT OF ME. MY OWNERS MANUAL STATES THAT IF ABS GOES OUT ON BIKE THAT THE BRAKES WILL CONTINUE TO WORK BUT WILL NOT BE ABS. MY FRONT BRAKE HAND LEVER WILL NOT PULL IN TO ENGAGE THE FRONT BRAKE AND I WAS TOLD BY THE DEALERSHIP THAT I NEEDED A NEW ABS/HCU MODULE. IF I UNDERSTAND THIS CORRECTLY THEN THIS PART IS PART OF THE ABS SYSTEM AND IT HAS FAILED AND NOW I DO NOT HAVE BRAKES ON THE FRONT OF MY MOTORCYCLE BECAUSE THE FAILURE OF THE PIECE OF EQUIPMENT MAKE MY BRAKE LEVER USELESS. I WAS TOLD BY ME DEALERSHIP THAT THIS IS A COMMON FAILURE FOR HD BIKES WITH ABS BRAKES BUT HARLEY WILL NOT RECALL THEM.",
        "vin": "1HD1KB411AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2016",
        "dateOfIncident": "11/04/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927111,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 HARLEY DAVIDSON STREET GLIDE LOST REAR BRAKES WITHOUT WARNING PEDAL BECAME HARD AS IF IT WAS STUCK LUCKILY I WAS TRAVELING AT A LOW SPEED. IT'S CURRENTLY AT A HARLEY DEALER AND THEY TELL ME IT'S THE ABS BRAKE MODULE AND IT NEEDS TO BE REPLACED. IF THAT ISN'T ENOUGH THEY TELL ME THE PART IS ON BACK ORDER WHICH TELLS ME THIS IS A COMMON ISSUE.",
        "vin": "1HD1KB435AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861455,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR BRAKE PEDAL HAS LOCKED IN POSITION MAKING THE REAR BRAKES INOPERABLE. THE ABS MODULE HAS FAILED WITHOUT WARNING. NO ABS TROUBLE INDICATION LIGHT.   IT IS MY UNDERSTANDING THIS IS FAIRLY COMMON ISSUE THAT CAN AFFECT BOTH THE FRONT AND REAR BRAKES.   THIS ABS SYSTEM IS DANGEROUS AS IS. THE SYSTEM SHOULD NEVER CAUSE A LOSS OF BRAKING. THE SYSTEM SHOULD REVERT TO NON ABS BRAKING WHEN A FAILURE HAPPENS.  WHEN MY REAR BRAKES FAILED , LUCKILY FOR ME , I WAS MOVING AT A SLOW SPEED ON A SIDE STREET AND WAS ABLE TO STOP WITH THE FRONT BRAKES ONLY.   THIS TYPE OF FAILURE COULD HAVE BEEN DEADLY AT HIGHWAY SPEEDS. I'M CERTAIN THERE HAVE BEEN CASUALTIES AS A RESULT OF THIS DEFECT.",
        "vin": "1HD1KB417AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836858,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HD FLHX WITH ABS BRAKES. UPON COMING TO AN INTERSECTION THE FRONT BRAKE COULD NOT BE PULLED. VERY DANGEROUS. HAD THE BIKE PICKED UP AND THE DEALER DID TESTS BUT COULD NOT REPLICATE THE PROBLEM. WEEKS LATER (02-17-2016) THE SAME THING OCCURRED. I MANAGED TO GET IT TO THE DEALER. THEY DIAGNOSED A FAULTY ABS HYDRAULIC MODULE. THIS IS A VERY DANGEROUS PROBLEM AND NEEDS TO BE MADE KNOWN TO HARTLEY RIDERS.",
        "vin": "1HD1KB413AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/16/2015",
        "dateOfIncident": "03/13/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694431,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO GET ON MY BIKE AND THE FRONT BRAKES COULD NOT BE PUSHED.  I DID SOME CHECKING AND FOUND THAT MY ABS UNIT WAS NOT LETTING ME APPLY THE FRONT BRAKES.  *TR",
        "vin": "1HD1KB414AB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660452,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY MOTORCYCLE I ATTEMPTED TO USE MY BRAKES. I WAS FRIGHTENED TO REALIZE I HAD ABSOLUTELY NO REAR BRAKES, THE BRAKE PEDAL WAS HARD AS A ROCK WITH NO ASSIST AT ALL.  I TOOK IT TO THE HARLEY DEALER AND WAS TOLD MY ABS MODULE WAS BAD.  WHAT MADE IT EVEN WORSE IS THAT I KNOW THE ABS SYSTEM IS SUPPOSED TO BE DESIGNED IN A WAY THAT DURING AN ABS FAILURE YOU ARE STILL LEFT WITH REGULAR NON ABS BRAKES.  HARLEY TOLD ME THAT THERE WAS NO RECALL OUT FOR THIS PART.  BUT DURING MY RESEARCH ON DIFFERENT HARLEY FORUMS MANY OTHER PEOPLE HAVE HAD THIS SAME PROBLEM AND WERE LEFT WITH NO BRAKES AT ALL.  HOW MANY FATAL ACCIDENTS HAVE BEEN CAUSED BY THIS THAT THE PERSON DIDN'T LIVE TO TELL THE STORY OF A ROCK HARD BRAKE PEDAL.  PLEASE USE THIS INFORMATION TO CONDUCT AN EXTENSIVE INVESTIGATION OF THE ABS MODULE THAT HALEY-DAVIDSON IS USING ON ESPECIALLY THE 2010 MODEL YEAR.  *TR",
        "vin": "1HD1KB411AB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654792,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECURRING PROBLEM WITH THE COMPENSATOR SPROCKET ON STARTERS IN THE BIG TWIN CLASS THAT HAS BEEN GOING ON FOR QUITE SOME TIME & HAS NOT BEEN ADDRESSED ADEQUATELY FROM HD.  THE STARTER DOES NOT ENGAGE FULLY FAIRLY OFTEN WHEN THE BIKE IS STARTED.  MY DEALER AS WELL AS OTHER DEALERS I HAVE SPOKEN TO ARE AWARE OF THIS, ALSO MANY RIDERS I HAVE SPOKEN WITH HAVE HAD THE SAME ISSUE. IS ANYTHING PENDING WHERE HD IS CONSIDERING A RECALL.  *TR",
        "vin": "1HD1KB413AB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "09/06/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631587,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING ON HIGHWAY, ENGINE WENT TO IDLE AND CHECK ENGINE LIGHT CAME ON.  HAD TO PULL OFF ON SHOULDER AND SHUT THE BIKE OFF.  AFTER RESTARTING, BIKE WOULD RUN FINE FOR APPROX. 20 MILES AND IT WOULD HAPPEN AGAIN.  HAPPENED FOUR TIMES ON 9/6/14.  AFTER DOING SOME RESEARCH, HARLEY DAVIDSON IS AWARE OF THE PROBLEM BUT WILL NOT FIX IT IF NOT UNDER WARRANTY.  IF THIS HAD HAPPENED WHILE PASSING, IN A CORNER OR IN A CENTER LANE ON A FREEWAY, THIS COULD HAVE RESULTED IN A CRASH.  *TR",
        "vin": "1HD1KB412AB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629975,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD GOING ABOUT 50 MPH AND MY THROTTLE SHUT OFF AND THE ENGINE WENT INTO \"LIMP MODE\" (SHUT OFF ONE CYLINDER). I HAD TO CROSS ONE LANE TO PULL OFF THE SIDE OF THE ROAD SO I COULD RESTART MY BIKE. LUCKILY THERE WASN'T HEAVY TRAFFIC OR IT COULD HAVE BEEN REALLY BAD. I SEE THAT THIS IS A TREND IN THESE BIKES AND HARLEY NEEDS TO DO SOMETHING.  *TR",
        "vin": "1HD1KB414AB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626557,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTORCYCLE GOES INTO LIMP HOME MODE AND THROWS SEVERAL CODES WHICH ARE ALL RELATED TO THE THROTTLE POSITION SENSOR.  THIS HAS HAPPENED TO ME SEVERAL TIMES AT VARIOUS SPEEDS, RPM'S, AND THROTTLE POSITIONS.  I SPOKE WITH MULTIPLE MECHANICS AND THEY ADVISED ME TO FIRST CLEAN THE CONNECTOR AT THE THROTTLE BODY. CLEANING THE CONNECTIONS WORKED AND I WAS ABLE TO CLEAR THE CODES. AFTER RIDING ABOUT 150 MILES THE SAME ISSUE HAPPENED AGAIN AND I ENDED UP STRANDED IN THE MIDDLE OF NO WHERE.  THIS TIME I COULD NOT GET THE CODES TO GO AWAY. TALKED TO MORE MECHANICS AND THEY ALL SAID THAT IT WAS MY THROTTLE POSITION SENSOR IN THE INDUCTION MODULE, SO I REPLACED THE INDUCTION MODULE AND IT FIXED THE ISSUE FOR ABOUT A WEEK AND ABOUT 800 MILES.  THEN ON MY WAY TO WORK ONE MORNING THE PROBLEM CAME UP AGAIN.  CALLED A FRIEND OF MINE THAT IS A HARLEY MECHANIC AND HE STATED THAT THIS IS A KNOWN PROBLEM AND THERE IS A BULLETIN OUT ABOUT THIS PARTICULAR PROBLEM.  APPARENTLY HARLEY USES CONNECTORS AT THE ECM AND THROTTLE BODY THAT ARE COMPLETE JUNK AND AFTER BEING EXPOSED TO HEAT AND VIBRATION THEY FAIL AND HAVE TO BE REPLACED.  HARLEY NEEDS TO RECALL THESE PARTS AND FIX THE PROBLEM FOR FREE.  HARLEY OWNERS SPEND A LOT OF MONEY ON THESE BIKES AND IT IS FRUSTRATING WHEN WE FIND OUT THAT HARLEY IS USING PARTS THAT ARE COMPLETE JUNK TO ASSEMBLE THESE VERY EXPENSIVE BIKES.  I AM ABOUT 1 ISSUE AWAY FROM BECOMING A VICTORY OR INDIAN OWNER!  *TR",
        "vin": "1HD1KB435AB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606438,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LOST ALL POWER.  HAD TO CYCLE THE IGNITION 3 TIMES TO RESET.  DIAGNOSIS WAS A BAD THROTTLE BODY MODULE.  DEALER SAID IT IS A KNOWN ISSUE AND IS HAPPENING FASTER THAN THEY CAN GET THE PARTS IN TO FIX.  BIKE CURRENTLY HAS BEEN AT DEALER FOR 3 WEEKS AND PARTS ARE STILL ON BACK ORDER.  HARLEY DAVIDSON HAS NOT LISTED IT AS A RECALL.  *TR",
        "vin": "1HD1KB41XAB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2012",
        "dateOfIncident": "04/13/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456421,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY DAVIDSON FLHX. THE CONTACT STATED THAT THE MOTORCYCLE STALLED WHILE DRIVING 55 MPH. THE CONTACT WAS ABLE TO RESTART THE VEHICLE SEVERAL TIMES, BUT THE FAILURE CONTINUED. THE DEALER LOCATED THE FAILURE AT THE THROTTLE WIRE SENSOR, WHICH RESULTED IN A LOSS OF FUEL CIRCULATION. THE VEHICLE WAS REPAIRED. THE THROTTLE BODY ASSEMBLY WAS REPLACED. THE MANUFACTURER TOOK A COMPLAINT. THE FAILURE AND CURRENT MILEAGES WERE 4,300   UPDATED 06/05/12 *BF",
        "vin": "1HD1KB415AB"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/24/2012",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445024,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT THE DEALERSHIP, AFTER BEING ASSURED THE BIKE WAS SAFE TO RIDE.  I WAS COMPLAINING ABOUT A CRUNCHING NOISE AND VIBRATION WITH SLOW SPEED BRAKING.  THEY SAID EVERYTHING WAS FINE.  I GOT 10 MILES DOWN THE ROAD.  MY FRONT END STARTED TO SHAKE VIOLENTLY.  I PULLED OVER TO DISCOVER I HAD AN AXEL WITH NO BEARINGS ON   THE LEFT SIDE.  MY ENTIRE WHEEL AND BEARINGS HAD TO REPLACED. THE WHEEL HAD 3 TO 4 INCHES OF PLAY.  I WAS RIDDING ON MY WHEEL HUB NO BEARING.  UPON CHECKING THE FORUMS, I FOUND THIS WAS NOT A ISOLATED EVENT.  SOME ONE IS GOING TO DIE FROM THESE FAILURES.  I THINK A RECALL SHOULD BE ISSUED.  *TR",
        "vin": "1HD1KB41XAB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442156,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HARLEY DAVIDSON FLHX MOTORCYCLE. THE CONTACT RECEIVED NOTIFICATION OF A MANUFACTURER'S RECALL. THE DEALER WAS CONTACTED AND ADVISED THAT THE PARTS NEEDED FOR RECALL REPAIRS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE RECALL REPAIR HAD EXCEEDED A REASONABLE AMOUNT OF TIME. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 3,000.  UPDATED 02/15/12*LJ  THE CONSUMER STATED THE MOTORCYCLE WAS REPAIRED TWO DAYS LATER AFTER FILING THIS COMPLAINT. UPDATED 02/17/12",
        "vin": "1HD1KB41XAB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2011",
        "dateOfIncident": "01/16/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378219,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING, WHEN MY MOTORCYCLE STARTED MAKING A LOUD NOISE.  I TURNED OFF THE ENGINE AND HAD TO TOW IT HOME, WHERE I DISCOVERED THE COMPENSATOR SPROCKET HAD COME LOOSE.  LUCKILY, I WAS RIDING SLOWLY WHEN IT HAPPENED.  HAD I BEEN RIDING AT SPEED AND/OR ON A HIGHWAY, IT COULD HAVE BEEN CATASTROPHIC.  I HAD TO UPGRADE TO A SCREAMING EAGLE COMPENSATOR KIT, AT MY COST, TO CORRECT THE POOR ENGINEERING OF THE ORIGINAL COMPENSATOR SPROCKET, WHICH WAS THE CAUSE OF THE FAILURE.  THE OLD PART IS AVAILABLE IF NEEDED.  *TR",
        "vin": "1HD1KB41XAB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2010",
        "dateOfIncident": "09/23/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361329,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2010 HARLEY DAVIDSON ROAD GLIDE MOTORCYCLE.  THE BIKE HAS APPROXIMATELY 13000 MILES ON IT.  THE PROBLEM IS THAT THE THROTTLE QUITS WORKING AND HAS NO RESPONSE WITH NO WARNING OR SYMPTOMS.  THE FIRST OCCASION WAS WHEN I WAS PASSING A CAR AND THE ENGINE RPM'S WENT FROM 4000 TO IDLE AND THERE WAS NO THROTTLE RESPONSE.  I TOOK THE BIKE TO THE DEALERSHIP FOR REPAIR.  THEY REPLACED A SENSOR IN THE THROTTLE AND A CONNECTOR SOMEWHERE.  I PICKED THE BIKE UP AND THE NEXT DAY AND RODE ABOUT 200 MILES AND THE PROBLEM RECURRED.  THERE SEEMS TO BE AN ELECTRONIC PROBLEM.  AS I SEARCH FORUMS ON THE WEB AND TALK TO OTHER RIDERS, THIS APPEARS TO NOT BE AN ISOLATED INCIDENT.  THIS IS A LIFE THREATENING DEFECT. *TR",
        "vin": "1HD1KB410AB"
    }
]