[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002609,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOWMAX TIRES BLOW OUT. ALL TIRES WHERE UP TO THE CORRECT PRESURE.",
        "vin": "5SFB63622AE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598433,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "CO-OP",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 HEARTLAND BIGHORN TRAILER EQUIPPED WITH (NA) COMMODORE TIRES SIZE 235-80R 16, DOT NUMBER RYB5OMAC, SERIAL NUMBER 3211. THE CONTACT STATED WHILE DRIVING 60 MPH THE TIRE BLEW OUT DUE TO TREAD SEPARATION AND CAUSED DAMAGED TO  THE TRAILER SKIRT, METAL PANEL AND VALVE DAMAGE.  THE TIRE MILEAGE WAS 2,000.   UPDATED 9/18/14*CN   UPDATED 02/05/2015 *JS",
        "vin": "5SFBG3029AE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "06/24/2010",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350199,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "LT235/80R16 E",
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY THE TRAILER STARTED TO VIBRATE. I PULLED OVER IMMEDIATELY AND DISCOVERED THE TIRE TREAD HAD SEPARATED FROM THE MIDDLE OF THE TIRE CAUSING DAMAGE TO THE TRAILER. THE TIRE DID NOT HAVE A BLOW OUT..IT DID NOT LOSE ITS AIR UNTIL IT WAS SITTING ON THE SIDE OF THE ROAD. THE TIRE HAD ONLY ABOUT 4000 MILES ON IT. IT WAS INFLATED ACCORDING TO GUIDELINES AND CHECKED EVERYTIME WE STARTED OUT DRIVING. IT WAS JUST CHECKED 154 MILES PRIOR TO THE TREAD COMING OFF.  THE TRAVEL TRAILER WAS NOT OVERLOADED.  HAVE HAD CONTACT WITH THE TIRE MAKER AND THEY PICKED UP THE TIRE TO RUN TESTS. THEIR FINDINGS OF COURSE WERE THEY WERE NOT AT FAULT BUT WOULD RECOMMEND WE CHANGE ALL TIRES. ( WHICH WE DID BEFORE THEY SUGGESTED IT BECAUSE WE DID NOT TRUST THE REST OF THE TIRES ON THE TRAILER.) THEY DID OFFER AS A GOOD WILL SIGN TO BUY US ONE NEW TIRE IF WE SIGN A RELEASE OF LIABILITY.  THAT DOESN'T PAY FOR THE DAMAGES OR THE 4 NEW TIRES WE PUT ON THE TRAILER. EVERYONE WHO LOOKED AT THE TIRE EVEN THE GUY WHO REPLACED THE TIRE SAID THAT THE TIRE SHOULD NOT HAVE SEPARATED LIKE THAT.  I THINK THE TIRE NEEDS TO BE LOOKED AT BY SOMEONE ELSE. THAT COULD HAVE BEEN A LOT WORSE IF I DID NOT KNOW THE FEEL OF MY TRUCK AND TRAILER AND KNEW SOMETHING WAS WRONG RIGHT A WAY. THE TIRE WAS ON THE DRIVERS SIDE IN THE REAR OF A TWO AXLE TRAILER SO I DID NOT RUN OVER SOMETHING BECAUSE THE FRONT TIRE WOULD HAVE HIT IT FIRST AND I KNOW THERE WAS NOTHING IN THE ROAD. ALTHOUGH THE INSURANCE HAS PICKED UP THE BILL FOR THE REPAIRS I DON'T THINK ITS RIGHT AND THERE IS SOMETHING WRONG WITH THE TIRE. *TR",
        "vin": "5SFBG3028AE"
    }
]