[
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2019",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282746,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 HONDA ACCORD CROSSTOUR WAS LOW IN OIL BUT THE ENGINE OIL LIGHT NEVER CAME ON TO WARN ME. HOWEVER THE ENGINE LIGHT DID COME ON. I HAD OIL AND TOOK IT TO DEALER FOR AN OIL CHANGE WHICH WAS NOT DUE. THE DEALER DID NOT WANT TO RESET THE ENGINE LIGHT. THE ENGINE LIGHT ERROR CODE P3497. SEVERAL HONDA CAR OWNERS HAVE COMPLAINED ABOUT THE P3497 ERROR CODE STAYING ON. THIS IS COSTING CONSUMERS A LOT OF MONEY TO HAVE A DIAGNOSTIC ON THE ERROR CODE AND REPAIRS. THIS SHOULD BE A RECALL.    FRUSTRATED HONDA OWNER.",
        "vin": "5J6TF2H56AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278432,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS EXPERIENCING  EXCESSIVE OIL CONSUMPTION AND REPLACED THE SPARK PLUGS FOR THE SECOND TIME A YEAR",
        "vin": "5J6TF2H50AL"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269356,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2010 ACCORD CROSSTOUR FROM HANOVER HONDA IN PA, IN NOVEMBER, 2018.HAVEN'T HAD IT QUITE A YEAR, IN MARCH OF 2019, THE ENGINE LIGHT CAME ON, AND THE CAR STARTED TO MISFIRE INTENSELY.CODE P0301 CAME UP.I TOOK IT TO MARTIN HONDA IN DE AND THEY TOLD ME THAT THE COMPUTER SOFTWARE HAD TO BE UPDATED AND A FEW OF THE SPARK PLUGS HAD TO BE CHANGED. $345.00 LATER, THEY SAID THAT THIS WAS A \"TWO-PART\" REPAIR AND WHEN IT HAPPENS AGAIN, THEY WOULD DO THE 2ND PART WHICH HAD TO DO WITH THE PISTONS & SOLENOIDS.IT HAPPENED AGAIN.OCTOBER, 2019, THE ENGINE LIGHT CAME ON AND MY HUSBAND FOUND THE CAR TO BE MORE THAT 2 QUARTS LOW ON OIL.THE CODE NOW IS P3497.TOOK IT BACK TO MARTIN HONDA, AND THEY TOLD ME EXACTLY WHAT ALL OF THE OTHER COMPLAINTS SAY. ROCKER ARM SWITCHES NEED REPLACED.THEY SAID \"LET'S TRY AN OIL CHANGE AND RE-CHECK IT IN ABOUT 1000 MILES\". THIS LEADS ME TO BELIEVE THAT ALL HONDA SERVICE CENTERS KNOW ABOUT THESE COMPLAINTS.THE DEALERSHIP WHERE I PURCHASED THE CAR, WOULDN'T HELP ME AT ALL. RICHARD AT HONDA HEADQUARTERS AGREED WITH THE SERVICE DEPARTMENT AT MARTIN HONDA IN DE, AND DENIED MY CLAIM.ALL I WANT IS FOR HONDA TO TAKE RESPONSIBILITY FOR THEIR ENGINE DEFECT, AND MAKE IT RIGHT.I PAY TOO MUCH FOR THIS VEHICLE, JUST TO HAVE TO PAY FOR SOMETHING THAT IS A KNOWN DEFECT.I HAVE ESCALATED MY CONCERNS WITH HONDA.THEY ARE GOING TO HAVE A HUGE LAWSUIT, IF SOMEONE DIES BECAUSE OF A DEFECTIVE ENGINE THAT BLOWS UP.IT WOULD BE EASIER AND CHEAPER FOR THEM TO RECALL THESE MODELS. IN THE PAST, THEY HAVE HAD MANY COMPLAINTS AND CLASS ACTION LAWSUITS SETTLED FOR THESE EXACT ISSUES WITH THE V6 ENGINES.THIS IS ALL GREED. IT DOESN'T MATTER WHAT TYPE OF STREET, OR WHERE THIS ISSUE HAPPENS.THE OIL CONSUMPTION TEST IS JUST COVER UP AND A WAY FOR HONDA TO SAY \"YOU'RE PAST THE WARRANTY\". THAT SHOULDN'T MATTER EITHER. I THOUGHT HONDA WAS BETTER THAN THIS.",
        "vin": "5J6TF2H55AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/06/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267372,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR. THE CONTACT STATED THAT THE OIL INDICATOR DISPLAYED THAT THE OIL LEVEL WAS AT 15%. THE FOLLOWING DAY, AFTER EXITING THE DRIVEWAY AND STOPPING AT A STOP SIGN, THE CONTACT NOTICED SMOKE UNDER THE HOOD OF THE VEHICLE. THE SMOKE WAS LIGHT IN COLOR AND THEN TURNED DARK BLACK. THE CONTACT PULLED THE VEHICLE OVER AND REMOVED HERSELF AND HER GRANDCHILD FROM THE VEHICLE. THE CONTACT NOTICED A LEAK UNDER THE FRONT END OF THE VEHICLE. SHORTLY AFTER, FLAMES APPEARED UNDER THE HOOD. THE FIRE DEPARTMENT ARRIVED AND EXTINGUISHED THE FIRE. A FIRE REPORT WAS FILED. THERE WERE NO INJURIES. SOUTHERN MOTOR HONDA (10300 ABERCORN ST, SAVANNAH, GA 31406, SAVANNAH GA) WAS CONTACTED AND STATED THAT DUE TO THE DAMAGE, THE VEHICLE HAD TO BE INSPECTED BY THE INSURANCE COMPANY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "5J6TF1H59AL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266648,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VCA LIGHT IS ON AT ALL TIMES, THIS ISSUE STARTED ALL THE SADDEN.",
        "vin": "5J6TF1H57AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IS CONSUMING EXCESS OIL,AND CODE P3497 SHOWS UP.LOW OIL LIGHT DOESN'T COME ON,ALTHOUGH THERE IS NO OIL ON DIPSTICK.SERVICE BULLETIN SAYS SOFTWARE UPDATE NEEDED,BUT MY DEALER CLAIMS MY ENGINE NOT ON THERE.LEFT BANK STUCK IS SECOND INDICATOR OF FAILURE IN VARIABLE TIMIMING",
        "vin": "5J6TF1H3XAL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244702,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE SHAKING/VIBRATION AT 40 MPH AND AROUND 70 MPH DUE TO WARPED AXELS.  THIS STARTED AT ABOUT 100K MILES",
        "vin": "5J6TF2H57AL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023108,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 HONDA CROSSTOUR. CONSUMER WRITES IN REGARDS TO LEAK FROM REAR DIFFERENTIAL RIGHT OIL SEAL AREA. *LD    THE CONSUMER REQUESTED TO BE REIMBURSED FOR REPAIR COSTS. *JS",
        "vin": "5J6TF2H57AL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032041,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR.THE CONTACT STATED THAT THE WINDSHIELD BEGAN TO DELAMINATE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE WINDSHIELD PROTECTING FILM WAS BUBBLING AND THE ENTIRE WINDSHIELD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 52,000.",
        "vin": "5J6TF1H5XAL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984151,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED EXPERIENCING A VIBRATION A WEEK AGO 05/02/2017 WHEN INITIALLY PULLING OFF FROM A STOPPED POSITION.  THE VIBRATION LASTS FROM 20 TO 50 MPG AND CAN BE VIOLENT IF ACCELERATING WHILE TRYING TO GET STARTED WITH THE REGULAR FLOW OF TRAFFIC IN A METROPOLITAN CITY. I HAVE READ OTHER REPORTS AS WELL ON OTHER SITES SUCH AS:  HTTP://WWW.CARCOMPLAINTS.COMHTTP://WWW.CARCOMPLAINTS.COM/HONDA/ACCORD_CROSSTOUR/20I0/DRIVETRAIN/.  THE PROBLEM IS GOING TO GET WORSE IF NOT TO A POINT OF BEING UNSAFE.  HONDA NEEDS TO ISSUE A RECALL ON THE PROBLEM AND HAVE THE CUSTOMER TAKE THEIR VEHICLE TO THE NEAREST DEALERSHIP FOR AN AXLE OR WHATEVER PART IS NEEDED UNDER A RECALL REPLACEMENT TO CORRECT THE PROBLEM. HONDA IS A GOOD PRODUCT AND THIS IS MY THIRD VEHICLE WITH THEM.  HOPEFULLY THE WILL STAND BEHIND THEIR PRODUCT AS THEY ALWAYS DO.",
        "vin": "5J6TF1H56AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891687,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V346000 (AIR BAGS) WAS RECEIVED IN MAY OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J6TF1H56AL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "01/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863418,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR. WHILE ATTEMPTING TO ACCELERATE, THE VEHICLE SHOOK VIOLENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SIDE AXLE WAS FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "5J6TF1H59AL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702133,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 HONDA CROSSTOUR. THE CONTACT STATED THAT WHILE REVERSING, THERE WAS A LOUD NOISE. THE FRONT PASSENGER SIDE BALL JOINT FRACTURED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 116,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2012",
        "dateOfIncident": "10/30/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR USED WITH APPROXIMATELY 23000 MILES; IT IS STILL UNDER THE FACTORY WARRANTY.  I HAD READ ABOUT OTHER OWNERS' DESCRIPTIONS OF \"SHUTTER\" FROM THE DRIVE TRAIN BETWEEN 20-27 MPH UNDER MODERATE ACCELERATION, A SLIGHT SHAKING FELT THROUGH THE CAR BODY, AND NOTICED MINE DISPLAYED THIS SAME CONDITION.   I TOOK THE CAR TO A LOCAL DEALER ON OCT 30, 2012, EXPLAINED THE PROBLEM I WAS EXPERIENCING, AND MENTIONED THAT ACURA HAD ISSUED A TSB CONCERNING A SIMILAR SITUATION.  THE MECHANIC STATED THIS TSB DID NOT APPLY TO HONDA CARS.  NONETHELESS, WHEN THE DEALER RETURNED THE CAR, THEY HAD APPLIED A TRANSMISSION CONTROLLER SOFTWARE UPDATE; I DO NOT KNOW IF THIS IS THE SAME UPDATE ISSUED BY ACURA.  THEY ALSO TURNED THE FRONT ROTORS AND RECOMMENDED TIRE BALANCING.  I HAD THEM BALANCED IMMEDIATELY.    MY FAMILY AND I TOOK A 4 HOUR ROAD TRIP OVER THE THANKSGIVING HOLIDAY, CONSISTING OF MOSTLY INTERSTATE TRAVEL. I NOTICED THE \"SHUTTER\" GETTING WORSE, ESPECIALLY ONCE THE CAR WAS WARM, STILL BETWEEN 20-27 MPH.  I ALSO NOTICED A SLIGHT VIBRATION ABOVE 70 MPH.  I DISMISSED THIS HIGH SPEED VIBRATION AS A TIRE BALANCE ISSUE, BUT I SEE OTHER OWNERS' COMPLAIN ABOUT THIS CONDITION, AS WELL.  THE SHUTTER CONTINUED, AND ON DEC 8, I NOTICED THAT ONCE IT WAS WARM, THE CAR HAD STARTED TO VIBRATE THROUGHOUT, AT ANY SPEED.  THE TRANSITION TO THIS CONDITION IS MOST NOTICEABLE WHILE DRIVING THE CAR WHILE COLD, ALLOWING IT TO WARM UP, AND FEELING THE CHANGE IN OVERALL RIDE FEEL FROM COLD TO WARM, NOT FELT THROUGH THE WHEEL, THROTTLE PEDAL, OR SHIFTER, BUT THROUGHOUT THE CHASSIS AND BODY.   ON DEC 10, I TOOK THE CAR TO ANOTHER DEALER, CLOSER TO MY WORKPLACE, CONCERNED THAT SOMETHING WAS BROKEN. THE DEALER REPRESENTATIVE STATED THEY COULD NOT DUPLICATE THE PROBLEM. I FELT IT WHILE SHE DROVE IT, BUT SHE STATED SHE DID NOT.  SHE SAID THE LOCAL HONDA REPRESENTATIVE SAID NO TSBS OR RECALLS APPLIED. *TR",
        "vin": "5J6TF1H3XAL"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/08/2012",
        "dateOfIncident": "04/26/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487760,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE, PLEASE BACK OFF ON YOUR HEAD REST REQUIREMENTS FOR SAFETY.  PLEASE ALLOW THE CONSUMER TO CHOOSE THE POSITION OF THE HEAD REST.  NOT ONLY HONDA, BUT FORD, GM, CHRYSLER, ALL MANUFACTURERS ARE CREATING VERY PAINFUL CAR SEATS SINCE 2009 DUE TO THIS AWFUL HEADREST REQUIREMENT.  SEATBELTS ARE A LAW, BUT I CHOOSE TO WEAR THEM.  MOTORCYCLE HELMETS ARE NO LONGER A LAW, BUT I CHOOSE TO WEAR THEM.  NOW LET ME CHOOSE MY HEADREST POSITION.    I THINK THESE NEW DESIGNS ARE GOING TO CAUSE FAR MORE INJURIES AND INSURANCE CLAIMS FROM PEOPLE HAVING THEIR HEADS COCKED FORWARD, IN A FORCED IMPROPER POSTURE.  I HAD MIGRAINES DUE TO MY HEADREST BEFORE I RESOLVED THIS ISSUE IN MY CAR BY MAKING MODIFICATIONS.  I SIT WITH PROPER POSTURE AND MY HEAD IS FORCED FORWARD.  THE ONLY CHOICE I HAD WAS TO SIT IMPROPERLY IN ORDER TO TRY TO AVOID THE TERRIBLE DISCOMFORT THIS NEW LAW FORCES ON ME.      PLEASE CHANGE THIS LAW.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/03/2011",
        "dateOfIncident": "07/17/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416921,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR. THE CONTACT STATED WHILE DRIVING 30 MPH THE PASSENGERS RIGHT OF THE VEHICLE COLLAPSED. THE BALL JOINTS SNAPPED AND CAUSED DAMAGE TO THE WHEELS AND TIRES. THE VEHICLE WAS TOWED TO THE DEALER AND AFTER INSPECTING IT THEY HAD TO REPLACE THE TIE ROD, BALL JOINTS, OIL FILTER, TIRE AND WHEELS. THE INSURANCE COMPANY WILL PAY FOR THE REPAIRS. THE MANUFACTURER WAS CONTACTED AND STATED THERE WAS NO FAILURE AND OFFERED NO ASSISTANCE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 6,100.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415610,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HONDA CROSSTOUR. THE CONTACT STATED THE HATCH BACK GLASS WAS VERY SMALL WHICH MADE IT DIFFICULT TO SEE OBJECTS IN THE REAR AND ON THE SIDE OF THE VEHICLE. THE CONTACT WAS AFRAID THE FAILURE COULD POTENTIALLY CAUSE A CRASH. THE DEALER WAS CONTACTED AND STATED THEY WERE AWARE OF THE DEFECT BUT THERE WAS NOTHING THEY COULD DO.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 100 AND THE CURRENT MILEAGE WAS 10,000.   UPDATED 8/29/11 *CN   UPDATED 09/26/11",
        "vin": "5J6TF1H53AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372606,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2010 HONDA CROSSTOUR SUDDENLY WENT FROM 60 TO 15 MPH DRIVING ON A BUSY HIGHWAY. THE ENGINE LIGHT AND VSC LIGHT CAME ON, AND IT JUST LOST POWER. I NARROWLY ESCAPED A SERIOUS ACCIDENT WITH SEVERAL CARS. THE OTHER DRIVERS HAD  TO AVOID HITTING ME AS I SLOWED DOWN QUICKLY WITHOUT WARNING. THE DEALERSHIP SAYS THE COMPUTER SHOWS A MALFUNCTION, BUT NOW IT IS FINE. THEY CAN FIND NOTHING WRONG WITH THE CAR THAT WOULD CAUSE THIS TO HAPPEN.  *TR",
        "vin": "5J6TF2H51AL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/28/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10368291,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, NOVEMBER 28, 2010, UPON OPENING THE TRUNK, THE REAR CARGO AREA COVER DROPPED DOWN AND HIT MY FOREHEAD LEAVING A LARGE BRUISED LUMP.  IT WAS COMPLETELY UNHOOKED WITH NOTHING HOLDING IT IN PLACE.   TODAY, IS NOVEMBER 30, 2010 AND I STILL HAVE PAIN AND HEADACHES.  THERE IS NO LOCKING MECHANISM FOR THE REAR CARGO AREA COVER.  IT APPEARS THAT THE SIDE HOOKS BECAME UNHOOKED (PRESSURE FIT ONLY) AND THE \"MOUNTING PINS\" ARE AS THE HONDA FLETCHER SERVICE MANAGER SAID, ONLY FOR GUIDANCE AND ALIGNMENT.  NOT TO PROVIDE SUPPORT.  THERE IS NOTHING TO PREVENT THE REAR AREA CARGO COVER TO NOT FALL OUT AND DOWN.  AND WHEN SHOWING FLETCHER HONDA'S SERVICE MANAGER ON MONDAY, NOVEMBER 29, 2010, THE PROBLEM AND UNHOOKING ONLY ONE SIDE HOOK, THE COVER FELL DOWN ON THAT SIDE FIRST, THEN THE OTHER SIDE HOOK FAILED TO HOLD THE COVER IN PLACE AND THE ENTIRE COVER FELL DOWN.    THE SERVICE MANAGER SAYS HE HAS NO ABILITY TO CHANGE DESIGNS, HOWEVER, WILL PASS THIS INFORMATION ONTO HIS HONDA REP.  I WAS GIVEN A 1-800 TO CALL AND WILL CALL HONDA UPON COMPLETION OF FILING THIS COMPLAINT. *TR",
        "vin": "5GAER23708J"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "08/11/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10348815,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACCELERATION FROM A TRAFFIC STOP, THE SUNROOF SHATTERED CAUSING SHARDS OF GLASS TO FALL INTO THE VEHICLE.  THE SUNROOF WAS COMPLETELY CLOSED AT THE TIME. THIS WAS NOT A GENTLE \"BREAK AND CRACK\", BUT A VIOLENT SHATTER OF GLASS. ONE 8 YEAR OLD PASSENGER SEATED IN THE REAR MIDDLE SEAT SUSTAINED A CUT REMOVING GLASS FROM HIS SEAT. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/25/2010",
        "dateOfIncident": "06/21/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339948,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2010 HONDA CROSSTOUR HAS A LIMITED VIEW OUT THE REAR WINDOW WHICH MAKES BACKING UP DANGEROUS. *TR",
        "vin": "5J6TF2H58AL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/24/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332020,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CROSSTOUR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SEVERE AXLE WHINE AT 50-55 MPH.  MAY CAUSE OVERHEATING AND SIEZURE OF GEAR TRAIN. *TR",
        "vin": "5J6TF2H58AL"
    }
]