[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429364,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "No acceleration suddenly,  tried park but the gear wasn't moved D to P.",
        "vin": "KMHFC4DF2AA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383962,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RETURNING FROM TOWN AND DRIVING IN MY DRIVEWAY, HERD STRANGE NOISE FROM UNDER THE HOOD AND THE ABS WARNING LIGHT CAME ON. AFTER PARKING IN GARAGE NOTICED THAT A BRAKE FLUID TRAIL WAS LEFT BEHIND IN THE DRIVEWAY. CHECKED THE BRAKE FLUID RESERVOIR AND IT WAS ALMOST EMPTY, SO ADDED NEW BRAKE FLUID TO THE PROPER LEVEL AND REMOVED THE FUSE FOR THE THE THE ABS UNIT SO IT COULD NOT SHORT OUT AGAIN  AND LOSE BREAK FLUID WHILE DRIVING. IF IT HAD HAPPEN ON THE HIGHWAY COULD BE DEAD  I KNOW THE CAR HAD A RECALL FOR ABS UNIT SHORTING OUT AND FIRES WHILE PARKED, AND A RELAY KIT WAS ADDED TO KILL POWER TO THE ABS WHILE PARKED BUT WHAT ABOUT A SHORT IN THE ABS UNIT WHILE DRIVING, SEAMS MUCH MORE DANGEROUS. DEALER SAYS NOT COVERED BY RECALL, HOW CAN THIS BE? PLEASE HELP.",
        "vin": "KMHFC4DF6AA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240632,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HYUNDAI AZERA. WHILE DRIVING 45 MPH, THE VEHICLE STALLED AND ALL THE INSTRUMENTAL PANEL INDICATORS ILLUMINATED. THE CONTACT WAS ABLE TO COAST THE VEHICLE ONTO THE ROAD SHOULDER. THE VEHICLE WAS TOWED TO THOMPSON HYUNDAI (1000 MERRITT BOULEVARD, DUNDALK, MD 21222, (410)-288-5700) WHERE IT WAS DIAGNOSED THAT THE VEHICLE STALLED BECAUSE THE VALVE COVER GASKET LEAKED OIL ONTO THE ALTERNATOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 69,500. *TT  THE ISSUE IS A KNOWN PROBLEM. THESE LAMBDA V6 3.3 LITER AND 3.8 LITER ENGINES ALL HAVE THESE SAME ISSUES, REGARDLESS OF WHAT VEHICLE THEY ARE IN. VERACRUZ, AZERA, SONATA, SEDONA, ENTOURAGE, AND SO ON. THE VALVE COVER'S LEAK OIL ONTO THE ALTERNATOR AND CAUSE THEM TO FAIL, CAUSING THE ENTIRE VEHICLE TO LOSE POWER AND CONTROL WHILE DRIVING. SUPER UNSAFE. THIS IS EXACTLY WHAT HAPPENED TO ME. FORTUNATELY I WAS ONLY BY ROUTE 1 HERE IN MARYLAND AND NOT ON 95, 495 OR SOMEWHERE LIKE THE BAY BRIDGE. I HAVE PICS TAKEN THAT AFTERNOON AT THE GAS STATION I SWUNG INTO IN JESSUP TO SHOW YOU WHAT HAPPENED. THESE ARE CONSISTENT WITH THIS ISSUE ACROSS THIS TYPE OF ENGINE.*JB  *BF   CONSUMER REPLACED THE BATTERY AND ALTERNATOR. *JB",
        "vin": "KMHFC4DFXAA"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2016",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823232,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHIFTED ERRATICALLY AND SHUT DOWN MULTIPLE TIMES WHILE AT SPEEDS UP TO 45 MPH WITH LOSS OF POWER ASSIST FOR BRAKES AND STEERING, THE LAST TIME WHILE ROUNDING A CURVE AND BRAKING FOR A STOP SIGN.  WHEN RESTARTED, THE INDICATOR FOR THE SHIFT POSITION WAS COMPLETELY BLANK (REAPPEARED ON A SECOND SHUTDOWN/RESTART.  DEALER FINALLY LOCATED A TROUBLE CODE (NO CHECK ENGINE LIGHT) WHICH INDICATED A FAILING TRANSMISSION OIL TEMPERATURE/SHIFT POSITION SENSOR LOCATED ON THE AUTOMATIC TRANSMISSION.  DEALER REFUSED TO SUBMIT TO HYUNDAI IN SPITE OF THE FACT CAR WAS STILL UNDER DRIVE TRAIN WARRANTY AND SAFETY CONSIDERATIONS OF SUCH A FAILURE.  THIS OBVIOUSLY COVERS UP SUCH FAILURES FROM NHTSA OVERSIGHT.  PROBLEM HAS NOT REOCCURRED SINCE SENSOR WAS REPLACED.  REPAIR INVOICE FROM THE DEALER IS AVAILABLE UPON REQUEST.",
        "vin": "KMHFC4DF3BA"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "03/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700648,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WALKING PAST OUR VEHICLE I NOTICED THAT MY LEFT FRONT TIRE HAD A SEPARATION BETWEEN THE SIDE WALL AND THREAD I THOUGHT IT WAS JUST ROAD DAMAGE,BUT UPON FURTHER INVESTIGATION I SEE THE SAME PROBLEM ON TWO OTHER TIRES(MICHELIN ENERGY MVX4+ P235/55 R17). ON VARIOUS WEB SITES I SEE THIS IS A COMMON PROBLEM WITH THESE TIRES BUT THERE IS NO PRODUCT RECALL AT THIS TIME. THIS IS A VERY DANGEROUS PROBLEM THAT SHOULD BE ADDRESSED. I WOULD ALSO LIKE TO KNOW HOW TO DEAL WITH THIS AS I KNOW I HAVE TO PURCHASE NEW TIRES AFTER ONLY 18,210 MILES.                                THANK YOU.  *TR",
        "vin": "KMHFC4DF1AA"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "03/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700713,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MY EARLIER COMPLAINT I INADVERTENTLY TRANSPOSED THE TIRE DESCRIPTION WHICH SHOULD BE MICHELIN ENERGY MXV4+ AND NOT MICHELIN MVX4+ ENERGY.   REGARDING SIDEWALL/TREAD SEPARATION.        THANK YOU.   *TR",
        "vin": "KMHFC4DF1AA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679753,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIT. DEALER CHECKED AND FOUND NO CAUSE.  IN APRIL, 2014 WARNING LIT AGAIN, CHECKED BY INDEPENDENT MECHANIC AND FOUND NO CAUSE.  JANUARY, 2015, WARNING LIGHT AGAIN LIT.  HAVE NOT HAD IT CHECKED YET.  CALLED MANUFACTURER AND WAS TOLD THAT THEY WOULD NOT PROVIDE ASSISTANCE.  I NEEDED TO GO TO DEALER OR MECHANIC AND PAY AGAIN FOR INSPECTION.  I BELIEVE THAT THERE IS A PROBLEM WITH THE VEHICLE.  *TR",
        "vin": "KMHFC4DF8AA"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/30/2013",
        "dateOfIncident": "10/30/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550118,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2010 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, SHE CRASHED INTO A DEER AND THE AIR BAGS DID NOT DEPLOY. THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC FOR REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 31,000.   KMJ",
        "vin": ""
    }
]