[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 HUMMER H3. ON MANY OCCASIONS, THE VEHICLE WOULD NOT IMMEDIATELY START AND THE SECURITY INDICATOR ILLUMINATED. THE VEHICLE HAD BEEN SERVICED FOR THE SAME FAILURE MANY TIMES AT MARITIME MOTORS (985 POST RD, FAIRFIELD, CT). THE FUEL PUMP, ALTERNATOR, AND BATTERY WERE REPLACED DURING THE REPAIRS, BUT THE FAILURE CONTINUED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 95570738708. THE FAILURE MILEAGE WAS 200.",
        "vin": "5GTMNGEE5A8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SOMETIMES WILL NOT START DUE TO A PROBLEM WITH THE SECURITY SENSOR IN THE IGNITION SWITCH.    THIS IS WHEN STARTING UP THE VEHICLE AND WILL ONLY PERIODICALLY OCCUR.   THE SECURITY SYSTEM LIGHT COMES ON AND YOU HAVE TO WAIT 10 MINUTES TO START THE VEHICLE, THEN IT WILL START.   IT HAS HAPPENED IN THE SUMMER AND NOW THE WINTER.",
        "vin": "5GTMNGEE6A8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS ON THE ROAD GOING HOME I NOTICED THAT MY TEMPERATURE WAS SLOWLY RISING THEN ALL OF A SUDDEN MY ENGINE ROOM WAS SMOKING I PULLED ASIDE AND LOOKED AT THE ENGINE ROOM THE SMOKE WAS CAUSED BY THE RADIATOR LEAKING ON FRONT TOP COVER OF RADIATOR WAS CRACKED... DON'T GET ME WRONG BUT I NEVER DID 4 WHEELING ON MY HUMMER I DRIVE IT FOR MY EVERYDAY COMMUTE THAT'S ABOUT IT...UPON CHECKING ON BLOGS OF OTHER HUMMER OWNERS THEY SAY ITS A COMMON PROBLEM THAT'S WHY I WAS AMAZED THAT IT WASN'T A PART OF ANY RECALLS I COULD HAVE JUST IMAGINED IF IM DOING 4WHEELING WELL ANYWAYS WHEN I WENT TO THE DEALERSHIP FOR REPAIRS CAUSE IM CONFUSED ALSO ON THEIR POWERTRAIN WARRANTY CAUSE THE FIRST SENTENCE SAYS RADIATOR IS INCLUDED BUT THE SUCCEEDING PARAGRAPHS SAYS OTHERWISE...SINCE ITS A COMMON KNOWN ISSUE AND BELIEVE ME THIS THE ONLY PART OF HUMMER THAT DEALERSHIP STOCK IN THEIR INVENTORY SHOULD IT BE IN A RECALL NOTICE OR AT LEAST HAVE GM REVIEW IT CAUSE THE WAY I SEE WHY THE CRACK ON THE RADIATOR HAPPENED WAS BECAUSE OF THE FLAW OF THE DESIGN OF RADIATOR SUPPORT THE METAL LIP ON IT RUBS ON FRONT TOP COVER PORTION SO EVENTUALLY THIS WILL GIVE IN PLASTIC VS METAL WE ALL KNOW WHOSE GONNA WIN BUT DID AM GENERAL KNOWS THIS....MY ANSWER DEFINITELY LIKE WHAT I HAD MENTIONED ALREADY AND TRIED AT LEAST 15 DEALERSHIP (FROM CALIFORNIA TO TEXAS TO NEWJERSEY AND MICHIGAN)THAT CATERS TO HUMMER LINE ALL OF THEM HAVE ONE THING IN COMMON THEY STOCK RADIATORS FOR HUMMER H3S...  *TR",
        "vin": "5GTMNGEE4A8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "01/11/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEATING AND AC BLOWER MOTOR STOPPED WORKING ON A VEHICLE THAT HAS LESS THAN 31K MILES ON IT.     THE ESTIMATED REPAIR COSTS ARE 500$, NOT INCLUDING THE TOW, BEING THAT IT IS THE MIDDLE OF WINTER AND THE CLOSEST DEALERSHIP IS 20 MILES AWAY. ADDITIONALLY, THE TIME OFF OF WORK AND EBING WITHOUT A CAR FOR A WEEK.     I HAVE HEAVILY RESEARCHED THIS ISSUE AND IT HAS BEEN REPORTED THOUSANDS OF TIMES AND IS A WELL KNOWN ISSUE AND GM HAS NOT ISSUED A RECALL.    THE PROBLEM IS THAT A FAULTY ELECTRICAL SHORT CAUSES A WIRING HARNESS TO MELT, (SMOKING) WITH A BURNING SMELL AND BLACK RESIDUE.     THIS IS A MAJOR FIRE HAZARD AND THE RECOMMENDED FIX FROM THE DEALERSHIP ONLY REPLACES THE HARNESS, BUY DOES NOT ADDRESS THE CORE ISSUE CAUSING THE FIRE HAZARD.     THIS IS LIKE REPLACING BURNT DRYWALL TO ADDRESS FAULTY HOUSE WIRING .  *TR",
        "vin": "5GTMNJEE7A8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2013",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME AND THE FAN ON THE A/C STOPPED WORKING. SHORTLY AFTERWARD I DETECTED A BURNING ODOR. I ENDED UP REPLACING THE RESISTOR AND WIRING HARNESS FOR THE A/C BLOWER MOTOR. THE RESISTOR WAS BURNT AND THE HARNESS WIRE WAS SLIGHTLY MELTED. I AM CONCERNED ABOUT THE POTENTIAL FOR A FIRE IF THIS HAPPENS AGAIN.  *TR",
        "vin": "5GTMNGEE5A8"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/10/2010",
        "dateOfIncident": "07/26/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348480,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN GLARE REFLECTS OFF THE CHROME PART PLACED ON THE ENGINE HOOD AND QUICKLY BLINDS THE DRIVER FOR SHORT PERIODS OF TIME CAUSING VERY DANGEROUS ROAD DRIVING CONDITIONS. *TR",
        "vin": "5GTDN13E778"
    }
]