[
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438410,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Infiniti G37. The contact stated that while driving at an undisclosed speed, the airbag warning light illuminated. The contact later noticed that there was a crack in the dashboard. The dealer was made aware of the failure and informed the contact that they could repair the dashboard but not the airbags. The vehicle was not repaired. The manufacturer was made aware of the failure and referred the contact to NHTSA to file a complaint. The failure mileage was approximately 80,000.",
        "vin": "jn1cv6ek6am"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "08/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430487,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Infiniti G37. The contact stated that the air bag warning light was illuminated. The vehicle was not diagnosed or repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 100,000.",
        "vin": "JN1CV6AR7AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425986,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger side airbag sensor has failed - this is a serious threat to human life in case of an accident and I'm pretty sure this is illegal. I purchased the car March 2021 from a dealer in San Jose, and this did not show on the carfax report, nor did the dealer inform me of this defect.  BaseD on my research this is a common problem with other G37's of the same year and into 2011.  Infiniti of Beaverton, OR has quoted $7,000.00 to repair which is a little less than half the cost of the car's value. INFINITI SHOULD BE RESPONSIBLE FOR THIS AS IT IS A SERIOUS DEFECT AND IS A LIFE THREATENING SAFETY ISSUE!",
        "vin": "JN1CV6FE2AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406523,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT SENSOR HAS FAILED, CAUSING THE SYSTEM TO BE INOPERATIVE.  BASED ON RESEARCH, THIS IS A COMMON PROBLEM WHICH WAS ADDRESSED ON SOME NISSAN/INFINITI MODELS, BUT NOT THE G37 CONVERTIBLE.  THE COST TO REPAIR IS PROHIBITIVE AT $9000.",
        "vin": "JN1CV6FE4AM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399104,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INFINIT HAS ISSUES WITH THEIR CONVERTIBLE TOP MECHANISM. THEY RUN A METAL TO PLASTIC GEAR THAT STRIPS AND FAILS. THIS CAUSES THE TOP TO SOMETIMES STOP MID CYCLE AND THROW AN ERROR CODE. THEN THE OWNER IS UNABLE TO SECURE THE TOP. I HAD TO DRIVE TO THE DEALER WITH THE TOP IN MID POSITION, NOT SAFE. FRANKLY NOR IS IT TO SAFE TO TOW IN THAT POSITION. IN MY CASE THIS HAS HAPPENED TO ME MORE THAT ONCE. IF ONE GOOGLES \"INFINITI CONVERTIBLE FLAP FAILURE\" YOU WILL SEE IM NOT THE ONLY ONE. INFINITI HASN'T REWORKED THE PARTS (CAR WAS CANCELLED) OR COVERED THE REPAIRS WITH THE SAME DEFECTIVE PART. BETTER YET THESE REPAIRS ARE 2K PER OCCURRENCE TO RESOLVE. AND IN MY CASE FAIL EVERY OTHER YEAR.",
        "vin": "JN1CV6FE5AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394289,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT OCCUPANCY CLASSIFICATION SENSOR (OCS) FAULT: B1018-00.  THIS MEANS THAT PASSENGER AIRBAG IS DISABLED ALONG WITH WARNING LIGHTS ON THE DASH AND CONSOLE.  CAR HAS ONLY 35K AND GARAGE KEPT AND DEALER MAINTAINED. THIS IS A KNOWN ISSUE ON MANY INFINITI / NISSAN MODELS THAT HAVE AN OFFICIAL RECALL, BUT NOT ON THE 2010 G37 FOR SOME REASON EVEN THOUGH IT USES THE SAME SENSOR AS OTHER MODELS WHICH DO HAVE A RECALL.  INFORMED BY THE DEALER THAT THEY SEE A LOT OF THIS ISSUE AND THE ONLY WAY TO RESTORE PASSENGER SAFETY IS TO REPLACE THE SEAT WHICH UPWARDS OF $6900.  EVEN IF I WANTED TO REPLACE THE SEAT, I WAS ALSO INFORMED THAT THERE ARE NO REPLACEMENT SEATS OR INTERNAL PARTS AVAILABLE SO I'M ON MY OWN! DUE TO THIS COMMON DESIGN FLAW IN INFINITI / NISSAN CARS THAT SHARE THIS SAME EXACT ISSUE, THIS MODEL SHOULD BE COVERED BY THE SAME RECALL.THE OTHER MODELS HAVE.  MY VEHICLE USES THE SAME EXACT PARTS AS THE RECALLED ONES, HAS THE SAME ISSUES, AND YET BECAUSE OF SMALLER NUMBER OF COMPLAINTS BECAUSE THERE ARE JUST LESS OF THEM ON THE ROAD, THEY ARE EXCLUDED FROM THE SAME RECALL.  THIS SAFETY ISSUE SHOULD BE RECALLED IMMEDIATELY BEFORE SOMEONE GETS KILLED.",
        "vin": "JN1CV6FE6AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT AIRBAG SENSOR HAS FAILED, SO THE AIRBAG WILL NOT DEPLOY.  DASH WARNING LIGHT REMAINS ILLUMINATED WHILE IN OPERATION. SPOKE TO INFINITI AND WAS TOLD TO TAKE TO A DEALER FOR DIAGNOSTICS AND THEY CONFIRMED NO RECALL CURRENTLY.  SPOKE TO THE LOCAL INFINITI DEALER WHO STATES THEY MUST DIAGNOSE THE PROBLEM AND CHARGE FOR THE SERVICE.  SEAT SENSOR HAS FAILED AND REPAIR INCLUDES THE REPLACEMENT OF THE PASSENGER SEAT, WHICH COSTS AROUND $9K.  THE CURRENT TRADE IN VALUE OF THE CAR IS $5-8K. NO ONE CAN SAFELY RIDE IN THE PASSENGER SEAT OF THIS VEHICLE.  THIS SAFETY ISSUE SHOULD BE RECALLED BY INFINITI.",
        "vin": "JN1CV6FE6AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348476,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY PASSENGER AIRBAG SENSOR. THIS IS A HUGE SAFETY CONCERN, AND HAVING TO PAY $6000 TO FIX IT IS JUST RIDICULOUS.",
        "vin": "JN1CV6FE0AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327919,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 INFINITI G37 CONVERTIBLE'S AIRBAG LIGHT STARTED FLASHING A MONTH OR SO AGO. I RECENTLY BROUGHT THE VEHICLE IN FOR SERVICE AND THEY CHARGED ME $149 TO INFORM ME THAT THE PASSENGER AIRBAG UNIT IN THE SEAT HAD A BAD SENSOR/RELAY AND THE COST TO REPLACE IT IS $7,500. YOU CANNOT JUST REPLACE THE RELAY, BUT RATHER HAVE TO REPLACE THE ENTIRE BOTTOM OF THE SEAT UNIT. IN MOST OTHER CARS, IT IS A FEW HUNDRED DOLLAR FIX AND ONLY REQUIRES REPLACING THE SENSOR/RELAY. I CALLED INFINITI CONSUMER AFFAIRS AND INFORMED THEM OF THIS AND THEY SAID THERE ARE NO RECALLS ON THEIR AIRBAG UNITS AND THAT NOTHING COULD BE DONE ABOUT THIS ISSUE, OTHER THAN PAYING $7,500 TO REPLACE THE UNIT. THE PART NUMBER IS \"87300-JJ84A - CUSHION\".  THIS IS THE SECOND INFINITI VEHICLE THAT I HAVE HAD ISSUES WITH THE AIRBAGS. I HAD A 2008 INFINITI G35 SEDAN WHICH WAS IN AN ACCIDENT WHERE A CAR HIT ME FROM BEHIND AT 40-50 MILES PER HOUR (I WAS STOPPED) AND THE AIRBAGS DID NOT DEPLOY. I WILL FILE A SEPARATE COMPLAINT REGARDING THIS VEHICLE.  ARE THERE ANY RECALLS ON INFINITI AIRBAGS?  *TR",
        "vin": "JN1CV6FE2AM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/17/2020",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324874,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2013 I BEGAN NOTICED THE DASH BECOMING TACKY AND DIFFICULT TO CLEAN. BY 2015, THE DASH BEGAN TO POOL AND REFLECT SUNLIGHT WHILE DAY DRIVING. SHORTLY AFTER THE POOLING STARTED, THE DASH BEGAN CRACKING AND BECAME SOFT, WITH DAMAGE OCCURRING WHEN TOUCHED.",
        "vin": "JN1CV6EK8AM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321282,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS MELTING.  THIS CREATES ASHINE THAT CAUSES A REFLECTION OFF THE WINDSHIELD THAT MAKES IT DIFFICULT TO SEE DURING CERTAIN DAYLIGHT CONDITIONS.  I HAVE NEVER HAD A VEHICLE MADE WITH SUCH A DEFECT.  I HAVE BEEN UNABLE TO STOP THIS MELTING FROM HAPPENING & FROM DOING INTERNET RESEARCH IT APPEAR MANY OTHERS HAVE HAD A SIMILAR ISSUE WITH THEIR INFINITI'S.  THE DASHBOARD IS ALL STICKY, AND ANYTHING PUT ON IT GETS STUCK LIKE AN ADHESIVE GLUE IS ON IT. I WOULD LIKE INFINITI TO REPLACE MY DASHBOARD WITH A LKQ DASHBOARD AS A RECALL.",
        "vin": "JN1CV6AP1AM"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316640,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP OF DASH BECOMES EXTREMELY SHINY AND STICKY AFTER 1 HOUR OF SUNLIGHT THROUGH THE WINDSHIELD CASING UNWANTED GLARE IN WINDSCREEN.  TEMPORARILY CAN BE CLEANED WITH SOAP AND WATER AND RETURNS TO DULL NON STICKY APPEARANCE, BUT ONLY TEMPORARY.  NEXT TIME CAR IS IN THE SUN FOR ABOUT AN HOUR OF DRIVING OR PARKING, THE THE SHININESS AND STICKINESS RETURNS CAUSING MASSIVE REFLECTIONS IN THE WINDSHIELD.  MAKES NO DIFFERENCE IF CAR IS STATIONARY OR IN MOTION.  NO PRODUCT HAS BEEN USED ON THE DASHBOARD OTHER THAN SOAP AND WATER AS NEEDED.  SUSPECT THE UV PROTECTION OR PLASTICS ARE FAILING.  CAR ONLY HAS 35K MILES AND IS GARAGE KEPT.  THERE WAS A SIMILAR PROBLEM AND LATER CLASS ACTION SUITE FOR OLDER NISSANS AND INFINITI, BUT THE PROBLEM DOESN'T LOOKED TO BE SOLVED IN NEWER CARS.",
        "vin": "JN1CV6FE6AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282426,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH ON MY VEHICLE HAS BEEN SLOWLY CRACKING AND FALLING APART FOR ABOUT 2 YEARS. MORE AND MORE FRACTURES ARE OCCURRING ON THE VEHICLE AS IT SITS. THIS IS A KNOWN ISSUE AND WAS RECALLED ON MY 2004 LEXUS RX330 A FEW YEARS AGO FOR THE SAME EXACT PROBLEM. THIS IS CLEARLY A MANUFACTURING DEFECT AND SHOULD BE ADDRESSED BY INFINITI OR THE DASH MANUFACTURER.",
        "vin": "JN1CV6EK0AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280407,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT SHOWS AND BLINKS AFTER STARTING THE VEHICLE AND WHILE DRIVING. DEALERSHIPS WANT OVER $6000 FOR PART. AIRBAG SYSTEM WILL NOT ACTIVATE UNLESS NEW CONTROL SYSTEM IS INSTALLED. DASH LIGHT BLINKS WHENEVER VEHICLE IS ON. HAVE REST MULTIPLE TIMES, BUT THE BLINKING COMINGS BACK.",
        "vin": "JN1CV6APXAM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277002,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS MELTING AND CAUSES REFLECTIONS AT CERTAIN ANGLES CAUSING DISTORTION IN THE VISION. A PART OF THE WIND SHIELD JUST SHOWS THE REFLECTION OF THE DASHBOARD HAMPERING ROAD VISION",
        "vin": "JN1CV6AP5AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270860,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 58000 MILES, THE AIRBAG WARNING LIGHT ILLUMINATED. AFTER TAKING IT TO A DEALER, IT WAS DETERMINED THAT A $7000+ REPAIR IS NEEDED. INTERNET SEARCHES SHOWS THIS IS A DESIGN FLAW THAT INFINITI IS AWARE OF. IN FACT, THEY HAVE RECALLED SIMILAR VEHICLES WITH THE SAME DESIGN BUT NOT MY PARTICULAR VEHICLE. EITHER THE DESIGN IS INCORRECT OR IT'S NOT. THIS IS A FLAW THAT SHOULD BE ADDRESSED BY THE MANUFACTURER.",
        "vin": "JN1CV6FE6AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253090,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCUPANT CLASSIFICATION SYSTEM MALFUNCTION. I HAVE A 2010 INFINITI G37 WITH 89000 MILES, NEVER HAD ANY ACCIDENT BEFORE. RECENTLY THE AIR BAG LIGHT STARTED FLASHING FOR NO APPARENT REASON. I TOOK IT TO THE INFINITI DEALER AND WAS TOLD IT WAS THE PASSENGER AIR BAG SENSOR IN THE FRONT PASSENGER SEAT THAT WAS BAD, AND WOULD COST SEVERAL THOUSANDS DOLLAR TO FIX. AFTER DOING RESEARCH IT SUGGESTS THIS IS A VERY COMMON PROBLEM THAT MANY INFINITI/NISSAN OWNERS ARE CURRENTLY HAVE. NISSAN HAS RECALL FOR THIS PARTICULAR PROBLEM FOR VERY SELECTED VEHICLE BUT I THINK A WIDER RANGE OF RECALL SHOULD BE DONE BY INFINITI/NISSAN.",
        "vin": "JN1CV6EK8AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DADH IS CRAKED ANYWERE AROUND THE AIR CONDITIONER VENTILATION SISTEM AROUND THE RADIO. AND CONTROL SISTEMS.",
        "vin": "JN1CV6AP6AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242760,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG SENSOR IN THE FRONT PASSENGER SEAT HAS FAILED, CAUSING THE PASSENGER AIRBAG LIGHT TO ILLUMINATE AND POSSIBLY DISABLE THE PASSENGER AIRBAG.  THIS MAY CAUSE THE PASSENGER AIRBAG TO NOT DEPLOY IN THE EVENT OF A CRASH.  THE LIGHT ILLUMINATED UPON STARTUP.  THE CAR HAS APPROXIMATELY 40,000 MILES DRIVEN.",
        "vin": "JN1CV6FE1AM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234278,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE DASHBOARD OF MY INFINITI G37, WITH ONLY 25K MILES, HAS STARTED SPLITTING APART FROM EVERY INCH OF THE DASH, THE DRIVER'S SIDE TO THE PASSENGER'S SIDE AND MANY OF THE AREAS ARE NEVER EXPOSED TO THE SUN. EVERY DAY NEW RIPS HAVE APPEARED AND MY FEAR IS THAT THE AIRBAG WILL BREAK THROUGH AND DEPLOY WITHOUT CAUSE WHICH COULD HAVE A CATASTROPHIC OUTCOME. I HAVE NOT BEEN ABLE TO DRIVE MY VEHICLE SINCE THIS ISSUE HAS PROGRESSED SO RAPIDLY. AFTER CALLS TO INFINITI TO REPORT THE ISSUE, THEY ARE NOT WILLING TO ASSIST IN CORRECTING THIS MAJOR FAILURE. THE ONLY SOLUTION THEY HAVE PROVIDED IS TO SELL US A NEW CAR.",
        "vin": "JN1CV6FE3AM"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228887,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITI G37 CONVERTIBLE. WHILE DRIVING AT AN UNKNOWN SPEED, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO INFINITI OF COCONUT CREEK (LOCATED AT 5501 W SAMPLE RD, COCONUT CREEK, FL 33073, (954) 773-8594) WHERE IT WAS DIAGNOSED THAT THE LOWER SECTION OF THE PASSENGER SEAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 30,500.",
        "vin": "JN1CV6FE3AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "04/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221261,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR INDICATOR IS ILLUMINATED AND BLINKING.  THIS OCCURRED DURING NORMAL DRIVING. TOOK IT TO MY LOCAL INFINITI DEALER AND THE ISSUE IS A BAD SENSOR ON THE PASSENGER SEAT.  THE REPAIR CALLS FOR REPLACING THE ENTIRE PASSENGER SEAT, AT A COST OF ALMOST $9000.  THIS IS OBVIOUSLY A MANUFACTURER DEFECT AND SHOULD BE SUBJECT TO A SAFETY RECALL BECAUSE OF THE POSSIBILITY OF NON-DEPLOYMENT OF THE AIR BAG DURING AN ACCIDENT, OR THE ACCIDENTAL DEPLOYMENT IN A NON-ACCIDENT SITUATION.",
        "vin": "JN1CV6FE7AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196211,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME AS EVERYONE ELSE ON HERE. BLINKING DASHBOARD LIGHT OUT OF NOWHERE, OVER 7K TO FIX BUT CAN'T EXPLAIN WHY OR IF THAT WILL 100% FIX AN ISSUE. VEHICLE IS OVER 100K MILES BUT HAVE NEVER SEEN THIS WITH ANOTHER CAR LIKE THIS.     REALLY CHEAP, AND HUGE LACK OF SAFETY AWARENESS BY THE COMPANY",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183586,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NO APPARENT REASON FOR PROBLEMS.  SEATBELT WARNING LIGHTS FOR BOTH THE DRIVER AND FRONT PASSENGER BLINK/REMAIN LIT DUE TO PASSENGER AIRBAG MODULE MALFUNCTION. REPLACED FREE OF CHARGE UNDER EXTENDED WARRANTY AT DEALERSHIP.  SEATBELT RETRACTORS ALSO REPLACED DUE TO SLACK, CAUSING SEATBELTS TO GET CAUGHT IN THE DOOR WHEN SHUT.",
        "vin": "JN1CV6FE7AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175977,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING INDICATOR ILLUMINATED. I INSTALLED A NEW BATTERY. PRIOR TO THE INSTALLATION, THERE WERE NO ISSUES. AFTER THE INSTALLATION THE AIR BAG WARNING INDICATOR APPEARS AFTER THE CAR STARTS UP AND CONTINUE BLINKING.",
        "vin": "JN1CV6FE6AM"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAPORS FROM THE CRACKED DASHBOARD HAVE CREATED A SAFETY ISSUE. THE INSIDE OF THE WINDSHIELD CONTINUOUSLY FOGS UP CREATING A VISIBILITY PROBLEM DUE TO THESE EMITTING VAPORS. HAVE NO CLUE IF THEY MAY BE TOXIC, HOWEVER, THE EMITTING VAPORS ARE A VISUAL SAFETY HAZARD. THE VAPORS ARE CONTINUOUSLY EMITTING WHETHER THE VEHICLE IS STATIONARY OR MOVING. THE CRACKED DASHBOARD IS THE PROBLEM.",
        "vin": "JN1CV6EK0AM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164770,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 3 YEARS THERE HAS BEEN STANDING WATER AFTER RAIN FOR A LONG PERIOD OF TIME ON THE PASSENGER FLOOR BOARD FRONT AND BACK. EVEN AFTER THE RAIN AND I'VE SPONGED IT DRY THE WATER SEEPS BACK IN. CREATING A LOT OF MOISTURE INSIDE CABIN.",
        "vin": "JN1CV6EK3AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163643,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT SHOWS AND BLINKS. DEALER SAYS MUST REPLACE CONTROL UNDER SEAT. NEW COST IS $6300 FOR PART. AIRBAG SYSTEM WILL NOT ACTIVATE UNLESS NEW CONTROL SYSTEM IS INSTALLED.DASH LIGHT BLINKS WHENEVER VEHICLE IS ON.",
        "vin": "JN1CV6AR0AM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163203,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2010 INFINITI G 37 CONVERTIBLE, CURRENTLY WITH 46,000 MILES. ALWAYS GARAGED WHEN NOT BEING DRIVEN BOTH AT WORK AND HOME. ALL OF A SUDDEN THE DASHBOARD IS SOFT AND RANDOM CRACKS APPEARED AT TWO DIFFERENT LOCATIONS.RESEARCHED ONLINE, AND SUPPOSEDLY A LOT OF PEOPLE ARE COMPLAINING ABOUT CRACKING/MELTING DASHBOARDS BY INFINITI, ESPECIALLY WITH G37 MODELS.   I WOULD APPRECIATE ANY ASSISTANCE SINCE INFINITI SEEMS TO BE HAVING QUALITY CONTROL ISSUES AND PEOPLE ALL AROUND THE US ARE FACING SIMILAR SITUATION WITH THEIR INFINITI CARS.",
        "vin": "JN1CV6FE2AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133495,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT FLASHING. INFINITI DEALERSHIP ADVISED SENSOR NOT WORKING.  QUOTED $9,700 TO REPAIR. CALLED INFINITI CONSUMER AFFAIRS, I TRIED TO TALK ABOUT THE SAFETY ISSUES. THEY JUST CONTINUED TO SAY \"NOT UNDER WARRANTY AND NO FINANCIAL ASSISTANCE AVAILABLE FROM INFINITI \". INFINITI COULD CARE LESS ABOUT SAFETY.  I ALSO HAD THE SAME MODEL A YEAR AGO EXCEPT 2011. MY 16 YEAR OLD WAS INVOLVED IN AN ACCIDENT IN THIS CAR. IT WAS TOTALED. AIRBAGS DID NOT DEPLOY. THANK GOODNESS HE WAS OK.",
        "vin": "JN1CV6FE3AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114240,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG IS DISABLED WHEN AN ADULT IS SITTING IN THE SEAT. THE LIGHT COMES ON NOTING THAT IT IS DISABLED AND THEN TURNS OFF. THIS HAPPENS MULTIPLE TIMES. THE ADULT WEIGHS ENOUGH TO TRIGGER THAT SENSOR TO NOT DISABLE THE AIRBAG. THIS IS A SERIOUS FAULT IN THE SENSOR AND SHOULD BE RECALLED IMMEDIATELY.",
        "vin": "JN1CV6AP0AM"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103465,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS STICKY, MELTING, AND CRACKED. GLARE ON WINDSHIELD FROM REFLECTION OF STICKY DASH POSES DRIVING HAZARD DUE TO REDUCED VISIBILITY.",
        "vin": "JN1CV6EK9AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100024,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT IS BLINKING AND THE PASSENGER SEAT AIR BAG LIGHT DOES NOT GO OFF WHEN THE SEAT IS OCCUPIED. I TOOK THE CAR TO AN INFINITI DEALER IN DAYTON, OHIO AND WAS TOLD THE FIX TO CORRECT THIS PROBLEM WAS OVER $7000.  FEEL THIS IS LIKE A RANS VIABLE OPTIONS AND THEREFORE CAN CHARGE WHATEVER THEY CAN. THIS HAS DESTROYED THE RESALE VALUE OF MY CAR AND PUT ANY PASSENGERS AT RISK OF THE AIR BAG NOT DEPLOYING. IF YOU GO ON THE INTERNET YOU CAN SEE THAT THERE ARE MANY CUSTOMERS COMPLAINING ABOUT THE SAME ISSUE. I THINK INFINITI HAS NO REAL  DESIRE TO CORRECT THIS SITUATION. THEY LEAVE THE OWNER IN A NO WIN SITUATION - EITHER PLAY THE RANSOM OR PUT LOVED ONES AT RISK. I WONDER HOW MANY INFINITI\"S ARE ON THE ROAD TODAY WITHOUT AN OPERATIVE PASSENGER AIR BAG. WHEN THE LIGHT STARTED BLINKING I WAS DRIVING FROM SOUTH CAROLINA TO OHIO. I FIRST NOTICED THE BLINKING LIGHT ON SUNDAY MAY 27, 2018",
        "vin": "JN1CV6FE2AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093285,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS HAD SIGNIFICANT ISSUES WITH THE CONVERTIBLE ROOF OPERATION SINCE PURCHASE WITH SERVICE FROM THE DEALER SEVERAL TIMES A YEAR. DEALER KEEPS THE CAR FOR SEVERAL WEEKS EACH VISIT. NEW MOTOR PLACED FALL 2017; ROOF IS NOT FUNCTIONING AGAIN ONLY BEING USED A FEW TIMES SINCE THE MOTOR WAS PLACED. THIS ISSUE HAS BEEN CONSISTENT EACH TIME A NEW REASON IS GIVEN BY THE DEALER AT SIGNIFICANT COST. MANUFACTURER HAS STOPPED MAKING THIS CAR, ADMITTED BY THE DEALER DUE TO THE MALFUNCTIONING ROOF. CAR IS INOPERABLE WITH THE ROOF ISSUES; CURRENT REPORT FROM SERVICE DEPARTMENT IS TO REPLACE THE ROOF LATCH AT NEARLY $4,000. DEALER SUGGESTS GETTING RID OF THE CAR AS LIKELY TO CONTINUE TO BREAK WITH EVEN GREATER COSTS WITH KNOWN HYDRAULIC PUMP FAILURES AND AS EVIDENCED BY OTHER G37 CONVERTIBLES EXPERIENCING THE SAME ISSUE (LATEST SERVICE SUMMARY ATTACHED). ETHICALLY CAN NOT SELL PRIVATELY AND TRADE IN SIGNIFICANTLY DIMINISHED. MANUFACTURER SHOULD BE HELD ACCOUNTABLE FOR A KNOWN DEFECTIVE MECHANICAL FUNCTION OF THIS CAR LEAVING CUSTOMERS WITH INOPERABLE OR INCUR RIDICULOUS ONGOING EXPENSES IN ORDER TO CONTINUE OWNERSHIP.",
        "vin": "JN1CV6FEXAM"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITI G37. WHILE DRIVING VARIOUS SPEEDS, SEVERAL WARNING INDICATORS ILLUMINATED AND FALSELY DISPLAYED THAT THE KEY WAS NOT IN THE IGNITION. IN ADDITION, THE FUEL MILEAGE WAS REPORTED INCORRECTLY AND THE VEHICLE BEGAN TO SPUTTER. THE CONTACT ALSO STATED THAT THE TRUNK OPENED INDEPENDENTLY AND A WARNING INDICATOR ILLUMINATED, CONFIRMING THAT THE TRUNK WAS OPEN ON MORE THAN ONE OCCASION. BENNETT INFINITI DEALER (2121 LEHIGH ST, ALLENTOWN, PA 18103) WAS MADE AWARE OF THE FAILURES, BUT THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 78,000.",
        "vin": "JN1CV6AR8AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/12/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066443,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE RECALL THIS CAR BECAUSE I ESTABLISHED A CAR ENGINE PROBLEM AT INFINITI MIAMI CENTER. THE CAR WAS SOLD TO ME BY A  LIAR FROM A DEALERSHIP. HE SOLD A CAR WITHOUT ANY PROBLEMS. BUT LESS THEN ONE MONTH IT SHOWS THE BIG PROBLEM. I HAVE ALL PROOFS. THE CAR IS DANGEROUS TO DRIVE. IF YOU RECALL THE CAR IT CAN SAVE MY LIFE, MY FAMILY LIVES AND OTHER DRIVERS. PLEASE HELP ME. WHILE I WAS DRIVING THE CAR WAS JUST STOPPED AT THE ROAD. I WAS VERY SCARED. SOMETHING VERY DANGEROUS WITH THE CAR. AND THE CAR SOMETIMES LOWER ITS SPEED TO EXTREMELY LOW. AND I NEED TO START UP THE CAR TO START DRIVING AGAIN. AND THE DEALERSHIP REFUSED TO HELP ME. HE STEAL MY MONEY AND GET ME OFF FROM THEIR OFFICE. VERY RUDE AND NOT TRUSTFUL DEALERSHIP. I WISH TO RETURN THE CAR TO THEM AND TAKE MY MONEY BACK. IT'S A FRAUD HAPPENED TO ME! ON INFINITY CENTER TOLD ME IT'S EXTREMELY DANGEROUS TO DRIVE THAT CAR. AND IT'S NOT START UP OFTEN, OR CHANGED ITS SPEED VERY FAST.",
        "vin": "JN1CV6AP8AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2018",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065608,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKING ALL OVER LEADING TO DASH AIRBAG WHICH MIGHT CAUSE AIRBAG TO PREMATURELY OPEN OR NOT OPEN IF INVOLVED IN A FRONT END ACCIDENT.",
        "vin": "JN1CV6FE8AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR USED WITH LESS THAN 53,000MI STILL UNDER MANUFACTURED WARRANTY AND I EVEN BOUGHT AN EXTENDED WARRANTY FROM CARMAX WHEN I BOUGHT THE CAR. I WAS DRIVING CAR AND WITHIN A WEEK I TOOK TO CARMAX CLUTCH WASN'T FEELING THE SAME WHEN SHIFTING (RETURN PRESSURE LOOSENED UP) THEY SAID CAR WAS FINE. JUST A LITTLE OVER A MONTH LATER I TOOK CAR TO INFINITI FOR SAME PROBLEM, THEY ALSO SAID THE CAR WAS FINE AND SHIFTING WAS NORMAL. YESTERDAY I WAS DRIVING HOME (A MONTH LATER EXACTLY AFTER INFINITY CHECKED IT OUT) MY CLUTCH PEDAL WENT ALL WAY TO FLOOR AND I COULDN'T SHIFT BARELY MADE IT HOME. I WOULD HAVE TO SAY THAT MY CLUTCH IS NOT FINE OR SHINING RIGHT AT ALL I HAVE HAD TO PAY 2XS ALREADY FOR DIAGNOSES AND I HAVEN'T HAD MY CAR MORE THAN 3MONTHS!",
        "vin": "JN1CV6EK6AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967537,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITI G37. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE PASSENGER SEAT SENSOR MALFUNCTIONED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 35,000.  UPDATED 06/21/17*LJ    *CN",
        "vin": "JN1CV6EK8AM"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 16V-349 IS FOR INFINITI M 35 OWNERS, I OWN A G37 S. THE REASON FOR THE RECALL FITS THE DESCRIPTION OF MY PROBLEM. I LIVE IN SOUTH FLORIDA AND HAV A PASSENGER DASHBOARD CRACK. INFINITI STATES IT OUT OF WARRANTY YET THEY KNOW THEY HAVE A PROBLEM BECAUSE OF THE RECALL ON THE M 35. THEY ADVISE NOT TO ALLOW PASSENGERS TO SIT IN THE PASSENGER SEAT ON THE RECALL. I FILED A CASE WITH THEM #251971113",
        "vin": "JN1CV6EK0AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924282,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RED PASSENGER AIRBAG LIGHT BEGAN BLINKING. IN AUGUST 2015, IT WAS TAKEN TO DEALER FOR DIAGNOSIS. PASSENGER SIDE FRONT OCCUPANT SENSOR NOT WORKING & WAS RESET. IT CAME ON ONCE A PASSENGER SAT IN THE SEAT AGAIN. COST TO REPAIR THIS WAS STATED AT $4930.53. IT IS A SAFETY ISSUE THEY SHOULD BE RESPONSIBLE FOR! A YEAR LATER, IT IS STILL FLASHING. I CANNOT FIND A RECALL STILL. I TRIED TO UPLOAD A SECOND FILE SHOWING THE ESTIMATE TO REPAIR.",
        "vin": "JN1CV6AP8AM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920201,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING BELT JUMPED AND RUINED ENTIRE ENGINE AT 69,000 MILES.  I'VE HAD THE CAR FOR UNDER 2 YEARS.  REGULARLY SERVICED AND WELL TAKEN CARE OF.  DEALERSHIP HAS COMPLETE RECORDS OF SERVICE FROM PRIOR OWNER.  NEVER HAD ANY ISSUES.  INFINITI WILL NOT COVER ENTIRE COST OF REPAIR BECAUSE I'M A COUPLE OF MONTHS OUT OF WARRANTY EVEN THOUGH I'M UNDER 70,000 MILES.  I'M VERY HURT AND DISAPPOINTED.  I'M A SINGLE WOMAN WHO BOUGHT THIS CAR BY HERSELF WITH A LOT FAITH.  CAR IS STILL BEING FINANCED, YET NOW I HAVE TO PAY THOUSANDS OF DOLLARS FOR A PROBLEM THAT SHOULD HAVE NEVER HAPPENED.  ANY ADVICE?",
        "vin": "JN1CV6AR6AM"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKED, THE DRIVER SEAT COULD NOT BE ADJUSTED. THE BACK OF DRIVER SEAT WENT TOTALLY BACK AND COULD NOT BE RETURNED TO AN UPRIGHT POSITION. THERE WAS A RISK IN DRIVING THE CAR.",
        "vin": "JN1CV6APXAM"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881870,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2010 G37 INFINITI IS EQUIPPED WITH MICHELIN PILOT SPORT A/S 3 TIRES, SIZE 245/45R18. ONLY HAD THE VEHICLE 30 DAYS AND WHILE DRIVING APPROXIMATELY 55 MPH ON HIGHWAY, THE REAR PASSENGER SIDE TIRE BLEW OUT AND CAUSED THE VEHICLE TO CRASH. THE VEHICLE WAS DAMAGED BAD AND NOT DRIVABLE AND HAD TO BE TOWED. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED BECAUSE IT DID NOT INVOLVE ANOTHER VEHICLE. THE TIRE WAS A REPLACEMENT TIRE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE VEHICLE FAILURE MILEAGE WAS 52,000 AND THE TIRE FAILURE MILEAGE WAS UNKNOWN. NOT SURE OF THE DAMAGE COST  DONE TO VEHICLE.   REQUEST RESEARCH  HELP",
        "vin": "JN1CV6FE8AM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "01/19/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10864035,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKING THE VEHICLE AND GETTING OUT WITH THE KEYS IN HAND AND NOT OUT TURNING OFF THE ENGINE, THERE IS NOT SOME TYPE OF WARNING SO THAT ONE DOESN'T LEAVE A RUNNING CAR IN A CLOSED GARAGE.  I KNOW THAT THIS IS THE DRIVERS FAULT BUT IT HAS HAPPENED TO ME TWICE AND TO A COUPLE IN HIGHLAND PARK, ILL THAT WERE ASPHASTICATED AND DIED FROM THIS TYPE OF OCCURRENCE. I HAVE TALKED TO NIASIAN US HEADQUARTERS TWICE AND THEY INFORMED ME THAT THEY DO NOT ACCEPT AN UNREQUESTED CONSUMER COMMENT AND THAT THEY WOULD NOT CONSIDER AND/OR LOOK INTO THIS TYPE OF OCCURRENCE.  EVEN THOUGH THERE HAS BEEN DEATHS DUE TO THIS.",
        "vin": "JN1CV6AR2AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/02/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853094,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE PARKING LOT, READY TO PARK MY CAR. I WAS DRIVING VERY SLOW. SUDDENLY, MY CAR ACCELERATED AND I HIT THE BUILDING IN FRONT OF ME.  IT TOOK ME BY SURPRISE.  EVERYTHING LASTS NO MORE THAN 5 SEC.",
        "vin": "JN1CV6EL7AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/20/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850649,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS BLINKING AND IT WILL NOT STOP.  AFTER A VISIT TO THE INFINITI DEALER HERE IN KANSAS CITY THEY TOLD ME THE \"OCCUPATION SENSOR\" IS BAD AND THE TOTAL COST TO REPAIR WOULD BE $5488.67 THIS IS A SERIOUS ISSUE WITH THE AIRBAG AS NOW THE OCCUPANTS ARE NOT PROTECTED AND NISSAN AND THE NHTSA NEED TO ISSUE A RECALL.  THIS IS 1 OF 1000'S OF COMPLAINTS REGARDING THIS AND THE EXTRAVAGANT COST TO REPAIR.",
        "vin": "JN1CV6FE2AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748501,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE EVENING OF 8/1015 IMMEDIATELY AFTER STARTING THE CAR A LOUD METAL ON METAL GRINDING SOUND WAS HEARD AND THE ENGINE STOPPED.  THIS RECURRED ON ATTEMPTING TO RESTART THE ENGINE.  WITH 3RD ATTEMPT CAR STARTED AND APPEARED TO BE WORKING BUT THE AC WASN'T COOLING AND THE DEFOGGER FAILED TO CLEAR WINDSHIELD MISTING.  I TOOK THE CAR TO THE MECHANIC THE NEXT MORNING AND A CATASTROPHIC PART FAILURE WAS FOUND IN THE COMPRESSOR.  THERE WAS A BREAK IN THE METAL CASING AND BITS OF METAL WERE IN THE FLUID REQUIRING NOT ONLY REPLACEMENT OF THE COMPRESSOR BUT FLUSHING OF THE TUBING AND RECHARGING OF THE FREON.  FORTUNATELY THE METAL FRAGMENTS DID NOT CAUSE OTHER ENGINE DAMAGE AND THE CAR WAS PARKED AT THE TIME AND NOT ON THE ROAD.",
        "vin": "JN1CV6AP3AM"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/14/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731521,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITI G37. THE CONTACT STATED THAT WHILE AT A STOP, THE VEHICLE INDEPENDENTLY ACCELERATED. THE VEHICLE WAS TAKEN TO A DEALER MULTIPLE TIMES WHO WAS UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE DEALER. THE CONTACT WAS UNSURE WHAT PART NEEDED TO BE REPLACED. IN ADDITION, WHILE AT A STOP WITH THE BRAKE PEDAL DEPRESSED, THE VEHICLE INDEPENDENTLY ACCELERATED. AS A RESULT, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT DID NOT SUSTAIN ANY INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND SENT A SPECIALIST TO INSPECT THE VEHICLE. THE FAILURE MILEAGE WAS 45,000.   UPDATED 09/14/15*LJ    UPDATED 11/03/2017*CN",
        "vin": "JN1CV6AP5AM"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726657,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "SPORT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITI G37 EQUIPPED WITH DUNLOP SP SPORT MAXX (NA) TIRES, SIZE P225/50R18 (NA). WHILE DRIVING 65 MPH, THE CONTACT FELT RUMBLING UNDERNEATH THE VEHICLE. THE CONTACT PULLED OVER TO THE SHOULDER OF THE ROAD AND NOTICED THAT THE REAR DRIVER SIDE TIRE WAS DESTROYED. THE CONTACT STATED THAT THE TIRE WAS REPLACED BY AN INDEPENDENT MECHANIC WHO CONFIRMED THAT THE SIDEWALL DETACHED FROM THE TREAD OF THE TIRE. THE TIRE WAS ORIGINAL EQUIPMENT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE OF THE TIRE AND VEHICLE WAS 15,000. THE DOT NUMBER AND VIN WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704539,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS DOOR WOULD NOT OPEN FROM OUTSIDE OR INSIDE VEHICLE.  DRIVER WOULD HAVE TO ATTEMPT TO CRAWL OUT ADJACENT DOOR.  DEALER HAD TO PRY DOOR OPEN AND REMOVE FRONT SEAT TO FIX THE DOOR.  *TR",
        "vin": "JN1CV6AR5AM"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10702269,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT RED LIGHT AND DRIVER BEHIND ME DID NOT SEE THE LIGHT. SHE REAR ENDED ME AT AN APPROX SPEED OF 30-35 MPH. THE FORCE OF THE HIT PUSHED MY CAR INTO THE ONE IN FRONT OF ME, RESULTING IN A 4 VEHICLE ACCIDENT. AT THE TIME OF IMPACT, MY GLASSES CAME OFF OF MY FACE AND I HIT THE WINDSHIELD - MY SEAT BELT DID NOT LOCK. THE FORCE OF THE CRASH BENT THE FRAME, DESTROYED THE TRUNK, AND RESULTED IN A TOTAL LOSS. I SUSTAINED A MODERATE TO SEVER CONCUSSION, ALONG WITH WHIPLASH AND PERSISTENT HEADACHES.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "01/05/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670349,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVER FRONT AND PASSENGER FRONT DOOR WOULD NOT OPEN. THE REAR DOORS HAD NO ISSUES. THE FOB WOULD ALLOW ME TO LOCK AND UNLOCK, AS WELL, THE KEY IN FOB WORKED TO LOCK AND UNLOCK, HOWEVER THE DOORS WOULD NOT OPEN FROM THE OUTSIDE OR THE INSIDE. THIS CONTIMUED FROM 7AM UNTIL 3PM WITH MULITPLE ATTEMPTS TO OPEN THE DOORS. THE FRONT PASSENGAR DOOR OPENED RANDOMLY AT 2PM BUT THE OTHER DID NOT UNTIL AROUND 3PM. THE DOORS WORKED AS NORMAL UNTIL 10PM AND THEN AGAIN A REPEAT OF THE SAME ISSUE. I HAVE READ ONLINE100'S OF ISSUES WITH VARIOUS NISSAN AND INFINITIS FROM YEARS 2008 TO 2011 WITH THIS SAME ISSUE, AS I WAS TRYING TO FIND REPAIRS FOR THIS ISSUE. THIS SHOULD HAVE BEEN RECALLED YEARS AGO. THIS IS VARY UNSAFE. IF AN ACCIDENT OCCURED WE WOULD BE OUT OF LUCK TRYING TO GET OUT OF A VEHICLE THAT RANDOMLY WILL OR WILL NOT LET YOU IN OR OUT OF IT. I WILL BE FOLOWING UP WITH THE INFINITI /NISSAN DEALER AND MAKE SURE THIS IS REPAIRED FREE OF CHARGE.",
        "vin": "JN1CV6AR4AM"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "08/02/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618787,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST GOT THIS CAR FROM THE DEALERSHIP IT IS USED. WHEN I TEST DROVE THE CAR IT WAS FINE BUT I ONLY DROVE AROUND 25 MPH BEING THAT IT WAS MY FIRST TIME DRIVING SINCE I WAS REAR ENDED. IT WAS FINE EVERYTHING WAS OKAY. A FEW DAYS LATER I SAT IN THE PASSENGER SEAT AND THE AIRBAG BUTTON LIGHT SHOWS UP SAYING IT'S OFF I DIDN'T NOTICES THUS THE FIRST TIME I TEST DROVE IT.BUT EVERY TIME ANYONE SITS THERE LIGHTS UP. AND THIS  IS  VERY SCARY BEING THAT SAFETY US A HUGE PRIORITY. ANOTHER PROBLEM  IS I DROVE ON THE FREEWAY AND IT SEEMED TO ACCELERATE ON ITS OWN. I WAS SCARED U DIDN'T DRIVE OVER 65 BUT.IT WON'T GO UP AND U WOULD PRESS THE BRAKES FAST IT WAS NOT TO MUCH TRAFFIC BUT WHAT IF THERE WAS IT CAN CAUSE AN ACCIDENT.  *TR",
        "vin": "JN1CV6AP8AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "06/20/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606084,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MY CLUTCH BECAME SOFT AND \"SPONGY\" TO THE POINT THAT THE ENGAGEMENT POINT WAS ON THE FLOOR AND THE PEDAL WOULD NOT RETURN TO THE ENGAGED POSITION. THIS WAS A RESULT OF A FAILING CLUTCH SLAVE CYLINDER WHICH HAS AFFECTED MANY G37 AS WELL AS NISSAN 370Z'S.  *TR",
        "vin": "JN1CV6EK3AM"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/12/2014",
        "dateOfIncident": "01/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559526,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CHANGING A TIRE NOTICED THE SCREW BOLT ON THE FACTORY JACK WOULD SLIGHTLY ROTATE COUNTER CLOCKWISE DURING STOPS WHEN LIFTING THE CAR. UPON LOWERING THE CAR AFTER INSTALLING THE SPARE AND APPROXIMATELY HALF WAY THROUGH LOWERING THE VEHICLE, THE JACK WAS NOT ABLE TO HOLD THE WEIGHT OF THE CAR AND THE SCREW BOLT RAPIDLY SPUN COUNTER CLOCKWISE AND THE CAR FEEL SUDDENLY. CONCERNED ABOUT A POSSIBLE FAILURE TO HOLD THE VEHICLE WHILE REMOVING AND CHANGING THE TIRE UNLESS THE JACK HANDLE IS ALWAYS ATTACHED TO THE 'RING' AND POSITIONED AT A ANGLE INTO THE ROAD SURFACE TO PREVENT ANY MOVEMENT.   *TR",
        "vin": "JN1CV6AP9AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2014",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559478,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WITH INNUMERABLE OWNERS OF THIS 6 SPEED MANUAL TRANSMISSION (6MT), I AM CONSISTENTLY EXPERIENCING A GRINDING AND CRUNCHING SOUND/FEELING WHEN SHIFTING INTO 5TH GEAR AT NORMAL SPEEDS. UNLESS I VERY SLOWLY (GRANNY SHIFT) OR DOUBLE CLUTCH, THIS GRINDING/CRUNCHING SOUND WILL BE HEARD AND FELT. ACCORDING TO WEB SEARCHES, THIS TRANSMISSION DAMAGING ISSUE HAS BEEN REPORTED BY MANY OTHER CUSTOMERS AND ACKNOWLEDGED/REPAIRED BY INFINITI UNDER WARRANTY WHEN CUSTOMER IS PERSISTENT.  *TR",
        "vin": "JN1CV6EK1AM"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/31/2013",
        "dateOfIncident": "07/29/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532882,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIRBAG LIGHT COMES, INDICATING THAT  AIRBAG IS OFF, ON WHEN THERE IS A PASSENGER IN THE SEAT. I WENT TO THE DEALER TWO TIMES AND WAS TOLD THAT THERE IS NOTHING WRONG WITH THE FUNCTIONING OF THE AIRBAG SYSTEM. THIS ISSUE OCCURS WHEN MY WIFE (WHO WEIGHS 130 POUNDS) IS SITTING IN THE SEAT. WE WERE TOLD BY THE \"MASTER TECHNICIAN\" THAT SHE IS TOO SMALL OF A PERSON TO BEAR THE FORCE OF THE AIRBAG AND THAT IT WAS SAFER FOR HER WITHOUT THE AIRBAG.   *TR",
        "vin": "JN1CV6AP8AM"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/11/2012",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475078,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINTI G37XS. THE CONTACT WAS TRAVELING 20MPH WHEN THE BRAKES WERE DEPRESSED AND THE VEHICLE FAILED TO STOP PROPERLY. THE CONTACT MENTIONED THAT THE FAILURE RECURRED AFTER TRAVELING 15 MPH AND THE VEHICLE CRASHED INTO THE REAR END OF ANOTHER VEHICLE. A POLICE REPORT WAS NOT FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TAKEN TO THE DEALER. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 18,000 AND THE CURRENT MILEAGE WAS 18,562.",
        "vin": "JN1CV6AR9AM"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2012",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453567,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION:  TRANSMISSION DOES NOT OPERATE PROPERLY.  HARSH DOWNSHIFTING (USUALLY AROUND 30-40 MPH) BEGAN WITHIN FIRST TWO MONTHS OF OWNERSHIP AND CONTINUES TO THIS DAY.  SIGNIFICANT LAG (2-3 SECONDS) OCCURS WHEN ACCELERATING WHILE MOVING OR WHILE NEARLY STOPPED CREATING UNSAFE DRIVING CONDITIONS WHEN ENTERING AN INTERSECTION, MERGING INTO TRAFFIC, OR ACCELERATING TO AVOID A COLLISION.  SERVICE BULLETINS HAVE BEEN ISSUED BY MANUFACTURER AND APPLIED TO VEHICLE IN ATTEMPT TO ADDRESS PROBLEMS (ECM/TCM REPROGRAMMINGS), HOWEVER, PROBLEMS PERSIST AND ARE CONSTANT.  INITIALLY, MANUFACTURER COMMUNICATED WITH ME IN ATTEMPT TO RESOLVE PROBLEMS, INCLUDING A COMMITMENT TO REPLACE TRANSMISSION, BUT HAS NOW CEASED COMMUNICATION.  AUTOMOBILE FORUMS AND MANUFACTURER SERVICE BULLETINS INDICATE THIS IS A WIDELY KNOWN, WIDELY EXPERIENCED PROBLEM WITH THIS MODEL OF TRANSMISSION.  IT APPEARS MANUFACTURER IS NO LONGER COMMITTED TO RESOLVING THESE PROBLEMS.  AIR BAGS:  PASSENGER SIDE AIR BAG SIGNAL WILL ILLUMINATE INDICATING PASSENGER SIDE AIR BAG IS DEACTIVATED ALTHOUGH THERE IS AN ADULT PASSENGER IN THE SEAT.  IF THE PASSENGER LIFTS OFF THE SEAT FOR 10 SECONDS, THE ILLUMINATION WILL CEASE AND PRESUMABLY THE PASSENGER AIR BAG IS ONCE AGAIN ACTIVATED, HOWEVER, SOMETIMES THE SIGNAL WILL AGAIN ILLUMINATE AND THE PASSENGER MUST AGAIN LIFT OFF THE SEAT TO CEASE ILLUMINATION TO ENSURE PROPER OPERATION OF PASSENGER SIDE AIR BAG.  PROPER OPERATION OF THE PASSENGER SIDE AIR BAG IS UNCERTAIN.  THE MANUFACTURER TOLD ME THEY WOULD CONTACT DEALERSHIP IN ORDER TO DIAGNOSE THIS PROBLEM BUT THEY HAVE NOT DONE SO.     *JS",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2012",
        "dateOfIncident": "04/13/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447920,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED THE VEHICLE BACK ON 2010 OF OCTOBER.  6 MONTHS LATER I HAD ISSUES WITH ACCELERATION ON 4 DIFFERENT OCCASIONS AT ALL TIMES OF THE DAY.  EVEN WHEN FOOT IS LIGHTLY PUSHED ON THE GAS PEDAL CAR RPM REVS FROM 1 TO 7 QUICKLY.  UNCOMFORTABLE SINCE YOU DON'T KNOW WHEN TO ACCELERATE HARD OR SOFT.  SCARY WHEN DRIVING SHORT DISTANCE WITH STOP AND GO MOTION.  ENGINE AT TIMES IS UNPREDICTABLE.  CAR ALSO SHUT DOWN ON ME SEVERAL TIMES WHILE DRIVING ON BUSY ROADS.  CAR IS ONLY 1 1/2 YEARS OLD.  THIS ISSUE NEEDS TO BE INVESTIGATED.  *TR",
        "vin": "JN1CV6EK9AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2012",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445793,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS AN ERRATIC SHIFTING OF THE 7-SPEED AUTOMATIC TRANSMISSION.  IN HIGHWAY DRIVING AT LOWER SPEEDS BELOW 40 MPH DUE TO SLOW TRAFFIC, THE TRANSMISSION SHIFTS ON OCCASION INTO A GEAR WHERE THE ENGINE RPM DROPS AND HOLDS AT 1000 - 1100.  IF YOU ACCELERATE SLOWLY THE RPM'S REMAIN AT ABOUT 1000 UNLESS YOU ACTUALLY PUSH THE PEDAL ALL THE WAY DOWN TO THE FLOOR BOARD.  AT THIS POINT IF YOU TRY TO ACCELERATE AND PICK UP SPEED THERE IS A GREAT HESITATION.  I NOW HAVE 15,000 MILES ON THIS CAR AND THE DEALERSHIP HAS TOLD ME IN THE PAST THAT IT CAN NOT DUPLICATE THE PROBLEM.  I HAVE SEEN SEVERAL COMPLAINTS ON THE EDMONDS.COM FORUM SITE THAT DESCRIBE MY CAR'S PROBLEM AND OTHER DRIVERS AGREE THAT THIS WILL CAUSE AN ACCIDENT OR POSSIBLY COST SOMEONE THEIR LIFE IF THIS PROBLEM IS NOT ADDRESSED.  AT ONE POINT THE DEALERSHIP TOLD ME THAT MY CAR'S ON BOARD COMPUTER IS LEARNING MY STYLE OF DRIVING HABITS AND IT WILL EVENTUALLY BE OKAY.  I AM SERIOUSLY CONSIDERING TRADING THE CAR BUT IN GOOD CONSCIENCE I AM CONCERNED ABOUT MY LEGAL OBLIGATION TO DIVULGE THIS PROBLEM TO THE NEXT OWNER.  THIS IS A SERIOUS PROBLEM THAT NEEDS TO BE INVESTIGATED.  *TT",
        "vin": "JN1CV6EK1AM"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/07/2012",
        "dateOfIncident": "01/07/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442801,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A PARKING LOT EXIT PRIOR TO TURNING, MY FOOT WAS ON THE BRAKE AND THE ENGINE STARTED RACING. THE CAR STARTED ROLLING FORWARD EVEN WITH THE BRAKES FIRMLY APPLIED. I PUT THE CAR IN PARK, BUT THE ENGINE CONTINUED TO RACE. I TURNED THE CAR OFF. I RESTARTED THE CAR, AND THE ENGINE RAN NORMALLY.    A SIMILAR INCIDENT HAPPEND TO ME IN THE SAME CAR ABOUT A YEAR AND A HALF AGO IN A PARKING LOT. THE ENGINE STARTED RACING WHILE BACKING UP. I PUT THE CAR IN PARK AND TURNED THE ENGINE OFF. THE CAR RAN FINE WHEN I RE-STARTED THE CAR.  *TR",
        "vin": "JN1CV6AR8AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2011",
        "dateOfIncident": "10/12/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR WITH MY FOOT ON THE BRAKE AND IT REVVED UP TO 4500 RPMS.  I TOOK OUT MY PHONE AND HAD TIME TO TAKE TWO PICTURES OF THE METER.  I TURNED THE CAR OFF AND IT DID IT AGAIN, FOR A TOTAL OF THREE TIMES.  THE SAME THING HAD HAPPENED ONCE EARLIER IN THE DAY.  I ALSO HAPPENS SPORADICALLY WHEN I FIRST START IT IN THE MORNING.  SOMETIMES I FEEL IT IS GOING TO GO THROUGHOUT THE GARAGE WALL.  FORTUNATELY TO START IT I MUST HAVE MY FOOT ON THE BRAKE!  *TR",
        "vin": "JN1CV6AR2AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/25/2011",
        "dateOfIncident": "03/14/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403439,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG AT APPROXIMATELY 35 MPH (SPEED LIMIT) IN THE MIDDLE LANE OF A 3 LANE ROAD AND APPROACHED A RED LIGHT.  I BRAKED, BUT INSTEAD OF THE CAR SLOWING DOWN, IT STARTED ACCELERATING VERY FAST.   I PRESSED DOWN ON THE BRAKE AS HARD AS I COULD BUT THE CAR CONTINUED SPEEDING UP.  THERE WERE CARS ON BOTH SIDES OF ME SO I HIT A PICKUP  TRUCK IN FRONT OF ME - THE AIR BAGS DEPLOYED ON BOTH MY SIDE AND THE PASSENGER SIDE WHERE MY SON WAS SITTING.   MY CAR HIT THE TOW BAR ON THE PICKUP TRUCK AND TOTALLY CRUMBLED.   NEITHER MY SON NOR I WERE HURT BECAUSE THE AIR BAGS PROVIDED PROTECTION.  THE FELLOW IN THE PICK UP TRUCK DID NOT SUFFER ANY INJURIES AT ALL.   HOWEVER, DAMAGES AND REPAIR TO MY AUTO COST MY INSURANCE COMPANY MORE THAN $19K. THE CAR WAS RETURNED TO ME AFTER MORE THAN 9 WEEKS (5/20/11) IN THE SHOP.  AT THE TIME THE CAR WAS RETURNED IT HAD APPROXIMATELY 3020 MILES.  AFTER A DAY OR TWO, THE CAR BEGAN TO RUN VERY ROUGHLY WHEN IDLING AT LIGHTS. I TELEPHONED THE DEALERSHIP AND ARRANGED TO BRING THE CAR IN FOR SERVICE ON WEDNESDAY, 5/25/2011.    ON THE WAY TO THE DEALERSHIP, THE CAR FAILED AGAIN EXCEPT THIS TIME, I WAS HALTED AT A RED LIGHT, AND THE CAR ON ITS OWN, WHILE MY FOOT WAS HOLDING THE BRAKE, ACCELERATED VERY FAST, AND STARTED TO MOVE.  I WAS THE FIRST CAR IN THE LANE (PREPARING TO TURN RIGHT) SO  I WAS ABLE TO STEER THE CAR OVER TO THE SIDE OF THE ROAD, MY SON SLAMMED THE CAR INTO PARK.  MY INFINITI DEALER IS INDICATING THAT I MUST HAVE HAD ONE FOOT ON THE BRAKE AND ONE FOOT ON THE GAS.  HE ACKNOWLEDGED THAT THE  CAR WAS RUNNING ROUGHLY BECAUSE THE REPAIR SHOP AT THE DEALERSHIP HAD NOT REPAIRED THE CAR CORRECTLY.  G37 UNINTENDED ACCELERATION FOR INFINITI G37 HAS BEEN REPORTED PREVIOUSLY UNDER THE FOLLOWING FORUM.  HTTP://FORUMS.NICOCLUB.COM.  I WILL NEVER DRIVE THE CAR AGAIN BECAUSE I HAVE NEITHER A SUICIDE WISH NOR DO I WANT TO KILL ANYONE ELSE.",
        "vin": "JN1CV6ARXAM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "01/08/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN HOUR DRIVE TO RETURN HOME.  I HAD DRIVEN ABOUT 30 MIN WHEN I HAD TO SLOW DOWN FOR A TRAFFIC ACCIDENT.  WHEN I TRIED TO GET BACK UP TO SPEED ON THE FREEWAY,, THE TRANSMISSION DISENGAGED.  I HAD TO PUT IT INTO NEUTRAL AND THEN BACK INTO DRIVE TO RESUME DRIVING.  THE TRANSMISSION CONTINUED TO DISENGAGE ABOUT EVERY 3 MINUTES ALL THE WAY HOME.  I WAS NOT IN A GOOD AREA TO STOP, SO I CONTINUED PUTTING IT INTO NEUTRAL AND THEN BACK INTO DRIVE.  WHEN I FINALLY ARRIVED AT A SAFE GAS STATION, I TURNED OFF THE IGNITION, WAITED ABOUT 5 MINUTES AND TURNED IT BACK ON.  I HAD ABOUT 5 MORE MINUTES TO GET HOME AND IT DID NOT REPEAT THE INCIDENT.  THE NEXT DAY A VALET PARKER BROUGHT ME MY CAR AND WHEN I WENT TO PUT IT INTO DRIVE FROM PARK, THE ENGINE RACED.  IF I HAD NOT HAD MY FOOT ON THE BRAKE, IT WOULD NOT HAVE BEEN GOOD.  I THEN CALLED THE DEALERSHIP AND THEY CAME AND GOT THE CAR.  *TR",
        "vin": "JN1CV6AR2AM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/31/2010",
        "dateOfIncident": "12/28/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373619,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT BELT GUIDES ON THE INFINITY G37 CONVERTIBLE DO NOT LATCH AS REQUIRED. PER PAGE 1-17 OF THE 2010 INFINITY G37 CONVERTIBLE OWNERS MANUAL, IF THIS SEAT BELT GUIDE IS NOT SECURELY INSTALLED THE SEAT BELT MAY SLIP AND RESULT IN PERSONAL INJURY.  I BELIEVE THIS IS A DESIGN FLAW THAT AFFECTS ALL 2010 INFINITY G37 CONVERTIBLES. THIS ISSUE HAS BEEN EXPOSED ON A NEWLY PURCHASED VEHICLE WITH LESS THAN 1000 MILES ON THE ODOMETER.  WHEN A REPAIR APPOINTMENT WAS MADE ON DECEMBER 28, 2010 FOR CORRECTION OF  THIS ISSUE THE SERVICE MANAGER AT WEST HOUSTON INFINITY IN HOUSTON, TEXAS NOTED THAT THIS SEAT BELT GUIDE IS A POOR DESIGN AND THIS ISSUE SURFACES ON ALL G37 CONVERTIBLES.  *TR",
        "vin": "JN1CV6FE0AM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "07/12/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347799,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 INFINITY G37. THE CONTACT WAS BRAKING FROM 25 MPH WHEN THE VEHICLE ABNORMALLY BEGAN TO SKID FORWARD. THERE WAS ALSO AN UNUSUAL GRINDING AND VIBRATION NOISE WHEN APPLYING THE BRAKES. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE AND ADVISED THAT THE FAILURE WAS NORMAL. THE MANUFACTURER ADVISED THE CONTACT THEY WOULD SPEAK WITH THE DEALER FIRST BEFORE A DECISION WAS MADE IF THEY WOULD BE WILING TO ASSIST. THE FAILURE AND CURRENT MILEAGES WERE  550.",
        "vin": "JN1CV6AP3AM"
    }
]