[
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/07/2022",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456358,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "RADIO ST 226",
                "productYear": "9999",
                "size": "SP235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2010 Jaguar XF equipped with Lionhart tires, Tire Line: Lionclaw, Tire Size: 245/35/ZR20, DOT Number: Not Available. The contact stated that while driving at approximately 80-84 MPH, the passenger's side rear tire had a blowout, causing the passenger side rear rim to crack. Additionally, the passenger's side front rim was cracked. There was no impact to the passenger's side front rim that could have caused it to crack. The contact was able to pull over and replace the passenger's side rear tire with a spare tire. The dealer was not made aware of the failure. The manufacturer was not made aware of the failure. The failure mileage was not available. VIN not available.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451246,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Jaguar XF. The contact received notification of NHTSA Campaign Number: 20V081000 (Fuel System, Gasoline) however, the part to do the recall repair was not yet available. The contact stated that while driving at an undisclosed speed, a fuel odor was detected. The dealer and Jaguar West Columbia (12500 New Car Dr, Clarksville, MD 21029) were made aware of the failure but informed the contact that parts were not yet available. The manufacturer was not made aware of the failure. The vehicle was not repaired. The failure mileage was approximately 104,000. Parts distribution disconnect.",
        "vin": "SAJWA0FA9AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448337,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Since purchasing this vehicle, I have noticed the smell of gasoline within the cabin of the vehicle. The smell becomes nauseating after a while. I have three small children who complain about the smell inside the cabin and I worry about their safety as well as their mother’s and mine. There have been recalls regarding this issue with this very vehicle, but for some reason mine is not included in the recall. I have called Jaguar USA and they say the vehicle’s VIN is not listed as one of the ones recalled.",
        "vin": "Sajwa0gb0al"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438540,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "My check engine light came on and car was sputtering and cutting off, I made it to a auto parts store . Looking under the hood they noticed the reservoir coolant tube had leaked and caused a hole in the air intake.",
        "vin": "Sajwa0he8am"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406893,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU SLOW DOWN, THE VEHICLE CUTS OFF COMPLETELY. WHEN YOU TURN THE CAR ON, IT'S ALMOST AS IF THE GAS IS NOT TRAVELING SOMEWHERE AND CAUSES IT TO TAKE A WHILE. HAVING IT CUT OFF ON THE HIGHWAY IS A VERY SCARY THING. I SEE RECALLS YET THEY'RE ACTING AS IF MY VEHICLE IS NOT AFFECTED BY IT.",
        "vin": "SAJWA0GB9AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373330,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 JAGUAR XF. CONSUMER IS SEEKING REIMBURSEMENT FOR REPAIRS DONE RELATED TO FUEL TANK OUTLET FLANGE SAFETY RECALL. *LD *JS",
        "vin": "SAJWA0FA1AH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364115,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "1. SPEED CONTROL (MOTION):  CRUISE CONTROL CONTINUALLY SHUTS OFF WHILE TRAVELING AT HIGHWAY SPEEDS AND HITS ROAD PATCHES/BUMPS.  THIS HAS HAPPENED SINCE I PURCHASED THE CAR NEW;  2. LEATHER ON DASHBOARD (STATIONARY & MOTION):  CAR IS GARAGED IN NY, METICULOUSLY MAINTAINED AND USED OCCASIONALLY, YET THE LEATHER ON THE DASHBOARD WARPED/RIPPLED -- NOT A GOOD LOOK FOR A JAGUAR;  RECENTLY, I SPENT ALMOST $ 1,000 FOR WINDSHIELD HAD TO BE REMOVED/REPLACED TO REPAIR.  NOW LOOKS WORN, THOUGH SIGNS OF WEAR REMAIN;  3. USB & COMMUNICATION COMPONENTS IN MIDDLE DASH DEPT (STATIONARY AND MOTION):  THESE SYSTEMS FAILED FEW WEEKS AFTER WARRANTY EXPIRED.  IN THESE DAYS, VERY IMPORTANT TO BE ABLE TO USE, BUT JAGUAR DEALER SAID VERY EXPENSIVE TO REPAIR.  4. SUNROOF GASKET (STATIONARY & MOTION):  GASKET STARTED FAILING FEW YEARS AGO, BUT FINALLY REACHED EXTENT REQUIRING REPLACEMENT.  MY PROFESSIONAL UPHOLSTERY REPAIR PROVIDER REPORTED THE REPAIR REQUIRED AN ENTIRE SUNROOF SYSTEM REPLACEMENT ($1,000), WHICH IS VERY NON-SENSIBLE.  THEY INSTALLED INCORRECTLY AND NOW SUNROOF WILL NOT CLOSE WHILE DRIVING, BUT RATHER EMITS LOUD \"FLUTTERING\" SOUND AND SHAKES THE VEHICLE;  5.  WINDOWS (MOTION):  AS YOU ARE AWARE I'M SURE, OPENING PARTIAL REAR WINDOWS INDUCES VIOLENT SHAKING THROUGHOUT VEHICLE.  THIS ISSUE PRESENT IN ORIGINAL DESIGN OF VEHICLE.  6.  RUNNING LIGHTS (MOTION):  THIS VEHICLE WAS DESIGNED WITH NO RUNNING LIGHTS, SO I TRIED TO FIND GARAGE TO INSTALL, FOR SAFETY REASONS. JAGUAR SERVICE REPAIR PROVIDERS AND OTHERS SAID VEHICLE DESIGN PROHIBITS ABILITY TO INSTALL RUNNING LIGHTS.  7. HORN (STATIONARY AND MOTION):  I'M SIMPLY POINTING TO FACT THAT THIS BEAUTIFUL CAR ROARS LIKE A LION, YET HAS WIMPY HORN SOUND!",
        "vin": "SAJWA0HEXAM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363422,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THERE WAS AN ABNORMAL ODOR OF FUEL DETECTED INSIDE AND OUTSIDE OF THE VEHICLE. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHCILE WAS TAKEN TO JAGUAR HONOLULU (888 KAPIOLANI BLVD, HONOLULU, HI 96813, (808) 592-5108) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FUEL FLANGE AND GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THE FAILURE WAS LIKE THE FAILURE LISTED IN NHTSA CAMPAIGN NUMBER: 20V081000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "SAJWA0HE9AM"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340414,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR STARTED UP I NOTICE THAT THE SCREEN ON THE STEREO SYSTEM WAS JUST FLASHING AND NEVER CAME ON ALSO THE CAR STARTED OVER HEATING AND CHECK ENGINE LIGHT CAME ON ALSO THERE IS HAS LEAKING FROM THE RIGHT REAR PASSENGER SIDE DOOR BELOW CAR IS IN THE SHOP NOW WITH $2,745 DOLLARS WORTH OF WORK BEING DONE TO IT",
        "vin": "SAJWA0FA9AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315771,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WHICH WAS STATIONARY BEGAN TO LEAK FUEL AFTER TRYING TO START THE CAR. THERE WAS NO LEAK PRIOR TO ATTEMPTING TO START THE CAR NOR WAS THERE ANY PHYSICAL DAMAGE OR COLLISION TO THE AREA.",
        "vin": "SAJWA0GB3AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308962,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT WHILE AT DRIVING 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND DRIVE BACK TO THE RESIDENCE. A DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "SAJWA0FA2AH"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288723,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE VEHICLE FROM VAN BUICK/GMC IN SCOTTSDALE, ARIZONA THEY ASSURED THAT THEY REPAIRED THE VEHICLE, ITS RECALLS, AND WINDSHIELD. UPON LEAVING THE DEALERSHIP, A COUPLE OF WEEKS LATER, THE SERVICE ENGINE LIGHT COMES ON AND THE CODES I RECEIVED FROM AUTOZONE REFLECT AIRBAG AND FUEL DELIVERY SYSTEM ERRORS. ALTHOUGH THE AIRBAG LIGHT IS NOT ON INSIDE OF THE CABIN, THE DASHBOARD IS STARTING TO LIFT ON THE PASSENGER SIDE WHERE THE AIRBAG IS. ALSO THE REAR SEAT CHILD SEAT ANCHORS DO NOT EXIST. THEY ARE NOT PRESENT IN THE VEHICLE AND I HAVE 2 SMALL CHILDREN I TRANSPORT DAILY. ALMOST DAILY, THE ENGINE WILL STALL OR LAG AND I CAN HEAR WHINING COMING FROM THE REAR PASSENGER BACK SEAT WHERE THE FUEL PUMP IS. I'M AFRAID THAT THE SMELL OF GASOLINE AND THAT SOUND MEANS I HAVE A FAULTY FUEL PUMP. IT STALLS WHEN RUNNING AND WHEN SITTING IDLE. IT'S WORSE AT AN IDLE. IT STALLS OR STUTTERS DAILY. I'M AFRAID THESE 3 THINGS WHICH I'VE SEEN ON RECALL LISTS RELATED TO THIS TYPE OF CAR WERE SEVERELY OVERLOOKED AND ARE A DANGER TO MYSELF AND MY CHILDREN.",
        "vin": "SAJWA0FA8AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256823,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A STRONG FUEL SMELL IN THE INTERIOR AND EXTERIOR OF MY VEHICLE, I REPLACED MY FUEL CAP BUT THE SMELL REMAINED, I THEN TAKEN MY VEHICLE TO MY LOCAL MECHANIC FOR A DIAGNOSTIC CHECK. THE RESULTS WERE A CRACKED/ LEAKING FUEL PUMP WHICH NEEDED REPLACING WHICH CAUSED ME TO MISS WORK BECAUSE OF NO TRANSPORTATION DUE TO VEHICLE BEING UNSAFE FOR TRAVEL.",
        "vin": "SAJWA0GB2AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256201,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING, THE ODOR OF FUEL WAS PRESENT INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DISCOVERED FUEL LEAKING FROM THE FUEL TANK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT NOTIFIED. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 97,000.",
        "vin": "SAJWA0GB3AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252042,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE OPERATING THE VEHICLE, THE ODOR OF FUEL WAS PRESENT INSIDE AND OUTSIDE THE VEHICLE. THE FAILURE WAS PRESENT WHILE THE FUEL TANK WAS LESS THAN HALF FULL. THE VEHICLE WAS TAKEN TO LAND ROVER OF SUDBURY(83 BOSTON POST RD, SUDBURY, MA) WHERE THE FAILURE WAS CONFIRMED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM), ALTHOUGH THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193073,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS LEAKING FUEL ON GROUND. I WAS PASSING SOMEONE AND NOTICED MY CAR WAS READING ON THE DASH LOSING PERFORMANCE.  THE MECHANIC SAYING EXACTLY WHAT THE RECALL IS SAYING BUT MY VIN DOESN'T FALL UNDER THE RECALL. ALSO MY DASHBOARD IS COMING UP.",
        "vin": "SAJWA0GB4AL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "04/25/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191595,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEELS ON A RANGE OF JAGUAR MODELS ARE PRONE TO THE RIMS CRACKING WHERE THE TIRE BEAD SEALS TO THE INNER LIP OF THE RIM. I HAVE HAD ALL (4) 20\"  SELENA STYLE OEM WHEELS CRACK MULTIPLE TIMES PER RIM. THIS ISSUE HAS BEEN REPORTED IN JAGUAR FORUMS BY MANY OTHER OWNERS AND THE SAME RIM HAS SAFETY RECALLS ASSOCIATED WITH IT BUT FOR SOME REASON DON'T COVER THIS MODEL EVEN THOUGH ITS THE SAME EXACT RIM. THE ALUMINUM ALLOY REACHES ITS FATIGUE LIMIT AS EARLY AS 40K MILES OF USE. ONCE CRACKS OCCUR, THE RIM WILL CONTINUE TO CRACK IN NEW LOCATIONS WITHOUT REQUIRING IMPACTING A POTHOLE OR OTHER OBSTRUCTION AS IS EVIDENT THAT NO DAMAGE HAS BEEN OBSERVED TO ANY OF THE TIRES DURING A RIM CRACK EVENT SUCH AS BUBBLES OR SIDEWALL DAMAGE. THE OWNER IS LEFT WITH ONLY ONE SOLUTION, BUY NEW OEM WHEELS AND HOPE TO SELL THE CAR BEFORE THE RIMS AGAIN REACH THEIR FATIGUE LIFE LIMIT. THIS MAY EITHER BE A POOR CHOICE OF ALLOY, MANUFACTURING DEFECT OR DESIGN DEFECT SUCH AS STRUCTURAL DESIGN OR TOO THIN OF A WALL THICKNESS OF THE RIM. THE 20\" SELENA STYLE OEM WHEELS APPEAR TO BE AFFECTED THE MOST BY THE ISSUE OF RANDOM RIM CRACKING. THIS IS UNRELATED TO THE CRACKING AROUND THE WHEEL STUD DUE TO IMPROPER LUG NUT TORQUE. THE REAR WHEELS (9.5\" WIDE) START CRACKING FIRST AROUND 50K MILES FOLLOWED LATER BY THE FRONT WHEELS (8.5\" WIDE). I HAVE EXPERIENCED FLAT TIRES DUE TO THE RIMS CRACKING ABOUT 10 TIMES IN TOTAL. I HAVE WORN OUT TWO SPARE TIRES BECAUSE OF THIS PROBLEM. THE CRACKS WILL MANIFEST AS A SLOW LEAK AND WILL PROGRESS TO A FASTER LEAK AS THE CRACK PROPAGATES FURTHER. WELDING THE CRACK IS NOT AN APPROPRIATE REPAIR OPTION AND SHOULD NOT BE CONSIDERED.",
        "vin": "SAJWA0HE8AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "06/17/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153138,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.DASH BOARD IS COMEING APART DUE TO BUBBLING CAR IS IN GARAGE YEAR ROUND. 2010 XF JAGUAR.",
        "vin": "SAJWA0GB9AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149589,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY JAGUAR USED AND NOTICED A FUEL SMELL AFTER DRIVING IT A COUPLE OF WEEKS.  THE DEALERSHIP REPLACED THE FUEL RAIL WHICH HAS NOT CORRECTED THE PROBLEM.  AFTER THE RAIL WAS REPLACED, I CONTINUED TO SMELL GAS AND NOTICED FUEL LEAKING UNDER THE REAR PASSENGER AREA OF MY CAR WHEN IT'S SITTING STATIONARY, AFTER BEING DRIVEN.  THE DEALERSHIP HAS AGREED IT'S DUE TO A FAULTY (PT# C2Z10550) FUEL TANK OUTLET FLANGE WHICH IS A KNOWN DEFECT/RECALL FOR THIS TYPE OF VEHICLE (J059), HOWEVER THE DEALERSHIP SAYS IT DOESN'T AFFECT MY VEHICLE AS IT WASN'T MANUFACTURED WHERE THE VEHICLE ISSUE ORIGINATED.  ALL RESOURCES I HAVE LOCATED SUGGEST MOST OF THE VEHICLES WERE ASSEMBLED IN BROMWICH UK, BUT NOT ALL.  I'M SURE MY ISSUE IS RELATED BECAUSE IT EXACTLY MATCHES THE ISSUE DESCRIBED IN THE RECALL AND I NEED HELP GETTING THIS FAULTY PART AND LABOR COVERED BY THE DEALERSHIP.  I HAVE ALREADY PAID THOUSANDS ON THE FUEL RAIL REPLACEMENT WHICH MUST NOT HAVE BEEN THE PROBLEM TO BEGIN WITH, SINCE THE SAME PROBLEM STILL EXISTS TODAY.  THIS IS A FIRE RISK AND SAFETY ISSUES THAT NEEDS ADDRESSED.",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145319,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT NOTICED FUEL FUMES COMING THROUGH THE AIR VENTS INSIDE THE VEHICLE. THE ODOR OF FUEL FUMES WAS VERY NOTICEABLE AFTER THE VEHICLE WAS PARKED. THE VEHICLE WAS TAKEN TO MICH'S FOREIGN CARS (1331 US-70, HICKORY, NC 28602, (828) 324-6012) WHERE THE DEALER STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL; THEREFORE, THE CONTACT WOULD HAVE TO PAY FOR THE REPAIRS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142957,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A FUEL OUTLET FLANGE CRACK IN THE FUEL TANK.  IT IS LEAKING GASOLINE FROM THE FUEL TANK.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "09/23/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139681,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT NOTICED AN ABNORMAL ODOR OF FUEL EMERGING IN AND OUT OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO JAGUAR HARTFORD (133 LEIBERT ROAD, HARTFORD, CT 06120, 877-217-5556) WHERE IT WAS DIAGNOSED THAT THE FUEL LINE WAS CRACKED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 8000573452. THE CONTACT STATED THAT THE FAILURE WAS SIMILAR TO NHTSA CAMPAIGN NUMBERS: 12V521000 (FUEL SYSTEM, GASOLINE) AND 16V187000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 109,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118866,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COMING TO A STOP ON A CITY STEET, FUMES FROM FUEL COULD BE SMELLED IN THE CAR.  AFTER PARKING, THE CAR IN A GARAGE, THE GARAGE WOULD SMELL LIKE FUEL.  THE FUEL TANK FLANG WILL CRACK WHERE THE FUEL LINE CONNECTS.  ALLOWING FUEL TO GET ONTO THE EXHAUST AND FUMES INSIDE THE CAR.",
        "vin": "SAJWA0FA6AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115278,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING 15-20 MPH, THE VEHICLE STALLED AND WAS UNABLE TO BE RESTARTED. THE VEHICLE WAS TOWED TO JAGUAR FREEPORT (146 W SUNRISE HWY, FREEPORT, NY 11520, (516) 771-9700) WHERE IT WAS DIAGNOSED THAT THE FUEL SYSTEM AND THE EVAPORATOR SYSTEM NEEDED TO BE REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V424000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 87,000.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114463,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK ON TOP OF FUEL PUMP, CAUSING FUEL TO LEAK. NOTICE THE SMELL OF GAS AFTER RETURNING TO GARAGE WHERE VEHICLE WAS PARKED.",
        "vin": "SAJWA0FA1AH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/04/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112214,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING APPROXIMATELY 25 MPH, THE CHECK ENGINE INDICATOR SUDDENLY ILLUMINATED AND THE VEHICLE TURNED OFF. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (JAGUAR OF FREEPORT, 146 W. SUNRISE HWY, FREEPORT, NY) WHERE IT WAS DIAGNOSED THAT THE AIR INJECTION PUMP WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED THREE DAYS LATER. THE VEHICLE WAS TOWED BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO A FUEL LEAK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104523,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING VARIOUS SPEEDS, A FUEL ODOR ENTERED THE VEHICLE. THE CONTACT NOTICED FUEL LEAKING UNDER THE CHILD SAFETY SEAT. THE CONTACT CALLED AN UNKNOWN JAGUAR DEALER IN DALLAS, TEXAS, BUT THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THEY INFORMED THE CONTACT THAT THE FUEL FLANGE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM, GASOLINE). THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082051,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT NOTICED AN ABNORMAL FUEL ODOR WHILE DRIVING VARIOUS SPEEDS. UPON INSPECTION, THE CONTACT NOTICED THAT THE VEHICLE WAS LEAKING FUEL. JAGUAR JACKSONVILLE (11211 ATLANTIC BLVD, JACKSONVILLE, FL) DIAGNOSED THAT THE FUEL FLANGE WAS FRACTURED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST SINCE THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057907,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING VARIOUS SPEEDS, A FUEL ODOR WAS DETECTED IN THE CABIN. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH A LEAK IN THE FUEL TANK THAT NEEDED REPLACEMENT. THE MECHANIC STATED THAT THE VEHICLE WAS UNSAFE TO DRIVE DUE TO THE FUEL LEAK. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RESEARCHED THE FAILURE ON THE JAGUAR WEBSITE AND FOUND NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM, GASOLINE), BUT THE VIN WAS NOT INCLUDED. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 94,000.",
        "vin": "SAJWA0FA3AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/16/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055587,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE THE VEHICLE WAS PARKED, THERE WAS A STRONG FUEL ODOR IN THE GARAGE, THE CONTACT MOVED THE VEHICLE OUT OF THE GARAGE AND NOTICED A PUDDLE OF FUEL UNDERNEATH THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP FLANGE CRACKED AND CAUSED FUEL TO LEAK OUT. THE FLANGE NEEDED TO BE REPLACED. THE CONTACT LATER TOOK THE VEHICLE TO ROSENTHAL JAGUAR (1592 SPRING HILL RD, VIENNA, VA 22182, PHONE: (866) 969-7267) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP FLANGE CRACKED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 69,809.",
        "vin": "SAJWA0FA7AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040621,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT AN ODOR OF FUEL EMITTED INTO THE VEHICLE. THE CONTACT NOTICED FUEL LEAKING FROM THE REAR PASSENGER SIDE OF THE FUEL TANK. THE CONTACT REMOVED THE REAR SEAT AND NOTICED THAT THE OUTLET FLANGE WAS CRACKED AND CAUSED THE FUEL TO LEAK OUT. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 96,820.",
        "vin": "SAJWA0FA2AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011825,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A RECALL ON MY 2010 JAGUAR XF (VIN# [XXX]) FOR TAKATA AIRBAG REPLACEMENT (PROGRAM CODE: J069). WHEN I CALLED THE HONOLULU JAGUAR DEALER THEY INDICATED THAT I WOULD NEED TO PAY THE SHIPPING COST FROM MY HOME ON THE ISLAND OF HAWAII TO THE ISLAND OF OAHU WHERE THE CLOSEST JAGUAR DEALER IS LOCATED. THAT COST WOULD BE ABOUT $600.00.     HAVING MY CAR REPAIRED IS IMPORTANT FOR THE SAFETY OF MY FAMILY. THE LETTER SENT BY THE DEALER INITIALLY INDICATED THAT REPAIR WOULD BE WITHOUT CHARGE. DO I HAVE ANY RECOURSE OR CAN THE NHTSA HELP ME ON THIS ISSUE?    [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SAJWA0GB8AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006172,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SMELLS LIKE GASOLINE WHILE STATIONARY AND IN MOTION.  VEHICLE HESITATES TO START AND THEN FINALLY STARTS. CHECK ENGINE LIGHT WILL STAY ON FOR A SECOND OR TWO THEN GO OUT.   TOOK VEHICLE TO TWO INDEPENDENT SERVICE PLACES AND THEY VERIFIED THAT THE FUEL IS LEAKING FROM THE OUTLET FLANGE SIMILAR TO THE RECALL ON 2010 JAGUAR XF VEHICLES.",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "05/06/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003092,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS LESS THAN 59K MILES AND THE CHECK ENGINE LIGHT IS ON.  I WAS TOLD THE CAR IS RUNNING TOO COOL.  THERE IS AN ISSUE WITH THE COOLANT SYSTEM, FUEL SYSTEM ETC.  THE CAR DRIVES FINE HOWEVER, THE DEALERSHIP NEEDS TO REPLACE HOSES, HOUSINGS, ETC.  TO THE TUNE OF $1382  I HAVE NEVER HEARD OF A CAR RUNNING TOO COOL..  THIS IS A MANUFACTURING ISSUE.  ALSO, THE HEADLINER ATTACHED TO THE SUNROOF HAS FALLED DUE TO HEAT AND I UNDERSTAND THIS IS A COMMON PROBLEM WITH THESE JAGUARS.",
        "vin": "SAJWA0FA4AH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002138,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEATHER DASH(WHY, IN HOT CARS?) HAS CRUMBLED AND COME APART FROM THE DASH ITSELF. IT STARTED OFF WITH A LITTLE CRUMBLING AND SEPARATION. NOW IT'S MUCH WORSE.THIS TENDS TO FLAP UP AND DOWN IF DRIVING WITH THE WINDOWS DOWN. THIS IS A SAFETY CONCERN I HAVE WITH VISIBILITY. ALSO, THE DOME VANITY LIGHTS COME ON AND OFF BY THEMSELVES IN MOTION AND WHEN THE VEHICLE IS STATIONARY. I WAS TOLD THE CARBON PAD KIT BY THE DEALERSHIP DUE TO THE WIRING HAS SHORTED OUT. ALSO, THE ENGINE CONTROL MODULE SHORTED OUT. THIS IS BEYOND ME HOW THE COMPUTER SHORTED OUT IN A CAR THAT'S ONLY 7 YEARS OLD.",
        "vin": "SAJWA0GB3AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000867,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACTED OBSERVED FUEL LEAKING FROM THE FUEL TANK OF THE REAR PASSENGER SIDE WHILE FUELING THE VEHICLE. IN ADDITION, THE CONTACT STATED THAT THE CHECK ENGINE INDICATOR AND FILLER CAP WARNING SENSOR WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (LAND ROVER OF HOFFMAN LOCATED ON 1051 W HIGGINS RD, HOFFMAN ESTATES, IL, 60169) AND WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL FOR THE FUEL. THE VEHICLE WAS NOT DIAGNOSED DUE TO THE DIAGNOSTIC FEES. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000.",
        "vin": "SAJWA0GB5AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994494,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE THE VEHICLE WAS PARKED, THE ODOR OF FUEL WAS PRESENT INSIDE THE GARAGE AND A FUEL STAIN WAS DISCOVERED ON THE FLOOR OF THE GARAGE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT FUEL WAS LEAKING FROM THE SEAMS OF THE FUEL TANK AND THE TANK WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE  BUT NO ASSISTANCE WAS OFFERED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 50,000. UPDATED 08/08/17*LJ    THE CONSUMER STATED IT WAS DETERMINED THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND NO FURTHER ACTION IS NECESSARY. *JS",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993021,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I WASN'T NOTIFIED BY JAGUAR OF THE RECALL FOR PASSENGER SIDE AIRBAG. I CHECKED THE NHTSA DATABASE AND WAS MADE AWARE OF IT. AFTER TAKING MY 2010 XF TO THE NEAREST JAG DEALERSHIP, THEY CHECKED THE RECALL DATABASE AND TOLD ME THAT MY CAR IS ONE OF THE RECALLED VEHICLES. BUT THEY DID NOT REPLACE MY AIRBAG AND IT HAS BEEN 5 MONTHS AND I STILL HAVEN'T HEARD FROM JAGUAR ABOUT BRINGING MY CAR BACK TO BE FIXED.",
        "vin": "SAJWA0GB0AL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981108,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD HAS CAME APART DUE TO BUCKLING/BUBBLING. CAR SET INSIDE A GARAGE YEAR ROUND AND AFTER RESEARCH I WAS MADE AWARE THIS AS BEEN A KNOW FACTOR IN THOSE TYPE OF VEHICLE DUE TO  MANUFACTURING.",
        "vin": "SAJWA0GB1AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "05/26/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972297,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR.  THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "SAJWA0GB3AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "04/06/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972021,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT FUEL WAS LEAKING FROM THE VEHICLE. THE CONTACT ALSO STATED THAT A CONSTANT FUEL ODOR WAS PRESENT INSIDE AND OUTSIDE THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 86,000.",
        "vin": "SAJWA0FA2AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966270,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS) HOWEVER, THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATE 06/07/17*LJ   UPDATED 07/12/2017*JS",
        "vin": "SAJWA0GB1AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2017",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959101,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "SAJWA0GB9AL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "05/26/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957696,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "SAJWA05B89H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936090,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LEAKING ONTO GROUND",
        "vin": "SAJWAOFA3AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934750,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE THE VEHICLE WAS PARKED IN THE GARAGE, A STRONG ODOR OF FUEL WAS NOTICED OUTSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL TANK FUEL OUTLET FLANGES FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 54,000.",
        "vin": "SAJWA0HE9AM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930054,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE THE VEHICLE WAS PARKED, THE CONTACT DETECTED A FOUL ODOR COMING FROM THE VEHICLE. THE CONTACT STATED THAT FUEL LEAKED FROM THE FUEL TANK UNDERNEATH THE VEHICLE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 61,376.",
        "vin": "SAJWA0FA5AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930059,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL MY VEHICLE IS EXPERIENCING FUEL LEAKING ON THE GROUND UNDERNEATH THE REAR OF THE VEHICLE ALSO A FUEL ODOR.",
        "vin": "SAJWA0FA5AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925764,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 01/23/2017*CT   CONSUMER STATED THE DEALER HAS NOT BEEN ABLE TO GET PARTS, DUE TO MANUFACTERER. UPDATED 7/5/18*JB",
        "vin": "SAJWA0FA6AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920567,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THERE WAS AN ABNORMAL FUEL ODOR EMITTING FROM THE REAR OF THE VEHICLE. THE CONTACT STATED THAT THERE WAS ALSO EVIDENCE OF A FUEL SPILL UNDERNEATH THE REAR OF THE VEHICLE. THE DEALER DIAGNOSED THAT THE FUEL OUTLET FLANGE FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "SAJWA0FA6AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908138,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT A FUEL ODOR EMITTED FROM THE VEHICLE AFTER IT WAS PARKED. THE CONTACT INSPECTED THE VEHICLE AND DISCOVERED THAT THE FUEL WAS LEAKING FROM THE REAR OF THE VEHICLE NEAR THE FUEL TANK. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN STATED THAT THE EXHAUST AND FUEL TANK NEEDED TO BE LOWERED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBERS: 16V817000 (FUEL SYSTEM, GASOLINE) AND 12V521000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 69,000.",
        "vin": "SAJWA0FA8AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905740,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECIEVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "SAJWA0FA2AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905741,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE VEHICLE WAS EMITTING A FUEL ODOR. THE CONTACT TOOK THE VEHICLE TO DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS A HAIRLINE FRACTURE IN THE FUEL TANK OUTLET FLANGE, WHICH NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE DEALER STATED THAT THE FAILURE WAS DIRECTLY RELATED TO NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM, GASOLINE), WHICH INCLUDES VEHICLE'S WITH THE SAME YEAR, MAKE, MODEL, AND 5.0L GASOLINE ENGINE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.",
        "vin": "SAJWA0FA2AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903220,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  JAGUAR CALLED ME AND ARE UNWILLING TO DO ANYMORE THAN TO TELL ME TO DRIVE THE CAR--EVEN WITH THE DEFECT.  I CANNOT ACCEPT THE RESPONSIBILITY OF DRIVING THE CAR WITH MY FAMILY IN IT, KNOWING IT HAS A DEFECT THAT \"COULD CAUSE SERIOUS INJURY OR DEATH\".  JAGUAR UNWILLING TO ACCEPT RESPONSIBILITY AND PROVIDE A SAFE REPLACEMENT.  I HAVE NO USE OF MY CAR. NOW UNWILLING TO RETURN CALLS.",
        "vin": "SAJWA0GB0AL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899356,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY STOP ACCELERATING IN THE MIDDLE OF THE FREEWAY. I HAD TO PULL TO THE SIDE WICH WAS HARD SINCE POWER STEERING AND EVERYTHING WAS NOT WORKING SINCE ENGINE SEEM TO SHUT OFF. ENDED UP FIGURING OUT THAT IT HAD RAN OUT OF FUEL BUT GAS GAUGE SHOWED AROUND 1/4 LEFT AND NO FUEL LOW WARNING EVER SHOWED.",
        "vin": "SAJWA0GB0AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897059,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THERE WAS A ODOR OF FUEL PRESENT INSIDE THE GARAGE WHERE THE VEHICLE WAS PARKED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FLANGE CONNECTED TO THE FUEL TANK HAD CRACKED CAUSING FUEL TO LEAK OUT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 88,000.  UPDATED 12/20/16*LJ",
        "vin": "SAJWA0FA4AH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894102,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "SAJWA0HEXAM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894149,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL     I HAVE BEEN INFORMED BY MAIL THAT MY VEHICLE IS IN THE AIRBAG RECALL. HOWEVER, I NO IDEA WHEN THE CAR WILL BE MADE SAFE AND I WOULD LIKE TO SELL IN A FEW MONTHS BUT WILL NOT WITH THIS AIRBAG ISSUE AS THIS DEFECT REDUCES THE CARS VALUE. .",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "05/27/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894177,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V373000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887524,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE THE VEHICLE WAS UNDERGOING MAINTENANCE, THE TECHNICIAN STATED THAT FUEL LEAKED ALL OVER THE UNDERCARRIAGE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V187000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 31,338.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884786,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS LEAKING FUEL & AFTER DOING MY RESEARCH I FOUND OUT THAT THERE WAS A RECALL FOR THE FUEL SYSTEM. SO I CALLED LAND ROVER JAGUAR OF ATLANTA AND THEY SAID THAT THIS VIN WAS NOT ON THE RECALL LIST SO THEY ARE NOT RESPONSIBLE FOR THE REPLACEMENT. ITS CRAZY BECAUSE IT WAS BUILT IN THE UK AT THE SAME TIME THE OF THE CARS THAT ARE ON RECALL. 2010 JAGUAR XF. CRAZY LUCKILY I JUST PURCHASED THE CAR FROM AN AUCTION & I CAN TAKE IT BACK. AND ALL I LOST WAS THE $350 FOR MY OPTION TO TAKE IT BACK IF IT DOESN'T RUN PROPERLY.",
        "vin": "SAJWA0FA6AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876581,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 24, 2016 AT 9:20 P.M., WHILE DRIVING THE VEHICLE ON THE STREET , I SMELLED STRONG FUEL ODOR IN THE CABIN. I STOPPED THE CAR AND CAN SMELL FUEL ODOR OUTSIDE THE VEHICLE AS WELL. I DROVE IT BACK HOME AND PARKED THE VEHICLE.CONTACTED JAGUAR SAN DIEGO SATURDAY 6/25/16 AND INFORMED THEM OF THE PROBLEM. ADVISED TO TOW VEHICLE TO THERE LOCATION ON CONVOY STREET. SERVICE DEPARTMENT WILL INVESTIGATE ON MONDAY. THE MILEAGE ONCE PARKED IS 70130 MILES.",
        "vin": "SAJWA0FA3HR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852823,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEATHER DASHBOARD ON MY 2010 JAGUAR XF HAS BEGUN TO SEPARATE FROM ITS BASE. THIS CAUSES PARTIAL OBSTRUCTION AND VISIBILITY OF THE FRONT WINDSHIELD. DUE TO RIPPLES AND BULGES NOW APPARENT IN THE LEATHER THE DASH IS NO LONGER ABLE TO ABSORB LIGHT PROPERLY RESULTING IN LARGE AMOUNTS OF GLARE MAKING DRIVING DANGEROUS, ESPECIALLY ON SUNNY DAYS.    MY VEHICLE IS STORED IN THE GARAGE AND NOT DRIVEN DURING WINTER MONTHS. ALTHOUGH IT IS 2010 IT ONLY HAS 15000 MILES ON IT.    THE BULGES AND RIPPLES ON THE TOP OF THE DASHBOARD ARE A RESULT OF DEFECTS IN THE BONDING AGENT USED BY JAGUAR. THEY ACKNOWLEDGE THAT THIS IS A PROBLEM AT THE DEALER. JAGUAR CANADA HAS OFFERED TO PAY FOR 50% OF THE COST TO REPLACE THE DASHBOARD INDICATING THEY TOO KNOW THIS IS A PROBLEM. JAGUAR SHOULD BE ASKED TO RECALL ALL VEHICLES WITH WITH THIS ISSUE AND REPLACE THE DASH AT NO COST TO THE OWNER.",
        "vin": "SAJXA0GBXAL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789474,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE ODOR OF FUEL WAS PRESENT INSIDE AND OUTSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE FUEL TANK OUTLET FLANGE WAS CRACKED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "SAJWA0FA3AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "10/20/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783829,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE FUEL TANK WAS LEAKING FUEL UNDER THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ATTACHED SHUTTER PLASTIC ASSEMBLY CRACKED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 62,000.",
        "vin": "SAJWA0FA1AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763180,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING STATIC FOR A NUMBER OF HOURS THE FUEL TANK LEAKS FUEL.  THIS PROBLEM IS ON THE 2010 4.2 LITER ENGINE XF MODEL.  EVERY MORNING I NOTICED A SMALL PUDDLE OF FUEL UNDER THE PASSENGER SIDE NEAR THE REAR TIRE.  ADDITIONALLY, WHEN TRYING TO START THE VEHICLE THE ENGINE STRUGGLES TO START (AS IF NOT GETTING ENOUGH FUEL).  AFTER LIFTING THE VEHICLE UP FUEL CAN BE SEEN COMING FROM THE TOP OF THE TANK.",
        "vin": "SAJWA0FA8AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/10/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745695,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THERE WAS A FUEL LEAKAGE ON THE FUEL TANK ON THE REAR PASSENGER SIDE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.",
        "vin": "SAJWA0GB9AL"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/09/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722365,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN INTERSTATE AND LIGHT CAME ON SAYING COOLANT LOW, AIR CONDITIONER WAS STILL BLOWING COLD, BUT I TURNED OFF AIR, MAYBE 3 MINUTES LATER, LOSS ACCELERATION POWER, BLACK SMOKE BILLOWING OUT OF PIPES AND UNDER HOOD AND LIGHT CAME ON SAYING LOW PERFORMANCE TURN ENGINE OFF.  IMMEDIATELY PULLED CAR ON SIDE OF HIGHWAY. NO WARNING CAR WAS RUNNING HOT. CAR WAS DISABLED WOULD NOT START LATER AND COMPUTER READING STILL REGISTERED COOL.  GAS WAS SMELLING ALL THOUGH THE CAR AND PROCEEDED TO LEAK FROM UNDER CAR AFTER TOWED AWAY. AT THE DEALERSHIP, THE CAR HAD GAS LEAKING UNDER IT ON THE GROUND WHEN I WENT TO RETRIEVE ITEMS OUT OF CAR.  DEALERSHIP SAID IT WOULD COST 36,000. PLUS TO FIX. CAR IS STILL SITTING AT DEALERSHIP WITH NO SOLUTION. I FELT WE WERE FORTUNATE TO GET OUT OF CAR ALIVE BECAUSE I FELT IT COULD HAVE EXPLODED. DEALERSHIP SAYS IT WAS WATER PUMP, BUT ENGINE WAS NEVER TORN DOWN TO DETERMINE THAT.",
        "vin": "SAJWA0GB6AL"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2015",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715483,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING OUT OF A PARKING LOT INTO ONCOMING TRAFFIC, CAR WAS DRIVING FINE THEN ALL OF A SUDDEN IT SNAPPED INTO RESTRICTED PERFORMANCE MODE, SLOWED MY CAR DOWN TO 15MPH ON A BUSY STREET, AND ALMOST GOT HIT BY OTHER CARS DUE TO MY SUDDEN DECLINE IN SPEED. TOOK THE CAR BACK TO THE DEALERSHIP FOR ASSESSMENT AND THEIR RECOMMENDATION IS TO REPLACE THE ENGINE FOR $32,000.00. I BOUGHT THE CAR FOR $26,000.00 IN JANUARY 2014 FROM GALPIN HONDA IN MISSION HILLS AND I CURRENTLY OWE $24,000.00 ON IT. I JUST DON'T SEE HOW THIS COULD BE RIGHT.",
        "vin": "SAJWA0GB9AL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695394,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE ENGINE PERFORMANCE FAILURE WARNING INDICATOR ILLUMINATED AND THE VEHICLE BEGAN TO DECELERATE. THE VEHICLE STALLED AND WOULD NOT RESTART. THE VEHICLE WAS TOWED TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT ALL EIGHT FUEL INJECTORS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 59,236.",
        "vin": "SAJWA0GB4AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2015",
        "dateOfIncident": "02/17/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690993,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ENGINE LIGHT CAME ON AND WHITE SMOKE CAME OUT FROM UNDER THE HOOD OF THE VEHICLE.  THE SMELL OF ENGINE COOLANT WAS INSIDE THE VEHICLE.  THE VEHICLE WAS BROUGHT TO THE DEALERSHIP WHERE THEY DIAGNOSED A WATER PUMP FAILURE.  FROM INFORMATION WE GATHERED, THIS IS A COMMON ISSUE FOR THIS VEHICLE WHICH THE MANUFACTURER IS AWARE AND HAS DONE MAY REPLACEMENTS WITH A REDESIGNED PART.  THE POOR DESIGN AND QUALITY OF THIS PART CAUSES CATASTROPHIC ENGINE FAILURE.  WHILE JAGUAR NORTH AMERICA HAS RELEASED SEVERAL TECHNICAL SERVICE BULLETINS OF THIS ISSUE, THEY HAVE FAILED TO ADDRESS THE ISSUE ON ALL AFFECTED VEHICLES.    DATE: 06-01-2013 TSB#TT002-13 KEEPING THE COOLING SYSTEM FREE OF DEBRIS AND CORROSION TO PREVENT PREMATURE WATER PUMP FAILURE    DATE: DEC 2012 TSB#JTB00278 COOLING SYSTEM - WATER PUMP LEAK    HTTP://WWW.CBC.CA/NEWS/CANADA/BMW-S-MINI-COOPERS-LABELLED-JUNK-AS-OWNER-HIT-WITH-10K-ENGINE-REPAIRS-1.2948855",
        "vin": "SAJWA0JC3AM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661562,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE ODOR OF FUEL WAS PRESENT INSIDE AND OUTSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL ODOR WAS PRESENT DUE TO A CRACK IN THE FUEL TANK OUTLET FLANGE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT NOTIFIED BOTH THE DEALER AND THE MANUFACTURER IN REFERENCE TO THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM). THE CONTACT INDICATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 66,000.",
        "vin": "SAJWAOFA2AH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660697,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO I JUST BOUGHT A CAR RECENTLY AND IT IS A 2010 JAGUAR XF BUILT IN JUNE 2009. AS I DROVE IT OFF THE LOT I HAD A PROBLEM WITH THE CAR AND REALIZED RECENTLY THAT IT IS A POWER STEERING PROBLEM. I SEARCHED ONLINE FOR ANY RECALLS AND THERE WAS A RECALL FOR ANY VEHICLES MADE IN JUNE 2009 AND MY CAR WAS MADE IN JUNE 2009. IT DOES NOT SAY IN THE JAGUAR SYSTEM THAT MY SPECIFIC VEHICLE WAS RECALLED. HOWEVER I FEEL THAT MY VEHICLE SHOULD HAVE BEEN RECALLED AS IT WAS SOMETHING THAT MAY HAVE BEEN MISSED. I FIND IT VERY COINCIDENTAL THAT MY VEHICLE IS HAVING AN EXACT SAME PROBLEM AS THE ONE THAT WAS RECALLED AND THE RECALL DATE IS FOR THE DATE THAT MY VEHICLE WAS BUILT. I HAVEN'T DRIVEN THE VEHICLE SINCE I BOUGHT IT BECAUSE IT IS A SAFETY ISSUE AND I WILL BE TOWING IT INTO A DEALERSHIP SHOP TOMORROW. AND REGARDLESS OF IF IT IS A MAJOR PROBLEM OR A MINOR PROBLEM, ITS A SAME PROBLEM AS THE ONES THAT WERE RECALLED. IT SAID POSSIBILITIES OF NOT GETTING THIS FIXED IS FIRE UNDER THE HOOD AND I DEFINITELY DON'T WANT THAT NOR FOR ANY OTHER JAGUAR XF 2010 DRIVERS OUT THERE. THIS IS THE RECALL NUMBER I FOUND ONLINE: 11V168000. PLEASE HELP ME RESOLVE THIS ISSUE AND TO MAKE SURE THAT IT GETS RECALLED AND THAT THE SAFETY OF MY CAR IS RIGHT AND UP TO DATE!     VERY RESPECTFULLY,     //SIGNED//  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SAJWA0FA8AH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659664,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE VEHICLE WAS TAKEN TO THE DEALER TO BE REPAIRED ACCORDING TO NHTSA CAMPAIGN NUMBER: 12V521000 (FUEL SYSTEM, GASOLINE). ONCE THE CONTACT ARRIVED AT THE DEALER, HE WAS INFORMED THAT THE REPAIR HAD ALREADY BEEN COMPLETED. THE CONTACT WAS EXPERIENCING THE SAME FAILURES LISTED IN THE RECALL. WHILE INSIDE THE VEHICLE, THE CONTACT WOULD SMELL A FUEL ODOR AND NOTICED FUEL LEAKING FROM THE VEHICLE ONTO THE DRIVEWAY. WHILE DRIVING APPROXIMATELY 55 MPH, THE ENGINE SEIZED. THE VEHICLE WAS ABLE TO BE RESTARTED. THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 67,543.",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "06/27/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627191,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 JAGUAR XF.  THE CONTACT STATED THAT THEN EXITING THE VEHICLE, THERE WAS A STRONG ODOR OF GASOLINE FUEL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL TANK FUEL OUTLET FLANGES WERE FRACTURED AND NEEDED TO BE REPLACED.  THE DEALER HAD ALSO INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN 12V521000 (FUEL SYSTEM, GASOLINE).THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "SAJWA0FA0AH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559688,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING AT THE TRAFFIC LIGHT WHEN THE CAR JUST SWITCHED OFF, NO WARNING SIGNS IT JUST SHUT DOWN AS IF IT WAS TURNED OFF. A MESSAGE APPEARED ON THE DASH TO PRESS THE BRAKES AND BUTTON TO RESTART. I PRESSED THE START BUTTON AND IT STARTED UP FINE, THIS HAD HAPPEN 3 TIMES IN THE LAST 30 DAYS, THE 2ND TIME I WAS DRIVING 40MPH AND THE LATEST 12 JAN 2014 AT A STOP LIGHT. I HAVEN'T TAKEN IT TO A DEALERSHIP AS OF YET. I AM NOT REALLY SURE WHAT TOO DO. I'M  CONCERNED THAT I MIGHT NOT BE IN SUCH A CONVENIENT PLACE THE NEXT TIME THIS HAPPENS.   WHAT WOULD IT TAKE TO INITIATE A RECALL FOR THIS.  *TR",
        "vin": "SAJWA0GB1AL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2013",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549004,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AT 70 MILES AN HOUR WHEN THE CAR JUST SWITCHED OFF, NO WARNING SIGNS IT JUST SHUT DOWN AS IF IT WAS TURNED OFF.I WAS ABLE TO STEER THE CAR ONTO THE HARD SHOULDER AND STOP SAFELY. I PRESSED THE START BUTTON AND IT STARTED UP FINE, THIS HAD HAPPENED TO ME BEFORE AT A STOP LIGHT MONTHS BEFORE.   I TOOK IT TO THE DEALERSHIP WHERE THEY HAVE HAD IT FOR OVER A WEEK. IT SHOWS AN INTERRUPTION ON THE COMPUTER BUT THEY CAN'T DUPLICATE THE PROBLEM AND THEY ARE GIVING IT BACK TO ME TOMORROW AS IS. MY WIFE NOW IS AFRAID TO DRIVE THE CAR AND I'M ALSO CONCERNED THAT I MIGHT NOT BE IN SUCH A CONVENIENT PLACE TO PULL OVER NEXT TIME IF IT HAPPENS AGAIN.  *TR",
        "vin": "SAJWAOFA5AH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2013",
        "dateOfIncident": "05/24/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519937,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWING TO A STOP IN A PARKING SPACE WHEN THE PEDAL WENT TO THE FLOOR &  THE CAR JUMPED THE CURB, HIT THE BUSHES & BUMPED INTO THE DAY CARE BUILDING.    FRONT BUMPER RIPPED OFF WHEN BACKING UP.  *TR",
        "vin": "SAJWA0FA4AH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2012",
        "dateOfIncident": "01/11/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482353,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING.  THE CONTACT STATED THAT THE VEHICLE WAS SERVICED UNDER NHTSA RECALL CAMPAIGN ID NUMBER: 09V424000) FUEL SYSYEM: GASOLIONE DELIVERY, BUT THE REPAIR DID NOT CORRECT THE FAILURE. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN, BUT THE CURRENT MILEAGE WAS 43,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/31/2011",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433688,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. THE CONTACT STATED THAT THE VEHICLE STALLED NUMEROUS TIMES WHILE DRIVING AT ANY SPEED. THE LIGHTS ON THE INSTRUMENTAL PANEL ILLUMINATED PRIOR TO THE VEHICLE STALLING. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES FOR THE FAILURE WHERE THE DEALER PERFORMED A DIAGNOSTIC THAT LOCATED THE FAILURE AT THE FUEL SYSTEM. THE DEALER ALSO TEST DROVE THE VEHICLE, BUT WAS UNABLE TO DUPLICATE THE FAILURE. THE DEALER REPLACED THE FUEL LINES AND THE FUEL HOSE, BUT THE FAILURE WAS NOT CORRECTED. THE VEHICLE CONTINUED TO STALL WHEN DRIVING AT ANY SPEED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 30,000 AND THE CURRENT MILEAGE WAS 39,562.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2011",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406035,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CAR COMPLETELY SHUT DOWN. I PULLED OVER TO THE SIDE OF THE ROAD. CAR RESTARTED AFTER A FEW MINUTES. TAKEN TO REPAIR AND THEY SAID NOTHING WAS WRONG WITH IT. THREE OTHER TIMES, WHEN USING BLUETOOTH PHONE CONNECTION, THE ELECTRICAL SYSTEM SHUT DOWN AND WENT BLACK. IT RESTARTED AFTER A FEW MINUTES AS WELL. JAGUAR SAYS NOTHING IS WRONG... VERY SCARY...  *TR",
        "vin": "SAJWA0GB5AL"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402816,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2010",
        "dateOfIncident": "04/17/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370940,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS, THEN CHECK  ENGINE LIGHT APPEARS. SOON AFTER I BROUGHT MY 2010 JAGUAR XF MAYBE 45 DAYS LATER THE CHECK ENGINE LIGHT CAME ON. I TOOK IT TO THE DEALER ALL THEY DID WAS CLEARED THE LIGHT. TWO MONTHS LATER IT WOULD NOT START AFTER TRYING SEVERAL TIMES. I CALLED THE DEALER WHO WAS NO HELP. A FEW HOURS LATER IT JUST STARTED. EVERY FEW MONTHS A HAVE ENGINE TROUBLE EITHER IT RIDES ROUGH, STALLS OR DOESN'T START. SOMETHING NEED TO BE DONE ASAP THIS IS VERY DANGEROUS. *TR",
        "vin": "SAJWA0FAXAH"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370508,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "JAGUAR 2010 XF.  BOUGHT THE CAR IN EARLY OCT, 2009. IN OCTOBER AND NOVEMBER OF THIS YEAR THERE WERE 3 OCCURRENCES WHEREBY THE CAR 'S TRANSMISSION FAILED TO GO INTO NEUTRAL AFTER THE BRAKES WERE APPLIED TO COME TO A STOP. IN EACH INSTANCE THE STOPPING ACTION OCCURRED FOLLOWING A LOW SPEED TRAVEL : 1ST PARKING INTO A  CHURCH PARKING SPACE, 2ND COMING TO A STOP IN BUMPER TO BUMPER TRAFFIC ON RTE 90 NEAR OAK PARK, ILL. AND LAST, AND MOST FRIGHTENING SLIPPING INTO A PARKING SPACE ON THE 7TH. LEVEL OF THE PARKING GARAGE FACING MARSHALL FIELD IN DOWNTOWN ,CHICAGO. IN THIS LAST SITUATION  THE REAR WHEELS SPUN AND  SCREECHED WHILE I WAS PRESSING THE BRAKE PEDAL AS FIERCELY AS I COULD. I CAME TO JUST A FEW INCHES OF THE RETAINING WALL. I TOOK THE CAR TO THE DEALER WHO MAINTAINED THAT THE CAR HAD BEEN TEST DRIVEN AND COMPUTER TESTED WITHOUT DETECTION OF A RE-OCCURRENCE. THE DEALER FURTHER ADVISED THAT THE COMPUTER TEST RESULTS WERE SENT TO JAGUAR AND REPORTED BACK THAT THE JAGUAR PEOPLE HAD NEVER HAD ANY SIMILAR REPORTS.  THE DEALER ASKED THAT I RETRIEVE THE CAR AS NO PROBLEM WAS DETECTED. I BELIEVE THIS CAR HAS SERIOUS ELECTRONIC OR RELATED PROBLEMS AS REGARDS  THE CONNECTION BETWEEN BRAKING ACTION AND TRANSMISSION GOING INTO NEUTRAL AFTER THE BRAKES ARE APPLIED. A FEW MONTHS BEFORE THE ENTIRE ELECTRONICS ON THE DASH BOARD HAD TO BE REPLACED AS THE SCREEN MONITOR WENT DEAD. I DO NOT IN MY LAYMAN'S MIND KNOW WHETHER THERE IS ANY CONNECTION BETWEEN THESE TWO ISSUES. IN ANY EVENT I REFUSED TO GO BACK INTO THAT CAR. I ASKED THE DEALER TO TAKE IT BACK AND I WAS OFFERED  $ 36,000 FOR THE CAR. I PAID  $ 59,674 FOR IT JUST A YEAR OR SO BEFORE. SOMEONE I KNOW SUGGESTED THAT I COULD HAVE GOTTEN SOMEWHAT MORE BY SELLING IT PRIVATELY , BUT I DID NOT WANT TO HAVE IT ON MY CONSCIENCE SELLING A DANGEROUS VEHICLE.. THE DEALER BOUGHT IT  WITH 3670  MILES ON THE ODOMETER. ACCORDING TO THE DOCUMENT, THE CONSUMER STATED THE VEHICLE WOULD ACCELERATE WHEN COMING TO A STOP. UPDATED IVOQ 01/19/11  *TR",
        "vin": "SAJWA0GB6AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2010",
        "dateOfIncident": "10/06/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361259,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A NO WARNING COMPLETE SHUTDOWN OF MY 2010 JAGUAR XF AT 5:00PM ON OCTOBER 6, 2010.  GAS GAUGE READ 30+ MILES, ODOMETER READ 7000+ MILES.  I HAD JUST EXITED FROM A STRIP MALL AND DRIVING ON AN INCLINE AT 25-30MPH, WITHOUT ANY WARNING THE ENGINE SHUT OFF ABRUPTLY, THE GEAR CONTROL KNOB RECEDED INTO THE CONSOLE AND THE CAR AUTOMATICALLY SHIFTED INTO PARK.  I LOST ALL CONTROL OVER THE VEHICLE.  THE DASHBOARD LOST ITS ILLUMINATION.  I ATTEMPTED TO RESTART THE CAR BY PRESSING THE START BUTTON BUT THE CAR WOULD NOT START.  I COULDN'T ROLL DOWN THE WINDOWS.  THE POLICE AND MY FRIEND ARRIVED AT THE SCENE AND ASSISTED ME BY POURING IN AT LEAST A GALLON OF GAS BUT THE CAR WAS STILL FROZEN IN PLACE.  THE POLICE CALLED FOR TOW TRUCK ASSISTANCE SINCE MY CAR WAS BLOCKING THE \"AFTER WORK\" TRAFFIC FLOW.  AFTER A DAY AND HALF AT THE SERVICE CENTER, I WAS TOLD THAT MY CAR WAS READY FOR PICK UP ON OCTOBER 8TH.  I WAS TOLD THAT NOTHING WAS WRONG WITH THE CAR (DIAGNOSTICIANS CHECKED BY MACHINE) AND ADVISED ME NOT TO DRIVE ON LOW FUEL.  NOTHING WAS FIXED.  ON OCTOBER 9TH CONCERN AND TERROR REGARDING THIS EXPERIENCE WAS EXPRESSED TO THE MANAGER.   THE MANAGER WAS GIVEN A COPY OF THE 2 RECALLS RELATING TO SHUTDOWNS OF 2010 JAGUAR XF AUTOS AND REQUESTED THAT THEY PROBE FURTHER AND TO NOTIFY JAGUAR CORPORATE AND JAGUAR MANUFACTURER ABOUT THE COMPLETE SHUTDOWN.  AGAIN, ON OCTOBER 12TH, I WAS TOLD THAT MY CAR WAS READY FOR PICKUP...CAN'T FIND ANYTHING WRONG.  NOTHING FIXED.  I REITERATED THAT THEY NEED TO CONTINUE TO INSPECT, INVESTIGATE AND DISCOVER WHAT CAUSED THE SHUTDOWN BECAUSE MY LIFE AND THE PUBLIC'S SAFETY CAN BE IN DANGEROUS JEOPARDY IF THIS HAPPENS AGAIN ON THE ROADWAY OR FREEWAY.  AS OF OCTOBER 13TH OR OCTOBER 14TH, I BELIEVE THE JAGUAR CORPORATE TECHNICIANS BECAME INVOLVED AND IS NOW GUIDING THE LOCAL SERVICE CENTER WITH THE INVESTIGATION AND INSPECTION OF MY VEHICLE.  THIS NO WARNING COMPLETE SHUTDOWN FUNCTION OF THE JAGUAR AUTOMOBILE NEEDS TO BE ADDRESSED. *TR",
        "vin": "SAJWA0GB6AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2010",
        "dateOfIncident": "10/14/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360619,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS OUR 2010 JAGUAR XF HAS COMPLETELY STALLED IN THE MIDDLE OF TRAFFIC NARROWLY AVOIDING AN ACCIDENT. ON BOTH OCCASIONS WE HAD NO CONTROL OVER THE VEHICLE AS THE SYSTEM COMPLETELY FROZE. AFTER THE FIRST INCIDENT JAGUAR TOOK THE CAR AND REPLACED THE FUEL PUMP AND SOME OF ITS ACCESSORY'S.  YESTERDAY THE SAME EVENT OCCURRED AND WE STARTED TO RESEARCH ONLINE TO SEE IF WE COULD FIND ANY OTHER OWNERS EXPERIENCING THIS SAME PROBLEM. THIS IS WHAT WE FOUND;  RECALL ID # 09V424000 - FUEL SYSTEM, GASOLINE:DELIVERY   RECALL DATE: NOV 02, 2009   COMPONENT: FUEL SYSTEM, GASOLINE:DELIVERY MODEL AFFECTED: XF   POTENTIAL UNITS AFFECTED: 2131 RECALL DETAILS  RECALL DATE: NOV 02, 2009   MODEL AFFECTED: 2010 JAGUAR XF SUMMARY: JAGUAR IS RECALLING CERTAIN MODEL YEAR 2010 VEHICLES. THE FUEL TRANSFER PIPE IN THE FUEL TANK MAY BE KINKED. THIS MAY RESTRICTS FUEL BEING TRANSFERRED FROM ONE SIDE OF THE FUEL TANK TO THE FUEL PUMP CAUSING FUEL STARVATION AT LOW FUEL LEVELS. CONSEQUENCE: FUEL STARVATION TO THE ENGINE CAN CAUSE THE ENGINE TO STALL WITHOUT WARNING AND COULD POTENTIALLY CAUSE A CRASH. REMEDY: DEALERS WILL HAVE THE FUEL TANK ASSEMBLY REPAIRED FREE OF CHARGE. THE SAFETY RECALL BEGAN ON NOVEMBER 30, 2009. OWNERS MAY CONTACT JAGUAR AT  1-800-452-4827 1-800-452-4827. POTENTIAL UNITS AFFECTED: 2131   NOTES:JAGUAR LAND ROVER NORTH AMERICA, LLC J016   RECALL ID # 10V332000 - ENGINE AND ENGINE COOLING   RECALL DATE: JUL 22, 2010 COMPONENT: ENGINE AND ENGINE COOLING   MODEL AFFECTED: XF  POTENTIAL UNITS AFFECTED: 5048 RECALL DETAILS    RECALL DATE: JUL 22, 2010  MODEL AFFECTED: 2010 JAGUAR XF   SUMMARY: JAGUAR IS RECALLING CERTAIN MODEL YEAR 2010-2011 JAGUAR XK AND MODEL YEAR 2010 XF V8 5.0L GASOLINE ENGINE VEHICLES. THE IN-TANK ELECTRIC FUEL PUMP MAY NOT BE CORRECTLY ACTIVATED AS THE FUEL PUMP RELAY IS NOT ENERGIZED FOLLOWING A VEHICLE START UP CYCLE. AN INADEQUATE SUPPLY OF FUEL TO THE ENGINE COULD RESULT. CONSEQUENCE:  FUEL STARVATION TO THE ENGINE LEADS TO ENGINE. *TR",
        "vin": "SAJWA0GB2AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "07/13/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342904,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XF. WHILE TRAVELING AT 50 MPH, THE  VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE  DEALER WHERE THE CONTACT WAS AWAITING A DIAGNOSIS OF THE FAILURE. THE CURRENT AND FAILURE MILEAGES WERE 9,000.",
        "vin": "SAJWA0GB6AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "04/30/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340071,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 JAGUAR XFR. CONSUMER STATES ENGINE MALFUNCTION *TGW  THE CONSUMER STATED HIS WIFE WAS DRIVING 70 MPH ON THE INTERSTATE WHEN THE ENGINE SUDDENLY QUIT RUNNING. THE CONSUMERS WIFE MANAGED TO MANEUVER THE VEHICLE TO A NARROW STRIP BETWEEN THE OUTER LEFT EDGE OF THE FAST LANE AND GUARD RAIL. THE VEHICLE WOULD NOT RESTART; AND THE DASHBOARD DISPLAY SAID ENGINE MALFUNCTION. PRIOR TO THE INCIDENT, THE CONSUMER TOOK THE VEHICLE TO THE DEALER BECAUSE THE LOW LEVEL FUEL LIGHT WAS ALWAYS ILLUMINATING JUST AFTER A FEW  MILES OF DRIVING; EVEN WITH A FULL TANK OF GAS. AS SOON AS THE VEHICLE WAS RETURNED TO THE CONSUMER AND HE STARTED THE ENGINE, THE LOW LEVEL FUEL LIGHT ILLUMINATED AGAIN. THE CONSUMER WAS THEN INFORMED A NEW GAS TANK WOULD HAVE TO BE ORDERED BECAUSE THE SENSOR IN THE GAS TANK WAS OBVIOUSLY DEFECTIVE. THE DEALER INSTALLED A NEW GAS TANK AND THE LIGHT NEVER CAME BACK ON.  *JB",
        "vin": "SAJWA0JC0AM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331563,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2010 JAGUAR XF LAST SUMMER AND BELIEVE THERE IS A SERIOUS SAFETY ISSUE. SHORTLY AFTER TAKING DELIVERY, THE POWER BRAKE ASSIST FAILED WHEN I WAS ENTERING A FREEWAY. FORTUNATELY, I HAD TAPPED ON THE BRAKES TO AVOID A CAR IN THE LANE I WAS ENTERING. I IMMEDIATELY REALIZED THERE WAS VERY LITTLE BRAKING POWER. IF I HAD NEEDED TO BRAKE AT A HIGHER SPEED ON THE FREEWAY, IT COULD HAVE BEEN DISASTROUS. THE SERIOUS ISSUE IS THAT THIS FAILURE DOES NOT TRIGGER A 'BRAKE FAILURE' LIGHT ON THE INSTRUMENT PANEL. THEREFORE NO WARNING.   I LIMPED HOME AND HAD THE CAR TOWED TO THE LOCAL DEALER. THE PROBLEM WAS THAT A PLASTIC TUBE WHICH CARRIES THE ENGINE VACUUM SIGNAL TO THE BRAKE UNIT HAD BECOME DETACHED, THUS NO POWER ASSIST FOR THE BRAKES. THE DEALER REPLACED THE PLASTIC TUBE.  I CONTACTED JAGUAR HEADQUARTERS TO INQUIRE ABOUT A BRAKE FAILURE WARNING ALARM FIX FOR THIS PROBLEM, BUT THEY INFORMED ME THAT 'THIS WAS WAY IT WAS DESIGNED. NO FIX POSSIBLE.' *TR",
        "vin": "SAJWA0GBXAL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "11/12/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331300,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CAR DELIVERED WITH TWO BENT WHEELS. FRONT RIGHT WHEEL ALSO OVAL SHAPED.  *TR",
        "vin": "SAJWA0JC8AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2010",
        "dateOfIncident": "05/13/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330315,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS OCCURRED NUMEROUS TIMES ON TWO NEW 2010 JAGUAR XFS. AS MY BLUETOOTH CONNECTED PHONE BEGAN TO RING, THE CAR'S TOUCHSCREEN INTERFACE WENT BLANK AND THE HVAC VENTS ROTATED TO THE CLOSED POSITION. I AM NOT SURE IF THE ENTIRE ELECTRICAL SYSTEM WENT DOWN AS THE TOUCHSCREEN IMMEDIATELY REBOOTED AND THE VENTS ROTATED BACK OPEN. I DID NOT NOTICE ANY PROBLEMS WITH BRAKING, ACCELERATION, OR HANDLING. JAGUAR DOES NOT CONSIDER THIS THEIR PROBLEM.  THEY ARE TELLING ME THAT MY PHONE IS THE PROBLEM, BUT I FIND IT INTERESTING THAT IT IS AN APPROVED PHONE.  I AM GETTING NOWHERE AND FIND IT INTERESTING THAT WHEN RECEIVING A PHONE CALL THAT THE PHONE IS CAPABLE OF TURNING ALL OF THE ABOVE SYSTEMS OFF.  CAN SOMEBODY LET ME KNOW IF THEY ARE EXPERIENCING THE SAME ISSUES AND WHAT YOU ARE DOING? *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329260,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING AT 70 MPH, THE ENGINE SUDDENLY SHUT OFF. THE CONTACT SPOKE WITH AN AUTHORIZED DEALER WHO STATED THAT THE FUEL PUMP FAILED, CAUSING THE VEHICLE TO RUN OUT OF FUEL. THE DEALER STATED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLAINT.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 6,900.",
        "vin": "SAJWA0GB6AL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "04/29/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329018,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "10329018  TL*THE CONTACT OWNS A 2010 JAGUAR XF. WHILE DRIVING AT AN UNKNOWN LOW SPEED, THE VEHICLE SUDDENLY SURGED FORWARD WHICH CAUSED A CRASH. THE CONTACT DEPRESSED THE BRAKE PEDAL BUT THE VEHICLE DID NOT STOP. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALERSHIP TO BE INSPECTED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 5,000.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "04/09/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325240,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR QUIT RUNNING, WOULD NOT RESTART.  TOWED TO DEALERSHIP-KEPT FOR WEEK. COMPUTER SHOWED 4 CODES SO DEALERSHIP COULD NOT REPAIR THE PROBLEM.  FOUR DAYS AFTER CAR RETURNED, CAR QUIT RUNNING ON THE HIGHWAY, PULLED OVER TO SHOULDER, IN A FEW MINUTES CAR RESTARTED. *TR",
        "vin": "SAJWA4GB9AL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "03/05/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317645,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS MY 2010 JAGUAR XF HAS REV'ED TO BETWEEN 3-4,000 RPM'S WHEN COMING TO A STOP. IT TOOK BOTH FEET ON THE BRAKE, THEN SHIFTING TO NEUTREL AND HITTING IGNITION OFF TO STOP THE ENGINE. ON MARCH 5, 2010 IT TOOK 3 TRIES TO GET THE ENGINE TO RUN CORRECTLY. THE CAR IS NOW AT BOBBY RAHAL JAGUAR FOR SERVICE. *TR",
        "vin": "SAJWA0FA4AH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2010",
        "dateOfIncident": "02/21/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314793,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 JAGUAR XKR (NOTE THAT YOUR FORM LATER ONLY ALLOWS AN XF TO BE CLICKED IN ORDER TO PROCEED SO I DID THAT). ON 2-21-10 CAR 1/2 FULL OF GAS. STARTED CAR AND DROVE TWO BLOCKS WHEN SUDDENLY THE ENGINE SHUTOFF AND AMBER ENGINE SYMBOL (\"ENGINE MALFUNCTION\") LIGHT CAME ON. ABLE TO MOVE STEERING WHEEL A LITTLE (NO POWER STEERING) AND COASTED TO STOP--DOING ABOUT 30 MILES PER HOUR WHEN THE ENGINE SUDDENLY AND WITHOUT WARNING SHUT OFF.  WAITED A COUPLE OF MINUTES AND TRIED TO START AND WOULD NOT RESTART. TRIED TO START AGAIN A MINUTE LATER AND WAS ABLE TO START AND DROVE BACK TO HOME WHERE CAR WAS THEN TOWED TO DEALERSHIP. AUSTIN JAG DEALERSHIP SAID THEY FOUND LOW FUEL PRESSURE CODE, BUT WHEN PRESSURE TESTED THEY FOUND NOTHING AND COULDN'T REPLICATE. THEN TOWED TO HOUSTON JAGUAR DEALERSHIP WHERE PURCHASED FROM AND THEY SAID THEY COULDN'T FIND ANYTHING WRONG AND COULD NOT REPLICATE SO SAID NOTHING TO REPAIR.  OCCURRENCE IN AUSTIN, TX (HOUSTON GARAGED).  PREVIOUSLY, TWO WEEKS BEFORE, SMELLED GAS IN CAR WHEN FILLED UP (AGAIN DEALERSHIP COULDN'T SMELL OR FIND A PROBLEM). *TR",
        "vin": "SAJWA4DCXAM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "01/22/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308615,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS NO INSTRUMENT TO INFORM YOU THAT YOU SHOULD CHANGE THE PADS. YOU NOTICE YOU NEED TO CHANGE THE PADS WHEN IT DAMAGE YOUR DISC OR YOU HAVE NO BRAKES. I AM SCARE FOR MY SAFETY AND FAMILY.    MY DAD WAS DRIVING IN THE ROAD IN PUERTO RICO AND THE CAR STARTED DOING A NOISE REALLY BIG NOISE LIKE IT WAS EATING OR DAMAGING SOMETHING IN ONE TIRE OR  WITH THE PADS AND THE DISC OF THE RIGHT BACK TIRE OF A JAGUAR XF 2009. WE WENT THE NEXT DAY TO THE DEALER AND LET THEM KNOW WHAT HAPPEN AND THEY TOLD US, THAT YEAR THE CAR WASN'T MADE WITH SENSORS IN THE PANEL AND THE PADS DIDN'T HAVE SENSORS TO LET US KNOW WE WERE OUT OF BRAKES. THEY TOLD US TO PAY FOR THE NEW PADS AND THE DISC. BUT THE CAR IT ONLY HAS 11,500 MILES AND WE FIND IT WEIRD, THAT A CAR WITH SO LITTLE MILE  THE PADS WERE OUT AND IT DIDN'T WARN US AT ALL.. ALL CARS COMES WITH SENSOR IN THE PANEL THAT LET YOU KNOW SOMETHING IS WRONG WITH THE BRAKES AND THE PADS COMES WITH SENSORS. WE WERE DRIVING THE CAR SCARE THAT SOMETHING MIGHT HAPPEN TO US. I HAVE BOUGHT DIFFERENT CARS AND ALL OF THEM HAVE SENSOR THAT LET YOU WITH A SIGN OR THE MAIN PANEL TELL YOU WHEN YOU TURN YOUR CAR ON. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305610,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS OCCURRED ONE TIME ONLY.  AS MY BLUETOOTH CONNECTED PHONE BEGAN TO RING, THE CAR'S TOUCHSCREEN INTERFACE WENT BLANK AND THE HVAC VENTS ROTATED TO THE CLOSED POSITION.  I AM NOT SURE IF THE ENTIRE ELECTRICAL SYSTEM WENT DOWN AS THE TOUCHSCREEN IMMEDIATELY REBOOTED AND THE VENTS ROTATED BACK OPEN.  I DID NOT NOTICE ANY PROBLEMS WITH BRAKING, ACCELERATION, OR HANDLING.  HOWEVER, I REMAIN CONCERNED AS ALL SYSTEMS ON THIS CAR ARE DRIVE BY WIRE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2009",
        "dateOfIncident": "09/19/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284975,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR AND LOST ALL POWER TO THE VEHICLE IN THE DRIVE POSITION. *TR",
        "vin": "SAJWA0GB4AL"
    }
]