[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438696,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Jaguar XK. The contact stated while driving 60 MPH, she smelled an abnormally strong gasoline odor. There were no warning lights illuminated. The contact was able to continue to drive the vehicle. The contact also stated there was gasoline was leaking underneath the passenger’s side door. The manufacturer was notified of the failure and had the vehicle towed to the dealer for the diagnostic test and repair; however, the manufacturer called back and informed the contact that they would no longer cover the repair of the vehicle because the VIN was not included in a recall. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 80,000.",
        "vin": "SAJWA4FB5AL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033934,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XKR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 (NA) JAGUAR XKR. WHILE DRIVING APPROXIMATELY 45 MPH, THERE WAS A POPPING NOISE COMING FROM THE EXHAUST SYSTEM. THE CONTACT NOTICED A STRONG ODOR OF FUEL INSIDE THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. IN ADDITION, WHILE THE VEHICLE WAS LIFTED TO BE TOWED, THE CONTACT NOTICED FUEL LEAKING FROM THE EXHAUST SYSTEM. THE VEHICLE WAS TOWED TO JAGUAR MISSION VIEJO (28701 MARGUERITE PKWY, MISSION VIEJO, CA 92692, PHONE NUMBER: (949) 973-9800) WHERE IT WAS DIAGNOSED THAT THE FUEL INJECTOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "SAJWA4EC2BM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "01/02/2013",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537858,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XKR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 JAGUAR XKR. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE DRIVER NOTICED A THUMPING NOISE, SMOKE AND FLAMES COMING FROM UNDER THE HOOD AS THE VEHICLE STALLED. THE FIRE INDEPENDENTLY EXTINGUISHED. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS WHERE THE TECHNICIAN STATED THAT THE ENGINE WOULD HAVE TO BE REPLACED BECAUSE THE COMPUTER MODULE HAD FAILED DUE TO AN ELECTRICAL FAILURE. THE VEHICLE WAS REPAIRED HOWEVER, THE CONTACT CONTINUED TO EXPERIENCE SEVERAL ELECTRICAL FAILURES IN THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT FURTHER REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 15.",
        "vin": "SAJWA4HA0CM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/29/2012",
        "dateOfIncident": "11/26/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449773,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XKR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST OCCURRENCE 11/2010 AND BEGINNING OF A SERIES OF RELATED PROBLEMS:  ENGINE STALL AT 30 MPH; FOLLOWING DAY THE VEHICLE WOULD NOT START.  DEALER FOUND BATTERY FAILURE INSTALLED NEW BATTERY AND RESET SYSTEM.  12/3/2010 - VEHICLE WILL NOT START.  TOWED TO DEALER.  DEALER STATES AFTER TWO DAYS VEHICLE STARTS AND TO REMOVE \"KEY\" FROM ASHTRAY ALLEGEDLY CAUSING VEHICLE NOT TO SHUT DOWN ALL THE WAY.  8/31/11 VEHICLE WILL NOT START.  DEALER FINDS LOW BATTERY BUT NO DRAW AND PERFORMED POWER STEERING RECALL.  10/31/11 - VEHICLE WILL NOT START.  DEALER STATES BATTER FAILED LOAD TEST AND BATTERY REPLACED.  11/17/2011 - VEHICLE WILL NOT START.  DEALER FINDS SERVICE BULLETIN FOR INTERMITTENT BATTERY DRAW AND PERFORMED ICM SOFTWARE UPDATE.  TO DATE, THE VEHICLE CONTINUES TO LOSE BATTERY CHARGE.  DEALER AND MANUFACTURER ARE NOT ABLE TO FIX THE PROBLEM AFTER MORE THAN ONE YEAR OF SERVICING AND TROUBLE SHOOTING.  PLEASE CONTACT THE MANUFACTURER AND CONDUCT AN INFORMATION REQUEST FOR WARRANTY REPAIRS OR SIMILAR RECORDS FOR INTERMITTENT LOSS OF BATTERY CHARGE AND VEHICLE STALL DEFECTS.  NUMEROUS BLOG SITES ONLINE INDICATE THAT JAGUAR OWNERS ARE HAVING SIMILAR EXPERIENCES.  *TR",
        "vin": "SAJWA4EC5AM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "05/25/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372480,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 JAGUAR XK. WHILE DRIVING APPROXIMATELY 65-70 MPH, THE CONTACT APPLIED THE BRAKES AND THERE WAS A VIBRATION AND DELAYED RESPONSE. THE FAILURE WOULD OCCUR WHEN THE VEHICLE WAS IN OPERATION AT ANY SPEED BEING DRIVEN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON NUMEROUS OCCASIONS WHERE THE FRONT AND REAR BRAKES AND ROTORS WERE REPLACED. THE REPAIRS WERE PERFORMED ABOUT EIGHT TIMES. THE FAILURE CONTINUED AFTER THE REPAIRS. THE FAILURE MILEAGE WAS APPROXIMATELY 300.",
        "vin": "SAJWA4FB0AL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "10/24/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365826,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 JAGUAR XK. THE CONTACT STATED THAT THE ACCELERATOR PEDAL WOULD BECOME STUCK IN THE OPEN THROTTLE POSITION WHEN TRAVELING AT VARIOUS SPEEDS. THE CONTACT WOULD DEPRESS THE BRAKE PEDAL FIRMLY TO SLOW THE VEHICLE. SHE WOULD THEN SHIFT INTO NEUTRAL BECAUSE THE VEHICLE WOULD NOT STOP. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER BUT THE DEALER COULD NOT FIND THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED IN REGARDS TO THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 6,300 AND THE CURRENT MILEAGE WAS APPROXIMATELY 6,600.",
        "vin": "SAJWA4GB4AL"
    }
]