[
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "06/14/2011",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406879,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "BULLET",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN ON A 10,000 MILE THREE MONTH LONG TRIP IN MY COUGAR KEYSTONE 275 TRAVEL TRAILER. I NOTICED MY TRAILER BRAKES WERE NOT AS EFFECTIVE AS THEY SHOULD BE, SO I WENT UNDER THE TRAILER AND FOUND THAT THE WIRING FOR THE FRONT AXLE'S ELECTRIC BRAKES WAS RUBBING AGAINST THE TIRE, AND THAT THE INSULATION WAS   ABRADED OFF OF PART OF THE WIRE. I JACKED UP THE TRAILER AND HAD MY WIFE APPLY THE BRAKES WHILE I ROTATED THE TIRE. THE BRAKES WERE NOT WORKING, AS THE COPPER CONDUCTOR WAS BROKEN. I SPLICED THE WIRE TOGETHER USING WATER PROOF WIRE NUTS WHICH I THEN COATED WITH SILICONE SEALANT. THE BRAKES WORKED. I USED PLASTIC WIRE TIES TO SECURE THE WIRE TO THE SPRING HANGER, AWAY FROM THE TIRE. THIS COULD HAVE BEEN CATASTROPHIC HAD I NEEDED TO BRAKE HARD TO AVOID AN ACCIDENT.    THE BRAKE WIRE HAD WORKED ITS WAY OUT WHERE IT EXITS THE FRAME. THERE WAS ENOUGH EXTRA LENGTH FOR IT TO EXTEND ALL THE WAY TO THE TIRE WALL WHERE IT BEGAN RUBBING.    NOTE:  YOUR MODEL DESCRIPTORS FOR KEYSTONE DO NOT INCLUDE COUGAR TRAILERS.  THIS IS AN OMISSION.  I ENTERED BULLET AS THE MODEL AS COUGAR WAS OMITTED FOR THE LIST.    ALSO, I WAS UNABLE TO ENTER THE TRAILER'S VIN, AS IT HAS MORE DIGITS THAN IT IS POSSIBLE TO ENTER ON YOUR FORM. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "08/23/2009",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281519,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "BULLET",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TRAIL MANOR ELKMONT TRAILER. THE CONTACT NOTICED THAT WHENEVER IT RAINS HEAVILY THAT THE OUTSIDE VENTS FOR THE REFRIGERATOR AND FREEZER BECOME WET WHICH LEADS TO THE ELECTRICAL CORDS OF THE EQUIPMENT TO BECOME WET. THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALERSHIP AND THE CONTACT NOTICED BEFOREHAND THAT THE TRAILER HAD A PREVIOUS LEAK PROBLEM. THE CURRENT AND FAILURE MILEAGE WAS AT 2000. BML",
        "vin": "5NZBF2415A1"
    }
]