[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659555,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 KEYSTONE RAPTOR FIFTH WHEEL TRAILER. POTENTIALLY DEADLY INTEGRATED TRAILER BRAKE CONTROLLER. *TA  THE CONSUMER STATED WHILE DRIVING, HE ENCOUNTERED SLOWING TRAFFIC. HE TAPPED THE BRAKES TO RELEASE THE CRUISE CONTROL THAT WAS SET AT 55 MPH, WHEN SUDDENLY THE VEHICLE IN FRONT OF HIM HIT THE BRAKES HARD WHICH CAUSED HIM TO HIT THE BRAKE HARD AS WELL. WITH BOTH FEET ON THE BRAKE PEDAL TRYING TO STOP THE TRUCK AND TRAILER IT WAS EVIDENT THAT HE WAS NOT GOING TO STOP IN TIME. BUT AT THE LAST SECOND, THE CONSUMER GLANCED TO THE LEFT TO LOOK OUT THE MIRROR, HE WAS ABLE TO TURN TO THE LEFT TO AVOID SLAMMING INTO THE VEHICLE IN FRONT OF HIM.  SHORTLY AFTER HITTING THE BRAKE, HE REALIZED THERE WAS NO TRAILER BRAKES AND THE TRAILER WAS PUSHING THE TRUCK FORWARD. ONCE THE CONSUMER CAME TO A SOP, HE NOTICED THE SERVICE STABILITRAK AND CHECK TRAILER BRAKE LIGHTS WERE FLASHING.  THE CONSUMER SLID THE BRAKE CONTROLLER SWITCH TO SEE IF THE TRAILER BRAKES WERE FUNCTIONING. THEY WERE NOT WORKING AT ALL.  THE TRAILERS ELECTRIC CORD WAS PLUGGED IN. HE THEN WENT TO CHECK THE FOUR BULBS AND DISCOVERED THEY WERE COLD, AS IF THEY HAD NOT BEEN APPLIED DURING THE PANIC STOP FROM EARLIER. WHEN HE STARTED THE VEHICLE, THE TWO MESSAGES WERE GONE AND THE TRAILER BRAKES WERE FUNCTIONING AGAIN AS VERIFIED BY THE MANUAL SLIDE SWITCH. *JB",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/09/2012",
        "dateOfIncident": "10/02/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479358,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KEYSTONE RAPTOR. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO A DEALER AFTER HE BECAME AWARE OF NHTSA CAMPAIGN ID NUMBER: 10V238000 (EQUIPMENT). THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE RECALL REPAIRS HAD BEEN PERFOMED ONCE BEFORE. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "4YDF3002XAR"
    }
]