[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745342,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRESH WATER TANK IN THE REAR OF THE TRAILER FELL DOWN AND WAS SITTING RIGHT ON THE REAR AXEL. WE OPENED UP THE BOTTOM COVER OF THE TRAILER AND NOTICED THAT THE BARS USED TO SUPPORT THE TANK WERE ALL BENT AND A FEW OF THEM HAD POPPED OFF FROM THE FRAME. WE WERE ABLE TO JACK UP THE TANK AND REPAIR THE DAMAGE BY OURSELVES BECAUSE WE WERE OUT OF TOWN AND THE DEALERSHIP WOULD TAKE MONTHS TO FIX THIS AND THEN CHARGE US A HEFTY AMOUNT TO FIX IT. WE REPAIRED IT OURSELVES FOR BY REPLACING THE FLIMSY METAL BARS WITH  MULTIPLE UNI-STRUT BARS TO SUPPORT THE WATER TANK.   UPDATED 09/15/15*LJ             *CN",
        "vin": "4YDF40031AF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2014",
        "dateOfIncident": "07/02/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577756,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 KEYSTONE FUZION II 5TH WHEEL UNIT.  HAD TRANSFER SWITCH REPAIRED UNDER RECALL. HAD SEVERAL  ITEMS REPAIRED, I.E. LIGHT FIXTURES, REAR RAMP WIRING, HOLDING TANK VALVE REPLACEMENTS AND REPAIRS, TIRE FAILURES.  ISSUE NOW IS A WARNING LIGHT IN THE MAIN FUSE PANEL INDICATING A BLOWN FUSE. UPON CONTACTING MANUFACTURER, THE CUSTOMER SERVICE REP INDICATES THAT THERE IS NO TYPE OF STANDARD WIRING, PIPING OR OTHER DIAGRAMS TO TROUBLESHOOT ANY OF THESE SYSTEMS, ALTHOUGH A WARNING LIGHT WOULD MEAN A SHORT IN A WIRING SYSTEM.  THE COST OF TAKING UNIT TO DEALER FOR REPAIRS IS BORN BY THE OWNER.  DEALERS, ALL OF THEM, HAVE THE ATTITUDE OF \"IF YOU DIDN'T BUY IT HERE, I DON'T WANT YOUR PROBLEMS.\"  THEY COME UP WITH ANY EXCUSE TO NOT SERVICE THE UNIT PROPERLY, UNLESS OF COURSE YOU ARE PAYING THEIR REGULAR SHOP RATE, IF THEY WANT TO GET YOU IN. EXTENDED WARRANTIES ARE HONORED BY SOME AND NOT OTHERS, ALTHOUGH SOLD BY ALL DEALERS.  *TR",
        "vin": "4YDF40530AF"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "05/26/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532282,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR RIGHT SIDE OF THE FRESH WATER TANK FELL DOWN WHILE TRAVELING, AND BEGAN DRAGGING ON THE ROAD. THE METAL U-CHANNEL SUPPORTS UNDER THE TANK BENT DOWN, AND BEGUN BREAKING THE TAP SCREWS ON EACH END, OR PULLING THEM THROUGH THE FRAME. OF THE 5 SUPPORTS UNDER THE TANK, TWO PULLED LOOSE FROM BOTH ENDS, TWO PULLED LOOSE ON ONE END, AND ONLY ONE, THE LEFT STRAP NEXT TO THE PLUMBING CONNECTIONS, WAS STILL ATTACHED ON BOTH ENDS. THE LOOSE SUPPORTS WERE PINNED BETWEEN THE TANK AND THE BOTTOM COVER, AND ONE OF THE SUPPORTS WAS GROUND DOWN BY THE PAVEMENT, WHICH SAVED DAMAGE TO THE TANK, WHICH WAS NEARLY FULL, 80 GALLON CAPACITY. THE FRONT CROSS ANGLE BAR, USED TO HOLD THE TANK IN PLACE AGAINST THE REAR FLOOR BEAM, WAS HELD IN PLACE WITH ONE SCREW ON EACH SIDE, INSTEAD OF TWO PER SIDE, WHICH ALLOWED THE BAR TO TIP DOWN, DROPPING THE TANK AS THE U-STRAP UNDER THE TANK BOWED DOWN.   I WAS ABLE TO JACK UP THE TANK, AND PLACE A LARGE VEHICLE TIE DOWN STRAP UNDER THE TANK, RAISING IT TO TRAVEL HOME. I HAVE ALREADY REPAIRED THE DAMAGE, WHICH I TOOK PICTURES OF, AS I NEEDED THE CAMPER, NOT HAVE IT SIT ON THE DEALERS LOT ONCE AGAIN. I USED 1.5 INCH BOX TUBES, .125 THICK, WITH GRADE 5 BOLTS ON EACH END, TO SUPPORT THE TANK.   UPDATED 9/24/13 *CN  *TR",
        "vin": "4YDF40538AF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2013",
        "dateOfIncident": "08/07/2010",
        "fire": true,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493692,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT OUR 2010 KEYSTONE FUZION RV AROUND JUNE/JULY 2010.  THE DEALER (CAMPING WORLD, S.C.) TOLD US THAT THE RV WAS A BRING-BACK, NEVER EVEN USED (WHICH, LOOKING BACK ON IT, MAKES ME WONDER IF THERE WERE PROBLEMS WITH THE UNIT FROM THE START).  IN AUGUST 2010, WE TOOK IT ON A TRIP TO VIRGINIA.  WE PLUGGED IN THE 50 AMP SERVICE AND ABOUT AN HOUR AFTER, THE UNIT CAUGHT FIRE IN THE STORAGE COMPARTMENT.  THANKFULLY, MY HUSBAND WAS THERE WHEN IT HAPPENED AND WAS ABLE TO CONTAIN THE DAMAGE.  WE IMMEDIATELY CONTACTED KEYSTONE RV, WHO HAD NO INTEREST WHATSOEVER IN WHAT HAPPENED.  IT TOOK MONTHS BEFORE A DEALERSHIP IN PA FINALLY MADE THE REPAIRS,' REPLACING A BAD TRANSFER SWITCH.  THIS PAST SUMMER (JUNE 2012) WE AGAIN TOOK THE UNIT TO S.C. FOR VACATION.  WE SMELLED ELECTRICAL FIRE IN THE UNIT AND AGAIN, THANKFULLY, MY HUSBAND FOUND THE FIRE BEFORE ANY DAMAGE OCCURRED.  WE AGAIN CALLED KEYSTONE RV, WHO DRUG THEIR FEET IN OFFERING ANY TYPE OF ASSISTANCE.  THIS TIME, WE WERE ONLY A MILE OR SO FROM WHERE WE ORIGINALLY PURCHASED THE UNIT (CAMPING WORLD). AFTER MULTIPLE PHONE CALLS AND ARGUMENTS WITH KEYSTONE AND CAMPING WORLD, A TECH CAME TO OUR CAMPSITE AND FOUND THAT KEYSTONE RV HAD REPLACED THE ORIGINAL FAULTY TRANSFER SWITCH WITH THE SAME FAULTY TRANSFER SWITCH.  THIS WAS TWICE THAT OUR FAMILY COULD HAVE SUFFERED INJURY OR DEATH AS A RESULT OF THEIR MISTAKE.  WE HAVE NOT USED THE UNIT SINCE AND I AM HONESTLY SCARED TO USE IT.  *TR",
        "vin": "4YDF40534AF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2013",
        "dateOfIncident": "11/20/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491439,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED A RECALL NOTICE FOR A DEFAULT IN A IOTA  ITS-50R TRANSFER SWITCH. THESE SWITCHES ARE EXPERIENCING HEAT RELATED FAILURES. WARNING CONTINUED USE WITHOUT REPLACING INCREASES RISK OF FIRE, PERSONAL INJURY AND PROPERTY DAMAGE. I HAVE CONTACTED THE MANUFACTURER FOR REPAIR. I INFORMED THEM THAT THE UNIT IS PERMANENTLY SET AND NOT ABLE TO BE TAKEN TO A AUTHORIZED DEALER. I WAS INFORMED THAT THEY WOULD NOT PROVIDE A MOBILE SERVICE TO DO THE REPAIR. I DO NOT KNOW IF YOUR ORGANIZATION CAN BE OF ANY HELP IN PERSUADING THEM TO CHANGE THEIR POSITION IN PROVIDING A MOBILE SERVICE TO DO REPAIR. I WOULD GREATLY APPRECIATE ANY ASSISTANCE THAT YOU CAN PROVIDE. ALTHOUGH MY MAILING ADDRESS IS IN FLORIDA THE VEHICLE IS IN CORTEZ COLORADO. *TR",
        "vin": "4YDF38336AF"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/06/2012",
        "dateOfIncident": "09/22/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478863,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS CONCERNING TIRES BEING USED ON THE KEYSTONE FUZION.  THE BRAND OF TIRE IS CARLISLE AND THE TIRE THAT I AM HAVING PROBLEMS WITH IS THE ULTRA CRT RADIAL TRAIL, SIZE ST235/80R16.  I HAD ONE TIRE SHOW SEVERE SIGNS OF SIDE WALL AND TREAD WALL SEPARATION SO IT WAS REPLACED.  DURING A SHORT TRIP, I HAD A BLOW OUT ON ANOTHER TIRE.  I HAVE SINCE HAD IT REPLACED AS WELL, AND I AM ALSO WORKING ON REPLACING THE REST.  A SHORT INTERNET SEARCH ON THIS TIRE SHOWS NUMEROUS COMPLAINTS WITH BLOW OUTS.  NOT ONLY CAN THIS CAUSE LOSS OF CONTROL, BUT THIS IS A DANGER TO OTHER MOTORISTS WITH FLYING DEBRIS AFTER A BLOW OUT.  ESPECIALLY TO ANY MOTORCYCLISTS, PEDAL CYCLISTS, OR PEDESTRIANS.    *TR",
        "vin": "4YHDF30231A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467325,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 KEYSTONE FUZION TOY HAULER. CONSUMER STATES  PROBLEMS WITH CAMPER AND RECALL CONCERNING OVERHEATING OF LUGS AND DEGRADING OF THE ELECTRICAL CONNECTIONS *TGW  THE CONSUMER STATED THE GENERATOR, SWITCH, WIRES, LIGHTS SCREEN DOOR, FUSES AND FUEL PUMP WERE REPLACED.",
        "vin": "4YDT26021AF"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397521,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KEYSTONE FUZION FIFTH WHEEL CAMPER RV. THE CONTACT STATED THAT THE MIDDLE RESTROOM TOILET FLUSHED INTO THE GRAY TANK OF THE RV, WHICH WAS USED FOR NON-SEWAGE WATER DUMPING. THE CONTACT STATED THAT THE RESTROOM TOILET SHOULD HAVE FLUSHED INTO THE BLACK WATER TANK FOR SEWAGE PURPOSES. THE MANUFACTURER WAS CONTACTED ABOUT THE PROBLEM AND THE CONTACT WAS TOLD THAT THE VEHICLE WAS MADE TO PERFORM IN SUCH A MANNER. DUE TO THE SIZE ON THE GRAY WATER TANK, THE FAILURE WAS CAUSING THE TANK TO FILL UP QUICKLY AND WHEN DUMPED, IT WOULD EMIT RAW SEWAGE ONTO THE GROUND WHILE TRAVELING.  THE FAILURE MILEAGE WAS 3,000.",
        "vin": "4YDF4053XAF"
    },
    {
        "components": "TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "10/24/2010",
        "dateOfIncident": "10/02/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362094,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 FUZION FZ398 TOURING EDITION 2 THESE TRAILERS WERE BUILT WITH THE AXLES MOUNTED TO FAR FORWARD CAUSING SEVERE HANDLING ISSUES IF YOU USE THE GARAGE AREA FOR CARGO. KEYSTONE RECOMMENDS 20 TO 25% PIN WEIGHT WHEN LOADING THESE TRAILERS THIS CANNOT BE DONE WITH THE CURRENT AXLE PLACEMENT. KEYSTONE KNOWS THIS AND HAS MOVED THE AXLES BACK 20 INCHES ON THE 2011 MODELS BUT HAS NOT ISSUED ANY SORT OF RECALL. I  WEIGHED MY TRAILER AND EVEN THOUGH I AM UNDER GVWR I ONLY HAVE 10-11 % PIN WEIGHT THIS CAUSES SWAYING AND BUCKING WITH THE TRAILER AND LITERALLY PULLS THE TRUCK ALL OVER THE ROAD. THIS IS A DANGEROUS SITUATION WITH A TRAILER THIS SIZE. ON THE VEHICLE INFORMATION PAGE FUZION WAS NOT AN OPTION SO I SELECTED RAPTOR MY TRAILER IS A 2010 FUZION FZ398. *TR...UPDATED 05/09/12 *BF  UPDATED 6/6/12 *SD",
        "vin": "4YDF39832AF"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "07/06/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351323,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK DELIVERY MAY 7, 2010 OF A 2010 KEYSTONE MONTANA MOUNTAINEER MODEL 347THT TOY HAULER.  WHILE USING THE TRAILER WITH A HARLEY-DAVIDSON FLHT  IN THE CARGO AREA THE LEFT REAR D-RING PULLED OUT OF THE FLOOR. IT CAUSED DAMAGE TO ONE WINDOW ON THE TRAILER AND TO THE MOTORCYCLE. I USE A BIKE GRAB TO HOLD THE FRONT TIRE OF THE MOTORCYCLE OTHERWISE THE BIKE COULD HAVE PUSHED OUT THE WINDOW. THE 4 D-RINGS ARE EACH MARKED 1200 LB. I DO NOT BELIEVE THIS IS TRUE BECAUSE OF THE WAY THEY WERE INSTALLED. CHECKED ALL THE SCREWS AFTER THIS HAPPENED (3 SCREWS PER D-RING) AT LEAST HALF WERE STRIPPED OUT. THE ENGINEERING ON THIS IS EXTREMELY POOR. USING ONE 1/4\" SELF TAPPING SCREW WITH A 5/16 DRILL POINT INTO 1/16 ALUMINUM LEAVES VERY LITTLE CONTACT AREA INTO A SOFT MATERIAL LIKE ALUMINUM. THAT IS JUST THE CENTER HOLE. THEY USE THE SAME METAL SCREWS FOR THE 2 OUTSIDE HOLES THAT GO INTO WOOD FLOORING. *TR",
        "vin": "4YDF34722AR"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/27/2010",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340299,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A KEYSTONE RAPTOR 361 LEV 5TH WHEEL IN 2010 DISCOVERED AFTER I WENT HOME.THE DETACHABLE LADDER THAT MOUNTS ON THE ROOF. HAD SEVERAL BROKEN PLASTIC BRACKETS THAT HELD THE STEPS TO THE LADDER. TOOK IT BACK TO MIKE THOMSON IN CORNA CA. THEY WENT OUT TO THE TRAILER LOT TO TAKE PARTS OFF NEW LADDERS ON NEW TRAILERS AND FIX MINE. DISCOVERED MANY MORE KEYSTONE TRAILERS THAT HAD THIS LADDER BRACKETS WERE CRACK OR BROKEN ON THE LOT ALSO. WE USED REMAINING GOOD BRACKETS THAT WEREN'T BROKE. I USED THE LADDER TWICE, WHILE CLIMBING TO THE TRAILER ROOF SEVERAL PLASTIC BRACKETS CRACKED (POP). SCARED ME TO DEATH .. THAT'S THE ONLY THING HOLDING THE LADDER STEPS ON. A ACCIDENT READY TO HAPPEN.... I WEIGH 212 POUNDS. *TR",
        "vin": "4YDF36130AR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/20/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312432,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "FUZION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 2010 KEYSTONE FIFTH WHEEL TRAVEL TRAILER (RAPTOR 300MP),  A FLOOR SUPPORT GUSSET MAKES CONTACT WITH THE DRIVER SIDE REAR TIRE DURING SUSPENSION COMPRESSION. NO TIRE FAILURE YET BUT THE METAL IS VERY DEFORMED FROM NUMEROUS CONTACTS. ADDENDUM-THE RAPTOR MODEL IS NOT A DROP DOWN OPTION ON YOUR WEBSITE. I CHOOSE 'FUZION' JUST TO SATISFY THE FIELD REQUIREMENTS. *TR",
        "vin": "4YDF30024AR"
    }
]