[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084710,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KEYSTONE MONTANA EQUIPPED WITH A PUSH-BUTTON PINDICATOR FIRE EXTINGUISHER, MODEL NUMBER: M5PM. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V755000 (EQUIPMENT); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A LOCAL DEALER WAS NOT CONTACTED. THE CONTACT CALLED KIDDE AT 855-262-3540 IN JANUARY OF 2018 AND WAS ADVISED THAT THE PART WOULD BE SENT OUT IN 3-4 WEEKS, BUT THE CONTACT HAD NOT RECEIVED THE REPLACEMENT FIRE EXTINGUISHER AS OF YET. THE CONTACT ALSO STATED THAT A CASE WAS OPENED WITH KIDDE. THE VIN WAS NOT AVAILABLE. *TT    THE CONSUMER STATED THE SITUATION HAS BEEN RESOLVED. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760756,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sailun Tire Americas, Inc.",
                "productMake": "TOWMAX STR",
                "productModel": "ST",
                "productYear": "9999",
                "size": "ST225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "ST235/80R-16/10 TOW MAX STR TRAILER HIGHWAY BW TIRES NEED TO BE INVESTAGATED.  WE HAVE HAD 5 FLATS WITH ALL SAME PROBLEM OVER THE PAST 2 YEARS AND HAD READ THERE HAS BEEN 196 COMPLAINTS JUST LIKE OURS SINCE 2004",
        "vin": ""
    },
    {
        "components": "SUSPENSION,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661595,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 5TH WHEEL PIN ASSEMBLY HAS MOVEMENT AND HAS CAUSED DAMAGE TO THE INTERIOR CABINET INSIDE ABOVE IT. THERE HAS BEEN OTHER COMPLAINTS IN THE KEYSTONE FORUM ABOUT THE SAME PROBLEM. I HAVE BEEN INFORMED TO NOT TOW IT BY ONE DEALER. I HAVE TOWED IT LESS THAN 3000 MILES SINCE NEW.  *JS",
        "vin": "4YDF34028A4"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2013",
        "dateOfIncident": "10/05/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520485,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "LAST OCTOBER WE TOOK A TRIP FROM DAYTON, OH TO ORLANDO ? DISNEY WITH OUR 2010 KEYSTONE MONTANA.  ON THE RETURN TRIP FRIDAY OCT 5TH, JUST NORTH OF ATLANTA WE HAD A BLOWOUT ON ONE OF THE OEM GOODYEAR MARATHON TIRES, DRIVER SIDE REAR.   *TR    THERE WAS LIGHT TRAFFIC ON NEWLY BLACKTOPPED ROAD WITH CRUISE CONTROL.       BOOM!  TIRE AND DEBRIS WENT EVERYWHERE.  THE TIRE WAS SHREDDED AND WE HAD AAA/RV COME OUT AND PUT ON THE SPARE.  I IMMEDIATELY CHECKED ALL OF THE TIRE PRESSURES (81-82LBS) SO THEY WERE ALL WITHIN SPEC.  I CHECKED THEM BEFORE WE LEFT CALHOUN THE NEXT MORNING MAKING SURE THEY WERE ALL 80LBS.    WE LIMPED HOME ON SATURDAY.    THE TIRE WAS A GOODYEAR 235/80R16, MFG CODE: OH UN 1LHR 3608.    THE TIRE WAS RETURNED TO GOODYEAR PER THEIR INSTRUCTIONS.    BOTH OF THE PLASTIC FENDERS, THE SKIRT UNDER THE WATER HEATER, REAR SKIRT WERE DAMAGED AND THE BOTTOM OF THE TRAILER.    I HAVE REPLACED ALL OF THE TIRES WITH ANOTHER MAKE INCLUDING THE SPARE.  *TR",
        "vin": "4YDF36628A4"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/03/2013",
        "dateOfIncident": "05/09/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514773,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "REFRIGERATOR",
                "productYear": "1999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KEYSTONE MONTANA 3750FL EQUIPPED WITH A NORCOLD REFRIGERATOR, SERIAL NUMBER 12711643. THE CONTACT MENTIONED THAT THE REFRIGERATOR MALFUNCTIONED AND IT FAILED TO COOL ITS CONTENTS. THE CONTACT ALSO STATED THAT THE REFRIGERATOR HAS BEEN REPAIRED UNDER RECALL NHTSA CAMPAIGN NUMBER: 10E049000 ( EQUIPMENT) ON THREE DIFFERENT OCCASIONS BUT THE FAILURE RECURRED.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE EQUIPMENT WAS NOT REPAIRED.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/26/2013",
        "dateOfIncident": "04/22/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509656,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "POWER KING TOWMAX STR BLEW OUT AFTER ONLY 150 (ONE HUNDRED FIFTY) MILES OF SERVICE.   TIRE WAS SPARE FOR 3+ YEARS BEFORE BEING ROTATED INTO SERVICE.   AS SPARE, TIRE WAS PROTECTED FROM SUN, BUT MAY HAVE EXPERIENCED UV DAMAGE DUE TO COVER NOT COMPLETELY COVERING BACK.  PRESSURE OF 65PSI CONFIRMED 48 HRS PRIOR TO FAILURE.      ST225/75R15, DOT 83B4 GPB 0110 DY.     TIRE WAS MOUNTED IN DRIVER REAR POSITION OF FIFTH WHEEL RV TRAILER, A 2010 COUGAR 244RLS.   ESTIMATED LOAD ON TIRE WAS 1800LB.  TIRE WAS RATED FOR 2540LB AT 65PSI.   VEHICLE WAS DRIVEN AT 65MPH IN 90+ DEGREE AMBIENT TEMPERATURE FOR TWO HOURS PRIOR TO FAILURE.    NO TPMS, BUT DRIVER WITNESSED (IN REAR MIRROR) PIECES OF TREAD SEPARATING AND PULLED OVER BEFORE TRAILER WAS DAMAGED.  TIRE MAY HAVE BEEN DRIVEN FOR SEVERAL MILES, AS TIRE'S LOCATION (DRIVER SIDE REAR) MADE IT NOT VISIBLE.  *TR",
        "vin": "4YDF24421AC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/08/2012",
        "dateOfIncident": "08/24/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474309,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "AUGUST 24, 2012 TRAVELING ON VACATION FROM MULLICA HILL, NJ TO HATTERAS ISLAND NC.  TRAVELED THRU MILLSBORO DE WHEN TIRE #1 BLEW OUT ON THE DRIVER'S SIDE AXEL 2. TIRE EXPLODED FROM SIDE WALL.  NOTHING IN TREAD.  TIRE SHREDDED AND WRAPPED AROUND AXEL, DAMAGING UNDER SIDE OF TRAVEL TRAILER THRU TO INSULATION, SIDE PANEL AND WHEEL WELL COVER.  09/01/2012 RETURNING FROM HATTERAS ISLAND, NC REACHED DOVER, DE ENTERING TOLL BOOTH 2ND TIRE BLEW OUT, REAR AXEL PASSENGER SIDE SAME TYPE OF BLOW OUT SIDE WALLS, NOTHING IN TREAD.  TIRES HAVE APPROXIMATELY 3000 OR LESS MILES ON THEM.  REPLACED 1ST TIRE WITH SPARE, SECOND BLOWN OUT TIRE, REQUIRED ASSISTANCE TO BRING US ANOTHER TIRE AS WE DID NOT HAVE THE OPPORTUNITY TO REPLACE 1ST TIRE WITHIN THE WEEK.  TIRES HAVE BEEN KEPT FOR EXAMINATION AND A CLAIM HAS BEEN FILED WITH GOODYEAR TIRES.  TOOK TIRES TO BE REPLACED BY LOCAL TIRE DEALER, 2 REMAINING TIRES ARE ALSO SHOWING SIGNS OF SIDE WALL DAMAGE AND BREAKAGE IN RADIAL.  ALL 4 TIRES HAVE BEEN REPLACED WITH A DIFFERENT TIRE THRU OUR LOCAL TIRE DEALER.  *TR",
        "vin": "4YDF36627A4"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "06/03/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462646,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "LETTER FROM CONGRESSMAN COLE'S OFFICE ON BEHALF OF CONSTITUENT, RE HIS RECENT EXPERIENCE WITH GOODYEAR TIRE COMPANY *TGW  THE CONSUMER EXPERIENCED TWO TIRE BLOW OUTS SIMULTANEOUSLY. TWO DAYS LATER ANOTHER TIRE BLEW OUT AND SOON AFTER, THE FOURTH TIRE BLEW OUT.  THE CONSUMER REQUESTED REIMBURSEMENT FROM GOODYEAR, BUT WAS DENIED BASED ON THE FACT, THE TIRES WERE NO LONGER AVAILABLE FOR INSPECTION.  THE RV WAS DAMAGED WHEN THE TIRES BLEW OUT.  THE CONSUMER HAD TO FILE A CLAIM FOR DAMAGES TO THE FENDER SKIRTING AND SIDES OF THE CAMPER. *JB",
        "vin": "4YDF34628A4"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/02/2012",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460500,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD YEAR MARATHON 235/80R16 TIRES. DURING VACATION LAST YEAR 4 OF THESE TIRES DEVELOPED TREAD SEPARATION. 2 WERE DISCOVERED BEFORE THEY CAME APART AND WERE REPLACED, 2 OTHER TIRES THE TREAD SEPARATED AND CAME APART WHILE DRIVING ON THE HIGHWAY, ONE WAS THE SPARE WITH LESS THAN 400 MILES ON IT. THESE 2 TIRES CAUSED OVER $6,000 DOLLARS DAMAGE TO THE 5TH WHEEL. I CONSIDERED THIS A PRODUCT LIABILITY ISSUE AND KEPT ALL TIRES AND RIMS. I CONTACTED GOOD YEAR AND THEY REQUESTED ALL TIRES BE SENT TO THEM BY WAY OF THE LOCAL GOOD YEAR STORE AND I COMPLIED WITH THIS REQUEST. GOOD YEAR SENT THE 2 SHREDDED TIRES BACK SAYING THEY COULDN'T IDENTIFY ONE AS THEIRS HOWEVER THERE WAS NO PROBLEM WITH THE TIRES THEY LOST PRESSURE. GOOD YEAR KEPT THE OTHER 4 TIRES (2 WITH SERIOUS TREAD SEPARATION) AND NEVER ADDRESSED THESE. I QUESTIONED THE STATUS OF THERE EVALUATION AND NEVER RECEIVED A REPLY. IT'S CLEAR THAT THEY DECIDED TO KEEP THE EVIDENCE (THEFT) AND NOT OFFER ANY RESOLUTION. I HAVE ALL CORRESPONDENCE PLUS MANY PHOTOS OF THE TIRES AND DAMAGE WHICH MY INSURANCE COMPANY PAID FOR.",
        "vin": "4YDF34028A4"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/08/2011",
        "dateOfIncident": "08/19/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429194,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON INTERSTATE 85 ABOUT 20 MILES SW OF ATLANTA AT 60 MPH, TOWING MONTANA 5TH WHEEL, THE STREET SIDE TIRE ON THE FRONT LEADING AXLE HAD A SUDDEN BELT AND TREAD FAILURE. TIRE CASE DID NOT DEFLATE AND WE WERE ABLE TO PULL OVER TO THE ROAD SHOULDER. TIRE WAS A GOODYEAR MARATHON ST235 80R 16 LOAD RANGE E WITH ABOUT 3000 TO 4000 MILES AND CAME AS OEM TIRE ON THE UNIT. THE TIRE ON THE TRAILING AXLE ON THE SAME SIDE HAD JUST BEEN REPLACED WHEN I FOUND A 2 IN LONG SECTION OF THE INSIDE, WHERE TREAD MEATS THE SIDE WALL, COMING APART DURING A PRETRIP INSPECTION. I HAD CHECKED ALL THE TIRES AT A FUEL STOP JUST NORTH OF ATLANTA AND ALL TIRES WERE FOUND TO BE INFLATED TO CORRECT PSI AND NO PROBLEMS I COULD SEE BY SIGHT. THIS IS NOT THE FIRST TIME I HAVE HAD THIS SAME PROBLEM WITH MARATHON ST TIRES GOING BACK TO 1987 AND I AM NOT ALONE IN THIS BY THE AMOUNT OF COMPLAINTS I SEE ON RV BLOG'S. WHEN REPLACING A SET OF OEM MARATHON TIRES I USE AN LT TIRE IN THE CORRECT LOAD RANGE AND NOT A GOODYEAR TIRE. I HAVE NEVER HAD THIS PROBLEM REPEAT WITH LT TIRES. I DO THINK THAT THE MAX LOAD FOR A SINGLE MARATHON ST TIRE AT MAX COLD INFLATION PSI SHOULD BE TESTED AS I DO NOT THINK GOODYEAR IS CORRECT IN THERE GIVEN SPEC'S OF 3420 LB FOR AN ST235 80R 16 E TIRE. I HAVE NOTED THAT UP TO NOW I HAVE NOT HEARD OF AND DEATH OF INJURY BUT THERE IS ALWAYS DAMAGE TO THE RV WHEEL WELL AND THIS IS COSTLY TO REPAIR. SOONER OR LATER THERE WILL BE A DEATH OR INJURY WHEN A MARATHON ST TIRE HAS SUDDEN TREAD FAILURE.  *TR",
        "vin": "4YDF3602494"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420000,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "I OWN 2010 KEYSTONE MONTANA 3400RL FIFTH WHEEL TRAVEL TRAILER, AND TOOK DELIVERY FEBRUARY 9, 2010. IT WAS EQUIPPED WITH FIVE GOODYEAR MARATHON ST235/80R16 LOAD RANGE E TIRES. THE MANUFACTURE LOCATION CODE IS OHUN 1LHR, MFG DATE 3909. I HAD APPROXIMATELY 8500 MILES ON THE TIRES WHEN TRAVELING GARDEN STATE PARKWAY JUNE 10, 2011, THE LEFT FRONT TIRE EXPLODED, LEAVING ONLY MANGLED SIDEWALL AND DAMAGE TO THE WHEEL WELL.  I FOUND A GOODYEAR DEALER AND REPLACED THE BLOWN TIRE WITH ANOTHER MARATHON. THE FOLLOWING FRIDAY AFTERNOON, JUNE 17, 2011, WHILE TRAVELING ON I-64 WESTBOUND IN INDIANA, THE RIGHT FRONT TRAILER TIRE EXPLODED. AFTER CHANGING THE TIRE,  I CONTINUED ON TO MY CAMPGROUND NEAR SHILOH, IL, AND OBTAINED A TOWMAX BRAND REPLACEMENT TIRE. WE BEGAN OUR NEXT TRIP JULY 20, 2011. WHEN I PULLED INTO OUR CAMPSITE AT COLUMBIA, MO, WE NOTED THAT THE LEFT REAR TRAILER TIRE WAS GOING FLAT, AND COULD HEAR AIR ESCAPING.  I REMOVED THE TIRE AND INSTALLED THE SPARE.  THE NEXT MORNING, I TOOK THE TRAILER AND FLAT TIRE TO MCKNIGHT TIRE AND AUTO CENTER, COLUMBIA, TO HAVE THE TIRE REPAIRED.  THEY INSPECTED IT AND STOPPED COUNTING AT SIX HOLES, ALL ALONG THE OUTER THREAD GROOVE. AFTER SEEING THE TIRE, I TOLD THEM TO ALSO REPLACE THE RIGHT REAR TIRE (THE LAST OF THE ORIGINAL TIRES ON THE TRAILER) BECAUSE I FELT THAT IT WOULD ALSO FAIL SOON. WHEN THEY REMOVED THE RIGHT REAR, THEY NOTED TREAD SEPARATION AND SOME STEEL BELT WAS SHOWING IN THE TREAD. THE TWO REPLACEMENT TIRES ARE WESTLAKE BRAND.  I CARRY A 120 VOLT, 150 PSI, 6 GALLON PORTER CABLE AIR COMPRESSOR IN THE TRAILER BASEMENT AND CHECK AND ADJUST THE COLD PRESSURE ON EACH TIRE TO 80 PSI EVERY MORNING BEFORE TRAVELING. I THINK THAT THIS WAS A BAD LOT OF TIRES WHICH SUFFERED FROM THREAD SEPARATION.  *KB",
        "vin": "4YDF34020A4"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/20/2010",
        "dateOfIncident": "12/17/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371255,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "1210",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 KEYSTONE MONTANA WITH A NORCOLD REFRIGERATOR, SERIAL NUMBER 12500065. THE CONTACT STATED THAT THE MANUFACTURER DID NOT PROVIDE THE PARTS. THE MANUFACTURER SAID THEY HAD TO HAVE THE SERIAL NUMBER IN ORDER TO SHIP THE PARTS WITHIN  THREE TO FOUR WEEKS. THE MANUFACTURER SAID THAT THEY WERE NOT GOING TO SHIP THE PARTS IN BULK TO THE DEALERS; THEY WERE ONLY SENDING PARTS BASED ON ONE EACH ORDER. THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 1500.",
        "vin": "4YDF34028A4"
    }
]