[
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395431,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE CRUISE CONTROL FAILED TO DEACTIVATE WHILE DEPRESSING THE BRAKE PEDAL. THE CONTACT STATED THAT THE ELECTRONIC STABILITY CONTROL WARNING LIGHT WAS ILLUMINATED. THE CONTACT HAD NOT TAKEN THE VEHICLE TO BE DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT UNDER RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 96,000.",
        "vin": "KNDKG3A49A7"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318776,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING ON THE VEHICLE IT SOUNDS LIKE SOMEONE IS PUSHING ON THE GAS PEDAL .SOMETIME THE START UP AND SOME TIMES IT DOESN'T. NOW ALL THE INTERIOR LIGHTS WENT OUT AND ALSO THE BRAKE LIGHTS AND THE REGULAR LIGHTS ARE NOT WORKING . THEY JUST  STOP",
        "vin": "KNDKG3A43A7"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144546,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A COMPLAINT BEFORE KIA CALLED AND SAID THEY WOULD REPLACE SEAT BELT AS A COURTESY BUT I WOULD HAVE TO PAY LABOR, DEALER SAID A MOUSE CHEWED IT, I HAD 2 PEOPLE LOOK AT IT AND IT IS FRAYED, ONLY ONE, NO OTHER SEAT BELT, COAT, TOWELS, WALMART TOTES NOTHING NOT EVEN THE PAPERS THAT CAME WITH CAR AND I AM THE ONLY ONE THAT DRIVES IT EXCEPT FOR DEALERSHIP MECHANICS. I AM NOT PAYING FOR SOMETHING THAT THEY KNOW IS THEIR FAULT. I FILED IN SEPTEMBER, AND THEY JUST CALLED A WEEK AGO AND TODAY, IF YOU CAN'T HELP ME I WILL TAKE THE MATTER TO THE STATE POLICE FOR THE SEATBELT FRAYED IS RIGHT ACROSS MY CHEST . NOTHING HAPPENED YET BUT IF I AM IN A ACCIDENT I WILL BE HURT",
        "vin": "KNDKGCA36A7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11141234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 KIA SPORTAGE. THE CONTACT STATED THAT AN ANIMAL RAN OUT ONTO THE ROAD AND CAUSED HIM TO CRASH INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED CHEST INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED AND TOWED TO A TOW YARD. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED; HOWEVER, THE CALL WAS DISCONNECTED. THE APPROXIMATE FAILURE MILEAGE WAS 111,000.",
        "vin": "KNDKG3A49A7"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11127973,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INSIDE RIDER SEATBELT IS FRAYED BAD, WHEN ON IT IS ACROSS CHEST WHEN NOT USED FRAYED PART IS DOWN INSIDE, THE KIA GARAGE IS BLAMING A MOUSE CHEWED, NO WAY COULD A MOUSE GET IN THAT TINY PLACE THAT IS ONLY SIZE OF A THIN PAPER PLATE, KIA WHEN I CALLED HE HUNG UP ON ME,IF I AM IN A ACCIDENT INJURED OR DIE FROM THIS THEY WILL BE SUED, I DROVE FRIDAY,SATURDAY AND MONDAY WITH AIR ON NO SMELL, TUESDAY DRIVER SAID AS SOON AS HE GOT IN HE COULDN'T STAND THE SMELL ,THEY SAID ON MY COPY OF SERVICE PAPER THEY FOUND 2 MICE LIVING NONE DEAD, BUT PERSON AT GARAGE SAID HE FOUND 1DEAD, ONE LIVING, MY PAPER I GOT FROM GARAGE SAYS 2 LIVING NONE DEAD, THIS IS BESIDE THE POINT FOR I KNOW AND SO DOES GARAGE AND KIA MFG. KNOW THERE IS NO WAY A MOUSE COULD GET IN THERE AND CHEW, IT IS FRAYING LIKE IT IS CATCHING ON VERY THIN SPACE WHERE YOU GET IT OUT. I DON'T KNOW HOW TO GET KIA TO LISTEN AFTER KIA SERVICE SAID MICE PROBLEM,WHAT IS REALLY BAD IS KIA MFG. HANGING UP ON ME , GARAGE SAYING WHAT THEY SAID, AND SEAT BELT WILL NOT PROTECT ME IN A ACCIDENT",
        "vin": "KNDKGCA36A7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110944,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS RUNNING AND BEGAN TO LEAVE STORE PARKING LOT, CAR WAS KNOCKING, AND THEN ENTIRE CAR STOPPED WORKING-POWER STEERING, LIGHTS, BRAKES. CAR WOULD NOT START AGAIN. AFTER TOW AND DIAGNOSIS, THE ENGINE WOULD NOT TURN OVER. NO OIL WAS FOUND IN THE ENGINE. THE OIL LIGHT HAD BEEN INTERMITTENTLY LIT ON HILLS BUT WAS NOT ON CONSISTENTLY. CAR HAD BEEN KNOCKING INTERMITTENTLY THE WEEK PRIOR. TECHNICIAN SAID THAT IT WAS POSSIBLE ROD FAILURE. THERE WERE NO OIL LEAKS UNDER THE CAR. THERE WAS NO UNUSUAL SMELL UNTIL IT DIED. OIL HAD BEEN CHANGED LESS THAN 3 MONTHS PRIOR.",
        "vin": "KNDKG3A41A7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 2,
        "odiNumber": 11101169,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A SIDE IMPACT YET THE SIDE CURTAIN AIRBAGS DID NOT DEPLOY.  THE ACCIDENT RESULTED IN THE DEATH OF A REAR SEAT PASSENGER.  THERE WERE NO WARNING LIGHTS ILLUMINATED BEFORE THE ACCIDENT SUCH AS \"CHECK ENGINE\" OR THE AIRBAG WARNING LIGHT.  VEHICLE WAS TURNING LEFT ONTO A HIGHWAY AND WAS \"T BONED\" BY A UPS TRUCK TRAVELING AT A HIGH RATE OF SPEED.  FRONT AIRBAGS DEPLOYED BUT SIDE CURTAIN AIRBAG DID NOT DEPLOY.  FRONT PASSENGERS SURVIVED THE CRASH, ALBEIT WITH INJURIES REQUIRING HOSPITALIZATION.   INSURANCE COMPANY WILL BE TAKING POSSESSION OF THE VEHICLE IN THE NEXT DAY OR TWO.",
        "vin": "KNDKGCA34A7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061373,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  IT RAINS AND THERE IS SUBSTANTIAL WATER ON ROAD,  MY KIA HAS TURNED OFF. THIS HAS HAPPENED 3 TIMES.  ON A RAINING DAY TURNING INTO PARKING LOT THAT HAD LARGE PUDDLE   ON A DAY WHERE THERE A SUDDEN TORRENTIAL RAIN.  THIS HAPPENED ON WANTAGH PARKWAY IN LONG ISLAND.  ON A RAINY DAY WHEN TRUCK WENT THRU PUDDLE OF WATER NEXT TO ME AND SPLASHED  A LOT OF WATER IN MY DIRECTION.  THIS HAPPEND ON A CITY STREET.",
        "vin": "KNDKGCA31A7"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "11/12/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11061398,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 KIA SPORTAGE. WHILE DRIVING 55 MPH,  A DEER JUMPED IN FRONT OF THE CONTACT'S VEHICLE AND DAMAGED THE WINDSHIELD. THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO RESPOND. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT AND PASSENGER SUSTAINED ABDOMINAL BRUISES AND CHEST INJURIES, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND THEN TAKEN TO STATE FARM INSURANCE WHERE IT WAS DIAGNOSED. THE VEHICLE WAS DESTROYED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 69,594.",
        "vin": "KNDKG3A40A7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947065,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE ON 11/28/2016 NHTSA RECALL #: 16V815 AND IMMEDIATELY CALLED BERGSTROM KIA IN OSHKOSH, WI TO SCHEDULE REPAIR.  WAS TOLD PARTS NEEDED TO BE ORDERED AND WOULD RECEIVE NOTICE WHEN PARTS WERE IN.  CALLED AGAIN ON 1/23/2017 AND WAS TOLD PARTS HAD NOT ARRIVED AND DEALER HAD BEEN TOLD THAT KIA COULD NOT PROVIDE DATE WHEN PART WOULD BECOME AVAILABLE.  CONTINUING TO PARK VEHICLE OUTSIDE BECAUSE OF FIRE HAZARD AS RECOMMENDED IN RECALL NOTICE.  NOT VERY CONVENIENT IN WISCONSIN IN WINTER.",
        "vin": "KNDJE723797"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/19/2013",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556636,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KIA SPORTAGE. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THAT THE PASSENGER OCCUPANT SEAT SENSOR AND THE DRIVER'S SIDE SEAT BELT TENSION SENSOR WERE BOTH DEFECTIVE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "KNDKGCA34A7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2012",
        "dateOfIncident": "11/26/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486083,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 KIA SPORTAGE. THE CONTACT STATED THAT THE KEY BECAME STUCK IN THE IGNITION AND HE WAS ABLE TO SHIFT THROUGH THE GEARS WITHOUT DEPRESSING THE GEAR SHIFT BUTTON. THE VEHICLE WAS NOT TAKEN TO A MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE ISSUE. THE FAILURE AND CURRENT MILEAGES WERE 62,619.",
        "vin": "KNDKG3A48A7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/30/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10398341,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADREST POSITION IN NEW VEHICLES HAS CAUSED THORACIC OUTLET SYNDROME IN THIS DRIVER WHO IS 5'4\".  MY CERVICAL SPINE IS FORCED OUT OF ALIGNMENT WITH MY THORACIC AND LUMBAR SPINE.  AFTER DRIVING FOUR OR FIVE HOURS WHICH I DO FOR WORK, I EXPERIENCE NECK  AND SHOULDER PAIN.   ARM AND HAND TINGLING/NUMBNESS AND PAIN IS SO SEVERE  THAT IT HAS INTERFERED WITH THE PERFORMANCE OF MY JOB.   I CAN PROMISE YOU THAT IF I EXPERIENCED A REAR-END COLLISION, I WOULD SUFFER A CLOSED HEAD INJURY AS MY HEAD AND NOT MY NECK RESTS DIRECTLY AGAINST THE HEADREST.  I'D RATHER TAKE MY CHANCES WITH WHIPLASH.   JUST AS ALL DRIVERS DON'T HAVE THE SAME LEG LENGTHS, NEITHER DO ALL DRIVERS HAVE THE SAME TORSO LENGTH.   THERE WILL BE MANY, MANY, MANY MORE SEVERE INJURIES IN SHORTER PEOPLE.  JUST WATCH THE DATA, WHICH WILL SPEAK VOLUMES.  THERE ARE INJURIES NOW WITHOUT COLLISION.  THERE IS NO ADJUSTMENT AVAILABLE TO LOWER THE HEADREST TO ITS INTENDED POSITION, AGAINST THE NECK.  THE ONLY ALTERNATIVE IS TO REMOVE IT COMPLETELY.  *TR",
        "vin": ""
    }
]