[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "03/30/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459357,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The Power steering had started to feel hard and squeaking some time ago. I was driving day before yesterday and I noticed a few times that the steering was very difficult to turn which could have been dangerous. While doing some research I found that this has happened to some RX models. I went to the dealer and they told me that there is no recall for this issue and any fix would be out of pocket.",
        "vin": "jtjzb1ba5A2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434048,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Water leakage problem in the trunk area causing water buildup on and around the spare tire. A rust issue and potential electric short circuit issue.",
        "vin": "Jtjbc1ba3a2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433261,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "We were 2 hours into a 9 hour drive when I noticed smoke in the rear view mirror.  I continued to drive as I thought it may have been coming from another vehicle.  I drove to the nearest gas station (about 3 mi) and pulled in.  Upon exiting the vehicle,  we found the back window and the entire back of the SUV covered in oil.  There were no warning lights and no engine noises.  We checked the oil and it was so low that it did not register on the dip stick.  We added 2 quarts of oil which then registered on the tip of the dip stick.  We then added another quart of oil and drove to a nearby service station (1/2 mi).  The mechanic could not diagnose the problem since he couldn't put it on his lift (it was occupied by another vehicle).  He contacted two other service stations in the area and found one less than a mile away that had a lift open.  We added 2 more quarts of oil and drove to the next service station.  The mechanic put the vehicle on the lift and quickly found the problem - a pin hole in the oil line.   He was able to find a replacement part (not the original part as it had been discontinued) and get us up and running the same day.  We were very fortunate that I noticed the smoke - if I had not noticed it and continued to drive (we were 10 minutes from driving over a bridge tunnel) it could have been catastrophic.  We finished the 7 additional hours of driving that day and after being gone for a week, have now returned home (another 9 hours).  The mechanic told me the part had been recalled, but when I searched this sight, I found lots of similar reports - but no recall.  Coincidentally, I had had the oil changed 4 days before beginning this trip.  It is surprising that there are so many reports of this incident, but no recall by Lexus.",
        "vin": "2t2bk1ba4ac"
    },
    {
        "components": "ENGINE,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving along normally, started seeing a flashing \"low oil pressure warning\". Within seconds, engine started revving uncontrollably and would not make power. Was able to coast into a parking lot. On dipstick inspection, engine had lost ALL engine oil and entire car was covered in oil. Suspect that oil spilled out at some point on the road- danger to other cars.  Vehicle was towed to local dealer, diagnosed as a blown oil cooler pipe, causes all engine oil to spray out in seconds. This is a known problem, addressed in Lexus Technical Service Bulletin L-SB-0154-11 and a recalled part in Canada, but not in the US. Factory part is a rubber oil line that deteriorates and bursts, Lexus has an upgraded medal line available.   Service invoice can be updated once service completed if needed.",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "the rubber oil cooler hose busted/exploded on 6/03/2021 on the way home from vacation 2 hours away from home late at night with my 2 children. there were no warning lights etc. all of a sudden it started making this horrible sound, i stopped on side of rode to everything covered in oil.  had to get the vehicle towed to home. the engine and all under hood was covered in oil.  i see tons and tons of complaints on this issue but no recalls. i would think this is very dangerous. shouldn’t this be replaced for free and /or reimbursement. spoke with ballet lexus roswell. they were familiar with this problem but no reimbursement offered therefore vehicle is still sitting in garage undeliverable.",
        "vin": "2T2ZK1BAXAC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil cooler high pressure line, rubber elbow, pin hole oil leak/spray.  TSB:  POL.14.02 (NHTSA: 10056509).  Leaked oil out with check engine light/low oil pressure warning just as I arrived home.  Line of oil in driveway.  Diagnosed leak from this rubber elbow.  One quart of oil left in oil pan.  After review of NHTSA website (and many, many Google hits) found this to be a well known problen by Lexus.  No recall ever issued.  I never received written notice from Lexus, and dealership that vehicle has been to many times never mentioned anything.  Lexus denies any extended warranty at this time.  Absolutely unacceptable.",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422984,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil cooler line, rubber elbow potential failure.  No notice letter from Lexus received warning of their TSB: POL.14.02 (NHTSA#: 10056509).  Voluntary extended warranty coverage is expired now and no support from Lexus offered.  Rubber elbow cannot be simply replaced as the newly desigend replacement is a metal elbow.  Entire assembly must be replaced.  Extremely expensive.  Unacceptable for a flaw to endanger the engine, and possibly to cause a fire with oil spray onto a hot engine/exhaust.",
        "vin": "2T2BK1BA9AC"
    },
    {
        "components": "ENGINE,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422808,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 LEXUS RX350. The contact stated while driving 65 mph, she saw light white smoke floating through the air which she initially assumed came from the vehicle ahead of her. As she exited the highway and came to a stop, the low oil pressure warning light illuminated with an abnormal knocking sound coming from the engine. The contact pulled over and called her brother for assistance. Upon inspection, the contact's brother discovered that there was no oil in the vehicle, even though the vehicle had received an oil change five days prior. The contact called the local dealer who offered to tow the vehicle to the dealer to be inspected. The contact declined the tow, and instead had the vehicle towed to Lexus of Pleasanton (4345 Rosewood Dr, Pleasanton, CA 94588) where the mechanic discovered that the engine oil cooler pipe was fractured. The contact discovered an unknown recall on the vehicle. The manufacturer was notified of the failure. The contact was informed that the Vin was not under recall or warranty. The vehicle was not repaired. The failure mileage was approximately 199,000.",
        "vin": "2t2bk1ba7ac"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The hybrid transmission failed at 146k and the light went on. When we took it to the dealership, they said that there was metal bits. The owner of the vehicle when into the dealership asking the dealership to set tire pressures and inspect floor mats for proper installation, they performed an inspection and inflated the tires. The owner went in and stated that the check hybrid system warning light is on. Oil pump range/performance. NOTE: no road test performed. Possible additional work needed. Transmission oil pump inoperable due to metal in fluid shorting the pump. The dealership took a fluid sample. They had found lots of metal particles present in the fluid. They recommend replacing the transmission, oil pump, cooler, cooler hoses, and clamps, flush the metal lines.",
        "vin": "JTJZB1BA7A2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415595,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OIL COOLER LINE BUSTED AND DID NOT KNOW TILL I GOT HOME THANK GOD THE ENGINE DID NOT SEIZE. COME TO FIND OUT THE LINE IS MADE OF RUBBER AND NOT METAL. I UNDERSTAND LEXUS IS AWARE BUT THEY ARE NOT CALLING FOR A RECALL. I TH8NK THEY SHOULD PAY FOR WORK PERFORMED",
        "vin": "2T2BK1BAXAC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396141,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ROARING NOISE APPEARED IN 2020 UPON ACCELERATION OF THE VEHICLE FROM THE REAR DIFFERENTIAL THAT BECAME LOUDER OVERTIME WHICH WOULD NOT BE MENTIONED IN THE MULTIPLE INSPECTION REPORTS EVEN WHEN POINTED TO THE SERVICE REPRESENTATIVES ;INSTEAD ONE OF THEM VERBALLY DEMANDED  $750 FOR THE DIAGNOSTICS AND $5000 FOR THE REPAIRS! THE OTHER GAVE AN INVOICE ESTIMATE OF $2000 FOR THE PART AND $800 FOR THE LABOR ON 04FEB2021 AS ATTACHED.TOYOTA HAS ISSUES A TECHNICAL BULLETIN T-SB-0080-13 REV 1 DATED JUNE 14, 2013 TITLED \"REAR DIFFERENTIAL COUPLING GROWL NOISE\" AVAILABLE ONLINE, INDICATING THE COMPANY IS AWARE OF THE PROBLEM IN THE POWERTRAIN'S ELECTRO MAGNETIC COUPLING (THAT CONNECTS TO THE DRIVE SHAFT AND SITS IN FRONT OF REAR DIFFERENTIAL) LEXUS PART # 41303-48010 WHICH IS ALSO USED IN 2006-09 RAV 4 A WITH DIFFERENT TOYOTA PART NUMBER. WHILE THIS ELECTRO MAGNET COUPLING IS LISTED IN THEIR BULLETIN AS USED IN RAV4 2006-12 4WD, IT DID CAUSE AN IDENTICAL GROWLING NOISE IN MY 2010 LEXUS RX 350 AWD WHICH WAS NOTIFIED TO LEXUS CORPORATE HQ VIA AN ONLINE COMPLAINT ON 08FEB21, WHOSE CORPORATE REPRESENTATIVE CALLED SAME DAY TO RESOLVE IT WITHOUT RESOLUTION TO DATE DESPITE A FIRM PROMISE OF CALL BACK WITH RESOLUTION PLAN ON 12FEB21! LEXUS PARTS DEPARTMENT IN BOTH LOCAL DEALERSHIPS, WHEN SPECIFICALLY ASKED TO PIN POINT PARTS REQUIRED TO REPAIR THE COUPLING, DECLINED TO PROVIDE ANY INFORMATION!WHEN ASKED TO SELL PARTS # 90363-95003 & 90363-65004 THEY DECLINED AND SAID \"COUPLING\" & ITS \"PARTS/BEARINGS\" ARE 'OUT OF STOCK' IN THE UNITED STATES AND RECOMMENDED ME INSTEAD TO SELL MY FUNCTIONAL AND MAINTAINED VEHICLE AS SOON AS POSSIBLE! BEARING FAILURE DURING DRIVING MAY POTENTIALLY RESULT IN FATAL ACCIDENTS AND PUT LIFE AND SAFETY OF VEHICLE OCCUPANTS AND O! MANUFACTURERS SHOULD ALERT CUSTOMERS ABOUT ANY SUCH DEFECTS IN THE DESIGN OF SUCH PARTS AND PROPOSE RESOLUTION IN A TIMELY FASHION.",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394281,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED WHILE USING THE DEFROSTER, THE FRONT WINDSHIELD CRACKED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 106,955.",
        "vin": "2T2ZK1BA9AC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2021",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386308,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RX450H ' CHECK HYBRID SYSTEM' LIGHT CAME ON WHILE DRIVING 70 MPH ON I95. ONCE THE LIGHT CAME ON I NO LONGER WAS ABLE TO GIVE MY CAR ANY GAS OR ACCELERATE AND SLOWLY MY CAR STARTED DECREASING IT'S SPEED. ATTEMPTING TO PULL OVER TO THE SIDE OF THE HIGHWAY ALL MY LIGHTS ON MY DASH BOARD CAME ON AND THE CAR SHUT DOWN. AFTER TURNING OFF MY CAR AND LETTING IT SIT FOR A FEW MINUTES I WAS ABLE TO TURN THE CAR ON AND DRIVE TO THE NEXT EXIT. AFTER HAVING MY CAR TOWED TO A MECHANIC I WAS TOLD THEY WERE UNABLE TO FIND ANYTHING WRONG WITH THE CAR. I PICKED UP MY CAR AND IT DROVE PERFECTLY FINE FOR ABOUT 2 WEEKS. THAN IT HAPPENED AGAIN. AFTER THE MECHANICS LOOKED AT MY CAR AGAIN THEY DETERMINED THAT MY FUEL PUMP IS NEEDING TO BE REPLACED. I HAVE READ MANY STORIES OF OTHERS WITH MY SAME SITUATION. I AM CURIOUS AS TO WHY MY YEAR/MAKE/MODEL ARE NOT ON THE RECALL LIST FOR FUEL PUMP REPLACEMENT. THE PUMP BEING RECALLED IS THE SAME MAKE AND MODEL THAT IS IN MY CAR.",
        "vin": "JTJBC1BA7A2"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375109,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN RATTLE NOISE ON VIBRATION WHILE DRIVING ON UNEVEN SURFACES (LIKE PATCHED UP OR REPAIRED ROADS, ROADS WITH GRAVEL ON IT) OR TURNING. THIS ISSUE WAS LISTED IN THE L-SB-0026-11 BUT IT IS EXPIRED NOW. THE STABILITY MAY BE AFFECTED AS YOU DRIVE OVER BUMP EVEN ON LOW SPEED. THIS ISSUE AFFECTED A LOT OF CARS AND LEXUS WAS REPLACING THIS PART AS MENTIONED IN THE BULLETIN. I ACQUIRED THIS CAR RECENTLY AND IT HAS THE PROBLEMATIC STEERING WHEEL THAT THE PREVIOUS OWNER CARED LESS TO REPLACE. I FEEL THIS PART SHOULD BE RECALLED AS LEXUS REFUSED TO TAKE RESPONSIBILITY FOR THIS MANUFACTURING DEFECT (BULLETIN ISSUED) WHEN I RECENTLY CONTACTED CORPORATE OFFICE ABOUT IT LEAVING ME WITH $4000 REPAIR ON THIS LOW MILES CAR FOR ITS AGE WITH THAT SERIOUS PROBLEM THAT IS A PART OF SUSPENSION AND VIBRATES AND MAKES NOISES.",
        "vin": "2T2BK1BA0AC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A USED 2010 LEXUS RX 450H 3.5L WITH 130,000 MILES. AT APPROXIMATELY 132,000 MILES WHILE DRIVING ON THE HIGHWAY, OIL COOLER LINE SUDDENLY EXPLODED WITHOUT WARNING AND VEHICLE LOST ALL OF ITS OIL, FULL SYNTHETIC, WITHIN SECONDS. OIL SPLATTERED ALL OVER ENTIRE UNDERBODY. VEHICLE COMPLETELY UN-DRIVABLE AND HAD TO BE TOWED. NO PRE WARNING FROM OIL LIGHT OR ANY OTHER INDICATION OTHER THAN LOUD BANG AND SMELL OF BURNING OIL. HUGE SAFETY RISK AND LIKELIHOOD OF COMPLETE ENGINE LOSS OR SEIZING IF I HAD CONTINUED TO DRIVE ANY LONGER, POSSIBLY LEADING TO AN ACCIDENT OR WORSE. IMMEDIATELY PULLED OVER AT SMELL OF HOT OIL AND HAD IT TOWED TO REPAIR SHOP. ESTIMATED COST ABOUT $ 1,000. REPAIR SHOP STATED THIS IS A KNOWN ISSUE WITH TOYOTA OIL LINE COOLER HOSE AND LEXUS MODELS OF THIS YEAR AND SHOULD HAVE BEEN A RECALL ITEM. RECOMMENDED REPLACEMENT HOSE IS NOW METAL.",
        "vin": "JTJBC1BAXA2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A CHECK ENGINE LIGHT AND SLIP INDICATOR ON - NEXT DAY MY CAR LOST COMPLETE POWER IN THE MIDDLE OF A CITY ROAD ' VEHICLE WAS TRAVELING ABOUT 15-20 MPH. WHEN ATTEMPTING TO RESTART IT WOULD ROUGHLY ENGAGE THEN SHUT DOWN AGAIN.   CONTACTED A CERTIFIED LOCAL LEXUS MECHANIC HAD THE CAR TOWED TO HIS SHOP. AFTER ASSESSMENT HE DETERMINED THE VEHICLE'S FUEL PUMP \"DISINTEGRATED\" INTERNALLY.   WHEN THEY CHECKED FUEL PRESSURE AT THE RAIL THERE WERE PARTICLES IN THE FUEL ' UPON FURTHER INSPECTION THE SPARKS PLUG WERE FOULED AND FUEL INJECTORS CLOGGED.   THE MECHANIC INDICATED HE HAD RECENTLY SEEN THE SAME ISSUE A MONTH EARLIER HOWEVER WITH A TOYOTA FJ.  I BEGAN TO RESEARCH WHAT HAPPENED WHEN I RAN ACROSS THE FUEL PUMP RECALL ISSUED BY TOYOTA FOR CERTAIN MODELS (JANUARY 2020) HTTPS://PRESSROOM.TOYOTA.COM/TOYOTA-IS-CONDUCTING-A-SAFETY-RECALL-INVOLVING-CERTAIN-TOYOTA-AND-LEXUS-VEHICLES-2/  ALTHOUGH MY MODEL IS NOT INCLUDED IN THIS RECALL MY VEHICLE MIMICS THE BEHAVIOR OF THOSE RECALLED. INDICATOR LIGHTS, LOSS OF POWER AND ULTIMATELY AN ASSESSMENT OF FUEL PUMP ISSUES LEADING TO A TOTAL LOSS OF POWER.",
        "vin": "2T2ZK1BA7AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL COOLLER LINE  EXPLODED,ENGINE LOST HALF OF OIL,REPAIR COST OVER $400.",
        "vin": "2T2BK1BA9AC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL IN 79,000 MILES NO ACCIDENTS VEHICLE MAKES KNOCKING NOISES AS IT  JUMPS UP AND DOWN (BUMPY) OR VIBRATES WHEN DRIVING OVER UNEVEN ROADS (GRAVEL). YOU CAN FEEL IT IN YOUR HANDS. ALSO IT RATTLES AND MAKES NOISES WHEN TURNING. IT FEELS LIKE THERE IS NO LUBRICATION. THE DRIVE FEELS NOT ONLY UNSTABLE BUT ALSO IS VERY DISTRACTIVE WHILE DRIVING. TOOK CAR TO LEXUS AND WAS TOLD IT IS STEERING COLUMN OR SHAFT OR BOTH; QUOTE AROUND $4000 WITH LABOR. SEEMS LIKE A LOT OF PEOPLE HAD SAME PROBLEMS AND THE STEERING IS MANUFACTURING DEFECT THAT SHOULD BE RECALLED. THERE WAS BULLETIN ISSUED BUT MY CAR IS OUT OF WARRANTY NOW WHEN THE PROBLEM BECAME PROMINENT. THERE SHOULD BE NO TIME LIMIT FOR THAT.",
        "vin": "2T2BK1BA0AC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A FREEWAY OFFRAMP ALONE ABOUT 10 PM MONDAY AUGUST 31 OUR SUNROOF SUDDENLY EXPLODED OUTWARD.  THERE WAS A BOOM IN THE CAR, THAT SEEMED LIKE A TENSION RELEASE IN THE FRONT LEFT (DRIVER SIDE) OF THE VEHICLE.  WE DID NOT IMMEDIATELY KNOW WHAT HAPPENED BUT WHEN WE STOPPED AT HOME REALIZED THE SUNROOF HAD BROKEN OUTWARD, GLASS SPILLED DOWN INTO THE VEHICLE WHEN I OPENED THE SUNROOF COVER.",
        "vin": "JTJBC1BAXA2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON 275 HIGHWAY IN TAMPA, FL, AND I GOT THESE MESSAGES ON ECO, \"MOTOR OIL AND PRESSURE LOW\" AND CHECK ENGINE    THE MECHANIC ADVISED TO CHECK WITH THE DEALER.    PLEASE  ADVICE. THANKS",
        "vin": "JTJZK1BA9A2"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330770,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR OIL LEAKING FROM A FAULTY ENGINE OIL COOLER LINE WHILE CAR IS MOVING OR TURNED ON.    OIL IS ALL OVER ENTIRE UNDERCARRIAGE, BACK BUMPER, BACK WINDSHIELD & WIPER AND INSIDE OF TIRES. GARAGE FLOOR AND DRIVEWAY HAVE OIL SPLATTERED EVERYWHERE. THE WHOLE BACK OF CAR IS COVER IN OIL. AFTER RESEARCHING, I FOUND THIS IS A KNOWN ISSUE FOR LEXUS RX 350/450H MODELS BETWEEN 2009-2011.  NO OIL OR ENGINE WARNING LIGHT CAME ON.  EVEN AFTER THE FAULTY PART IS REPAIRED, MY CONCERN THEN BECOMES POTENTIAL ENGINE FAILURE FROM LACK OF OIL.  *TR",
        "vin": "JTJBC1BA7A2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX 350. THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, THE OIL PRESSURE WARNING LIGHT ILLUMINATED. THE CONTACT PULLED OFF TO THE SIDE OF THE ROAD AND CHECKED THE OIL. THERE WAS NO OIL IN THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHERE IT WAS DISCOVERED THAT THE OIL COOLANT LINE FRACTURED. THE VEHICLE WAS REPAIRED AND RETURNED TO THE CONTACT. AFTER PICKING UP THE VEHICLE, WHILE DRIVING 45 MPH, THERE WAS AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE STARTED TO DRIVE ROUGHLY. THE VEHICLE WAS TOWED BACK TO THE INDEPENDENT MECHANIC TO BE DIAGNOSED. THE VEHICLE WAS DIAGNOSED WITH ENGINE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE DEALER NOR THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 160,000.",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307323,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWLY ENTERING FROM I15 TO H-78 WEST.  SUDDENLY CAR BEGAN TO REV AND ACCELERATE AS IF I WAS FLOORING GAS PEDAL.  I JABBED AT PEDAL A COUPLE TIMES AND HIT BRAKES...IT STOPPED WITHIN A FEW SECONDS....NOT SURE IF WHAT I DID HAD ANYTHING TO DO WITH IT STOPPING.  MY GAS PEDAL IS NOT STICKY AND SMOOTHLY ADJUSTS.  MY VEHICLE IS IN PRISTINE CONDITION AND HAS HAD ALL MAINTENANCE.  I WAS FORTUNATE I HAD SEVERAL CAR LENGTHS CLEAR.  I AM 100% CERTAIN I DID NOT ACCIDENTALLY SLIP OR PUSH ON PEDAL.  WHILE IT WAS ACCELERATING I EVEN LIFTED FOOT COMPLETELY OFF PEDAL AND IT STILL WAS GOING.",
        "vin": "JTJZK1BAXA2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256891,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL COOLING LINE BUSTED AND COMPLETELY EMPTIED OIL ALL OVER THE ROAD WHILE DRIVING. WAS MAKING LOUD NOISES AND HAD TO COME TO A COMPLETE STOP AND PULL OVER",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256531,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING UNDER 30 MPH.  LIGHTS CAME ON FROM THE DASHLIGHTS CAME ON PROMPTING LOW FUEL PRESSURE. SHORTLY AFTER, WEIRD NOISE COMING FROM ENGINE PULLED OVER TO CHECK UNDER THE HOOD.  SEEN A LOT OF OIL LOST.  HAD THE CAR TOWED TO LEXUS DEALERSHIP AND IDENTIFIED THAT IT WAS HTE ENGINE OIL COOLER PIPE.  THIS WAS A KNOWN PROBLEM WITH TOYOTA/LEXUS.  WAS TOLD THAT THERE WAS A CAMPAIGN TO ADDRESS THE ISSUE BUT IS EXPIRED BY 10 WEEKS. :(",
        "vin": "2T2BK1BAXAC"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS PULLING IN A BUSINESS CENTER TO PARK, I STEP ON THE BRAKE BUT THE CAR WOULD NOT STOP. THE ACCELERATOR CONTINUES AND CAUSED MY CAR TO RUN INTO A POWER BOX AT A BUSINESS. THIS CAUSED THE BUSINESS TO HAVE A POWER OUTAGE FOR THE ENTIRE DAY. THE WEATHER WAS CLEAR. IT WAS 11:30AM. THERE WAS NO CAR AROUND THE PARKING LOT MANY SPACES WERE EMPTIED.  IM VERY FORTUNATE THAT THE CAR RAN INTO THE POWER BOX OTHERWISE THE CAR WOULD HAVE DRIVEN ITSELF INTO THE STREET! I'M A GREAT DRIVER FOR MORE THAN 20+ YEARS AND NO TICKETS OR ACCIDENTS. INSURANCE CARRIER HAD DECLARED AS TOTAL LOSS DUE FOR THE IMPACT. AIRBAGS DID NOT DEPLOYED.",
        "vin": "2T2ZK1BA6AC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30, 2018, ABOUT 7:00PM, DRIVING SLOWLY IN A NEIGHBORHOOD, SLOWED EVEN MORE TO GO OVER A SPEED BUMP, A LIGHT CAME ON. SECONDS LATER, WHEN I WENT TO BRAKE TO SLOW FOR A TURN, THERE WERE NO BRAKES. I HAD TO PUSH TO THE FLOOR AND THE CAR BARELY SLOWED. MY WIFE WAS IN THE CAR. DIAGNOSED AS BRAKE ACTUATOR AND MOTOR ASSIST FAILURE. INTERNET SEARCH REVEALED LEXUS/TOYOTA HAS KNOWN THIS SERIOUS PROBLEM FOR MANY YEARS OF CARS. A SECONDARY WARRANTY ENHANCEMENT HAD BEEN ISSUED TO DEALERS. LEXUS WON'T HONOR IT BASED ON 'CUSTOMER LOYALTY'  (OUR FIRST LEXUS). THEY DIDN'T EFFECTIVELY WARN AND WON'T FIX IT. BRAKES ARE AS SERIOUS AS IT GETS. THERE ARE THOUSANDS OF CARS OUT THERE LIKE TICKING BOMBS THAT COULD HAVE BRAKE FAILURE AT HIGH SPEED OR WHEN A CHILD IS CROSSING THE STREET. IT'S REPREHENSIBLE THAT THEY WON'T FIX IT. UNFORGIVABLE THAT THEY WON'T ISSUE A RECALL. WHY? BECAUSE THE PARTS ALONE ARE $4,500 AND OUR LIVES ARE WORTH LESS THAN THAT. PLEASE DO SOMETHING. REPORTING AND ASKING BECAUSE NOT IF, BUT WHEN, LIVES ARE LOST DUE TO 'COST OF DOING BUSINESS' I'VE DONE MY PART TO MAKE A RECORD FOR THE CLASS ACTION LAWSUIT. SHAME ON LEXUS/TOYOTA.",
        "vin": "JTJZB1BAXA2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240877,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VVT-I OIL LINE ON MY LEXUS RX350 BURST WHILE DRIVING ON A HIGHWAY. IT WAS A VERY LARGE LEAK WHICH COVERED THE GROUND, ENGINE, AND UNDERCARRIAGE. THE LOW ENGINE OIL MESSAGE AND ENGINE OIL PRESSURE WARNINGS CAME ON WHEN IT HAPPENED. COMPLETE LOSS OF OIL AND NO VISIBLE OIL ON THE DIP STICK. AFTER LOOKING ONLINE AND TALKING WITH THE MECHANIC THIS IS A KNOWN DEFECT WITH THE PART THOUGH I DON'T SEE ANY RECALL FOR IT.",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232264,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY AT 65 MPH THE SUN ROOF SUDDENLY EXPLODED.  THERE WERE NO OTHER VEHICLES ON THE ROAD AND NO DEBRIS.  THE ROOF HAD NEVER BEEN STRUCK AND WE HAVE NEVER TRANSPORTED ANYTHING ON THE ROOF.  THE TEMPERATURE WAS 65 DEGREES AND THE SUN JUST RISING SO NO SIGNIFICANT TEMPERATURE VARIATIONS.  THE ROAD WAS SMOOTH.",
        "vin": "2T2BK1BA0AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FARM IS 1/2 MILE OFF WELD COUNTY ROAD 16 IN KEENESBURG COLORADO.  THERE IS A GRAVEL DRIVE AROUND THE HOUSE TO A SHORT CONCRETE DRIVEWAY IN FRONT OF THE GARAGE.  WHEN WE DRIVE ONTO THE CONCRETE PORTION, WE ARE ANGLED NORTH EAST TOWARD THE GARAGE DOOR AND HAVE TO BACK UP A SHORT DISTANCE TO HEAD THE CAR EAST TO ENTER THE GARAGE.  WE DRIVE VERY SLOW THROUGH THE YARD AS WE HAVE ANIMALS TO WATCH OUT FOR AND MAKE A SLOW ENTRY TOWARDS THE CONCRETE DRIVEWAY.  AS SHE TURNED AROUND THE HOUSE TOWARD THE DRIVEWAY THE CAR SEEMED TO BE GOING FASTER THAN NORMAL AND SHE TOOK HER FOOT OFF THE ACCELERATOR AND EASED ON THE BRAKE BUT THE CAR DID NOT SLOW AND SHE FELT THE ACCELERATOR WAS PULLING HER FORWARD FASTER THAN SHE WANTED.  THE BRAKE PEDAL DID NOT SLOW THE CAR.  THE CAR ANGLED ACROSS THE CONCRETE DRIVEWAY, NARROWLY MISSING THE CORNER OF THE GARAGE AND STRUCK A TREE ON THE NORTH SIDE OF THE HOUSE.  THE IMPACT DID NOT DEPLOY THE AIR BAG AND MY WIFE HAD NO INJURY.  HER SEAT BELT WAS FASTENED UNTIL SHE SHUT THE CAR OFF AND EXITED THE CAR.  I NOTIFIED USAA MY INSURER AND LATER SPOKE TO SEVERAL MECHANICS ABOUT REPAIRS AND THE PROBLEM MY WIFE ENCOUNTERED JUST PRIOR TO THE ACCIDENT.  ONE MECHANIC TOLD ME OF A REPORT OF A SITUATION MUCH LIKE THIS AND SAID TO CALL LEXUS AND SEE IF THERE HAD BEEN A RECALL ON THIS MAKE OF AUTOMOBILE.  I CALLED A LEXUS DEALER IN FIRESTONE COLORADO.  I GAVE THE VIN NUMBER TO HIM AND HE SAID HIS RECORDS SHOWED THIS MODEL YEAR HAD BEEN RECALLED FOR A PROBLEM WITH THE ACCELERATOR BUT NO RECORDS SHOWED REPAIRS WERE MADE.  I TOLD HIM I PURCHASED THIS 2010 MODEL CAR IN 2016 AS A USED CAR AND HAD NO WAY OF KNOWING IF THERE HAD BEEN A RECALL.  I HAVE NOT TAKEN THE CAR TO BE REPAIRED BUT AN ADJUSTER DID MAKE A REPORT YESTERDAY (THURSDAY JUNE 6).  I HAVE NO RESULTS BUT THE ADJUSTER SAID THE DAMAGE WAS EXTENSIVE AND HE WAS A BIT SURPRISED THE AIRBAG DID NOT DEPLOY.",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL COOLING LINE BLEW OUT!  ALL OIL BLEW OUT OF ENGINE WITHIN MINUTES.  I WAS STOPPED IMMEDIATELY WITH ENGINE WARNING AND HAD TO HAVE EMERGENCY TOW.  THE REDESIGNED PART WAS ORDERED FROM LEXUS AT A COST PLUS SHIPPING OF $90.  THE TOTAL REPAIR WAS $170.  THIS IS A FAULTY PART WITH RUBBER LINE THAT HAS SINCE BEEN REDESIGNED ALL METAL--NO RUBBER.  LEXUS HAS ACKNOWLEDGED THE DESIGN FLAW BUT NO RECALL.",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS COMING FROM WORK IN THE EARLY MORNING ON APRIL 1, 2019 AT HIGHWAY SPEED AROUND 70 TO 75MPH. ALL OF A SUDDEN SHE COULD HEAR BIG NOISE COMING OUT OF ENGINE, WARNING LIGHTS STARTED COMING ON THE DASH AND SHE COULD MANGE TO STOP THE CAR IN THE EMERGENCE LANE. SHE COULD SMELL THE OIL BURNING FROM THE FRONT. THE VEHICLE WAS TOWED TO THE AUTO SHOP AND WAS EVALUATED NEXT WEEK. THEY TOLD ME THAT ENGINE HAVE BIG HOLES IN THE FRONT, REAR AND AT THE BOTTOM. TRANSFER CASE ALSO GOT A BIG HOLE ALONG WITH THE BATTERY. THE VEHICLE HAS HAD A REGULAR OIL CHANGE AND ROUTING INSPECTION IN ALL THE PREVIOUS YEARS. I HAVE SHOWN THIS TO COUPLE OF REPAIR SHOPS AND THEY TOLD ME THAT THEY HAVE NEVER SEEN THIS KIND OF INSTANCE IN ANY VEHICLE AND ESPECIALLY LEXUS.",
        "vin": "2T2BK1BA4AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187216,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEARD THAT THERE WAS A RE- CALL ALSO MY ROOF MAKES A NOISE WHEN O DRIVE OVER 70 -80 MILES  AND THAT NOT NORMAL I GOT THE CAR USED SO IM NOT SURE IF THERE IS WARRWNTY BUT MY CAR ONLY HAS 63000 MILES",
        "vin": "2T2ZK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE THE CONTACT'S SPOUSE WAS PULLING INTO A PARKING SPACE AT 5 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT THE VEHICLE ACCELERATED. THE ENGINE REVVED AND THE CONTACT DROVE OVER A SNOW MOUND BEFORE CRASHING INTO A WALL. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO BERGSTROM LEXUS OF APPLETON (3060 N VICTORY LN, APPLETON, WI 54913, (920) 471-1895) WHERE A THIRD PARTY SPECIALIST WAS SENT TO EXAMINE THE VEHICLE. THE FINDINGS WOULD BE REPORTED TO THE CONTACT AT A LATER DATE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT STATED THAT THE CRASH WAS IN RELATION TO NHTSA CAMPAIGN NUMBER: 12V3005000 (VEHICLE SPEED CONTROL). THE FAILURE MILEAGE WAS 115,000.",
        "vin": "JTJBK1BA9A2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123572,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIFTGATE CLOSES IN THE WINTER TIME WITHOUT WARNING. NO PROBLEM IN WARM MONTHS. HAD COMPLAINED OF THIS ISSUE SINCE I OWNED THE CAR AND WAS ADVISED BY LEXUS DEALER THAT THIS HAPPENS IN THE WINTER. FOR THE MOST PART I WAS ABLE TO CATCH IT BECAUSE IT STARTS BEEPING NOW IT JUST SHUTS AND FELL ON ME WHEN I WAS LOADING GROCERIES AT THE SUPERMARKET. THE PROBLEM APPEARS TO BE AN ISSUE WITH THE STRUTS BECAUSE THE SAME PROBLEM ALSO HAPPENED WITH THE HOOD WHEN I WAS GETTING A JUMP WHEN THE CAR WAS PARKED IN MY DRIVEWAY. LEXUS OFFERED TO PAY FOR THE HOOD STRUTS BUT NOT REAR LIFT GATE. THE ONLY TIME THE HOOD IS OPEN IS WHEN IT'S AT LEXUS FOR SERVICE SO THAT IS NO HELP TO ME.I NO LONGER USE MY TRUNK IN THE WINTER. LEXUS SHOULD MAKE PEOPLE AWARE OF THIS ISSUE. I DON'T HAVE THE DATE BUT LEXUS SHOULD HAVE IT ON FILE.",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "STEERING,WHEELS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "01/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102254,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR I BOUGHT BACK IN 2014. I RARELY DRIVE. AFTER CARRYING OUT MANY REPAIRS FROM 2014 TO 2017, THE CAR WILL RUN IN PARALLEL AND FEEL THAT IT IS IMPOSSIBLE TO CONTROL THE STEERING WHEEL. THERE IS ALSO A PROBLEM WITH THE SUSPENSION. IN MARCH 2017, A ONE-WEEK OVERHAUL WILL BE CARRIED OUT.",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/05/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS APPROACHING A STOPLIGHT AND BEFORE COMING TO A COMPLETE STOP, SMOKE EMERGED FROM UNDERNEATH THE CAR. WITHIN A MINUTE THE CAR CAUGHT FIRE WHICH COMPLETELY BURNED THE ENGINE AND THE FIRE SPREAD INTO THE CABIN. PRIOR TO THIS INCIDENT, WE HAVE NEVER EXPERIENCED ANY MINOR OR MAJOR ISSUES WITH THE VEHICLE. THIS VEHICLE ALSO UNDERWENT REGULAR MAINTENANCE PRIOR TO INCIDENT.",
        "vin": "JTJZK1BA5A2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "02/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075795,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL HOSE LEAK.  OIL PIPE WHICH CONNECTS TO THE ENGINE.  WHILE DRIVING THE HOSE WILL LEAK AND YOU WILL NEVER BE ADVISED THAT THE OIL IS LOW.  \"A SERVICE BULLETIN\" WENT OUT TO REPLACE THE PLASTIC HOSE TO METAL.  WHEN YOU TAKE THE CAR TO THE DEALERSHIP THEY TRY TO TELL YOU ITS NOT A SAFETY ISSUE BUT AN ENGINE NOT RECEIVING OIL AND YOUR TRUCK JUST BREAKING DOWN IS A SAFETY ISSUE.",
        "vin": "2T2BK1BA1AC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075752,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN RATTLING / CLINGING.   THIS IS MY SECOND COMPLAINT. THIS IS A SERIOUS PROBLEM THAT NEEDS TO BE ADDRESS BY THE MANUFACTURER.     HOPE WE WILL NOT WAIT UNTIL SOMEBODY OR A FAMILY LOSES THEIR LIFE.",
        "vin": "JTJBK1BA4A2"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2018",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072055,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN RATTLES WHENEVER YOU GO OVER A BUMP.    IT SHAKES AND MAKES A LOUDER CLINGING NOISE ON THE HIGHWAY.       THIS IS A DAILY OCCURENCE.     THE MANUFACTURER ACKNOWLEDGED ISSUE BUT CLAIMS IT HAS BEEN FIXED ONCE. SAME PROBLEM REOCCURS AGAIN. CLEARLY A DEFFECTIVE PART. MANUFACTURER OFFERED A REPLACEMANT PART BUT REFUSE TO BE RESPONSIBLE FOR INSTALLATION COST.      I OFFERED TO COVER HALF OF THE INSTALLATION COST. MANUFACTURER REFUSED MY OFFER. SENT AN APPEAL LETTER OF RECONSIDERATION TWICE BUT WAS REJECTED.     I STRONGLY BELIEVE THIS IS A MANUFACTURING / DEFECTIVE PART PROBLEM. REGARDLESS OF HOW OLD OR HOW MANY MILES THE VEHICLE HAS.    IF SOMETHING IS FIXED ONCE AND SAME PROBLEM REOCCURS AGAIN, THEN IT'S NOT FIXED.      CONCERN OF MY FAMILY SAFETY AND VERY DISTURBED ABOUT THE MANUFACTURERS ATTITUDE.      PLEASE KINDLY HELP.",
        "vin": "JTJBK1BA4A2"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063824,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO AND CD PLAYER AND SIRIUS RADIO STATIONS WILL SWITCH FROM FM TO SIRIUS RADIO STATION.  OR, THE CD PLAYER WILL STOP AND EJECT THE CD AND SWITCH TO SIRIUS RADIO STATION.  OR, THE ENTERTAINMENT SYSTEM WILL JUST SHUT OFF AND YOU HAVE TO TRY TO GET IT BACK ON BY PUSHING BUTTONS ON AND OFF.   THIS HAPPENS WHEN IN MOTION DRIVING ON A CITY STREET OR HIGHWAY.  THIS HAS BEEN GOING ON FOR MANY YEARS AND CONTINUES.",
        "vin": "JTJBC1BA6A2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11058316,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY IN HITTING A CAR IN THE REAR MOVING 30 MILE PER HOUR",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/18/2017",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047228,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL CAUSES HEADLIGHT TO NOT WORK (ON DRIVER SIDE), AND THEN DOOR LOCK WOULD NOT WORK ON DRIVER SIDE AND HAD TO USE KEY FOB .  THEN ALL WINDOWS ROLLED DOWN AND CANNOT ROLL THEM BACK UP   DEFINITELY NOT SAFE WITH WINDOWS DOWN WHEN OUT OF TOWN.",
        "vin": "2T2BK18A0AC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034131,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE DRIVING 75 MPH, THE SIDE CURTAIN AIR BAGS DEPLOYED WHILE DRIVING ON UNEVEN PAVEMENT. THE FAILURE OCCURRED WITHOUT WARNING OR IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (CHARLES BARKER LEXUS VIRGINIA BEACH, 3909 VIRGINIA BEACH BLVD, VIRGINIA BEACH, VA 23452), BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED AN INVESTIGATOR TO DIAGNOSE THE VEHICLE. THE CONTACT WAS UNABLE TO CONTACT ANYONE CONCERNING THE RESULTS OF THE DIAGNOSTIC. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 49,000.",
        "vin": "2T2BK1BA9AC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019220,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED LEAKING OIL ALL OVER MY DRIVEWAY AND INTO THE GARAGE, AS SOON AS I REALIZED WHAT HAPPENED I DROVE IT TO THE DEALER. DEALER SAID FRONT OIL COOLER HOSES WERE LEAKING AND THAT I WAS NOT THE FIRST. DEALER ASKED LEXUS TO RECALL AND WERE REFUSED. THIS DEFECT IS ALL OVER THE INTERNET SINCE THE COMPANY USED RUBBER HOSE INSTEAD OF METAL WHICH THEY USED TO USE AND SHOULD HAVE CONTINUED TO USE. THE PART WAS COVERED UNDER WARRANTY BUT MY DRIVEWAY AND GARAGE FLOOR ARE RUINED. THE COMPANY 1-800 NUMBER  SERVICE PERSON WAS RUDE. I WAS NEVER NOTIFIED THIS PART WAS A PROBLEM. OTHER DRIVERS ARE BEING STRANDED ON ROADWAYS AND THEIR ENGINES ARE BLOWING UP. PLEASE HELP. THIS NEEDS A CLASS ACTION SUIT OR A FORCED RECALL.",
        "vin": "2T2BK1BA4AC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2017",
        "dateOfIncident": "08/17/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016297,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. STARTED CAR IN THE MORNING DROVE IT TO WORK DIDN'T SMELL ANYTHING IT WAS ABOUT 34MILES ALL HIGHWAY.PARKED THE CAR ( THE CAR WAS NOT IN MOTION AT THE TIME)WENT OUT IN 15 MIN AND THE WHOLE FRONT END WAS ON FIRE. CALLED FIRE DEPARTMENT BY THE TIME THEY GOT HERE IT WAS TO LATE.THIS WAS ON PRIVATE PROPERTY CON EDISON OF NEW YORK. THE CAR ONLY HAD 32,000 MILE AND WAS ONLY MAINTAINED BY LEXUS ALL SERVIVE RECORDS THEY HAVE NOW ITS GOING TO COST ME 18,0000 FOR UPGRADE OR ANOTHER CAR WHEN THIS CAR WAS IN MINT CONDITION DON'T HAVE ANY REPAIR RECORDS THEY WERE STORED IN THE CAR. LEXUS HAS ALL THE CAR RECORDS. THE CAR WENT IN DECEMBER FOR STATE INSPECTION AND OIL CHANGE NOTHING WAS BROUGHT TO OUR ATTENTION",
        "vin": "2T2BK1BAXAC"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016005,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWLY PULLING INTO PARKING SPACE IN THE PARKING LOT OF THE LOCAL POST OFFICE, WITH FOOT ON BRAKE PEDAL CAR QUICKLY ACCELERATED FORWARD WITH ENGINE REAVING. CAR SHOT FORWARD GOING OVER CONCRETE CAR STOPS TOWARD A CREEK AND SMASHED INTO A STAND OF TREES. DRIVER AIRBAGS DEPLOYED. COMPLETE FRONT OF VEHICLE INCLUDING HOOD AND WINDSHIELD WERE SMASHED AND DRIVEN INTO ENGINE COMPARTMENT. I BELIEVE THIS IS A CASE OF UNINTENDED ACCELERATION CAUSED BY THE VEHICLE MALFUNCTIONING. THERE HAVE BEEN MULTIPLE DOCUMENTED COMPLAINTS OF THIS HAPPENING IN LEXUS RX 350 VEHICLES. THE FLOOR MAT WAS SECURELY IN PLACE AND HAD NOT MOVED AND THE DRIVER INSISTS HER FOOT WAS ON THE BRAKE PETAL AT ALL TIMES. THERE WERE NO OBSTRUCTIONS IN OR AROUND THE ACCELERATOR PETAL OR THE BRAKE. PARAMEDICS WERE CALLED TO SCENE AND A POLICE REPORT WAS FILED.",
        "vin": "2T2BK1BA9AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE ACCELERATED INDEPENDENTLY AND STRUCK A BUILDING. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT BODY SHOP. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OBTAINED THE VEHICLE'S EVENT DATA RECORDER. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V305000 (VEHICLE SPEED CONTROL). THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "2T2BK1BA2AC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER MALFUNCTION, I WAS ENTERING THE FREEWAY, SUDDENLY MY BRAKE PEDAL STIFFENED UP AND NO BRAKES, KEEP PUMPING BRAKES AND PARKING BRAKE LIGHTS CAME ON AND BRAKE MALFUCTION CAME ON THE DASH. ONLY 103,973 MILES",
        "vin": "2T2ZK1BA2AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WAS PULLING INTO A PARKING SPOT, JUST ROLLING TO A STOP WITH HER FOOT ON THE BRAKE.  THE CAR SUDDENLY ACCELERATED INTO A BRICK WALL AND A TREE.  THE FRONT BUMPER OF THE CAR WAS SMASHED AND THE FRAME WAS BENT.  AIR BAG DID NOT DEPLOY AS IT SHOULD HAVE.  OWNER CONTACTED LEXUS LEGAL DEPARTMENT THE NEXT DAY AND FILED A CLAIM.  16 DAYS LATER A THIRD PARTY INVESTIGATOR RECOVERED THE DATA FROM THE EVENT DATA RECORDER.  IT HAS BEEN 50 DAYS SINCE THE CLAIM WAS FILED AND WE GOT A LETTER TODAY FROM TOYOTA STATING \"NO DEFECTS WERE IDENTIFIED!\"    THIS IS TOTALLY UNACCEPTABLE.  TOYOTA SETTLED A 1.1 BILLION DOLLAR CLASS ACTION LAW SUIT REGARDING \"UNINTENDED ACCELERATION\" CASES.  OBVIOUSLY THERE IS A BIG PROBLEM.  WE WILL BE FOLLOWING UP WITH LEGAL REPRESENTATION.  IN THE MEAN TIME THE CAR SITS IN THE GARAGE, WHILE WE MAKE PAYMENTS ON A CAR THAT IS TOTALLY UNSAFE TO DRIVE!",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2016",
        "dateOfIncident": "07/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897016,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 55 MPH STEADY ON HIGHWAY THE CAR SUDDENLY SHIFTED INTO NEUTRAL AND COASTED TO A STOP.   THERE WAS NO ABNORMAL SOUND ASSOCIATED.  WHILE STATIONARY I TRIED SHIFTING INTO REVERSE OR LOW GEAR WITH NO RESPONSE.  I SHUT THE CAR OFF AND RESTARTED IT, THE CAR WOULD SHIFT INTO DRIVE AND RETURNED TO NORMAL OPERATION FOR A SHORT PERIOD AND THEN SHIFTED INTO NEUTRAL AGAIN.  AFTER MULTIPLE START/STOPS I WAS ABLE TO GET THE CAR HOME AND HAD IT TOWED TO THE NEAREST LEXUS DEALERSHIP THE NEXT DAY FOR EVALUATION.  IN THE WRONG TRAFFIC CONDITIONS (CONGESTED HIGHWAY OR UNSTEADY TERRAIN) THIS COULD HAVE BEEN A SERIOUS SAFETY CONCERN, ESPECIALLY IF MY WIFE WAS DRIVING THE VEHICLE WHEN IT HAPPENED.    AFTER 2 DAYS OF NO RESPONSE I WAS TOLD THAT THE FAULT CODES INDICATED THAT I NEEDED A NEW TRANSMISSION (AT A COST OF $6900), THERE WAS NO WAY IT COULD BE REPAIRED.  NO OTHER DETAILS OF THE DAMAGE TO THE TRANSMISSION WERE PROVIDED.  THIS IS A 2010 LEXUS RX 350 WITH 89,500 MILES AND HAS BEEN MAINTAINED REGULARLY.  FOR THIS VEHICLE, BASED ON THE MILEAGE AND CARE PUT INTO IT, I BELIEVE THERE WAS A DEFECTIVE PART IN THE TRANSMISSION BUT CANNOT VERIFY IT.  I WAS NOT OFFERED ANY COMPENSATION (BECAUSE IT WAS OFFICIALLY OUT OF WARRANTY) AND HAD THE VEHICLE SERVICED (TRANSMISSION REPLACED) BY AN INDEPENDENT MAINTENANCE SHOP.  THE SECOND SHOP CONFIRMED A MECHANICAL FAILURE WITHIN THE TRANSMISSION, REQUIRING REPLACEMENT.",
        "vin": "2T2BK1BA2AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/22/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10887686,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE DRIVING 55 MPH, THE VEHICLE ACCELERATED RAPIDLY. THE CONTACT LOST CONTROL AND CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE OTHER DRIVER WAS INJURED, BUT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 12V305000 (VEHICLE SPEED CONTROL). THE FAILURE MILEAGE WAS APPROXIMATELY 110,000.",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "11/06/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807656,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE IN TO LEXUS DEALERSHIP AND WAS NOTIFIED OF \"RACK & PINION\" ISSUE, QUOTED $1256.00 TO FIX. AFTER TALKING TO SEVERAL PEOPLE I HAVE REALIZED HOW COMMON THIS PROBLEM HAS ALWAYS BEEN IN THESE VEHICLES AND IT HAS NOT BEEN ADDRESSED BY LEXUS EVEN AFTER SO MANY PEOPLE WITH SAME ISSUE KEEP COMING FORWARD. THE DEALERSHIP JUST SAYS ITS PART OF MAINTENANCE, THIS HAS NEVER BEEN THE CASE BEFORE IN ANY OTHER CAR I HAVE OWNED. THIS NEEDS TO BE ADDRESSED",
        "vin": "2T2GK31U99C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763110,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS ON REVERSE GEAR IN MY LEXUS TRYING TO GET OUT OF THE PARKING SPOT, THERE WAS SUDDEN UNINTENDED ACCELERATION CRASHING MY LEXUS INTO A PARKED VEHICLE. I TRIED TO HIT THE BRAKES WHICH DID NOT WORK AND THE VEHICLE DID NOT STOP. THERE WAS EXTENSIVE DAMAGE TO THE PARKED CAR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/18/2015",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10749560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I SUFFERED BACK AND NECK PAIN WHILE LOADING THE REAR TRUNK OF MY LEXUS SUV. THE REMOTE DOOR CONTINUED TO CLOSE AND COULDN'T BE LIFTED FROM MY BODY THAT WAS STUCK BETWEEN THE DOOR AND REAR TRUCK AREA. I HAD TO CRAWL FROM UNDER THE CLOSING DOOR THAT WAS CRUSHING MY BACK TO PREVENT ADDITIONAL INJURIES THAT COULD HAVE BEEN FATAL. THE LEXUS HQ OFFICE WAS CONTACTED AND THERE IS A CURRENT CASE REPORT.  THE LEXUS DEALERSHIP LOCATED IN DULUTH GA FIXED THE REAR DOOR FREE OF CHARGE BY PLACING A SENSOR TO OPEN WHEN AN OBJECT OR PERSON IS BLOCKING THE DOOR WHILE CLOSING.  OTHERS LEXUS AND TOYOTA SUV OWNERS HAVE EXPERIENCED SIMILAR PROBLEMS WHEN TOLD WHAT HAPPENED TO ME. IM STILL TAKING MEDICATION FOR PAIN CAUSED BY THE INJURIES.",
        "vin": "2T2ZK1BA6AC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "05/31/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10730100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE DRIVING APPROXIMATELY 40 MPH, THE FRONT AND REAR DRIVER SIDE AIR BAGS DEPLOYED INDEPENDENTLY WITHOUT WARNING. THE DRIVER SUSTAINED HEAD, NECK, AND EAR INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "2T2BK1BA0AC"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/12/2015",
        "dateOfIncident": "05/11/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715883,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE SUDDENLY EXPERIENCED UNINTENDED ACCELERATION CAUSING THE DRIVER TO LOSE CONTROL OF THE VEHICLE AND CRASH INTO A TRUCK. THE VEHICLE SUSTAINED SIGNIFICANT DAMAGE TO THE FRONT END. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 43,000. ..UPDATED 06-15-15 *BF     UPDATED 9/18/15 *JS",
        "vin": "2T2BK1BA0A0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "03/23/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701446,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 65 MILES PER HOUR ON THE FREEWAY WHEN I JUST HEARD A BIG LOUD POP I LOOK AT THE SUN ROOF AND SEE SHADDER GLASS COMING DOWN ON ME. THERE WAS A BIG HOLE IN THE MIDDLE AND NOTHING COULD OF HIT ME THERE WAS NO ROCKS NEAR ME... WHEN I STOPED TO CHECK INSIDE THE TRUCK THERE WAS NOTHING THAT SHOWED WHAT COULD OF HIT THE SUN ROOF SUCH AS A ROCK... WE TOOK IT TO THE LEXUS DELAER AND SAID IT WAS THE 1ST TIME THEY HEARD ABOUT THIS... I RESEARCH ONLINE AND THIS IS NOT THE 1ST ONE THAT HAS HAPPEN TO. ALSO THE SUN ROOF WAS POPING UP LIKE THE GLASS EXPLODED UPWORDS NOT AS IF SOMETHING FELT FROM THE TOP OF THE SUNROOF AS PER MANY COMMENTS OF PEOPLE THAT OWN A LEXUS 2010 HAS HAPPENED BEFORE",
        "vin": "JTJZK1BA7A2"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693769,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"ENGINE MAINTENANCE REQUIRED\" LIGHT WILL NOT RESET ANYMORE AFTER AN OIL CHANGE...EVEN AFTER YOU FOLLOW THE STEPS IN THE USERS MANUAL.  IT USED TO WORK BECAUSE I'VE DONE IT BEFORE.  NOW, NO MATTER WHAT I DO, IT WON'T RESET.  *TR",
        "vin": "2T2BK1BA1AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693387,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A PARKING SPOT AT MY WORKPLACE AT VERY LOW SPEED AND THE LEXUS ACCELERATED WILDLY OVER THE CURB ONTO PLANTS AND ICEPLANT INTO A TREE, WHICH STOPPED THE CAR.  THE HOOD WAS DENTED, THE GRILL CRACKED AND THE BUMPER WAS RIPPED OFF BOTH SIDES.  I TOOK IT TO THE DEALERSHIP IMMEDIATELY.  THE EDR WAS SUPPOSEDLY CHECKED BY A 'NEUTRAL' THIRD PARTY AND I WAS CALLED BY THE DEALERSHIP TO COME PICK UP THE VEHICLE AND THE FACTORY WOULD RESPOND IN WRITING IN 30 DAYS.  UNACCEPTABLE.  *TR",
        "vin": "JTJZK1BA6A2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679264,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "LATITUDE TOUR",
                "productYear": "9999",
                "size": "235/55R18",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350 EQUIPPED WITH MICHELIN LATITUDE TOUR TIRES, SIZE: P235/55 R19 (NA).  THE CONTACT STATED THAT THE TIRE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE TIRE PRESSURE WAS LOW ON ALL FOUR TIRES. THE FAILURE RECURRED ON MULTIPLE OCCASIONS.  THE DOT NUMBER WAS UNAVAILABLE. THE VEHICLE FAILURE MILEAGE WAS 100,000 AND THE APPROXIMATE TIRE FAILURE MILEAGE WAS 4,000.",
        "vin": "2T2BK1BA2AC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660664,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 LEXUS RX350. CONSUMER HAD TRANSMISSION SHIFTER ASSEMBLY REPLACED. CONSUMER ALSO WANT TO KNOW IF HE CAN BE REIMBURSED.  ACCORDING TO THE INVOICE, THE SHIFTER WOULD GET STUCK WHEN SHIFTING FROM NEUTRAL TO DRIVE. THE CONSUMER STATED ONCE THE GEAR WAS IN DRIVE, IT SLIPPED OUT SEVERAL TIMES. *JB",
        "vin": "2T2BK1BA0AC"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10649069,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION WITH ANOTHER VEHICLE. LEXUS DRIVER'S SEAT BELT DID NOT RESTRAIN DRIVER AND AIRBAG BLEW OPEN ALLOWING DRIVER TO IMPACT STEERING WHEEL HARD ENOUGH TO SUSTAIN A FRACTURED STERNUM AND CHEST WALL INJURY. .UPDATED 11/03/14 *BF   UPDATED 7/15/2015*JS  UPDATED 09/04/15 *BF",
        "vin": "JTJZK1BA0A2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604926,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING LEFT INTO A DRIVEWAY ON A TWO LANE HIGHWAY.  A JEEP BEHIND ME WAS NOT PAYING ATTENTION AND TRIED TO PASS ME ON THE LEFT WHILE I WAS TURNING.  THE IMPACT WAS ON THE DRIVER SIDE DOOR.  I WAS HIT SO HARD HIS BUMPER TORE A WHOLE IN THE DOOR AND BROKE THE FRONT WHEEL OFF FROM MOVING ME SIDEWAYS.  I WAS KNOCKED OUT FROM THE CONCUSSION AND ENDED UP IN THE MIDDLE OF THE HIGHWAY GATHERING MY WITS.  I WAS SHOCKED THE SIDE AIRBAG DID NOT DEPLOY.  THANK GOODNESS I HAD MY SEAT BELT ON!   *TR",
        "vin": "2T2ZK1BA9AC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "03/29/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578104,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN THE PASSING LANE AT ABOUT 55 MPH. THE ROAD WAS STRAIGHT AND LEVEL. THE ROAD WAS COVERED WITH A THIN COATING OF SLUSH. WHILE DRIVING THE ALARM SIGNAL BEGAN BEEPING. I TOOK MY FOOT OFF OF THE ACCELERATOR. THE CAR THEN BEGAN DRIFTING TO THE LEFT, IN THE NEXT FEW SECONDS THE LEFT WHEELS WERE 2 FEET OVER THE LEFT LANE. I TRIED TO GET THE CAR BACK INTO THE LANE BUT THE STEERING DID NOT RESPOND. A FEW SECONDS LATER THE CAR BEGAN TO DRIFT TO THE RIGHT AND ROTATE TO THE RIGHT. I THEN APPLIED THE BRAKES BUT THEY HAD LITTLE EFFECT. EVENTUALLY THE CAR SLID OFF THE ROAD TO THE RIGHT STOPPING ABOUT 75 FT OFF THE ROAD, DOWN A 20 FOOT SLOPE. I BELIEVE THAT THE STABILITY CONTROL SYSTEM FAILED TO CONTROL THE VEHICLE AND DID NOT PROVIDE ADEQUATE PROTECTION IN THIS ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568643,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAFFIC ON I 5 N CAME TO A SUDDEN STOP. I STEPPED HARD ON THE BRAKES. THE ABS FUNCTION DID NOT WORK AND MY CAR SKIDDED AND WOULD HAVE GONE INTO THE LANE ON MY RIGHT IF I HAD NOT CORRECTED THE SKID. THIS COULD HAVE RESULTED IN A SERIOUS ACCIDENT WITH POTENTIAL BODILY INJURIES. I HAD THE VEHICLE INSPECTED BY LEXUS DEALER AND THEY SAID NOTHING WAS WRONG WITH THE ABS BRAKE SYSTEM AND THAT THIS COULD BE ONE IN A THOUSAND INCIDENT. I HAVE DRIVEN SEVERAL OTHER MANUFACTURERS AUTOS WITH ABS AND KNOW THAT THE LEXUS EXPERIENCE IS NOT HOW NORMAL ABS BRAKES SHOULD FUNCTION. THIS IS A SERIOUS DRIVING HAZARD AND I HAVE NOT RECEIVED A SATISFACTORY SOLUTION TO THIS ISSUE FROM LEXUS TO DATE.  UPDATED 04/08/14",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/2013",
        "dateOfIncident": "09/26/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546110,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE CAR WAS PARKED, THE FRONT BUMPER CAME LOOSE  AFTER A MINOR CONTACT WITH ANOTHER VEHICLE. ALMOST THE SAME HAPPENED  A YEAR EARLIER WHILE CAR WAS BARELY MOVING AND REARENDED A SMALL HONDA CAR, WHICH WAS NOT EVEN SCRATCHED, THE WHOLE FRONT END THEN HAD TO BE REPLACED BECAUSE THE SCREWS AND PLASTIC FASTENERS ATTACHING THE BUMPER TO THE BODY BROKE OFF.   *TR",
        "vin": "2T2ZK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "06/23/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532335,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THAT THE ENGINE RPMS INCREASED EXCESSIVELY AS THE VEHICLE SUDDENLY ACCELERATED WITHOUT WARNING. THE CONTACT CRASHED INTO ANOTHER VEHICLE AS A RESULT. A POLICE REPORT WAS FILED BUT THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 38,000.",
        "vin": "2T2BK1BAXAC"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2013",
        "dateOfIncident": "07/05/2013",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING INTO A PARKING SPOT AT A VERY SLOW RATE OF SPEED DUE TO THE CONGESTED NATURE OF THE SHOPPING CENTER.  PULLED IN WITH FOOT ON THE BRAKE AND STARTED TO PUT VEHICLE INTO PARK WHEN THE ENGINE REVVED AND THE CAR ACCELERATED VERY QUICKLY OVER THE CURB AND INTO THE WALL OF THE SHOPPING CENTER.  I FELT NO CONTROL OVER THE VEHICLE.  ONLY ISSUE WITH CAR SINCE PURCHASE WERE THE BRAKES HAD TO BE RESURFACED SHORTLY AFTER WE GOT IT.  WITNESSES IN THE CAR BEHIND ME WAITING FOR ME TO PARK ALSO STATED THAT THEY WERE SHOCKED TO SEE THE CAR LAUNCH FORWARD AS THEY SAW THAT I WAS NEAR A DEAD STOP. DAMAGE TO FRONT END BUT ABLE TO GET CAR BACK HOME. CONTACTED PARK PLACE LEXUS IN PLANO TX AND SERVICE REPRESENTATIVE STATED THEY WOULD TO IT TO THE DEALERSHIP FOR INVESTIGATION.  30 MINS AFTER TWO TRUCK LEFT, SALES PERSON CALLS TO TELL ME THAT THEY SHOULD NOT HAVE TOWED IT AND HE HAD SPECIFIC INSTRUCTIONS FROM LEXUS CORP NOT TO WORK ON OR OPEN A REPAIR TICKET ON A CARE REPORTING UNINTENTIONAL ACCELERATION.  I NEEDED TO CALL THE MAIN 800 NUMBER.  NOW HAVE TO GET CAR BACK TO HOUSE AT MY EXPENSE SO THE LEXUS PAID \"INDEPENDENT INVESTIGATOR\" CAN COME LOOK AT THE VEHICLE IN 3-5 DAYS.  MORTIFIED AT THE THOUGHT THIS COULD HAVE KILLED SOMEONE WALKING ALONG THE SIDEWALK.  TOO MANY REPORTS OF THIS ISSUE DURING PARKING EVENTS.  SOMETHING NEEDS TO BE DONE.  LEXUS HAS THE OPP TO DO THE RIGHT THING...LET'S SEE IF THEY STAND BEHIND THEIR VEHICLES.  ONE OR TWO INSTANCES IS DRIVER ERROR....NOT ENOUGH TO FORCE TOYOTA TO SETTLE FOR BILLIONS RATHER THAN FACE A JURY.  JUST SAYING...IF I HAD ANY DOUBT ABOUT WHETHER I HIT THE ACCELERATOR INSTEAD OF THE BRAKE I WOULDN'T TAKE THE TIME TO REPORT THIS TO A GOV AGENCY.  *TR",
        "vin": "2T2ZK1BA3AC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "03/17/2013",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503381,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED AFTER PARKING THE VEHICLE IN HER DRIVEWAY FOR OVER FOUR HOURS, SMOKE WAS NOTICED COMING FROM THE INTERIOR OF THE VEHICLE.  THE FIRE DEPARTMENT WAS NOTIFIED WHO EXTINGUISHED THE FIRE. THE FIRE MARSHALL STATED THE ORIGIN OF THE FIRE WAS CAUSED BY THE ELECTRICAL WIRING SYSTEM UNDER THE INSTRUMENT PANEL. THERE WERE NO INJURIES AND A REPORT WAS AVAILABLE IF NEEDED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 37,000.",
        "vin": "2T2ZK1BA7AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2012",
        "dateOfIncident": "08/03/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE STARTED ACCELERATING ON ITS OWN.  WHEN I TRIED TO GET THE VEHICLE TO STOP, THE BRAKES WOULD NOT WORK.  NEUTRAL WOULD NOT WORK.  DOWN SHIFTING WOULD NOT WORK.  THE VEHICLE WOULD ONLY INCREASE IN SPEED.  I HAD 3 KIDS IN THE CAR.  THE DASH BOARD INDICATOR LIGHTS LIT UP.  ALL OF THEM!!  WHEN I FINALLY LOOKED DOWN THE ACCELERATOR PEDAL WAS STUCK.  I GRABBED IT WITH BOTH HANDS WHILE DOING OVER 100 MPH AND HEARD A POP!  THEN THE VEHICLE SLOWED BUT STILL NOT NEARLY SAFE ENOUGH.  I FINALLY MANAGED TO DOWN SHIFT THE CAR AT THAT POINT.  AND THEN JAMMED HER INTO PARK FROM ABOUT 30 MPH.  THERE WAS SOMETHING SERIOUSLY WRONG WITH THIS CAR.  IT WAS NOT FLOOR MATS THAT GOT THAT PEDAL STUCK!  I SAW THAT PEDAL!  YOU NEED TO LOOK INTO THIS FURTHER.  SOMEONE IS GOING TO GET KILLED!  I WILL BET THEY ALREADY HAVE.  I HAD TO TRADE MY CAR IN BECAUSE LEXUS WOULD NOT EVEN CHECK THE COMPUTER FOR FEAR THEY WOULD BE VALIDATING MY COMPLAINT.  NOW I GET A LETTER STATING THEY ARE CHANGING THE ACCELERATOR PEDAL?  THERE IS SOMETHING MORE TO THIS AND I THINK YOU SHOULD BE LOOKING FURTHER.  THAT IS WHY I AM FILING MY COMPLAINT NOW.  THEY SAID I WAS THE ONLY ONE.  OBVIOUSLY NOT.  I SPENT A LOT OF MONEY TO GET OUT OF THAT CAR.  PEOPLE SHOULD NOT HAVE TO.  PLEASE LOOK INTO THIS.  I BEG YOU.  *TR",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "08/23/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX 350. THE CONTACT STATED THAT THE DRIVER'S SIDE SUN VISOR WOULD NOT REMAIN UPRIGHT IN ITS HOUSING AND CONTINUED TO FALL, OBSTRUCTING THE CONTACT'S VIEW. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THERE WAS NOTHING THEY COULD DO TO ASSIST. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 22,235 AND THE CURRENT MILEAGE WAS 22,500.",
        "vin": "2T2ZK1BA4AC"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/17/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471324,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LEXUS HAS A MOLD PROBLEM.  THEY HAVE BEEN UNABLE TO REMEDY IT, BUT WILL NOT REPLACE THE VEHICLE.  THEY HAVE TRIED TO REMEDY THE PROBLEM NO LESS THAN 7 TIMES, BUT CANNOT ELIMINATE THE MOLD.  EMPLOYEES OF LEXUS OF GREENWICH HAVE ADMITTED TO ME THAT THEY KNOW THIS IS A RECURRING PROBLEM.  YET THEY CONTINUE TO RETURN THE VEHICLE, WITH MOLD, TO THEIR CUSTOMERS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/09/2012",
        "dateOfIncident": "08/08/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469944,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THAT WHILE RIVING APPROXIMATELY 15 MPH, THE VEHICLE SUDDENLY ACCELERATED AT A RAPID PACE. THE VEHICLE CONTINUED TO ACCELERATE AS THE BRAKES WERE APPLIED. THE DRIVER WAS ABLE TO SHIFT INTO NEUTRAL AND TURNED THE ENGINE OFF. THE VEHICLE RETURNED TO NORMAL FUNCTION AFTER SEVERAL MOMENTS AND WAS DRIVEN TO THE CONTACT'S HOME. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE FAILURE AND CURRENT MILEAGE WAS 38,000.",
        "vin": "2T2BK1BA9AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2012",
        "dateOfIncident": "04/03/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454032,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ACCELERATING TO MERGE ON 4 LINE TRAFFIC AND MY CAR STARTED SUDDENLY TO ACCELERATE EVEN WHEN I WAS NOT PRESSING THE ACCELERATING PEDAL I TRIED TO HIT THE BRAKES BUT IT DID NOT SLOW THE CAR I PUSH TO NEUTRAL POSITION HITTING THE BRAKES BUT THE CAR WAS STILL GOING FAST. I WAS GOING TO AN EXIT  TRYING TO STOP THE CAR KEEPING IN NEUTRAL AND HITTING THE BRAKES I WAS ABLE TO STOP AND SHOT THE ENGINE OFF.  *TR",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/27/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE THE BRAKE FLUID IN THE VEHICLE AT 30000 MILES.  LEXUS REQUIRES THIS SUPPOSEDLY TO MAINTAIN THE INTEGRITY OF THE BRAKING SYSTEM AND PROVIDE A SAFE VEHICLE.  I FEEL THIS IS A SAFETY DEFECT IN THE DESIGN.  ANY VEHICLE' SHOULDBE ROBUST ENOUGH TO LAST MUCH LONGER THAN THIS WITHOUT THIS LEVEL OF SERVICE BEING REQUIRED BY THE MANUFACTURER.  IF THE VEHICLE DOES REALLY NEED THIS, THAN LEXUS SHOULD COVER IT UNDER WARRANTY. BRAKES ALSO REQUIRED DISASSEMBLY AND CLEANING AT 15000 MILES AT CUSTOMERS EXPENSE.  *TR",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "01/25/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT OUT TO GRAB A BITE TO EAT FOR MY DAUGHTER AND I CAME TO A STOP LIGHT AT A MAJOR INTERSECTION.  I RECEIVED THE TURN ARROW SO I ACCELERATED THRU THE TURN AND THEN PUNCHED THE GAS TO MAKE IT THRU THE NEXT LIGHT THAT WILL TURN RED IF YOU DON'T GIVE IT A LITTLE GAS TO GET THRU IT.  I MAKE IT THRU THE LIGHT AND GET IN THE RIGHT LANE TO SLOW DOWN TO MAKE MY TURN AND MY BRAKES DON'T WORK AND MY CAR STARTS ACCELERATING ON ITS OWN.  I HAVE NO CONTROL OF THE SPEED SO I THROW THE CAR IN NEUTRAL AND KEEP SLAMMING THE BRAKES WHILE THE BRAKE MALFUNCTION LIGHT APPEARS.  I'M NOT SURE HOW MY CAR SLOWS DOWN AND I MAKE A RIGHT TURN INTO A PARKING LOT AND MY ENGINE IS STILL SOUNDING LIKE IT IS ACCELERATING AND I AM IN NEUTRAL.  MY CAR ROLLED TO A STOP, I SHUT IT DOWN AND CALLED THE LEXUS LINE.  THE HAD A TOWING COMPANY OUT WITHIN AN HOUR AND THE TOW TRUCK DRIVER TOLD ME THIS IS AT LEAST THE 10TH TIME HE HAS HAULED THIS TYPE OF CAR FOR THE SAME THING.  *TR",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "10/04/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCT 5, 2011 AT 7:45 AM , I WAS TRAVELING ON A ONE LANE ROAD EACH WAY IN RURAL CONNECTICUT ( 35 MPH ZONE). I DECIDED TO PASS A CAR THAT WAS TRAVELING WELL BELOW THE SPEED LIMIT WHEN MY LEXUS RX350 LURCHED FORWARD SUDDENLY AND THEN HAD A HUGE BURST OF ACCELERATING SPEED. I APPLIED MY FOOT TO THE BRAKES AND THE CAR SLOWED VERY SLIGHTLY, BUT STARTED TO BUCK A LITTLE AND THEN ONCE AGAIN FELT LIKE IT KICKED INTO A HIGHER GEAR. MY DASHBOARD WAS FLASHING \" BRAKE FAILURE\" AS I LOOKED DOWN AND SAW THAT MY FOOT WAS FIRMLY PLANTED DOWN ON THE BRAKES. FORTUNATELY, THERE WERE FEW CARS ON THE ROAD AND ONLY ONCE DID I HAVE TO PASS A CAR ON A BLIND CURVE HOPING NO ONE WAS APPROACHING FROM THE OTHER WAY, SO AS TO AVOID RAMMING A CAR IN FRONT OF ME. I HAD RESOLVED IN MY MIND THAT I WAS GOING TO CRASH, AND WAS TRYING TO FIND A PLACE TO TAKE THE CAR OFF THE ROAD WHILE TRYING TO MINIMIZE INJURY TO ME. I STOPPED LOOKING AT MY SPEED, BUT IT WAS CLEARLY IN EXCESS OF 60 MPH IN A 35 MPH ZONE. I WAS LUCKY THAT DAY, SINCE THERE WERE FEW CARS ON THE ROAD AND THE STRETCH OF ROAD I WAS ON WAS FAIRLY STRAIGHT. I DROVE THIS WAY FOR ABOUT 1.5 MILES WHEN IT THEN OCCURRED TO ME TO SHIFT THE CAR INTO NEUTRAL. ONCE I DID THIS THE CAR EVENTUALLY REDUCED SPEED TO ABOUT 5-10 MPH. I THREW THE CAR INTO PARK AND JUMPED OUT OF THE VEHICLE, WHICH AT THIS POINT WAS ENGULFED IN SMOKE FROM THE FAILED BRAKES. LEXUS BLAMED THE INCIDENT ON A STUCK ACCELERATOR PAD, ALTHOUGH THEY ADMITTED WHEN THE CAR CAME TO THEIR SHOP THE PAD WAS NOT STUCK. I KNOW FACTUALLY THAT THE PAD WAS NOT STUCK, SINCE I LOOKED DOWN AT MY FEET DURING THE EPISODE AND SAW MY FOOT ON THE BRAKE, AND THE ACCELERATOR PAD IN ITS NORMAL POSITION. THIS WAS CLEARLY AN INCIDENT OF SUDDEN ACCELERATION. LEXUS ALLOWED ME TO BREAK MY LEASE AND LEASE A 2012, WHICH NOW HAS A BRAKE OVERRIDE SYSTEM (AS OF 2011 MODELS) .  *TR",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "01/21/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/21/12 AS I WAS  DRIVING I SLOWED DOWN PREPARING TO BRAKE FOR A TRAFFIC SIGNAL.  A SCHOOL BUS WAS IN FRONT OF US, STOPPED.  AS I STEPPED  ON THE BRAKE, THE ENGINE REVVED UP AND THE CAR CONTINUED TO MOVE FORWARD.  I QUICKLY PUT THE CAR IN PARK AND TURNED OFF THE ENGINE.  WE WERE INCHES FROM THE SCHOOL BUS.  THIS SHOULD NOT HAVE HAPPENED.  IT WAS FRIGHTENING!!  THE PROBLEM OCCURRED AGAIN ABOUT 10 MINUTES IN A STOPPED POSITION AND THE CAR CONTINUED TO MOVE FORWARD. THE TACHOMETER WENT INTO THE RED ZONE.  THE DEALER AND MANUFACTURER WERE INFORMED.  UPDATED IVOQ 03/29/12  *TR",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "12/22/2011",
        "dateOfIncident": "12/16/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT WAS DRIVING APPROXIMATELY 25 MPH WHEN THE BRAKES WERE APPLIED BUT THE VEHICLE WOULD NOT RESPOND. THE BRAKE PEDAL WAS ABNORMALLY DEPRESSED INTO THE FLOORBOARD AND THE CONTACT CRASHED INTO A FIRE HYDRANT AND THE SIDE OF A BUILDING. ONCE THE VEHICLE CAME TO A COMPLETE STOP, THE AIR BAGS DEPLOYED. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS TOWED THE DEALER BUT WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "2T2ZK1BA0AC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/30/2011",
        "dateOfIncident": "11/07/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10437884,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THE VEHICLE ROLLED AWAY WHILE PARKED ON AN INCLINE WITH THE ENGINE SHUT OFF. THE VEHICLE ROLLED DOWN THE HILL AND CRASHED INTO A FENCE AND A LIGHT POST. THE CONTACT RECEIVED NECK AND BACK INJURIES FROM THE CRASH. THE VEHICLE WAS TOWED TO THE DEALER AND THE CONTACT WAS ADVISED THAT THEY WOULD HAVE TO PAY SOMEONE TO READ THE REPORT TAKEN WHEN THE BLACK BOX WAS ANALYZED. THE CONTACT DID NOT KNOW WHAT CAUSED THE FAILURE.  THE FAILURE AND THE CURRENT MILEAGES WERE 19,000.  UPDATED 03/05/12*LJ  UPDATED 03/07/12",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/18/2011",
        "dateOfIncident": "10/25/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10436324,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT WAS DRIVING APPROXIMATELY 30 MPH AND LOSS CONTROL OF THE VEHICLE DUE TO AN UNEXPECTED HEALTH RELATED ISSUE. THE VEHICLE CRASHED INTO AN UNOCCUPIED PARKED VEHICLE. THE CONTACT SUSTAINED INJURIES TO THE HEAD AND CHEST AREA.  A POLICE REPORT WAS FILED. THE FRONT DRIVER'S SIDE AIR BAG PARTIALLY DEPLOYED AND THE FRONT PASSENGER'S SIDE AIR BAG FAILED TO DEPLOY WITH THE SUBSTANTIAL IMPACT. THE VEHICLE WAS DECLARED DESTROYED AND TOWED TO AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE MILEAGE WAS 18,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/18/2011",
        "dateOfIncident": "09/29/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430687,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THAT WHILE STOPPED WITH THE BRAKES APPLIED, THE VEHICLE SURGED FORWARD APPROXIMATELY TWO TO THREE FEET. HEAVY PRESSURE WAS APPLIED TO THE BRAKES TO STOP THE VEHICLE. THE VEHICLE WAS LATER TAKEN TO AN AUTHORIZED DEALER, BUT THEY COULD NOT DIAGNOSE A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE VEHICLE WAS SOLD BACK TO THE DEALER. THE FAILURE MILEAGE WAS 28,500.",
        "vin": "JTJBK1BA7A2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2011",
        "dateOfIncident": "09/20/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427019,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEXUS RX 450H. 2010. WAS PURCHASED BRAND NEW FROM THE DEALERSHIP. ALL MAINTENANCE WAS PERFORMED AT THE SAME DEALERSHIP THE CAR WAS PURCHASED. SINGLE OWNER. TWENTY MONTHS LATER (AT 34,000 MILES) ALL 4 TIRES ARE NO LONGER GOOD AT THE INNER EDGE. TWO POSSIBILITIES: 1) THE TIRES WERE BAD QUALITY; 2) THE DEALERSHIP FAILED TO BALANCE AND ROTATE THE TIRES. FOR SAFETY, I HAD NO OTHER CHOICE TO CHANGE THEM. I AM VERY DISSATISFIED.  *TR",
        "vin": "JTJBC1BA3A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "05/07/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420032,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX 450H. THE CONTACT STATED THAT THE VEHICLE FAILED TO ACCELERATE OVER 70 MPH WHILE DRIVING UP AN EXTREMELY STEEP INCLINE. AN AUTHORIZED DEALER WAS NOTIFIED AND THEY INFORMED THE CONTACT THAT THE VEHICLE RESPONSE WAS NORMAL. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": "JTJBC1BA8A2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX450H. WHILE DRIVING APPROXIMATELY 25 MPH THE CONTACT DROVE OVER A BUMP IN THE ROAD WHILE DEPRESSING THE BRAKE PEDAL. THE VEHICLE STALLED AND SUDDENLY THE BRAKES DISENGAGED. THE CONTACT STATED THE FAILURE OCCURRED SEVERAL TIMES AND CAUSED A REAR END COLLISION WITH ANOTHER VEHICLE. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIANS WERE UNABLE TO DIAGNOSE THE FAILURE. THE TECHNICIANS STATED THE REGENERATIVE AND THE HYDRAULIC BRAKING SYSTEM BEGAN TO SWITCH FROM ONE TO THE OTHER AND CAUSED THE HESITATION. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "JTJBC1BA8A2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414279,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 LEXUS RX450H. CONSUMER STATES PROBLEM WITH BRAKING SYSTEM *TGW  THE CONSUMER NOTICED AFTER DRIVING THE VEHICLE FOR A FEW MONTHS, THAT IT SOMETIMES SURGED FORWARD A FEW FEET WHILE BRAKING OR WHEN LETTING OFF THE BRAKE.  THE DEALER INFORMED THE CONSUMER THE BRAKING SYSTEM WAS TYPICAL OF A HYBRID VEHICLE.  THE CONSUMER STATED A COUPLE OF WEEKS LATER, THE VEHICLE SURGED FORWARD AGAIN AS SHE WAS BRAKING. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411637,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/1/2011 AT 10.45PM. I WAS DRIVING MY LEXUS 2010 RX350  EASTBOUND ON THE LIE SERVICE ROAD IN GLEN COVE NY.  I WAS TRAVELLING AT 35 TO 45 MPH,WHEN SUDDENLY MY \"BRAKE MALFUNCTION LIGHT\"  STARTED FLASHING ON MY DASHBOARD. I INSTINCTIVELY TAPPED THE BRAKE, AND THE BRAKES DID NOT RESPOND. THEN THE CAR HAD UNINTENDED ACCELERATION,I THEN PRESSED ON THE BRAKES WITH ALL MY MIGHT, TO STOP THIS VEHICLE CAREERING OFF THE ROAD.WITH GODS GRACE I WAS  ABLE TO STOP THE CAR BY DOWNSHIFTING GEARS.  THIS IS THE FIRST TIME I HAVE EXPERIENCED THIS LIFE THREATENING PROBLEM.  SO FAR LEXUS HAVE DISCREDITED THIS EXPERIENCE, BY CLAIMING THE MAT WAS STUCK UNDER THE ACCELERATOR AND OR BRAKE.  I STRONGLY AND VEHEMENTLY DISAGREE WITH THEIR EVALUATION AND ANALYSIS.   I INTEND TO TAKE THIS MATTER FURTHER WITH LEXUS.  *TR",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/27/2011",
        "dateOfIncident": "06/25/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10409072,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING APPROXIMATELY 30 - 40 MPH ON THE FREEWAY.  I WENT TO MAKE A LANE CHANGE, LOOKED OVER MY SHOULDER TO MAKE SURE LANE WAS CLEAR, AS I TURNED BACK, THE CAR IN FRONT OF ME STOPPED.  I PUT ON MY BRAKES, THERE WAS NO RESPONSE FROM MY BRAKES, THEY DISENGAGED. MY CAR SURGED FORWARD AND HIT THE CAR IN FRONT OF ME.  MY SEATBELT DID NOT HAVE ANY TENSION, THEREFORE, MY BODY HIT THE STEERING WHEEL.  NOTHING HAS BEEN DONE.  THE ACCIDENT JUST HAPPENED.  *TR",
        "vin": "JTJZB1BA4A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2011",
        "dateOfIncident": "06/21/2011",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED WHILE DRIVING 70 MPH WITH THE CRUISE CONTROL ENGAGED THE VEHICLE SUDDENLY ACCELERATED UP TO 80 MPH. WHILE THE VEHICLE WAS ACCELERATING THE BRAKE MALFUNCTION LIGHT CAME ON. THE CONTACT SHIFTED THE VEHICLE INTO NEUTRAL AND CHOSE THE POWER BUTTON IN ORDER TO SHUT THE VEHICLE OFF AND DROVE ONTO THE EMERGENCY LANE. THE CONTACT STATED THE BRAKES WERE ALSO SMOKING ALTHOUGH NOTHING WAS STUCK UNDERNEATH THE ACCELERATOR PEDAL. THE CONTACT STATED THE LEXUS HELP SERVICE CENTER WAS NOT AVAILABLE AT THE TIME OF THE ACCELERATION. THE CONTACT CALLED THE DEALER BUT THE SERVICE DEPARTMENT WAS CLOSED. THE CONTACT CALLED THE MANUFACTURER REGARDING THE SUDDEN ACCELERATION AND THEY AUTHORIZED THAT THE VEHICLE TO BE TOWED TO A DEALER. THE DEALER STATED TO THE CONTACT, THE ACCELERATOR PEDAL WAS STUCK ON THE FLOOR BUT THE CONTACT STATED THE FLOOR MAT WAS NOT STUCK. THE VEHICLE WAS CURRENTLY UNDER GOING TEST WITH THE DEALER. THE FAILURE MILEAGE WAS 9,500.",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/29/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404009,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THERE WAS UNINTENDED ACCELERATION WHILE THE VEHICLE WAS PARKED IN THE GARAGE. AS THE VEHICLE WAS STARTED, THE RPM INCREASED UP TO 7000 RPM. THE VEHICLE WAS TOWED TO THE DEALER WHERE THEY INSPECTED THE VEHICLE AND INFORMED THE CONTACT THAT THE ACCELERATOR PEDAL WAS STUCK TO THE FLOOR MAT. THE CONTACT STATED HE DOES NOT THINK IT WAS THE FLOOR MATS BECAUSE HE CHECKED THE FLOOR MATS PRIOR TO TAKING THE VEHICLE TO THE DEALER. THE DEALER COULD NOT FIND ANYTHING ELSE WRONG WITH THE VEHICLE. THE MANUFACTURER WAS CONTACTED AND A CLAIM WAS FILED. THE FAILURE MILEAGE WAS 16,484 UPDATED 11/16/11*LJ  THE CONSUMER STATED THE ACCELERATOR PEDAL BECAME STUCK, THE DEALER FOUND A NON-SECURED ALL WEATHER FLOOR MAT INTENDED FOR A 2004- 2009 LEXUS RX SLID FORWARD AND ENTRAPPED THE ACCELERATOR PEDAL IN THE FULLY APPLIED POSITION.  UPDATED 12/05/11",
        "vin": "2T2BK1BA2AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "02/08/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 2,
        "odiNumber": 10401384,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A 2010 LEXUS RX 350 MY GRANDMOTHER WAS A PASSENGER IN WHICH THE VEHICLE WAS AT A STOP WAITING FOR AN APARTMENT COMPLEX SECURITY GATE TO OPEN.  THE CAR SUDDENLY ACCELERATED TO SPEEDS ABOVE 60 MPH.  THE VEHICLE CRASHED THROUGH TWO APARTMENT COMPLEX SECURITY GATES, WENT AIRBORNE OVER A BUSY STREET AND CAME TO REST AGAINST THE SIDE OF A BUILDING.  TO OUR HORROR, MY GRANDMOTHER PERISHED IN THE ACCIDENT.  WE ARE AWAITING THE INFORMATION FROM THE BLACK BOX.  I HESITATE SO SAY TOO MUCH BECAUSE WE ARE STILL IN THE DECISION MAKING PROCESS OF HOW/IF TO PROCEED REGARDING LITIGATION.  DO NOT PURCHASE, DRIVE OR RIDE IN ONE OF THESE VEHICLES. *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/19/2011",
        "dateOfIncident": "11/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIFT GATE ON MY LEXUS RX 350 OPENS BY ITSELF WHILE THE CAR IS MOVING AND IS STATIONARY. THIS HAPPENED 5 SEPARATE TIMES OVER THE SPAN OF 4 MONTHS. DURING ONE OF THE TIMES THE LIFT GATE OPENED AND HIT MY GARAGE AND WAS DAMAGED. LEXUS DEALER EXAMINED THE CAR BUT COULD NOT DETERMINE THE CAUSE OF THE PROBLEM, THOUGH THEY OFFERED TO PAY 50% OF THE COST TO REPAIR DAMAGE TO LIFT GATE. SPOKE WITH LEXUS CORPORATE OFFICE AS TO NEXT STEPS TO RESOLVE THIS MALFUNCTION, THEY STONE WALLED ME AND EVEN WITHDREW THE OFFER TO PAY FOR 50% OF THE DAMAGE CAUSED BY THE MALFUNCTION OF THE LEXUS RX 350 REAR LIFT GATE.",
        "vin": "2T2ZK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/09/2011",
        "dateOfIncident": "03/12/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395334,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UNINTENDED ACCELERATION WITHOUT ABILITY TO BRAKE WITH MY LEXUS RX 350, AT 2 PM ON  SATURDAY  MARCH 12TH 2011  WITH 5 PASSENGERS. I WAS DRIVING AT AROUND 30 MPH. THE CHOICE WAS TO CRASH IN THE CAR AHEAD STOPPED AT A RED LIGHT OR GO ON THE SIDE WALK, UP A STEEP MOUNT AND CRASH IN A BRICK WALL. THIS IS WHAT I DID. NOBODY WAS HURT. POLICE WAS CALLED AND THE CAR WAS TOWED. CAR WAS INSPECTED BY TOYOTA, NO CAUSE WAS FOUND, CAR WAS REPAIRED AT A GEICO APPROVED REPAIRED SHOP, AND I AM NOW ASKING THE LEXUS DEALER POHANKA TO ALLOW ME TO RETURN THE CAR AND BREAK MY LEASE. IN GOOD CONSCIENCE ALTHOUGH NO ONE WAS HURT, I AM NOT WILLING TO RISK A MORE SERIOUS ACCIDENT AFTER MY EXPERIENCE. WE WOULD HAVE GOTTEN HURT AT A HIGHER SPEED. THIS WAS MY FIRST EVER CRASH DRIVING 20,000 MILES PER YEAR, DRIVING FOR MORE THAN 35 YEARS. THERE IS NO DOUBT SOMETHING OUTSIDE OF MY CONTROL HAPPENED.  *TR",
        "vin": "2T2BK1BA4AC"
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/03/2011",
        "dateOfIncident": "01/15/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394094,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO YOU TO DESCRIBE A VERY DANGEROUS CHARACTERISTIC OF THE LEXUS RX 450H. I AM LUCKY THAT A GUARDRAIL PREVENTED ME FROM GOING OFF A CLIFF AND I AM VERY CONCERNED THAT OTHER DRIVERS WILL NOT BE SO FORTUNATE.    WHILE DRIVING DOWN A SLIGHT INCLINE ON AN INCH OF SO OF FRESH SNOW IN INCLINE VILLAGE, NEVADA AT 25 MPH, I FOUND MYSELF OUT OF CONTROL EVEN THOUGH I HAD AT LEAST 200 FEET TO SLOW DOWN FOR A TURN; I HIT A GUARDRAIL AT 15 MPH, CAUSING $20,000 WORTH OF DAMAGE TO MY LEXUS RX 450H. NEEDLESS TO SAY, I TRADED IT THE NEXT DAY FOR AN RX 350H TO AVOID ANOTHER SIMILAR EXPERIENCE.    SO HOW DID THE SITUATION I DESCRIBE HAPPEN? WHEN I BRAKED, I QUICKLY NOTICED THAT THE WHEELS WERE LOCKED AND THAT THE STEERING NO LONGER WORKED (I HAVE FORTY YEARS OF EXPERIENCE DRIVING IN SNOW, HAVING BEEN IN SNOW SINCE MY YOUTH IN CANADA) AND I REMOVED MY FOOT FROM THE BRAKE TO REGAIN STEERING CONTROL. UNFORTUNATELY, THE WHEELS REMAINED LOCKED AND I RAN OUT OF TIME.     MY LEXUS RX 450H HAD LESS THAN 2,300 MILES AT THE TIME. I ACQUIRED IT WHEN MY LEASE ON MY RX 400H RAN OUT. WHILE I WAS AWARE THAT THE RX 400H LOCKED ITS WHEELS IN SLIPPERY ROAD CONDITIONS (A KNOWN ATTRIBUTE DOCUMENTED IN THE USER MANUAL), I KNEW HOW TO REACT AND NEVER PANICKED WHEN THE WHEELS LOCKED; I SIMPLY REMOVED MY FOOT FROM THE BRAKE AND REGAINED STEERING CONTROL.    SO WHAT MAKES THE RX 450H DIFFERENT THAN THE RX 400? A LOOK AT THE POWER GAUGE WHILE DRIVING IDENTIFIES THE DIFFERENCE QUICKLY; IN THE RX 400, THE CHARGING SYSTEM DOES NOT TRY TO CAPTURE ENERGY TO RECHARGE THE BATTERIES EXCEPT WHEN ONE IS TOUCHING THE BRAKE PEDAL, WHILE IN THE RX 450H, THE CHARGING SYSTEM TRIES TO CAPTURE ENERGY AS SOON AS ONE REMOVES HIS/HER FOOT FROM THE GAS PEDAL, NOT WHEN ONE TOUCHES THE BRAKE. FROM AN ENGINEERING PERSPECTIVE, IT MAKES SENSE TO LEVERAGE THE FACT THAT THE DRIVER IS INTENDING TO SLOW AS S/HE HAS REMOVED THEIR FOOT FROM THE GAS PEDAL BUT IT IS A DISASTER WHEN THE ROADWAY IS ICY.  *TR",
        "vin": "JTJBC1BA7A2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "02/10/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10391988,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE BRAKES, MARCH 13, 2011 - MANSFIELD MA  I PURCHASED MY 2010 LEXUS RX 450H IN DECEMBER 2010. EVER SINCE I BOUGHT IT, I HAVE NOTICED THAT FROM TIME TO TIME, WHEN I PRESS THE BRAKE PEDAL, THE CAR SEEMS TO SURGE FORWARD(!) MOMENTARILY BEFORE IT SLOWS DOWN. THIS HAPPENS MOST FREQUENTLY. IT WILL HAPPEN EVEN IF I AM ONLY COASTING AND NOT TOUCHING THE GAS PEDAL WHEN PRESSING THE BRAKE INITIALLY. IT HAPPENS TO ME AT LEAST ONCE OR TWICE A WEEK. IT IS SOMEWHAT DISTURBING. I HAVE MENTIONED THIS TO MY LEXUS DEALER, BUT THEY HAVE DISMISSED MY CONCERNS BOTH TIMES I BROUGHT IT UP.  HAS ANYONE ELSE NOTICED THIS ISSUE?   VIEW DETAILS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "03/09/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR, BACKED IT UP, PULLED FORWARD TURNING TO THE LEFT TO GO DOWN A DRIVEWAY WHEN THE CAR UNEXPECTEDLY ACCELERATED.  I STOMPED ON THE BRAKE BUT THE CAR DID NOT STOP.  I FLEW OUT OF THE DRIVEWAY, ACROSS THE STREET AND HIT 3 TREES AND A ROCK BEFORE THE CAR STOPPED. *TR",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "02/27/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX450H. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE BEGAN TO UNINTENTIONALLY DECELERATE. DURING THE FAILURE THE CHECK ENGINE, ALL WHEEL DRIVE AND HYBRID SYSTEM LIGHTS WERE ILLUMINATING. THE VEHICLE WAS THEN TOWED TO AN AUTHORIZED DEALER WHERE THEY WERE IN THE PROCESS OF DIAGNOSING THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 18,000.",
        "vin": "JTJBC1BA7A2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/07/2011",
        "dateOfIncident": "01/31/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER H/L 400",
                "productYear": "9999",
                "size": "P245/55R19",
                "type": "Tire"
            }
        ],
        "summary": "BUBBLE IN TIRE SIDEWALL. *LN",
        "vin": "2T2BK1BAXAC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/06/2011",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380875,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 2010 LEXUS RX350 THERE IS A DESIGN FLAW WITH THE WIPER/WASHER SYSTEM. WHEN TRAVELING WITH HIGH WINDS OR AT HIGH SPEEDS THE WASHERS DO NOT WORK ON THE UPPER PART OF THE WINDSHIELD, HENCE IT CAN BE DIFFICULT TO SEE. THIS CAN BE A SAFETY ISSUE, ESPECIALLY WHEN CONFRONTED WITH ROAD SPRAY IN COLD CLIMATES. THERE ARE NO ADJUSTMENT THAT CAN BE MADE. IT IS A FIXED NOZZLE. *TR",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380027,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADS-UP DISPLAY SHOWS DIFFERENT SPEED THAN SPEEDOMETER OVER 70MPH. *TR",
        "vin": "JTJBK1BA3A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/31/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350. WHILE STOPPED, THE VEHICLE SURGED FORWARD AND STOPPED ON ITS OWN. DURING THE FAILURE, THE SLIPPING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER BUT THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 26,000.",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/18/2011",
        "dateOfIncident": "01/17/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350. AFTER CRASHING INTO A SNOW EMBANKMENT THE FRONT BUMPER WAS CRACKED AND LOOSE. NO ONE WAS INJURED. THE VEHICLE WAS DRIVABLE AND WAS NOT TAKEN TO THE DEALER; HOWEVER, WHEN THE DEALER WAS CALLED, THEY INFORMED HER TO BRING THE VEHICLE IN FOR INSPECTION. THE BUMPER COST $900 TO REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 29,000.",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MAKES A NOISE LIKE A SLOPPY PISTON OR A ROD KNOCKING. THE CAR IS A 2010 LEXUS RX350 WITH 69,000 MILES. WHAT IS INTERESTING HERE IA THE FACT THAT THE ISSUE WAS DISCUSSED WITH THE SERVICE GROUP ON A RECENT CONFRENCE CALL BUT THE STAFF WAS TOLD TO KEEP IT QUIET.  IS TOYOTA PLAYING THE GAMES AGAIN?  *TR",
        "vin": "2T2ZK1BA3AC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "12/09/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370730,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE SENSORS APPEAR TO BE OVERLY SENSITIVE IN LEXUS VEHICLES. I OWN 2009 AND 2010 RX350S AND BOTH HAVE ISSUES WITH FALSE ALARMS, AND I WAS TOLD THAT THE DEALER SEES AT LEAST 20 CARS A DAY WITH FALSE ALARMS AND THEY ARE SELLING NITROGEN INFLATION GAS TO REDUCE THE RATE OF FALSE ALARMS. ALTHOUGH IT'S NOT VERY SERIOUS ISSUE AS FAR AS DIRECT SAFETY IS CONCERNED, IT CAN LEAD INTO THE SITUATION WHERE THE DRIVERS WILL START IGNORING THE WARNING LIGHT THAT CAN CAUSE DANGEROUS CONDITIONS. IF THE EQUIPMENT HAS HIGH FALSE POSITIVE RATES, THE MANUFACTURER SHOULD ADDRESS THE ISSUE, BUT THERE IS NO INDICATION THAT IT'S DOING ONE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "11/26/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 LEXUS 450H WON'T START.   WE BOUGHT A NEW 2010 LEXUS 450H ABOUT 3 WEEKS AGO, IT ALREADY HAPPENED TWICE, THE CAR JUST WON'T START. BUT AFTER PUSH POWER ON/OFF FEW TIMES, THE CAR STARTS. FIRST TIME IT HAPPENED ON THE MORNING OF NOV 26, WE ARE READY TO GO FOR A WEEKEND TRIP AT 8AM, FOOT ON THE BRAKE AND PUSH THE POWER, ALL LIGHTS GOES ON(EVEN THE HEADLIGHTS), FAN IS ON TOO, BUT NO READY LIGHT, STOPPED IT AND TRIED FEW TIMES, SAME THING, CALLED LEXUS ROADSIDE SERVICE, SAID WILL SEND SOMEONE TO JUMP IN 60 TO 90 MINUTES, I OPENED THE HOOD AND TRY TO FIND BATTERY TO JUMP MYSELF, TAKE A WHILE TO GET THOSE BLACK PLASTIC COVER OFF, DID NOT FIND THE BATTERY, TRY TO START THE CAR AGAIN, AND IT WORKS, THAT IS ABOUT 30 MINUTES AFTER PROBLEM FIRST OCCUR. DROVE 4 HOURS TO A WEEKEND TRIP, SATURDAY, USED CAR FEW TIMES, EVERYTHING IS FINE, THEN SAME THING HAPPENED ON SUNDAY,  START AND STOP FEW TIMES, AND IT WORKS.  *TR",
        "vin": "JTJBC1BA5A2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/26/2010",
        "dateOfIncident": "11/20/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367888,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY NEW LEXUS 450H (2,000 MILES) IN A FRESH LIGHT SNOW (1.5 TO 2 INCHES) IN INCLINE VILLAGE NV AT 25 MILES PER HOUR ON A SLIGHT DECLINE WHEN I DEPRESSED THE BRAKE PEDAL TO SLOW DOWN FOR A CURVE A FEW HUNDRED FEET AWAY. IT LOCKED THE WHEELS IMMEDIATELY AND AS A RESULT I HAD NO STEERING CONTROL. GIVEN THAT I HAD ENOUGH TIME TO GET MY FOOT OFF THE BRAKE BEFORE HAVING TO MAKE TURN AHEAD, I REMOVED MY FOOT FROM THE BRAKE (I HAVE BEEN DRIVING IN SNOW MY WHOLE LIFE SINCE I WAS RAISED IN CANADA) AND IT HAD NO EFFECT -- THE WHEELS REMAINED LOCKED AS I GAINED NO CONTROL OF STEERING AND THE VEHICLE CONTINUED TO SLIDE UNTIL IT HIT THE GUARD RAIL ACROSS THE STREET AS I ENTERED THE TURN AT SOME 10 TO 15 MILES AN HOUR.  I AM CONVINCED THAT THE PROBLEM LIES IN THE 450H TRYING TO GENERATE POWER WHENEVER THE GAS PEDAL IS NOT DEPRESSED -- THIS IS DIFFERENT THAN MY FORMER LEXUS 400H WHICH ONLY TRIED TO GENERATE POWER WHEN THE BRAKE PEDAL IS DEPRESSED (I KNOW ABOUT THE NEW LOGIC BECAUSE THE POWER GAUGE (THAT SHOWS WHETHER THE BATTERIES ARE CHARGING OR DISCHARGING) SHOWS CHARGING WHENEVER ONE'S FOOT IS TAKEN OFF THE GAS PEDAL  ON THE 450H, NOT ON THE 400H).   NEEDLESS TO SAY, I IMMEDIATELY WENT TO THE LOCAL LEXUS DEALER AND TRADED THE VEHICLE FOR AN RX350 THAT WILL DRIVE LIKE A NORMAL CAR.  I AM ONLY INTERESTED IN HAVING PEOPLE THAT LIVE IN HILLY SNOW CONDITIONS AVOID BUYING THE RX450H AS THEY WILL NECESSARILY HAVE THE SAME EXPERIENCE.  I DO NOT HAVE VIN AT THIS TIME AS I AM AT MY SECOND HOME IN CALIFORNIA AT THIS TIME. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "10/22/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366597,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350. WHILE DRIVING 5 MPH, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO TWO OTHER VEHICLE WHICH CAUSED A CHAIN REACTION. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR BODY REPAIRS. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD SEND AN INVESTIGATOR TO INSPECT THE VEHICLE. THE VEHICLE HAD NOT BEEN INSPECTED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "2T2BK1BA1AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365285,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT WAS DRIVING APPROXIMATELY 45 MPH, AND UNEXPECTEDLY AN INCREASE OF ACCELERATION OCCURRED. THE VEHICLE FAILED TO DECELERATE. THE BRAKE PEDAL WAS APPLIED AND THE VEHICLE BEGAN TO SLOW DOWN TO A COMPLETE STOP. THE VEHICLE WAS IN THE PROCESS OF BEING TOWED TO A DEALER FOR DIAGNOSTIC TESTING. THE FAILURE MILEAGE WAS APPROXIMATELY 3,800. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/27/2010",
        "dateOfIncident": "09/25/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A LEXUS 450H 3 MONTH AGO. ON LAST SATURDAY, WHEN THE CAR HIT CURB AT STARTING SPEED, THE STEER WHEEL TURNS 90 DEGREE. THE LEFT FRONT TIRE HAS ONLY VERY SMALL IMPACT, SOME DUST MARK CAN BE EASILY WIPED OFF. THE CAR IS STILL DRIVABLE, BUT WE ARE AFRAID THAT THIS CAR MAY LOSS CONTROL VERY EASILY, ESPECIALLY WHEN IT IS OFF ROAD ON BUMPY ROAD.  DEALER IS STILL TALKING WITH THE FACTORY TO CHECK WHETHER THE FACTORY WARRANTY WILL COVER THE DAMAGE. *TR",
        "vin": "JTJBC1BAXA2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2010",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357639,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PART 23565 C-VEHICLE WOULD NOT MOVE.  C-BROKEN RETAINING CLIP HOLDING RIGHT FRONT AXLE TO TRANSMISSION.  ALSO FOUND A MISSING BOLT IN BEARING CARRIER.  THIS IS A 2010 LEXUS RX 350 I PURCHASED IN FEB. 2010 FOR $44,000 WITH 15,000 MILES ON IT FROM THE FREMONT LEXUS DEALERSHIP IN FREMONT, CA.  VERY SCARY!  LUCKILY I WAS ONLY TRAVELING ABOUT 10 MILES AN HOUR AT THE TIME.  THE TRANSMISSION WOULD NOT MOVE.  WAS TOLD OLD PART COULD NOT BE GIVEN TO ME.  LEXUS OF CONCORD, CA FIXED IT.  FREMONT LEXUS ONLY OFFERED TO BUY BACK FOR $33,000. *TR",
        "vin": "2T2ZK1BA6AC"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2010",
        "dateOfIncident": "08/30/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW LEXUS RX 350 IN AUGUST 2010 AND HAD A COLLISION ON THE THIRD DAY DRIVING THE CAR.  I WAS AT A PARKING LOT WAITING FOR A PARKING SPACE.  THE ENGINE WOULD SHUT DOWN.  WHEN I SAW A PARKING SPACE AVAILABLE, I STARTED THE ENGINE BY PRESSING THE ENGINE BUTTON WITHOUT PRESSING THE BRAKE PEDAL (YOU DON'T NEED TO PRESS THE BRAKE WHEN YOU USE A KEY TO START THE ENGINE).  I DID NOT KNOW BY DOING THAT, I ONLY STARTED THE RADIO AND AIR CONDITIONING BUT NOT THE ENGINE ITSELF. I THEN PRESSED THE BRAKE PEDAL AND SHIFTED TO THE DRIVING GEAR.  AT THAT TIME, ANOTHER CAR WAS PULLING INTO THE PARKING LOT.  I WAS GOING TO STOP MY CAR TO WAIT FOR THE OTHER CAR TO PASS BY ME.  I PRESSED THE BRAKE BUT THE CAR DID NOT STOP AND KEPT GOING FORWARD BECAUSE THE ROAD IS A LITTLE STEEP.  I FELT THAT I HAD NO CONTROL OF THE CAR - BOTH THE BRAKE AND POWER STEERING.  MY CAR FINALLY STOPPED AFTER HITTING AN EMBANKMENT IN THE PARKING LOT.  THERE WAS DAMAGE TO THE FRONT BUMPER AND SCRATCHES ON THE SIDE.  TOTAL DAMAGE IS MORE THAN $2,000.  WENT TO THE DEALERSHIP AND WAS TOLD THE RX 350 WAS DESIGNED IN THAT WAY - IF YOU PRESS THE START BUTTON WITHOUT PRESSING THE BRAKE PEDAL, THE ENGINE WON'T START, BUT YOU ARE ABLE TO SHIFT THE GEAR TO DRIVING IF YOU PRESS THE BRAKE AT THIS TIME.  IT CAN BE VERY DANGEROUS BECAUSE THE POWER STEERING AND BRAKE WILL NOT WORK PROPERLY IF THE ENGINE IS NOT STARTED.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/09/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350031,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 LEXUS RX 350 - I WAS COMPLETELY BLINDED BY BACKLASH WATER, WHICH CAME DIRECTLY FROM THE FRONT WHEEL-WELL, WHILE DRIVING IN VERY HEAVY RAIN ON FOOTHILLS PARKWAY, BOULDER CO. I UNEXPECTEDLY DROVE THROUGH A FLOODED SECTION OF A HIGHWAY AT ABOUT 30 MPH DURING A VERY HEAVY RAIN STORM. IMMEDIATELY ENTERING THE FLOODED AREA, THE FRONT WINDSHIELD WAS COMPLETELY COVERED BY WATER, AND I WAS COMPLETELY BLINDED. IT LOOKED LIKE I WAS UNDERWATER!  RATHER THAN WATER EXPELLING TO THE SIDES OF THE CAR, THE WHEEL-WELL REDIRECTED THE WATER BACK ONTO THE CAR IN A WAIVE LIKE MANNER. THE WINDSHIELD CLEARED AFTER THE VEHICLE SLOWED DOWN TO ABOUT 15/10MPH. I INITIALLY BELIEVED THAT THE WATER CAME FROM THE CAR TO THE RIGHT OF ME. I REALIZED THAT THE WATER CAME FROM MY OWN CAR WHEN I DROVE THE CAR THROUGH ANOTHER FLOODED SECTION OF A STREET AT A SLOWER SPEED. I COULD CLEARLY SEE THAT THE FRONT WHEEL-WELL WAS KICKING WATER BACK ON TO THE HOOD OF THE CAR IN A \"WAIVE\" LIKE FASHION. WITH A SLIGHT INCREASE IN SPEED, THE RATE OF WATER ON TO THE CAR INCREASED, AND WATER EVENTUALLY COVERED THE HOOD AND THEN THE WINDSHIELD. THE SECTION OF THE HIGHWAY WAS NOT CLOSED, AND OTHER VEHICLES WERE GOING THROUGH THE FLOODED AREA. NO CARS WERE STALLED. THIS WAS THE MOST HELPLESS SITUATION I HAVE EXPERIENCED IN MY 40+ YEARS OF DRIVING! THE CAR WAS A RENTAL LOANER FROM THE DEALER, STEVENSON LEXUS OF LAKEWOOD, COLORADO. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347260,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX450 HYBRID. THE CONTACT WAS DRIVING AT UNKNOWN SPEEDS IN A PARKING LOT WHEN THE VEHICLE ABNORMALLY ACCELERATED. THE BRAKES WOULD NOT ENGAGE DESPITE HER REPEATED ATTEMPTS TO STOP THE VEHICLE. THE VEHICLE PROCEEDED TO ACCELERATE AND THE FRONT PASSENGER TIRE EXPLODED. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS AWAITING A DIAGNOSIS OF THE FAILURE. THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 16,000.",
        "vin": "JTJBC1BA2A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/31/2010",
        "dateOfIncident": "07/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/29/2010 MY 2010 LEXUS RX 350 EXPERIENCED UNINTENDED EXHILARATION CAUSING A COLLISION WITH A PARKING LOT COLLISION SAFETY POST (METAL PIPE FILLED WITH CONCRETE) CAUSING EXTENSIVE FRONTAL DAMAGE OF THE VEHICLE. THE INCIDENT OCCURRED AT APPROXIMATELY 1245 ON A CLEAR DAY DRY PAVEMENT WITH NO OTHER VEHICLES IN THE PARKING LOT NEAR THE SCENE OF THE COLLISION. THE INCIDENT OCCURRED WHEN I WAS PULLING INTO THE A PARKING SPOT MAKING RIGHT HAND TURN. AS I WAS ENTERING THE PARKING SPOT AT APPROXIMATELY 1/2 WAY I TAPPED THE ACCELERATOR PEDAL TO COMPLETE THE PARKING MANEUVER AND THAT IS WHEN THE CAR LUNGED FORWARD WITH A SPEED INDICATIVE OF HARD ACCELERATION COLLIDING WITH THE POST BEFORE I COULD TAKE ANY ACTION TO SLOW OR STOP THE VEHICLE. THE ACCELERATION DETAILED ABOVE HAS HAPPENED ONCE BEFORE WHEN MY HUSBAND WAS DRIVING THE VEHICLE AND EXPERIENCED SUDDEN ACCELERATION. WE WERE BOTH PUZZLED BY THE EVENT BUT DECIDED TO DISMISS IT SINCE IT OCCURRED DURING  THE NATION WIDE MEDIA BLITZ ABOUT TOYOTA VEHICLES UNINTENDED ACCELERATION, AND REALLY DID NOT WANT TO BUY IN INTO MASS HYSTERIA. HIND SIGHT BEING 20/20 MAYBE WE SHOULD HAVE. *TR",
        "vin": "2T2BK1BA1AC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2010",
        "dateOfIncident": "07/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343797,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "10 MONTH OLD 2010 LEXUS RX 350 HAS LOOSE BUMPER ALL THROUGHOUT.  POSSIBLE THE VERY BOTTOM GENTLY HIT SOMETHING AND NOW THE ENTIRE BUMPER IS FALLING OFF NOW. BROUGHT IT TO DEALER AND HE SAID IF IT'S HIT IN THE RIGHT SPOT THE PLASTIC BUMPER WILL BE LOOSE, BUT WON'T FALL OFF, HOWEVER IF IMPACT WAS ON ONE SIDE ONLY, WHY IS THE BUMPER COMPLETELY SEPARATED UNDER THE HEADLIGHT ON THE OTHER SIDE OF THE CAR AS WELL AND THE GAP IS INCREASING. I LOOKED ONLINE AND MANY PEOPLE HAVE THIS PROBLEM AND IT'S SPECULATED THAT THE BUMPER WAS PUT ON WITH TOO FEW CLIPS TO HOLD IT IN PLACE. BEWARE, THE 2010 LEXUS RX 350 IS POORLY MADE AS A BUMPER SHOULD NOT COME OFF FROM SOMEONE'S KNEE OR LITTLE SCRATCH. AREN'T CARS SUPPOSED TO BE MADE TO WITHSTAND A LITTLE DINGS WITHOUT COMPROMISING AN ENTIRE BUMPER?! *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "06/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340827,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MODEL YEAR 2010 LEXUS RX 350 HAD A SUDDEN ACCELERATION PROBLEM WHILE TRYING TO PARK IN A PARKING LOT PARKING PLACE IN EDMOND OKLAHOMA. THE CAR SURGED FORWARD RUNNING OVER THE CURB AND REQUIRED SWERVING TO THE RIGHT ONTO A GRASS MEDIAN BETWEEN THE PARKING LOT AND  BUSY FAST MOVING STREET.  THE CAR THEN TRAVELED APPROXIMATELY 100 FEET AT  AN UNCONTROLLABLE  SPEED BEFORE SWERVING BACK INTO THE PARKING LOT WHERE  THE VEHICLE THEN STOPPED. THE CAR IS ONLY THREE MONTHS OLD AND HAS 2040 MILES. THE LEXUS DEALER SAYS THERE IS NO HISTORY OF SUDDEN ACCELERATION ISSUES WITH THIS YEAR AND MODEL CAR. THE CAR IS NOW AT THE DEALERSHIP AWAITING 7- 14 DAYS FOR A LEXUS FACTORY SPECIALIST TO EXAMINE THE CAR. THIS SUDDEN ACCELERATION ISSUE IS NOT MERE PARTS OR INCONVENIENCE ISSUE. THIS WAS A NEAR DEATH EXPERIENCE AND A POSSIBLE LIFE OR DEATH ISSUE FOR OTHER 2010 LEXUS RX 350 OWNERS. *TR",
        "vin": "2T2ZK1BA1AC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM DOES NOT IDENTIFY POI'S SUCH AS GAS STATIONS ALONG ROUTE. THIS IS DANGEROUS AS WHEN THE NAV SYSTEM IS USED AS A PRIMARY INFO SOURCE - LOOKING FOR A GAS STATION, ONE CANNOT BE FOUND. LEAVES USER IN A PANIC STATE - WHICH CAN LEAD TO DANGEROUS SITUATIONS. LEXUS - SOLD AN INTEGRATED NAV SYSTEM - WHICH IS SUPPOSED TO BE A REFERENCE WHEN TRAVELING. THIS REFERENCE IS UN-RELIABLE AND SHOULD BE RECALLED FOR A FIX AS A SAFETY ISSUE. DISCUSSED THIS WITH SALES PERSON AT DEALER, ACKNOWLEDGED VERBALLY THAT THE NAV SYSTEM HAS PROBLEMS - NO UPGRADES AVAILABLE. *TR",
        "vin": "JTJBK1BA5A2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NAV SYSTEM MANUAL ENTRY IS DISABLED WHEN CAR IS IN MOTION. FORCES USER TO USE VOICE COMMANDS. VOICE RECOGNITION IS POOR - HAS DIFFICULTY IN RECOGNIZING WORDS SUCH AS MONTREAL, OTTAWA. STREET NAMES HAVE TO BE EXACTLY FOR EXAMPLE AVENUE MAIN, IF MAIN IS SAID IT WILL NEVER FIND IT. DOES NOT HAVE THE OPTION OF SELECTING INTERSECTION WHEN DRIVING. ALL THIS MAKE THE NAV SYSTEM A SAFETY HAZARD. DRIVER BECOMES DISTRACTED TRYING TO GET THE ENTRY INTO THE SYSTEM. SLOWS DOWN, DRIFTS IN LANE. THIS IS MORE DANGEROUS THAN ALLOWING THE DRIVER TO ENTER DATA MANUALLY. THERE IS AN AFTER MARKET OVER-RIDE AVAILABLE - WHICH THE SERVICE MANAGER SAYS, IF INSTALLED WILL NOT VOID WARRANTY. BUT FROM A SAFETY PERSPECTIVE, LEXUS SHOULD OFFER A USABLE SYSTEM OR REFUND USERS THEIR MONIES AND DISABLE A DANGEROUS FEATURE. *TR",
        "vin": "JTJBK1BA5A2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "03/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336334,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NAV SYSTEM DOES NOT DISTINGUISH HEIGHT ON HIGHWAYS. THIS IS VERY DANGEROUS ON ELEVATED HIGHWAYS - AS NAV SYSTEM ASKS DRIVER TO TAKE EXITS THAT DON'T EXIST. AS A RESULT WILL CAUSE A DRIVER TO PANIC - LEADING TO AN ACCIDENT SITUATION.  NOWHERE IN THE ADVERTISING DOCUMENTATION DOES IT STATE THAT IT CANNOT DISTINGUISH ELEVATED HIGHWAYS AND SIDE ROADS. LEXUS CHARGES A PREMIUM FOR THIS DEVICE AND IT IS A SAFETY CONCERN TO DRIVERS UNAWARE OF ITS FAULTS. MOREOVER, THERE SHOULD BE A WAY FOR CAR COMPANIES TO BE ACCOUNTABLE ON THE QUALITY OF ELECTRONICS THEY DELIVER.  A NOTICE TO ALL OWNERS WITH THE NAV SYSTEM SHOULD BE SENT OUT. CAR DEALER ACKNOWLEDGES NAV SYSTEM DEFICIENCY. NO FIX AVAILABLE. SUBSTANDARD PRODUCT FOR A LEXUS AUTOMOBILE. *TR",
        "vin": "JTJBK1BA5A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THAT WHEN ACCELERATING FROM A STOPPED OR SLOWED POSITION, THE VEHICLE WOULD CHANGE GEARS AT RANDOM. THIS FAILURE OCCURRED NUMEROUS TIMES. ON THE LATEST OCCASION, UPON ACCELERATING FROM A SLOWED POSITION, THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT APPLIED PRESSURE TO THE BRAKES TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE IT WAS LOCATED AT THE TIME OF THE COMPLAINT; THE DEALER HAD BEEN UNABLE TO DIAGNOSE THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000. THE CURRENT MILEAGE WAS APPROXIMATELY 11,000.",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 LEXUS RX 350. DRIVER'S SIDE VIEW MIRROR WAS DISTORTED.  *TGW  THE CONSUMER NOT ONLY NOTICED A BLURRED IMAGE, BUT DOUBLE IMAGES AT THE EDGE OF THE MIRROR. *JB",
        "vin": "2T2BK1BA1AC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "12/21/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX 350. WHILE ATTEMPTING TO PARK THE VEHICLE, THE CONTACT STATED THE VEHICLE ABNORMALLY LUNGED FORWARD AND STALLED. THIS WAS NOT THE FIRST OCCURRENCE OF THE FAILURE. THE MANUFACTURER WAS CONTACTED AND ADVISED THEY WERE AWARE OF THE FAILURE BUT HAD NOT DEEMED THE ISSUE AS A SAFETY CONCERN. THERE WERE NO RECALLS FOR THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 2,450. UPDATED 07/06/10. *LJ  THE CONSUMER STATED WHEN GOING FROM REVERSE TO DRIVE ON THE STREET, THE VEHICLE WOULD STALL. UPDATED 09/21/10",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "04/21/2010",
        "dateOfIncident": "01/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326756,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANTED TO ALERT YOU THAT OTHER HYBRID MODELS THAT WERE MANUFACTURED WITH THE SAME BRAKING SYSTEM AS THE PRIUS SUFFER THE SAME ISSUE.  I HAVE A 2010 LEXUS 450H RX AND ITS BRAKES DISENGAGE WHEN I AM DRIVING ON BUMPY ROADS AND OVER POT HOLES.  I LIVE IN A NORTHEASTERN CITY WITH MANY BUMPS AND MY BRAKES STOP WORKING OFTEN AND AS A RESULT I HAVE TO SLAM THEM ON MUCH MORE QUICKLY.  ALTHOUGH I HAVEN'T HAD A CRASH AT THIS POINT, I CAN EASILY SEE RUNNING INTO THE BACK OF A STOPPED CAR IN FRONT OF ME IF MY BRAKES DISENGAGE AT THE WRONG TIME.  THIS IS A CONTINUAL ISSUE AND I DON'T HAVE A SPECIFIC DATE BUT GIVEN THE PRIUS RECALL, I AM CONFUSED WHY MY OWN BRAKES HAVE NOT HAD A SIMILAR SOFTWARE FIX AND THE ISSUE SOUND EXACTLY THE SAME.  THE DATE BELOW IS NON SPECIFIC.  I HAVE HAD THE CAR FROM DEC 2009 UNTIL NOW AND THE ISSUE HAS BEEN CONTINUOUS.  THE BRAKES APPEAR TO WORK FINE ON SMOOTH ROADS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "01/04/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. WHILE RELEASING HER FOOT FROM THE ACCELERATOR PEDAL AT APPROXIMATE SPEEDS OF 30 MPH, THE VEHICLE ABNORMALLY ACCELERATED. THE CONTACT WAS ABLE TO STOP THE VEHICLE BY DEPRESSING THE BRAKE PEDAL. THE DEALER COULD NOT DUPLICATE THE FAILURE. THERE WERE NO REPAIRS MADE TO THE VEHICLE. THE FAILURE WOULD OCCUR INTERMITTENTLY. THE FAILURE MILEAGE WAS 1,700 AND THE CURRENT MILEAGE WAS 5,200.",
        "vin": "2T2BK1BA3AC"
    },
    {
        "components": "SERVICE BRAKES, AIR,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "07/28/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325528,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2010 LEXUS RX 450H IN JULY OF 2009.  EVER SINCE I BOUGHT IT, I HAVE NOTICED THAT FROM TIME TO TIME, WHEN I PRESS THE BRAKE PEDAL, THE CAR SEEMS TO SURGE FORWARD(!) MOMENTARILY BEFORE IT SLOWS DOWN.  THIS HAPPENS MOST FREQUENTLY WHEN DRIVING OVER BUMPY ROADS.  AND IT WILL HAPPEN EVEN IF I AM ONLY COASTING AND NOT TOUCHING THE GAS PEDAL WHEN PRESSING THE BRAKE INITIALLY.  IT HAPPENS TO ME AT LEAST ONCE OR TWICE A WEEK.  IT IS SOMEWHAT DISTURBING.    I HAVE MENTIONED THIS TO MY LEXUS DEALER, BUT THEY HAVE DISMISSED MY CONCERNS BOTH TIMES I BROUGHT IT UP.  I NOTICED THIS EVEN BEFORE I HAD HEARD OF THE TOYOTA RECALL ON HYBRID PRIUS BRAKES, BUT FROM WHAT I READ, THE ISSUE SOUNDS SIMILAR TO THE PRIUS HYBRID 2010 PROBLEMS.  BUT THERE IS SO FAR NO RECALL ON LEXUS 2010 HYBRID BRAKES.  HAS ANYONE ELSE NOTICED THIS ISSUE? *TR",
        "vin": "JTJZB1BA2A2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325553,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I REVERSE OUT OF MY DRIVEWAY, WHICH IS ON AN INCLINE, ONTO A FLAT MAIN ROADWAY, THE VEHICLE STALLS (WHILE STILL IN REVERSE). THIS HAS HAPPENED MULTIPLE TIMES ON MY 2010 LEXUS RX 350, AS WELL AS PREVIOUSLY ON MY 2008 LEXUS 350. *TR",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "04/03/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325552,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY, APRIL 3, 2010, I WAS DRIVING MY 2010 LEXUS RX 350 ON A TWO-LANE ROAD IN CLARION PA. I WENT TO PASS THE VEHICLE IN FRONT OF ME WHEN MY ACCELERATOR GOT STUCK. THE VEHICLE RPM REDLINED AND I QUICKLY ACCELERATED. I SLAMMED ON MY BRAKES, AND EMERGENCY BRAKES, AND EVENTUALLY PUT IN THE CAR IN NEUTRAL, AND WAS ABLE TO COME TO A STOP OFF THE ROADWAY IN ABOUT 1/2 MILE. WHEN I WAS STOPPED (VEHICLE WAS STILL RED-LINING), I WAS ABLE  TO SEE THE ACCELERATOR PEDAL WAS STUCK IN THE GROVE ON THE TOP OF MY ALL WEATHER OEM CAR MAT. *TR",
        "vin": "2T2BK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "04/04/2010",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323760,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 LEXUS RX350. THE CONTACT STATED THAT  WHILE DRIVING AT APPROXIMATE SPEEDS OF 55 MPH, THE VEHICLE ABNORMALLY ACCELERATED TO SPEEDS OF 90 MPH. THE CONTACT ALSO STATED THAT THERE WAS SMOKE COMING FROM THE TIRES WHEN HE TRIED TO APPLY THE BRAKES.  HE WAS ABLE TO SHIFT THE VEHICLE TO NEUTRAL AND TURN THE IGNITION OFF TO GAIN CONTROL OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER COULD NOT DUPLICATE THE FAILURE. THE APPROXIMATE CURRENT AND FAILURE MILEAGES WERE 4,000.",
        "vin": "2T2BK1BA6AC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX 350. WHILE DRIVING THE VEHICLE AT APPROXIMATELY 50 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL BUT THE VEHICLE DID NOT SLOW DOWN. AS A RESULT, THE CONTACT CRASHED INTO ANOTHER VEHICLE. THERE WERE NO INJURIES BUT A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN AUTOMOTIVE BODY SHOP BUT NO REPAIRS WERE MADE WHEN THE COMPLAINT WAS FILED. THE VIN WAS UNAVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 5,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "08/30/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE BOUGHT LEXUS RX 350, 2010. VEHICLE SKIPS GEAR ON AND OFF, PARTICULARLY WHEN IN SLOW SPEED TO WHEN YOU TRY TO RAISE SPEED.  WE TOOK CAR BACK TO DEALER THREE TIME SINCE THAN, THEY COULDN'T FIND ANY PROBLEM, BUT IT IS SCARY WHEN ALL OFF A SUDDEN VEHICLE JUMPS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314181,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A 2010 LEXUS RX450H ON A HIGHWAY AT @60 MPH WHEN IT ACCELERATED ON ITS OWN TO @80 MPH WITHIN A FEW SECONDS. IT RESPONDED TO THE BRAKE AND I EXITED THE HIGHWAY. I HAD THE VEHICLE PREVIOUSLY CHECKED BY THE DEALER, RALLYE LEXUS IN GLEN COVE NY,  AND THEY SAID THEY WERE NO PROBLEMS. THE DEALER AND FACTORY REP. CHECKED THE VEHICLE AFTER THE INCIDENT AND THEY AGAIN SAID THERE WERE NO PROBLEMS WITH THE CAR. HOWEVER, THE EVENT DID OCCUR AND NOW I WILL NOT DRIVE THE VEHICLE.    FORTUNATELY THERE WAS NO ACCIDENT AS A RESULT OF THE MALFUNCTION. *TR",
        "vin": "JTJBC1BA9A2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "08/13/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313118,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2010 LEXUS 450H IN AUGUST OF 2009 AND LESS THAN ONE WEEK AFTER PURCHASED MY WIFE PARKED THE CAR FOR TWO HOURS AND RETURNED AND THE BATTERY WAS DEAD.   LEXUS SENT SOMEONE TO JUMP START IT AND WE BROUGHT TO SERVICE AT THE DEALER IN CARLSBAD, CA.  THE NEXT DAY.  THEY CHECKED IT OVER AND SAID THAT THE ONBOARD COMPUTER NEVER FOUND A PROBLEM AND THAT ALL APPEARED TO BE PERFECT.  THEY DOUBTED THAT THE CAR WAS EVER JUMP STARTED BUT THEN CALLED THE TOWING PEOPLE AND FOUND THAT TO BE TRUE.  THEY GAVE ME A READOUT SHOWING THE CAR WAS FINE AND THAT THE ONBOARD COMPUTER SHOWED NO ERROR. *TR",
        "vin": "JTJZB1BA3A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "12/04/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313269,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SUDDENLY ACCELERATED AS I WAS PARKING AND HIT A CONCRETE WALL.  I WAS ALMOST IN THE SPACE AND GOING 1MPH APROX. 3 OR 4 FEET FROM THE WALL.   THEY SAID I STEPPED ON THE WRONG PEDAL TO CAUSE IT.   I DID NOT, BUT LOST MY CONFIDENCE AND TRUST IN MY DRIVING.  THE MODEL CAR IS A 2010 LEXUS MODEL RX350.  NOT ON THE LIST OF RECALLS.  THE DAMAGE WAS IN EXCESS OF $14,000.  MY INSURANCE PAID ALL BUT THE DEDUCTIBLE.  I STILL DO NOT BELIEVE THAT I DID WHAT THEY SAY AND DO NOT TRUST  LEXUS TO TELL ME THE TRUTH OF THE MATTER AT THIS TIME.  THE CAR WENT STRAIGHT TO THE DEALERSHIP FOR REPAIRS. *TR",
        "vin": "2T2ZK1BA8AC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "08/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312842,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A 2010 LEXUS 350RX. IN AUG 2009, I WAS DRIVING HOME AND THE CAR ACCELERATED UP TO ABOUT 60MPH. MY HUSBAND WAS IN THE CAR WITH ME. WE WERE TRYING EVERYTHING TO STOP THE CAR. WE FINALLY GOT IT STOPPED. IT DID IT A SECOND TIME WITH MY HUSBAND DRIVING THE NEXT DAY. WE KNOW WITHOUT A DOUBT THAT IT WAS NOT THE FLOORMAT . WHICH THAT IS WHAT LEXUS BLAMED IT ON. I WOULD NOT DRIVE THAT CAR AGAIN. *TR",
        "vin": "2T2ZK1BAXAC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "01/27/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S A LEXUS RX 350 2010, THE TRUCK SEEMS TO ACCELERATE OR LURCHES FORWARD WITH BRIEF SPURTS OF ACCELERATION, THE LAPSE IN BRAKING IS PROBABLY LESS THE A SECOND. IT HAPPEN WHILE I BRAKE TO A FULL STOP. I TAKE THE TRUCK TO TWO LEXUS DEAL FOR CONCERN, BUT THEY SAID, THE VEHICLE IS OPERATING AS DESIGNED, WHEN THEY COMPARED TO SAME MODEL VEHICLE. THEY ALSO SAID THAT LURCHES IS, THE VEHICLE IS PREPARING TO SHIFT INTO NEXT GEAR SO IT'S READY TO SHIFT TO A DIFFERENT GEAR.PLEASE REVIEW THIS INCIDENT SO THAT I COULD GET THIS OFF MY MIND. *TR",
        "vin": "2T2BK1BA7AC"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2010",
        "dateOfIncident": "11/28/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX450H. THE CONTACT WAS DRIVING APPROXIMATELY 25 MPH OVER A BUMPY ROAD SURFACE.  THERE WAS PRESSURE APPLIED TO THE BRAKE PEDAL IN WHICH THERE WAS A DELAY POWER RESPONSE.  THE DRIVER WAS ABLE TO CONTINUE IN OPERATION.  THE FAILURE OCCURRED WHENEVER ENCOUNTERING A BUMPY ROAD SURFACE.  IN ADDITION, DURING ACCELERATION THE VEHICLE BECAME UNCONTROLLABLE WHICH OCCURRED INTERMITTENT.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION.  THE TECHNICIAN WAS UNABLE TO DETECT A PROBLEM.  THE VEHICLE HAS NOT BEEN REPAIRED FOR THE MALFUNCTION.  THE FAILURE MILEAGE WAS 900.    UPDATED 03/15/10  *BF  UPDATED 10/05/10",
        "vin": "JTJBC1BA9A2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "08/06/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10311888,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC LIFTGATE ON THE BACK OF MY NEW LEXUS SUV CRUSHED MY MOTHER AGAINST THE DECK WHILE SHE WAS REACHING IN TO LOAD SOMETHING INTO THE CAR.  SHE WAS NEARLY DECAPITATED AND THERE DID NOT SEEM TO BE ANY SAFETY MECHANISM THAT WOULD STOP THE LIFTGATE FROM CLOSING, SUCH AS YOU WOULD FIND ON A GARAGE DOOR.  I FRANTICALLY PUSHED THE BUTTON ON THE KEY FOB AND FINALLY THE DOOR STOPPED CLOSING.  AT THAT POINT MY MOTHERS NECK WAS PINED AGAINST THE DECK.  I HIT THE BUTTON AGAIN AND THANKFULLY IT LIFTED BACK UP.  MY MOTHER ENDED UP WITH A WRENCHED NECK AND BAD HEADACHE.  WE TESTED IT A FEW MORE TIMES BY HITTING THE BUTTON TO CLOSE THE DOOR AND STICKING OUR ARM UNDER THE DOOR.  AGAIN, THE DOOR NEVER SENSED THAT SOMETHING WAS IN THE WAY AND CONTINUED TO CLOSE.  I DON'T KNOW IF OTHER PEOPLE HAVE HAD THE SAME PROBLEM BUT IT SEEMED WORTH REPORTING GIVEN THE SOFTWARE PROBLEMS THAT TOYOTA/LEXUS SEEM TO BE HAVING CURRENTLY. *TR",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "12/10/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RX450H IS DOWNRIGHT DANGEROUS.  THE 4 WHEEL DRIVE DOES NOT SWITCH \"ON DEMAND\" AS THE ADVERTISING SAYS.  I LIVE IN SNOWY MASSACHUSETTS AND DO NOT NEED PERMANENT 4 WHEEL DRIVE, BUT IT IS ESSENTIAL WHEN THE ROADS ARE FULL OF SNOW OR ICE.  I WAS PUZZLED AT FIRST THAT THE 4 WHEEL DRIVE ONLY ACTUATED UNDER 25 MPH.  I TESTED IT ON SHARP CORNERS IN THE SNOW:  THE BACK SLID OUT;  AND ON FASTER, GRADUAL CORNERS: THE CAR SIDE SLIPPED.  NEVER DID THE 4 WHEEL DRIVE SWITCH ON AND CORRECT THE SLIDE.  I LOOKED IN THE MANUAL FOR THE METHOD TO MANUALLY ACTIVATE 4 WHEEL DRIVE BUT COULDN'T FIND IT.  I CONTACTED LEXUS.  THEY SAID THAT I SHOULD USE THE SNOW SWITCH.  THIS IS A MENU ITEM WHICH ANNOYINGLY MUST BE SWITCHED ON EVERY TIME YOU DRIVE.  IT DIDN'T WORK AS IT ONLY CHANGES THE GEAR AND ACCELERATION CHARACTERISTICS LIKE ANY OTHER WINTER/SUMMER SWITCH.  THEY ALSO SAID THAT IT SHOULD WORK AT HIGH SPEEDS WHEN MORE POWER IS NEEDED.  I TRIED THAT AND FOUND THAT AT 60 MPH IF I ABSOLUTELY FLOORED THE ACCELERATOR ON A STEEP HILL THE 4 WHEEL DRIVE WOULD SWITCH ON BRIEFLY.  THAT'S HYBRID TECHNOLOGY BEING USED TO REDUCE CONSUMPTION?!   I WENT BACK TO MY DEALER: WHAT WAS I DOING WRONG?  AFTER TWO MONTHS OF PHONE TAG WITH THE DEALER AND LEXUS, THE DEALER PROMISED TO PICK UP THE CAR AND TEST IT.  AFTER A WEEK OF TELEPHONE CALLS THEY SAID THERE WAS NO POINT IN TESTING THE CAR AS IT WAS WORKING \"AS DESIGNED\".  HOWEVER IT WASN'T WORKING AS ADVERTISED WHICH IS THAT THE 4 WHEEL DRIVE WILL COME ON \"AS NEEDED\".  I'D SAY THAT A BROAD SKID IN SNOW IS \"AS NEEDED\".  LEXUS DOES NOT INTEND TO DO ANYTHING ABOUT THIS COMPLAINT.  THEY PUT ME ONTO A \"BUSINESS DEVELOPMENT\" SPECIALIST WHO TRIED TO UPSELL ME ON A NON-HYBRID 4X4 WHICH HE SAID HAD \"A NON SLIP DIFFERENTIAL\" AND WOULD THEREFORE HAVE BETTER HANDLING.  I CONSIDER IT VERY DANGEROUS THAT A DRIVER THINKS THEY WILL HAVE CONTROL BECAUSE OF LEXUS ADVERTISING AND SALESMAN CLAIMS BUT WILL LIKELY LOOSE CONTROL IN SNOW OR ICE AND CAUSE A SERIOUS ACCIDENT. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2010",
        "dateOfIncident": "01/28/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310398,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 LEXUS RX 350 HAS HAD TWO INCIDENTS OF SUDDEN ACCELARATION IN THE 6 WEEKS I HAVE OWNED THE VEHICLE.  ON BOTH OCCASIONS, THE VEHICLE SUDDENLY REVED UP PAST 4 TO 5,000 RPM FOR A FRACTION OF A SECOND AND THEN RETURNED TO NORMAL RPM (2000).  REPORTED THE FIRST INCIDENT TO LEXUS.  NO ACTION HAS BEEN TAKEN BY LEXUS. *TR",
        "vin": "JTJZK1BA9A2"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "01/30/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307520,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN ALDIE, VA AND HAVE A NEW LEXUS 2010 RX 450H HYBRID. I HAD AN ACCIDENT ON 01/30/2010 AROUND 11AM. WHAT HAPPENED WAS... I WAS DRIVING AROUND 5 TO 10 MILES SPEED AND TURNED THE VEHICLE TO 90 DEGREES SLOWLY TO GO TO THE SCHOOL. BUT THE VEHICLE WENT 45 DEGREES AND HIT A WOODEN STOP SIGN. I WAS REALLY DRIVING SLOW. I APPLIED THE BRAKE, BUT THE CAR SUDDENLY PICKED SOME SPEED AND HIT THE STOP SIGN. ITS UNUSUAL. THERE MAY BE SOME DEFECT IN THE BRAKES/GAS PEDALS OR WITH THE ABS SYSTEM OR THE ELECTRONICS AROUND IT. I CALLED LEXUS CUSTOMER SERVICE AND FILED A COMPLAINT ABOUT THE VEHICLE. THEY ARE SENDING IT TO THE LEGAL DEPARTMENT. THE ESTIMATED DAMAGE TO MY CAR WAS AROUND $5,550 AND THE CAR IS CURRENTLY AT THE AUTOBODY SHOP FOR REPAIR.",
        "vin": "JTJBC1BA3A2"
    },
    {
        "components": "STEERING,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307676,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEXUS HYBRID SUV 2010 RX450H. CAR WAS IN SNOW SETTING AND WHEN I TRIED TO BRAKE ON A LIGHT SNOW SURFACE, THERE WAS NO RESPONSE FROM THE BRAKES AND I ALSO WAS UNABLE TO STEER.  I CONTINUED FORWARD UNTIL I REACHED CLEAR PAVEMENT AND WAS THEN ABLE TO BRAKE.  THIS HAPPENED 3 TIMES TODAY UNDER THE SAME CONDITIONS.  LUCKILY NO CARS WERE COMING OR I WOULD HAVE BEEN HIT BROADSIDE ON A BUSY STREET.  *CN",
        "vin": "JTJBC1BA6A2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NEW 2010 LEXUS  RX 350 KEEP STALLING WHILE I WAS WAITING FOR TRAFFIC LIGHT, PROBLEM STATED SOON AFTER I STARTED DRIVING , WHILE MILEAGE WAS AROUND 1500, WHEN THE CAR STALLED ABS (ANTI BRAKE SYSTEM) SIGN SHOWED UP.  I TOOK THE CARS SEVERAL TIMES BACK TO  LEXUS, THEY USED THEIR COMPUTER TO  CHECK COMPUTER RECORDS OF MY CARS AND CLAIMED NOTHING WRONG WITH THE CAR, UNTIL THE THIRD TIME I WENT BACK , THE BRAKE MALFUNCTION WARNING SIGN  SHOWED UP WHILE LEXUS'S TECHNICIAN WAS INSIDE THE CAR WITH ME, THEN THEY KEPT THE CAR 10 DAYS  AND REPAIRED THE PROBLEM, BUT STILL CLAIMED NOTHING ELSE IS WRONG WITH THE CAR, CANNOT EXPLAIN WHY THE CAR STALLED, THEY CLAIMED COMPUTER OF MY CAR DIDN'T RECORD ANY STALLED HISTORY THEREFORE NO PROOF CAR STALLING PROBLEM.  I TOLD THEM  THE COMPUTER OF MY CAR IS SO DEFECT THAT THEY DIDN'T FIND BRAKE MALFUNCTION PROBLEM UNTIL THE SIGN SHOWED UP IN DASHBOARD, WHY ARE  THEY STILL RELY ON THE COMPUTER? THEY KEPT THE CAR FOR 10 DAYS TO REPAIR A BRAKE, HOW COME IT TAKES 10 DAYS?  I BELIEVE THEY FOUND OUT THAT THE CAR HAS MORE THAN BRAKE PROBLEMS, AND THEY KNOW ALL THE  LEXUS  CAR HAS POTENTIAL PENDING PROBLEM, EITHER ELECTRONICALLY OR  COMPUTER THAT CONTROL THE ELECTRONIC , IMAGINE  IF MY CAR STALLED  WHILE I WAS DRIVING ON THE HIGH WAY, FOR THE SAFETY OF ALL THE  CARS  ON THE STREET, YOUR DIVISION SHOULD LOOK INTO THE PROBLEM OF NOT ONLY TOYOTA BUT ALSO LEXUS AND OTHER CARS MADE BY TOYOTA MOTOR INC. *TR",
        "vin": "JTJBK1BA2A2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "08/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEXUS 2010 RX 350 CRUISE CONTROL TRAVELING AT 75 MPH IN ARIZONA HAD TO SLOW DOWN TO ABOUT 55 MPH AND WHEN THE CRUISE CONTROL WAS RESUMED THE VEHICLE ROARED AHEAD. THE ACCELERATION WAS EXTREME (PUSHED US BACK IN OUR SEATS) AND STOPPED AFTER CRUISE CONTROL WAS TURNED OFF. *TR",
        "vin": "2T2BK1BA5AC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2010",
        "dateOfIncident": "01/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX458. WHENEVER THE STEERING BASE WAS ADJUSTED AN ITEM COULD FALL BETWEEN THE STEERING BASE AND IT PREVENTED THE CONTACT FROM MAKE A LEFT OR RIGHT TURN. THE CONTACT IS CONCERNED ABOUT THE SAFETY RISK SINCE A PART OF HIS KEY CHAIN WAS CAUGHT IN THE STEERING WHEEL. THE CURRENT AND FAILURE MILEAGES WERE 40.",
        "vin": "JTJBC1BA1A2"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/25/2009",
        "dateOfIncident": "09/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296944,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT HEAD RESTRAINTS WILL NOT LOCK IN THE PROPER POSITION ON MY NEW LEXUS RX350. THEY KEEP RISING UNTIL THEY REACH THE TOP  POSITION AND THEY WILL LOCK IN THAT POSITION, BUT NOT IN THE FIRST OR SECOND POSITIONS. THIS IS A SAFETY ISSUE BECAUSE I NEED THEM TO LOCK IN THE FIRST POSITION. THE DEALER SAID THEY WERE OPERATING CORRECTLY AND LEXUS SAID I SHOULD GET A SECOND OPINION FROM A DIFFERENT DEALER. HOWEVER, THE OWNER'S MANUAL ON PAGE 71 STATES: \"AFTER ADJUSTING THE HEAD RESTRAINTS, PUSH DOWN ON THEM AND MAKE SURE THEY ARE LOCKED IN POSITION.\" THEY WILL NOT LOCK IN ANY POSITION BUT THE TOP ONE. *TR",
        "vin": "JTJBK1BA6A2"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/19/2009",
        "dateOfIncident": "07/06/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288972,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW LEXUS RX 350 2010 ON JULY 3, 2009 AT NEWPORT LEXUS. ON AUGUST 28 WHEN I OPENED THE LEFT REAR DOOR  AT NIGHT, WHILE SUV WAS PARKED IN THE GARAGE, TO RETRIEVE ITEM FROM THE BACK SEAT, THE WHOLE LEFT REAR WINDOW SHATTERED IN PIECES. IT WAS QUITE A TRAUMATIC EXPERIENCE FOR ME. IT TOOK ME ALMOST FORTY MINUTES TO CLEAN UP THE FIBROGLASS DEBRIS. PRIOR TO THIS INCIDENT, I WAS NOT AWARE OF ANY DAMAGE TO THE LEFT REAR PASSENGER SIDE WINDOW. I TOOK THE SUV BACK TO DEALER NEXT DAY. THE COMPANY DID REPLACE IT IN GOODFAITH. THEY CLAIMS IT WAS THE FIRST TIME THEY HEARD SUCH AN INCIDENT. I JUST WONDER WHETHER THERE ARE OTHER REPORTED SIMILAR INCIDENT. I DO HAVE GRANDKID OCCASIONALLY SITTING IN THE REAR SEAT. IF COULD POTENTIALLY CAUSE INJURY TO THE PASSENGER SITTING IN THE BACK SEAT. *TR",
        "vin": "JTJBK1BA7A2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/26/2009",
        "dateOfIncident": "09/25/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285307,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE TIRE 235/75/19   DUELER H/L 400  TIRE HAS HAIR LINE SPLITS ON SIDE WALL THAT CAUSE TIRE TO GO FLAT.   THIS IS A NEW LEXUS RX450 WITH ONLY 2,800 MILES, CAR DID NOT BUMP A CURB,POT HOLE OR BEEN IN A ACCIDENT.  LEXUS AUTO DEALER WILL REPLACE THE TIRE AT A COST TO ME. *TR",
        "vin": "JTJBC1BA3A2"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 LEXUS RX350.  THE CONTACT HEARD A RATTLING SOUND IN THE REAR DRIVER'S SIDE WHEEL.  THE VEHICLE WAS TAKEN TO THE DEALER ON FOUR SEPARATE OCCASIONS IN ORDER TO CORRECT THE FAILURE, BUT THE NOISE STILL PERSISTS.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 720.   UPDATED 08/04/09.  *LJ  UPDATED 08/10/09.*JB",
        "vin": "2T2BK1BA1AC"
    }
]