[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402653,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FLUID LEAKING BETWEEN POWER STEERING RESERVOIR AND POWER STEERING PUMP.",
        "vin": "JM3ER2WM9A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355546,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT WHILE HER IN-LAWS WERE DRIVING, THE VEHICLE STALLED AND SHUTOFF. UPON INSPECTION, IT WAS DISCOVERED THAT OIL LEAKED UNDER THE VEHICLE AND A HOLE WAS PRESENT ON THE SIDE OF THE ENGINE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. MURRAY MAZDA LOCATED AT 85 GRIFFITH RD, MUNCY, PA 17756 WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "JM3ER4WL0A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324220,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS ARE VERY DANGEROUS,  IMPOSSIBLE TO SEE DOWN THE ROAD USING THE LOW BEAM LIGHTS.  THIS IS VERY DANGEROUS AND SHOULD BE A SAFETY RECALL FOR THE MANUFACTURER TO CORRECT.  *TR",
        "vin": "JM3ER4W34A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315857,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS ARE VERY DIM NO MATTER WHICH BULBS I PUT IN. I REALLY NEED TO GET THIS FIXED BECAUSE DRIVING AT NIGHT IS A DANGER. I'VE READ MANY MAZDA CX-7 OWNERS HAVE HAD THIS ISSUE.",
        "vin": "JM3ER2WM7A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297009,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT IS ON. DRIVERS SIDE IS WHERE THE ISSUE IS. THERE WAS JUST A RECALL ON PASSENGER SIDE AIRBAG. I",
        "vin": "JM3ER2W58A0"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292200,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE TOOK MY VEHICLE TO OCEAN MAZDA DEALER LOCATED AT 9675 NW 12TH STREET MIAMI FL 33172 FOR AIR BAG RECALL REPLACEMENT ON 12/30/19 CAR AIRBAGS WERE REPLACED AND WAS RETURNED WITH AND UNSERVICEABLE STEERING WHEEL HARD TO TURN UNSAFE CONDITION TO DRIVE MY WIFE COMPLAINT TO SHOP MANAGER BUT THEY REFUSED TO REINSPECT VEHICLE AND FIND WHAT IS WRONG WITH THE STEERING WHEEL AFTER AIRBAGS WERE REPLACED SINCE MY WIFE DID NOT RECEIVE ANY HELP FROM SHOP MANAGER SHE FILED A COMPLAINT TO DORAL POLICE #141230025446 I ARRIVED AFTER AND I POLITE REQUESTED MANAGER TO CHECK STEERING WHEEL COMPARTMENT IF ANYTHING WAS DAMAGED WHILE INSTALLING AIRBAGS HE ACCEPTED AND ASK ME TO LEAVE CAR AT DEALERSHIP FOR DIAGNOSTIC I WILL FOLLOW UP WRITING ON THIS COMPLAINT AFTER FIND OUT WHAT'S HAPPENING TOMORROW 12/31/19",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270849,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED GETTING NOISE FROM THE ENGINE FOR LAST 6 MONTHS. BUT WHEN THE RPM IS GREATER THAN 2000. THE NOISE DECREASES, WHEN I TOOK TO THE DEALER SERVICE, THEY MENTIONED THAT TIMING CHAIN NEED TO BE REPLACED. MAZDA KNOWS ABOUT THE ISSUE AND ADMITS IT BUT NEVER PERFORMS A RECALL.",
        "vin": "JM3ER4W39A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267129,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON PUTTING MY CAR IN REVERSE WITH MY FOOT ON THE BREAK,  THE VEHICLE ACCELERATES TO THE POINT I HAVE TO SMASH THE BREAK TO THE FLOOR.  THIS HAS HAPPENED SEVERAL TIMES WHILE PUTTING MY CAR IN DRIVE AND WHILE WAITING AT RED LIGHTS.  I'VE ALMOST BEEN IN SEVERAL ACCIDENTS BECAUSE OF THIS ISSUE.  IT HAS BEEN HAPPENING SINCE I PURCHASED THE VEHICLE NEW.  THE DEALER WAS UNABLE  TO DUPLICATE THE PROBLEM SO THEY DECIDED THE CAR WAS FINE.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234879,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK, TAKING A LEFT TURN, WHEN MY CAR JOLTED TO A STOP IN THE INTERSECTION. I WAS UNABLE TO MOVE MY CAR OUT OF THE INTERSECTION, BECAUSE THE WHEEL WASN'T ATTACHED PROPERLY ANYMORE. I CALLED FOR A TOW TRUCK, AND THE VEHICLE WAS TOWED TO A LOCAL AUTO SHOP. AT THE AUTO SHOP THEY DISCOVERED THAT A PREVIOUSLY RECALLED PART (LOWER CONTROL ARM) HAD FAILED, WHICH IS WHAT CAUSED ALL OF THE DAMAGE. I WAS NOT AWARE OF THIS RECALL. I CALLED THE MAZDA DEALERSHIP WHERE I PURCHASED THE VEHICLE TO ASK FOR ADVICE. I WAS ADVISED TO HAVE THE VEHICLE REPAIRED AT MY LOCAL AUTO SHOP, AND THEN TO SEND THE INVOICE TO MAZDA TO BE REIMBURSED FOR THE RECALLED PART/LABOR. I SENT THE INVOICE TO MAZDA, AND THEY SAID THEY COULDN'T PROVIDE REIMBURSEMENT UNTIL THE RECALL WAS CLOSED, AND IN ORDER TO DO THIS I NEEDED TO HAVE EVERYTHING CHECKED OFF/RECALL CLOSED BY A MAZDA DEALERSHIP. I TOOK MY VEHICLE BACK TO THE DEALERSHIP WHERE I PURCHASED IT FROM, THEY DID THE INSPECTION, AND CLOSED THE RECALL. THEN I SENT THE INVOICE AND THE DOCUMENTS STATING THE RECALL HAD BEEN CLOSED, BUT MAZDA STILL DENIED MY REQUEST SAYING THAT I NEEDED TO HAVE HAD THE REPAIRS DONE AT A MAZDA DEALERSHIP. I AM REQUESTING TO STILL BE REIMBURSED FOR THE LOWER CONTROL ARM (AT LEAST THE COST OF THE PART), SINCE I FOLLOWED THE ADVICE I WAS GIVEN FROM BOTH THE MAZDA DEALERSHIP AND MAZDA.",
        "vin": "JM3ER2W56A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179841,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY UNHAPPY WITH MY HEADLIGHTS ON MY MAZDA CX7 2010 OR SHOULD I SAY LACK OF HEADLIGHTS. I HAVE PUT 8 LIGHT BULBS IN THIS CAR AND THEY WERE THE EXPENSIVE ONES. THIS CAR IS A PIECE OF CRAP ALL THE WAY AROUND BUT THE HEADLIGHTS ARE REALLY BAD! ALSO THEY ARE SO CLOUDED OVER. I HAVE A HARD TIME DRIVING AT NIGHT AND NOW I JUST CAN'T BECAUSE I AM NOT GOING TO GET STOPPED AGAIN FOR HAVING A HEADLIGHT OUT! I ONLY DRIVE DURING THE DAY. I CAN'T BELIEVE THAT THEY DO NOT HAVE A RECALL FOR THIS PROBLEM, WHEN I SEE SO MANY COMPLAINTS ON THE SAME THING. THIS IS SUCH A STRESS ER FOR ME. I WISH THERE WAS SOMEONE OUT THERE THAT COULD HELP US IN THIS SITUATION.",
        "vin": "JM3ER4WL6A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166081,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR IN FOR AIR BAG RECALL (WHICH WAS FIXED).  DEALER DID A FULL CIRCLE INSPECTION AND FOUND THE TIMING CHAIN NEEDED REPLACEMENT.  WE RECEIVED A LETTER FROM MAZDA JANUARY, 2012 STATING THEY WERE EXTENDING THE WARRANTY TO 7 YRS FROM THE ORIGINAL WARRANTY DATE OR 70,000 MILES WHICHEVER COMES FIRST FOR REPAIRS TO THE TIMING CHAIN.  THIS LETTER LEADS ME TO BELIEVE THEY KNEW THERE WERE ISSUES WITH THE TIMING CHAIN.  OUR CAR HAS 39,100 MILES (OBVIOUSLY LOW FOR THE AGE OF THE CAR).  WE WERE REQUIRED TO PAY FOR THE REPAIR OUT OF POCKET BECAUSE IT WAS OUTSIDE THE WARRANTY PERIOD.  IT SEEMS VERY UNFAIR THAT OUR CAR WAS NOT COVERED FOR AN ISSUE MAZDA WAS CLEARLY AWARE OF IN 2012.  WHILE IT WAS NOT AN ACTUAL RECALL, SOMETHING WAS WRONG WITH THE TIMING CHAIN AND ALL OWNERS SHOULD BE COMPENSATED FOR FAILURE OF THE CHAIN.  I DO NOT KNOW EXACTLY WHAT CAN HAPPEN TO A CAR IF THE CHAIN BREAKS, BUT MY BEST GUESS IS IT  WILL STOP RUNNING, WHICH IS A HUGE CONCERN REGARDING SAFETY OF THE VEHICLE.",
        "vin": "JM3ER4W39A0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145229,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LIMITED VISIBILITY DURING NIGHT DRIVING DUE TO POOR HEADLIGHT PERFORMANCE. HEADLIGHT LENSES SEEM TO BE EXTREMELY FOGGY. ONLY HAPPENS WITH LOW-BEAMS.",
        "vin": "JM3ER2W57A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132912,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. UPON STARTING THE VEHICLE, THE AIR BAG WARNING INDICATOR ILLUMINATED, WHICH WAS A SAFETY CONCERN. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 66,125.",
        "vin": "JM3ER2W53A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131552,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V018000 (AIR BAGS). THE CONTACT CALLED THE MANUFACTURER MORE THAN TWICE AND CONFIRMED THAT THE PART WAS UNAVAILABLE. A DEALER WAS NOT CONTACTED BECAUSE THE MANUFACTURER HAD NOT PROVIDED THE PART FOR THE REPAIR. IN ADDITION, THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION). THE MANUFACTURER WAS CONTACTED FOR A REFERRAL FOR AN AUTHORIZED DEALER TO SCHEDULE THE TWO RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W37A0"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "03/21/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098170,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WONDERING WHY 3 OF MY WINDOW MOTORS WENT OUT THE SAME DAY.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/31/2018",
        "dateOfIncident": "03/31/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082328,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT BULBS HAVE BURNED OUT EVERY 6 MONTHS SINCE WE BOUGHT THE VEHICLE IN 2010. OVER THE PAST FEW YEARS, THE LENSES HAVE FOGGED UP TO THE POINT HEADLIGHTS ARE WORTHLESS. TOOK THE VEHICLE TO THE DEALER, ONE SEAL IS BAD AND THE OTHER SIDE HAS MELTED, COST OF REPAIR IS NEARLY $2,000. THIS IS A SAFETY ISSUE AND LOOKS TO BE A COMMON DEFECT IN THIS MAKE/MODEL OF CAR. WE NOW DRIVE THE CAR ONLY DURING DAYLIGHT. IF WE NEED TO AT NIGHT, WE USE HIGH BEAMS EXCLUSIVELY AS WE CAN'T SEE A THING WITH REGULAR HEADLIGHTS.",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080205,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS REQUIRED OF THE RECALL, I WENT TO PARETTI MAZDA TO FOR THE REPLACEMENT OF FRONT LOWER CONTROLS ARMS ON MARCH 14, 2018.  AS PER THE RECALL NOTIFICATION AND REPLACEMENT OF PARTS RECEIVED FROM NHTSA INDICATING THE MAZDA DEALER WILL REPLACE BOTH THE LEFT AND RIGHT FRONT LOWER ARMS FREE OF CHARGE AND THAT A RENTAL CAR WOULD BE PROVIDED; HOWEVER, AT THE COMPLETION OF THE REPLACEMENT. PARETTI MAZDA CHARGED ME $65 FOR THE REPAIR.",
        "vin": "VIN JM3ER2W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079835,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING 55 MPH, THE VEHICLE'S TEMPERATURE GAUGE INCREASED. THE VEHICLE SHOOK AND A POPPING NOISE WAS HEARD. THE VEHICLE WAS DRIVEN BACK TO THE CONTACT'S RESIDENCE AND THEN STALLED. A \"WARNING STATE OF SHOCK\" MESSAGE APPEARED. IN AN ATTEMPT TO COOL THE ENGINE, THE AIR CONDITIONER WAS ACTIVATED. THE VEHICLE WAS TOWED TO ANTELOPE VALLEY MAZDA (1015 AUTO MALL DR, LANCASTER, CA 93534, (661) 945-7590) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED DUE TO THE REPAIR COST. THE CONTACT WAS INFORMED BY THE DEALER THAT THE REPAIRS WOULD BE COVERED UNDER THE VEHICLE'S WARRANTY. THE CONTACT RECEIVED A CALL FROM THE MANUFACTURER INFORMING HER THAT THE ENGINE REPLACEMENT WAS NOT COVERED UNDER THE VEHICLE'S WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 165,000. *TT  *JS",
        "vin": "JM3ER4W3XA0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079081,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL WAS REPORTED  OCT 2016 MY WIFE AND FAMILY HAVE BEEN DRIVING AT RISK FOR  5 MONTHS AND ITS GOING TO BE ANOTHER 3 WEEKS TO FIX THIS IS UNACCEPTABLE. WHAT IS MAZDA GOING TO DO TO COMPENSATE FOR THIS.",
        "vin": "1J4NF1FB9BD"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074677,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH LOW BEAM HEAD LIGHTS KEEP GOING OUT. I HAVE HAD THE CAR FOR 3 YEARS IN JULY AND I'VE HAD TO GET GET EACH LIGHT CHANGED 3 TIMES ALREADY. WHEN I GET ONE SIDE FIXED THE OTHER ONE GOES OUT.",
        "vin": "JM3ER2W30A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067260,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER GOING OUT ON MY 2010 CX-9 AT 97,000 MILES  MAZDA IS PLAYING GAMES SAYING IF I BRING TO DEALER AND PAY $120 DIAGNOSTIC FEE, THEY \"MAY ASSIST\" IF CONFIRMED.  SUPERVISOR WOULD NOT QUOTE WORK BUT OFFERED RANGE OF $800-$1300 FOR REPAIR, WOULD NOT PROVIDE HOW MUCH MAZDA WOULD COVER.  LOCAL SHOP CHARGES $450.  MAZDA RIPOFF!",
        "vin": "JM3TBBMV3A0"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066157,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL NUMBER 16V-593.  MY CAR MAKES A RATTLE WHEN I STEP ON THE BRAKES.  WHEN IT IS WET OUTSIDE MY BRAKES MAKE A DIFFERENT NOISE UNTIL THEY DRY OUT.  MAZDA SAID IT WASN'T A PROBLEM.  ANOTHER BUSINESS I GO TO SAID IT'S PROBABLY THE ROCKER ARMS THAT NEED REPLACEMENT.",
        "vin": "JM3ER4W31A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066154,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVEN'T HAD AN ACCIDENT, BUT AM VERY WORRIED THAT IF I DO THE AIR BAG MAY EXPLODE.  SINCE MY VEHICLE IS A 2010, HOW LONG DOES MAZDA HAVE TO REPAIR THIS VEHICLE?",
        "vin": "JM3ER4W31A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063668,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR 2 YEARS A RECALL HAS BEEN IN EFFECT FOR REPLACING BALL JOINTS ON THIS MODEL. AFTER TALKING TO THE DEALER ON 2 DIFFERENT OCCASIONS , I HAVE BEEN TOLD THAT THEY ARE WAITING ON THE PARTS. ON DEC. 13 2017 I WAS TOLD I WOULD BE CONTACTED WITHIN 30 DAYS BY MAZDA FOR SCHEDULING THIS WORK. BUT STILL NO RESPONSE.",
        "vin": "JM3ER4W32A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063647,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WAS DENIED REPLACEMENT AFTER DROPPING CAR OFF AT DEALERSHIP WHERE I HAD PURCHASED THE CAR NEW. CAR HAS 85,000 MILES. I WAS CALLED BACK FROM DEALERSHIP SERVICE DEPT TELLING ME THAT THEY CANNOT PERFORM 1317F OR 9516E, AIR BAG REPLACEMENT DUE TO MY AIRBAG LIGHT BEING ON. AIRBAG LIGHT WAS NOT ON WHEN DROPPING VEHICLE OFF AND NOT ON WHEN PICKING UP VEHICLE. I NOTIFIED SERVICE ADVISER THAT THERE WAS NO AIRBAG LIGHT ON BEFORE DRIVING AWAY BUT HE SAID THERE WAS NOTHING HE COULD DO SAYING THAT THE REFUSAL CAME FROM CORPORATE. NOW IF MY FAMILY WERE TO GET INJURED OR KILLED BY THIS DEFECTIVE AIRBAG AFTER REFUSAL BY THE DEALER, I COULD HAVE A STRONG CASE AGAINST THEM I THINK. BUT I WOULD RATHER HAVE A SAFE CAR. SERVICE HAD OFFERED DOING AN AIRBAG DIAGNOSTIC AT A CHARGE OF $140.00. NOT KNOWING WHAT THE OTHER CHARGES MIGHT BE TO FIX LIGHT ($1000 COMPUTER) AND NOT KNOWING HOW ACCURATE THE DIAGNOSTIC WILL BE I WAS FORCED TO DENY THE DIAGNOSTICS.",
        "vin": "JM3ER2WM5A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "10/22/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055851,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BOB KING MAZDA (1545 SILAS CREEK PKWY, WINSTON-SALEM, NC 27127, (336) 714-3177) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055922,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT BULBS WERE BURNING OUT AND COULD NOT BE REPLACED BECAUSE THE CLIPS WERE BROKEN. I WAS TOLD THIS IS QUITE COMMON IN THE DESIGN AND IN THEIR INFINITE WISDOM, MAZDA REFUSES TO SELL NEW CLIPS, INSTEAD, I WAS FORCED TO BUY TWO NEW HEADLIGHT FIXTURES TO THE TUNE OF $1200 FOR PARTS AND 300 FOR LABOR.  I AM NEVER BUYING ANOTHER MAZDA.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/18/2017",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047140,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A FIX FOR THIS RECALL 9716H HAS STILL NOT BEEN RESOLVED.  CORROSIVE BALL JOINT.",
        "vin": "JM3ER4W32A0"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042696,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, I HAVE CONTACTED THE MAZDA DEALERSHIP IN RIDGELAND MS OVER A YEAR AGO AND HAVE YET TO GET MY CAR IN FOR THE AIRBAG REPLACEMENT AND THIS IS FOR THE REPLACE OF THE LOWER CONTROL ARMS, IT HAS BEEN OVER A YEAR AND THE PARTS ARE STILL NOT AVAILABLE FOR REPLACEMENT.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041679,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "1) WE RECEIVED NOTIFICATION OF THE RECALL WHEN WE PURCHASED THE USED VEHICLE ON 7/8/2017. THE MANUFACTURER HAS FAILED OR IS UNABLE TO REMEDY THIS SAFETY RECALL FOR MY VEHICLE IN A TIMELY MANNER. THE SAFETY RISK ASSOCIATED WITH THIS RECALL IS THE VEHICLE MAY EXPERIENCE SIGNIFICANT LOSS OF STEERING CONTROL, INCREASING THE RISK OF A CRASH.",
        "vin": "JM3ER4WL6A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040353,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS BEEN ON FOR PAST YEAR. THE DEALERSHIP SAID THEY CAN MAKE IT TURN OFF BUT I'M ASSUMING SINCE THE LIGHT IS ON MY AIRBAG IS DISABLED AND WON'T WORK WHEN AND IF IT NEEDS TO.",
        "vin": "JM3ER2W35A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040284,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  MAZDA KEEPS SAYING TO WAIT FOR A SECOND LETTER.  IT IS A 2010 AND HAS BEEN YEARS.  WHY DON'T THEY REPAIR THE CAR?",
        "vin": "JM3ER4W31A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "09/27/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035661,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN A RECALL FOR THE CONTROL ARMS FOR A WHILE NOW AND THE DEALER HAS NO FIX FOR THEM.. SO IM PAYING 367$ A MONTH FOR A CAR THAT I CANNONT DRIVE BECAUSE IT IS NOT SAFE.",
        "vin": "JM3ER2W31A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033463,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL A YEAR AGO AND HAVE HEARD NOTHING FURTHER.  THE RECALL NOTICE REFERENCES NHTSA CAMPAIGN NO. 16V-593.  I FAIL TO UNDERSTAND HOW A SAFETY RECALL CAN GO IGNORED BY THE MANUFACTURER AND YOUR AGENCY FOR OVER A YEAR.",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033241,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO MAITA MAZDA (2410 AUBURN BLVD, SACRAMENTO, CA) WHERE IT WAS DIAGNOSED THAT A CONNECTOR IN THE AIR BAG WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE FAILURE DID NOT OCCUR UNTIL AFTER THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 17V429000 (AIR BAGS). THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 77,869.",
        "vin": "JM3ER2WM3A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "09/04/2017",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024871,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING THE CX-7 ON THE HIGHWAY AND IT CAUGHT ON FIRE.  THERE WAS A POP AND THEN SMOKE AND FLAMES.  MY DAUGHTER MOVED TO THE LEFT SHOULDER AS SOON AS SHE HEARD THE POP AND THE VEHICLE ENGULFED IN FLAMES.  THE VEHICLE WAS A TOTAL LOSS.  AT THE TIME OF THE INCIDENT THE VEHICLE WAS IN GREAT CONDITION.  THE VEHICLE WAS AT 94,000 MILES.  AN OIL CHANGE WAS COMPLETED RECENTLY AS WELL AS ALL REGULAR MAINTENANCE.",
        "vin": "JM3ER2W53A0"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022873,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE MY MAZDA 2010 CX7 ON 3-11-2017.  WHEN THE DEALER GIVE ME TO ME. THE MAZDA HAVE THIS. THEY STAR WITH THE LIGHT ON IN AIR BAG AND OTHER TIME. THE OTHER PROBLEM IS WHEN USE THE SWITH AND PUT THE LIGHT THERE CHANGE AND I'M THINK THERE HAVE PROBLEM ELECTRICAL AND IN THE RIM. THE MAZDA RUNNING BUT THEY HAVE A COUPLE PROBLEM.  AND UNKNOWN SITUATION THE ONLY FIXED IS THE LOWER CONTROL ARM. BECAUSE WHEN AM GOING OVETHERE THEY TOLD ME THE ONLY RECALL HAVE IS THAT WANT. THE LOWER CONTROL ARM.",
        "vin": "JM3ER2WM0A0"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021464,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE NOTIFIED OF A SAFETY RECALL IN AUGUST 2016 AT THE TIME THEY INFORMED US A FIX WAS UNAVAILABLE AND WE WOULD BE NOTIFIED WHEN ONE WAS AVAILABLE.  THE RECALL INCLUDES THE POSSIBLE LOSE OF STEERING DURING OPERATION.  DO DATE, SEPTEMBER 6, 2017 NO INFORMATION HAS BEEN RECEIVED REGARDING PARTS, A FIX OR A SOLUTION TO THIS DANGEROUS DEVELOPMENT.",
        "vin": "JM3ER2WMXA0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020518,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SKIDS DURING RAIN/SNOW CONDITION AS IF I WILL LOSE CONTROL OF CAR.  BRAKES WERE CHECKED & CHANGED BUT THE PROBLEM STILL OCCURS.  I EXPERIENCED ON SEVERAL DIFFERENT OCCASIONS OVER THE PAST YEARS. I CONTACTED MAZDA DEALER AND WAS TOLD I HAD TO WAIT TO HEAR FROM MANUFACTURE...STILL WAITING.",
        "vin": "JM3ER2W55A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019330,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4 SEPARATE OCCASIONS, THE BRAKES FAILED TO STOP THE CAR. THE LAST 2 TIMES, THE CAR NOT ONLY DIDN'T STOP BUT IT ACCELERATED. I COULD HAVE BEEN INVOLVED IN A COUPLE OF VERY SERIOUS ACCIDENTS. EACH TIME, I WAS DRIVING ON CITY STREETS ON DRY PAVEMENT. THE LAST OCCURRENCE WAS ON AUG 14, 2017, AND I TRIED TO STOP THE CAR BY USING THE GEAR SHIFT, BUT THE CAR DIDN'T STOP RIGHT AWAY. THE DEALERSHIP IS CURRENTLY WORKING WITH MAZDA TECH SUPPORT, BUT THEY CAN'T FIND A CAUSE FOR THIS. THEY WANT TO INSTALL A FLIGHT RECORDER, AND FOR ME TO TAKE THE CAR BACK SO I CAN DRIVE IT UNTIL THIS HAPPENS AGAIN. I TOLD THEM NO BECAUSE OF THE SERIOUSNESS OF THE PROBLEM, AND THE DEALERSHIP IS TESTING IT NOW. THIS PROBLEM BEGAN IN AUGUST 2015, AND I'VE ALREADY SPENT OVER $1000 ON REPAIRS RELATED TO IT.",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/09/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019418,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL # 16V-593  MANUFACTURER RECALL # 9716H  I RECEIVED THE RECALL NOTICE IN AUGUST OF 2016 THAT STATES THE BALL JOINT COULD LOOSEN AND I COULD CRASH THEY STILL DO NOT HAVE THE PARTS OR A REMEDY HOW LONG SHOULD I HAVE TO WAIT BEFORE THIS ISSUE IS FIXED ONCE I CRASH WILL IT BE FIXED???",
        "vin": "JM3ER4WL1A0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/20/2017",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016413,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA SENT ME A RECALL NOTICE IN AUGUST OF 2016. THE RECALL STATED THAT WATER COULD POSSIBLY ENTER THE FRONT SUSPENSION LOWER ARM BALL JOINT DURING DRIVING. AS A RESULT OF THE LOOSENESS, A RATTLE MAY OCCUR AT BALL JOINT LOWER CONTROL ARM. AFTER EXTENDED OPERATION IN SUCH A CIRCUMSTANCE, IT COULD SEPARATE AND GETTING INTO A CRASH COULD BECOME EASIER. THIS IS A SAFETY ISSUE THAT NEEDS ADDRESSED IMMEDIATELY, AS I HAVE BEEN WAITING OVER A YEAR FOR THIS ISSUE TO BE FIXED.",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016165,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE BALISE MAZDA DEALER (LOCATED AT 3635 RIVERDALE ST, WEST SPRINGFIELD, MASSACHUSETTS 01089; 413-306-3036) WHO STATED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THERE WERE REPLACEMENTS FOR CERTAIN VEHICLES AND TO HAVE THE DEALER DIAGNOSE THE VEHICLE TO SEE IF THE REMEDY WAS NEEDED. THE CONTACT RETURNED TO THE DEALER WHO REFUSED TO DIAGNOSE THE VEHICLE AND REITERATED THAT THERE WERE NO PARTS AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND OPENED CASE NUMBER: 3063036. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 10/26/17*LJ    *JS",
        "vin": "JM3ER2WM5A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015181,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AN UNKNOWN LOCAL DEALER WHO INFORMED THE CONTACT THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM3A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015198,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED ABOUT THE RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT EXPERIENCED A RATTLING AND KNOCKING NOISE WHILE STEERING THE VEHICLE LEFT AND RIGHT. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W58A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014245,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013949,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THE VEHICLE'S TIE ROD FAILED AND NEEDED TO BE REPLACED. THE CONTACT TOOK THE VEHICLE TO THE COASTAL CART CARE DEALER WHO REPAIRED THE TIE ROD AND INFORMED THE CONTACT THAT PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 70,000. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE REMEDY WAS NOT AVAILABLE. VIN TOOL CONFIRMS REMEDY NOT YET AVAILABLE.",
        "vin": "JM3ER2WM9A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012826,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (COOLEY MOTORS LOCATED AT 401 N GREENBUSH RD, RENSSELAER, NY 12144; (518) 283-2902) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ...UPDATED 08/29/17 *BF      *CN",
        "vin": "JM3ER4WL8A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012857,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER:16V593000 (SUSPENSION) WAS RECEIVED IN AUGUST OF 2016. AFTER CONTACTING THE DEALER (QUINCY MAZDA IN QUINCY, MASSACHUSETTS) AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM1A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011991,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS), WHICH WAS CHANGED TO NHTSA CAMPAIGN NUMBER: 17V429000 (AIR BAGS) DUE TO THE FACT THAT THE REMEDY FOR THE AIR BAGS WAS DEFECTIVE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT A RECALL REMEDY APPOINTMENT WAS MADE WITH FUCCILLO IMPORTS (18822 US-11, WATERTOWN, NY 13601 (315) 782-1600); HOWEVER, THE DEALER CANCELLED THE APPOINTMENT THE DAY PRIOR AFTER BEING NOTIFIED BY THE MANUFACTURER THAT THE REMEDY WAS DEFECTIVE. A NEW APPOINTMENT DATE COULD NOT BE CONFIRMED. THE MANUFACTURER WAS CONTACTED AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W38A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010767,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V59300 (SUSPENSION) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. (VIN TOOL CONFIRMS PARTS NOT AVAILABLE).",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010290,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V593000(SUSPENSION) WAS RECEIVED IN AUGUST OF 2016. AFTER CONTACTING THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE LOCAL DEALER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM9A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/22/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010060,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED TAILIGHTS LOOKED FUNNY, SO I REMOVED THEM TO INSPECT THEM. TO MY SURPRISE THERE WERE MELTED HOLES IN THE TAILLIGHT, AND BURN/CHARRED MARKS ON 2 OF THE LIGHT RECEPTACLES. ALSO HAVING PROBLEMS WITH FRONT HEAD LIGHT BURNING OUT. THIS APPEARS TO BE A MAJOR DEFECT WITH THIS MODEL, EVERY OWNER I HAVE SPOKE WITH HAS SAME PROBLEM.",
        "vin": "JM3ER4WL2A0"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006800,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALLS   I WAS JUST INFORMED THAT THE RECALL FIX I HAD INSTALLED WAS A TEMPORARY FIX THAT NHTSA AGREED TO ALLOW MAZDA TO PERFORM ON THE VEHICLES, UNTIL THE PERMANENT FIX IS AVAILABLE SOMETIME THE SUMMER OF 2017.  WHY WOULD YOU ALLOW A TEMPORARY FIX FOR A SAFETY ITEM SUCH AS AN AIRBAG ?  WHEN THE PREVIOUS AIR BAG CONTAINED A CANISTER THAT WOULD EXPLODE WITH   SHRAPNEL ??  THIS IS NOT MORALLY OR ETHICALLY A GOOD DECISION TO ENDANGER ANYONE'S LIFE!",
        "vin": "JM3ER2W50A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006639,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION). THE PARTS TO DO THE RECALL REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE LOCAL DEALER (SPREEN MAZDA, 25140 REDLANDS BLVD, LOMA LINDA, CA 92354) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM9A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005194,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOST POWER TO MY 2010 MAZDA CX7 WHILE GOING 60 MP DOWNHILL IN A MOUNTAIN PASS.  MY CAR WENT FROM 60 MP TO 40 MP IN ABOUT 30 SECONDS. I IMMEDIATELY PULLED OVER AS BLACK SMOKE POURED OUT OF MY TAIL PIPE AND HAD THE CAR TOWED.  MY MECHANIC SAID THE TURBO WAS BLOWN, WHICH CAUSE THE CAR'S OIL TO COMPLETELY BURN UP, CAUSING DAMAGE TO THE TIMING CHAIN AND ENGINE.  ALL OF THE OIL WAS GONE IN A MATTER OF A FEW MILES.  THE CAR HAD BEEN UP TO DATE ON ALL MAINTENANCE.  A NEW TURBO AND ENGINE WAS NEEDED ON A CAR THAT HAD 74,000 MILES ON IT.",
        "vin": "JM3ER4WL6A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001790,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE DEALER (JOE MYERS MAZDA IN HOUSTON, TX) AND SCHEDULED AN APPOINTMENT. ONCE THE CONTACT ARRIVED AT THE DEALER, SHE WAS INFORMED THAT THE REMEDY PART FOR THE AIR BAG REPLACEMENT WAS NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994967,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A RECALL NOTICE OCTOBER 2016 CONCERNING A RECALL FOR THE FRONT LOWER CONTROL   ARMS - SAFETY RECALL 9716H.  THE NOTICE STATED THAT REPAIR PARTS WERE NOT AVAILABLE.    IT'S NOW JUNE 2017 AND THE REPAIR PARTS ARE STILL NOT AVAILABLE.  JUST SPENT 30 MINUTES ON HOLD TRYING TO SPEAK WITH SOMEONE AT MAZDA -- FINALLY GAVE UP AND HUNG UP.   I'M FILING THIS COMPLAINT BECAUSE IN NO WAY WOULD THIS BE CONSIDERED A TIMELY RESOLUTION   OF THIS PROBLEM.  I WANT MY CAR REPAIRED!",
        "vin": "JM3ER2WMXA0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992815,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991612,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA PURCHASED USED AT 70K MILES APRIL OF 2015. I HAVE HAD TO REPLACE THE OIL COOLER, THE ENTIRE VVT SYSTEM AND NOW A TURBOCHARGER HAS BLOWN.  5K IN REPAIRS AND THE CAR IS BARELY WORTH THAT.",
        "vin": "JM3ER4WL5A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991441,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LOWER CONTROL ARMS. RECALLED IN SEPTEMBER 2016. STILL NO PARTS FIX, MAY 2017. WHY ARE THE PARTS STILL NOT AVAILABLE?",
        "vin": "JM3ER2WL7A0"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985915,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE LOW BEAMS SHORTED MORE THAN FIVE TIMES AND AN INDEPENDENT MECHANIC HAD TO REPLACE THE HEAD LAMP ASSEMBLIES MULTIPLE TIMES. THE CONTACT HAD TO UTILIZE THE HIGH BEAMS EACH TIME THE FAILURE OCCURRED. IN ADDITION, THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBERS: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION). THE CONTACT WAS TO CHECK WITH THE MANUFACTURER TO DETERMINE WHEN THE DEALER MAY BE ABLE TO SCHEDULE THE RECALL REPAIRS AND TO REPORT THE ELECTRICAL FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000. PARTS DISTRIBUTION DISCONNECT. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  ..UPDATED 08/22/17 *BF  *AS",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984211,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR FLASHED AND REMAINED ILLUMINATED. THE CONTACT LATER RECEIVED NOTIFICATION OF A MANUFACTURER RECALL CONCERNING THE AIR BAGS. THE DEALER SCHEDULED THE APPOINTMENT AND INDICATED THAT THEY SERVICED THE RECALL; HOWEVER, DAYS AFTER THE REPAIR, THE AIR BAG INDICATOR CONTINUED TO FLASH RANDOMLY. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOTIFIED THAT THE REMEDY PROVIDED NO SOLUTION AND REFUSED TO SERVICE THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO SOLUTION.THE NHTSA CAMPAIGN NUMBER WAS NOT PROVIDED. THE FAILURE MILEAGE WAS NOT AVAILABLE.  UPDATED 08/24/17*LJ    *CN",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/25/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980386,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN 1 YEAR SINCE THE RECALL WAS MADE. BUT THE PARTS WERE NEVER AVAILABLE. I WENT THROUGH WINTER IN CHICAGO FEELING UNSAFE. I DON'T THINK THEY ARE REPLACING MY LOWER CONTROL ARM. THEY ARE POSTPONING IT TO HOPE THAT I WILL FORGET ABOUT IT.",
        "vin": "JM3ER4WL2A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "04/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979799,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURES. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS REMEDY NOT YET AVAILABLE.",
        "vin": "JM3ER2WM5A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979640,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) IN AUGUST OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W57A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978833,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE  PARTS DISTRIBUTION DISCONNECT AND VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 06/01/17*LJ    *CN",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978855,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE FOR NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) AND PARTS DISTRIBUTION DISCONNECT FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS).",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970465,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W57A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "03/14/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965880,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM9A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2017",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960162,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS HAVE HAD TO BE REPLACED MULTIPLE TIMES ON OUR VEHICLE, ONE NIGHT BOTH WENT OUT AND HAD TO DRIVE HOME WITH OUR HIGH BEAMS ON, WE'VE PROBABLY REPLACED ABOUT AT LEAST TWO DOZEN BULBS, THERE HAS TO BE SOME FIX TO THIS ISSUE, THEY ARE  EXPENSIVE AND NOT EASY TO REPLACE, THEY SAY DRILLING A HOLE IN THE HOUSING WILL TAKE CARE OF THE PROBLEM BY GIVING AIR AND REDUCING THE MOISTURE IN THE HOUSING, THAT HAS BEEN DONE AND STILL LIGHTS ARE GOING OUT, NEED HELP HERE ON THIS ISSUE.",
        "vin": "JM3ER2W53A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957276,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION);  HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER4WL7A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/16/2017",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955152,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING AT A LOW SPEED, A LOUD DRUM NOISE WAS HEARD UNDERNEATH THE VEHICLE. IN ADDITION, WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE PULLED TO THE RIGHT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION). THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2WM8A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2017",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954896,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V356000 AND 16V593000 (AIR BAGS, SUSPENSION). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W33A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953895,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) WAS RECEIVED IN MAY OF 2016 AND NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) WAS RECEIVED IN AUGUST OF 2017. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *TR",
        "vin": "JM3ER2W58A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/25/2017",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947652,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W57A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946696,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED THAT THE DRIVER SIDE WHEELS PUSHED TOWARDS THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V593000 (SUSPENSION) AND 16V356000 (AIR BAGS). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 114,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  *TR",
        "vin": "JM3ER2W58A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946373,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V593000 (SUSPENSION) AND 16V356000 (AIR BAGS). THE DEALER INDICATED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W50A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945910,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V593000 (SUSPENSION)  HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE.  VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940425,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUSPENSION LOWER ARM BALL JOINT FITTING SALTWATER INTRUDING INTO BALL JOINT CAUSING CORRISION RESULT IN GENERATING LOOSENESS OF BALL JOINT RESULTING IN BALL JOINT AND LOWER CONTROL ARM TO SEPARATE CAUSING LOSS OF STEERING CONTROL AND INCRESE RISK OF A CRASH. RECALL ISSUED IN AUGUST AND YET NO FIX AVAILABLE YET. WHY SO LONG TO REPAIR?",
        "vin": "JM3ER4W32A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939862,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS ON THIS VEHICLE ARE EXTREMELY POOR AND THEY ARE SO DULL THAT IT IS DIFFICULT TO DRIVE AT NIGHT. WHEN I COMPARE THE LOW BEAM HALOGEN PROJECTORS ON OTHER MAKES OF VEHICLES THAT I HAVE DRIVEN, THEY CONSISTENTLY PERFORM FAR BETTER THAN THOSE ON THE MAZDA. I FELT THAT THE LIGHTS WERE SUBPAR FROM THE TIME I BOUGHT THE VEHICLE FROM NEW, BUT THEY HAVE GOTTEN WORSE OVER TIME. SPECIFICALLY THE ILLUMINATION OF THE ROAD SURFACE, THE FOCUS AND THE DISTANCE OF THE LIGHT ALL APPEAR TO BE VERY POOR. IT IS JUST DIFFICULT TO SEE AT NIGHT. I SUSPECT THAT THE PROBLEM IS IN THE DESIGN AND CONSTRUCTION OF THE LIGHTS BECAUSE AS I MENTIONED, I NOTICED THIS PROBLEM WHEN THE CAR WAS NEW. SO THIS IS NOT A PROBLEM OF OLD LIGHTS ON AN OLD CAR. I EVEN MENTIONED IT TO THE DEALERSHIP DURING A SERVICE AND THEY CHECKED THE AIM OF THE LIGHTS AND SAID THAT THEY WERE WORKING PERFECTLY. HAVING SEEN OTHER COMPLAINTS FROM OTHER OWNERS AND DRIVERS OF THIS VEHICLE, I AM NOW CONVINCED THAT THIS IS A PROBLEM THAT MAZDA SHOULD TAKE RESPONSIBILITY FOR. HEADLIGHTS ARE THERE TO ENABLE DRIVERS TO SEE AND BE SEEN UNDER MOST ROAD CONDITIONS. THE 2010 MAZDA CX-7 HEADLIGHTS SIMPLY FAIL TO ACHIEVE THIS. THIS IS CLEARLY A CASE OF FORM OVER FUNCTION, BUT IN THIS CASE IT HAD LED TO A SERIOUS SAFETY CONCERN.  *TR",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939619,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W38A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937949,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W57A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936613,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "YET ANOTHER DIM HEADLIGHT HAS BURNED OUT.  I'VE OWNED THIS VEHICLE 16 MONTHS, AND THIS WILL BE THE 10TH TIME CHANGING THE DIM HEADLIGHT BULB.  7 TIMES ON THE DRIVERS SIDE, AND THIS WILL MAKE 3RD TIME ON PASSENGER SIDE. AS WELL AS HAVING TO CHANGE A TAIL LIGHT ON PASSENGER SIDE.  ALL THE MAZDA DEALERS ARE AWARE OF THIS PROBLEM, AND I AS WELL AS THEY ARE WONDERING WHY THERE IS NO RECALL ON THIS PROBLEM?!! THIS IS AN EXPENSIVE, TROUBLESOME AND VERY AGGRAVATING ISSUE, AND VERY INCONVENIENT AND UNSAFE!!  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "07/08/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934801,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2WM1A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2016",
        "dateOfIncident": "12/07/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934557,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS (LOW BEAM) ON MY CAR SIMPLY STOPPED WORKING ALL OF A SUDDEN. CHECKED THE FUSES AND ALL ARE FINE. HIGH BEAMS AND SIGNAL LIGHTS WORK FINE, IT'S JUST THE HEADLIGHTS. HAVE SEEN THIS SAME DESCRIPTION IN OTHER WEBSITES AS POSSIBLY THE CONTROL MODULE HAD A SHORT CIRCUIT AND THIS IS A VERY COMMON THING TO HAPPEN TO THESE CARS. MAZDA IS NOT ACCEPTING THIS AS AN \"IN WARRANTY\" REPAIR EVEN THOUGH THIS IS A MAJOR COMMON COMPLAINT. MY CAR IS OUT OF WARRANTY ALREADY, SO I'LL NEED TO PAY THIS REPAIR OUT OF POCKET.",
        "vin": "JM3ER2W34A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "11/30/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929991,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING APPROXIMATELY 15 MPH, THE WHEEL SEPARATED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE CONTROL ARMS, BALL JOINT, ROTORS, AND AXLE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "JM3ER2WMXA0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927205,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W56A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "11/05/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926994,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS HAVE BEEN GOING OUT FOR THE LAST SEVERAL YEARS AND I FINALLY REALIZED I SHOULD COMPLAIN ABOUT. I'VE CHANGE THE LOW BEAM BULBS MULTIPLE TIMES (I DO NOT TOUCH THE BULB WITH MY HAND) AND EVERY FEW MONTHS THE BULB GOES BAD. THIS HAPPENS SO FREQUENTLY THAT I KEEP A SPARE BULB IN MY GLOVE COMPARTMENT. I'VE READ MANY MESSAGE BOARDS STATING THEIR MAZDA HAS SIMILAR ISSUES. THERE HAS TO BE SOME OTHER SOLUTION RATHER THAN SPENDING A LOT OF MONEY ON BULBS OR GOING TO THE DEALERSHIP FOR THEM TO CHANGE.",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924237,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2WM7A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "11/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924006,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NOTIFICATION WAS SENT IN JULY.  THE NOTIFICATION STATED THAT I WAS NOT TO HAVE PASSENGERS IN THE SEAT WITH THE AFFECTED AIR BAG.  BASICALLY MY FAMILY CANNOT USE THIS CAR.  IT IS NOVEMBER AND THE REPAIRS HAVE NOT BEEN MADE.",
        "vin": "JM3ER2W32A0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920334,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING, THE DRIVER'S SEAT MOVED AND SHOOK. THE DEALER DIAGNOSED THAT THE VEHICLE NEEDED A NEW SEAT. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 98,000.",
        "vin": "JM1BL1SF2A1"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919988,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A SAFETY  RECALL LETTER  0N JULY 2016  .IT SAYS THAT CONTINUED EXPOSURE TO HIGH LEVELS OF ABSOLUTE HUMIDITY MAY CAUSE THE PASSENGER  FRONTAL AIR BAG INFLATOR HOUSING TO RUPTURE AND DEPLOY ABNORMALLY IN THE EVENT OF A CRASH NECESSITATING DEPLOYMENT OF THE FRONTAL AIR BAG .METAL FRAGMENTS MAY STRIKE THE OCCUPANTS THE VEHICLE..WE CALL SEVERAL DEALERS TO FIX THE BPROBLEM , BUT THEY SAID THAT THE PARTS  WERE NOT READY AND THEY WERE  GOING TO CALL US BACK..SOMEBODY TOLD US THAT  THEAY WERE GOING TO GIVE US A RENTAL CAR WHILE THIS PROBLEM  WAS FIXED. THEN  ON OCTOBER  /2016 WE RECEIVED ANOTHER  SAFETY RECALL LETTER  SAYING THAT IT IS POSSIBLE THAT WATER  MAY ENTER THE FRONT SUSPENSION  LOWER  ARM BALL JOINT FITTING DURING DRIVING. WE HAVE CALLED THE DEALERS  AND THEY SAID THAT THE DON'T HAVE THE  PARTS READY.THIS IS OUR MAIN FAMILY VEHICLE AND WE DON'T HAVE  ANY OTHER MEANS OF TRANSPORTATION.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917897,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) BUT THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917643,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) AND 16V593000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W50A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916719,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W30A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917212,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916326,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" RECEIVED SAFETY RECALL NO. 16V356 JULY 2016 ADVISING ME OF THE RECALL. MAZDA STATED THAT THE PARTS WERE NOT AVAILABLE AND THAT I WOULD RECEIVE ANOTHER NOTIFICATION WHEN PARTS WERE AVAILABLE. AS OF THIS DATE I HAVE NOT RECEIVED THAT NOTICE.  I DID RECEIVE SAFETY RECALL NOTICE NO. 9716H \"FRONT LOWER CONTROL ARMS\"ON OCT. 15 STATING THAT THIS DEFECT COULD CAUSE LOSS OF STEERING. AGAIN MAZDA STATED THAT THE PARTS TO FIX THIS PROBLEM WERE NOT YET AVAILABLE AND THAT ONCE THEY WERE I WOULD GET ANOTHER NOTICE. I AM VERY DISAPPOINTED WITH MAZDA AND THEIR HANDLING OF THESE RECALLS.  AT THIS POINT I AM AFRAID TO DRIVE THIS CAR!!  THIS IS JUST NOT RIGHT!!  PLEASE CHECK INTO THIS AND ADVISE ME ACCORDINGLY...MY BET IS I WILL NOT HEAR FROM ANYONE...SORRY BUT THAT`S THE WAY I FEEL!!   I DO HOPE THAT I AM WRONG!!",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916089,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TCS AND CHECK ENGINE LIGHT IS ON. THE CAR DOES NOT HAVE POWER EVEN IF THE GAS PEDAL IS PRESSED ALL THE WAY, THE CAR MOVES ONLY UP TO 5 MILES PER HOUR (RPM POWER). VEHICLE LOSES THROTTLE. AC BLOWS WARM WHEN TCS LIGHT IS ON. THERE IS A WHITE SMOKE FROM THE EXHAUST.   THIS USUALLY HAPPENS AFTER THE CAR IS PARKED FOR COUPLE HOURS.  THE SAME ISSUE OCCURS SEVERAL TIMES WITHIN A PERIOD OF YEAR AND A HALF. MY CAR WAS @ SERVICE SHOP MORE THAN 2 MONTHS. I CONTACTED MAZDA CORPORATE OFFICE IN SEVERAL OCCASIONS AND THEY ARE AWARE OF THE ISSUES I HAVE WITH THE CAR, BUT THEY DID NOT RESPOND POSITIVELY.",
        "vin": "JM3ER2W33A0"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915020,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TCS AND CHECK ENGINE LIGHT IS ON. THE CAR DOES NOT HAVE POWER EVEN IF THE GAS PEDAL IS PRESSED ALL THE WAY, THE CAR MOVES ONLY UP TO 5 MILES PER HOUR (RPM POWER). VEHICLE LOSES THROTTLE.    AC BLOWS WARM WHEN TCS LIGHT IS ON. THERE IS A WHITE SMOKE FROM THE EXHAUST.",
        "vin": "JM3ER2W33A0"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914394,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NOTIFIED IN JULY OF TWO RECALLS ON MY MAZDA(9516E AIRBAG AND 9716H LOWER CONTROL ARM)THE CAR IS UNSAFE TO DRIVEWILL MAZDA GIVE SPECIAL REBATE TO PUSCHASE A NEW CAR            I WAS NOTIFIED IN JULY OF TWO RECALLS (9516E AIRBAG AND9716 LOWER CONTROL ARM) IT IHAS BEEN TWO MONTHS WITH NO PARTS AVAIBLE.THE CAR IS PARKED AND UNSAFE TO DRIVE,CAN I GET A REBATE AND PURCHASE A NEW CAR ON THIS CAR.",
        "vin": "JM3ER2WMXA0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914040,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/29/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910593,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN: 16V356000 (AIR BAGS). HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W32A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910173,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W58A0"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906119,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SAFETY RECALLS (NHTSA#16V-356 & NHTSA#16V-593) STATING REPAIRS SHOULD BE MADE IMMEDIATELY.  OWNERS TO CONTACT DEALER FOR REPAIRS.  BEGINNING IN JULY 2016, CLOSEST MAZDA DEALER HAS BEEN CONTACTED REPEATEDLY TO MAKE THESE REPAIRS, AND I HAVE BEEN TOLD THEY CANNOT ORDER PARTS.  CONSIDER THIS A FORMAL COMPLAINT.  OWNER IS ATTEMPTING TO GET SAFETY REPAIRS MADE, AND IS UNABLE TO DO SO.",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904293,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA IS REFUSING TO FIX THE RECALL ON MY VEHICLE SAYING THAT IT'S NOT A SAFETY RECALL. THE LAST TIME I CHECKED THE LOWER CONTROL ARMS SEPARATING FROM THE BALL JOINTS WAS A SAFETY ISSUE. I HAVE CALLED THE DEALER AND THEY CAN'T GET THE PART OR DON'T WANT TO THEY TOLD ME THE FIRST TIME IT WAS THE BRAKES POPPING AND NOW THEY SAY NOTHING IS WRONG WITH IT AT ALL. MAZDA CORPORATE DOESN'T SEEM LIKE THEY CARE EITHER. THEY TOLD ME IT WAS SAFE TO DRIVE NOT TO WORRY ABOUT IT. MY VEHICLE IS MAKING POPPING NOISES IN THE FRONT END AND THEY DON'T WANT TO FIX IT. THEY WANT TO PAWN IT OFF ON ANOTHER PART OF THE VEHICLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904304,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING VARIOUS SPEEDS, THERE WAS AN ABNORMAL NOISE UNDERNEATH THE FRONT END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE NOISE WAS COMING FROM THE BRAKES. THE TECHNICIAN STATED THAT THERE WAS NO FAILURE WITH THE VEHICLE. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE REPAIR FOR NHTSA CAMPAIGN NUMBER: 16V593000 (SUSPENSION) WOULD NOT BE PERFORMED UNLESS THERE WAS AN EXISTING FAILURE WITH THE RECALLED COMPONENT. THE FAILURE MILEAGE WAS 66,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898512,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V340000 (AIR BAGS) AND 16V06100 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896484,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INCOMPLETE RECALL FOR LOWER CONTROL ARMS. MY VEHICLE IS MAKING POPPING NOISES WHEN GOING IN DRIVE AND IN REVERSE. EVERY ONCE IN A WHILE WILL MAKE CREAKING NOISES WHILE DRIVING DOWN THE ROAD. ALL NOISES ASSOCIATED WITH THE BALL JOINTS AND CONTROL ARMS. THE DEALERSHIP TOOK OVER A HOUR TO COME BACK AND SAY THEY DON'T HAVE THE PARTS TO FIX IT BUT THINK THE BRAKES ARE WHERE THE NOISE IS COMING FROM. THIS IS MY ONLY VEHICLE AND MY WIFE AND 2 SMALL CHILDREN RIDE IN IT. I CALLED MAZDA CORPORATE AND MADE MY COMPLAINT AND STRESSED THAT I DON'T FEEL SAFE DRIVING THIS VEHICLE UNTIL IT IS FIXED. THEY JUST TOLD ME THERE WASN'T ANYTHING THAT COULD BE DONE ABOUT IT. PUTTING THE SAFTY OF MY FAMILY AT RISK FOR INJURY. I AM AT A DEAD END WITH THE MANUFACTURER ON THIS ISSUE. I DON'T HAVE THE MEANS TO BUY A NEW CAR OR RENT ONE UNTIL IT IS REPAIRED.",
        "vin": "JM3ER2W54A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893518,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3ER2W59A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875242,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT COMPLETED A VIN SEARCH AND FOUND THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS), WHICH WAS RELATED TO THE TAKATA AIR BAG RECALL. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "JM3ER2W36A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863303,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS ARE VERY DIM. CAN NOT DRIVE THE CAR AT NIGHT. I HAVE REPLACED THE LIGHTS 2 TIMES WITH NO IMPROVEMENT.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "04/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861031,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/21/2016 AROUND 1:15PM, I WAS HEADING EAST ON I-694 AT ABOUT 65 MPH. SUDDENLY, THE TIRE LOW PRESSURE INDICATOR LIGHT UP ON THE DASHBOARD WITH THREE WARNING CHIMES. I TRAVELLED FOR ANOTHER 5-6 MILES AND THE TIRE NOISE BECAME MUCH MORE NOTICEABLE IN THE BACK. I WAS IN THE LEFT LANE OF THE 3 LANE INTERSTATE AND TWO MORE LANES ON THE RIGHT TO EXIT MN HIGHWAY 252. WITH NO EASY ACCESS TO THE RIGHT SHOULDER AND HEAVY TRAFFIC, I PULLED OFF ONTO THE LEFT SHOULDER, PUT ON THE EMERGENCY HAZARD FLASHERS. UPON EXITING THE CAR, I NOTICED MY LEFT REAR TIRE HAS BLOWN OUT, WITH A ONE FOOT GASH ON ITS SIDEWALL, TOTALLY FLAT, SMOKE CAME OFF FROM THE INSIDE, AND THE TPMS WAS MISSING FROM THE WHEEL OPENING. WAITED FOR 45 MINUTES FOR AAA TO ARRIVE AND PUT ON THE EMERGENCY  SPARE TIRE. SUBSEQUENTLY, LIMBED MY WAY FOR 2 MORE MILES TO EXIT AT HWY 65 AND TOOK LOCAL STREETS HOME. THE LOCAL REPAIR SHOP DIAGNOSED THE TIRE BLOWOUT AS A TPMS HEX NUT FAILURE DUE TO CORROSION. ALSO FOUND OUT THAT THE FRONT LEFT TPMS HEX NUT HAS SPLIT IN HALVES DUE TO CORROSION AS WELL. IT COULD HAVE BEEN A REAL TRAGIC ACCIDENT WITH INJURIES OR EVEN FATALITIES. SUDDEN FAILURES OF TPMS UNITS, ESPECIALLY AT HIGH SPEED DRIVING, ARE SIGNIFICANT SAFETY RISKS THAT SHOULD BE REMEDIED THROUGH RECALLS AND AWARENESS TRAINING TO THE PUBLIC.",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2016",
        "dateOfIncident": "04/17/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859985,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND ALL OF A SUDDEN LOST POWER AND A HOWLING NOISE NO CHECK ENGINE LIGHT CAME ON. PULLED OVER TO SEE WHAT IT WAS AND NOTHING VISIBLE NO LEAKS NOTHING. HAD MY WIFE HIT THE HAS AND NO NOISE. STARED DRIVING AND NOISE CAME BACK AND WHITE SMOKE. JUST HAD AN OIL CHANGE DONE AND NEXT OIL CHANGE DUE IN ABOUT 1000 MILES.  DROVE ABOUT 20 MPH TO GET HOME CHECK OIL AND IT WAS OK. THE WHITE SMOKE MAKES ME THINK THE TURBO WENT ON MY CAR. I JUST PURCHASED THIS CAR IN OCTOBER OF 2015. IT'S BEEN BACK TO THE SHOP FOR ELECTRIC PROBLEMS WITH THE KEY AND RADIO THAT STILL NOT RESOLVED. RADIO SHUTS OFF AND BEEPS THAT KEY IS NOT IN CAR.",
        "vin": "JM3RER4WL0A"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853953,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2016, TWO OF THE NUTS SECURING THE TIRE PRESSURE SENSORS CRACKED. ONE SENSOR LOOSENED CAUSING THE TIRE TO LOSE AIR AND GO COMPLETELY FLAT. UPON INSPECTION OF THE REMAINING THREE SENSORS, MECHANICS FOUND ANOTHER CRACKED NUT ON A PRESSURE SENSOR. IT WAS NOT POSSIBLE TO REPLACE THE NUT. CORROSION ON THE TIRE PRESSURE SENSORS CORRODED TO MUCH TO ALLOW NUTS TO BE REPLACED. IN THE END, TWO TIRE PRESSURE SENSORS NEEDED TO BE REPLACED FOR CORROSION ON THE EXPOSED THREADS AND CORRODED/CRACKED NUTS.",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853863,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  MY COMPLAINT IS WHY THERE HAS NOT BEEN A RECALL ON THE TURBO CHARGER FOR MY VEHICLE.  I WAS DRIVING MY CAR AND THE ENTIRE CABIN FILLED WITH SMOKE THAT I HAD TO PULL OFF THE ROAD.  I HAD TO ROLL DOWN ALL THE WINDOWS BECAUSE THE IT WAS SO BAD AND THOUGHT THE ENGINE WAS ON FIRE.  THIS IS NOT SAFE TO HAVE THIS HAPPEN.  I'VE GOOGLED THIS AND THERE ARE MANY COMPLAINTS ON REPLACEMENT HAPPENING TWICE.  THIS SHOULD BE COVERED BECAUSE I'VE KEPT MY MAINTENANCE UP AND JUST DID OIL AND FLUIDS CHANGED AND HAVE TO HAVE IT DONE AGAIN BECAUSE THE OIL LEAKED INTO THE TURBO CHARGER.  THIS IS COSTING ME $2,460.00 FOR REPAIR AND DON'T THINK I SHOULD HAVE TO PAY FOR THIS FATAL PROBLEM.  I EXPECTING COVERAGE ON THIS AND WILL BE CONTACTING MY LAWYER.",
        "vin": "JM3ER4W3XA0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/30/2016",
        "dateOfIncident": "09/28/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823222,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DIM HEADLAMP BULBS BURN OUT REPEATEDLY . HAVE OWNED VEHICLE 5 MONTHS AND HAVE CHANGED 4 TIMES",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759818,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SHATTERED WHILE DRIVING ON THE HIGHWAY AT 60MPH AT 9:30AM WHEN I HEARD A LOUD CRASH ON THE ROOF OF MY CAR.  I LOOKED IN MY REAR VIEW MIRROR AND SAW MANY PIECES OF GLASS FLYING BEHIND ME. THANKFULLY, I HAD THE SHADE DRAWN CLOSED, OTHERWISE, I WOULD HAVE BEEN COVERED IN A SHOWER OF GLASS.  I MANAGED TO PULL OVER AND DID NOT FIND ANY FOREIGN OBJECTS OR ROCKS (AND SAW NO ROCKS BOUNCING IN THE STREET PRIOR TO THIS INCIDENT). THE INSURANCE COMPANY ASKED ME WHAT HAPPENED, BUT I HAD NO EXPLANATION.  IT SEEMS LIKE THE SUNROOF JUST EXPLODED.",
        "vin": "JM3ER2W56A0"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747160,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SHATTERED - I JUST GOT ONTO I-43 VIA THE ON RAMP AND MY SUNROOF EXPLODED AND CAME DOWN ON ME LIKE A SHOWER OF GLASS.  I WAS ABLE TO PULL OVER.  I IMMEDIATELY LOOKED FOR ANY FOREIGN DEBRIS BUT THERE WAS NONE.   I DROVE HOME AND CALLED THE CAR DEALER (HOLIDAY IN FOND DU LAC WI).  THEY SAID THEY NEVER HEARD OF A SUNROOF BREAKING BECAUSE OF THE HEAT OR ANYTHING LIKE THIS AND MY EXTENDED WARRANTY WOULD NOT COVER.  I HAD IT FIXED AND HEARD ABOUT THIS ON THE NEWS TWO WEEKS LATER.  MY CAR IS A 2010 MAZDA CX7 IN EXCELLENT CONDITION.  THE COST TO REPLACE WAS $597.08 PLUS TAX.",
        "vin": "JM3ER2W50A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703708,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BULBS MELTED BOTH BACK TAIL LIGHT LAMPS. A MANUFACTURING DEFECT FROM DEFECTIVE PARTS. WHICH SHOULD BE REPLACE AND REPAIR FREE OF CHARGE.  *TR",
        "vin": "JM3ER2W51A0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2015",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671170,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS ROUNDING A CURVE ON AN ACCESS RAMP TO MELD INTO ONGOING TRAFFIC , THE CAR ENGINE DIED AND I WAS FORCED TO PULL TO THE SIDE AND COAST TO A STOP . I WAS FORTUNATE THAT I HAD NOT GOTTEN ON THE PW PARKWAY  WHEN THE CAR DIED AS THE PARKWAY TRAFFIC WAS MOVING FAST. THE MAZDA REPAIR GARAGE TRACED THE PROBLEM TO A FUEL PUMP FAILURE.   *TR",
        "vin": "3M3ER2W56A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643841,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER I HAVE COME TO A STOP THE CHECK ENGINE LIGHT AND TCS/DSC INDICATOR LIGHT ILLUMINATE.  MY CAR REMAINS ON BUT WHEN I PUSH ON THE GAS THROTTLE MY CAR DOES NOT GO ANYWHERE.  I HAVE TO TURN OFF MY CAR FOR A MINUTE OR SO AND THEN RESTART BEFORE I CAN DRIVE.  THIS HAD HAPPEN 4 TIMES NOW (IN A 2 MONTH TIME FRAME).  IT USUALLY HAPPENS WHEN I AM AT A STOP LIGHT AND DO NOT HAVE A WAY TO GET OFF OF THE ROAD.  THE CHECK ENGINE LIGHT STAYS ON FOR A DAY OR SO AND THEN GOES AWAY.  THEN IT WILL HAPPEN AGAIN.  I HAVE BEEN DRIVING ON THE ROAD WHEN THIS HAS HAPPENED AND HAD TO PULL OFF QUICKLY ON THE SIDE OF THE ROAD.  THIS IS VERY DANGEROUS!  I HAVE AN APPOINTMENT WITH A MAZDA DEALERSHIP TO HAVE IT LOOKED AT.  *TR",
        "vin": "JM3ER2W36A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "09/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631440,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/31/14 I NOTICED A RATTLING NOISE WHEN I ACCELERATED AS WELL AS A WHINING NOISE. THE NOISE WAS INTERMITTENT AND DID NOT OCCUR ALL THE TIME, BUT WAS A DISTINCT NOISE COMING FROM UNDERNEATH THE VEHICLE. I HAD NOT HAD ANY CHECK ENGINE LIGHTS ILLUMINATED OR ANY OTHER WARNING LIGHTS. I BROUGHT MY VEHICLE INTO MY LOCAL MAZDA DEALERSHIP AND THEY ADVISED IT WAS THE TURBO AND IN ORDER ACCESS APPROPRIATELY THEY WOULD NEED TO TEAR DOWN THE ENGINE. AFTER READING ONLINE THERE ARE NUMEROUS DOCUMENTED ISSUES WITH TURBOS, VVT TIMING CHAINS AND ENGINE ISSUES WITH MAZDA CX7. THE SHOP CALLED ME BACK 2 DAYS AFTER I DROPPED IT OFF AND SAID I WOULD NEED TO REPLACE THE TURBO & I NEED A NEW ENGINE. THEY ALSO STATED SINCE THERE WAS OIL SLUDGE PRESENT THAT I WOULD BE RESPONSIBLE FOR $9000 COSTS. I PROVIDED THE DEALERSHIP MY OIL CHANGE RECEIPTS INCLUDING THE LAST OIL CHANGE THAT WAS DONE IN JUNE. MY CAR WAS STILL WITHIN 3000 MILES AND WAS NOT DUE A OIL CHANGE, HOWEVER THE OWNERS MANUAL STIPULATES RECOMMENDED CHANGES EVERY 7000 MILES!! THE DEALERSHIP ADVISED THAT WHEN I BROUGHT IT IN NO OIL WAS IN THE DIPSTICK AND BECAUSE THERE WAS SLUDGE MAZDA IS DENYING MY POWERTRAIN WARRANTY (WHICH IS STILL ACTIVE) DUE TO NOT MAINTAINING THE VEHICLE. THIS IS ABSURD, I HAVE MAINTAINED MY VEHICLE AND MAZDA IS USING THIS AS AN EXCUSE TO NOT BE RESPONSIBLE FOR A OBVIOUS DEFECT IN THEIR VEHICLE!!! THERE ARE MANY DOCUMENTED INSTANCES ABOUT THIS SAME SCENARIO HAPPENING WITH OTHERS ALL OVER THE INTERNET, THIS ISSUE IS A RESULT OF A DEFECTIVE TURBO AND NOT DUE TO LACK OF MAINTENANCE. MAZDA EXTENDED TURBOS AND VVT TIMING CHAIN ISSUES TO 7 YEARS BECAUSE OF THIS SAME SCENARIO FOR 2007-2010 MAZDA CX7S BUT WHEN I ASKED ABOUT SSP 86 IM BEING TOLD MY VEHICLE DOES NOT QUALIFY.  I WOULD LIKE TO KNOW WHY MAZDA CAN GET AWAY WITH NOT ABIDING TO THEIR WARRANTY AND REQUEST THIS BE INVESTIGATED. THANK YOU  *TR",
        "vin": "JM3ER2W30A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "12/12/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616492,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA CX7.  CONSUMER WRITES IN REGARDS TO VEHICLE HEADLIGHTS PROBLEM.  *SMD  THE CONSUMER STATED EVER SINCE THE VEHICLE WAS PURCHASED, HE AND HIS WIFE HAVE REPLACED THE HEADLIGHTS EIGHT TIMES. ON DECEMBER 12, 2011 THE DRIVER SIDE HEAD LIGHT WENT OUT. THEN ON MARCH 8, 2012 THE PASSENGER SIDE HEADLIGHT WENT OUT. THE DEALER INFORMED THE CONSUMER IT WAS VERY COMMON AND HEADLIGHTS COULD GO OUT AT ANY TIME. ANOTHER HEADLIGHT WENT OUT AGAIN ON OCTOBER 30, 2012. THE SAME BULB WENT OUT ON NOVEMBER 10, 2012. THE CONSUMER WENT BACK TO THE DEALER, WHERE IT WAS DISCOVERED THE BULB WAS INSTALLED INCORRECTLY.  ON JANUARY 7, 2013 THE OPPOSITE HEADLIGHT WENT OUT.  ON JUNE 10, 2013, THE HEADLIGHT WENT OUT AGAIN. ON OCTOBER 1, 2013 THE SAME THING HAPPENED. ON JUNE 12, 214, THE HEADLIGHT WENT OUT AGAIN. THE DEALER CONTINUED TO SAY, THERE WAS NO DEFECT. *JB",
        "vin": "JM3ER2W50A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614860,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS COLD OUTSIDE AND I AM BACKING OUT OR DRIVING FORWARD AND I BRAKE IT MAKES A GRINDING NOISE. I HAVE HAD MY BRAKES CHANGED AND THAT WAS NOT THE PROBLEM. IT ONLY DOES IT WHEN IT IS COLD OUT SIDE AFTER IT GETS WARMED UP IT STOPS.  *TR",
        "vin": "JM3ER2WM1A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "07/12/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610864,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE TURNPIKE MY CAR STARTED TO MAKE A WHINING NOISE THEN SMOKE CAME FROM TAIL PIPES. AFTER HAVING IT LOOKED AT THE TURBO CHARGER HAS GONE BAD!  *TR",
        "vin": "JM3ER2W39A0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594954,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK IN DECEMBER 2013; I TOOK MY MAZDA TO ITS SHEEHY DEALER TO GET MY USUAL OIL CHANGES, ETC.  IT WAS REFERRED BY THE DEALER THAT I HAVE MY STEERING FLUID DRAINED AND REPLACED.  I PAID FOR THIS WORK TO BE DONE; HOWEVER, PROBLEMS BEGAN TO OCCUR WITH  MY POWER STEERING SOMETIME AROUND APRIL 2014 IN WHICH MY STEERING WHEEL WOULD GET SO TIGHT WHILE DRIVING THAT I COULD BARELY TURN.  I TOOK THE CAR BACK TO THE DEALER IN WHICH THEY NOW STATE THAT I HAVE A BAD POWER STEERING PUMP WHICH DISALLOWS THE VEHICLE TO PERFORM ITS NORMAL STEERING.  THIS IS A SAFETY HAZARD IN WHICH MAZDA ONLY RECOGNIZES THIS ISSUE WITH ITS MAZDA 3 VEHICLES, ETC.  HOWEVER, THE ISSUE OF FAILED POWER STEERING PUMPS ON ITS MAZDA VEHICLES SUCH AS THE MAZDA 3, 6, CX-7, AND CX-9 FROM YEAR 2010 TO PRESENT NEEDS TO BE INVESTIGATED BECAUSE I HAVE MET OTHERS WHO ARE NOW DEALING WITH THIS SAME ISSUE WHICH CAN BREACH THE SAFETY OF THE OWNER OF THAT VEHICLE, OTHER VEHICLES, AND PEDESTRIANS IN AND AROUND THE TRAVELING AREA.  MAZDA FAILS TO RECOGNIZE THIS PROBLEM IN WHICH I AM LOOKING TO THE FEDERAL GOVERNMENT TO LOOK INTO THIS ISSUE.      [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JM3ER2WMXA0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2014",
        "dateOfIncident": "05/09/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587437,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "A FLAPPING SOUND DEVELOPED IN THE ENGINE COMPARTMENT WHILE TRAVELING ON INTERSTATE 35W. BATTERY LIGHT CAME ON AND LOSS OF POWER STEERING. EXITED THE FREEWAY TO A PARKING LOT. OPENED THE HOOD AND THE BROKEN ENGINE BELT WAS WRAPPED AROUND THE ENGINE PULLEY ONLY, WITH SHREDDED PIECES OF IT STUCK THROUGHOUT THE ENGINE COMPARTMENT. TOWED TO A REPAIR SHOP AND WAS DIAGNOSED TO HAVE A FAULTY BELT TENSIONER AND/OR BELT WAS NOT INSTALLED CORRECTLY AT THE FACTORY. CONTACTED MAZDA USA AND WAS ADVISED THAT IT IS NOT COVERED UNDER THE BASIC 3 YEAR/36000 MILES WARRANTY OR THE POWER TRAIN 5 YEAR/60000 MILES WARRANTY.  *TR",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/12/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551882,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER WHEN TRYING TO ACCELERATE. PUFF OF WHITE SMOKE ALONG WITH A CLACKING NOISE.  *TR",
        "vin": "JM3ER4WL8A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543768,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH THE A/C ON, THE ECM SEEMS TO MALFUNCTION AND INCREASE THE SPEED OF THE CAR WHEN THE AC COMPRESSOR TURNS ON.  IF YOU ARE IN THE PROCESS OF BRAKING, THE CAR WILL NOT STOP AND IT WILL REQUIRE THE DRIVER TO PRESS HARDER ON THE BRAKES. THE CAR GETS AND EXTRA BOOST OF ENERGY AND EVEN THOUGH YOU ARE BRAKING, THE CAR LUNGES FORWARD AND CONTINUES TO ROLL FURTHER.  IF THE DRIVER IS CAUGHT OFF GUARD, THIS WILL LEAD TO AN ACCIDENT.  I CRASHED MY CAR INTO A FAMILY MEMBERS HOUSE AS I WAS PARKING.  LUCKILY, THE PARKING BUMPER SLOWED DOWN THE CAR ENOUGH SO AS TO ONLY SLIGHTLY BUMP THE HOUSE.  IT HAS HAPPENED IN REGULAR TRAFFIC AS WELL.  LUCKILY, I KEEP A SAFE DISTANCE FROM CARS AND BRAKE EARLY BUT NOW I BRAKE EVEN EARLIER JUST IN CASE.  VOLKSWAGEN HAD THE SAME PROBLEM AND THEY DID A LARGE RECALL ON THE VEHICLE BECAUSE OF THE SAFETY ISSUE IT INVOLVES.  IF YOU OWN A CX-7 KEEP AN EYE OUT FOR THIS, ESPECIALLY WHEN THE A/C IS ON.  IT ONLY HAPPENS WHEN THE TIMING IS JUST RIGHT THAT YOU ARE BRAKING AND THE COMPRESSOR TURNS ON A THAT PRECISE MOMENT SO IT WILL CATCH YOU OFF GUARD AND SCARE THE DAYLIGHTS OUT OF YOU.  I'VE BEEN LUCKY SO FAR BUT THIS COULD DEFINITELY CAUSE MAJOR DAMAGE IF NOT RECALLED IN ORDER TO FIX.  HERE IS THE INFO FROM A RECALL FROM VOLKSWAGEN. VOLKSWAGEN IS RECALLING APPROXIMATELY 4,000 OF ITS CARS. THE AUTOMAKER WILL FIX ENGINE CONTROL MODULE SOFTWARE THAT CAN TRIGGER AN UNEXPECTED INCREASE IN ENGINE RPM, ACCORDING TO THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION.  \"THESE VEHICLES HAVE AN ENGINE CONTROL MODULE CONTAINING SOFTWARE THAT MAY NOT PROPERLY CONTROL ENGINE IDLE WITH THE AIR-CONDITIONING TURNED ON,\" NHTSA SAID IN ITS SUMMARY OF THE PROBLEM. \"IN RARE CASES, THE ECM MAY UNEXPECTEDLY INCREASE ENGINE RPM. AN ENGINE SURGE CAUSED BY AN UNEXPECTED INCREASE IN ENGINE RPM MAY SURPRISE THE VEHICLE OPERATOR AND CAN RESULT IN A CRASH WITHOUT WARNING.\"  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/10/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542949,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 MAZDA CX7 HAS BEEN IN DIRE NEED OF NEW TIRES.  I HAVE HAD SEVERAL REPAIRS FROM PUNCTURES IN THE TIRES WHICH ARE BRIDGESTONE DUELER 215/70R17 WHICH IS MY UNDERSTANDING THAT THEY ARE SOFT TIRES AND THE RATING IS NOT THAT GREAT ON THIS TYPE OF TIRE BUT IT IS THE ONLY TIRE RECOMMENDED FOR THIS MODEL.  THIS IS THE ONLY TIRE RECOMMENDED THROUGH MAZDA. THEY ARE ALSO EXPENSIVE.  I AM VERY UPSET THAT MAZDA GIVES NO ALLOWANCE OF THE BRAND TIRE THAT A CONSUMER MAY CHOOSE.   EVEN THE MAZDA DEALER THAT I BOUGHT FROM DIDN'T HAVE THEM IN STOCK.  I FEEL THIS HAS BEEN MISREPRESENTATION ON THE DEALER'S PART AND MAZDA.  I HAVE BEEN READING FORUMS OF THIS PROBLEM AND IT IS RECOMMENDED TO REPLACE EVERY YEAR BECAUSE OF TYPE OF TIRE.  I LIVE IN FLORIDA AND DO NOT NEED WINTER TIRES.  IS THERE ANYTHING I CAN DO?  I AM TEMPTED TO CONTACT EVERY TIRE DEALER AND MEDIA.  *TR",
        "vin": "JM3ER2W55A0"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/21/2013",
        "dateOfIncident": "07/09/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525959,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON INTERSTATE THE TIRE PRESSURE SENSOR ILLUMINATED. HUSBAND CHECKED ALL TIRES AND DISCOVERED THAT ONE OF THE VALVE STEMS WAS BROKEN. THE OUTSIDE WAS CORRODED. THE SLIGHTEST PRESSURE ON IT WAS RELEASING AIR AT A RAPID RATE.  WE HAD ONLY JUST PURCHASED THE CAR A WEEK BEFORE. HOW THIS WAS NOT CAUGHT BY THE SERVICE DEPARTMENT AT THE DEALERSHIP IS BEYOND ME. THE DEALERSHIP REPLACED THE STEM, BUT WE WERE TOLD THAT THIS IS A COMMON PROBLEM. REALLY? THEN WHY AREN'T THERE ANY RECALLS ON THIS? AFTER READING THE OTHER NUMEROUS COMPLAINTS ABOUT OUR MODEL, I AM BECOMING INCREASINGLY NERVOUS OVER OUR HASTY PURCHASE. RESEARCH IS KEY IN CHOOSING A VEHICLE.  *TR",
        "vin": "JM3ER4WLXA0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520994,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FLOOR BOARD STAYS WET. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/06/2013",
        "dateOfIncident": "01/13/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10515394,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW HEADRESTS SINCE 2010 ARE TERRIBLE.  MY NECK CONSTANTLY HURTS BECAUSE I LIKE TO SIT AGAINST THE BACK OF MY SEAT, AND MY HEAD IS PUSHED FORWARD AT AN ANGLE NO MATTER HOW I TRY TO ADJUST THE HEADRESTS IN MY CX7.  THESE \"SAFETY\" REGULATIONS ARE CAUSING ME PAIN AND PERMANENT NECK ISSUES.  THESE SAFETY REGULATIONS NEED TO BE REVISED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2013",
        "dateOfIncident": "04/09/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502075,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT AFTER THE ENGINE WAS STARTED, THERE WAS A RATTLING NOISE COMING FROM UNDER THE ENGINE. THE VEHICLE WAS TAKEN TO THE DEALER AT LEAST TEN TIMES WHO REPLACED THE MOTOR MOUNTS, RING SEAL, CONVERTER, GASKET AND MAIN PIPE, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 1,000 AND THE CURRENT MILEAGE WAS 27,000.   UPDATED 4/11/13 *CN  THE CONSUMER STATED THE REMOTE KEY WOULD NOT WORK AT TIMES. UPDATED 04/18/13",
        "vin": "JM3ER2WM2A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2013",
        "dateOfIncident": "04/09/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502033,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE THE MAZDA CX7 ON MARCH 20 2010. WITHIN 3 WEEKS I NOTICE A RATTLING NOISE FROM THE ENGINE WHEN START UP THE CAR. I TOOK IT TO 2 DIFFERENT LOCAL MAZDA DEALERS OVER 8 TIMES SINCE PURCHASE AND THEY REPLACED 3 MOTOR MOUNT BUT THE PROBLEM STILL EXIST. THIS YEAR I TOOK IT TO THE DEALER TWICE AND THEY REFUSED TO FIX IT. THEY WOULDN'T EVEN SCHEDULE AN APPOINTMENT TO LOOK AT MY CAR. MY CAR IS STILL UNDER WARRANTY. I TOOK MY CAR TO 2 DIFFERENT CERTIFIED MECHANICS AND THEY BOTH ACKNOWLEDGE THAT THE RATTLING NOISE DOES EXIST.I NEED HELP FIXING THIS PROBLEM. I READ ONLINE AND SAW LOTS OF COMPLAINT ABOUT THIS PROBLEM. SOME WERE ABLE TO GET IT RESOLVE BUT THEY WOULDN'T FIX MY ISSUE.  *TR",
        "vin": "JM3ER2WM2A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2013",
        "dateOfIncident": "02/11/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498124,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX7. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, HE HEARD A LOUD WHINING NOISE AND WAS UNABLE TO ACCELERATE THE VEHICLE. THE CONTACT ALSO STATED THAT THE TURBO FAILED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TURBO NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 50,100.",
        "vin": "NJ3ER2W36A0"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "11/25/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490900,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 CX7 GRAND TOURING WAS PURCHASED WITH 5,844 MILES FROM DEALER.  WE CHANGED THE OIL & FILTER EVERY 6,000 MILES USING RECOMMENDED OIL AS SHOWN IN THE OWNERS MANUAL (5W20).  MANUAL RECOMMENDATION IS TO CHANGE OIL EVERY 7,500 MILES WITH NORMAL DRIVING CONDITIONS WHICH IS THE CASE AS MY WIFE DROVE TO AND FROM WORK.  AT 37,000 MILES, VEHICLE WAS STARTED IN 20DEG F. TEMPS, WARMED UP FOR  AND EXPERIENCED LOUD ENGINE KNOCK.  ONCE DRIVEN, VEHICLE HAD NO POWER AND HAD TROUBLES GETTING TO HWY SPEED.  DROVE THE VEHICLE TO THE DEALER WHERE WE PURCHASED IT THE NEXT DAY AND WAS INFORMED THE ENGINE HAD EXCESSIVE ENGINE OIL SLUDGE UNDER THE OIL FILLER CAP.  SERVICE DEPT. CALLED ME THE NEXT DAY AND SAID THEY WOULD NEED TO PULL THE VALVE COVER TO INVESTIGATE FURTHER TO SEE IF MAZDA NATIONAL WOULD COVER UNDER WARRANTY.  WE AGREED SINCE WE PROPERLY MAINTAINED THE VEHICLE AND HAD NOTHING TO HIDE.  TWO DAYS LATER WE RECEIVED A CALL FROM THE DEALER AND WERE INFORMED THERE WAS EXCESSIVE SLUDGE AND THEY WOULD NEED TO SEE RECEIPTS FROM WHERE WE CHANGED OUR OIL.  WE PERFORMED OUR OWN OIL CHANGES AND DID NOT KEEP RECEIPTS FROM THE AUTO PARTS STORE WHERE WE PURCHASED THE OIL.  DEALER SAID WITHOUT THE RECEIPTS WE WOULD NOT GET WARRANTY WORK DONE AND CHARGED US $260 TO DO THE INVESTIGATION TO BETTER THEIR CASE.  I CALLED NATIONAL MAZDA AND ALL THEY DID WAS READ THE NOTES FROM THE DEALER AND WERE NOT WILLING TO BUDGE.  THE REP FROM MAZDA ([XXX]) WAS EXTREMELY RUDE AND COULD CARE LESS WE WERE EXPERIENCING MAJOR ISSUES WITH A CAR WITHIN THE WARRANTY.  THERE ARE NUMEROUS CLAIMS SIMILAR TO OURS ALL OVER THE INTERNET.  IT APPEARS MAZDA HAS THEIR STANDARD \"EXCESSIVE ENGINE SLUDGE\" PITCH DOWN AS THIS IS THE COMMON THEME IN ALL CX7 ENGINE PROBLEMS.    WE HAD THE ENGINE REBUILT AT A LOCAL SHOP (PAID $6,100) AND NOW ARE TOLD THE TURBO IS SHOT AS WELL WHICH IS ESTIMATED AT ANOTHER $2,000 TO REPLACE.  *TR",
        "vin": "JM3ER4W34A0"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/01/2012",
        "dateOfIncident": "11/27/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486649,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SUNROOF EXPLODED ON TUESDAY, NOVEMBER 27, 2012. IT WAS ABOUT 35 DEGREES OUTSIDE AND A BRIGHT, SUNNY DAY. WE WERE ON INTERSTATE 94 AND HEARD A LOUD EXPLOSION. WE LOOKED BEHIND US AND SAW GLASS FLYING FROM OUR ROOFTOP. THE TRUCK BEHIND US DROPPED HIS SPEED IMMEDIATELY, AS OUR GLASS WAS FLYING OFF THE ROOF. WE IMMEDIATELY PULLED OVER TO THE SIDE OF THE HIGHWAY AND SAW THAT OUR SUNROOF HAD EXPLODED UP AND OUTWARD. THE TEMPERED GLASS IS TOTALLY IN SHARDS AND BARELY HELD TOGETHER. WE PULLED OFF THE LARGER, LOOSE PIECES, AND CALLED OUR INSURANCE COMPANY IMMEDIATELY. WE ARE FORTUNATE THE INSIDE HEADLINER OF THE SUNROOF WAS CLOSED, OR WE WOULD HAVE HAD GLASS RAINING DOWN ON US. WE DO NOT BELIEVE ANYTHING LANDED ON THE ROOF, AS I HAVE A ROOF RACK ON TOP AND NOTHING IS DAMAGED ON TOP OF THE ROOF ITSELF. WE CONTACTED THE MANUFACTURER, MAZDA, AND THEY DON'T THINK IT IS A WARRANTY ISSUE. I BELIEVE WE HAVE A DEFECT WITH THE SUNROOF GLASS AND WOULD LIKE IT LOOKED INTO.  *TR",
        "vin": "JM3ER2W5XA0"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "10/03/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479600,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 4 2012 I WAS TOLD BY THE MAZDA DEALER SERVICE DEPT THAT MY TIMING CHAIN AND TURBO CHARGER ON MY 2010 MAZDA CX7 WENT BAD AND NEEDED TO BE REPLACED.  MY VEHICLE ONLY HAS 39400 MILES ON IT AND SHOULD BE COVERED UNDER MAZDAS POWER TRAIN WARRANTY.  I WAS TOLD BY MAZDA WARRANTY DEPARTMENT THAT THEY WOULD NOT PAY FOR ANYTHING BASED ON SLUDGE BUILD UP IN THE ENGINE.  I SENT THEM COPIES OF OIL CHANGE MAINTENANCE AS THEY REQUESTED WHICH WERE DONE AT APROX EVERY 3400 MILES AS OPPOSED TO THE REQUIRED 7500MILES.  I WAS TOLD THEN THAT THEY WOULD COVER ONLY THE TIMING CHAIN REPLACEMENT BECAUSE IT WAS ON A RECALL AND THAT THE TURBO CHARGER WOULD NOT BE COVERED AT ALL. THEY CAME TO THIS CONCLUSION DUE TO THE TURBO GOING BAD DUE TO AN OUTSIDE INFLUENCE WHAT IS THAT I ASKED AND THEY HAD NO ANSWER. THE ANSWER I WAS GIVEN IS IT WILL NOT BE COVERED UNDER WARRANTY AND THAT IS THAT AND I HAVE BASICALLY NO RECOURSE.THERE IS CLEARLY A PROBLEM WITH THESE CX7 AS THERE ARE SO MANY SIMILAR COMPLAINTS ALL OVER THE INTERNET AND YET MAZDA REFUSES TO PAY ON THESE PART THAT SHOULD BE COVERED UNDER THE POWERTRAIN WARRANTY 6YRS/60,000 MILES. THE CAR GETS TOO HOT AND BURNS THE OIL AND THAT IS WHAT CAUSES THE SLUDGE A MANUFACTURES DEFECT NOT NEGLECT ON OIL CHANGE AND FILTER MAINTENANCE.  OTHER MAZDA OWNER HAVE THE SAME RESULT WHETHER THEY OIL CHANGED AT 3000, 4000, OR THE REQUIRED 7500 HOW CAN WE ALL HAVE SLUDGE IN THE ENGINE. OBVIOUSLY THERE IS A MANUFACTURERS DEFECT REGARDING THIS ENTIRE TURBO SYSTEM. MAZDA NEEDS TO OWN UP TO THE DEFECTS REGARDING THE CX7 MODELS AND HONOR THE CUSTOMERS WARRANTY WORK.  THE CAR HAS SO MANY PROBLEMS THAT THEY ARE PRESENTLY NOT MAKING IT ANYMORE.  I DO NOT HAVE THE MONEY TO LAYOUT AND WAIT TO BE REIMBURSED POSSIBLY BY MAZDA IN THE FUTURE THIS IS A DISGRACE.  I WILL NEVER DRIVE ANOTHER MAZDA VEHICLE AGAIN AND I WILL NOT EVER RECOMMEND THEM TO ANY ONE.  *TR",
        "vin": "JM3ER4WL2A0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/29/2012",
        "dateOfIncident": "02/26/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449713,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURBO MADE A LOUD WHINING NOISE WHEN THE ACCELERATOR WAS PUSHED AND YOU COULD NOT ACCELERATE. ALOT OF WHITE SMOKE WAS FLOWING FROM THE EXHAUST. WE IMMEDIATELY PULLED OVER ON OUR WAY HOME FROM OUT OF TOWN AND CALLED AAA TO TOW THE CAR BACK TO THE SERVICE DEALER IN PARKERSBURG WV.     THE VEHICLE ONLY HAS APPROX. 19,000 MILES ON IT WITH SERVICE RECORDS SHOWING PROPER OIL CHANGES. THE VEHICLE IS UNDER WARRANTY AND MAZDA SOUNDS LIKE THEY DON'T WANT TO COVER THIS PROBLEM.  *TR",
        "vin": "JM3ER4WL5A0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/29/2011",
        "dateOfIncident": "11/23/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437764,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY MAZDA WHEN IT STARTED MAKING THIS ODD WINDING SOUND. AT FIRST IT WAS NOT TOO LOUD BUT WHEN I TRIED TO SPEED UP TO GET ON THE INTERSTATE, THE SOUND GOT EXTREMELY LOUD. I BROUGHT IT BACK HOME BUT BARELY MADE IT UP THE HILL TO OUR STREET. I HAD THE GAS PEDAL TO THE FLOOR BUT IT HAD NO POWER. I CALLED ROAD SIDE ASSISTANCE AND THEY PICKED UP MY CAR PROMPTLY. WHEN THE DEALERSHIP CALLED ME BACK, THEY REPORTED THAT THE ENGINE HAD \"GUNK\" IN IT. MY HUSBAND CHANGED THE OIL IN THE CAR BUT WE NEVER SAVED RECEIPTS FOR THE OIL, SO WE HAVE NO PROOF.  I BOUGHT THIS CAR BRAND NEW IN 2010. IT ONLY HAS A LITTLE OVER 32000 MILES ON IT. THE DEALERSHIP IS TELLING ME THAT MAZDA WILL NOT PAY FOR THE ENGINE AND IT WILL COST $9000 TO REPLACE THE ENGINE. THE CAR I DROVE PRIOR TO THIS WAS A NISSAN ALTIMA AND WE ALSO DID ALL THE MAINTENANCE TO THIS CAR.  I DROVE THE ALTIMA FOR A LITTLE OVER 200,000 MILES AND IT WAS STILL RUNNING WELL WHEN I SOLD IT. IT MAKES NO SENSE TO ME THAT THIS MAZDA HAS A BAD ENGINE AND IT MAKES ME EVEN MORE MAD THAT THEY ARE NOT GOING TO REPLACE THE ENGINE.  *KB  *TR",
        "vin": "JM3ER4W37A0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/12/2011",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420154,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2010 MAZDA CX7 VEHICLE ABOUT NINE MONTHS AGO.  I FREQUENTLY DO NOT DRIVE THE VEHICLE BECAUSE I FEEL IT IS UNSAFE UNDER MANY CONDITIONS.  THE DASH LIGHTS ARE INADEQUATE AND MAKE IT ALMOST IMPOSSIBLE TO KNOW HOW FAST YOU ARE TRAVELING DAY OR NIGHT.  I AM AFRAID I WILL BE TICKETED FOR TRAVELING TOO SLOW OR TOO FAST WHEN THE INSTRUMENT PANEL IS SO POORLY LIGHTED.  I HAVE LOOKED AT OTHER 2010 AND 2011 MODELS, AND THEY ARE ALL THE SAME, POORLY LIGHTED.  I RECENTLY SPOKE TO SOMEONE WITH ANOTHER MODEL WHO HAD THE SAME COMPLAINT.  I FEEL THAT IT IS UNSAFE AND SHOULD BE RECALLED.  I HAVE NO OTHER COMPLAINTS ABOUT THE VEHICLE AT THIS TIME.",
        "vin": "JM3ER4WL5A0"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415087,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-7. THE CONTACT STATED THAT THE WINDSHIELD WAS IMPACTED BY A ROCK WHICH CAUSED IT TO CRACKED. THE DEALER STATED THAT THE CX7 WINDSHIELD GLASS WAS VERY FRAGILE AND COULD BREAK EASILY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THEY WOULD CONTACT HER AT A LATER DATE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 6,700 AND THE CURRENT MILEAGE WAS 10,100.",
        "vin": "JM3ER2W52A0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2011",
        "dateOfIncident": "12/29/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10382128,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURBOCHARGER ON THIS NEW VEHICLE FAILED WHILE I WAS DRIVING ON THE EXPRESSWAY, CAUSING THE VEHICLE TO BE UNSAFE AND INOPERABLE.  FORTUNATELY, I WAS ABLE TO GET IT OFF THE ROAD WITHOUT AN ACCIDENT.  THE VEHICLE WAS NOT SAFE TO LEAVE IN OUR ATTACHED GARAGE OVERNIGHT BECAUSE OF THE RISK OF FIRE. IT APPEARS THAT THERE HAVE BEEN MANY, AND REPEATED, PROBLEMS WITH THE TURBOCHARGER IN THESE VEHICLES.  TO MY KNOWLEDGE, THERE HAS NOT BEEN A RECALL.",
        "vin": "JM3ER4W3XA0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "02/03/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380102,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STARTING THE CAR IN THE MORNING ON MY DRIVEWAY. I SWITCHED THE CAR ON R AND I START TO BACK UP. WHEN I PRESSED THE BRAKE PEDAL , I REALIZED I HAVE NO BRAKE POWER. IT WAS IMPOSSIBLE TO STOP THE CAR. I HAD TO USED THE PARKING BRAKE TO STOP IT. I'VE TRIED FOR 5 MINUTES TO SEE IF BRAKES ARE WORKING WITH NO RESULT. THEY WERE DEAD!!    WHEN THE CARD WAS STARTED , THERE WAS NO MALFUNCTION INDICATOR ON THE DASH.2 MONTHS BEFORE THIS, I WENT TO THE DEALERSHIP REPORTING THAT BRAKING PERFORMANCE DECREASED A LOT. THEY INVESTIGATED THE CAR AND FOUND \"NO DEFECT\" AND TOLD ME THE CAR IS WORKING AS IT SHOULD...YEAS SURE!!    MY LUCK WAS THAT I WAS NOT DRIVING THE CAR ON THE ROADS. IMAGINE LOOSING BRAKE AR 60 MPH.  *TR",
        "vin": "JM3ER4W39A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368334,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FLUID HAS BEEN LEAKING FROM THE UNDERSIDE OF THE VEHICLE FOR APPROXIMATELY ONE YEAR.  AFTER DRIVING FOR EVEN SHORT DISTANCES THE FLUID SEEMS TO DROP ONTO THE EXHAUST PIPE OR SOME OTHER HOT METAL AND BURNS WITH AN ACRID SMELL AND A MINOR AMOUNT OF SMOKE.  I HAVE A CONCERN THAT A FIRE MAY START FROM THE BURNING FLUID.  VEHICLE WAS BROUGHT INTO THE DEALER FOR A REPAIR TO THE TRANSFER CASE, WHICH IS LEAKING FLUID, BUT IT IS PAST THE WARRANTY PERIOD AND THE COST WILL BE OVER $1000.  THERE IS A TSB ON THIS PROBLEM THAT IS CAUSED BY A MANUFACTURING DEFECT OF THE TRANSFER CASE SEALS. *TR",
        "vin": "JM3ER29L070"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/10/2010",
        "dateOfIncident": "09/11/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359918,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA CX-7 WAITING ON THE GREEN LIGHT WAS HIT IN THE PASSENGER SIDE OF VEHICLE WITHOUT SIDE AIRBAGS DEPLOYING.  I HAVE PHOTOS IF THIS WOULD HELP.  POLICE AND FIREFIGHTERS WERE CONFUSED AS TO WHY THE AIRBAGS DID NOT DEPLOY. THE DRIVER'S SIDE FROM FRONT PILLAR TO REAR DOOR WAS IMPACTED.  THE FRONT PILLAR HAS TO BE REPLACED. *TR",
        "vin": "JM3ER4W38A0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2010",
        "dateOfIncident": "06/02/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334832,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA CX7. CONSUMER STATES THAT THE DESIGN OF THE INSTRUMENT CLUSTER AND INDICATORS, IN BLACK AND WHITE IS VERY POORLY DESIGNED *TGW   THE CONSUMER STATED IN BRIGHT DAY LIGHT, WITH BRIGHTNESS CONTROL AT ITS TOP SETTING, IT WAS STILL COMPLETELY DARK AND IT WAS LIKE LOOKING INTO A BLACK HOLE.  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2010",
        "dateOfIncident": "12/29/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329273,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-7",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 MAZDA CX-7. WHILE DRIVING AT 30 MPH, THE CONTACT EXPERIENCED DIFFICULTY READING THE GAUGES ON THE INSTRUMENT PANEL IN THE BRIGHT SUNLIGHT. THE CONTACT ALSO STATED THAT THE GAUGES WERE DIFFICULT TO SEE AT NIGHT BECAUSE THEY WERE ILLUMINATED WITH A WHITE LIGHTING. FURTHERMORE, THE CONTACT STATED THAT THE SPACE BETWEEN THE BRAKE PEDAL AND ACCELERATOR PEDAL WERE TOO CLOSE MAKING IT HARD TO DEPRESS THE CORRECT PEDAL WHILE DRIVING. THE CURRENT MILEAGE WAS APPROXIMATELY 700. THE FAILURE MILEAGE WAS 414.",
        "vin": "JM3ER2WMXA0"
    }
]