[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, AIR,ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/06/2004",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093673,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ECLIPSE",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A \"CERTIFIED\" CAR FROM LIBERTY AUTO PLAZA (ON THE WINDOW STICKER IT INDICATED THAT IT WAS CERTIFIED AND THAT THERE WAS A 57 POINT SAFETY INSPECTION DONE AND IT PASSED, AS WELL AS A 3 MONTH 3,00 MILE WARRANTY) 2 DAYS AFTER HAVING THE CAR, WE WERE EXPERIENCING PROBLEMS WITH POWER STEERING AND THE BRAKES, SO WE BROUGHT IT IN TO BE CHECK OUT. THERE ARE OVER $3,000 WORTH OF PARTS TO MAKE IT A SAFE CAR, NOT INCLUDING THE LABOR AT $95 PER HOUR TO FIX.  THEY WERE EVEN BAFFLED BY CERTAIN THINGS, SO THEY SUGGESTED WE TAKE IT TO THE LIBERYVILLE MITSUBISHI DEALERSHIP AND HAVE A DIAGNOSTIC CHECK DONE AND THEY WOULD PAY FOR IT.  MAJOR STUFF WAS FOUND HERE, ENGINE MOUNT WAS BUSTED AND LEAKING FLUID, POWER STEERING LINKAGE AND BUSHINGS WERE SHOT AND THE RESERVOIR TANK WAS CRACKED, TIE RODS WERE BLOWN, THE BRAKES WERE SO \"WARPED\" THAT IS WHAT WAS CAUSING THE CAR TO SHAKE WHEN APPLYING THE BRAKE.  BACK TO WHERE WE BOUGHT THE CAR, THERE WERE PAPERS THAT WERE FORGED AND I DIDN'T SIGN, AND THEY SOLD ME A GAP INSURANCE POLICY AND NEVER SUBMITTED THE POLICY OR A CHECK TO GET THE ADDENDUM TURNED INTO A POLICY, SO THERE IS FRAUD.  WE JUST WANT THEM TO TAKE THE CAR BACK AND REIMBURSE US FOR OUR EXPENSES.  THE CAR IS PARKED AND NOT DRIVABLE.  *AK",
        "vin": "4A3AX55F0WE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/20/2000",
        "dateOfIncident": "12/01/1998",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 724262,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ECLIPSE",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "4A3CS44U0LE"
    }
]