[
    {
        "components": "TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "03/22/2011",
        "dateOfIncident": "03/20/2011",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392537,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 5TH WHEEL MOUNT BOLTS ON MY COMPANY'S 2010 AND 2009 MACK TRUCKS ARE STRETCHING AND BECOMING LOOSE. I SAW UNIT 10101 ON SUNDAY, 20 MARCH 2011 ON OUR YARD READY TO HOOK UP. I HAD FINISHED MY SHIFT AND WAS WALKING PAST THE UNIT WHEN I REACHED OUT AND TURNED THE BOLT BY HAND. *TR",
        "vin": "1M1AW01X3BM"
    },
    {
        "components": "TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390328,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A MECHANIC FOR A LARGE TRUCKING FIRM. I HAVE BEEN COMPLAINING ABOUT THE 5TH WHEEL BOLTS ON OUR 2008, 2009, AND 2010 MACK TRUCKS FOR TWO YEARS NOW. THE COMPANY HAS YET TO IMPLEMENT A PROGRAM TO CORRECT THIS MATTER, INSTEAD CHOOSING TO THREATEN ME WITH DISCIPLINARY ACTION FOR POINTING OUT LOOSE BOLTS ON OUR ROAD TRACTORS. TODAY (03/15/2011) I PASSED A 2010 TRACTOR ON THE READY LINE. IT WAS UNIT #10289 WITH ONLY 76327 MILES ON IT. THE 5TH WHEEL PLATE HAD BEEN SHIFTING ON THE FRAME AND ALL OF THE FASTENING BOLTS WERE RUSTY. THE TWO BOLTS THAT I CHECKED TURNED EASILY BY HAND - RATTLING LOOSE. THE BOLTS WERE NOT HITTING ANY THING THAT MIGHT HAVE LOOSENED THEM, THEY HAD STRETCHED. THE SHOP FOREMAN ON DUTY WAS THE ONE WHO HAD TOLD ME THAT I WAS \"OUT OF LINE\" TO LOOK AT TRUCKS THAT I DID NOT HAVE A WORK ORDER ON, SO I DID NOT RISK TELLING HIM. THE HEAD OF OUR SAFETY DEPARTMENT AT THE GENERAL OFFICE HAD TOLD ME THAT \"THE COMPANY IS HANDLING IT AND FOR ME TO LEAVE IT ALONE\" SO I AM REPORTING IT TO THE ODI. THE 5TH WHEEL BOLTS ARE LOOSE. *TR",
        "vin": "1M1AW01X4BM"
    },
    {
        "components": "STRUCTURE,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "10/03/2010",
        "dateOfIncident": "09/22/2010",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358965,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MACK HAS BEEN SELLING OVER THE ROAD TRUCKS WITH SUBSTANDARD BOLTS HOLDING THE 5TH WHEEL TO THE FRAME. AS A MECHANIC WITH ABF, I AM SEEING TRUCKS EVERY DAY WITH 5TH WHEELS THAT ARE LOOSE. ON 22 SEPTEMBER 2010, I WORKED ON UNIT #10222 AT THE LITTLE ROCK SHOP. THIS TRUCK HAD ONLY 4376 MILES ON IT AND I COULD TURN THE 5TH WHEEL BOLTS WITH ONE HAND USING A 10 INCH COMBINATION WRENCH. I TRIED TO TORQUE THE BOLTS TO SPECS, BUT THEY ONLY STRETCHED. I REPLACED THE BOLTS WITH AFTERMARKET BOLTS WHICH TIGHTENED NORMALLY. *TR",
        "vin": "1M1AW01X4BM"
    },
    {
        "components": "STRUCTURE,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/22/2010",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357085,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS A MECHANIC CONTRACTED TO MAINTAIN ABF ROAD TRACTORS, I WORKED ON UNIT 10064 ON 9/22/2010. I DISCOVERED THAT THE 5TH WHEEL MOUNT BOLTS WERE ALL LOOSE. THIS TRUCK HAD ONLY 51,285 MILES OF SERVICE PULLING PUP TRAILERS! I REMOVED THE BOLTS TO MAKE SURE THERE WAS NO THREAD DAMAGE, LIGHTLY OILED THEM, AND ATTEMPTED TO TORQUE THEM TO MACK SPECS OF 235 FT.LBS. TORQUE. NONE OF THE BOLTS WOULD TIGHTEN PROPERLY, ALL OF THEM STRETCHED. I REPLACED ALL OF THE BOLTS AND TAGGED THE DEFECTIVE BOLTS FOR MACK WARRANTY.    AS A CITIZEN WHO EXPECTS THE HIGHWAYS OF THE UNITED STATES TO BE SAFE FOR TRAVEL, I AM ASKING THE ODI TO FIND OUT WHY ALL OF THE MACKS DELIVERED TO ABF HAVE DEFECTIVE 5TH WHEEL MOUNT BOLTS AND TO FIND OUT IF THE MACKS DELIVERED TO MORE DEMANDING CUSTOMERS ( SUCH AS LOGGERS, GRAVEL TRUCKS, CONCRETE TRUCKS, AND TANDEM AXLE FULL TRAILER LOAD TRUCKERS ) ARE ALSO ASSEMBLED WITH INFERIOR QUALITY FASTENERS THAT FAIL PREMATURELY. *TR",
        "vin": "1M1AW01X8BM"
    },
    {
        "components": "STRUCTURE,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "09/21/2010",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356871,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A MECHANIC FOR ABF FREIGHT SYSTEM. I HAVE OBSERVED THAT MANY OF THE MACK TRUCKS WE USE IN OUR ROAD FLEET HAVE PREMATURE FAILURE OF THE FASTENERS HOLDING THE 5TH WHEEL COUPLER TO THE TRUCK FRAME. I WORKED ON UNIT 10016 ON 9/21/2010 AND CHECKED THE 5TH WHEEL BOLT TIGHTNESS AS A FOLLOW UP TO COMPLAINT #10356665. THE BOLTS WERE LOOSE AFTER ONLY 63,450 MILES OF SERVICE. I TRIED TO TIGHTEN THEM AS I HAD PREVIOUSLY BEEN ORDERED TO DO BUT THE BOLTS ONLY STRETCHED. I REPLACED THE 5TH WHEEL BOLTS. THE OLD BOLTS THAT HAD BEEN TIGHTENED WERE VISIBLY STRETCHED. *TR",
        "vin": "1M1AW01X6BM"
    },
    {
        "components": "SUSPENSION,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356665,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CXU612",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A MECHANIC FOR ABF. FOR THE LAST THREE YEARS, MACK HAS SOLD TO ABF ROAD TRACTORS WITH DEFECTIVE 5TH WHEEL MOUNTING BOLTS. THE BOLTS STRETCH AND BECOME LOOSE WITH USE (USUALLY WITHIN THE FIRST 30,000 MILES). FOR UNKNOWN REASONS ABF HAS NEVER HELD MACK ACCOUNTABLE FOR THIS PROBLEM, PREFERRING TO TIGHTEN THE BOLTS WHEN A DRIVER COMPLAINS AND REPLACING BOLTS WHEN THEY PULL IN TWO.    I HAVE REPEATEDLY WARNED MY SUPERVISORS THAT THESE BOLTS SHOULD BE REPLACED RATHER THAN REPEATEDLY RETORQUED, BUT HAVE BEEN REBUFFED DUE TO MANAGEMENT DISTRUST OF UNION EMPLOYEES. NOW OUR 2010 MODEL TRUCKS ARE GETTING 20-50K MILES ON THEM AND I AM SEEING NEARLY 100% WITH LOOSE 5TH WHEEL MOUNT BOLTS.    WE PURCHASED REPLACEMENT BOLTS FROM MACK AND DISCOVERED THAT THEY WOULD NOT TAKE THE TORQUE SPEC THAT MACK GAVE US, THEY SIMPLY STRETCHED UNTIL THE CROSS SECTIONAL AREA WAS ABOUT HALF NORMAL AND THEN BROKE! WE THEN ACQUIRED AFTERMARKET BOLTS LOCALLY AND HAD NO PROBLEMS TIGHTENING THEM TO MANUFACTURER'S SPECS.    IT IS MY THEORY (AND FEAR) THAT MACK'S SUPPLIER HAS PROVIDED BOLTS OF INFERIOR QUALITY FOR YEARS AND THAT THOSE BOLTS HAVE BEEN USED IN THE ASSEMBLY LINES AS WELL AS IN MACK PARTS DEPARTMENTS NATIONWIDE.    I AM ASKING THE NHTSA TO INVESTIGATE THIS PROBLEM BECAUSE ABF MANAGEMENT SEEMS UNWILLING TO VIGOROUSLY SEEK A SOLUTION. AFTER THREE YEARS OF BOLT FAILURE OUR LARGEST ABF PARTS DEPARTMENT ONLY STOCKS ENOUGH BOLTS TO FIX ONE TRUCK AT A TIME. I AM ALSO CERTAIN THAT THESE BOLTS ARE IN SERVICE IN MANY OTHER FLEETS ACROSS THE NATION, SO IT IS NOT A PROBLEM THAT ABF SHOULD HAVE TO SOLVE ALONE.    I HAVE PHOTOGRAPHS AND SAMPLES OF THE DEFECTIVE HARDWARE AND CAN OBTAIN MODELS AND VIN'S IF NECESSARY. *TR",
        "vin": ""
    }
]