[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/02/2022",
        "dateOfIncident": "12/31/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445870,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The AWD system failed leaving the car dangerous to drive in rain and snowy weather.  Car is still stuck in my driveway as the front wheels are spinning and no power to the rear wheels.  My Mother's AWD with similar M+S tires drove out with no problems.  Waiting for the snow to melt to be able to take my car into the shop.  Reading online this seems like a known Mazda issue.",
        "vin": "JM3TB3MA1A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437299,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Mazda CX-9. The contact received notification of NHTSA campaign number      15V451000 (Suspension) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact indicated that while driving at various speeds, a rattling noise was present coming from the front of the vehicle. Additionally, the front end of the vehicle was unstable. The vehicle was taken to the local dealer who indicated that the failure was due to the recall however, the part was on backorder. The failure mileage was 160,000. Parts distribution disconnect.",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436214,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Our 2010 Mazda CX-9 stopped on the highway and had to be towed away. The dealer determined it was an engine failure due to a faulty water pump. It had leaked into the engine, causing permanent damage.  No warning lights. The car just stopped. Two dealerships did not want to repair.  There is a class action lawsuit.  https://www.ktmc.com/mazda-water-pump-engine-failure There should be a recall.  We need a refund for the repair we had done, totaling more than $7000. Please look into this safety issue. Mazda Corporate has our complaint on file. We are expecting a refund.",
        "vin": "JM3TB3MV7A0"
    },
    {
        "components": "POWER TRAIN,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429182,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on I-5, near Gold Hill, Oregon, when the traction control system light came on and the Vehicle slowed down. I had to push the gas pedal to the floor to get the car to move and I could not shift gears! It shuddered and the wheels seemed to lock up. I could smell burning rubber. I forced the car to the next exit, pulled off and shut it down. I sat there waiting for it to cool off. When I started it again it was a little rough at first but then seemed to get better and I was able to get home.  I bought the car in June of 2020 from Lithia Motors in Medford, Oregon. I also bought a Power Train Warranty For $2,500 which was set to expire on 6/10/2021. I called Lithia and made an appointment to take it to them for repairs on June 1, 2021. I got as far as Grants Pass, OR, and it did the same thing I described above. I called a tow truck and had it towed to Lithia in Medford. When I got to Medford, the Service Manager told me I would have to take it to Crater Lake Ford. When I got to Crater Lake Ford I was told to take it to Crater Lake Mazda which I did. I described in detail what the car was doing to.the Service.Manager and told him I feared it was some kind of transmission problem. I also told him I had a power Train. Warranty the would expire on June10thso time was no the essence!  I never suspected the brakes because we had the bakes repaired in November of 2020 at Lithia Motors. They were making a hissing sound. They replaced the.brake booster among other brake parts for $1,300 plus. That job was still under warranty.  I got a call on June 15th telling me the problem was in the gear shift. He said it was now repaired and I could come and pick it up. I paid $674 for that repair. I got three miles from the dealership and the original problem occurred. I had it towed back to Mazda and it has been there ever since!!  They replaced they're (traction control module), but that didn't fix it. After test driving it the original problem occurred!  It's still at Mazda.",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425193,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle completely shut off while idling in park with no prior warning to anything being wrong. Put coolant in since the container was empty. Replaced thermostat, but vehicle was still overheating. Had it towed to Flow Mazda of Fayetteville and had them run a diagnostic. They determined that coolant was leaking into the oil due to a broken water pump. It was estimated to cost approximately $5,000 to repair with no guarantee that it would fix the problem. They pulled 4 sludge codes. There is currently a lawsuit against Mazda for this specific problem that was filed in 2019.",
        "vin": "JM3TB3MA0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414722,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING ISSUES WITH MY BRAKES. VERY HARD TO PUSH, NOT COMING TO A STOP, SOUNDS LIKE AIR & MAKES A HISSING SOUND WHEN BRAKE ARE APPLIED.THE 1ST TIME I NOTICED I WAS DRIVING STRAIGHT ON A 2 LANE ST. A CAR WAS COMING FROM THE OFF RAMP ON THE RIGHT OF ME & CUT ME OFF. I TRIED TO BRAKE BUT, THEY WERE SO HARD TO PUSH DOWN, I HAD TO JUMP INTO THE NEXT LANE IN ORDER TO NOT REAR END HER BUT, BECAUSE I HONKED MY HORN, THE LADY JUMPED INTO HER NEXT LANE CAUSING ME TO HAVE TO CUT BACK OVER AGAIN, ALL THE WHILE MY BRAKES ARE REALLY HARD TO PUSH, THE CAR WOULDN'T STOP. THEY MADE HISSING SOUNDS. I HAD MY MECHANIC CHECK, STATES IT'S THE BRAKE BOOSTER & THERE MAY BE A RECALL. I CHECKED ONLINE, JUST A WARRANTY. MAZDA WILL REPAIR BEFORE 90K OR 7 YEARS. I CALLED MAZDA, WHO SAID THEY ONLY MAKE RECALLS WITH SAFETY ISSUES. I'D SAY THE BRAKES MALFUNCTIONING IS DEFINITELY A SAFETY ISSUE. THE 7 YR EXPIRATION WAS UP IN 2018. WHEN I BOUGHT THE VEHICLE IT ALREADY HAD 105K, SO THE WARRANTY WAS EXPIRED. THAT MAKES NO SENSE. IT SHOULD HAVE BEEN A RECALL. WHAT HAPPENS TO PEOPLE LIKE ME WHO BUY THE MAZDA CX-9 AFTER THE 7 YR OR 90K MILE EXPIRATION? IT DOESN'T APPLY TO US AND WE HAVE TO PAY OUT OF POCKET? KNOWING THAT THIS WAS A SAFETY ISSUE AND THAT IT WAS HAPPENING TO 2010-2011 CX-9 MODELS, IT SHOULD HAVE BEEN DEEMED A RECALL. ESPECIALLY WHEN PEOPLE BUY USED CARS. THIS IS NOT JUST AN ISOLATED ISSUE OR INCIDENT. THIS WAS LITERALLY LISTED BY PEOPLE WITH THE SAME COMPLAINTS. I HAVE NOT BEEN ABLE TO FIX MY VEHICLE. IT'S MY SOURCE OF TRANSPORTATION TO GET TO WORK.  I DEFINITELY BELIEVE THIS SHOULD HAVE BEEN A SAFETY RECALL BECAUSE PEOPLE ARE STILL HAVING ISSUES. WHAT IF SOMEONE DIES. WHO'LL BE AT FAULT IF A PERSONS BRAKES GO & THEY GET INTO AN ACCIDENT & GET INJURED OR DIE? THERE HAVE BEEN SO MANY COMPLAINTS REGARDING THIS ISSUE, HOW COULD IT BE DEEMED A WARRANTY AND NOT A SAFETY RECALL?",
        "vin": "JM3TB3MV1A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406440,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A SEVERAL BRAKING PROBLEMS IN MY CAR IN THE FALL OF 2020.  I TOOK IT TO THE MAZDA DEALERSHIP AND THEY REPLACED THE BRAKING SYSTEM PER MAZDA'S SSP 93 BULLETIN.  HOWEVER, MAZDA INFORMED ME THAT MY CAR WAS OUTSIDE OF THE EXTENDED WARRANTY FOR THIS ISSUE AND I HAD TO PAY FOR THE REPAIR MYSELF.  I ARGUED THAT IT WAS CLEARLY A SAFETY ISSUE BECAUSE THE BRAKING SYSTEM PERFORMED SO POORLY THAT I NEARLY GOT IN MULTIPLE ACCIDENTS.  MAZDA STATED THAT IT WAS NOT A SAFETY ISSUE, THEREFORE NO RECALL WAS NECESSARY, AND I WOULDN'T BE COVERED FOR THE REPAIR.  I BELIEVE THE NHTSA NEEDS TO MAKE THIS A FULL SAFETY RECALL.  THE BRAKING FAILURE IS VERY DANGEROUS TO DRIVERS AND MAZDA NEEDS TO TAKE FULL RESPONSIBILITY FOR THIS ISSUE.",
        "vin": "JM3TB3MA4A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400229,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA CX-9 AWD TOURING WITH UNDER 120,000 MILES.  THE VEHICLE WOULD MAKE A NOISE LIKE DRIVING OVER RUMBLE STRIPS IN THE ROAD, VIBRATING THE UNDERCARRIAGE.  IT STARTED HAPPENING WHEN LIGHTLY PRESSING THE ACCELERATOR, TRYING TO MAINTAIN SPEED, NORMALLY AT 1500RPM THEN IT GRADUALLY GOT WORSE AND HAPPENED ALL THE TIME AND THE NOISE GOT LOUDER.  SOMETIMES THERE WOULD BE A BURNING SMELL.  I SPENT $1000+ ON \"FIXES\" BEFORE DISCOVERING IT WAS THE TRANSFER CASE, ANOTHER $2,000+.  SINCE MAZDA ALREADY KNOWS ABOUT THE ISSUE AND HAS PROVIDED 2 EXTENDED WARRANTIES FOR THIS ISSUE, THE TRANSFER CASE FOR THE DEFECTIVE YEARS/MODELS SHOULD BE ON THEM.  AFTER RESEARCHING THIS PROBLEM I HAVE SEEN MANY PEOPLE HAVING TO REPLACE THE TRANSFER CASE MULTIPLE TIMES.",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394287,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE SITTING IN A PARKING LOT WAITING ON A PIZZA.  WE NOTICED THE A/C WASN'T COOLING, AND THEN NOTICED THE CAR WAS STARTING TO OVERHEAT. (THIS WAS THE FIRST TIME EVER).  WE CHECKED THE RADIATOR, IT WAS EMPTY.  WE PURCHASED COOLANT AND FILLED UP THE RESERVOIR.  NEVER SAW ANY LEAKS.  CAR STARTED BUT SEEMED SLUGGISH LIKE THE BATTERY WAS LOW.  WE GOT OUR PIZZA AND DROVE ABOUT 6 MILES WHERE WE PARKED TILL WE TOOK IT TO THE DEALER ON MONDAY.  OUR MECHANIC CALLED ME LATER TO TELL ME THAT THE WATER PUMP HAD FAILED AND THAT IT HAD LEAKED INTO THE OIL PAN AND WE WOULD HAVE TO HAVE THE ENGINE REPLACED.    THE REPAIR TOTAL FOR MY CX9 IS AT $9K.  WE HAVE 108,000 MILES ON THE VEHICLE.  MY VEHICLE IS STILL SITTING AT THE DEALER.",
        "vin": "JM3TB2MAXA0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363095,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HISSING SOUND WHEN BREAK PEDAL IS APPLIED. POWER BREAK BOOSTER FAILURE. THIS IS WHEN THE VEHICLE IS STATIONARY OR MOVING ON ANY STREET.",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360501,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SUDDENLY LOST BRAKING POWER, AND THE BRAKE PEDAL WOULD SOMETIMES FEEL \"SPONGY\" AND SOMETIMES FEEL ROCK-HARD, WITH VARYING RESULTS FOR BRAKING POWER. I WENT TO A MECHANIC WHO SAID THE BRAKE BOOSTER FAILED, AND WE FOUND THIS WAS A KNOWN PROBLEM WITH THE MAZDA CX-9, HOWEVER NHTSA'S INVESTIGATION WAS RESOLVED WHEN MAZDA COVERED THIS PROBLEM FOR ONE YEAR FROM THE DATE IS CLOSING THE NHTSA INVESTIGATION. THIS APPARENTLY IS STILL A PROBLEM, THOUGH. I CALLED MAZDA'S CUSTOMER SERVICE, AND THEY REFUSED TO ACKNOWLEDGE THIS PROBLEM EXISTED AND WOULD ONLY GIVE THE SCRIPTED \"THERE ARE NO OPEN RECALLS ON YOUR VEHICLE\".",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354411,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER SPONGY...KNOWN MAZDA ISSUE,NHTSA CLOSED ISSUE WHEN MAZDA AGREED TO EXTEND WARRANTY,WITHOUT RECALL. OUR PROBLEM OCCURRED AFTER WARRANTY ENDED...PROVING BRAKE RECALL NEEDS TO HAPPEN!!!!   ON JULY 1ST,2020, MY WIFE'S TRIP BACK HOME NEARLY TURNED TRAGIC WHEN THE CAR WOULDN'T BRAKE(FELT SPONGY) DOWN THE HIGHWAY RAMP . FORTUNATELY FOR HER ,THERE WERE NO CARS AT THE INTERSECTION AS THE CAR ZOOMED RIGHT AT 60 MPH .EVENTUALLY,SHE WAS ABLE TO MANEUVER IT TO THE RIGHT LANE AND DROVE IT HOME WITH HAZARD LIGHTS ON. RIGHTFULLY DISTRAUGHT ABOUT THE WHOLE ORDEAL ,WE HAD TO THANK OUR STARS FOR HAVING HER HOME ALIVE AND WITHOUT CAUSING INJURY/DEATH TO OTHERS. ON MY DRIVE TO THE MECHANICS I HEARD AIR HISSING AND FELT THE BRAKE REALLY HARD TO PUSH. AGAIN HAZARD LIGHTS/ MANUAL DRIVE GOT US THERE.     THE MECHANICS IMMEDIATELY SUGGESTED THAT THIS IS A KNOWN PROBLEM WITH MAZDA CX-9 AND THAT MAZDA WAS AWARE OF IT. HE SAID THAT MAZDA HAD PROVIDED  EXTENDED WARRANTY FOR CUSTOMERS WHO HAD THE ISSUE UNTIL MARCH 2015.  WE WERE GROSSLY UNAWARE OF ANY OF THIS,AS WE NEVER HAD THE PROBLEM UNTIL THIS JULY. NOT SURE HOW WE WENT ON FOR SO LONG WITHOUT ANY PROBLEM( MAY BE PROPER CARE/USE?),BUT ANY ISSUE WITH A BRAKE SHOULD HAVE BEEN ADDRESSED BY A COMPLETE RECALL ,NOT BY JUST PROVIDING EXTENDED WARRANTY FOR A LIMITED TIME ,JUST FOR PEOPLE CURRENTLY EXPERIENCING THE ISSUE.MAZDA CUSTOMER SERVICE DOWNPLAYED THE COMPLAINT AS OWNER'S EXPENSE AS WE DID NOT HAVE THE WARRANTY. OUR SITUATION PROVES THAT BRAKE ISSUES ARE NOT SOLVED BY EXTENDING WARRANTY,AND THE ONLY WAY TO ADDRESS THIS IS BY ISSUING A RECALL AND CORRECTING THE PROBLEM. IN ADDITION, THERE MIGHT BE MANY MORE MAZDA OWNERS STILL DRIVING THEIR VEHICLES,COMPLETELY UNAWARE OF THIS PROBLEM,THUS CONSTITUTING HAZARDOUS DRIVING CONDITIONS. THE NEXT TIME WE MIGHT NOT BE AS LUCKY TO ESCAPE WITHOUT INJURY/DEATH.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349039,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD EVERYTHING REPLACED ON MY CAR FOR THE AIR SYSTEM. WHEN I'M TRAVELING THE AIR SEEMS TO WORK FINE. WHEN THE CAR IDOL'S FOR MORE THAN LIKE 5 MIN THE AIR STARTS BLOWING WARMER AND WARMER. HAD THE CAR TAKEN IN MORE THAN ONCE FOR THIS AND THEY HAVE REPLACED DIFFERENT THINGS. THE PROBLEM STILL KEEPS HAPPENING. I HAVE READ WHERE OTHER PEOPLE HAVE THE SAME PROBLEM. HAS THERE BEEN ANY FIX FOR THIS BEING I'M NOT THE ONLY ONE WITH THIS PROBLEM?",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349098,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT WHILE DRIVING 25-30 MPH, THE VEHICLE SHUTOFF WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED.  THE CONTACT CHECKED UNDER THE HOOD AND NOTICED THE COOLANT RESERVOIR WAS EMPTY. THE CONTACT PUSHED THE VEHICLE TO HER RESIDENCE. THE CONTACT STATED THAT THE NEXT DAY SHE NOTICED COOLANT MIXED IN WITH THE ENGINE OIL. THE CONTACT CALLED JACK GIAMBALVO MAZDA (2425 INDUSTRIAL HWY, YORK, PA 17402, (717) 755-2944) AND WAS INFORMED THAT THE FAILURE MAY BE THE WATER PUMP HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE FAILURE MILEAGE WAS 127,422. THE WATER PUMP WAS PREVIOUSLY REPLACED AT 61,000.",
        "vin": "JM3TB3MA3A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "04/06/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331680,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING, 40-45 MPH THE TRANSMISSION STARTS JERKING AND SHUTTERING.  FINALLY MAKES IT TO 5TH GEAR.  THEN DOES THE SAME THING WHEN SHIFTING FROM 5TH TO 6TH GEAR.  WHEN THIS HAPPENS THE ENTIRE SUV STARTS SHAKING AND JERKING.  FEAR COULD CAUSE LOSS OF CONTROL OF THE VEHICLE.  *TR",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324549,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED THAT WHILE THEIR SON WAS DRIVING APPROXIMATELY 30 MPH, THE VEHICLE STALLED WITHOUT ANY WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE WATER PUMP FAILED CAUSING COOLANT TO MIX WITH THE ENGINE OIL AND DAMAGED THE ENGINE. THE CONTACT THEN TOOK THE VEHICLE TO QUIRK MAZDA (99 MCGRATH HWY, QUINCY, MA 02169, (617) 773-8000) WHO CONFIRMED THE PREVIOUS DIAGNOSIS. THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE REPAIR WAS NOT COVERED UNDER WARRANTY OR RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 108,000. VIN NOT AVAILABLE",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309001,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED WHILE DRIVING AT 5 MPH AROUND A ROUNDABOUT, THE PASSENGER'S SIDE FRONT TIRE DETACHED INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TOWED TO MODERN MAZDA,68 WATERBURY RD, LJ CT 06787 BUT WAS NOT DIAGNOSED. THE DIAGNOSIS AND REPAIR WAS STILL PENDING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307816,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 1 MONTH AGO I NOTICED MY CAR MAKING A HISSING SOUND WHEN MY FOOT WAS ON THE BRAKE PEDAL AT A RED LIGHT OR STOP SIGN. IF I WAS A LONG RED LIGHT OR IN A DRIVE THRU FOR MORE THAN 5 MINUTES I NOTICED MY CAR WOULD BEGIN TO TREMBLE. THEN ABOUT A WEEK AGO I NOTICED IF I HAD TO BRAKE SUDDENLY, THE BRAKE PEDAL WAS VERY HARD TO PUSH DOWN MAKING IT ALMOST IMPOSSIBLE TO STOP.  I TOOK THE CAR TO THE DEALER ON 2/3/2020 AND THE TECHNICIAN MENTIONED THAT THEY HAVE BEEN HAVING PROBLEMS WITH THE BRAKE BOOSTER.",
        "vin": "JM3TB2MV4A0"
    },
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290243,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE NOISES COMING FROM THE FRONT TIRES, WHEN DRIVING. NO ONE COULD PINPOINT THE PROBLEM. BRAKE BOOSTER WENT OUT A COUPLE MONTHS LATER.",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278590,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2010 CX9 ABOUT A MONTH AGO AND GOT PULLED OVER LAST NIGHT FOR MY DRIVER SIDE HEAD LIGHT BEING OUT, I TOOK  IT TO THE SHOP AND WAS CHARGED $194 FOR THE BULB REPLACEMENT, BUT IT DID NOT WORK AND WAS CHARGED ANOTHER $130 FOR DIAGNOSTICS . THEY FOUND OUT THAT THE BALLAST HAS BLOWN OUT DUE TO CONDENSATION IN THE HEADLIGHT AND NOW THEY ARE GOING TO CHARGE ME AGAIN FOR THE BALLAST AND LABOR",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/03/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277789,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULSATES WHILE BRAKING WHILE DRIVING FAST OR AT SLOWER SPEEDS. THE STEERING WHEEL DOES NOT SHAKE. THE BRAKE PEDAL DOES NOT PULSATE. THE VEHICLE BRAKES WERE CHANGED SEVERAL TIMES WITH NEW ROTORS AND PADS ON ALL FOUR TIRES. I NOTICED THERE WAS A RECALL ON LOWER CONTROL ARMS #15V-451. IT ONLY WAS INSPECTED AT THE TIME OF RECALL BUT NEVER CHANGED. COULD IT BE POSSIBLE THAT THEY ARE NOW WORN AND CAN BE CHANGED PER THE RECALL.*DT",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270889,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE LESS THAN 5 MPH, IN LINE, AFTER PICKING UP KID FROM SCHOOL. ALL SIDE CURTAIN AIR BAGS EXPLODED/DEPLOYED, FOR NO REASON. VEHICLE WAS NOT HIT. OTHER DRIVERS HEARD AND WITNESSED THE EXPLOSION/DEPLOYMENT OF THE AIRBAGS. PULLED CAR TO SIDE AS BEST AS POSSIBLE, AS THE AIRBAG CURTAINS COMPLETELY BLOCKED THE SIDE WINDOWS.",
        "vin": "JM3TB2MV1A0"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265292,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A HIGHWAY GETTING OFF AN EXIT, AND I HAD MY KIDS IN MY CAR AND ALL OF A SUDDEN AS I AM SLOWING DOWN TO COME TO A STOP TO TURN OFF THE EXIT MY CAR STEERING AND BRAKES LOCKED UP AND EVERYTHING SHUT DOWN. LUCKILY I LIVE IN WALKING DISTANCE TO THE EXIT RAMP BECAUSE SOMEONE STOPPED AND HELPED ME PUSH MY CAR TO MY HOUSE. THEY HAD TO PUT IT IN NEUTRAL BUT IT WAS EXTREMELY HARD TO MOVE THE STEERING WHEEL. NEVER HAD ANY ISSUES WITH LEAKS OR ANYTHING LIKE THIS. THE CAR SMELLED LIKE ANTIFREEZE AND WAS RUNNING HOT. I LET IT COOL OFF. IT WAS THE WATER PUMP THAT WAS LEAKING AND WENT OUT. IT WAS NOT ABLE TO BE DRIVEN. I RESEARCHED THIS PROBLEM WITH THIS MAKE AND MODEL AND THERE IS A LAWSUIT ABOUT THIS EXACT ISSUE. THERE ARE ALL KINDS OF COMPLAINTS AND THERE DEFINITELY SHOULD BE A RECALL.",
        "vin": "JM3TB3MA9A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256003,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A CITY STREET, AND WITHOUT ANY INDICATION THAT SOMETHING WAS WRONG, ALL OF A SUDDEN THREE WARNING LIGHTS CAME ON, ENGINE LOST POWER, ACCELERATOR, BRAKES AND STEERING WERE UNRESPONSIVE.  I AM LUCKY I COULD MANAGE TO GET INTO A TURN LANE AND STOP USING THE EMERGENCY BRAKE.  CAR WAS TOWED TO MAZDA.  TOLD WATER PUMP FAILED AND NOW COOLANT IS MIXED WITH ENGINE OIL, ENGINE LIKELY RUINED.  THE CAR HAS 66,000 MILES ON IT.  INTERNET RESEARCH SHOWS THIS IS A KNOWN PROBLEM ON CX-9S AND MAZDA DID NOT ISSUE RECALL.   IS IT SAFE FOR THESE CARS TO BE ON THE ROADS?  SEE  HTTPS://WWW.CARCOMPLAINTS.COM/NEWS/2019/MAZDA-WATER-PUMP-LAWSUIT.SHTML",
        "vin": "JM3TB3MA5A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255475,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ME AND MY HUSBAND WERE ON OUR WAY HOME FROM WORK. THE CAR SUDDENLY OVERHEATED AND WE LOST POWER ON I-35, WE WERE ABLE TO GET THE CAR TO AN EXIT AND WAS NEARLY HIT BY ANOTHER CAR DUE TO LOSS OF STEERING AND POWER. WE HAD THE CAR TOWED TO A MAZDA DEALERSHIP. THERE IS ENGINE COOLANT IN THE OIL AND WE ARE TOLD IT NEEDS A NEW MOTOR.",
        "vin": "JM3TB3MAXA0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240723,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE PEDAL BECAME VERY HARD TO PUSH. I ASSUME IT COULD BE THE BRAKE POWER BOOSTER OR BRAKE MASTER CYLINDER.",
        "vin": "JM3TB3MA3A0"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "03/09/2019",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11234654,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOYED AND WE [XXX]  [XXX]  PEOPLE ON BACK OF DRIVER SEATS AT THE TIME OF THE ACCIDENT....[XXX]  HAD A SURGERY FACE WA OPEN 7/3 OF AND INCH ON FACE [XXX]  HAD A TBI TO HEMATOMA SURGERY OF THE BRAIN ECT WILL SEND YOU PAPER WORK ON BOTH SURGERYS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228969,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ARE HARD TO PUSH, APPEARS SPONGY AND MAKES A HISSING NOISE WHEN PRESSURE APPLIED.",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228984,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE DRIVING AT ANY SPEED, THE BRAKES LOST POWER AND THE BRAKE PEDAL WAS DIFFICULT TO DEPRESS WITHOUT WARNING. THE CONTACT CALLED MAZDA OF CLEAR LAKE AT 281-823-5000 (LOCATED AT 20101 GULF FREEWAY, WEBSTER, TX 77598) AND WAS INFORMED THAT THE WARRANTY WAS EXPIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221945,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER WENT OUT. ALMOST CAUSING AN ACCIDENT BECAUSE THE BRAKES WENT STIFF. I ABSOLUTELY CAN NOT BELIEVE THIS ISN'T A RECALL. I GUESS IT TAKES A SERIOUS INJURY OR LAWSUIT TO BECOME A LAWSUIT. I WAS TOLD BY MECHANIC TI HAVE TO HAVE REPAIRS AT DEALER. DEALER IS IMPOSSIBLE TO GET A HOLD OF FOR AN APPOINTMENT. I TOLD THEM  NEEDS TO BE FIXED ASAP AND THEY BOOKED ME A WEEK OUT!! SO UPSET   I DROVE AND SUDDENLY BRAKES STIFFNESS. COULD BARELY APPLY PRESSURE",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220850,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I APPLY MY BRAKES IT SOUNDS LIKE THEY ARE RELEASING AIR, AND THEY SEEM TO BE HARDER TO APPLY THEM. IT ALSO MAKES THIS SOUND WHILE I AM STATIONARY APPLYING THE BRAKES. I HAVE 156K MILES ON THE CAR, IS THIS NORMAL?",
        "vin": "JM3TB2MA0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219521,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS NOTED BY MANY ON THIS SITE, I EXPERIENCED A SCARY BRAKE BOOSTER FAILURE.  COMPLETE LOSS OF POWERED BRAKES WHICH PUT MY WHOLE FAMILY IN DANGER.  THIS IS A FAMILY CAR AND I HAVE SMALL CHILDREN SO THIS IS APPALLING THAT MAZDA WOULD NOT ISSUE A RECALL FOR THIS PROBLEM.  I SEE THAT THERE WAS A TSB AND ASSOCIATED EXTENDED WARRANTY PERIOD FOR THIS ISSUE BUT AS MANY HAVE NOTED ON THIS SITE, THE TRUE FAILURE TENDS TO OCCUR AFTER THE 7 YEAR WARRANTY PERIOD.  I ACTUALLY STARTED NOTICING SOME ISSUES WITH THE BRAKING ON THIS VEHICLE YEARS AGO, BUT ASSUMED THAT IT JUST NEEDED NEW BRAKE PADS AND ROTORS AS THE CAR WAS GETTING OLDER.  IF I HAD RECEIVED SOME TYPE OF COMMUNICATION FROM MAZDA OR NHTSA, THEN I WOULD HAVE KNOWN THE TRUE ISSUE DURING THE EXTENDED WARRANTY.  I ONLY HAVE 77,000 MILES ON THIS CAR, BUT SINCE IT IS OLDER THAN 7 YEARS... MAZDA REFUSES TO ADDRESS THE PROBLEM OR TAKE ACCOUNTABILITY FOR THIS QUALITY DEFECT.  I PAID FOR THE REPAIR MYSELF.  MAZDA HAS LOST A LOYAL CUSTOMER.  SHAME ON THEM FOR PUTTING DRIVERS AND THEIR FAMILIES KNOWINGLY AT RISK AND NOT DOING THE RIGHT THING.",
        "vin": "JM3TB3MV2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219274,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PAD BECOME VERY HARD TO PUSH. I CAN'T STOP THE CAR AS USUAL.",
        "vin": "JM3TB3MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209774,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING THE VEHICLE FROM THE DEALERSHIP THAT I BOUGHT IT FROM THE POWER BOOSTER BRAKING SYSTEM IS HAVING MALFUNCTIONS I OWN THE VEHICLE FOR 8 MONTHS LOOKING INTO RECALLS ON THIS VEHICLE IT SHOWS THAT THEY WERE DOING RECALLS ON THIS SYSTEM FOR THIS CAR APPROXIMATELY 4 YEARS AGO AND NOW I BOUGHT THE CAR AND THEY'RE SAYING THAT IS OUT OF THE EXTENDED WARRANTY. IF I WOULD HAVE KNOWN THIS BEFORE I PURCHASE THE CAR I WOULD HAVE NEVER BOUGHT IT IT SEEMS TO BRAKE BOOSTER SEEMS TO HAVE A CRACKED THAT SEEMS TO LEAK AIR WHICH CAUSES THE BRAKES TO MALFUNCTION AND CAN CAUSE AN ACCIDENT I FEEL THIS IS A VERY SERIOUS SITUATION AT HAND HERE AND THAT I NOT KNOWING WHAT WAS THE ISSUE SHOULD NOT BE RESPONSIBLE FOR A PROBLEM THAT THE BAD FACTION DOES NO DOES EXIST AND SHOULD BE REPLACED BY THE MANUFACTURER OR FEES AND SERVICE",
        "vin": "JM3TB3MAO22"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208319,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE OVERHEATED WHILE DRIVING ON A HIGHWAY AT HIGH SPEED AND FAILED WITHOUT WARNING. AFTER INVESTIGATION IT WAS FOUND THAT WATER PUMP MALFUNCTIONED FORCING COOLANT INTO THE ENGINE. IT IS NOW COMPLETELY INOPERABLE AND THE CAR HAS ONLY AROUND 80,000 MILES ON IT. THIS IS A MAJOR SAFETY ISSUE! THE CAR WAS SERVICED AND OIL CHANGED JUST A FEW MONTHS BEFORE THIS HAPPENED. THIS IS A MAJOR DESIGN FLAW ON MAZDA'S PART, WHICH THEY SEEM TO KNOW ABOUT AND NEVER ISSUED A RECALL TO GET ALL THE CARS FIXED. REPLACING AN ENGINE IS NOT SOMETHING MOST FAMILIES HAVE THE BUDGET FOR OR EVEN THINK ABOUT WHEN THE CAR IS LESS THAN 10 YEARS OLD. THERE WERE NO WARNING SIGNS OF WATER PUMP FAILURE. MAZDA NEEDS TO WARN CX-9 OWNERS WITH TSB OR RECALL THE WATER PUMP. THE WATER PUMP IS NOT BURIED INSIDE THE ENGINE AND CANNOT BE VISUALLY INSPECTED. HAVING A VEHICLE SHUT OFF ABRUPTLY WHEN TRAVELING AT HIGH SPEEDS IS A SERIOUS RISK FOR BOTH DRIVER, VEHICLE OCCUPANTS AND SURROUNDING MOTORISTS. I HOPE NHTSA TAKES THIS COMPLAINT SERIOUSLY AND TAKES ACTION BEFORE A SERIOUS OR FATAL INJURY OCCURS.",
        "vin": "JM3TB3MV6A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192495,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE FOR MY MAZDA CX-9 HAS GONE BAD FOR THE THIRD TIME SINCE I HAVE OWNED THIS VEHICLE.  MOST RECENTLY THE TRANSFER CASE WAS BURNING CAUSING A POWERFUL SMELL WHICH WENT THROUGH MY ENTIRE HOUSE.  THE SMELL WAS SO BAD THAT I ACTUALLY CALLED THE FIRE DEPARTMENT TO VERIFY I DID NOT HAVE NATURAL GAS LEAK.    THIS IS A KNOWN ISSUE WITH THE CX-9 AND DEFECTIVE TRANSFER CASES.    MY LOCAL DEALERSHIP HAS ASSISTED ME AND TRIED TO REDUCE REPAIR COSTS AS MUCH AS POSSIBLE.  HOWEVER, MAZDA REFUSES TO FULLY COVER PART WHICH MOST LIKELY CAUSED MY TRANSMISSION FAILURE AS WELL IN AUGUST 2018.",
        "vin": "JM3TB3MA5A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191697,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON A BUSY STREET WHEN SUDDENLY THE CHECK ENGINE LIGHT CAME ON THE AC STOPPED COMING OUT COLD, AND THE CAR STOPPED ACCELERATING WOULD ONLY GO UP TO 20 MPH, THE CAR STARTED MAKING RATTLING NOISES AND I DROVE BY TO THE NEAREST PLACE TO STOP AND WATER FELL OUT OF THE FRONT BOTTOM RIGHT OF THE CAR.. THE WATER PUMP MESSED UP",
        "vin": "JM3TB2MA0A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170858,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JAN 12, 2019 WE WERE DRIVING HOME AND WITHOUT WARNING THE TEMPERATURE GAUGE SPIKED AND THE CHECK ENGINE LIGHT CAME ON.  THE ENGINE STOPPED AND I WAS ABLE TO GET THE VEHICLE OFF THE ROAD.  I LOOKED TO SEE THE COOLANT RESERVOIR WAS EMPTY.  I WAS ABLE TO REFILL IT, THINKING POSSIBLY THERE WAS A LEAK.  IT GOT US HOME SAFELY.  THE NEXT DAY, ENROUTE TO THE RADIATOR SHOP; THE SAME THING HAPPENED.  AFTER A TOW HOME, THEN A TOW TO THE RADIATOR SHOP AND EVENTUALLY A TOW HOME, IT WAS DIAGNOSED AS A WATER PUMP FAILURE AND NOW A NEW ENGINE IS THE ANSWER FOR THE REPAIR.        THERE WAS ABSOLUTLY NO WARNING TO THIS HAPPENING AND THE WATER PUMP IS INTERNAL.  I UNDERSTAND THAT THE PUMP CAN/WILL WEAR OUT.  I GET IT.  WHERE IT'S LOCATED IS A JOKE AND I'VE READ IT'S AT LEAST A $1500 - $2000 FIX, JUST FOR THE PUMP REPLACEMENT.  THE MAIN ISSUE IS THE NO WARNING WHATSOEVER!",
        "vin": "JM3TB3MA8A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165024,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSFER CASE WAS REPLACED AT 34,000 MILES AND NOW WE ARE HAVING TO REPLACE THE TRANSFER CASE AGAIN. ADDITIONAL TRANSMISSION DAMAGE MAY HAVE OCCURRED. MAZDA REFUSES TO STAND BEHIND THEIR PRODUCT AND ADMIT TO A DESIGN FLAW. THE FIRST TRANSFER CASE SMELLED LIKE PROPANE. THE SECOND TRANSFER CASE HAD GEAR GRINDING NOISE",
        "vin": "JM3TB3MAXA0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164034,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING BRAKING ISSUES WHILE DRIVING ON THE HIGHWAY AS WELL AS CITY STREETS  THE BRAKE PEDAL IS GETS HARD TO DEPRESS AND BRAKING DIMINISHES ALMOST COMPLETELY.  ACCORDING TO RESEARCH MAZDA HAS ALREADY IDENTIFIED THE PROBLEM EXISTS WITH THE POWER BRAKE BOOSTER. THERE IS A DEFECT IN THE RUBBER OF THE DIAPHRAM.  INSTEAD OF ISSUING A FULL RECALL MAZDA EXTENDED THE WARRANTY PERIOD.  MY CAR OF COURSE WAS JUST OUTSIDE THE WARRANTY PERIOD SO MAZDA WOULD NOT DO ANYTHING ABOUT IT.  THIS SEEMS LIKE A SERIOUS SAFETY COMPONENT THAT CAN CAUSE AN ACCIDENT AND KILL SOMEONE.  WE HAD MANY CLOSE CALLS BECAUSE OF THIS DEFECT IN THEIR PRODUCT THAT CAUSED OUR BRAKING TO BE ALMOST NON EXISTENT.  THE BRAKE BOOSTER WAS REPLACED ON OUR OWN DIME AND THE PROBLEM WAS FIXED.",
        "vin": "JM3TB2MV8A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "10/12/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162453,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V717000 (AIR BAGS). THE MANUFACTURER STATED THAT THE PART WAS NOT AVAILABLE AND DID NOT KNOW WHEN IT WOULD ARRIVE. THE DEALER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *TT  CONSUMER STATED THERE WAS NO FAILURE. *JB",
        "vin": "JM3TB3MA6A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156376,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER TRANSFER UNIT NEEDS TO BE REPLACED AND THE VEHICLE ONLY HAS 45,000 MILES ON IT.  MAZDA HAD ISSUED A VOLUNTARY EXTENDED WARRANTY OF THIS PART BUT ALTHOUGH MY VEHICLE IS WELL UNDER THE MILEAGE (90,000) MAZDA IS TELLING ME THAT IT IS OUT OF WARRANTY. MAZDA ISSUED THE EXTENDED WARRANTY BECAUSE THEY KNEW THERE WAS A PROBLEM WITH THE PART AND THAT IT WAS A POOR OR DEFECTIVE DESIGN.  THIS SHOULD HAVE BEEN A RECALL ISSUE NOT A WAIT AND SEE WHEN IT FAILS AND HOPEFULLY IT IS OUTSIDE OF OUR EXTENDED WARRANTY PERIOD.",
        "vin": "JM3TB3MV0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152899,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN HOUSTON HIGHWAY RUSH HOUR TRAFFIC ATTEMPTED TO APPLY BRAKES DUE TO TRAFFIC STOPPED AHEAD.  BRAKE PEDAL WAS VERY DIFFICULT TO PRESS AND MADE A HISSING NOISE.  AFTER ABOUT 20-30 YARDS WAS FINALLY ABLE TO BRING CAR TO A STOP NARROWLY AVOIDING AN ACCIDENT.  WHEN TOOK VEHICLE TO MAZDA DEALERSHIP WAS TOLD IT IS THE POWER BRAKE BOOSTER THAT NEEDS TO BE REPLACED.  SERVICE TECH STATED THIS WAS A KNOWN ISSUE WITH THE 2010 CX-9'S.  MAZDA ISSUED AN EXTENDED WARRANTY BUT CUSTOMERS WERE NEVER NOTIFIED SO THEY COULD GET THE DEFECTIVE PART REPAIRED.    MY VEHICLE ONLY HAS 83600 MILES, SO IT IS AVERAGE MILEAGE FOR AN 8 YEAR OLD CAR.",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133272,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUBBER SEALANT ON THE FRONT WINDSHIELD IS COMING LOOSE FROM THE CAR.   THE HEATER NOR THE AIR CONDITIONER IS WORKING. UDERNEATH THE DASHBOARD GET VERY HOT THAT I CAN DRIVE THE CAR",
        "vin": "JM3TB2MV9A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131702,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2010 MAZDA CX9 WHEN A LOUD BANG HAPPENED.  I WAS ON A SIDE ROAD AND STOPPED IMMEDIATELY, I COULD NOT VISIBLY SEE ANY ISSUES.  I BEGAN TO DRIVE SLOWLY AND WITH EVERY ROTATION THE NOISE CONTINUED. LUCKILY I WAS NEXT A A GARAGE AND THEY DETERMINED IT WITH THE POWER TRANSFER UNIT (CASE). THEY HAD TOLD ME THIS IS A VERY COMMON ISSUE AND THAT MAZDA EVEN KNEW OF THIS ISSUE BUT NEVER HAD A RECALL PLACED.  AFTER RESEARCHING AND SEEING MULTIPLE YEARS OF THIS ISSUE FOR THE CX 9 AND EVEN AN EXTENDED WARRANTY SOMETHING HAS TO GIVE MAZDA.  BASICALLY THE FRONT TRANSFER CASE (OR POWER TRANSFER UNIT, PTU) IS TOO CLOSE TO THE EXHAUST SYSTEM AND GETS HEATED UP MORE THAN USUAL. THE GEAR LUBRICANT INSIDE GETS DETERIORATED A LOT FASTER AND BECOMES SLUDGE. IN THEORY GEAR LUBRICANT IN FRONT TRANSFER CASE&#12289;REAR DIFFERENTIAL&#12289;AND MANUAL TRANSMISSION CAN BE \"LIFE-TIME\" LUB UNDER A SUITABLE ENVIRONMENT, HENCE MAZDA AND FORD DON'T SPECIFY ANY RECOMMENDED MAINTENANCE INTERVAL FOR GEAR LUBRICANT REPLACEMENT AND DON'T EVEN BOTHER TO DESIGN A DRAIN HOLE FOR IT! BUT SINCE THE GEAR LUB ACTUALLY GETS HEAT UP SO OFTEN, IT CAUSES PROBLEMS AND MAKES THE FRONT TRANSFER CASE EVENTUALLY FAILED DUE TO SLUDGE ISSUE.  I HAVE READ 100'S OF COMPLAINTS AND STILL NO RESOLUTION EXCEPT FOR THE PEOPLE THAT CLAIM THEY CALLED MAZDA DIRECTLY AND AFTER MONTHS OF COMPLAINTS WERE HANDLED INDIVIDUALLY.  I HAVE BEEN A LIFETIME MAZDA OWNER FROM MY FIRST 1986 MAZDA 323 AND THIS HAS BEEN A NIGHTMARE.  A RECALL HAS TO BE MADE WITH THIS NUMBER OF COMPLAINTS AND ISSUES.  $3000 OUT OF POCKET FOR A KNOWN ISSUE WITH YOUR VEHICLE IS UNACCEPTABLE",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131814,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER FAILED AT 90K MILES. PEDAL IS EXTREMELY HARD TO PUSH AND HAS LITTLE BRAKE FORCE. ALONG WITH A LOUD HISSING NOISE FROM BRAKES. MAZDA SAID IT WAS PART THEIR SPECIAL SERVICE WARRANTY AND WOULD CHARGE FULL RATE TO FIX.",
        "vin": "JM3TB3MA9A0"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130651,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTROL ARM/BALL JOINTS- HAD TO HAVE REPLACED AGAIN ON 9/21/18 AFTER BOTH BEING REPLACED ON 1/12/2016 AS PART OF A RECALL.  FEELS LIKE THE CAR IS TRYING TO STEER ITSELF AND NOT VERY SAFE TO DRIVE. AND THEN HAVE TO PAY FOR ANOTHER ALIGNMENT WHICH I JUST HAD DONE AS WELL. THERE SHOULD BE SOME TYPE OF WARRANTY ON A RECALL REPAIR.",
        "vin": "JM3TB3MVXA0"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129881,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OUR 2010 CX-9 WITH 99,000 MILES THE MAZDA DEALER IN UNION NJ BECAUSE OF A NOISE IN THE CAR AND WERE TOLD THAT THE REAR SUBFRAME HAS ROTTED OUT AND IS DESTROYING THE REAR DIFF MOUNTING BOLTS. WE WERE ALSO TOLD THE EXHAUST SYSTEM IS ALSO ROTTED OUT AND THE VEHICLE IS UNSAFE TO DRIVE. IF WE GO OVER A POT HOLE, THE WHOLE UNDERCARRIAGE OF CAR CAN FALL OUT. THIS CAR WAS NOT KEPT AT THE BEACH AND WELL MAINTAINED.",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112905,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS ALWAYS SERVICED REGULARLY.  ONE DAY I WAS ABOUT TO GET ON A BUSY HIGHWAY INTO BOSTON JUST BEFORE RUSH HOUR, WHEN MY CAR SUDDENLY MADE A LOUD KNOCKING NOISE IN THE ENGINE.  I IMMEDIATELY PULLED OVER AND THEN THE CAR SHUT OFF.  NO LIGHTS EVER CAME ON BEFOREHAND AND NO LEAKING OF FLUIDS EVER HAPPENED BEFORE INCIDENT.  HAD IT TOWED TO MAZDA DEALER, WHO AT FIRST TOLD ME THEY WOULDN'T BE ABLE TO EVEN LOOK AT IT FOR 6 DAYS.  FRIEND WORKED THERE AND GOT MECHANICS TO LOOK AT IT RIGHT AWAY.  THEY SAID THE WATER PUMP WAS GONE AND IT WOULD COST $3500 TO FIX IT.  THE WORST PART OF IT WAS, THAT ACCORDING TO THE DEALERSHIP, THEY KNOW THAT THERE IS A FLAW WITH WHERE THE WATER PUMP IS LOCATED IN THE ENGINE, AND THAT BECAUSE OF THIS THE ENGINE WAS MOST LIKELY GONE AS WELL.  IN THEIR WORDS, THEY HAVE REPLACED MANY WATER PUMPS IN THESE SAME SITUATIONS OVER THE YEARS, AND ONLY ONE CAR DIDN'T NEED A NEW ENGINE.  THEY RECOMMENDED FIXING THE WATER PUMP, THEN PUTTING IN A NEW ENGINE--$10,000 WORTH OF WORK.  WE BOUGHT THIS CAR CERTIFIED PRE-OWNED FROM A DEALERSHIP.  IT ONLY HAD 108,000 MILES ON IT AND THE EXTENDED WARRANTY HAD JUST ENDED 8 MONTHS BEFORE.  I HAVE NUMEROUS OTHER CARS IN MY LIFETIME AND NEVER HAVE I HAD TO REPLACE AN ENTIRE ENGINE, JUST BECAUSE THE WATER PUMP WAS GONE!  THIS CAR SHOULD HAVE BEEN WORTH ABOUT $9K-$11K FOR RESALE, AND INSTEAD MAZDA WANTED TO GIVE US $2K TOWARDS A DOWN PAYMENT FOR LEASING ANOTHER OF THEIR CARS.  THEY GAVE US A RATE THAT THEY CLAIMED WAS A SPECIAL ONE, HOWEVER, I FOUND OUT I COULD GET AN EVEN BETTER ONE ONLINE MYSELF!  WHEN WE CALLED THEM ON THIS AND SAID WE WERE TIRED OF DEALING WITH THIS, THEY TOLD US THEY WOULDN'T TALK WITH US ANYMORE.  VERY DISAPPOINTING TO A FAMILY THAT CAREFULLY WATCHES ITS MONEY AND BUDGETS FOR EMERGENCIES, BUT WEREN'T PREPARED TO NEED AN ENTIRELY NEW CAR BEFORE THE OTHER WAS EVEN PAID FOR!  SO UNFAIR!",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112186,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 65MPH ON HIGHWAY WITH FAMILY THE VEHICLE SHUT DOWN, ENGINE LIGHT APPEARED AND WE NEARLY WERE STRUCK BY ANOTHER VEHICLE WHEN PULLING OVER. CX-9 WAS TOWED 75 MILES TO MECHANIC WHO INFORMED US COOLANT ENTERED THE ENGINE FROM FAILED WATER PUMP AND ENGINE NEEDS REPLACEMENT ($4000).  MAZDA SERVICE MANAGER CONFIRMED THIS IS NOT UNCOMMON AND CONFIRMED ENGINE WILL NEED TO BE REPLACED.   WHEN RESEARCHING CX-9 WATER PUMP FAILURE ONLINE I FOUND MANY DISTURBING TESTIMONIALS OF OTHER CX-9 OWNERS WITH SIMILAR EXPERIENCES. THERE WERE NO WARNING SIGNS OF WATER PUMP FAILURE.     MAZDA NEEDS TO WARN CX-9 OWNERS WITH TSB OR RECALL THE WATER PUMP. THE WATER PUMP IS NOT BURIED INSIDE THE ENGINE AND CANNOT BE VISUALLY INSPECTED. HAVING A VEHICLE SHUT OFF ABRUPTLY WHEN TRAVELING AT HIGH SPEEDS IS A SERIOUS RISK FOR BOTH DRIVER, VEHICLE OCCUPANTS AND SURROUNDING MOTORISTS.  I HOPE NSTSA TAKES THIS COMPLAINT SERIOUSLY AND TAKES ACTION BEFORE A SERIOUS OR FATAL INJURY OCCURS.",
        "vin": "JM3TB3MV2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110806,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED GETTING A HISSING SOUND FROM THE BRAKE BOOSTER AND A HARD TO DEPRESS BRAKE PEDAL.",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093538,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MAZDA CX-9 IS A 2010 WITH ABOUT 62000 MILES ON IT. I WAS DRIVING ON A HIGHWAY WITH 70 MPH. SUDDENLY, I HEARD NOISE AND CRACK. SHORTLY, AFTER, THE CAR LOST POWER AND IT WON'T GO FORWARD. TOOK IT TO THE MECHANIC AND THEY FOUND THE POWER TRANSFER UNIT BROKEN. REPLACEMENT WAS $3000. WENT BACK TO MY PAPERWORK. FOUND THAT PTU IS UNDER EXTENDED WARRANTY PROGRAM INCLUDING ONLY 84 MONTHS OR 90000 MILES. I SENT REIMBURSEMENT TO THE MAZDA AND THEY REFUSED CLAIMING THAT THE CAR WARRANTY IS MORE THAN 84 MONTHS (WHICH IS NOT TRUE). IT IS REALLY DISAPPOINTING THAT I HAVE TO HIRE A LAWYER TO GET THIS FLAW IN MAZDA'S DESIGN REIMBURSED. THE WARRANTY DOES NOT START ON JAN 1ST OF THE MANUFACTURING YEAR. I HAD TO PULL THE CARFAX TO PROVE THAT THEY CAR WAS PURCHASED AFTER APRIL OF 2010 TO PROVE THE 84 MONTHS WINDOW IS VALID. THEY HAVE THIS INFORMATION BUT THEY DECIDED TO PLAY IGNORANT. IN ANY CASE, THIS A MAJOR FLOW IN THE CX-9 DESIGN FOR THE PTU. THEY HAVE TO TAKE RESPONSIBILITY FOR SUCH FLOW AND THEY NEED TO BE ACCOUNTABLE FOR SUCH SLOPPINESS IN THEIR PRODUCT THAT ENDANGERS LIVES ON THE STREET. ALL THESE CARS SHOULD BE TAKEN OFF THE STREETS.",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082334,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE COMPLETELY LOST POWER.  TIMING CHAIN FAILURE IN DOWNTOWN AREA / TRAFFIC, CAUSING FAILURE OF HEAD GASKET.  WARNING AND IMMEDIATE FAILURE WHEN IN MOTION IN BUSY DOWNTOWN MIDDAY TRAFFIC.",
        "vin": "JM3TB2MA1A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081514,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS REGARDS TO THE MAZDA BRAKE BOOSTER ISSUE FOR THE 2010-2011 CX-9. THIS ISSUE REVOLVES AROUND CUSTOMER NOTIFICATIONS. THE EXTENDED WARRANTY TIME IS 7 YEARS OR 90,000 MILES. MAZDA MAILED OUT A SINGLE LETTER TO OWNERS. MAZDA STIPULATED THAT THE EXTENSION WAS TRANSFERABLE, HOWEVER THEY MADE NO EFFORT TO NOTIFY ANY OF THE NEXT OWNERS, NOT A LINK ON THEIR WEBSITE EVEN. THIS MEANS THAT OWNERS WHO DID NOT GET NOTIFIED WILL NOT KNOW OF THIS ISSUE AND MAY SPEND ABOUT $600-800 TO FIX THE ISSUE EVEN THOUGH IT IS COVERED (OUTSIDE A DEALER). DUE TO THIS BEING A SAFETY ISSUE WITH BRAKES NOT PERFORMING AS EXPECTED DURING NORMAL USE, THIS SHOULD HAVE BEEN A RECALL. ANY SIGNIFICANT LOSS OF BRAKING POWER DURING NORMAL USE WILL CAUSE ANY NORMAL HUMAN TO PANIC. THE NHTSA ISSUED THIS WHILE THINKING AS ENGINEERS, NOT TAKING INTO ACCOUNT HOW THE HUMAN FEELS BEHIND THE WHEEL OF A CAR THAT IS NOT STOPPING. THERE ARE MULTIPLE REPORTS OF PEOPLE NEARLY GETTING INTO ACCIDENTS DUE TO THIS AT HTTPS://WWW.CARCOMPLAINTS.COM/MAZDA/CX-9/2012/BRAKES/BRAKE_POWER_BOOST_UNIT_FAILURE.SHTML AND OTHER SITES AROUND THE INTERNET. WILL IT TAKE INJURY OR DEATH FOR THE NHTSA TO ACT? MY OWN CX-9 STARTED HAVING ISSUES, AND WHEN I TOOK IT IN, THE DEALER STATED THE COST, AND DID NOT EVEN MENTION COVERAGE. I HAD TO LOOK IT UP. MOST PEOPLE WOULD NOT HAVE. MY CAR IS 2,500 MILES OUT OF THE EXTENSION AND MAZDA WOULD NOT COVER IT. THIS IS RIDICULOUS. IF I DIDN'T HAVE THE MONEY TO FIX IT, AND GOT KILLED, WOULD MAZDA BE FORCED TO RECALL?",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "12/15/2017",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073776,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE DRIVING UNKNOWN SPEEDS, A SMOKE ODOR ENTERED THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRANSFER CASE BEARING WAS BURNT DUE TO SLUDGE. THE CONTACT CALLED MAZDA OF MILFORD AT 866-981-2838 AND WAS INFORMED TO BRING THE VEHICLE IN FOR DIAGNOSTIC TESTING. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 137,000. *TT  *TR",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/13/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072742,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HISSING SOUND NEAR BRAKE PEDAL FOLLOWED BY EXTREMELY HARD PEDAL AND MUCH EFFORT TO STOP.",
        "vin": "JM3TB2MA4A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062879,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE FAILURE CABIN FILLING WITH ACID SMOKE FROM BEARING FAILURE IN TRANSFER CASE, CAR WAS DRIVEN TO LOCAL GARAGE FOR REPLACEMENT NOT COVERED EVEN THOUGH THERE IS NUMEROUS FAILURES WITH THIS CAR. MAZDA HAS MADE NUMEROUS CHANGES IN THIS DESIGN SO WHY ISNT THERE A RECALL . THIS HAPPENED WHEN MY CAR WAS AT A STOP SIGN.THIS IS A COMMON PROBLEM WITH THIS CAR THAT COULD LEAD TO SOMEONE    TO PANIC WITH SUCH HORRIBLE SMELLING SMOKE.",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062731,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR WHEN THE TRANSFER CASE ON MY 2010 CX9 BROKE AT 109.000 MILES AND SPLINE GEAR IS WORN OUT. OVERWHELMING OIL SMELL COMING BACK INTO CAR ALONG WITH HORRIBLE GRINDING NOISE. TOOK TO MY MAZDA DEALER, MAZDA WASN'T SURE IF THEY COULD FIX, SUGGESTED REPLACING TRANSMISSION.   MAZDA TRIED TO FIX THE TRANSFER CASE ISSUE, BUT COULD HAVE HUMMING NOISE. INSTEAD OF HUMMING NOISE, AFTER ONE DAY OF RECEIVING MY CAR BACK, TRANSMISSION IS FAILING.  ALREADY PUT $2200 INTO THIS REPAIR, BUT WAS TOLD THE TRANSMISSION COULD FAIL AT ANY TIME.  I FIND THIS HARD TO BELIEVE AFTER I PUT MY CAR IN FOR SCHEDULED MAINTENANCE ALL THE TIME AND TAKE GREAT CARE OF MY CAR.",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/19/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055542,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO!    THIS MORNING ON 19 DECEMBER 2017,  MY WIFE WAS DRIVING IN A CITY STREET GETTING READY TO CROSS A MAJOR INTERSECTION.  THE LIGHT TURNED YELLOW AND SHE BEGAN TO BRAKE.   AT FIRST THEY FELT NORMAL, BUT THEN THE PEDAL WENT DOWN AND THE BRAKES FELT REALLY HARD AND THE HISSING STARTED, ALMOST RUNNING INTO THE BACK OF THE CAR IN FRONT OF HER.  SHE PULLED OVER AND CALLED ME.      WHEN I ARRIVED, I COULD HEAR A HISSING SOUND AS IF AIR WAS LEAKING FROM SOMEWHERE NEAR THE BRAKE BOOSTER.  I AM AN AIR FORCE AIRCRAFT MECHANIC AND HAVE BEEN WORKING ON MY OWN CARS FOR OVER 40 YEARS.  I SEARCHED ALL OVER THINKING THAT A HOSE MIGHT HAVE TORN OR PULLED OUT OF THE CHECK VALVE, BUT I COULD NOT SEE ANYTHING OBVIOUS.  THE BRAKE FLUID LEVEL WAS FINE, SO I DROVE THE CAR HOME AND BEGAN TO SEARCH THE INTERNET.    I FOUND THIS WEBSITE:  HTTP://WWW.MAZDAPROBLEMS.COM/TRENDS/BRAKE-BOOSTER-FAILURE/ AND FOUND OUT THAT MAZDA HAVE KNOWN ABOUT THE ISSUE FOR YEARS.  I'M REALLY UPSET THAT THEY WOULD NOT MAKE A RECALL ON SOMETHING LIKE THIS, SINCE IT AFFECTS BRAKE RELIABILITY AND COULD CAUSE AN ACCIDENT, INJURY OR DEATH!!!    I'VE CONTACTED THE DEALERSHIP:  HTTP://WWW.ELDORADOMAZDA.COM/ TO VERIFY IF IT WOULD BE COVERED, AND THEY TOLD ME THAT IT WAS NOT.  WHEN I INQUIRED ABOUT WHY WEREN'T OWNERS NOTIFIED OF THIS POSSIBLY LETHAL SITUATION, THEY COULD NOT PROVIDE AN INTELLIGENT ANSWER, OTHER THAN YOUR CAR IS TOO OLD AND IT HAS TOO MANY MILES. OUR VEHICLE BARELY HAS 92K MILES ON IT, AN AVERAGE OF 13K PER YEAR.  THEY STILL TOLD ME THAT THEY WOULD FIX IT, BUT THAT I'D HAVE TO PAY FOR IT .    THIS SITUATION IS ABSURD AND NEGLIGENT AND I FEEL THAT ANYTHING TO DO WITH BRAKES AND THEIR PERFORMANCE OR LACK THERE OFF SHOULD BE A  SAFETY RECALL AND OWNERS SHOULD NOT HAVE TO FIND OUT THE HARD WAY LIKE DAYS BEFORE CHRISTMAS OR AFTER AN ACCIDENT!!!     PLEASE, HELP US! :)    HOPE YOU HAVE A MERRY CHRISTMAS!",
        "vin": "JM3TB2MV9A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042857,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE BEEN PROMISED A REMEDY AND NOTHING HAD HAPPENED YET. I WAS EVEN ASKED TO GET IN FOR A MAINTENANCE AND THEY'VE TOLD ME (2CE THAT DAY) WERE GOING TO CHANGE THE PART BUT NOTHING HAD HAPPENED YET. THIS IS UNACCEPTABLE.",
        "vin": "JM3TB2MA5A0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039779,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE A MAZDA CX9 2010, I GOT NO INDICATION THAT THERE WAS A PROBLEM WITH MY WATER PUMP. THE CARE DID NOT OVER HEAT, IT DID NOT STALL AND I WAS NO STEAM COMING FROM THE CAR. I DROVE MY VEHICLE TO THE OTHER SIDE OF THE WATER MORE THAN 20 MILES FROM MY HOME, SO THAT I COULD GO TO WORK. IF IT WERE NOT FOR THE PHARMACIST AT MY JOB I WOULD HAVE GOTTEN IN MY CAR AND DROVE OFF. HE NOTICE A PUDDLE UNDER MY CAR AND ASKED ME TO COME OUTSIDE SO HE COULD INVESTIGATE THE SITUATION FURTHER. HE SAW WHERE THE FLUID WAS COMING FROM AND WENT UNDER THE CAR TO TOUCH THE FLUID AND FOUND THAT IT WAS MY ANTI-FREEZE. IF I KNEW I HAD A PROBLEM I WOULD HAVE NEVER DRIVEN THE CAR THAT FAR FROM HOME.  I GOT A QUOTE FROM THE DEALER THAT IT WOULD COST ME $2050 TO REPAIR THE WATER PUMP. AS I DID RESEARCH, I FOUND THAT THIS IS SOMETHING THAT GOES ON WITH THESE VEHICLES AND THERE IS NO REAL WAY AROUND HAVING TO PAY THE DEALER THAT TYPE OF MONEY TO REPAIR THE PROBLEM BECAUSE OF THE WAY THE PUMP IS PLACED INSIDE OF THE ENGINE CAVITY. AT THIS POINT I DO NOT KNOW WHAT TO DO BECAUSE I DO NOT HAVE THE MONEY FOR THIS TYPE OF REPAIR ON A VEHICLE THAT WAS DESIGNED TO SCREW ME OVER. I WISH I DID MY RESEARCH BEFORE BUYING THIS VEHICLE. IF I HAD THE CHANCE TO DO IT ALL OVER AGAIN I WOULD NOT PICK A VEHICLE THAT REQUIRES ONLY THE DEALER TO REPAIR IT. I THINK THAT THIS IS UNFAIR FOR ANY CONSUMER TO HAVE TO PAY THAT AMOUNT OF MONEY BECAUSE OF THE DAMAGE THE WATER PUMP HAS DONE TO THE ENGINE BECAUSE OF ITS PLACEMENT. I AM SO UPSET AND NOT HAPPY ABOUT HOW MY FIRST CAR (THAT I LOVE) EXPERIENCE HAS TURNED OUT.  I THANK GOD THAT I WAS NOT ON THE HIGHWAY. I COULD HAVE DIED THAT DAY.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033788,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 MAZDA CX 9. CONSUMER WRITES IN REGARDS TO DEFECTIVE TAKATA INFLATOR. *LD    UPDATED 10/23/2017*JS",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029995,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE CAME TO A SLOW STOP. THE CONTACT HEARD A HISSING NOISE COMING FROM THE BRAKE BOOSTER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO ED MORSE BAYVIEW CADILLAC (1240 N FEDERAL HWY, FORT LAUDERDALE, FL 33304 (888) 463-2950) WHERE IT WAS DIAGNOSED THAT THE BRAKE BOOSTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT OFFER ANY ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023572,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE REPLACED THE PASSENGER SIDE LOW BEAM LIGHT ON MY 2010 MAZDA CX-9 YEARLY FOR THE PAST 4 YEARS THINKING THE BULB WAS BLOWN.  ONLY TO HAVE THE SOCKET WIGGLE LOOSE SHORTLY AFTER INSTALLING THE BULB.  I'VE BEEN PULLED OVER AT NIGHT FOR THE 2ND TIME LAST WEEK FOR THE BULB BEING OUT - BUT I KNOW IT WAS ON WHEN I LEFT THE DRIVEWAY.   THE SOCKET DOESN'T HOLD THE BULB IN TIGHT.  YOU CAN TAP THE LENS AND GET THE BULB TO COME BACK ON (SOMETIMES) ONLY UNTIL YOU HIT ANOTHER POT HOLE - THEN EVENTUALLY THE BULB BLOWS AGAIN.  THERE ARE OVER 100 SIMILAR MAZDA COMPLAINTS - MOSTLY PASSENGER SIDE.  OBVIOUSLY THIS IS A MAZDA SAFETY ISSUE.  MY KIDS DON'T NEED TO HAVE THE ANXIETY OF THEIR MOM BEING PULLED OVER WHEN DRIVING THEM HOME AFTER DARK, BECAUSE REST ASSURED THE AMERICAN MADE POLICE CAR BLUE LIGHTS ALWAYS WORK!  I HAVE A CLEAN DRIVING RECORD SO LUCKILY I DON'T GET A TICKET AND JUST SENT ON MY WAY TO ONCE AGAIN FIX A BULB THAT ISN'T BROKEN!  THIS SHOULD BE A MAZDA RECALL BECAUSE IF I CAN'T GET A STICKER WITH A BULB OUT THEN IT'S A \"SAFETY ISSUE\"!   PLEASE HELP!",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020962,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA CX-9 WHEN APPLYING THE BREAKS, PEDAL AT ONE POINT DURING BREAKING PROCESS BECOMES SPONGY, AS PEDAL RESISTANCE APPEARS TO RELEASE. WHEN FOOT PRESSURE IS REMOVED FROM BREAK PEDAL AND REAPPLIED, BREAK PEDAL PRESSURE IS VERY HARD TO PRESS AND BREAKING EFFICIENCY IS DIMINISHED CONSIDERABLY AS THOUGH BREAK BOOSTER HAS FAILED.    BREAKING ISSUE APPEARS TO OCCUR PRIMARILY WHEN COMING TO A STOP AT REDUCED SPEEDS.   NOTICED ISSUE WITH RECENT CA HEAT WAVE, VEHICLE APPEARS UNSAFE TO OPERATE.   WITH WIFE PARTICIPATING AS A DRIVER IN CARPOOL, SHE JUST RECENTLY EXPERIENCED THE CONDITION AND IS CONCERNED THAT IT CAN RESULT IN AN ACCIDENT IF NOT ADDRESSED.    CERTAINLY APPEARS TO BE THE SAME ISSUE INDICATED HERE: HTTP://WWW.CARCOMPLAINTS.COM/NEWS/2014/GOVERNMENT-CLOSES-MAZDA-CX-9-BRAKE-PEDAL-INVESTIGATION.SHTML",
        "vin": "JM3TB3MV0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/20/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019343,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE PEDAL SUDDENTLY BECAME VERY HARD TO PUSH, LETS OFF A HISSING SOUND WHEN PUSHED AND TAKES A LONG TIME TO STOP. I WAS ON A CITY STREET COMING TO A STOP LIGHT AND WASN'T SURE MY CAR WAS GOING TO COME TO A STOP. I AM NOW LEARNING THROUGH RESEARCH THAT THIS WAS A PROBLEM MAZDA KNEW ABOUT BUT DIDN'T NOTIFY EVERYONE OF THE EXTENDED WARRANTY THEY OFFERED TO MAKE THE NECESSARY REPAIR. NOW, MY CAR DOESN'T QUALIFY FOR THE REPAIR AS IT ISN'T IN THE LIMITED EXTENDED WARRANTY MILEAGE THAT MAZDA OFFERED FOR THIS REPAIR. I JUST STARTED HAVING PROBLEMS WITH THIS ISSUE ON SUNDAY, AUGUST 20, 2017. SINCE I NEVER RECEIVED ANY NOTICE OF THIS BRAKE BOOSTER PROBLEM, HOW COULD I POSSIBLY HAVE KNOWN ABOUT THE EXTENDED WARRANTY AND HAD IT SERVICED DURING THAT TIME AND MILEAGE FRAME?",
        "vin": "JM3TB2MA8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/06/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013333,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PRESSING THE BRAKE PEDAL, IT GETS HARD TO PUSH LIKE PRESSURE IS BUILT UP AND YOU CAN'T STOP. WHEN YOU ARE ABLE TO DEPRESS THE BRAKE PEDAL FULLY TO COME TO A COMPLETE STOP,  YOU HEAR A HISSING SOUND AS IF AIR WAS LETTING AIR OUT OF THE TIRES. THE RESPONSE FOR SLOWING TO A STOP [WAS] MUCH LONGER AND UNLESS YOU PRESS THE PEDAL ALL THE WAY TO THE FLOOR, THE VEHICLE ROLLS.  IT IS UNSAFE TO DRIVE",
        "vin": "JM3TB3MA7A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012261,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE PEDAL BECOMES VERY HARD TO PUSH, LETS OFF A HISSING OR WHISTLING SOUND WHEN PUSHED AND TAKES A LONG TIME TO STOP. WHEN I CALLED THE DEALER THEY ADVISED IT WAS A KNOWN BREAK BOOSTER ISSUE. THE ISSUE HAPPENS MAYBE 1/4-1/2 OF THE TIME I AM TRYING TO BREAK. THE DEALER HAD ME BRING THE CAR IN- BUT THEN TOLD ME MY CAR DIDN'T QUALIFY FOR THE REPAIR AS IT WASN'T IN THE LIMITED EXTENDED WARRANTY MILEAGE THAT MAZDA OFFERED FOR THIS REPAIR. MY COMPLAINT IS - IF THIS IS A KNOWN SAFETY ISSUE WITH THE BREAKS NOT WORKING PROPERLY- WHY IS THIS NOT A RECALL AND JUST A LIMITED WARRANTY- HOW CAN THEY GET AWAY WITH THAT? ALSO, HOW CAN THEY THEN NOT NOTIFY ALL THE OWNERS OF THE POTENTIALLY AFFECTED VEHICLES OF THE LIMITED WARRANTY SO THAT WE CAN BRING THE CAR IN AT THAT TIME FOR REPAIRS- INSTEAD OF ONLY WAITING UNTIL A CUSTOMER HAS A COMPLAINT ON THE ISSUE.",
        "vin": "JM3TB3MV2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012162,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES HAVE A HISSING NOISE AND AND ARE HARD TO BRAKE WHEN I PUSH THE BRAKE PEDAL. THE SERVICE DEPT TELLS ME THAT THE BRAKE BOOSTER IS BAD AND NEEDS REPLACEMENT. ($800)THESE ARE SUPPOSED TO LAST THE LIFE OF THE CAR. I HAVE JUST OVER 100, 000 MILES ON IT. I HAVE A 2010 MAZDA CX-9. I WAS NEVER NOTIFIED THAT MAZDA HAD THIS WIDESPREAD PROBLEM, THAT THE GOVERNMENT WAS INVESTIGATING IT, OR THAT MAZDA WAS OFFERING A \"SPECIAL SERVICE PROGRAM\"  THAT WOULD HAVE COVERED THIS REPAIR WHILE IT WAS UNDER 90,000 MILES. IT WAS IN MOTION WHEN I I NOTICED THIS PROBLEM LAST THURSDAY  WHILE DRIVING ON CITY STREETS. IT IS NOW IN SHOP.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011860,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS AT ABOUT 87000 MILES, THE BREAKS STARTED MALFUNCTIONING WHILE DRIVING ON THE HIGHWAY TEXAS 35 I HAVE TO PRESS HARD ON THE PEDALS IN ORDER FOR THE CAR TO STOP[ I DO HEAR KIND A LIKE A ZIZZLE WHEN I PRESS ON THE BREAKS BUT EVEN IF I PRESS HARD THE PEDAL TO STOP IT STILL KEEPS GOING FOR ABOUT 3 TO 4 FEET.",
        "vin": "JM3TB2DA8B0"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005438,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR TO DEALER 2-3 TIMES FOR THE BRAKES, WAY BEFORE MY WARRANTY WAS ANY WHERE NEAR EXPIRING, BECAUSE I KEPT HEARING A GRINDING SOUND.   THEY KEPT TELLING ME NOTHING WAS WRONG, THAT MY BRAKES HAD SOME GRAVEL ON THEM AND THEY JUST CLEANED THEM.  I DON'T TRAVEL ON DIRT ROADS OR ANYTHING, CITY ROADS/HIGHWAYS.  NO OUT OF TOWN TRAVEL AT ALL, ACTUAL ONLY IN TOWN TRAVEL, HOME/WORK.  MY 2ND CONCERN IS, WHILE DRIVING SOMETIMES MY SPEED SEEMS TO SHIFT, AS IF THE GEARS ARE SHIFTING.  3RD CONCERN IS, I RECEIVED A RECALL NOTICE, DON'T RECALL WHAT IT WAS ABOUT BUT I TOOK IT TO THE DEALERSHIP AND I WAS TOLD THEY DONE THAT WORK LAST TIME I CAME IN BUT I DON'T BELIEVE IT WAS DONE, SINCE THEY HAVEN'T BEEN HONEST WITH ME BEFORE.  THEY DIDN'T EVEN LOOK AT THE LETTER.  IF I RECALL CORRECTLY BRAKE COMPLAINTS/ SERVICE STARTED 2011 OR 2012 TO 2014....",
        "vin": "JM3TB2MADAD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005461,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STOPPING, BRAKE PEDAL BECAME HARD TO DEPRESS AND CAR WOULD NOT BRAKE EFFECTIVELY. BRAKING ACTION BECAME DEGRADED, TIME FRAME WAS ONE DAY. IT WAS INTERMITTENT, BUT WOULD NOT STOP EFFECTIVELY CREATING A HAZARD. UNABLE TO JUDGE STOPPING DISTANCE DUE TO BRAKE DEGRADATION. TOOK TO MECHANIC WHO REPLACED BRAKE BOOSTER, SAID MOST LIKELY A VACUUM ISSUE. SAID THIS IS A RECALL ITEM ON SAME PART FOR FORD ESCAPE 2010 AND LINCOLN MKZ. FORD OWNS MOST OF MAZDA AND THE CX-9 USES FORD MADE PARTS. UPON RESEARCH, MAZDA AND NHTSA BOTH KNOW OF THE ISSUE, BUT HAVE NOT ISSUED A RECALL NOTICE. FORD HAS WARRANTIED THE SAME PART FOR 150,000 MILES, MAZDA HAS NOT ISSUED RECALL FOR SAME PART WITH SAME PROBLEM AND RISK. UPON RESEARCH OF ONLINE BOARDS REGARDING THE SAME PROBLEM, THERE HAVE BEEN SEVERAL REPAIRS BY MAZDA OWNERS FOR THE SAME PROBLEM. THIS FAILURE ON MY CAR IS AT 98,000. WITH THE TAKATA AIRBAG RECALL, AND NOT BEING ABLE TO GET REPLACED AND THE BRAKE BOOSTER PROBLEM, PRESENTS SIGNIFICANT HAZARD TO MAZDA CX-9 OWNERS FOR RISK OF REAR END COLLISIONS DUE TO BRAKE BOOSTER FAILURE AND TAKATA AIRBAG DEPLOYMENT POTENTIALLY CAUSING SERIOUS HARM OR DEATH TO THE DRIVER AND PASSENGER. I AM WANTING NHTSA TO MOVE FORWARD PAST THE MONITORING PHASE AND ASK FOR A RECALL OR WARRANTY OF THE VACUUM BOOSTER FAILURE AT HIGHER MILEAGE AS FORD HAS ALREADY DONE THE SAME FOR THEIR VEHICLES FOR THE SAME PART.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000665,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL BECAME DIFFICULT TO DEPRESS AND IT WAS DIFFICULT TO STOP THE VEHICLE ON MORE THAN ONE OCCASION. MAZDA OF NEWPORT NEWS, VIRGINA WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS A FAULTY BRAKE BOOSTER ON THE VEHICLE THAT WAS UNDER RECALL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 114,000.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983227,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE THE VEHICLE WAS UNDERGOING ROUTINE MAINTENANCE, THE MECHANIC NOTICED THAT THE CONTROL ARMS WERE LOOSE PREMATURELY. THE MECHANIC REPLACED THE CONTROL ARMS AND THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION), BUT THE CONTACT WAS NOT NOTIFIED BY THE DEALER NOR THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "JM3TB3MVXA0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980796,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WEIGHT SENSOR FOR THE FRONT SEAT IS DEFECTIVE. MY SON IS 105 LBS. HE HAS JUST STARTED SITTING ON THE FRONT SEAT. I NOTICE THAT THE \"AIR BAG OFF\" LIGHT KEEPS GOING ON AND OFF WHILE THE CAR IS IN MOTION. ACCORDING TO THE MANUAL, THE WEIGHT LIMIT IS 66 LBS ABOVE WHICH THE PASSENGER AIRBAG SHOULD BE ACTIVE. MANUAL STATES THE WEIGHT ON PAGE 2-45 AND ALSO ON OTHER PAGES.",
        "vin": "JM3TB2MA1A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970481,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDENLY HAD TROUBLE BRAKING, DIFFICULT TO PUSH THE BRAKE DOWN AND STARTED TO MAKE A HISSING SOUND.  IT WAS AN UNEASY EXPERIENCE AND LUCKILY MY KIDS WEREN'T IN THE CAR.",
        "vin": "JM3TB3MA1A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "06/27/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967700,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3TB3MV7A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "07/16/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957190,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION).  THE CONTACT WAS UNABLE TO RECEIVE THE REPAIR BY THE DEALER WITHIN A REASONABLE TIME FRAME. THE DEALER INDICATED THAT ADDITIONAL REPAIRS HAD BEEN REQUIRED TO MANEUVER VARIOUS PARTS TO COMPLETE THE REPAIR AND THAT A COST WOULD BE APPLIED IN ADDITION TO THE RECALL. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT WAS UNCERTAIN OF WHEN THE VEHICLE MAY BE REPAIRED BY THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  ..UPDATED 05/23/17 *BF    COSUMER STATES THE MATTER HAS BEEN RESOLVED AT NO ADDITIONAL COST.    *CN",
        "vin": "JM3TB3MV3A0"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10957366,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE VEHICLE'S INDICATORS SHOWED THAT ALL SYSTEMS WERE FUNCTIONING CORRECTLY; HOWEVER, THE AIR BAGS AND SEAT BELTS WERE MALFUNCTIONING. WHILE DRIVING APPROXIMATELY 65 MPH, THE CONTACT STRUCK A BARREL AND THE FRONT END OF THE VEHICLE BECAME DETACHED. THE CONTACT STRUCK THE STEERING WHEEL AND DASHBOARD. THE AIR BAGS DID NOT DEPLOY. THE CONTACT RECEIVED INJURIES TO THE HEAD AND CHEST, BUT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS REPAIRED; HOWEVER, THE AIR BAG REPAIR WAS NOT PROVIDED DUE TO PARTS UNAVAILABILITY. THE APPROXIMATE FAILURE MILEAGE WAS 18,000. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3MV1A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956144,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 05/31/17*LJ    *CN",
        "vin": "JM3TB2MA0A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2016",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937652,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS). HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JM3TB3MV0A0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "08/08/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927114,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADREST LEANS TOO FAR FORWARD CAUSING STRAIN ON ENTIRE BODY ESPECIALLY ON BACK AND NECK. BOUGHT AFTER MARKET HEADREST AND REPLACED IT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918153,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I WAS INFORMED OF A RECALL ON THE PASSENGER SIDE FRONT AIRBAG IN JULY 2016 AND INSTRUCTED \"UNTIL THIS REPAIR IS PERFORMED, DO NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT.\" THIS HAS BEEN AN EXTRAORDINARY INCONVENIENCE NOT TO MENTION I DON'T FEEL SAFE DRIVING THE VEHICLE WITH MY 3 YEAR OLD TODDLER IN THE BACKSEAT. IN JUST OVER A WEEK, IT WILL BE 4 MONTHS SINCE THIS NOTIFICATION WAS MADE. I LIVE IN HOUSTON, TEXAS, WITH HIGH HUMIDITY WITH A 2010 VEHICLE - THIS MAKES THE VEHICLE MORE SUSCEPTIBLE TO THIS FAILURE. GIVEN THE LOCAL CLIMATE, WHY HASN'T MY VEHICLE BEEN PRIORITIZED SO THAT MY AIRBAG WAS ADDRESSED IN A TIMELY MANNER? DISAPPOINTED.  *TR",
        "vin": "JM3TB2MA1A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916374,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ON OUR 2010 CX-9 ARE HISSING UPON BRAKE ENGAGEMENT AND HAVE A HARD FEEL TO THEM FOR THE FIRST HALF OR SO. THE BRAKES ARE SLOW TO ENGAGE DURING THIS TIME. AFTER THE HALF WAY MARK THE BRAKES ENGAGE QUICKLY AND FORCEFULLY. IT IS CONSISTENT WITH THE OTHER COMPLAINTS FOR THE BRAKE BOOSTER FAILURE. I AM HAVING IT LOOKED AT THIS WEEK AT A MAZDA DEALERSHIP.  *TR",
        "vin": "JM3TB3MA9A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916155,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS) WAS RECEIVED IN JUNE OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914106,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECENTLY RECEIVING OUR VEHICLE BACK FROM A MAZDA DEALER FOR WARRANTY REPAIRS ON THE PTU AND CONTROL ARMS, WE WERE DRIVING DOWN THE HIGHWAY AT 65 MPH - INITIALLY GOING UP A HILL IN THE MOUNTAINS.  THE CAR WOULD NOT SHIFT GEARS (AN AUTOMATIC) AND THEN WOULD NOT ACCELERATE PAST 30 MPH.  NO DUMMY LIGHTS LIT WHATSOEVER.  WE GOT TO THE TOP OF THE HILL AND HAVING NO PLACE TO PULL OFF ON THE HIGHWAY MOUNTAIN SHOULDER, STAYED IN THE LANE OF TRAFFIC WITH OUR HAZARDS ON.  THE DOWN SIDE OF THE HILL WAS A 6% GRADE WITH A CLIFF ON THE OTHER SIDE OF THE GUARD RAILS.  ALL OF A SUDDEN - THE POWER STEERING WENT OUT AND THE CAR WAS HARD TO STEER.  THERE WAS STILL NO PLACE TO PULL OVER ON THE MOUNTAIN HIGHWAY, SO WE COASTED.  WE THEN NOTICED THE RPM'S WERE AT 0 AND ALL THE DUMMY LIGHTS THAT ARE ON WHEN THE CAR IGNITION IS IN ACCESSORY WERE LIT UP.  THE CAR HAD TURNED OFF - WHILE WE WERE GOING 65 MPH ON A 6% GRADE.  NO WARNING - NO SOUNDS, SMOKE, DUMMY LIGHTS - JUST OFF.  VERY AMAZINGLY DANGEROUS.  WE WERE VERY LUCKY TO NOT DIE A FIERY DEATH.  MY HUSBAND WAS ABLE TO KEEP CALM AND THANKFULLY THE BRAKES WORKED - WE WERE ABLE TO STOP TOWARDS THE BOTTOM OF THE HILL.      WE HAD THE CAR TOWED AS IT WOULDN'T START/STAY RUNNING.  THE DIAGNOSIS BY THE DEALER (NOT THE DEALER WHO DID THE PRIOR WARRANTY WORK) WAS A FAILED ENGINE ROD.  WOULD HAVE BEEN NICE TO GET A CHECK ENGINE LIGHT BEFORE HAVING THE CAR COMPLETELY SHUT OFF.  WE DROVE THE VEHICLE FOR LESS THAN 100 MILES AFTER RECEIVING BACK FROM THE WARRANTY WORK AND NOW THIS.",
        "vin": "JM3TB3MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914120,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR BRAKING WHICH MAZDA RECOGNIZED AS A BRAKE BOOSTER AND MASTER CYLINDER PROBLEM BUT NEVER NOTIFIED ITS CX-9 CUSTOMERS TO GO TO THE DEALERSHIP TO HAVE THE REPAIR DONE.",
        "vin": "JM3TB3MA5A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910529,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE DRIVING VARIOUS SPEEDS, THE DRIVER SIDE HEADLIGHTS FAILED TO OPERATE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT CONDENSATION ENTERED THE HEAD LAMP ASSEMBLY AND CAUSED THE FUSE TO BECOME INOPERABLE. THE HEAD LAMP ASSEMBLY WAS REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "09/22/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909392,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010-11 CX-9 BRAKE BOOSTER FAILURE.      RAPID ONSET FROM FIRST SYMPTOMS TO COMPLETE FAILURE BRAKING OCCURRED WITHIN 45 MINUTES OF DRIVING ON HEAVY INTERSTATE CONGESTED TRAFFIC DURING RUSH HOUR.  BREAKING FAILURE IS MOST SIGNIFICANT IF BREAKING IS FIRST APPLIED LIGHTLY AS A CAUTIONARY MEASURE. APPLYING LIGHT BREAKS RESULTS IN BREAKING SYSTEM PRESSURE TO RAPIDLY DROP DISABLING ASSISTED BREAKING WITHIN A FEW SECONDS.  BREAKING A HEAVY VEHICLE WITH FAIL POWER ASSIST ALMOST ALWAYS RESULTED IN EITHER INSUFFICIENT BRAKING, OR WHEEL LOCKUP.  (NOTE, ABS FAILS).  THE ASSIST BRAKING THEN RETURNS IF BRAKE IS RELEASE FOR MORE THAN 10 SECONDS PROVIDING THE BRAKE IS NOT APPLIED.      THIS IS A SIGNIFICANT SAFETY HAZARD THAT MAY EASILY RESULT IN THE DESTRUCTION OF PROPERTY AND DEATH.  THE DEFECT SEEMS TO HAVE BEEN GLOSSED OVER BY THE NHTSA IN APRIL 2014 WHEN THE NHTSA INVESTIGATION INTO THIS FAILURE WAS CLOSED.   IT APPEARS THAT THE INVESTIGATION WAS CLOSED WHEN MAZDA ELECTED TO USE STANDARD US MAIL TO INFORM AFFECTED MAZDA OWNERS THAT IT WAS 'EXTENDING ITS SERVICE WARRANTY' BY GIVING CUSTOMERS 1 YEAR FROM NOTICE TO HAVE THE DEFECTIVE PART REPLACED.      IF THE MAZDA OWNER DID NOT RECEIVE OR ACT UPON THE 'EXTENDED WARRANTY' WITHIN THE FOLLOWING 12 MONTHS AND THE BRAKE BOOSTER FAILED, THE CUSTOMER WOULD BE RESPONSIBLE FOR OVER $1000 IN REPAIR COSTS, SERIOUS PROPERTY DESTRUCTION OR EVEN DEATH.      IT IS SHAMEFUL THAT THE NHTSA  CLOSED IT'S INVESTIGATION SO QUICKLY ON ACCOUNT OF SUCH  REMEDIAL ACTION BY MAZDA CORPORATION.",
        "vin": "JM3TB3MV1A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904765,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 10/19/16*LJ  THE DEALER INFORMED THE CONSUMER, THE PARTS MAY NOT BE AVAILABLE FOR YEARS. UPDATED 10/24/16.*JB",
        "vin": "JM3TB2MA5A0"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897775,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWN MY 2010 CX-9 SINCE NEW, AT 96K MILES THE BOLT MOUNT FOR THE HATCH BACK POWER LIFT RIPPED OUT OF THE SHEET METAL OF THE HATCH WITH A PIECE OF METAL AND BOLT FLYING. I USE THE CAR ONLY FOR PRIVATE USE AND NO HEAVY DUTY USAGE. BOLT LOOKED RUSTED (SORRY I THROUGH IT AWAY).  THE MAZDA DEALER TELLS ME THAT IT IS A VERY UNCOMMON OCCURRENCE, AND THAT IS NOT COVERED BY MAZDA.  I SEE IN BLOGS THAT IT IS NOT THAT UNCOMMON. THE BOLT AND METAL BREAKING MAY CAUSE GLASS BREAKAGE OR DAMAGE TO SOMEONE WHILE THE DOOR IS BEING OPENED.       SEE:  HTTP://FORUMS.EDMUNDS.COM/DISCUSSION/12710/MAZDA/CX-9/MAZDA-CX-9-POWER-LIFT-GATE-PROBLEM    HTTP://WWW.MAZDAS247.COM/FORUM/SHOWTHREAD.PHP?123815687-CX9-POWER-TAILGATE-ISSUES",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896271,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB2MA4A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893547,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V356000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3MA4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/09/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887426,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER FAILED, DEALERSHIP INDICATED IT WAS UNDER EXTENDED WARRANTY.  BROUGHT IN FOR REPAIRS AT NO COST, MAZDA FAILED TO ACKNOWLEDGE AND DO REPAIR.  COST ME 556.21 FOR A VERY SERIOUS SAFETY ISSUE THAT IS UNDER INVESTIGATION.  WOULD LIKE TO GET REIMBURSED.  LOSS OF BRAKES, UNSAFE TO DRIVE.  HISSING SOUND FROM BRAKES WHEN PRESSED",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/20/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887560,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE DRIVING IN REVERSE, A LOUD METAL ON METAL NOISE SOUNDED OUTSIDE OF THE VEHICLE. THE FAILURE OCCURRED TWO DAYS AFTER THE VEHICLE WAS SERVICED PER NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION). AN INDEPENDENT MECHANIC CONFIRMED THAT THE FRONT PASSENGER SIDE LOWER CONTROL ARM WAS DEFECTIVE. THE RECALL MENTIONED THAT THE DEALER WOULD REPLACE BOTH THE DRIVER AND PASSENGER SIDE FRONT LOWER CONTROL ARMS; HOWEVER, THE PASSENGER SIDE LOWER CONTROL ARM WAS NOT REPLACED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE BOTH LOWER CONTROL ARMS WERE REPLACED AND A FOUR WHEEL ALIGNMENT WAS PERFORMED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 128,000.",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882598,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKING POWER BOOSTER SYSTEM FAILED WHILE DRIVING. MY BOOSTER BRAKE AND MASTER CYLINDER WENT OUT SUDDENLY AND THERE WERE NO WARNING LIGHTS.  WHEN APPLYING FULL PRESSURE ON THE BRAKE, A LOUD HISSING SOUND COULD BE HEARD ON THE HIGHWAY. IN ORDER TO MAKE A COMPLETE STOP, I HAD TO PRESS THE BRAKES FAR IN ADVANCE OF MY STOPPING POINT TO ENSURE THE VEHICLE COMPLETELY STOPPED IN ORDER TO AVOID HITTING THE VEHICLE IN FRONT OF ME. AFTER THIS HAPPENED, I IMMEDIATELY DROVE THE VEHICLE TO MY CLOSEST TRUSTED MECHANIC (TIRES PLUS) TO HAVE THE BOOSTER BRAKING SYSTEM INSPECTED, AND INEVITABLY REPLACED. TIRES PLUS COMPLETED THE REPAIRS AND TOLD ME ABOUT ANOTHER UNRELATED RECALL ISSUE AND RECOMMENDED I TAKE THE VEHICLE TO MY CLOSEST MAZDA DEALERSHIP (CLASSIC MAZDA ORLANDO) TO HAVE THE RECALL DONE FOR FREE.  WHEN I MADE THE APPOINTMENT FOR THE UNRELATED RECALL ITEM, CLASSIC MAZDA INFORMED ME THAT THE BRAKING BOOSTER SYSTEM THAT I JUST HAD REPLACED BY TIRES PLUS WAS ACTUALLY A WARRANTY ISSUE THAT MAZDA CORPORATE WOULD HAVE REPAIRED AT NOT COST. CLASSIC MAZDA SUGGESTED I FILE FOR REIMBURSEMENT WITH MAZDA CORPORATE. UPON FILING FOR REIMBURSEMENT WITH MAZDA, I WAITED ABOUT 4 WEEKS AND THEN FOLLOWED UP WITH MAZDA TO CONFIRM THE DATE I SHOULD EXPECT DELIVERY OF THE CHECK.  AT THAT TIME, THEY INFORMED ME THAT I WAS NOT ENTITLED TO FULL REIMBURSEMENT BECAUSE I SHOULD HAVE TAKEN OR HAD THE VEHICLE TOWED TO MY CLOSEST MAZDA DEALERSHIP FOR REPAIRS.  NOT HAVING ANY KNOWLEDGE OF THE BRAKING SYSTEM WARRANTY AND FEARING FOR MY SAFETY, I PROCEEDED TO HAVE THE REPAIRS DONE IMMEDIATELY. ALL I WANT IS FOR MAZDA TO FULLY REIMBURSE ME FOR THE REPAIRS AND NOT JUST FOR \"REASONABLE REPAIR COSTS.\" THIS COULD HAVE TURNED OUT MUCH WORSE HAD I GOTTEN INTO AN ACCIDENT, SO SHORTING ME $177 IS A BATTLE THAT I SHOULD NOT HAVE TO FIGHT WITH MAZDA CORPORATE.",
        "vin": "JM3TB2MA4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881217,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER, AS I DROVE MY CAR AND GET READY TO BRAKE IT GETS STIFF ALONG WITH A HISSING SOUND AND THE VEHICLE FEELS AS THOUGH IT IS STILL MOVING.  I NOTICED IT AROUND APRIL AND THOUGHT I NEEDE BRAKES UNTIL TOLD OTHERS OF THE BRAKE BOOSTER ISSUE ONCE I TOOK MY VEHICLE TO MAZDA.  OF COURSE I WAS ADVISED THAT MY BRAKES WERE IN GOOD SHAPE THE BOOSTER WAS THE PROBLEM TO THE TUNE OF $672.00 TO REPAIR IT.",
        "vin": "JM3TB2MA3A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881265,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V451000 (SUSPENSION) AND 16V356000 (AIR BAGS). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874639,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES HAVE BECOME \"HARD\" AND HAVE TO BE PRESSED ALL THE WAY DOWN TO WORK.  THE CAR IS SLOW TO STOP UNLESS YOU JAM ON THE BRAKES.  IT FEELS UNSAFE TO DRIVE AS IT APPEARS A REAR-END COLLISION COULD EASILY HAPPEN.  WE HAVE BEEN TOLD THAT THE PROBLEM IS THE BRAKE BOOSTER UNIT AND THERE IS AN EXTENDED WARRANTY TO 7 YRS, 90K. HOWEVER, THIS CAR HAS 91K.",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873165,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873028,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES BRAKES SUDDENLY STOPPED WORKING CAUSING A LOW SPEED COLLISION. I HAD THE BRAKES INSPECTED, AND WAS TOLD THIS WAS A KNOWN ISSUE WITH MY CAR, BUT MAZDA DID NOT INITIATE A RECALL. I THEN DISCOVERED THAT THE NHTSA HAD STRUCK A DEAL WITH MAZDA, AGREEING TO AN EXTENDED WARRANTY WITH NO CUSTOMER NOTIFICATION. THIS IS A CLEAR CASE OF A GOVERNMENT AGENCY THAT IS SUPPOSED TO PROTECT CONSUMERS, SHIRKING THEIR DUTY. NHTSA AND MAZDA YOU SHOULD BE ASHAMED OF YOURSELVES!",
        "vin": "JM3T3TB3MVX"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "05/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872650,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES MAKE A HISS SOUND WHEN PRESSED. SOUNDS LIKE AIR LEAKING OUT. VERY HARD TO BRAKE. SOUNDS LIKE BRAKE BOOSTER AS I READ ABOUT THIS ISSUE EVERYWHERE.",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860753,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3MA6A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/11/2016",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825601,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2009 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (AIR BAGS) AND THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO FOR SEVERAL MONTHS. THE CONTACT WAS UNABLE TO CONFIRM WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS UNABLE TO PROVIDE A TIME FRAME OF WHEN THE PART WOULD BE SUPPLIED TO THE DEALER. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825336,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3MV1A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "11/28/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824037,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE BOOSTER HAS FAILED AND CAUSED A NEAR CRASH. THE HISSING SOUND WHEN PRESSING THE BREAK OCCURS AND THE BRAKES DO NOT COME TO A COMPLETE STOP. I HAD THE VEHICLE INSPECTED AND THE SAME BRAKE BOOSTER FAILURE THAT HAS BEEN REPORTED HAS BEEN PREVIOUSLY REPORTED. I WAS NEVER NOTIFIED FROM MAZDA OF THE WARRANTY EXTENSION AND NOW THAT MY MILEAGE IS AT 101,000 MILES I'VE JUST MISSED THE \"WARRANTY EXTENSION\" AND THEY REFUSE TO MAKE THE REPAIR. WHY IS THIS JUST AN INVESTIGATION AND NOT A COMPLETE RECALL? MAZDA CLEARLY KNOWS THERE'S A PROBLEM AND THIS CAN CAUSE SERIOUS ACCIDENTS WITH INJURY. MY WIFE, WHO IS THE PRIMARY DRIVER, IS PREGNANT AND HAVE 3 SMALL CHILDREN THAT USE THIS VEHICLE.  *TR",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823769,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE LOW BEAM LIGHT WENT OUT. UPON TAKING THE VEHICLE TO THE DEALERSHIP I WAS ADVISED IT'S NOT THE BULB ITSELF RATHER IT'S A COMPONENT WITHIN THE HEADLAMP ASSEMBLY WHICH IS CORRODED DUE TO THE BUILD OF OF MOISTURE WITHIN THE LAMP KIT. THIS IS A KNOWN PROBLEM & THERE IS A SERVICE BULLETIN (SERVICE BULLETIN NO.: SB-09-003-13). THE DEALERSHIP STATED MAZDA WILL NOT COVER THE REPAIR AND QUOTED ME A COST IN EXCESS OF $1,000 TO REPLACE THE HEADLAMP AND RELATED PARTS. I BELIEVE MAZDA TO BE RESPONSIBLE WHEN THERE IS A KNOWN PROBLEM.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2015",
        "dateOfIncident": "12/19/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811277,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE, AT APPROXIMATELY 50 MPH, SUNROOF EXPLODED. WEATHER WAS SUNNY AND APPROXIMATELY 18 DEGREES FAHRENHEIT. DRIVER'S SIDE HEAT WAS ON AND SET AT 73 DEGREES FAHRENHEIT. SUN SHADE AND SUNROOF WERE CLOSED. SUNROOF HAD NOT BEEN OPERATED IN A FEW MONTHS. NO EVIDENCE OF OUTSIDE INTERFERENCE. NO OTHER TRAFFIC WITHIN 150 FEET. EXAMINATION OF REMAINING GLASS INDICATED UPWARD BOW, INDICATING PRESSURE FROM INSIDE PUSHING OUT, IN MY OPINION. ROAD WE WERE ON AT TIME WAS A STATE ROAD IN A RURAL AREA AND WE WERE TRAVELLING IN A STRAIGHT LINE, TRANSITIONING FROM A 2-LANE HIGHWAY TO A 4-LANE SECTION APPROXIMATELY 1 MILE FROM AN INTERSTATE EXCHANGE. ROAD CONDITIONS WERE CLEAR AND DRY. I HAVE NO PLAUSIBLE EXPLANATION FOR THIS OCCURRENCE? NO POLICE REPORT WAS FILED. DEALER SERVICE DEPARTMENT CLOSED ON SATURDAY (DAY OF INCIDENT), BUT WILL BE CONTACTED REGARDING EXTENDED WARRANTY COVERAGE. THIS COULD HAVE RESULTED IN AN ACCIDENT, IF SUN SHADE WAS OPEN, EXPOSING PASSENGER AND DRIVER TO FLYING GLASS. THEREFORE, I CONSIDER THIS AN UNEXPLAINED SAFETY HAZARD.",
        "vin": "JM3TB3MA9A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790609,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS MAKING GRINDING SOUNDS WHEN THE VEHICLE WAS IN MOTION, ESPECIALLY WHEN I TURNED LEFT/RIGHT AS WELL AS WHEN I WAS STOPPING THE VEHICLE. MOST NOTICEABLE ON CITY STREETS.  NEEDED TO REPLACE TRANSFER CASE AND TRANSMISSION.",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/09/2015",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789292,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9 THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 1/20/16 LN  *TR",
        "vin": "JM3TB3MA8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788166,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL WEEKS NOW I HAVE BEEN HEARING A HISSING NOISE COMING FROM MY BRAKE PEDAL WHEN ENGAGING THE BRAKES. NOW, FOR THE PAST SEVERAL DAYS I HAVE NOTICED THAT THE BRAKE DEAL BECOME VERY HARD TO PRESS DOWN WHEN TRYING TO STOP. TODAY I WAS VERY SCARED BECAUSE I DIDN'T THINK THE CAR WOULD STOP.",
        "vin": "JM3TB3MV6A0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/10/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781221,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY TPMS SIGNAL SOUNDED. EXITED IMMEDIATELY REAR RIGHT TIRE FLAT.UPON EXAMINATION VALVE HAD FALLEN INTO TIRE. CHANGED TIRE WENT TO SERVICE TIRE DEALER STATED ALL VALVES CORRODED BADLY. REPLACED ALL VALVES AT COSTCO THEY WERE UNABLE TO SERVICE TOO MUCH CORROSION. CX9 OWNERS SHOULD BE WARNED OF PROBLEM AND POSSIBLE CATASTROPHIC FAILURE.",
        "vin": "JM3TB3MV1A0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "10/20/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10779174,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED. THE TAILGATE WAS OPENED MANUALLY.  I WAS MOVING ITEMS AROUND IN THE TRUNK TO MAKE ROOM FOR NEW PURCHASES. MY HUSBAND DID NOT SEE THAT I WAS MOVING ITEMS IN THE TRUNK. HE APPROACHED THE DRIVERS SIDE OF THE VEHICLE AND PRESSED THE POWER TAILGATE BUTTON INSIDE THE VEHICLE AND THE TAILGATE BEGAN TO CLOSE. IT MADE CONTACT WITH THE BACK OF MY NECK AND PUSHED MY FACE DOWN INTO THE FLOOR BOARD. THE SENSORS DID NOT WORK.  WHEN THE TAILGATE MADE CONTACT WITH ME IT PUSHED DOWN HARDER AND FASTER INSTEAD OF GOING BACK UP TO OPEN. THIS CAUSED A SERIOUS INJURY TO MY NECK. SPECIFICALLY CERVICAL 5-7 HAD TO BE SURGICALLY FUSED WITH A TITANIUM PLATE AND SCREWS, AND MY SPINAL CORD HAD TO BE DECOMPRESSED AS THE DISCS HAD COMPRESSED MY SPINAL CORD AND COULD HAVE CAUSED COMPLETE PARALYSIS FROM MY NECK DOWN.",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/23/2015",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778759,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE ACCELERATING FROM A TRAFFIC LIGHT, THERE WAS AN ABNORMAL BURNING ODOR COMING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS NOTIFIED THAT THE TRANSFER CASE HAD A LEAK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 77,200.     *CN",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2015",
        "dateOfIncident": "08/20/2015",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759662,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD BRAKE PEDAL.    PROGRESSIVELLY GETTING WORSE.  BROUGHT CAR TO MY LOCAL MAZDA DEALER, WAS TOLD ALTHOUGH THERE IS A CAMPAIN TO REPLACE THE BOOSTER, MY VEHICLE EXCEEDED THE MILEAGE.   I FEEL THE DEFECTIVE BOOSTER SHOULD BE RECALLED WITHOUT A MILEAGE RESTRICTION BASED ON SAFETY.",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748060,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES THERE IS A RESISTANCE ALMOST AS IF THE CAR WON'T STOP IN TIME.  ALSO A HISSING SOUND AS THE BRAKES ARE APPLIED.  STARTED NOTICING IT DURING THE COLD WEATHER AND THOUGHT IT WAS JUST LACK OF WARMING IT UP AT FIRST BUT IT CONTINUED NO MATTER WHAT THE WEATHER TEMPERATURE.",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "06/24/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692228,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED DASHBOARD ON THE PASSENGER SIDE WAS MELTING. DRIVER SIDE IS OK, BUT THAT'S BECAUSE IN THE 2010 MAZDA 6 I SPORT MODELS, AT LEAST, THE DASHBOARD IS MADE OF TWO DIFFERENT MATERIALS BETWEEN DRIVER SIDE AND PASSENGER SIDE. IF YOU PUT YOUR FINGER ON THE MELTED AREA, THERE WILL BE A BLACK TAR-LIKE RESIDUE ON YOUR FINGER WHEN YOU TAKE IT OFF. THIS IS A BLACK DASHBOARD. NO SAFETY ISSUE THAT I'M AWARE OF, BUT THERE IS NO EXCUSE FOR A DASHBOARD TO MELT, REGARDLESS OF CLIMATE THAT THE CAR IS IN.  *TR",
        "vin": "1YVHZ8BH2A5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690673,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAND FREE EQUIPMENT (BLUE TOOTH) STOPPED COMMUNICATION WITH MY MOBIL PHONE, DUE TO A SOFTWARE ISSUE. WHEN CONTACTING THE MAZDA DEALER AND MAZDA NORTH AMERICA CUSTOMER CARE, THEY DECLINED TO REPAIR THE DEFECTIVE PART, EVEN THOUGH MY VEHICLE IS STILL COVERED UNDER EXTENDED WARRANTY.  *JS",
        "vin": "JM3TB2MV9A0"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2015",
        "dateOfIncident": "01/04/2015",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670230,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE TIRE PRESSURE WARNING LIGHT ILLUMINATED AND THE CONTACT HEARD AN ABNORMAL NOISE. THE CONTACT MERGED TO THE SIDE OF THE ROAD AND REPLACED THE TIRE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE VALVE STEM FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2014",
        "dateOfIncident": "12/09/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664091,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BRAKES LIGHTING DIM WHILE COMING TO A STOP AND CAN NOT BE SEEN FROM OTHER VEHICLES APPROACHING FROM BEHIND ON THE ROAD. WHEN NOT REPLACED, STOP LIGHT WILL RUN CONTINUALLY OR NOT FUNCTION, POTENTIALLY CAUSING PREMATURE BULB FAILURE, SAFETY ISSUES AND/OR THE TRANSMISSION WILL NOT SHIFT OUT OF PARK. A FAILED STOPLIGHT SWITCH WILL PREVENT THE BRAKE LIGHT FROM ILLUMINATING WHEN THE BRAKE PEDAL IS APPLIED THAT MAY CAUSE A COLLISION AND A LIFE LOST.  *TR",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "11/26/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650012,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS MAINTAINED TO MANUFACTURER'S REQUIREMENTS.  SMOKE FILLED THE DRIVERS CABIN, COMING FROM OIL DRIPPING OUT OF THE FAILED POWER TRANSFER CASE, DRIPPING ONTO THE EXHAUST PIPE AND RISING SMOKE INTO THE CABIN.    THIS WAS UNSAFE AND THE CAR BECAME UNUSABLE OVER A FEW DAYS.  I HAD THE TRANSFER CASE REPAIRED AT A COST OF $1395.89, INCLUDING ASSOCIATED COST OF $136.36 FOR A RENTAL VEHICLE REPLACEMENT.  I PAID FOR THE REPAIR WITH A PRIVATE EXTENDED WARRANTY, THAT WAS NOT PART OF MAZDA, TO PAY THE REPAIR SHOP.  WHEN I APPLIED FOR REIMBURSEMENT UNDER MAZDA'S \"SPECIAL SERVICE PROGRAM 92 (2010-2014 CX9 AWD POWER TRANSFER UNIT WARRANTY EXTENSION)\", I RECEIVED A LETTER FROM MAZDA NORTH AMERICAN OPERATIONS DENYING ME REIMBURSEMENT, BECAUSE I PAID FOR THE REPAIR USING MY PERSONAL WARRANTY POLICY.  SINCE I PURCHASED THIS PERSONAL WARRANTY POLICY, (NOT MAZDA), I BELIEVE I AM ENTITLED TO REIMBURSEMENT FOR THE REPAIR.  *TR",
        "vin": "JM3TB3MA8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638597,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME BRAKING PROBLEM FOR WHICH MAZDA ISSUED AN EXTENDED WARRANTY IN APRIL OF 2014, WHERE MAZDA KNOWS THEY HAVE A DEFECTIVE PART IMPACTING THE QUALITY OF BRAKING, IN WHICH UNDER PRESSURE WOULD GENERATE A HISSING NOISE AND LOSS OF BRAKING POWER, EXTREME DIFFICULTY PUSHING THE BRAKE PEDAL (AND COMPLETE LOSS OF BRAKING ABILITY). OUR INCIDENT OCCURRED WHILE TRAVELING ON INTERSTATE 10 AT SPEEDS EXCEEDING 60 MPH AND TRAFFIC SLOWING. AS I ATTEMPTED TO BRAKE TO DECREASE SPEED WITH SLOWING TRAFFIC I REALIZED THE CAR WAS NOT SLOWING AND I HAD NO OPTION BUT TO QUICKLY SWERVE TO THE SHOULDER TO AVOID MAKING CONTACT WITH THE SLOWING CARS IN THE LANE. THE PROBLEM CONTINUED AND I IMMEDIATELY CONTACTED MY MAZDA DEALERSHIP WHO RECOMMENDED I IMMEDIATELY BRING THE CAR FOR SERVICE. MAZDA OBVIOUSLY KNOWS THERE IS AN SERIOUS ISSUE AS WELL AS THE NHTSA (WHY AREN'T THEY FORCING MAZDA TO ANNOUNCE AN IMMEDIATE RECALL VS. ALLOWING AN EXTENDED WARRANTY?). I COULD EASILY SEE HOW THIS ISSUE COULD LEAD TO A CRITICAL ACCIDENT OR FATALITY. COME ON NHTSA WAKE UP... HOW ABOUT WE SUE YOU AS NOT TAKING OWNERSHIP AND PROTECTING PUBLIC SAFETY FOR KNOWN ISSUES? WHY PLACE ALL THE BURDEN ON THE MANUFACTURER? WHAT EVEN FRUSTRATES ME FURTHER... WHEN THE CAR WAS BROUGHT IN TO BE SERVICED, THEY DON'T EVEN HAVE THE PARTS AVAILABLE.  *TR",
        "vin": "JM3TB3MV2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/10/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621176,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDALS NEED EXTRA EFFORT TO STOP. FEELS LIKE THE BRAKE PEDALS ARE STUCK ON THE FLOOR. JUST TOOK CAR INTO DEALERSHIP FOR OIL CHANGE 3 WEEKS AGO AND THEY SAID EVERYTHING WAS OK.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619433,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES BASICALLY FAILED! WHEN I WAS DRIVING, I TRIED TO APPLY MY BRAKES AND I COULD TELL RIGHT AWAY SOMETHING WAS WRONG. THE CAR HAD A LOT OF TROUBLE STOPPING AND I WAS AFRAID IT WOULDN'T STOP. THE BRAKES FELT VERY HARD AND I HAD TO APPLY A LOT OF PRESSURE TO THEM TO GET THE CAR TO STOP. I HAD TO ALMOST STAND ON THE BRAKES TO GET THEM TO WORK. WHEN I CALLED MY MECHANIC HE SAID IT SOUNDED LIKE THE BRAKE BOOSTER FAILED WHICH APPARENTLY IS VERY COMMON IN THIS MAKE AND MODEL OF CAR. I ALMOST HIT A CAR WHEN THIS HAPPENED AND IT WAS VERY DANGEROUS AND QUITE SCARY!  IT WAS ALSO VERY EXPENSIVE TO FIX, BUT WOULD HAVE BEEN A LOT WORSE IF I HAD HIT SOMETHING.  *TR",
        "vin": "JM3TB2MV8A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614717,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND TOWN AND ATTEMPTED TO BRAKE.  I NOTICED THAT THERE WAS A ODD PRESSURE THAT WAS NOT ALLOWING ME TO BRAKE PROPERLY.  I HAD TO PUSH HARD IN ORDER TO FEEL MY CAR SLOWING DOWN.  AFTER I PUSHED PAST THE PRESSURE, THE BRAKE PEDAL WAS ABLE TO PUSH DOWN NORMALLY TO A FULL STOP.  IT HAS DONE THIS EVERY TIME I HAVE USED THE BRAKE SINCE.  IT IS NOW GETTING MUCH WORSE AND BECOMING INCREASINGLY HARDER TO PUSH THE BRAKE DOWN TO GET THE CAR TO STOP.  AS I WAS PARKING IN MY GARAGE I WAS ALMOST UNABLE TO STOP IN TIME SO THAT I DIDN'T HIT THE BACK WALL OF THE GARAGE.  THE BRAKE PEDAL WHEN PRESSED COMPLETELY TO THE FLOOR MAKES A SQUEALING NOISE.  I HAVE PARKED THE CAR IN THE GARAGE AND DO NOT PLAN ON DRIVING IT UNTIL I CAN GET IT LOOKED AT.  AS I SAID, IT IS GETTING WORSE EVERY TIME I DRIVE IT AND I BELIEVE MY SAFETY IS COMPROMISED WHEN DRIVING THIS VEHICLE IN THIS CONDITION.  *TR",
        "vin": "JM3TB3MA5A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609532,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT THE BRAKES FAILED INTERMITTENTLY. THE CONTACT MENTIONED THAT HE HAD TO APPLY FORCE IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 41,000.    UPDATED 8/28/14*CN    THE CONSUMER STATED THE DEALER REPAIRED THE VEHICLE.  UPDATED 09/15/2014  *JS",
        "vin": "JM3TB2MA0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10598574,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WOULD NOT DEPRESS. CAR HIT ANOTHER VEHICLE THAT WAS STOPPED AND IT HIT ANOTHER VEHICLE. THE MAZDA NEVER EVEN SLOWED BEFORE HITTING THE STOPPED VEHICLE. MY WIFE WAS DRIVING AND SHE HAS HAD THIS ISSUE BEFORE BUT IT WAS INTERMITTENT AND WE COULD NOT GET IT TO ACT UP TO BRING IT TO THE DEALER. THE 3RD CAR INVOLVED I DO NOT HAVE A STATUS OF.   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JM3TB3MA0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/31/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595300,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DID NOT STOP (JUST LIKE SLIDE) WHEN APPLYING THE BRAKE. NEEDED TO APPLY THE BRAKE PEDAL SEVERAL TIMES TO STOP THE VEHICLE.  *TR",
        "vin": "JM3TB2MA9A0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/29/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595017,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS ON A 2010 MAZDA CX-9. THE CONTACT STATED THAT WHILE DRIVING AT 10 MPH, THE BRAKE PEDAL BECAME STUCK TO THE FLOORBOARD AND MADE AN ABNORMAL NOISE WHILE THE CONTACT WAS ATTEMPTING TO STOP. THE CONTACT WAS ABLE TO RELEASE THE BRAKE PEDAL AND STOP THE VEHICLE BY DEPRESSING THE BRAKE PEDAL SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 94,057.",
        "vin": "JM3TB2MA4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "05/15/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588434,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A COMPLAINT THROUGH MAZDA IN 2012 AND IT DIDN'T GO ANYWHERE.  I SAW AN ARTICLE IN USA TODAY, REGARDING MY VEHICLE STATING THAT AN INVESTIGATION WAS STARTED DUE TO 7 REPORTED INCIDENTS ON BRAKE FAILURES WHICH RESEMBLED MY EXPERIENCE.  I AM NOW SHARING MY STORY AS IT COULD HAVE RESULTED IN SERIOUS INJURY.  I WAS APPROACHING AN INTERSECTION AND APPLIED THE BRAKE BUT THE CAR DID NOT SLOW DOWN,  I PUSHED THE BRAKE ALL THE WAY TO THE FLOOR AND THE WHEELS SQUEALED BUT THE CAR DID NOT SLOW.  I LET UP ON THE BRAKE AND REAPPLIED AND THAT IS WHEN THE CAR BEGAN TO SLOW DOWN.  BUT, IT WAS TOO LATE.  I HIT THE CAR IN FRONT OF ME AND LAUNCHED IT INTO THE MIDDLE OF THE INTERSECTION.  THANKFULLY, THE LIGHT HAD JUST CHANGED AND THE CROSS TRAFFIC WAS AT A STOP.  WHEN THE POLICE ARRIVED, THEY NOTICED ONE SKID MARK ON THE DRIVER SIDE ONLY WHICH WAS AROUND 200 YARDS.  ABOUT 4 FEET PRIOR TO IMPACT, THERE WERE TWO SKID MARKS, ONE ON EACH SIDE OF THE VEHICLE.  THEY SAID THAT THEY HAD NEVER SEEN ANYTHING LIKE IT AND THAT I SHOULD TAKE IT TO AN INDEPENDANT PERSON TO GET THE BRAKES CHECKED OUT.  I HAVE PHOTOS OF THIS  AND SENT ALL OF THE DOCUMENTATION SENT TO THE INSURANCE COMPANY AND TO MAZDA.  I FELT NEITHER BELIEVED ME AND WAS VERY DIAPPOINTED IN MAZDA'S RESPONSE.  EVENTIALLY, I GAVE UP.  WE ACTUALLY WERE GOING TO SELL THE VEHICLE AS I DIDN'T FEEL COMFORTABLE DRIVING IT.  HOWEVER, AFTER ALL OF THE RESPONSES I WAS GETTING ABOUT WHAT I DESCRIBED AS IMPOSSIBLE WITH ANTI LOCK BREAKS OR THAT IT WAS A RESULT OF \"PANIC BREAKING\", I SECOND GUESSED MYSELF AND WE STILL HAVE THE VEHICLE.  ON A SEPARATE OCCASSION 2-4 WEEKS PRIOR TO THE ACCIDENT ON MAY 15, MY HUSBAND WAS DRIVING VERY SLOWLY IN A RESIDENTIAL AREA AND WHEN HE APPLIED THE BRAKE, THE CAR INITIALLY DID NOT STOP UNTIL REAPPLYING.  HE ROLLED PART WAY INTO THE INTERSECTION.  I WAS WITH HIM WHEN THIS OCCURRED.    *TR",
        "vin": "JM3TB2MAXA0"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586088,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM AT A STOP AD START MY VEHICLE ACCELERATES WITHOUT MY ASSISTANCE, THIS HAPPENED ALSO WHILE BACKING UP AND MY FOOT WAS ON THE BRAKE.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "04/06/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577445,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT WHILE STARTING THE IGNITION, THE AIR BAG OFF WARNING INDICATOR REMAINED ILLUMINATED WHENEVER THERE WAS A FRONT SEAT OCCUPANT THAT WEIGHED LESS THAN ONE-HUNDRED POUNDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY STATED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE TECHNICIAN ALSO STATED THAT THE AIR BAGS WOULD NOT DEPLOY WHENEVER THE AIR BAG INDICATOR ILLUMINATED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 15,000. UPDATED 10/09/14*LJ    THE CONSUMER STATED FURTHER TESTING SHOWS THE AIRBAG OFF LIGHT ILLUMINATED FOR PASSENGERS BETWEEN 115 POUNDS AND INTERMITTENTLY FOR PASSENGERS BETWEEN 115 AND 120 POUNDS. IT WAS SUGGESTED TO THE CONSUMER TO HAVE SMALL ADULTS RIDE IN THE BACK SEAT.   UPDATED 8/10/2015  *JS",
        "vin": "JM3TB3MV6A0"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577269,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS WHEN IDLING AT A STOP LIGHT OR IN A  DRIVE THRU. THE VEHICLES MOTOR BEGINS TO SHAKE AND THEN EVENTUALLY DIES AND STALLS OUT AND THE VEHICLE MUST BE STARTED AGAIN WITH THE TURN OF THE IGNITION.  THE BRAKING SYSTEM IS ALSO DEFECTIVE. WHEN AT A STOP LIGHT AND YOUR FOOT IS ON THE BRAKE PEDAL. THE PEDAL SUDDENLY SINKS AS IF THE BRAKE FLUID IN THE MASTER CYLINDER HAS DRAINED FULLY AND THE BRAKE PEDAL SINKS ALL THE WAY TO THE FLOOR AND THE VEHICLE SHOOTS FORWARD EVEN IF YOUR FOOT IS ON THE BRAKE.  ANOTHER PROBLEM IS IN THE POWER DOOR LOCK SYSTEM. THERE HAS BEEN A TIME WHEN THE POWER DOOR LOCK WAS STUCK AND THE REAR RIGHT DOOR COULD NOT BE SHUT. I HAD TO DRIVE THE CAR TO THE DEALERSHIP WITH THE CAR DOOR FLOPPING ALL OVER THE PLACE. THEY WERE ABLE TO FIX IT AT THE DEALERSHIP BUT COULD NOT FIGURE OUT HOW IT OCCURRED. THEY WERE AS PUZZLED AS I WAS. THE CAR WAS BOUGHT BACK IN 2010 BRAND NEW FROM THE MAZDA DEALERSHIP.  THE REVIEWS WERE GOOD FOR THE VEHICLE. ITS THE FIRST MAZDA WE PURCHASED AND IS PROBABLY GOING TO BE THE LAST.  *TR",
        "vin": "JM3TB2DV8B0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "03/09/2012",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576384,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD UNEXPECTED ACCELERATIONS 3 DIFFERENT TIMES. MY BRAKES WOULD NOT STOP MY CAR. I HAD A TEAR IN MY KNEE ON THE LAST INCIDENT IN MARCH 2012. MY MEDICAL BILLS WERE AROUND $5,000. MAZDA KEPT MY CAR AND GAVE ME A RENTAL. BUT SAID THEY COULD FIND NOTHING. I SOLD THE CAR. I KNOW THIS DEALERSHIP HAD ANOTHER MAZDA DO THE SAME THING AS MY CAR. THEY TOLD ME MAZDA WAS AWARE THERE WAS A PROBLEM. I HOPE SOMETHING IS DONE. I WASN'T KILLED BECAUSE I WAS ABLE TO GET TO THE GRASSY AREAS ALL 3 TIMES. BLOWING MY HORN AS A WARNING TO OTHER DRIVERS. I BELIEVE MY OLD CAR WAS TAKEN TO AN AUCTION BY MAZDA. AND THAT WAS A DANGEROUS VEHICLE. I WISH MORE PEOPLE WOULD REPORT IT. I HAD ANOTHER MAN TELL ME IT HAPPENED TO HIM BUT HE DIDN'T REPORT IT TO ANY ONE ELSE ACCEPT THE DEALER. THE DEALER I USE MAZDA IN VIRGINIA BEACH. THEY HAVE SERVICED OTHER MAZDA CX 9'S WITH THIS ISSUE. THEY PUT A BAND AID ON IT. THEY CHANGED THE THROTTLE IN MY NEW CAR WHEN IT FIRST HAPPENED. THAT DID NOT WORK.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575170,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND A SHARP BEND IN THE ROAD. I PUSHED DOWN ON THE BRAKE PEDDLE TO SLOW DOWN AND THE CAR KEPT ACCELERATING AT THE SAME SPEED. THE CAR NEVER SLOWED DOWN AND I HAD TO TAKE THE CORNER AT A UNSAFE SPEED. I DROVE TO THE NEXT STREET AND TESTED THE BRAKES AND THEY WORKED FINE? VERY SCARY INCIDENT.   *TR",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/26/2014",
        "dateOfIncident": "03/25/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574868,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS ON A 2010 MAZDA CX9. THE CONTACT STATED THAT THE BRAKE PEDAL BECAME STUCK TO THE FLOORBOARD AND MADE A STRANGE NOISE WHILE ATTEMPTING TO STOP. THE CONTACT WAS ABLE TO RELEASE THE BRAKE PEDAL AND BROUGHT THE VEHICLE TO A STOP BY DEPRESSING THE BRAKE PEDAL SEVERAL TIMES.  THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO AN INDEPENDENT MECHANIC FOR FURTHER INSPECTION. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 51,000.",
        "vin": "JM3TB3MV0A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573705,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A HISSING SOUND WHEN PRESSING THE BRAKE PEDAL TODAY 3/20/2014 AND LOSS OF BRAKE PRESSURE. I NOTIFIED THE DEALER AND THEY PROMPTLY TOLD ME TO BRING IT IN RIGHT AWAY TO BE LOOKED AT. I DID HOWEVER A GOOGLE SEARCH FOR MAZDA CX9 BRAKE ISSUE AND NOTICE THERE ARE 7 OTHER INCIDENTS WITH CX-9 BRAKE ISSUE EXPLAINING THE SAME SYMPTOMS. \"THE NHTSA COMPLAINTS SAY THAT THE PROBLEM CAUSES A HARD PEDAL, INCREASED BRAKING EFFORT AND REDUCED BRAKING EFFECTIVENESS. SOME COMPLAINTS ALLEGE THAT THEY HEAR A HISSING NOISE DURING BRAKING SIMILAR TO THE SOUND OF AIR LEAVING THE TIRES. NO INJURIES OR CRASHES HAVE BEEN REPORTED.\" I SHOWED THE DEALERSHIP THE GOOGLE SEARCH FROM THE INTERNET...PERTAINING TO 2010 CX-9 BRAKE ISSUES. MAZDA DEALER SOUNDS LIKE THEY ARE AWARE OF THE PROBLEM...AND SHOULD BE TAKING PROACTIVE CORRECTIVE MEASURES TO FIX THIS PROBLEM.  *TR",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569405,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN TURNING OFF WHILE DRIVING WITH NO PRIOR INDICATIONS OR WARNINGS.  ENGINE TURNS OFF AND STEERING WHEEL FREEZES AND LOCKS UP.  THIS HAS OCCURRED MULTIPLE TIME AND  WE HAVE TAKEN THE CAR TO THE DEALER A NUMBER OF TIMES WHO HAS INSPECTED IT AND EVEN KEPT IT AT THE SHOP DROVE IT FOR A NUMBER OF DAYS AND COULD NOT PINPOINT THE PROBLEM.    WE HAVE MADE MAZDA USA AWARE OF THE ISSUE AND THE POTENTIAL THREAT OF THIS VEHICLE  (THEY GAVE US A CASE # 149456450) HOWEVER, SADLY THEIR ATTITUDE IS THAT IF THE PROBLEM CANT BE PINNED THEN IT DOES NOT EXIST.    THIS IS A CLEAR IGNORANCE ON MAZDA USA'S PART AND PUTTING THE PUBLIC IN A RISK WITH THIS VEHICLE.   *TR",
        "vin": "JM3TB3MV3A0"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566803,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL WEEKS AGO THE BRAKES STARTED MAKING A HISSING NOISE WHEN I WOULD DEPRESS THE BRAKE. THEN, THE CAR WOULD BRAKE AS USUAL UNTIL I NEEDED TO COME TO A COMPLETE STOP, WHEREAS THEN I WOULD NEED TO DEPRESS THE BRAKE VERY HARD TO MAKE THE CAR STOP, WHICH THEN IT WOULD STOP VERY SUDDENLY. THE MOST RECENT EVENT OCCURRED WHEN MY HUSBAND WAS DRIVING DOWN THE ROAD ABOUT 45 MPH AND HAD HIT THE BRAKES AND THE ENGINE COMPLETELY SHUT OFF, ALL THE WARNING LIGHTS CAME ON AND IT WAS VERY DIFFICULT FOR MY HUSBAND TO PULL THE CAR OVER AND COME TO A STOP. THE ENGINE DID START BACK UP AND WE DROVE ALL THE WAY HOME AND HAVE NOT SINCE DRIVEN THE VEHICLE.   *TR",
        "vin": "JM3TB2MAXA0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "02/23/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565646,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKES A HISSING SOUND (HEARD INSIDE THE VEHICLE) WHEN DEPRESSING THE BRAKE PEDAL. SOUNDS LIKE AN AIR LEAK. OCCASIONALLY THE PEDAL WILL GO HARD AS IF POWER ASSISTED BRAKING FEATURE IS LOST. VERY DANGEROUS SITUATION! VEHICLE TAKEN TO DEALER TODAY (02/24/14) AND WAS TOLD REPLACEMENT BRAKE BOOSTER IS REQUIRED.  *TR",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "02/07/2014",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563794,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "CX9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN A GARAGE (NOT HEATED) AFTER TRAVELING APPROXIMATELY 18 MILES FROM WORK WITH TEMPERATURES IN THE TEENS. AFTER BEING PARKED IN THE GARAGE UNATTENDED FOR APPROXIMATELY 10 MINUTES, THE SUNROOF EXPLODED. THE SOUND COULD BE HEARD FROM INSIDE THE HOUSE. WHEN I INVESTIGATED, THE REMAINING GLASS THAT WAS STILL IN TACT WAS POINTED TOWARDS THE CEILING OF THE GARAGE. WHILE TAKING PICTURES, THE GLASS CONTINUED TO CRACK, POP, AND EXPLODE INTO THE AIR AND ONTO THE HOOD OF THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/26/2013",
        "dateOfIncident": "12/26/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557358,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN SNOWY CONDITIONS; BRAKES FAILED TWICE WHEN I APPLIED LIGHT PRESSURE. FIRST TIME, THE BRAKES SHUDDERED, BUT THE CAR FINALLY STOPPED AFTER I APPLIED HARD PRESSURE; THE SECOND TIME IT HAPPENED, THE BRAKES SHUDDERED, AND NOTHING HAPPENED WHEN I FIRST APPLIED HARDER PRESSURE. EVENTUALLY THE CAR SKIDDED, BUT IT WAS TOO LATE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2013",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556021,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING, HAD MY 2 YEAR OLD SON AND 7 YEAR OLD DAUGHTER IN THE CAR, A CAR SLOWED IN FRONT OF ME AND WHEN I PUSHED THE BRAKES THEY FELT HARD AS A ROCK AND THE CAR WOULD NOT STOP. SLOWED DOWN AT A VERY SLOW PACE WHILE PUSHING ON THE BRAKES AS HARD AS I COULD. I PRACTICALLY HAD TO STAND UP. I WAS HORRIFIED. MY BRAKES CONTINUE TO DO THIS. SOMETIMES THEY FEEL VERY HARD AND SOMETIMES THEY PUSH DOWN BUT SOUND AS IF AIR IS LEAKING OUT. I AM TAKING THE CAR IN TOMORROW TO SEE WHAT IS GOING ON. OBVIOUSLY SOMETHING IS WRONG, BUT THERE ARE NO WARNING LIGHTS ON OR ANYTHING. I LOOKED FOR RECALLS ON THE BRAKES AND HAVE FOUND NOTHING. I HAVE FOUND OTHERS HAVE HAD THE SAME ISSUE AND HOPE THAT THERE IS A RECALL BEFORE SOMEONE GETS HURT OR EVEN KILLED. THIS WAS A VERY SCARY EXPERIENCE.....MY CHILDREN AND I WERE FORTUNATE I WAS ABLE TO GO  INTO THE OTHER LANE WITHOUT CRASHING.  *TR",
        "vin": "JM3TB2MAXA0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2013",
        "dateOfIncident": "11/30/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554259,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2010 MAZDA CX-9 APPROXIMATELY 65MPH ON INTERSTATE 270S IN MARYLAND, I PRESSED THE GAS PEDAL TO ACCELERATE IN AN ATTEMPT TO PASS SEVERAL VEHICLES WHO WERE TRAVELING IN THE RIGHT HAND LANE.  ONCE I FELT THAT I HAD ENOUGH ADDITIONAL SPEED TO  SUCCESSFULLY PASS THE VEHICLES, I RELEASED THE GAS PEDAL AND NOTED THAT THE CAR CONTINUED TO ACCELERATE.  I ATTEMPTED TO APPLY MY BRAKES, BUT THEY WOULD NOT SLOW THE VEHICLE.  AFTER SEVERAL UNSUCCESSFUL ATTEMPTS TO APPLY MY BRAKES, I SEARCHED FOR A SAFE PLACE TO CONTINUE TRAVELING AS MY VEHICLE CONTINUED TO ACCELERATE, NOTING I WOULD NEED TO SHIFT INTO NEUTRAL AND MOVE INTO THE MEDIAN.  LUCKILY, AFTER NUMEROUS REPEATED ATTEMPTS, MY BRAKES FINALLY ENGAGED AND SLOWED THE VEHICLE.  I FEEL THIS IS A MANUFACTURER'S DEFECT THAT COULD ULTIMATELY LEAD TO A FATALITY. I AM TOO SCARED TO DRIVE THE VEHICLE AT THIS POINT IN TIME.   *TR",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/01/2013",
        "dateOfIncident": "10/30/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550555,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WOULD NOT WORK AS USUAL.  AFTER \"STOMPING\" ON BRAKE, CAR CONTINUED TO MOVE FOR SEVERAL FEET.  THERE WERE NO WARNING LIGHTS OF BRAKE FAILURE WHATSOEVER.  TOOK VEHICLE TO DEALER TO BE INFORMED THE MASTER CYLINDER AND BRAKE POWER BOOSTER WERE OUT AND THE CAR WAS DANGEROUS TO DRIVE.  VERY GLAD NOBODY GOT HURT.  COUPLE ISSUES: THIS BRAKE FAILURE IS FAIRLY WIDESPREAD WITH THIS MAKE/MODEL/YEAR AS I'VE FOUND FROM RESEARCH.  WHY IS THERE NO RECALL?  THERE'S NOT EVEN A TECHNICAL ADVISORY FROM MAZDA ABOUT THIS SERIOUS THREAT TO DRIVERS OF THIS CAR.  DOES SOMEBODY HAVE TO GET HURT FIRST?  SECOND, I GET THAT PARTS GO BAD - BUT ON SOMETHING AS IMPORTANT AS THE BRAKE SYSTEM, THE CAR SHOULD SOUND SOME SORT OF ALARM, LIGHT A DUMMY LIGHT....SOMETHING TO TELL THE DRIVER TO STOP DRIVING THE CAR AS THEY ARE IN IMMINENT DANGER.  TO NOT ADDRESS AT LEAST THIS SECOND ISSUES IS NEGLECTFUL OF MAZDA AND THE NTSB.  TO NOT ADDRESS THE MECHANICAL FAILURES BY WAY OF RECALL IS ALSO EXTREMELY NEGLIGENT.  *TR",
        "vin": "JM3TB3MA6A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2013",
        "dateOfIncident": "10/03/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546841,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INDIVIDUAL BROUGHT THE CAR IN TO THE DEALER COMPLAINING OF HIGH PITCHED SQUEAKING SOUND FROM BRAKES. DEALERSHIP CHECKED BRAKES AND SAID NOTHING WRONG. PICKED UP CAR NEXT DAY AND FELT THAT CAR NOT RIDING WELL AND LET IT SIT IN DRIVEWAY FOR 2 DAYS. WENT TO DRIVE AGAIN AND PEDAL WAS \"HARD\" AS IF IT WAS ON THE FLOOR. THEN WHENEVER I PRESSED ON THE PEDAL, I HEARD A HISSING SOUND AS IF AIR WAS LETTING OUT OF TIRES. CAR RESPONSE FOR SLOWING TO A STOP MUCH LONGER. CALLED DEALER ASAP  AND ARRANGED TO DROP CAR OFF THAT NIGHT. DEALER CALLED NEXT DAY TO SAY GOOD THING WE DROPPED CAR OFF NIGHT BEFORE AS THERE WAS LITTLE TO NO BRAKES LEFT DUE TO POWER BOOSTER FAILURE. HOW WAS IT THAT I COULD TELL BRAKES WERE GOING BUT DEALER COULD NOT? THIS IS A LEASED CAR. 10 WEEKS LEFT ON LEASE. PAST WARRANTY. $800 REPAIR. CLEARLY MAZDA IS HAVING AN ISSUE WITH THE 2010 CX-9 POWER BOOSTER DUE TO THE NUMBER OF COMPLAINTS LODGED ON THIS SITE. THE SERVICE DEPARTMENT FOR THE DEALER WORKED VERY HARD ON MY BEHALF AND WAS ABLE TO GET MAZDA TO COVER MOST OF THE REPAIR, THE DEALER PICKED UP ANOTHER $200 AND I HAD TO PAY $100. FAIR I GUESS BUT SINCE THIS IS A SERIOUS ISSUE MAZDA SHOULD RECALL THE CARS AND DO THE FIX FOR FREE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2013",
        "dateOfIncident": "09/28/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546467,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I GOT IN THE CAR, THE CHECK TIRE PRESSURE LIGHT WAS ON.  STOPPED AT A SERVICE STATION AND HAD THE TIRES CHECKED: ALL WAS FINE.    A FEW MILES LATER, THE CAR SUDDENLY MADE A LOUD WHINING NOISE AND THEN LOUD BANGING NOISES AND THE CAR FELT LIKE IT WAS SEIZING AND SHUDDERING.  PULLED TO THE SIDE OF THE ROAD, COULDN'T SEE ANYTHING AMISS UNDER THE HOOD.  RE-STARTED THE CAR AND HEADED HOME WITH THE LOUD WHINING NOISE UPON ANY ACCELERATION.      I CALLED THE DEALERSHIP THE NEXT DAY AND HAD IT TOWED TO THEM AS I FELT IT WAS UNSAFE TO DRIVE AFTER DOING SOME RESEARCH AND NOTING THE SYMPTOMS WERE SIMILAR TO WHAT OTHER VEHICLE OWNERS HAD REPORTED AS A TRANSFER CASE FAILURE.    UPON EXAMINATION THE DEALERSHIP DID SAY IT WAS A TRANSFER CASE FAILURE AND REPLACED IT THAT DAY.  I PICKED UP MY CAR TODAY AND SO FAR IT IS DRIVING AND HANDLING FINE.    SEVERAL MONTHS PRIOR TO THE VEHICLE FAILURE I HAD NOTED A VERY, VERY FAINT WHINING NOISE WHEN MY SPEED WAS BETWEEN 30 AND 40 MPH.  I HAD MY MECHANIC (NOT THE DEALER) TRY TO EXAMINE THE NOISE WHEN HE DID MY ROUTINE 30K MILE SERVICE.  THE NOISE WAS SO FAINT HE WAS NOT ABLE TO DETECT IT.  HE WASN'T ABLE TO FIND ANY MAZDA SERVICE BULLETINS THAT INDICATED A PROBLEM TO EXAMINE FURTHER.      BESIDES THAT FAINT WHINING NOISE THERE WERE NO OTHER INDICATIONS SUCH A DANGEROUS VEHICLE FAILURE WAS GOING TO OCCUR, AND THE CAR CHECKED OUT FINE AT THAT 30K ROUTINE SERVICE.      NOT SURE WHY THE CHECK TIRE PRESSURE LIGHT CAME ON IMMEDIATELY PRIOR TO THE FAILURE BUT THE DEALER SAID THEY \"RESET\" IT WHEN THEY REPLACED THE TRANSFER CASE.    THE DEALER WAS VERY PROMPT AND PROFESSIONAL IN THEIR RESPONSE AND TREATED US VERY WELL.  BUT I DO FEEL THIS ISSUE IS SO SERIOUS WE SHOULD HAVE RECEIVED NOTICE FROM MAZDA WITH A REQUEST TO GET THE TRANSFER CASE EXAMINED EARLIER.  *TR",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/06/2013",
        "dateOfIncident": "09/04/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542334,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DOWN AN ONRAMP TO A FREEWAY, I DEPRESSED THE BRAKE PEDAL AND THE CAR DID NOT RESPOND NORMALLY. I HAD TO PUSH FULL FORCE ON THE PEDAL TO GET THE CAR TO STOP JUST BEFORE REAR ENDING ANOTHER VEHICLE. THIS OCCURRED SEVERAL TIMES AFTER WITHOUT ANY WARNING LIGHT OR ANYTHING. I TOOK THE CAR TO THE DEALER AND FOUND OUT THAT THE BRAKE BOOSTER HAS STOPPED WORKING. THEY ARE GOING TO REPLACE THE BRAKE BOOSTER AND I HAVE TO PAY FOR IT. THIS CAR IS NO LONGER UNDER FACTORY WARRANTY BUT HAS BEEN WELL MAINTAINED BY A MAZDA DEALER ON A REGULAR SCHEDULE.",
        "vin": "JM3TB3MVXA0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2013",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536295,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW MAZDA CX 9 IN THE FALL OF 2010. AFTER A FEW MONTHS, I NOTICED THE TRACTION CONTROL \"TCS OFF\"  BUTTON  ILLUMINATED WHILE DRIVING UP A PAVED INCLINE. AFTER TURNING OFF THE ENGINE AND RESTARTING, THE TCS-OFF BUTTON SHUT OFF. THIS HAPPENED A COUPLE OF TIMES BEFORE MY FIRST SERVICING. I MENTIONED THE ISSUE TO THE MAZDA DEALERSHIP WHEN I WENT IN FOR REGULAR SERVICING. THEY CHECKED IT AND SAID THEY FOUND NO PROBLEM WITH IT. YET THE PROBLEM CONTINUED SPORADICALLY. THE TCS-OFF LIGHT OCCASIONALLY ILLUMINATES ON INCLINED ROADS, IN RAIN OR SNOW, WHEN DRIVING FROM A PAVED TO AN UNPAVED ROAD (OR VICE VERSA). STILL THE DEALERSHIP FOUND NO PROBLEMS DURING SERVICING. NOW IN THE THIRD YEAR OF DRIVING, I MENTIONED THE TCS AGAIN TO THE DEALERSHIP, AND THIS TIME THEY SAID, OH YES, IT IS A PROBLEM.. MAZDA RELEASED A BULLETIN ABOUT IT, SAYING THE TCS NEEDS TO BE REPAIRED FOR $340, AND THE CAR SHOULDN'T BE DRIVEN UNTIL IT'S REPAIRED. YET THIS IS THE CONDITION I'VE ALWAYS DRIVEN IT IN! AND OF COURSE, NOW MY WARRANTY HAS EXPIRED, AND I'M LIABLE FOR REPAIRS EVEN THOUGH THIS PROBLEM EXISTED RIGHT FROM THE VERY BEGINNING. THE DEALERSHIP HAS SAID THEY'D PUT IN A CALL, AND PERHAPS MAZDA WILL COVER AT LEAST PART OF THE COST.  IF IT HAD BEEN REPAIRED UNDER WARRANTY, I WOULDN'T BE LIABLE FOR THE REPAIR AND I WOULDN'T HAVE TO PAY FOR THE RENTAL CAR WHILE I'M WAITING. I'LL SEE HOW IT PANS OUT. VERY FRUSTRATING.  *TR",
        "vin": "JM3TB3MV7A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "07/27/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534545,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR FROM A DEALER THIS YEAR WITH $48,000 MILES. IT WAS IN TIP TOP SHAPE.   RECENTLY THE BRAKES ARE NOT WORKING. IT IS NOT THE BRAKE PADS, BUT A HISSING SOUND IN THE LINE AND NO BRAKES.  THE COST TO FIX IS AROUND $1500 AND I DON'T HAVE A CREDIT CARD OR THE MONEY TO FIX AT THIS TIME. IN RESEARCHING I AM NOT ALONE WITH THIS PROBLEM.  THERE ARE GOING TO BE SOME BAD WRECKS AND PROBLEMS IF THIS IS NOT ADDRESSED ASAP. I PRAY EVERYTIME I HAVE TO GO OUT AND STOP REALLY FAR BEHIND PUMPING AND TRYING TO MAKE THEM WORK.  *TR",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533815,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT THE BRAKES WOULD SPORADICALLY FAIL. THE CONTACT HAD TO CONTINUOUSLY PUMP THE BRAKES IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE  IT WAS DETERMINED THAT THE MASTER CYLINDER AND BRAKE BOOSTER NEEDED TO BE REPLACED. THE FAILURE AND THE CURRENT MILEAGE WAS 42,000.",
        "vin": "JM3TB2MA6A0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2013",
        "dateOfIncident": "07/08/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524009,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "11 YEAR OLD SON WENT TO OPEN THE PASSENGER DOOR UP FRONT AND THE DOOR HANDLE BROKE OFF.(THE DEALERSHIP TOLD ME THAT IT HAPPENED FROM NORMAL WEAR AND TEAR)..SCARY.  *TR",
        "vin": "JM3TB2MA5A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/06/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523477,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED DUE TO FAULTY BRAKE BOOSTER.  TWO OTHERS AT THE DEALERSHIP HAD THE SAME PROBLEM.  MAZDA COULD NOT IMMEDIATELY FIX THE PROBLEM BECAUSE THEY ARE OUT OF BRAKE BOOSTERS AND ARE NOT SURE WHEN ANY WILL BE AVAILABLE.  INDICATIONS ARE THAT THIS IS A WIDE SPREAD ISSUE AND SHOULD BE INVESTIGATED.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/27/2013",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522088,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM FAILURE INVOLVING MASTER CYLINDER AND BOOSTER. LEAKING INTERNALLY. REPLACEMENT COST OF $1500 RESEARCHED CX9 AND FOUND THIS PROBLEM IS WIDESPREAD AND NOT BEING ADDRESSED.WE HAD A MINOR FENDER BENDER THAT COULD HAVE BEEN MUCH WORSE. MAZDA USA HAS NOT ISSUED ANY BULLETINS AS OF YET.  *TR",
        "vin": "JM3TB2MAOAO"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520840,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TRANSFER UNIT LEAKING OIL, I MAY LOSE MY 4WD IF THIS IS NOT FIXED SOON. IT WILL COST $1150.00 TO FIX. THERE IS A HORRIBLE SMELL FROM THE LEAK THAT IS COMING INTO THE VEHICLE.  I HAVE HAD 4WD VEHICLES FOR YEARS AND NEVER RAN INTO AN INCIDENT WHERE SOMETHING LIKE THIS HAD TO BE REPLACED.  DEALER MADE THIS SEEM LIKE THIS IS A WEAR AND TEAR ISSUE NOT COVERED UNDER ANY WARRANTY.  *TR",
        "vin": "JM3TB3MV7A0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/10/2013",
        "dateOfIncident": "05/04/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519283,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: I1360001A. MAZDA CX9 2010. CONSUMER STATED AFTER 36,400 MILES ON CAR, A CATASTROPHIC BRAKE FAILURE OCCURRED ON A TWO YEAR OLD IMPECCABLY MAINTAINED VEHICLE. *LN",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "06/03/2013",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515703,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED THAT THE VEHICLE EXHIBITED AN OVERPOWERING BURNING ODOR FROM THE VENTS. IN ADDITION, A LOUD KNOCKING SOUND CAME FROM UNDER THE HOOD. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE TRANSFER CASE NEEDED TO BE REPLACED. THE DEALER TEST DROVE THE VEHICLE AND THE ENGINE SEIZED. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 26,900.   *TR",
        "vin": "JM3TB3MA4A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/01/2013",
        "dateOfIncident": "05/04/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514601,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC BRAKE FAILURE.  BRAKES WOULD NOT STOP VEHICLE.  VEHICLE TOWED FOR REPAIR.  *TR",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514349,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A STRANGE SMELL IN THE VEHICLE.  I DROVE A FEW BLOCKS TO HOME (LUCKILY).  ENGINE COMPARTMENT WAS SMOKING AS I PULLED IN THE DRIVEWAY.  THIS WAS DIAGNOSED BY A MECHANIC AS A CRACKED TRANSFER CASE. LEAKING FLUID FROM THE CASE WAS THE SOURCE OF THE SMOKE; NOT COVERED UNDER WARRANTY BY MAZDA NOR IS THERE A TSB FOR THE PROBLEM.  A QUICK SEARCH SHOWED THAT TRANSFER CASE PROBLEMS ARE COMMON FOR THIS VEHICLE. THIS COULD HAVE BEEN A SERIOUS ROAD HAZARD.  *TR",
        "vin": "JM3TB3MV5A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "07/04/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505508,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE WAS FIRST REPLACED IN JULY 2012 WITH AN OEM PART AND NOW AGAIN 8 MONTHS LATER.   LEAKING GEAR OIL, TERRIBLE SMELL COMING INTO COMPARTMENT OF CAR AND ALSO HAD CLUNKING SOUNDS IN FRONT DRIVER SIDE AXEL.  *TR",
        "vin": "JM3TB3MV3A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/15/2013",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493043,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JUNE OF 2012 I NOTICED THAT MY BRAKES MADE A HISSING SOUND AT RANDOM TIMES. I BROUGHT THE CAR INTO THE DEALER FOR A COMPLETE SERVICE AND BRAKE CHECK. I WAS TOLD THAT THE BREAKS WERE IN PERFECT CONDITION BUT THEY DID DO A BRAKE FLUSH. THE HISSING CONTINUED AT RANDOM TIME UNTIL THE WEEK OF 1/13/13 AT WHICH TIME THE HISSING WAS AT EVERY OCCASION THE BRAKES WERE ENGAGED. AND ON 1/15/13 THE BRAKES FAILED TO STOP THE VEHICLE. I BROUGHT THE CAR DIRECTLY INTO THE DEALERSHIP AND WAS INFORMED THAT IT WAS A LEAK IN THE BRAKE BOOSTER INTO THE MASTER CYLINDER. AFTER RESEARCHING THIS I HAVE FOUND THAT THIS IS A COMMON MALFUNCTION WITH THE CX9 AND I AM EXTREMELY FRUSTRATED. ALTHOUGH MAZDA ACKNOWLEDGED THE ISSUE ON EARLIER MODELS THEY ARE NOT ACKNOWLEDGING THE ISSUE ON THE LATER MODELS. THEY SHOULD HAVE TO STAND BEHIND THE PARTS AND VEHICLES THAT THEY MAKE. AND WHEN THEY KNOW THAT A CERTAIN PART OR SYSTEM HAS A HISTORY OF FAILING THEY SHOULD TAKE RESPONSIBILITY FOR THE ISSUE INSTEAD OF MAKING THEIR CUSTOMERS PAY FOR THEIR MISTAKES AND FAULTY PARTS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2013",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492189,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TELL US WHAT HAPPENED:  TRANSFER CASE IS BAD. DEALER SAYS THIS IS A KNOWN PROBLEM AND THAT MAZDA HAS THIS ISSUE WITH CARS DIRECTLY FROM THE FACTORY. KNOWN ISSUES SHOULD BE RECALLED! I BRING MY VEHICLE IN FOR REGULAR MAINTENANCE, I SHOULD NOT HAVE TO BREAK DOWN WITH CHILDREN IN THE CAR FOR A PROBLEM THAT MAZDA KNOWS MY CAR HAS! THE FAILURE IS SO WIDESPREAD THERE IS A NATION WIDE SHORTAGE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2012",
        "dateOfIncident": "10/13/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486728,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TICKING NOISE WAS HEARD AS I ACCELERATED THE VEHICLE AND AS LEFT TURNS WHERE MADE.  THE TICKING NOISE WAS LOUDER WHEN THE ENGINE WAS COLD. MAZDA RECOMMENDED TO REPLACE ENGINE IMMEDIATELY WITHOUT FURTHER INSPECTION. WHEN I ASKED WHAT WAS WRONG WITH THE VEHICLE MAZDA SAID SLUDGE WAS FOUND ON THE DIPSTICK. THEY BLAMED ME THE CONSUMER AND MAZDA WOULD NOT HONOR MY EXTENDED WARRANTY WHICH I PURCHASED THOUGH THEM AT THE TIME OF MY INITIAL PURCHASED OF THE VEHICLE.  *TR",
        "vin": "JM3TB2MA3A0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/26/2012",
        "dateOfIncident": "11/20/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486074,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE:  VEHICLE COULD NOT BE SAFELY DRIVEN. THE POWER LIFT GATE GOT STUCK FULLY OPEN AND WOULD NOT MOVE UP OR DOWN. IT COULD NOT BE SHUT MANUALLY.  THE ROD HOLDING THE DOOR WHICH IS PULLED DOWN INTO THE MOTOR WOULD NOT BUDGE.  THE VEHICLE COULD NOT BE SAFELY DRIVEN WITH THE HATCH STUCK OPEN LIKE THAT.  I HAD TO FIND A WAY TO DISENGAGE THE ROD FROM THE LIFE GATE.  STILL, EVEN WITH THE ROD DISENGAGED, IT COULD NOT BE FULLY SHUT. I WAS ABLE TO TIE DOWN THE HATCH HALF WAY SHUT SO THAT I COULD DRIVE IT TO A DEALERSHIP TO BE REPAIRED.    BY RESEARCHING SIMILAR PROBLEMS OTHER CX-9 OWNERS HAD, I WAS ABLE TO DETERMINE THAT INSULATION AROUND THE WORM GEAR OF THE MOTOR, BEHIND THE LEFT REAR PANEL, HAD LOOSENED AND GOTTEN CAUGHT IN THE WORM GEAR.  THIS IS A PROBLEM THAT IS RELATED TO CONSTRUCTION OF THE VEHICLE, SINCE THE INSULATION IS BEHIND A SECURED PANEL AND NOT ACCESSIBLE BY THE OPERATOR.  *TR",
        "vin": "JM3TB3MVA02"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "10/19/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482005,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 MAZDA CX-9 WITH APPROXIMATELY 41,000 MILES.  I HAVE BEEN DILIGENT IN MY MAINTENANCE-ALWAYS WITH A MAZDA DEALER.  THE CAR STARTED TO EXHALE SLIGHTLY WHEN BRAKING.  THE CAR THEN DID NOT WANT TO BRAKE/STOP WITHOUT PUMPING THE BRAKES REPEATEDLY.  I WAS ABLE TO STOP SUDDENLY BUT UNABLE TO STOP WITHOUT AMPLE WARNING AT STOP SIGNS, ETC.  THE VEHICLE WAS TAKEN TO MAZDA DEALERSHIP WHERE THEY TOLD ME THAT THE VACUUM BOOSTER AND MASTER CYLINDER WERE DEFECTIVE.  I WAS NOT ALLOWED TO DRIVE THE CAR BECAUSE IT WAS NOT SAFE.  THEY THEN TOLD ME THE NEXT MORNING THAT MAZDA/DEALERSHIP FOUND NO WARRANTY COVERING SUCH A MALFUNCTION/FACTORY DEFECT B/C I HAD PASSED THE 36,000 MILES MARK.  I WILL HAVE TO PAY $839 FOR A REPAIR TO DRIVE MY CAR THAT IS AN ISSUE WITH THE MANUFACTURING OF MY CAR.  THE DEALER TOLD ME I MUST CONTACT MAZDA USA DIRECTLY TO SEE IF THEY WILL PAY FOR IT-OTHERWISE I AM RESPONSIBLE.  I HAVE READ OTHER COMPLAINTS AND AN ARTICLE IN THE WALL STREET JOURNAL BOTH SITTING THE EXISTENCE AND EXPERIENCE OF THIS MALFUNCTION.  THE NHTSA WAS SAID TO BE INVESTIGATING THE ISSUE.  MAZDA SHOULD BE FORCED TO RECALL THE VEHICLES AND FIX THE MALFUNCTIONING BRAKE SYSTEM.  IT IS NOT THE FAULT OF THE CONSUMER BUT OF THE CAR MANUFACTURER.  *TR",
        "vin": "JM3TB3MA3A0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2012",
        "dateOfIncident": "10/11/2012",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480069,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A STREET WITH A 25 MPH SPEED LIMIT WHEN ALL OF A SUDDEN THE CAR HESITATED AND MADE SOME WEIRD NOISES.  I CONTINUED TO PULL OVER TO GET OUT OF THE WAY WHEN THERE WAS A HUGE BANG AND THE CAR CAME TO AN SUDDEN STOP.  I WAS ABLE TO GET TO THE SIDE OF THE ROAD.  SMOKE WAS COMING OUT OF THE ENGINE AREA AND THE CAR SMELLED TERRIBLE.  I JUMPED OUT, GOT MY DOG OUT AND CALLED 911.  THE FIRE DEPARTMENT AND POLICE CAME.  FOUND METAL PARTS ALL OVER THE ROAD.  SMOKE WAS MAINLY DUE TO OIL THAT WAS ALL OVER THE ENGINE AND BOTTOM OF CAR.  RIGHT NOW THE INITIAL DIAGNOSIS IS THAT THE TRANSFER CASING BLEW ALONG WITH A VARIETY OF OTHER PARTS.  THANK GOODNESS I WAS NOT ON THE FREEWAY.  ADDITIONALLY, I WAS LUCKY THAT THE LARGE PARTS THAT BLEW OFF THE CAR DID NOT PUT A HOLE IN THE BOTTOM OF MY CAR OR DAMAGE SOMEONE ELSE'S CAR.  *TR",
        "vin": "JM3TB3MA9A0"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/28/2012",
        "dateOfIncident": "07/25/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472754,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED HE ACCIDENTALLY LOCKED THE DOORS WITH THE REMOTE KEY AND THE PASSENGER WAS LOCKED IN THE VEHICLE. THE DOORS FAILED TO UNLOCK MANUALLY FROM THE INSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO FILED A REPORT AND DID NOT OFFER ANY ADDITIONAL ASSISTANCE. THE FAILURE MILEAGE WAS 35,000 AND THE CURRENT MILEAGE WAS 35,572.",
        "vin": "JM3TB3MA2A0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2012",
        "dateOfIncident": "08/18/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471567,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT WHILE DRIVING 25 MPH,  THERE WAS A DELAY IN STOPPING DISTANCE ONCE THE BRAKES WERE ENGAGED. THE CONTACT MENTIONED THAT HE HAD TO DEPRESS THE BRAKES REPEATEDLY IN ORDER TO BRING THE VEHICLE TO A COMPLETE STOP. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE VACUUM BOOSTER AND MASTER CYLINDER WERE DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 50,040.",
        "vin": "JM3TB2MA7A0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/23/2012",
        "dateOfIncident": "02/20/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452780,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME I EXPERIENCED THIS TERRIFYING ORDEAL WAS IN NOVEMBER OF 2011. SINCE THEN, I HAVE HAD IT HAPPEN TWO MORE TIMES. THE CAR ACCELERATES OF UP TO SPEEDS OF 90 MPH WITHOUT WARNING . ALL 3 INCIDENTS HAVE HAPPENED ON THE HIGHWAY. THE BRAKES SLOW IT DOWN, BUT DO NOT STOP IT. ALL 3 TIMES, I'VE BEEN LUCKY ENOUGH TO GET THE CAR TO THE SHOULDER AND RIDE DOWN THE MEDIAN , PUSHING THE EMERGENCY BREAK IN AND AT ONE POINT PUSHING IT INTO PARK. MAZDA KNOWS ABOUT THIS. THEREFORE THEY ARE LIABLE. MAZDA WILL TELL YOU IT'S A THROTTLE PROBLEM, THEY WILL TELL YOU THERE IS NO WEAR ON THE BRAKES....WELL, THAT'S BECAUSE WHEN THE CAR DOES THIS UNEXPECTED ACCELERATION, THE BRAKES ONLY GO PART WAY..ALMOST LIKE PUSHING AGAINST AIR. THIS IS A SERIOUS PROBLEM WITH THE COMPUTER AND POSSIBLY THROTTLE COMBINED. MY CAR IS NOT FIXED, IT'S ALSO DOING OTHER STUFF. MAZDA WANTS ME TO KEEP THIS CAR AND DRIVE IT. THEY ARE GIANTS, SO THE LITTLE PERSON LIKE ME DOES NOT MATTER TO THEM IT'S THE $$$$. BUT WHEN SOMEONE DIES, IT WILL COST THEM $$$$$$$$$$. THERE NEEDS TO BE A RECALL. I HOPE MORE PEOPLE COME FORWARD. IT COULD SAVE YOUR LIFE OR/AND SOMEONE YOU LOVE AND OTHER DRIVERS ON THE ROAD WHO ARE IN DANGER OF YOU HURTING/KILLING THEM. MY MAZDA DEALERSHIP HAVE WONDERFUL PEOPLE WHO WORK THERE. THEY ARE VERY UNHAPPY WITH MAZDA NOT TAKING CARE OF THIS PROBLEM. I WANT TO MAKE THIS CLEAR, IT'S MAZDA CORP THAT IS AWARE AND DOING NOTHING AND THEY HOLD THE MAZDA DEALERS HOSTAGE.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2012",
        "dateOfIncident": "02/24/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449467,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT WAS DRIVING 50 MPH WHEN THE VEHICLE SURGED FORWARD UNCONTROLLABLY. THE CONTACT WAS ABLE TO EVENTUALLY STOP THE VEHICLE AND THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 17,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2012",
        "dateOfIncident": "02/17/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449469,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MAZDA CX-9. WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE UNCONTROLLABLY ACCELERATED INTO ONCOMING TRAFFIC. THE BRAKES WERE APPLIED REPEATEDLY WHEN SUDDENLY THE VEHICLE CAME TO A STOP. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR DIAGNOSIS WHERE THE TECHNICIAN WAS UNABLE TO LOCATE THE PROBLEM. THE MANUFACTURER WAS NOTIFIED OF THE UNINTENDED ACCELERATION FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 18,000.",
        "vin": "JM3TB3MV8A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2011",
        "dateOfIncident": "09/18/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427053,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON I-495E IN MARYLAND BETWEEN EXITS 28 AND 29. CHANGED LANES AND PUT FOOT DOWN ON GAS PEDAL TO ACCELERATE. SUDDENLY FELT LIKE GAS PEDAL WAS STUCK AND THAT BRAKING COULD ONLY SLOW BUT NOT STOP ACCELERATION. MOVED OVER A FEW LANES TO RIGHT SHOULDER AND AFTER CONTINUED FAILURE OF BRAKES TO STOP ACCELERATION (AND CONSIDERABLE ENGINE TORQUE) BEGAN TO APPLY EMERGENCY BRAKE. SLOWED ACCELERATION FURTHER BUT STILL COULD NOT BRING CAR TO A FULL STOP. FINALLY PUT CAR INTO NEUTRAL AND CAME TO A STOP. HAD TOWED TO NEAREST MAZDA DEALER, YET AFTER SEVERAL DAYS OF TESTING THEY FOUND NOTHING WRONG WITH CAR AND COULD NOT REPLICATE. CLAIMED MANUFACTURER HAD NO RECORD OF SIMILAR PROBLEMS WITH THIS MODEL. ONLY THING THEY COULD THINK OF WAS THAT ALL-WEATHER FLOOR MAT MIGHT HAVE SLID OVER PEDAL AND KEPT IT DEPRESSED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424849,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC DIMMER SWITCHED TO LOW LIGHT SETTING IN BROAD DAYLIGHT FOR NO APPARENT REASON RESULTING IN A DARK INSTRUMENT PANEL. DRIVER HAD TO PULL ASIDE ON A BUSY HIGHWAY TO TRY TO RESTORE DAYTIME LIGHTING. THIS IS THE SAFETY ASPECT - LOSS OF PANEL INFORMATION WHILE DRIVING CAUSING AN EMERGENCY PULL OFF AND A DISTRACTION TO THE DRIVER. THE LIGHT SENSOR CONTROLLING BOTH THE PANEL AND THE DAY/NIGHT CAR LIGHTS WAS SET TO STANDARD - DEFAULT SETTING. IT APPEARS THAT THIS SETTING IS TOO HIGH. AFTER INSISTING WITH THE DEALERSHIP, IT WAS FOUND THAT THE SENSOR IS PROGRAMMABLE. IT WAS SET THEN TO LOW, WHICH SEEMED TO HAVE FIXED THE PROBLEM. THIS STILL NEEDS TO BE ADDRESSED BY THE MANUFACTURER IN A SYSTEMIC MANNER FOR THE SAFETY OF OTHER DRIVERS.",
        "vin": "JM3TB3MV4A0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2011",
        "dateOfIncident": "02/15/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384882,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A TICKING NOISE IN THE ENGINE WHEN IDLE. WHEN THE ENGINE IS COLD THE NOISE IS LOUDER. THE VEHICLE HAS BEEN TAKEN TO THE DEALER. THE DEALER STATES THAT THERE IS NOTHING TO FIX.  THE DEALER IS INFORMING ME THAT IT WAS THE CHARACTERISTICS OF THE VEHICLE AND IT WAS INSPECTED BY A MAZDA ENGINEER.  THE ENGINEER CLAIMS THAT THIS IS A NORMAL SOUND FOR THIS VEHICLE AND ENGINE.  I EXPLAINED THAT I HAD NOT HEARD THIS ON ANY OF THE OTHER CX-9'S I DROVE.  THE DEALER TRIED TO CLAIM IT WAS DUE TO DIFFERENT ENGINES.  I INFORMED THE DEALER THAT THEY ALL HAD THE SAME ENGINE.  AGAIN, HE SAID THERE IS NOTHING TO FIX (THE TICKING IS NORMAL).  I INFORMED THE DEALER THAT IT IS THE OPINION OF ANOTHER AUTOMOBILE SHOP THAT THIS SOUND IS NOT NORMAL AND SHOULD NOT BE OCCURRING (I WAS AT THE OTHER SHOP THE WEEK PRIOR).  THE DEALER RESPONDED BY SAYING THE OTHER SHOP IS NOT A MAZDA DEALERSHIP AND THEIR OPINION DOES NOT MATTER.",
        "vin": "JM3TB3MA5A0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "01/12/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376350,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 8AM JANUARY 12, 2011 I WAS DRIVING TO WORK IN A BLIZZARD.  I FELT A SLIGHT PAIN/PINCH FROM MY SEAT AND QUICKLY MOVED THINKING IT WAS SOMETHING FROM MY POCKET. I RESUMED DRIVING AND AGAIN FELT A MUCH GREATER PAIN CAUSING ME TO SWERVE AND CAUSE A NEAR COLLISION. VERY FRIGHTENED, I JUMPED OUT OF THE CAR (MID TRAFFIC IN BLIZZARD) TO FIND MY SEAT SCORCHED THROUGH APPARENTLY FROM THE SEAT WARMER.  THIS IS VERY CONCERNING. FORTUNATELY I WAS NOT DRIVING AT A GREATER SPEED AS IT COULD HAVE BEEN CRITICAL OR FATAL. WHAT DO I DO ABOUT THE SEAT? ALTHOUGH I HAVE TURNED THE WARMER OFF, I AM STILL AFRAID TO DRIVE THIS VEHICLE. *TR",
        "vin": "JM3TB2MV2A0"
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2010",
        "dateOfIncident": "08/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362818,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT INTERSTATE ROAD SPEED OF 65MPH ON A CLEAR NON-RAINING, 65 DEGREE DAY MY TRACTION CONTROL SYSTEM LIGHT TURNS ON AND STAYS ON FOR THE DURATION OF THE RIDE. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "12/30/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362284,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 MAZDA CX9. THE CONTACT STATED THAT WHENEVER SHE MADE A TURN, HER VISIBILITY WAS SEVERELY AFFECTED BECAUSE OF THE PLACEMENT AND SIZE OF THE REARVIEW MIRRORS. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE FAILURE MILEAGE WAS 0 AND THE CURRENT MILEAGE WAS APPROXIMATELY 13,000.",
        "vin": "JM3TB2MA2A0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "08/27/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356724,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 MAZDA CX-9. THE CONTACT STATED THAT THERE WAS A LOUD TICKING NOISE IN THE ENGINE. ONCE THE ENGINE WAS COLD THE NOISE BECAME EXTREMELY LOUD BUT WHEN IT WAS WARM THE NOISE CEASED. THE VEHICLE WAS TAKEN TO THE DEALER TWICE. THE FIRST TIME THEY STATED THAT THEY CORRECTED THE PROBLEM BY DOWN LOADING INFORMATION FROM THE COMPUTER IN REFERENCE TO THE PCM AND TOLD HER THAT IT WAS CORRECTED. WHEN SHE DROVE THE VEHICLE IT CONTINUED TO MAKE NOISE. SHE THEN RETURNED THE VEHICLE BACK TO THE DEALER AND THEY WERE DIAGNOSING THE FAILURE FOR AN ENTIRE WEEK. THE DEALER INFORMED HER THAT IT WAS THE CHARACTERISTICS OF THE VEHICLE AND IT WAS INSPECTED BY MAZDA ENGINEERS. THE ENGINEERS TOLD HER THAT IT WAS A NORMAL SOUND COMPARED TO OTHER VEHICLES AND THAT HER VEHICLE WAS JUST LOUDER THAN THE OTHERS. SHE DID NOT CALL THE MANUFACTURER BECAUSE THE DEALERSHIP TOLD HER THAT THEY WOULD CONTACT THEM. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,500.",
        "vin": "JM3TB3MV9A0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/02/2010",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323481,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE WITH DEAD BATTERY ON FOUR SEPERATE OCCASIONS. TOOK TO DEALERSHIP, BATTERY REPLACED. CHILD COMPLAINED THAT SEAT WAS HOT. NEXT DAY DEALER NOTIFIED AND CAR BROUGHT IN T ODEALERSHIP. A LOANER VEHICLE WAS RECEIVED. I WAS NOTIFIED HEATED SEATS WITH RECALL AND WOULD BE DISCONNECTED AT THIS TIME. THIS ALL OCCURED IN A TWO WEEK PERIOD IN JANUARY. MARCH 17 TOOK CAR BACK TO DEALERSHIP TO HAV RECALL ON HEATED SEATS FIXED. MARCH 25TH ATTEMPTED TO USE HEATED SEATS, DID NOT WORK. MAR 30TH VEHICLE BACK TO DEALERSHIP. HEATED SEATS WORKING AFTER THEY LOOKED AT VEHICLE. MARCH 31ST RIDING TO WORK IN PASSANGER SEAT, HEATED SEAT OPTION OFF, SEAT WARM TO TOUCH, BECAME HOTTER AND HOTER THEN WARM DURING 1 HOUR COMMUNTE.",
        "vin": "JM3TB2MA9A0"
    }
]