[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417672,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 Grand Marquis. Consumer writes in regard to Steering Rack and Shaft Safety Recall.  THE CONSUMER REQUESTED INFORMATION ABOUT THE COMPLETION OF THE VEHICLE'S RECALL REPAIR.",
        "vin": "2mebm7fv8ax"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151733,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/14/18 I RECEIVED A \"REGIONAL PROGRAM 13R01\" LETTER CONCERNING MY VEHICLE. IT INDICATES \"IN STATES WHERE HEAVY ROAD SALT IS USED, SEVERE CORROSION OF THE JOINTS ON THE LOWER INTERMEDIATE STEERING SHAFT CAN RESULT IN A STEERING COLUMN SEPARATION, LEADING TO A LOSS OF STEERING CONTROL, INCREASING THE RISK OF A CRASH\" (SEE ATTACHMENT).  ON 11/14/18 I VISITED A FORD DEALER FOR INSPECTION, AND THEY WERE UNWILLING TO PERFORM THE NECESSARY REPAIRS LISTED IN THE LETTER (SEE ATTACHMENT).  ON 11/15/18 I PHONED FORD MOTOR COMPANY CUSTOMER RELATION CENTER AT LISTED IN THE LETTER. I SPOKE WITH A REPRESENTATIVE NAMED \"LEN\". I INFORMED LEN I CURRENTLY RESIDE IN CALIFORNIA, HOWEVER I MAY BE RELOCATING WITH THE VEHICLE TO THE WASHINGTON D.C, MARYLAND REGION. I REQUESTED THE REPAIRS BE MADE AS A ONE TIME GOOD FAITH GESTURE. LEN INFORMED ME THE \"REGIONAL PROGRAM 13R01\" WAS VOLUNTARY, AND TO BE IMPLEMENTED ON VEHICLES AT FORD MOTOR COMPANY'S DISCRETION. LEN WAS UNWILLING, AND UNABLE TO OFFER ANY ASSISTANCE.    I UNDERSTAND FORD MOTOR COMPANY IS LOOK OUT FOR THEIR BOTTOM LINE. HOWEVER, IT FEELS LIKE THEY'RE DOING SO WHILE PUTTING MY FAMILY'S SAFETY AT RISK.   I WOULD LIKE TO REQUEST ANY ASSISTANCE, YOU ARE AUTHORIZED TO PROVIDE.  [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "2MEBM7FV0AX"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954151,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE BODY FAILURE__ ENGINE GOES TO DEAD IDLE AT HIGHWAY SPEEDS, LEAVING THE DRIVER AND PASSENGERS HELPLESS TO EXIT ONTO THE BREAKDOWN LANE OR SHOULDER IF YOU ARE NOT IN THE RIGHT HAND LANE WHEN IT HAPPENS, IE IF YOU ARE ON A 70 MPH INTERSTATE IN THE CENTER LANE WITH VEHICLES PASSING YOU ON BOTH SIDES WHILE YOU ARE HELPLESSLY COASTING TO A STOP UNABLE TO REMOVE YOURSELF FROM THE CENTER LANE, YOU WOULD BE SUBJECT TO CAUSE A CHAIN REACTION ACCIDENT. FORD REFUSED TO FIX THIS VEHICLE AT THEIR EXPENSE, AND WANTED TO CHARGE ME $189 DOLLAR FEE TO ANALYSE THE PROBLEM, WHEN THEY ALREADY KNEW WHAT WAS WRONG,(ACCORDING TO THE TECH PERSON I SPOKE WITH WHO SAID THEY HAVE REPLACED HUNDREDS OF THESE DEFECTIVE PARTS) THE PART COST $543 DOLLARS NOT INCLUDING LABOR ON A VEHICLE WITH 71 THOUSAND MILES ON IT. THIS IS AN EXTREMELY DANGEROUS SITUATION AND SHOULD BE RECALLED ASAP",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2016",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938683,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 MERCURY GRAND MARQUIS HAS A DEFECTIVE THROTTLE BODY, IT LEFT ME TERRIFIED AND STRANDED ON I-95 SOUTH IN THE CENTER LANE OF A 70 MPH 3 LANE INTERSTATE. THE ENGINE ALL OF A SUDDEN WENT TO DEAD IDLE, GAS PEDAL WAS INOPERATIVE, I STILL HAD STEERING AND BRAKES BUT DIDN'T HAVE THE ABILITY TO GET OVER ON THE SHOULDER WITH CARS AND BIG TRUCKS SCRAMBLING TO GET AROUND ME, THANK GOD IT WAS DAYLIGHT. WHILE WE HAD DECELERATED TO ABOUT 30 MPH MY WIFE STUCK HER HAND OUT THE PASSENGER WINDOW WAVING FRANTICALLY AND SOME EXTREMELY SMART TRUCK DRIVER REALIZED WE WERE IN TROUBLE AND LET US OVER TO THE RIGHT LANE IN FRONT OF HIM AN THEN ONTO THE BREAKDOWN LANE. AFTER SEVERAL ATTEMPTS OF SHUTTING DOWN AND RESTARTING IT FINALLY WENT BACK TO OPERATING PROPERLY, WHEN WE GOT HOME I CALLED FORD MOTOR COMPANY, THEY TOLD ME I HAD NO RECOURSE BUT TO PAY TO HAVE IT FIXED,(THE PART ALONE IS 546 DOLLARS, NOT INCLUDING LABOR) MY CAR IS LIKE BRAND NEW WITH 70,000 MILES ON IT AND IS ONLY DRIVEN ON LONG TRIPS. WE ARE RETIRED PEOPLE ON A SSI INCOME AND FEEL LIKE FORD SHOULD ASSIST US IN GETTING THIS REPAIRED BEING THAT WE ARE STILL ALIVE TO TALK ABOUT. I WAS TOLD BY FORD THAT THEY HAD NO RECORD OF US AS OWNERS OF THIS CAR, WE BOUGHT IT FROM A LINCOLN MERCURY DEALER AS A PROGRAMMED CAR BUT FORD ONLY KNOWS OF THE ORIGINAL OWNER SO IF THERE WAS EVER A RECALL ON IT WE WOULD NOT HAVE BEEN NOTIFIED. THIS COULD HAVE BEEN A DISASTER AND FORD SHOULD BE HELD RESPONSIBLE, HOW MANY ACCIDENTS HAVE TO HAPPEN OR LAWSUITS FILED BEFORE THE BEAN COUNTERS SAY ENOUGH, LETS RECALL THESE VEHICLES OR AT LEAST ASSIST PEOPLE WITH DEFECTIVE CAR PARTS?  *TR",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "12/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10725032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROAD WAS DRY AND BARE. I FELT A RIGHT REAR SKID (?\"BLACK ICE\"). I TRIED TO TURN STEERING WHEEL TO CORRECT THE SKID AND IT WAS LOCKED. IT JERKED OUT OF MY HANDS, THE ENGINE ROARED AND THE CAR FLEW TO THE LEFT ACROSS THE ROAD INTO A LARGE TREE. I HAD NO CONTROL OVER THE STEERING WHEEL. ON IMPACT OF THE TREE, THERE WAS NO BALLOON WITH AIR BAG DEPLOYMENT, ONLY PUNGENT FUMES AND WHITE FLECKS. THE CAR WAS TOWED AND TOTALED.",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10676464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS INVOLVED IN A HEAD ON COLLISION ON 01.15.2015.  IMPACT WAS EDGE OF ONE VEHICLE TO EDGE OF OTHER VEHICLE..  SHE WAS WEARING SEAT BELT.  HER SIDE SEAT AND STEERING WHEEL AIR BAGS DEPLOYED.  MY WIFE STILL HIT THE WINDSHIELD WITH HER HEAD.  NO SECONDARY IMPACTS OCCURRED (I.E., 3RD VEHICLE OR FIXED OBJECT).  ACCIDENT SHEARED THE DRIVER'S WHEEL AND BRAKE ASSEMBLY OFF COMPLETELY.  COMPLETELY SPLITTING THE ALUMINUM WHEEL IN HALF.  FRAME WAS ALSO BENT UNDER THE WHEEL-WELL HOUSING TOWARDS THE FIREWALL.    I AM INQUIRING AS TO WHETHER THERE ARE ANY OTHER RECORDED INCIDENTS OF SIMILAR OCCURRENCES WITH THIS VEHICLE.  SEEMS STRANGE THAT WITH THESE SAFETY MEASURES IN PLACE, AND UTILIZED A DRIVER CAN STILL HIT THE WINDSHIELD.  (NOT ABSOLUTELY CERTAIN OF THE VEHICLE'S MILEAGE... BUT IT ISN'T HIGH.)  *TR",
        "vin": "2MEBM7FV9AX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS. WHILE DRIVING AT AN UNKNOWN SPEED, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE DEALER REPLACED THE POWER STEERING RACK. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 28,546.    UPDATED 11/21/14*CN   UPDATED 5/6/2015 *JS",
        "vin": "2MEBM7FV6AX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "04/07/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SPLICING ON ALMOST ALL ELECTRICAL SYSTEMS HAD COME APART.   AFFECTED WERE THE RADIO, CLOCK, WINDOWS, POWER SEATS, LIGHTS, DOOR LOCKS, TRUNK RELEASE INSIDE CAR, LOW TIRE MONITOR WARNING  LIGHT STAYED ON CONSTANTLY, SEAT BELT WARNING LIGHT STAYED ON, WARNING BELL FOR KEY IN IGNITION STAYED ON EXCEPT WHEN CAR WAS MOVING, DOME LIGHT WOULD NOT GO OFF WHENEVER YOU GOT OUT OF CAR.   SOME OF THESE PROBLEMS WERE CONSTANT AND SOME WERE INTERMITTENT.   AS A RESULT OF THE LOCKING PROBLEM, OUR VEHICLE WAS STOLEN, BUT THANKFULLY FOUND WITH NO DAMAGE.  WITH NO HELP FROM OUR LOCAL FORD DEALER, I FINALLY CALLED THE FORD MOTOR CO. COMPLAINT DEPT. AND WAS TOLD TO GET A DIAGNOSTIC TEST RUN ON IT, WHICH I DID AT ANOTHER DEALERS, AND THAT IS WHEN THEY FOUND THE WIRING SPLICING PROBLEM.   AS A RESULT OF THE ELECTRICAL PROBLEMS, IT HAS BLOWN THE MOTORS WHICH CONTROL BOTH THE POWER SEATS.   I HAVE HAD THE WIRING FIXED BUT NOT THE MOTORS REPLACED DUE TO THE EXPENSE INVOLVED.   I FEEL LIKE I HAVE A REAL LEMON ON MY HANDS AS WELL AS AN UNSAFE VEHICLE.  *TR",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592070,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON EXPRESSWAY AT NIGHT IN A DRIVING RAINSTORM, MY WIPERS QUIT WORKING. I WAS ABLE TO PULL OVER UNTIL THE RAIN STOPPED, BUT COULD HAVE BEEN A DISASTER. ON APRIL 23RD THE DEALER DIAGNOSED THE WIPER MOTOR ASSEMBLY WAS BAD. P/N 8W7Z*17508*A. I HAVE FOUND SINCE THE REDESIGN OF WIPER MOTOR ASSEMBLY IN 2003, THAT THE WIPER MOTORS GET WATER IN THEM AND SHORT OR CORRODE THE INTEGRAL WIPER ELECTRONIC BOARD. EVEN THOUGHT THE FAILURE RATE MAY BE LOW, THE POTENTIAL FOR A DISASTER, LIKE I COULD OF HAD IS GREAT. THIS PART SHOULD BE REDESIGNED AND EFFECTED VEHICLES RECALLED. I HAVE NO COMPLAINT WITH THE DEALER WORK.   *TR",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/13/2014",
        "dateOfIncident": "07/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10605276,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY, TUESDAY 23, 2014,  I BACKED OUT OF A PARKING SPOT ON THE PARKING DECK ABOUT 15 FEET AND PUT THE CAR IN DRIVE. IT LURCHED FORWARD AT A TREMENDOUS HIGH SPEED AND ALTHOUGH I HIT THE BRAKES, THE AUTO SLAMMED INTO THE RETAINING WALL AT THE PARKING SPOT I  HAD JUST BACKED OUT OF. I WAS WEARING MY SEAT BELT AND THE AIR BAG DEPLOYED. I RECEIVED MINOR BRUISING ON MY ARMS, LEGS AND RIBS DUE TO THE AIR BAG DEPLOYMENT. THIS AUTO HAS SIDE AIR BAG AS WELL, BUT ONLY THE DRIVE AIR BAG DEPLOYED. I WAS CHECKED OUT BY A MEDIC, WHO WAS STAYING AT THE RESORT AND HEARD THE CRASH. THERE WERE NO WITNESSES. EMS ARRIVED AND CHECKED ME OVER. A POLICE REPORT WAS FILED. ..UPDATED 06/26/14 *BF",
        "vin": "2MEBM7FV3AX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "11/20/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY MARQUIS. THE CONTACT STATED THAT SHE ATTEMPTED TO HAVE THE VEHICLE REPAIRED FOR NHTSA RECALL CAMPAIGN NUMBER:13V385000. THE CONTACT WAS ADVISED THAT THE PARTS WERE NOT AVAILABLE AS A RESULT THE REPAIR COULD NOT BE PERFORMED. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "2MEBM7FV6AX"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS. THE CONTACT STATED THAT THE AIR CONDITIONING SYSTEM FAILED. THE AIR CONDITIONING WOULD ERRONEOUSLY BLOW THROUGH THE DEFROST SYSTEM. THE VEHICLE WAS TAKEN TO THE MECHANIC FOR INSPECTION WHERE THE FAILURE WAS LOCATED AT THE TEMPERATURE CONTROL UNIT. THE CONTACT ALSO STATED THAT THE TEMPERATURE CONTROL UNIT WAS REPLACED TWICE PRIOR TO THE RECENT FAILURE. THE MANUFACTURER ADVISED THAT THEY WERE AWARE OF THE FAILURE AND THAT THE TEMPERATURE CONTROL UNIT WAS ON BACK ORDER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 9,000 AND THE CURRENT MILEAGE WAS 78,000.",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "06/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532332,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS. THE CONTACT STATED THAT THE AIR CONDITIONING UNIT FAILED AND WOULD ONLY EMIT AIR FROM THE DEFROSTER AND UNDER SEAT VENTS. THE CONTACT ALSO STATED THAT THE TRUNK LIGHT ILLUMINATED EVEN THOUGH THE TRUNK WAS CLOSED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE AIR CONDITIONER AND TRUNK LATCH NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 63,000.   UPDATED 09/05/13*LJ",
        "vin": "2MEBM7FV6AX"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/04/2013",
        "dateOfIncident": "12/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496292,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A PARKING SPACE AND HAD ALMOST COME TO A STOP WHEN THE VEHICLE SUDDENLY LURCHED FORWARD & HIT A (VACANT) STORE FRONT.  I FEEL THE VEHICLE ACCEL-  ERATED ON IT'S OWN AS I WAS APPLYING THE BRAKE AT THE TIME, MY FOOT DID NOT SLIP OFF  OF THE BRAKE.  THE VEHICLE IS EQUIPPED WITH \"DRIVE BY WIRE\" OR, NO CABLE IS ATTACHED   TO THE THROTTLE BODY FROM THE ACCELERATOR.  THE DEALER REPAIRED THE FRONT END OF  THE VEHICLE AND EXTENSIVELY EXAMINED THE THROTTLE SYSTEM.  NO APPARENT CAUSE WAS  DETERMINED AND THEY TOLD US IT MAY NEVER HAPPEN AGAIN.  WE HAVE TRADED THE VEHICLE IN SINCE REPAIRS WERE COMPLETED DUE TO LACK OF CONFIDENCE IN IT.   *TR",
        "vin": "2MEBM7FV7AX"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/13/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425187,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS. WHILE DRIVING APPROXIMATELY 3 MPH THE CONTACT HEARD A LOUD THUMPING SOUND COMING FROM THE REAR END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THREE DEALERS FOR DIAGNOSTIC TESTING. THE TECHNICIANS WERE UNABLE TO DUPLICATE THE FAILURE. THE LAST DEALER THE VEHICLE WAS TAKEN TO STATED THE SHOCKS SHOULD BE REPLACED WITH HEAVY DUTY SHOCKS. THE VEHICLE WAS NOT REPAIRED BECAUSE THE PART WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 2,596. UPDATED 10/12/11*LJ  UPDATED 3/30/12 *CN",
        "vin": "2MEBM7FV4AX"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/30/2011",
        "dateOfIncident": "08/17/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422549,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GOODRICH CORPORATION",
                "productMake": "GOODRICH",
                "productModel": "VELVET-RIDE REAR SUSPENSI",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS WITH GOODYEAR WINDSHIELD WIPER BLADES (NA), MODEL NUMBER: 765-22. THE CONTACT STATED THAT THE WIPER BLADES WERE DEFECTIVE AND WOULD NOT REMAIN ATTACHED TO THE FRAME WHILE DRIVING. THE WIPER BLADE SET WAS REPLACED WITH A DIFFERENT MANUFACTURER.  THE CURRENT AND FAILURE MILEAGE WAS NOT AVAIALBLE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/26/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397952,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS LS. THE CONTACT STATED THAT WHENEVER IT WOULD RAIN, WATER WOULD ENTER THE VEHICLE THROUGH THE REAR DRIVER SIDE DOOR. THE DOOR WAS SECURED BUT THERE WAS A SMALL ACCUMULATION OF WATER IN THE REAR FLOORBOARD AREA. IN ADDITION, ALL FOUR DOORS WERE IMPROPERLY POSITIONED DURING INSTALLATION AND DID NOT TIGHTLY CLOSE. THE FAILURE WAS NOT DIAGNOSED. THE CONTACT WAS IN THE PROCESS OF NOTIFYING THE DEALER OF THE FAILURE. THE FAILURE MILEAGE WAS 4,000.",
        "vin": "2MEBM7FV2AX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2011",
        "dateOfIncident": "04/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395984,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BODY SIDE MOLDINGS ON MY VEHICLE COMES LOOSE, AND COULD COME OFF AND BECOME AIRBORNE, DAMAGING OTHER VEHICLES. THIS DEFECT HAS BEEN NOTICED ON OTHER 2010 MERCURY MARQUIS. THE DEALER HAS BEEN GREAT, AND IS ORDERING A COMPLETE SET. THEY CANNOT TELL ME IF NEW ONES WILL HAVE THE DEFECT OR NOT? I HAVE NO COMPLAINT WITH THE DEALER. I WOULD LIKE TO KNOW IF FORD HAS CORRECTED THE PROBLEM WITH DELAMINATION IN THE NEW PARTS.  *TR",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2010",
        "dateOfIncident": "11/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367280,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 MERCURY GRAND MARQUIS.  WHILE DRIVING APPROXIMATELY 20 MPH THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD.  ONCE THE VEHICLE WAS STOPPED IT BEGAN TO SHAKE AND LUNGE FORWARD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE HE WAS INFORMED THAT THE THROTTLE BODY NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 21,680.",
        "vin": "2MEBM7FV8AX"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2010",
        "dateOfIncident": "12/19/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 GRAND MARQUIS. THE VEHICLE WAS PURCHASED BRAND NEW ON OCTOBER 13, 2009. WHILE THE CONTACT WAS REMOVING SNOW FROM THE HOOD WITH A BROOM, SHE NOTICED THAT THE ROOF HAD COLLAPSED. THE DEALER ADVISED THE CONTACT TO INFORM THE HOME OWNERS INSURANCE COMPANY THAT A TREE FELL ON TOP OF THE ROOF. A REPORT WAS FILED WITH THE MANUFACTURER WHO ADVISED THE CONTACT TO RETURN THE VEHICLE TO THE DEALER. THE DEALER REMOVED THE HEAD LINERS, BROKE SEVERAL CLIPS AND SAID THAT THE VEHICLE ASSEMBLY PRODUCTION WAS NOT A CONCERN. THE FAILURE MILEAGE WAS 2,410 AND THE CURRENT MILEAGE WAS 2,524.",
        "vin": "2MEBM7FVXAX"
    }
]