[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322891,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I REALLY DON'T UNDERSTAND HOW USED CAR DEALERSHIP HOME TOWN AUTO CAN SELL YOU A CAR THEY KNOW HAVE AN OPEN RECALL ON A VEHICLE BUT FAIL TO LET THE AMERICAN CONSUMER KNOW AT THE TIME OF PURCHASE IN 2020,THEN CALL YOU A COUPLE OF DAYS LATER SAYING THEY NEED YOU TO COME AND SIGN A PAPER SAYING AS FAR AS THEY KNOW THERE'S NO OPEN RECALL ON THE VEHICLE. I ASKED WHY? IS THERE A RECALL ON MY CAR? I WAS TOLD NO. THE ONLY WAY I FOUND OUT THERE IS A RECALL ON MY CAR SINCE 2009 WAS FROM MY INSURANCE PROVIDER. SO I CALLED THE CAR DEALERSHIP AND ASKED HOW CAN YOU SELL ME A CAR THAT HAS A OPEN RECALL 2009. HE TELLS ME OH YEAH YOU CAN CALL THE 1-800 AND GET IT FIXED FOR FREE. I ASKED SO YOU KNEW AT THE TIME OF PURCHASE THERE IS A RECALL?THEN HE SAID NO I DON'T WORK IN SALES.THEN HE SAID IT WAS BASICALLY MY PROBLEM NOW. I FEEL THIS SHOULD BE ILLEGAL.THIS CAR COMPANY SHOULD BE INVESTIGATED.OH BTW THIS IS MY 2ND CAR IN 1YR BECAUSE MY 1ST CAR HAD A CRACKED ENGINE AND THEY RIGGED THE BACK SHOCK BECAUSE THE CAR WAS IN A WRECK&THEY FAILED TO TELL ME THE TITLED WAS SALVAGED!",
        "vin": "4A4JM3AS1AE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11154199,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 MITSUBISHI ENDEAVOR. WHILE THE CONTACT'S VEHICLE WAS STATIONARY, IT WAS REAR ENDED BY ANOTHER VEHICLE AND STRUCK A CONCRETE MEDIAN. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT'S CHILD SUSTAINED INJURIES TO THE HEAD, WHICH REQUIRED MEDICAL ATTENTION. THE CONTACT NOTED THAT THE CHILD'S HEADACHE WAS WITHSTANDING AFTER MEDICAL ATTENTION WAS RECEIVED. THE VEHICLE WAS TOWED TO A JUNK YARD AND DEEMED DESTROYED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE CRASH. THE FAILURE MILEAGE WAS 122,000.",
        "vin": "4A4JN2ASXAE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150918,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THAT MITSUBISHI ENDEAVOR 2010 BUT WITHIN 9 YEARS, THE PIPE FILLING FROM GAS CAP TO THE TANK HAS A BIG HOLE AND GAS FALLING ON THE FLOOR WHEN I AM FILLING AT THE GAS STATION. WHEN I CHECK CARS.COM I SAW A RECALL: 10V065000 BUT I CHECK WITH THE MITSUBISHI DEALER I AM TOLD THAT THERE ANY RECALL FOR MY CAR.",
        "vin": "4A4JM2AS0AE"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113310,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR INTO THE DEALERSHIP AND WAS TOLD THEY CANNOT FIX MY PROBLEM DUE TO THE FACT MITSUBISHI STOPPED MANUFACTURING THE PART NEEDED.  THE CAR IS ONLY EIGHT YEARS OLD!  YES THEY DISCONTINUED THIS MODEL BUT THE PARTS?  THIS IS RIDICULOUS, MY AIR BAG SENSOR IS DISABLED AND TURNED OFF WHICH IS A SAFETY ISSUE!  I CANNOT FIX IT AND I WONDER IF I CAN EVEN SELL IT DUE TO THE FACT IT HAS NO WORKING AIR BAGS.  HOW CAN THEY GET AWAY WITH THIS?  I THOUGHT THE NHTSA WAS A PLACE WHERE CONSUMERS OF CARS SOLD IN THIS COUNTRY COULD GO TO HELP REMEDY THESE KIND OF PROBLEMS.",
        "vin": "4A4JN3AS1AE"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110564,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS WARNING LIGHT IS ON AND MITSUBISHI TOLD ME THEY CAN'T REPAIR THIS SINCE THEY STOPPED MAKING THE PART AFFECTED.  IT NEEDS A NEW SENSOR WHICH CONTROLS THE AIR BAGS AND SEAT BELT ASSEMBLY. I WAS TOLD IF IN AN ACCIDENT THE AIR BAGS MAY NOT DEPLOY OR EVEN ACCIDENTALLY DEPLOY IN A NO ACCIDENT SCENARIO.   THE CAR IS ONLY EIGHT YEARS OLD AND THEY STOPPED MAKING THE PART?  THIS DEFINITELY COMPROMISES SAFETY!",
        "vin": "4A4JN3AS1AE"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018753,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER CONTINUE TO FILL THE DRIVER'S SIDE FLOOR. THE WATER CONTINUES TO DRIP ON THE BRAKES AND ACCELERATOR.",
        "vin": "4A4JM2AS1AE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908246,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 MITSUBISHI ENDEAVOR. THE CONTACT STATED THAT FUEL LEAKED FROM THE VEHICLE WHEN IT WAS REFUELED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL FILLER PIPE WAS LEAKING AND FRACTURED DUE TO CORROSION. THE FUEL FILLER PIPE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V065000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 74,622.",
        "vin": "4A4JN3AS0AE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "01/04/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10388209,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKES ARE APPLIED, MOISTURE APPEARS ON ALL FOUR CALIPERS. RUST ON ALL CALIPERS. RESIDUE ON MASTER CYLINDER AS WELL. REFILLED BRAKE FLUID UNDER HOOD TWICE. STRONG BURNING BRAKE FLUID SMELL WHEN DRIVING. NEW VEHICLE WITH 4K MILES.  CAR TOWED TO NEAREST DEALER, EUGENE OR MITSUBISHI. SERVICE DEPT LOOKED AT BRAKES AND RAN TESTS. SERVICE MANAGER, SAYS THEY DON'T KNOW WHERE MOISTURE IS COMING FROM AND CAN'T FIND SOURCE OF LEAK. ALTHOUGH PROBLEMS WITH BRAKES ARE DANGEROUS, AND THERE IS EVIDENCE OF A SERIOUS PROBLEM, DISTRICT REP WILL NOT AUTHORIZE SERVICE DONE TO BRAKES BECAUSE SOURCE WAS NOT PIN POINTED. I CALLED CORPORATE AND OPENED A CASE BUT THEY WILL NOT HONOR WARRANTY. I NEED SERVICE DONE. I CAN'T TAKE IT ELSEWHERE BECAUSE IT WILL VOID WARRANTY. LEAKING BRAKE FLUID IS DANGEROUS. NO BRAKE FLUID MEANS NO STOPPING. RUSTED CALIPERS CAN SEIZE UP WHICH IS ALSO DANGEROUS. BRAKE PADS SOAKED WITH BRAKE FLUID WON'T WORK. SHOULD NOT BE HAVING BRAKE ISSUES ON A BRAND NEW VEHICLE. I JUST WANT MITSUBISHI TO HONOR THEIR WARRANTY, REPLACE THE RUSTED PARTS, FIND THE LEAKING PARTS, REPLACE THE LEAKING PARTS, AND FLUSH THE BRAKE FLUID.",
        "vin": "4A4JM3AS2AE"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327007,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ENDEAVOR",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATES OR TRIES TO STALL WHILE MAKING RIGHT HAND TURNS AS WELL AS THE STEERING DOES NOT ALWAYS WANT TO AUTO CORRECT AFTER COMPLETION OF A RIGHT HAND TURN. THIS SEEMS TO BE VERY DANGEROUS WHEN TRYING TO TURN ON A BUSY STREET. *TR",
        "vin": ""
    }
]