[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MUSTANG",
                "productModel": "SHELBY GT 500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO TRADE MY CAR IN, BECAUSE I REALLY NEED TOO!!!!! BUT I CANT BECAUSE OF THIS RECALL, AND APPARENTLY CANT GET IT FIXED YET BECAUSE THEY HAVE NO SOLUTION. WHAT DO I NEED TO DO TO FILE A SETTLEMENT OR CLAIM SOOO I CAN HURRY UP AND TRADE MY CAR IN. IVE GOT TO TRADE IT IN LIKE ASAP!!!!!!!!",
        "vin": "1ZVBP8JS5A5"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725800,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MUSTANG",
                "productModel": "SHELBY GT 500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH THE CRUISE SET AND ALL OF A SUDDEN THE CRUISE WENT OFF AND THE CAR JERKED AND THE WRENCH SYMBOL CAME ON.   I ATTEMPTED TO SET THE CRUISE AGAIN AND IT WOULD NOT ENGAGE.  WHEN I APPROACHED A RED LIGHT AND ATTEMPTED TO ACCELERATE, THE CAR STRUGGLED FOR A BIT BEFORE GOING AGAIN.    THIS SAME THING HAPPENED TO MY MOM'S 2010 MERCURY MILAN, WHICH ENDED UP BEING RECALLED.    UPDATED 09/11/15*LJ",
        "vin": "1ZVBP8CHXA5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MUSTANG",
                "productModel": "SHELBY GT 500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2011 FORD MUSTANG 5.0, I'VE HAD TWO VERY SCARY INCIDENTS. THEY BOTH SEEM TO ME AS THOUGH THEY ARE DEALING WITH THE TRANSMISSION WHICH IN MY CASE IS THE 6-SPEED MANUAL. WHILE DRIVING THE CAR VERY SPIRITED I TRY TO UPSHIFT WITH THE CLUTCH PEDAL FULLY DEPRESSED (GEAR UNKNOWN AND RPM'S UNKNOWN)AND THE CAR WONT ENGAGE. I JUST ASSUMED I WAS MISSING A GEAR, BUT AFTER TRYING TO FORCE THE CAR INTO GEAR WITH THE CLUTCH FULLY DEPRESSED, THE REAR TIRES BEGIN TO LOCK CAUSING THE CAR TO VIOLENTLY FISHTALE WHILE ON THE HIGHWAY. AS YOU CAN SEE THIS CAN BE A DANGEROUS SITUATION IF DRIVING THE CAR IN AN AGGRESSIVE MANNER. THE INCIDENT ONLY OCCURS WHILE DRIVING AGGRESSIVELY, BUT IT HAS OCCURRED TWICE AND BOTH TIMES THE REAR TIRES BEGIN TO LOCK CAUSING THE CAR TO FISHTALE AT SPEEDS IN EXCESS OF 70 MPH.  *TR",
        "vin": "1ZVBP8CF3B5"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339671,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MUSTANG",
                "productModel": "SHELBY GT 500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 FORD MUSTANG. THE CONTACT STATED WHILE APPLYING THE BRAKES AND PULLING INTO A DRIVEWAY, THE VEHICLE ABNORMALLY YET SLIGHTLY ACCELERATED. AS HE PROCEEDED TO DRIVE INTO THE GARAGE, THE FAILURE OCCURRED ONCE MORE. THE VEHICLE WAS TOWED TO THE DEALER. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE.  THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE. THE VEHICLE WAS THREE WEEKS OLD AT THE TIME OF THE FAILURE. THE FAILURE MILEAGE WAS 1,644 AND THE CURRENT MILEAGE WAS 1,701.",
        "vin": "1ZVBP8EM8B5"
    }
]