[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443271,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "My 370 Z Nissan was towed January 16, 2018 because of a problem with the electronic steering mechanism. The mileage at that time was 35,357 miles. Upon entering the car the steering wheel had locked and I could not start my car.  Fortunately the car was in the garage at the time.  total for repairs was $949 On March 29, 2018 a few months following with mileage at 35,857 miles I again experienced a steering lock problem and the car had to be towed once again …the repairs were covered at that time by warranty since this device was already replaced in January. December 9, 2021 I again experienced a problem with the steering lock mechanism mileage is 42,505 at this point on the car repairs were almost $1800  I find this a huge safety problem because I am a female and could be stranded at any time at any given place with a vehicle that wont operate….  This does concern me as I do travel out of town alone at times.  I also drive at night from time to time . I did ask that the mechanism be disabled and was told by the mechanic at Nissan they were not allowed to disable the mechanism.  My husband spoke with consumer affairs at Nissan and they were not willing to help us with this problem.  I have considered selling the car but I’m not comfortable doing so without disclosing this problem to a potential buyer. My husband I researched this issue online and it appears that many people have experienced the same issue with their 370 Z vehicles",
        "vin": "JN1Az4FH4AM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405221,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "****NOTE - NEED MORE INFORMATION. CONTACTED CONSUMER - 3/29/2021, 4/21/2021****    FLASHING AIR BAG LIGHT AND THE PASSENGER AIRBAG LIGHT ALWAYS SAYS IT IS OFF EVEN WITH PASSENGERS IN THE SEAT. AIR BAG LIGHT ON THE DASH FLASHES AT ALL TIMES.  ## VIN FAILED ## NISSAN, INFINITI, DATSUN 2010#VPIC# 1 - CHECK DIGIT (9TH POSITION) DOES NOT CALCULATE PROPERLY; 4 - VIN CORRECTED, ERROR IN ONE POSITION ONLY (INDICATED BY ! IN SUGGESTED VIN), MULTIPLE MATCHES FOUND; 14 - UNABLE TO PROVIDE INFORMATION FOR ALL THE CHARACTERS IN THE VIN. #VPIC# ##",
        "vin": "JN1AE4EH9AM"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399469,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS LIGHT CAME ON ON THE DASH.  CAR IS 10 YEARS OLD, BUT ONLY HAS 24073 MILES ON IT.  NISSAN DEALER IDENTIFIED ERROR CODE B1018.  OCCUPANT SENSOR IN THE FRONT PASSENGER SEAT FAILED.  NISSAN QUOTED $4767 TO REPLACE THE PASSENGER SEAT BASE ASSEMBLY.  STATED SENSOR WAS INTEGRATED INTO THE SEAT AND COULD NOT BE REPLACED WITHOUT REPLACING THE ENTIRE SEAT CUSHION.  IT IS INTERESTING TO NOTE THAT NISSAN HAD A \"VOLUNTARY RECALL CAMPAIGN\" FOR THE EXACT SAME ISSUE ON THE 2007-2008 NISSAN 350Z.  NISSAN TECHNICAL SERVICE BULLETIN 08-095D IS GERMANE.  THE PROBLEM IS DESCRIBED AS A FAILED OCCUPANT CLASSIFICATION SYSTEM VARISTOR IN THE FRONT PASSENGER SEAT CUSHION.  THIS IS A SENSOR THAT LETS THE CAR KNOW WHETHER OR NOT AN AIRBAG SHOULD FIRE, DEPENDING ON WHETHER OR NOT THERE IS A PASSENGER IN THAT SEAT.   DID NISSAN EVER CORRECT THIS SAFETY ISSUE? I CONTACTED NISSAN CONSUMER AFFAIRS, (CASE 42872979), BUT THEY WERE NO ASSISTANCE (ONLY STATING THAT THE VEHICLE WAS OUT OF WARRANTY).  THIS IS A SAFETY ITEM THAT, IN MY OPINION, NISSAN SHOULD WARRANTY FOR THE LIFE OF THE VEHICLE, OR AT A MINIMUM ACKNOWLEDGE THAT THEY HAVE HAD A PROBLEM WITH THE SAME COMPONENT ON THE PRIOR MODEL (350Z).  THE SRS LIGHT COMES ON ON THE DASH, AND BLINKS INTERMITTENTLY.  THE PASSENGER AIRBAG LIGHT NEAR THE PASSENGER SEAT STAYS PERMANENTLY LIT.  IN VIRGINIA (WHERE I LIVE), YOU CANNOT PASS STATE SAFETY INSPECTION WITH THE BLINKING SRS LIGHT ON YOUR DASHBOARD DISPLAY.  HAS TO BE FIXED.  I REPAIRED THE ISSUE MYSELF BY ACQUIRING A SECOND HAND (USED) SEAT. HOWEVER, AS I PREVIOUSLY STATED, NISSAN SHOULD PAY FOR THIS PROBLEM THAT THEY PREVIOUSLY ACKNOWLEDGED IN THE TECH SERVICE BULLETIN (FAULTY OCCUPANT SENSOR), BUT APPARENTLY HAVE NOT FIXED.",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388784,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUPPLEMENTAL RESTRAINT SYSTEM LIGHT IS FLASHING ON THE INSTRUMENT CLUSTER.  ALSO, AIR BAG 2 DEACTIVATION LIGHT IS LIT.  WENT TO NISSAN DEALER.  ERROR CODE IS B1018, OCCUPANT SENSOR.  DEALER STATES THAT OCCUPANT SENSOR HAS FAILED, AND THEY WANT $4700 TO REPLACE THE ENTIRE BASE ASSEMBLY OF THE SEAT.  STATE THE SENSOR IS INTEGRATED WITH THE SEAT, AND MUST REPLACE WHOLE ASSEMBLY.  VEHICLE IS 10 YEARS OLD, BUT ONLY HAD 24,204 MILES.  OCCUPANT SEAT HAS RARELY BEEN SAT IN..  THE VEHICLE IS TYPICALLY GARAGED, AND HAS NEVER BEEN IN AN ACCIDENT.",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388251,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMATIC TRANSMISSION HAS 40000 AND IT'S ALREADY SLIPPING GOING FROM 5TH GEAR TO 4TH GEAR  ALSO WHEN I DO A HARD STOP THE VEHICLE WON'T ACCELERATE FOR A SEC THEN IT WILL JUMP INTO GEAR.",
        "vin": "JN1AZ4F82AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327498,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CONCENTRIC SLAVE CYLINDER IN MY MANUAL TRANSMISSION WENT OUT AND FAILED RANDOMLY WHILE I WAS DRIVING. THE CLUTCH JUST GOT STUCK TO THE FLOOR AND I COULD NOT GET IT BACK UP.THIS IS DANGEROUS BECAUSE YOU DO NOT KNOW WHEN IT IS GOING TO FAIL AND LEAVING YOU STRANDED ON THE MIDDLE OF THE HIGHWAY.  *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311364,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHEN ATTEMPTED. THE INTELLIGENT KEY SYSTEM WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TOWED TO GRAINGER NISSAN OF ANDERSON LOCATED AT (3510 CLEMSON BLVD, ANDERSON, SC 29621) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ELECTRONIC STEERING LOCK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296728,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN ESCL DEFECT. NISSAN IS AWARE OF THIS DEFECT ON MY MAKE AND MODEL AND REFUSING TO REIMBURSE THE TOWING, PART, AND LABOR. NEVER HAD A PROBLEM UNTIL 12/9/2019 WHEN MY CAR LEFT ME STRANDED. I HAD MY CAR TOWED TO A LOCAL MECHANIC WHO INFORMED ME OF THE WELL-KNOWN ESCL PROBLEM ON MY SPECIFIC MAKE AND MODEL. BECAUSE THERE IS NOT A RECALL ON MY VIN I'M OUT ROUGHLY $1,200.00. MY 2010 NISSAN 370Z HAS 60,000 MILES, IS GARAGED PARKED AND KEPT IN PRISTINE CONDITION FROM THE INSIDE OUT. I HAVE RECORDS OF EVERY OIL CHANGE, TIRE REPLACEMENT, BATTERY REPLACEMENT, WINDSHIELD WIPER REPLACEMENT, PASSING VEHICLE INSPECTION TO INCLUDE RECOMMENDED 'XXX' AMOUNT OF MILE SERVICES RECOMMENDED BY NISSAN. WHEN I INITIALLY CONTACTED NISSAN I WAS INFORMED ONLY A NISSAN DEALERSHIP COULD DIAGNOSE THE PROBLEM. THERE FOR I PAID AN ADDITIONAL $150 TO HAVE MY CAR TOWED TO NISSAN. MY NISSAN TECHNICIAN CONFIRMED NISSAN CONSUMER NEVER CALLED THEM FOR THE DIAGNOSIS AND THIS DECISION IS SOLELY BASED ON THE VIN NUMBER. PLEASE ADVISE THE APPROPRIATE STEPS TO MOVE FORWARD.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287930,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE ELECTRONIC LOCKS WERE NOT WORKING AND THE VEHICLE WOULD NOT START FROM A COLD START. STERLING MCCALL NISSAN (12230 SOUTHWEST FWY, STAFFORD, TX 77477) WAS CONTACTED AND STATED THAT THERE WERE NO RECALLS. THE DEALER ATTEMPTED TO SCHEDULE AN APPOINTMENT, BUT THE CONTACT REFUSED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266586,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "370Z  YR 2010.  I AM CONTACTING YOU FIRST BEFORE CONTACTING YOUR CEO.  I RECENTLY DECIDED TO PURCHASE ANOTHER NISSAN. PLANNED TO TRADE IN ABOVE CAR WHEN OUT OF BLUE THE STEERING MECHANISM LOCKED UP...FOB DOES NOT START CAR .  I HAVE REPLACED THE CAR BATTERY,  BATTERY ON FOB.  I HAVE READ THAT YOU HAVE RECALLED YOUR 370Z 2009/AND 2010 ON MULTIPLE WEBSITES. . WHEN I PUT THE VIN NUMBER IS IT SAYS 0 RECALLS ON YOUR WEBSITE.    I HAVE SPENT HOURS TRYING ALL THE DIFFERENT RECOMMENDATIONS SUGGESTED BY NISSAN, FRIENDS, UTUBE TO START THIS CAR NOTHING WORKS. I HAVE RESEARCHED AND FOUND THIS IS A COMMON PROBLEM WITH A ZERO RECALL ON MY VIN.   SO YOUR COMPANY DOES NOT STAND BEHIND YOUR PRODUCT WITH A PROBLEM THAT CLEARLY SHOULD BE RECALLED. HOW MANY PEOPLE HAVE TO BE INJURED FOR THIS DEFECT BEFORE YOU DO THE RIGHT THING....",
        "vin": "JN1AZ4FH9AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219648,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLOMN LOCK ISSUE HAS STRANDED MANY PEOPLE ON THIS VEHICLE. THE PART IS DEFECTIVE AND NISSAN WILL NOT REPLACE.  HAPPENS WHEN PARKED.",
        "vin": "JN1AZ4FH2AM"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196462,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH STARTS UNEXPECTEDLLY TO CRACK AND FALL APART. EVEN WHEN MY VEHICLE HAS TINT IN WINDOWS SINCE NEW.     TRANSMISSION ALWAYS NOISY UNTIL YOU PRESS DOWN THE CLUTCH",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176456,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHEN THE ENGINE BUTTON WAS PRESSED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ELECTRIC STEERING COLUMN LOCK FAILED. THE VEHICLE WAS THEN TOWED TO RAY BRANDT NISSAN (4000 LAPALCO BOULEVARD, HARVEY, LA 70058, (504) 367-1666) WHERE THE STEERING COLUMN FAILURE WAS CONFIRMED. THE CONTACT SPOKE WITH THE MANUFACTURER TO HAVE THE VEHICLE REPAIRED PER THE NISSAN WARRANTY REGARDING THE STEERING LOCK MECHANISM, BUT THE VEHICLE WAS NOT INCLUDED. THE MANUFACTURER PROVIDED CASE NUMBER: 34390382. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 19,800.",
        "vin": "JN1AZ4FH9AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "01/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170210,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS IN LOCK MODE. WILL NOT TURN TO ACC OR ON.",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "08/16/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11166531,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT WAS A PASSENGER IN A 2010 NISSAN 370Z. WHILE DRIVING APPROXIMATELY 70 MPH, ANOTHER VEHICLE STRUCK THE REAR PASSENGER SIDE OF THE VEHICLE. AS A RESULT, THE VEHICLE THAT THE PASSENGER WAS IN SPUN AROUND. WHEN THE VEHICLE STOPPED, THE PASSENGER SIDE AIR BAG DEPLOYED. THE PASSENGER WAS BLEEDING FROM THE RIGHT EYE AND WAS TRANSPORTED VIA AMBULANCE TO THE HOSPITAL. THE CONTACT HAD TO SPEND FIVE DAYS IN THE HOSPITAL. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE BODY DAMAGE WAS REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "JN1AZ4FH3AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE DID NOT START WHEN THE START BUTTON WAS DEPRESSED. THE VEHICLE WAS TOWED TO LL NISSAN VIRGINIA BEACH (3757 BONNEY RD, VIRGINIA BEACH, VA 23452) WHERE IT WAS DIAGNOSED THAT THE STEERING WHEEL LOCK COLUMN BOX NEEDED REPLACEMENT. THE CONTACT ALSO MENTIONED THAT THE VEHICLE WAS REPAIRED IN 2014 FOR THE SAME FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE RECURRENCE AND PROVIDED CASE NUMBER: 34096503. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START BECAUSE THE ELECTRONIC STEERING COLUMN LOCK FAILED. THE VEHICLE WAS TAKEN TO NORTH BAY NISSAN (1250 AUTO CENTER DR, PETALUMA, CA 94952, (707) 769-7700) AND WAS CURRENTLY BEING REPAIRED. THE MANUFACTURER STATED THAT THERE WAS NO RECALL ON THE VEHICLE; THEREFORE, THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIR COST. THE FAILURE MILEAGE WAS 77,000.",
        "vin": "JN1AZ4FH3AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080278,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I CHANGED MY CAR BATTERY AFTER IT DIED. IT WAS AN 8 YEAR OLD BATTERY. AFTER PUTTING IN THE NEW BATTERY, MY 370Z IS STUCK IN IGNITION LOCK.",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078220,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD BEEN PARKED IN A RESIDENTIAL DRIVEWAY.  WITHOUT ANY INDICATION OR WARNING IT WAS FULLY IMMOBILIZED AND COULD NOT BE MOVED AT ALL.  HAD THE VEHICLE BEEN PARKED IN A REMOTE OR CONGESTED AREA A HAZARD CERTAINLY WOULD BE PRESENTED.  THE VEHICLE HAD TO BE TOWED TO NISSAN DEALER WHERE THE ISSUE WAS DIAGNOSED AS A FAILED ELECTRONIC STEERING COLUMN LOCK (PART NUMBER 48700 MANUFACTURED JANUARY 28TH 2010).  THE NISSAN SERVICE FITTED A DIFFERENT/REVISED PART AT A COST OF $1,608.00.     NISSAN HAS A VOLUNTARY SERVICE CAMPAIGN ADDRESSING THIS EXACT \"MANUFACTURING IRREGULARITY.\" A CLAIM WAS FILED BUT DENIED BECAUSE THIS VEHICLE/MODEL WAS NOT INCLUDED.  NISSAN CUSTOMER AFFAIRS REFUSED TO PROVIDE ANY ADDITIONAL INFORMATION, STATING SIMPLY \"THAT IS PROPRIETARY.\"  A QUOTE FROM THE CAMPAIGN LITERATURE,   'DEALER WILL REPLACE THE EXISTING ELECTRONIC STEERING COLUMN LOCK (ESCL) WITH AN ELECTRONIC STEERING COLUMN BOX (ESCB). THE ESCB WILL REPLACE THE ESCL ASSEMBLY, BUT WILL NO LONGER LOCK THE STEERING WHEEL WHEN THE VEHICLE IS PARKED AND TURNED OFF. THE STEERING WHEEL LOCKING FUNCTION IS NOT NECESSARY AS THE VEHICLE IS ALSO EQUIPPED WITH AN ANTI-THEFT IMMOBILIZER TO HELP PREVENT THEFT. INSTALLATION OF THE ESCB WILL ELIMINATE THE POSSIBILITY OF A NO-START CONDITION RELATED TO THE MANUFACTURING IRREGULARITY ON THE ESCL.'  PICTURES OF THE DEFECTIVE PART, INCLUDING MARKINGS ARE ATTACHED.",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075620,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTELLIKEY WARNING LIGHT CAME ON AND THE STEERING LOCKED. THERE ARE A LARGE NUMBER OF COMPLAINTS REGARDING THIS ISSUE. A DESIGN AND SAFETY ISSUE. THE LIGHT ILLUMINATED WHEN DRIVING. AFTER THE CAR WAS TURNED OFF IT DID NOT START.",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072154,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCK UNIT FAILED.  HAD A KEY EMBLEM THE NIGHT BEFORE, THOUGHT IT WAS MAYBE A FOB BATTERY ISSUE.  NEXT MORNING VEHICLE WOULD NOT START OR GO INTO ACCESSORY POSITION.  RESEARCHED AND FOUND THE COMMON STEERING LOCK UNIT ISSUE.  HAD IT TOWED TO DEALERSHIP, AND SURE ENOUGH THE UNIT HAD FAILED.  REPLACED PART OUT OF POCKET, AS THE ISSUE WAS COVERED FOR 2009 AND FIRST HALF 2010 CARS WITH SIMILAR ISSUES.  MINE IS A SECOND HALF 2010 SO NO COVERAGE.",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064105,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHEN THE KEY WAS USED. ALSO, THE POWER STEERING BECAME VERY STIFF AND FAILED TO TURN RIGHT OR LEFT. THE FAILURES OCCURRED WITHOUT WARNING. THE VEHICLE WAS TOWED TO MODERN NISSAN OF LAKE NORMAN (18615 STATESVILLE RD, CORNELIUS, NC 28031) WHERE IT WAS DIAGNOSED THAT THE ELECTRONIC STEERING COLUMN LOCK PART NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AT 800-647-7261 AND STATED THAT THEY COULD NOT DO ANYTHING SINCE THE VIN WAS NOT INCLUDED IN A RECALL. CASE NUMBER: 29498996 WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 72,300.",
        "vin": "JN1AZ4FH4AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE STORE AND PARKED MY CAR. WHEN I WENT BACK OUT TO MY CAR 15 MINS LATER THE STEERING WHEEL COLUMN HAD LOCKED UP AND WOULD NOT ALLOW ME TO START MY CAR. IT NO LONGER RECOGNIZED THE KEY. THIS APPEARS TO BE A REOCCURRING ISSUE WITH MY MAKE AND MODEL AND THEREFORE SHOULD BE A RECALL.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056792,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - VOLUNTARY SERVICE CAMPAIGN 2009-2011 STEERING LOCK UNIT. I OWN A 2010 NISSAN 370Z WITH 37,000 MILES. LOCAL NISSAN DEALER WOULD NOT HONOR KNOWN ISSUE AND I HAD TO PAY $1500 TO REPAIR. PLEASE HELP. [XXX] ,  EMAIL: [XXX] VIN [XXX], DL: [XXX]. VEHICLE WOULD NOT START, STUCK IN PARKING LOT. HAD TO TOW TO NISSAN DEALER FOR REPAIRS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053392,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CSC (CLUTCH PRESSURE) IS FAILING. MANY 370Z DRIVERS ARE HAVING THIS ISSUE",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "11/11/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE ELECTRONIC STEERING COLUMN LOCK (ESCL)    ON 11/11/2017 MY 2010 370Z WOULD NOT START IN A COMMERCIAL PARKING LOT, COMPLETELY DISABLED. AFTER SOME QUICK RESEARCH, THE PROBLEM WAS IDENTIFIED. I CANNOT BELIEVE THERE IS NO RECALL FOR THIS ISSUE AS THERE HAS BEEN FOR THE GT-R, ALTIMA AND I BELIEVE A FEW OTHER MODELS.    I'M AFRAID THAT MY VEHICLE MAY NOT BE COVERED UNDER THOSE OTHER RECALLS ALTHOUGH THE ISSUE IS THE SAME. NOTE THAT NISSAN DISCONTINUED THIS EQUIPMENT STARTING IN 2012, LIKELY DUE TO ITS UNRELIABILITY.    I HAVE OWNED 4 OTHER NISSAN VEHICLES (1989 NISSAN PATHFINDER, 350Z, SENTRA, FRONTIER). THIS IS THE FIRST TIME I'M STUCK WITH A \"DEAD\" CAR THAT WILL COST ME A LOT TO GET REPAIRED.    IT IS NOW SITTING AT MY NISSAN DEALER AND WAITING TO HEAR FROM MY SERVICE ADVISOR. HE WAS QUITE AWARE OF THIS ISSUE.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033824,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHT ON THE DASH COMES ON READING THERE IS NOT KEY IN THE CAR WHEN IN FACT THERE IS. IT HAPPENS WITH BOTH MY FOBS. NOW, THE CAR WON'T EVEN START AND I HAVE TO USE THE KEY TO GET INSIDE IT. HAPPENED WHEN STATIONARY THEN WHILE DRIVING.",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992374,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM: DEFECTIVE ELECTRONIC STEERING COLUMN LOCK (ESCL)  ON 12/01/16 I HAD TO HAVE MY VEHICLE TOWED TO A LOCAL NISSAN DEALER AFTER IT BECAME DISABLED BY WHAT I WAS ADVISED WAS THE FAILURE OF THE ESCL UNIT. THE COST OF THE REPAIRS TOTALED $1094.20. IN ADDITION, DUE TO THE LATENESS OF THE HOUR I ARRIVED AT THE DEALERSHIP, I WAS WITHOUT THE USE OF MY VEHICLE THAT EVENING THROUGH MIDDAY OF THE FOLLOWING DAY. MY OWN ON-LINE RESEARCH LED ME TO THE DISCOVERY THAT THIS MECHANICAL FAILURE IS A KNOWN ISSUE TO NISSAN, AND THERE HAD BEEN A TSB CAMPAIGN A FEW YEARS PRIOR THAT I HAD NOT BEEN NOTIFIED OF OR INCLUDED IN BY THE NISSAN CORP. I HAVE BEEN A LOYAL NISSAN CONSUMER FOR YEARS, AND MY CURRENT VEHICLE THAT WAS AFFECTED BY THIS BREAKDOWN, IS ACTUALLY MY FOURTH \"Z\" VEHICLE. I AM VERY DISAPPOINTED AND DISPLEASED BY HOW NISSAN HAS CHOSEN TO HANDLE THIS ISSUE.",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978871,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD ON MY 370Z 2010 IS ALL CRACKED UP,  I HAVE LOOKED AT MANY OTHER 370Z AND THEY ARE ALL WITH THE SAME ISSUE. I WENT TO THE DEALER AND THEY SAID THAT THEY HAVE RECEIVED MANY COMPLAINTS AND ARE AWAITING A RECALL FROM FACTORY.",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PEDAL FALLS TO THE FLOOR WHEN SHIFTING. MASTER CYLINDER REPLACED TWICE WITHIN 30 DAYS, UNDER 500 MILES. HAS NOW FAILED A 3RD TIME LESS THAN A WEEK AFTER 2ND REPLACEMENT.",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938396,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NISSAN 370 Z AND UP TO THIS POINT I REALLY ENJOYED THE CAR THAT WAS UNTIL AN KNOWN ISSUE OF THE STEERING LOCK WENT OUT ON MY CAR AND LEFT ME STRANDED FOR 16 HOURS. I CALLED NISSAN AFTER I SPENT $1162.00 TO TRY TO GET REIMBURSED. I WAS INITIALLY TOLD I WOULD NOT REIMBURSED WHICH AFTER READING ONLINE HOW SOME PEOPLE WERE REFUSED REIMBURSEMENT INITIALLY I KEPT PURSUING A REIMBURSEMENT. STEPHANIE FROM A REGIONAL OFFICE CALLED AND BASICALLY TRIED TO LOW BALL ME BY OFFERING $500 REIMBURSEMENT. BELOW IS A FORUM LINK FOR THE KNOWN ISSUE OF THE STEERING LOCK. OTHER CUSTOMERS WERE OFFERED A FULL REIMBURSEMENT BUT FOR SOME REASON I AM NOT. THIS IS AFTER I BOUGHT THE CAR BRAND NEW AND HAVE BEEN A LOYAL CUSTOMER EVER SINCE. I THEREFORE WOULD LIKE A FULL REIMBURSEMENT. I FEEL THAT THIS IS ONLY FAIR. WHAT IF I HAD BEEN STRANDED ON THE WAY TO VISIT AN AIRFORCE BUDDY IN ALAMOGORDO NM IN THE MIDDLE OF THE DESERT WITH SPOTTY CELL PHONE SERVICE. 16 HOURS STRANDED COULD HAVE EASILY TURNED INTO SOMETHING MUCH WORSE. MY CASE FILE IS 24957255.     HTTP://WWW.THE370Z.COM/NEW-ROADSTER-370Z-OWNER/65272-ATTENTION-2009-2010-OWNERS-STEERING-LOCK-WONT-START-ISSUES.HTML    THIS IS A SERIOUS SAFETY CONCERN AND MUST BE ADDRESSED.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935510,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 NISSAN 370Z STEERING WHEEL LOCKED UP TWICE IN ONE WEEK.",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/09/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915701,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, OCTOBER 9, 2016, I ATTEMPTED TO START MY 2010 NISSAN 370Z NISMO WITH THE INTELLIGENT KEY TO NO AVAIL. I IMMEDIATELY CHECKED THE VOLTAGE ON THE CAR BATTERY AND DISCONNECTED IT FOR 30 MIN IN AN ATTEMPT TO RESET THE COMPUTER.  I ALSO CHANGED THE BATTERY IN THE FOB, WHICH DID NOT SOLVE THE ISSUE. I INSERTED THE INTELLIGENT KEY AND WAS ABLE TO GET THE WINDOWS DOWN, BUT ALSO NOTICED THAT THE WHEEL WAS NOT LOCKED. I WENT TO VARIOUS BLOG SITES AND LEARNED THAT THIS HAS BEEN AN ONGOING ISSUE WITH THE 370Z AND GTR MODEL YEARS 2009-2010. I ALSO CHECKED ALL THE FUSES, AND NONE WERE FOUND TO BE FAULTY. I CALLED THE DEALER AND THEY INFORMED ME THAT THERE WERE NO RECALLS ON THIS MODEL FOR THE STEERING LOCK MECHANISM, AND THAT THE REPAIR WOULD COST IN EXCESS OF $1,100.00. THIS DOES NOT INCLUDE THE FLATBED FEE TO TOW THE VEHICLE FROM MY HOME TO THE DEALER.     ACCORDING TO NISSAN'S VOLUNTARY SERVICE CAMPAIGN 2009-2011, NHTSA REFERENCE #10051829, TSB #NTB13-014, CAMPAIGN #P3208, THE DEALER IS RESPONSIBLE FOR REPLACING THE FAULTY STEERING LOCK MODULE AT NO CHARGE TO THE CUSTOMER. I CALLED MY DEALER AND WAS TOLD MY VIN WAS NOT INCLUDED. WHAT SENSE DOES THIS MAKE IF THE SAME ISSUE AND SAME PART WAS USED ON ALL VEHICLES THAT ARE FAILING BECAUSE OF THIS PROBLEM? I WISH TO RECEIVE IMMEDIATE RESOLUTION TO THIS ISSUE, BECAUSE MY VEHICLE IS COMPLETELY DISABLED, AS I AM WITHOUT THE ABILITY TO DRIVE MY CAR.",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910120,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PEDAL WENT TO FLOOR. CLUTCH SLAVE CYLINDER FAILED.  FAILED IN MOTION, 75 MILES FROM HOME. TOW WAS EXPENSIVE.    CAR WOULD NOT START. STEERING LOCK UNIT FAILED. FAILED IN STATIONARY , 95 MILES FROM HOME. TOW WAS EXPENSIVE.",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894359,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL RANDOMLY DROPS TO THE FLOOR WAS TOLD IT IS THE CLUTCH SLAVE CYLINDER BY A MECHANIC.*DT  CONSUMER STATED VEHICLE HAS BEEN REPAIRED AND COMPLAINT RECTIFIED.*JB",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876259,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEY I HAVE A 2010 NISSAN 370Z NISMO 6 SPEED MANUAL.THE CAR HAS 37,000 MILES ON IT. I STARTED THE CAR THURSDAY MORNING JUNE/23/2016 PRESSED IN THE CLUTCH. CLUTCH FELT KINDA SOFT AND SOGGY SO I PUT IN FIRST GEAR AND DROVE OFF. AS I DROVE CLUTCH FELT OKAY BUT STILL KINDA WEIRD. SO I DROVE ABOUT 15 MINS AND STOP AT A LIGHT PUSHED THE CLUTCH IN AND IT WOULDN'T COME BACK IN POSITION.IT WOULD GET STUCK HALF WAY. SO I TRIED TO PUT IT IN GEAR IT WONT LET ME GO IN 1ST GEAR. SO I SHUT OF THE CAR PUMPED THE CLUTCH STARTED IT UP AND SHE WENT IN GEAR. SO I PULL OVER TO THE SIDE TO A DEALERSHIP. THEY DIAGNOSIS THE PROBLEM FOR ME AND IT TURNS OUT TO BE THE CSC (SLAVE CYLINDER) IS BUSTED AND LEAKING FLUID AND THE RESERVOIR TANK IS EMPTY. I HAVE HEARD BOUT THIS PROBLEM IN THE 370Z'S AT LEAST A 100 EVENTS HAVE OCCURRED EVEN AT LOWER MILES. THIS A COMMON PROBLEM IN UR Z CARS. PLZ FIX THIS ISSUE.",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DURING HEAVY BUSINESS HOURS MY CLUTCH STAYED STUCK ALL THE WAY TO THE BOTTOM, WITHOUT ME BEING ABLE TO SHIFT. I GOT IN TO A PARKING LOT AND THE CAR DID NOT WANT TO START ANYMORE, SO I HAD TO TOW IT TO A NISSAN DEALERSHIP. AT THE DEALERSHIP THEY DIAGNOSED IT AND CLAIMED IT IS THE CSC.",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "05/13/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865081,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH BOARD IS STARTING TO MELT.  IT HAS AN OILY RESIDUE THAT CREATES AN BRIGHT GLARE IN DAYTIME DRIVING MAKING IT HARD TO SEE SAFELY  .",
        "vin": "JN1AZ4FH8AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "04/26/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861730,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY CAR TO MY BROTHER'S HOUSE TO BABYSIT MY NIECE, NO ISSUES OR WARNINGS. GO BACK TO MY CAR TO LEAVE AND MY CAR WILL NOT START. TRIED CHANGING THE BATTERY AND REPROGRAMMING MY KEY, HAD TO GET MY CAR TOWED TO NISSAN DEALERSHIP ONLY TO BE TOLD THAT I NEED TO SPEND $1100 FOR NISSAN TO ORDER A PART WHICH HAS CAUSED MY CAR TO LOCK/STALL. THIS IS A KNOWN ISSUE YET NOTHING HAS BEEN DONE ABOUT IT, INSTEAD NISSAN ARE LEAVING CUSTOMERS STRANDED ONLY TO PAY AN INSANE AMOUNT OF MONEY.",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854423,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START-LEFT ME STRANDED--A SINGLE FEMALE IN AN UNKNOWN AREA-CALLED NISSAN THEY COULD NOT HELP! DEALER INDICATES IS A WHEEL LOCKING MODULE THAT THEY KNOW HAS FAILED-RECALLED IN CARS UP TO 2009-  THE HEADLIGHT BALLAST IS ALSO A FAILED PRODUCT LEAVING YOU WITH A FLICKERING OR NO HEADLIGHT-CAR HAS LESS THAN 55000 MILES",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836509,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING LOCKOUT MECHANISM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 30,075.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825315,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT START. WAS TOLD BY NISSAN DEALER THAT THE PROBLEM WAS THE STEERING POWER MECHANISM WHICH IS AN ONGOING PROBLEM WITH THIS PARTICULAR CAR. MANUFACTURER WON'T RECOGNIZED THIS DEFECT.",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "01/19/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822889,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL LOCK STEERING MODULE--CAR WOULD NOT START - NISSAN IS AWARE OF THE DEFECTIVE DEVICE--HAS HAD RECALLS ON OTHER YEARS-- 2010 WAS NOT INCLUDED-COST TO REPLACE IS VERY EXPENSIVE.  THERE IS NO OVERRIDE TO BE ABLE TO MOVE THE CAR OR START THE CAR",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822902,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS HAVE EXTENSIVE FOGGING ON THE LENS AND THE HEADLIGHT BALLAST OVER HEATS AND SHUTS OFF THE HEADLIGHT.  THE REPAIR IS TO REPLACE THE BALLAST--IF YOU DO NOT, IT CREATES EXTRA STRESS ON THE HEADLIGHT AND COULD END UP BEING WELL OVER A $1000.00 REPAIR--DEALER QUOTED $795.00 TO REPLACE BALLAST--THIS IS A COMPLAINT OF MANY OWNERS-",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2016",
        "dateOfIncident": "01/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822094,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING LOCK ASSEMBLEY WENT OUT ON MY 2010 NISSAN 370Z CAUSING THE CAR NOT TO START.  HAD TO HAVE IT TOWED TO THE DEALERSHIP WHERE I'M NOW FINDING OUT THAT THERE IS NO RECALL ON THIS ITEM OR NOT COVERED ON WARRANTY.  IT SEEMS THAT MANY OTHER NISSAN OWNERS ARE HAVING THE SAME PROBLEM. NISSAN REFUSES TO PAY AND IT'S A $1,000 REPAIR",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/11/2016",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819559,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED A 2010 370Z. WENT TO START MY CAR AND NO IGNITION. KEY FOB LIGHT WAS ON. HAD TOWED TO PERSONAL SHOP (NOT NISSAN DEALERSHIP DUE TO HORRIBLE CUSTOMER SERVICE.) TECH CALLED TODAY AND SAID IT WAS THE STEERING LOCK UNIT WHICH THE NISSAN CORP SHOULD COVER. CALLED TO FILE CLAIM- REFUSES TO EVEN CONSIDER HELPING ME UNTIL I TOW AT MY EXPENSE TO THEIR DEALERSHIP AND PAY ANOTHER $87 TO RUN THE DIAGNOSTICS. NISSAN CORP TOLD ME THE WERENT SURE AFTER ALL THAT IF THEY WOULD EVEN PAY FOR REPAIR. UNACCEPTABLE!!!!!",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818033,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS KEYLESS SYSTEM, THE ONLY KEY SLOT AVAILABLE IS IN THE DRIVERS SIDE DOOR.  WHEN I ENTER THE VEHICLE, NORMALLY A LIGHT COMES ON TO ACKNOWLEDGE THE SYSTEM RECOGNIZES YOU.  ON ENTERING THIS TIME, A SMALL SYMBOL WITH THE WORD KEY ON IT ILLUMINATED AND THE CAR WOULD NOT START OR GO INTO THE ACCESSORY POSITION, NOR WOULD THE STEERING COLUMN UNLOCK.  ALSO, THE BRAKE PEDAL WAS VERY HARD.  THE OWNER'S MANUAL STATES THE KEY SYMBOL INDICATES A MALFUNCTION IN THE INTELLIKEY SYSTEM.  THE VEHICLE WAS TOWED TO A NISSAN DEALERSHIP WHERE IT WAS DETERMINED THE ELECTRIC STEERING LOCK HAD FAILED.  THE COST OF REPAIR WAS NEAR $1200.00 AND I WAS INFORMED THAT, EVEN THOUGH THE CAR WAS STILL WITHIN WARRANTY FOR 40,000 MILES OR FOR OVER A YEAR, NISSAN WAS REFUSING TO MAKE THESE REPAIRS UNDER WARRANTY COVERAGE.  IT SEEMS THIS IS AN ALMOST INEVITABLE FAILURE ON ANY NISSAN OR INFINITI EQUIPPED WITH THIS SYSTEM.  I WAS LUCKY THAT IT FAILED IN A SUPER MARKET PARKING LOT NEAR HOME.",
        "vin": "JN1AZ4FH9AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2016",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817422,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 370Z WITH ONLY 20,000 MILES. I HAVE TO SAY WE ALL (FAMILY) WERE VERY HAPPY WITH IT TILL TODAY.  MY WIFE ALWAYS KEPT IT INSIDE OUR GARAGE, ALL SERVICES UP TO DATE. EARLY IN THE MORNING SHE TRIED TO START IT BUT STEERING WHEEL LOCK CAME UP, WE TRIED EVERYTHING, CHECKED KEY FAB BATTERY AND NOTHING. FINALLY WE  HAD TO CALL ROADSIDE ASSISTANCE AND THE VEHICLE WAS TOWED TO THE DEALERSHIP. ONCE THERE WE WERE TOLD BY OUR SERVICE ADVISOR THAT IT'S A VERY COMMON FAILURE ON 370Z AS A FACT HE SHOWED US 3 OTHERS YES!! 3 MORE VEHICLES WITH SAME ISSUE HE ALSO TOLD US THAT THERE'S A RECALL ON THE SAME PROBLEM ON AN ALTIMA AND MAXIMA BUT NO THE 370Z WHY?   HE KNEW RIGHT AWAY WHAT THE PROBLEM WAS AND EVEN TOLD US RIGHT AWAY \"THIS IS GOING TO COST AT LEAST 1200 BECAUSE THAT PART IS AROUND 1000 REALLY!! NISSAN THANK YOU!! WHAT A JOKE FOR AN ALMOST 50,000 DOLLAR CAR.",
        "vin": "JN1AZ4FH0AM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816826,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN 370Z IS OUT OF COMMISSION FOR A CONFIRMED ESCL FAILURE - A KNOWN RECALL PART!!! NISSAN REFUSES TO HELP ME IN ANYWAY. THE VEHICLE WOULD NOT START, I WAS TOLD IT HAD TO BE TAKEN TO A DEALER BEFORE THEY WOULD DO ANYTHING TO HELP ME. I HAD IT TOWED 35MILES OUT OF POCKET. THE TECHNICIANS CONFIRMED THE ESCL FAILURE. NISSAN CONSUMER AFFAIRS REFUSED TO DO ANYTHING FOR ME AT ALL.",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2015",
        "dateOfIncident": "01/05/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810510,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY IN 2015 MY CLUTCH STARTED STICKING WHEN THE WEATHER GOT COLDER AND AFTER DOING RESEARCH I FOUND THAT THIS WAS A COMMON ISSUE WITH THE CSC SEAL GONG BAD. I EVEN TOLD NISSAN THAT IT WAS BAD TOOK IT IN FOR SERVICE AND THE ONLY THING THEY DID WAS PUT IN THE SAME TYPE OF CLUTCH FLUID USED IN THE GTR, AFTER GETTING THE CAR BACK AND DRIVING FOR A WEEK THE CLUTCH STARTED TO STICK AGAIN AND I ONCE AGAIN TOLD THEM IT WAS THE CSC SEAL THAT WAS GOING BAD AND THEY FINALLY TOOK THE CLUTCH APART TO SEE WHAT I WAS SAYING WAS CORRECT AND THEY REPLACED IT WITH THE STOCK CSC THAT NISSAN USES KNOWING THAT FAILURE AGAIN WAS POSSIBLE. WELL HERE IT IS LESS THAN A YEAR LATER AND I AM HAVING THE SAME ISSUES WITH THE CLUTCH EITHER STICKING OR GOING ALL THE WAY TO THE FLOOR NOW THAT THE TEMPERATURE IS DROPPING. I HAVE A CALL INTO THE DEALERSHIP TO FIND OUT IF ITS STILL UNDER WARRANTY! NISSAN KNOWS THERE IS AN ISSUE WITH ITS STOCK CSC SEAL BUT CONTINUES TO USED THEM IN THEIR VEHICLES.",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808839,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED AND WOULDN'T START. TOLD BY DEALERSHIP IT'S THE ELECTRONIC STEERING LOCK. READ ONLINE SEVERAL COMPLAINTS OF OTHERS HAVING THE SAME ISSUE. I CALLED NISSAN USA. I WAS TOLD THERE ISN'T OR HASN'T BEEN A RECALL ON MY VEHICLE FOR THIS ISSUE AND THEY WOULD NOT MAKE GOOD ON THIS FAULTY PART.  THE REPAIR COST $1,200.",
        "vin": "JN1AZ4FH6AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2015",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808560,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LOCK FAILURE: CAR WAS PARKED AND WILL NOT START $1100 TO REPLACE FAULTY PART.",
        "vin": "JN1AZ4FH6AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807872,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED AND  WOULDN'T START. TOLD BY DEALERSHIP IT'S THE STEERING LOCK. READ ONLINE SEVERAL COMPLAINTS OF OTHERS HAVING THE SAME ISSUE. I CALLED NISSAN USA.  I WAS TOLD THERE ISN'T OR HASN'T BEEN A RECALL ON MY VEHICLE FOR THIS ISSUE.",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790783,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL NOT MOVE THE CLUTCH PEDAL WENT TO THE FLOOR AND WOULD NOT COME UP OR ENGAGE. I WAS STUCK IN CITY TRAFFIC. I CHECKED THE FLUID LEVEL AND IT WAS LOW BUT NOT BEFORE THE MINIMUM LINE. I BELIEVE I HAVE A LEAK IN THE INTERNAL SLAVE CYLINDER WHICH IS LOCATED INSIDE THE BELL HOUSING.",
        "vin": "JN1AZ4FH9AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790334,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CSC (CONCENTRIC SLAVE CYLINDER) - FAILED,  CLUTCH PEDAL GOES TO THE FLOOR, CAN'T SHIFT GEAR",
        "vin": "JN1AZ4FH8AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2015",
        "dateOfIncident": "10/17/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789156,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START WITHOUT WARNING. THE VEHICLE HAD TO BE TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING LOCKOUT UNIT MALFUNCTIONED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED OF A VOLUNTARY SERVICE CAMPAIGN FOR THE FAILURE; HOWEVER, THE VIN WAS NOT INCLUDED. THE APPROXIMATE FAILURE MILEAGE WAS 67,879......UPDATED 02/11/16 *BF  *TR",
        "vin": "JN1AZ4FHXAM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788355,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING LOCK SELENOID WENT OUT LEAVING THE CAR COMPLETELY INOPERABLE.  I WAS TOLD BY OTHER Z CAR OWNERS THAT I WAS LUCKY THAT THIS HAPPENED WHEN THE CAR WAS PARKED AND NOT WHILE I WAS DRIVING IT.  GOOD GOD - I DRIVE ON I 75 TO WORK AND CANNOT IMAGINE LOSING STEERING WITHOUT WARNING.  I CONTACTED NISSAN NORTH AMERICA AND THEY COULD NOT HAVE BEEN LESS HELP IF THEY TRIED.  I WAS ACTUALLY TOLD BY THE NISSAN DEALERSHIP TO CONTACT NISSAN NORTH AMERICA TO FILE A COMPLAINT.  APPARENTLY THIS IS A KNOWN PROBLEM ON THE 2010 NISSAN 370Z AND THEY WILL NOT RECALL IT OR FIX IT WHEN IT OCCURS INDIVIDUALLY.  VERY FRIGHTENING.  I AM FURIOUS THAT THEY CAN GET AWAY WITH THIS.",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785397,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STEERING COLUMN LOCK FAILED AND DISABLED THE VEHICLE. VEHICLE WOULDN'T RECOGNIZE INTELLIGENT KEY EVEN WHEN INSERTED. VEHICLE WAS PARKED HOWEVER IT LEFT CAR STRANDED WITHOUT BEING ABLE TO START THE ENGINE. HAD TO HAVE IT TOWED TO LOCAL NISSAN DEALERSHIP WHERE THEY DIAGNOSED IT AS THIS ISSUE. THERE WAS A RECALL FOR MY YEAR, MAKE AND MODEL BUT THEY TOLD ME MY VIN DIDN'T QUALIFY FOR REPLACEMENT. HAD TO PAY $1,237 OUT OF POCKET FOR REPAIR.",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783011,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SO I HAVE A 2010 370Z (31K MILES)  AND IT HAS BEEN RUNNING GREAT UP UNTIL YESTERDAY.  I GOT IN TO START IT AND IT WOULDN'T START.  THE ONLY THING I NOTICED WAS THE INTELLIGENT KEY SYSTEM WARNING LIGHT WAS ON.  JUST TO BE SURE, I CHECKED THE BATTERY IN MY REMOTE AND, OF COURSE, ALSO PUT THE REMOTE IN THE OVERRIDE SLOT AND NOTHING.  THE BATTERY IN THE CAR IS ALSO FINE.  EVERYTHING ELSE SEAMED TO WORK, LIGHTS, HORN, DOORS UNLOCK/LOCK. THE START BUTTON SAID LOCK AND IT WOULD NOT EVEN TURN TO ACCESSORY MODE. STEERING WHEEL WAS IN THE UN-LOCKED POSITION.   DOING A LITTLE RESEARCH ONLINE I'VE FOUND THAT IT IS MORE THAN LIKELY A STEERING WHEEL LOCK PROBLEM THAT LEADS TO THE INTELLIGENT POWER DISTRIBUTION MODULE.  APPARENTLY THIS IS A FAIRLY COMMON PROBLEM AND IT SEEMS TO HAPPEN AROUND 30-40K MILES.  SO NOW I HAVE THE PLEASURE OF HAVING MY CAR TOWED TO THE DEALERSHIP SO THEY CAN CHARGE ME (THEIR ESTIMATE) $1500!  I LOVE MY CAR BUT THIS IS A PROBLEM THAT NISSAN SHOULD DEAL WITH.  THERE NEEDS TO BE A RECALL ON THIS!",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "09/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763771,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE SERVICE ROAD AS I EXITED OFF THE HIGHWAY AND I LOST CLUTCH PRESSURE.    THIS IS A VERY COMMON PROBLEM IN THE 370Z AND NISSAN NEEDS TO FIX THIS. THERE ARE HUNDREDS OF OWNERS WHO HAVE HAD THIS ISSUE.     I WAS LEFT STRANDED ON THE SERVICE ROAD WITH NO CLUTCH PRESSURE.",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763980,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT OUT OF CAR AND TURNED IT OFF TO PUMPED GAS...WHEN I GOT BACK INTO THE CAR TO START, IT SAID NO KEY!!  KEY WAS IN MY PURSE ON PASSENGER SEAT AS ALWAYS.  COULD NOT GET IT STARTED FOR 5 MINUTES, JUST KEPT PUSHING START BUTTON, WIGGLING STEERING WHEEL, FINALLY STARTED.  HAS HAPPENED ABOUT 4 MORE TIMES AGAIN.  OBVIOUSLY THERE'S A PROBLEM WITH THESE Z'S BECAUSE IT'S HAPPENED TO OTHERS AS WELL IF YOU READ THE BLOGS.  NISSAN NEEDS TO DO SOMETHING ABOUT THIS.....LESS THAT 45,000 MILES.  COME ON NISSAN DO THE RIGHT THING.",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2015",
        "dateOfIncident": "06/20/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734988,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH PEDAL WENT ALL THE WAY TO THE FLOOR AND NOT RETURNING TO ITS PROPER POSITION.  I WAS UNABLE TO PUT THE CAR INTO GEAR.  THIS HAS HAPPENED TWICE.  THE LAST TIME I WAS STUCK ON A MAJOR ROADWAY WHERE I HAD TO GET OUT OF THE CAR AND CALL THE POLICE FOR ASSISTANCE BECAUSE I WAS SCARED I WAS GOING TO HAVE A COLLISION WITH ANOTHER CAR.     NISSAN ATTEMPTED TO FIX THIS ISSUE AS PER THEIR INTERNAL SERVICE BULLETIN BY CHANGING THE CLUTCH FLUID.  THIS IS A TEMPORARY FIX THAT DOES NOT ADDRESS THE REAL ISSUE OF THE FAULTY DESIGN  OF THE CLUTCH SLAVE CYLINDER.",
        "vin": "JN1AZ4FH0AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2015",
        "dateOfIncident": "09/11/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730600,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 40,000 MILES MY CLUTCH SLAVE CYLINDER FAILED WHILE DRIVING. MY CLUTCH PEDAL WENT ALL THE WAY TO THE FLOOR OF THE CAR AND WOULD NOT COME BACK UP. DEALER ATTEMPTED TO SAY THIS WAS A WEAR AND TEAR PART, BUT MY EXTENDED WARRANTY HAD TO COVER THE COST. BASED ON HTTP://WWW.THE370Z.COM/NISSAN-370Z-GENERAL-DISCUSSIONS/25007-STICKY-OFFICIAL-370Z-CLUTCH-PRESSURE-CSC-FAILURES.HTML THIS IS A FAIRLY COMMON ISSUE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/23/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730265,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL LOCK HAS ISSUES ON THE Z'S. MANY OTHER INDIVIDUALS HAVE HAD THE SAME PROBLEM OCCUR TO THEM WHEN A KEY FOB LIGHT COMES ON THE DASHBOARD TO THE LEFT OF THE GAS TANK METER. THEN THE CAR WON'T START ON ANYMORE AND HAS TO BE TOWED TO THE DEALERSHIP. THE DEALER CHARGES $600-$1200 FOR A REPLACEMENT STEERING WHEEL LOCK ( WHICH CAN POTENTIALLY BREAK AGAIN) FOR SOMETHING THAT ISN'T OUR FAULT!!! THE CAR HAS 34,XXX MILES ON IT AND SHOULDN'T HAVE ANY PROBLEMS LIKE THIS. THERE HAS TO BE A RECALL ABOUT THIS BECAUSE IT'S A FAULTY UNIT FROM THEIR MANUFACTURE AND MANY OF THE Z OWNERS ARE STARTING TO GET THIS PROBLEM.    THANK YOU,    A FELLOW 370Z OWNER",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2015",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726352,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH SLAVE CYLINDER FAILURE RESULTING IN CLUTCH PEDAL STICKING TO FLOOR AND CLUTCH DISENGAGED.  HAPPENED INTERMITTENTLY WITH ENGINE HOT IN WARM WEATHER.  CLUTCH WOULD RESUME WORKING NORMALLY AFTER ENGINE COOLED OFF.  THIS IS A COMMON PROBLEM ON THESE VEHICLES AS DESCRIBED ON VARIOUS 370Z USER FORUMS.    REPAIR:  REPLACED CLUTCH SLAVE CYLINDER WITH IMPROVED AFTER MARKET PART.        PART COST: $325.   LABOR: $800    TOTAL:  $1125 PLUS TAX.",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "04/25/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713796,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 6 SPEED 210 NISSAN 370Z, WHEN I SHIFT THE GEARS FAST, THE BRAKE LIGHT COMES ON AND THE VDC AND TRACTION DISENGAGES, ON SATURDAY APRIL 25, 2015, IT RAINED ALL DAY IN THE WASHINGTON DC AREA, I WAS AFRAID TO GO A CERTAIN SPEED, BECAUSE THE CAR COULD GET OUT OF CONTROL IF THE VDC AND TRACTION CONTROL IS NOT ENGAGED.",
        "vin": "JN1AZ4FH9AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2015",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712083,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC STEERING COLUMN LOCK MODULE FAILED, PREVENTING STARTING THE CAR. HAD IT TOWED, DEALER REPLACED AT A COST OF $1200, WELL KNOWN DEFECT AMONG NISSAN XXXZ OWNERS.  *TR",
        "vin": "JN1AZ4EH1AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705781,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN HAS HAD A RECALL ON MAXIMA AND ALTIMA VEHICLES, FOR STEERING LOCK MECHANISM FAILURES. MY 2010 370Z HAD THE SAME ISSUE. NISSAN WILL NOT REPLACE BECAUSE VEHICLE WAS MANUFACTURED AT A DIFFERENT PLANT?!   HOWEVER THE PART IS FROM THE SAME MANUFACTER. 1300.00 TO REPLACE.  *TR",
        "vin": "JN1AZ4FH1AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2015",
        "dateOfIncident": "02/26/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692870,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INTELLIGENT KEY SYSTEM WARNING LIGHT HAD BEEN FLASHING ON AND OFF.  TOOK IT IMMEDIATELY TO APPLE NISSAN IN YORK PER THE OWNERS MANUAL AND WAS TOLD NOTHING WAS WRONG WITH THE VEHICLE.  ABOUT 2 WEEKS LATER, WARNING LIGHT CAME ON AGAIN AND VEHICLE WILL NOT START.  PUSH START IS INDICATING LOCK ONLY.  SEEMS TO BE A COMMON PROBLEM THAT WARRANTS EITHER A RECALL OR AN EXTENDED WARRANTY ON THE ELECTRONIC STEERING LOCK MECHANISM.  WILL NOT EVER PURCHASE ANOTHER NISSAN.  *TR",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCK FAILED. THE PART FAILED WITHOUT ANY PRIOR INDICATION. I WAS STRANDED BECAUSE MY VEHICLE WOULD NO LONGER START. HAD TO GET MY CAR TOWED TO A DEALER AND WAS CHARGED $1100 TO REPLACE THE PART. VEHICLE WAS PURCHASED ONLY 3 MONTHS PRIOR AND HAD 29000 MILES ON IT.   *TR",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671471,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 NISSAN 370Z WITH POWER STEERING WHEEL LOCK ISSUE WHICH IS THE MOST COMMON PROBLEM ON 09-10 370Z AND NISSAN WON'T COVER IT UNDER RECALL. THE FIX IS FOR $1500. NISSAN WAS MY FAVORITE MAKE AND NOW IT SURELY LOST MY BUSINESS A AND LEFT STRANGLED. I HAVE FINANCIAL ISSUES AND NOW I CAN'T AFFORD TO FIX IT AND MY CAR HAS BEEN SITTING FOR 3 DAYS. THANKS NISSAN WITH A GREAT CUSTOMER SERVICE, LEAVING YOUR CUSTOMER STRANGLED. EVEN NISSAN USA COULDN'T HELP RESOLVE MY PROBLEM AND I AM BEYOND FRUSTRATED. PLEASE DO YOURSELF A FAVOR AND NEVER BUY A NISSAN!  *TR",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670587,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD GONE TO THE GYM AND AS I WAS LEAVING THE GYM MY CAR WOULDN'T START. I TRIED EVERYTHING I COULD THINK OF BUT NOTHING HELPED, I FINALLY TOOK IT TO THE NISSAN DEALER AND THEY SAID THE STEERING LOCK ASSEMBLY HAD FALLING APART. THE DEALER I TOOK MY CAR TO IS TOWN NORTH NISSAN IS AUSTIN, TX. *TR",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "12/24/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668390,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IGNITION IS STUCK IN LOCK AFTER BEING PARKED TO GO INTO THE MALL. KNOWN ISSUE THAT NISSAN ISSUED RECALL FOR GTR WHICH IS A MORE EXPENSIVE CAR BUT NOT FOR THE Z A LESS EXPENSIVE CAR. CAR WILL NOT START OR POWER INTO ACC MODE SO THE WINDOWS ARE ALSO STUCK DOWN AND HAVE NO WAY OF GOING UP. ISSUE HAS BEEN REPORTED MANY TIMES BUTTHE LOWER END CARS DO NOT GET A FIXC FOR THIS AND WILL LEAVE THE OWNERS STRANDED.  *TR",
        "vin": "JN1AZ4FH2AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662105,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DEC 2 2014 I NOTICED THAT THE INTELLIGENT KET LIGHT  WAS ON. ONCE I GOT HOME AFTER WORK I LOOKED IT UP ON THE   MANUEL AND IT SAID IT COULD BE A MALFUNCTION AND TO CONTACT A NISSAN DEALER. WELL ON THE MORNING OF 3 DEC I GO TO WORK AND NO LIGHT. AT AROUND 2030 I GOT RELEASED FOR THE DAY. GO TO START MY CAR AND NOTHING. HAD TO GET A RIDE TO A STORE AND WAIT FOR WIFE TO PICK ME UP.    *JS",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "10/31/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661443,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GO FROM PARK TO REVERSE REAR MAKE CLUNK NOISE AS SOON AS THE CAR START MOVING, OR DRIVING AT LOW SPEED WHEN STEP ON GAS IT ALSO MAKE CLUNK NOISE. BROUGHT THE CAR TO DEALERSHIP THINKING ITS UNDER MANUFACTURE 5 YEAR/50K POWER TRAIN WARRANTY ONLY TO FIND OUT ITS A NOT A WARRANTY ITEM AND WOULD NOT BE COVERED.     BUT ITS TSB NUMBER NTB12-055D. AND ITS OKAY TO KEEP DRIVING WITH OUT THE REPAIR. NOT SURE IF IT WOULD GET WORST OVER TIME WILL HAVE TO WAIT TILL IT CAUSES ACCIDENT. NOT FEEL SAFE DRIVING THE CAR WITH THOSE NOISE.",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START, IT WENT INTO IMMOBILIZATION AND WOULD NOT COME OUT.  WINDOWS ROLLED DOWN, BOTTOM DISPLAYED 'LOCK'  AND WOULD NOT GO INTO ACC OR START.  *TR",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650766,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH SLAVE CYLINDER FAILED ON ME. I HEAR THIS IS A KNOWN PROBLEM IN 370Z'S AMONG THE REST OF THE 370Z COMMUNITY YET THE MANUFACTURER REFUSES TO ACKNOWLEDGE THAT IT'S A COMMON PROBLEM.  *TR",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "09/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO START CAR IN THE MORNING AND IT DID START MOVED UP 5 FEET TO WASH CAR WASHED CAR THEN TRIED TO START AGAIN NOTHING WOULD NOT START AT ALL FOUND OUT IT WAS THE STEERING LOCK ASSEMBLY THIS IS A KNOW PART TO FAIL AND THEIRS NO WAY IT SHOULD ON A CAR SO NEW IT HAPPENS TO A LOT OF NISSANS 2009 2010 370Z ITS A KNOWN PART TO FAIL AND WHEN IT DOES THEIRS NOTHING YOU CAN DO TO START THE CAR IT COST 1600 DOLLARS TO FIX AND NISSAN KNOWS THEIRS A PROBLEM BUT NO RECALL THE GTR HAD THE SAME PROBLEM BUT THEY FIXED THAT BECAUSE ITS A VERY COSTLY CAR BUT THE 370 Z NOTHING YET THE DEALER JUST LAUGH AND I ALSO CALLED NISSAN AND THEY DID THE SAME THING WHEN THEY NO THIS HAPPENS ALOT WITH THIS PART I THINK ITS VERY BAD FOR NISSAN TO TREAT THEIR PEOPLE LIKE THAT I WILL NEVER DEAL WITH NISSAN AGAIN AND I SHOWED NISSAN OVER A THOUSAND EMAILS AND PROBLEMS WITH THIS PART AND THEY JUST DON'T CARE I CAN UNDERSTAND IF IT WAS NOT A PROBLEM THAT MUCH BUT THIS STEERING BOX ON THE 370 Z IS A BIG PROBLEM 40 THOUSAND DOLLAR CAR AND NISSAN HAS OR DON'T CARE I WOULD JUST GIVE IT BACK TOO THEM BUT ONCE THEY HAVE YOUR MONEY NISSAN CAN CARE LESS IT SEEMS LIKE ITS SAD.  *TR",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "08/10/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621832,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED OUT OF MY DRIVE WHEN AS I START OUT IN 1ST GEAR THE CAR STALLED.. BECAUSE THE CLUTCH WHICH NORMALLY CATCHES HALF WAY OUT WAS NOW ALL OF SUDDEN CATCHING RIGHT AS MY FOOT WAS LEAVING THE FIRE WALL. WHICH I KNOW WAS NOT NORMAL.. HOW EVER BEING A HYDRAULIC SYSTEM I CHECKED THE FLUID RESERVOIR TO SEE IF IT WAS LOW. THE SYSTEM WAS WITH IN THE MIN AND MAX LEVEL I CONTINUED ON WHEN ONLY A MILE OR SO DOWN THE ROAD THE CLUTCH PEDDLE NOW STUCK TO THE FLOOR AND WOULD NOT RELEASE FROM THE FIRE WALL. IT WOULD ONLY MOVE 2 INCHES IN OR 2 INCHES OUT. IT STILL WOULD ALLOW ME TO SHIFT. I LIMED THE CAR HOME AND SINCE IT WAS SUNDAY AND THE DEALERSHIPS ARE NOT OPEN I HAD TO WAIT TO MONDAY MORNING AUG. 11TH TO CONTACT THE DEALER. WHEN I STARTED TO CAR UP MONDAY THE CAR WOULD NO LONGER ALLOW ME TO SHIFT INTO ANY GEAR AT ALL. I CALLED NISSAN NORTH TOWN IN AUSTIN, TX TO HAVE THE CAR TOWED IN.   *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH LOST ALL PRESSURE AND I WAS UNABLE TO SHIFT COMING OFF THE INTERSTATE. LEFT ME STRANDED FOR HOURS ON MY WAY TO NORTH CAROLINA FROM FL. APPEARS TO BE A COMMON ISSUE WITH THE 370Z AND LONGER TRIPS. I WAS JUST TRAVELING WITH CRUISE CONTROL ON AT ABOUT 70MPH AND THE CLUTCH PEDAL FELL TO THE FLOOR WHEN I ATTEMPTED TO SLOW DOWN WHILE EXITING THE INTERSTATE I-75N. THIS NEEDS TO BE RECALLED! I SHOULD NOT HAVE TO PAY FOR A DEFECTIVE PRODUCT. I WILL NOT BUY OR RECOMMEND ANOTHER NISSAN UNTIL THIS GETS REPLACED FOR FREE.  *TR",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588926,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH MASTER CYLINDER FAILED.  I WAS ON A HIGHWAY AND WAS UNABLE TO SHIFT THE CAR INTO A DIFFERENT GEAR.  I BARELY MADE IT OFF THE HIGHWAY WHERE I WAS TOWED TO THE DEALERSHIP.  THE CLUTCH JUST COMPLETELY LOST PRESSURE.  *TR",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585118,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE FAILURE OF THE CONCENTRIC SLAVE/MASTER CYLINDER. CAUSES THE CLUTCH PEDAL TO SINK DOWN AND NOT COME BACK UP. VERY DANGEROUS WHEN CLUTCH RANDOMLY ENGAGES BECAUSE OF THIS.    ENTHUSIASTS HAVE DIAGNOSED THE PROBLEM IS DUE TO PLASTIC COMPONENTS USED IN THE CYLINDERS. THERE IS ALREADY A AFTERMARKET SLAVE CYLINDER THAT FIXES THIS PROBLEM BY USING METAL COMPONENTS.  *TR",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/24/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584588,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE AMOUNTS OF CONDENSATION IN HEADLIGHT CAUSED HID HEADLIGHT TO FAIL. THIS SEEMS TO BE A PROBLEM IN NISSAN VEHICLES. HID HEADLIGHTS SHOULD NOT FAIL DUE TO  MOISTURE   INTRUDING INTO THE HEADLIGHT ASSEMBLY.  MOISTURE IN THE ASSEMBLY WILL EVENTUALLY IMPACT THE ENTIRE ELECTRICAL SYSTEM OF THE VEHICLE. THE BULB HAS FAILED.DROPS OF WATER FORM IN THE HEAD LIGHT ASSEMBLY.    HEADLIGHTS SHOULD NOT FAIL DUE TO MOISTURE INTRUSION CAUSED BY A DEFECT. IT IS A LAW IN MOST STATES THAT LIGHTS SHOULD BE ON DURING INCLEMENT WEATHER.  *TR",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567062,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING BACK HOME AFTER WORK (30 MIN DRIVE) CITY, CLUTCH BECAME SOFT AND DELAY ITS WAY BACK TO NORMAL POSITION SHIFTING TO 3RD GEAR. DRIVING CONDITIONS WHERE 50MPH, 23MPG AT 7PM.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565606,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS PARKED AT WORK AND I  WENT TO START IT  WHEN I WAS LEAVING TO GO  HOME AND IT FAILED TO START  FOR TWO DAYS, CALLED NISSAN THEY COULD NOT TELL ME WHAT WAS WRONG WITH IT.  THEY WOULD NOT EVEN HAD A TOW TRUCK COME AND TOW THE CAR. I HAD TO HAVE CAR TOWED  THRU MY INSURANCE COMPANY TO NISSAN DEALERSHIP  AND THEY  SAID IT WAS THE STEERING WHEEL LOCK. $1,300 LATER. I WAS STRANDED AT WORK LATE AT NIGHT. THE INTERNET SEARCHES SHOW THIS HAS BEEN A COMMON PROBLEM FOR THE 370Z OWNERS SINCE 2009. I FEEL NISSAN SHOULD HAVE A MANDATORY RECALL FOR A PART THAT IS LIKELY TO FAIL AT ANY TIME AND LEAVE THE DRIVER STRANDED. I AM TERRIFIED TO  TURN MY CAR OFF NOT A GOOD FEELING. PLEASE HELP! AND WOULD APPRECIATE BEING COMPENSATED FOR SOMETHING THAT IS NOT MY FAULT.  *TR",
        "vin": "JN1AA4FH9AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR UNDER NORMAL DRIVING CONDITIONS, THE CLUTCH PEDAL WOULD NOT COME UP FROM THE FLOOR AFTER COMING TO A STOP AT A STOP SIGN. AFTER LETTING THE CAR SIT FOR APPROX. 90 MINUTES, THE CLUTCH PEDAL OPERATION APPEARED TO RETURN TO NORMAL.    I WENT ONLINE TO RESEARCH THIS PROBLEM AND FOUND THIS...  PER NISSAN: SUBJECT: SB 370Z COUPE AND ROADSTER; CLUTCH PEDAL DOES NOT RETURN TO REST POSITION   SUMMARY OF NTB13026: IF YOU CONFIRM: THE CLUTCH PEDAL ON AN APPLIED VEHICLE DOES NOT RETURN TO ITS NORMAL (RESTED) POSITION AFTER BEING DEPRESSED TO THE FLOOR OR THE CUSTOMER STATES THE CLUTCH PEDAL ON AN APPLIED VEHICLE DOES NOT RETURN TO ITS NORMAL (RESTED) POSITION AFTER BEING DEPRESSED TO THE FLOOR *AND THERE ARE NO LEAKS IN THE CLUTCH HYDRAULIC SYSTEM*. ACTION: CHANGE THE CLUTCH HYDRAULIC SYSTEM FLUID WITH GT-R R35 SPECIAL BRAKE FLUID (SEE PARTS INFORMATION). - REFER TO SERVICE PROCEDURE FOR BLEEDING PROCEDURE. SEE THIS BULLETIN FOR FURTHER DETAIL.    I TOOK THE CAR TO A LOCAL NISSAN DEALERSHIP AND THEY WERE ABLE TO REPLICATE THE PROBLEM. THEIR SOLUTION WAS TO REPLACE THE CLUTCH FLUID WITHE THE GTR R35 SPECIAL BRAKE FLUID AS DESCRIBED IN THE SERVICE BULLETIN.  HOWEVER, I'VE READ MULTIPLE REPORTS THAT THIS \"FIX\" ONLY HOLDS UP TEMPORARILY AND, THAT EVENTUALLY THE CSC (CONCENTRIC SLAVE CYLINDER) AND/OR THE CMC (CLUTCH MASTER CYLINDER) FAIL. MANY, MANY 370Z OWNERS HAVE HAD TO HAVE BOTH THE CSC & CMC REPLACED. THE NISSAN DEALERSHIP WHERE I TOOK MY CAR SAID THEY WOULD REPLACE THOSE PARTS BUT, ONLY IF I EXPERIENCE THE CLUTCH PEDAL FAILURE AGAIN. MY FEELING IS THAT THEY SHOULD'VE REPLACED THESE PARTS WHEN THEY REPLACED THE FLUID SINCE THEY'RE AWARE THAT MERELY CHANGING THE FLUID IS NOT REALLY FIXING THE PROBLEM SINCE THE CSC & CMC SO OFTEN FAIL EVEN AFTER THE FLUIDS HAVE BEEN CHANGED.  *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/14/2014",
        "dateOfIncident": "02/13/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564433,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED THE VEHICLE AT A GAS STATION TO REFUEL.  UPON COMPLETION OF REFUELING, DEPRESSED THE BRAKE AND PRESSED THE STARTER BUTTON (NORMAL STARTING PROCEDURE).  THE STARTER INDICATOR WOULD NOT CHANGE FROM \"LOCK\", THE VEHICLE WOULD NOT CRANK, AND NO ACCESSORIES WOULD ACTIVATE.  THE VEHICLE WAS SUBSEQUENTLY TOWED TO A LOCAL NISSAN DEALER.  AFTER EVALUATION, DEALER STATED THE \"STEERING LOCK\" UNIT HAD FAILED.  AFTER AN INTERNET SEARCH, THIS APPEARS TO BE PART 48700-JF00D.  THE NISSAN DEALER REPRESENTATIVE STATED THIS ISSUE IS COVERED UNDER A TSB, BUT I CANNOT CONFIRM AT THIS TIME.  THE DEALER STATED THE PART WILL NOT BE AVAILABLE FOR AT LEAST TWO WEEKS, AND NISSAN WILL NOT OFFER A COURTESY VEHICLE.  INTERNET SEARCHES SHOW THIS HAS BEEN A COMMON PROBLEM FOR 370Z OWNERS SINCE 2009, AND THE STEERING LOCK WAS REMOVED IN 2012 MODELS FORWARD.  I FEEL NISSAN SHOULD HAVE DONE A MANDATORY RECALL FOR A PART THAT IS LIKELY TO FAIL AT ANY TIME AND LEAVE THE DRIVER STRANDED.  *TR",
        "vin": "JN1AZ4FH3AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563774,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL WOULD NOT LOCK AFTER TURNING ENGINE OFF. LATER, IT WOULD NOT START. CALLED DEALER. ASKED IF WHEEL WOULD TURN. TOLD THEM IT WOULD. THEY IMMEDIATELY SUGGESTED IT WAS A STEERING WHEEL LOCK FAILURE. LATER CONFIRMED AT DEALERSHIP.  *TR",
        "vin": "JN1AZ4EN7AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/18/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561132,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECURRING ISSUES WITH THIS VEHICLE WHERE IF DRIVING LONG DISTANCES SUDDENLY THE CLUTCH WOULD GO TO THE FLOOR AND EVENTUALLY LOSE ALL RESISTANCE AND MAKE THE CAR UNDRIVABLE.  I DISCOVERED THIS SHORTLY AFTER I PURCHASED THE VEHICLE AT 20000 MILES.  I TOOK IT BACK TO THE PLACE I PURCHASED FROM AND BECAUSE IT WAS INTERMITTENT THEY COULD NOT REPRODUCE THE ISSUE.  THE NEXT TIME IT HAPPENED I WAS TOLD TO TAKE IT TO THE DEALER.  THE PROBLEM CAME BACK AND I WAS TOLD I NEEDED TO MAKE AN APPOINTMENT AT THE DEALER.  BY THE TIME I TOOK IT TO THE DEALER IT WAS AGAIN NOT HAPPENING SO THEY WERE NOT ABLE TO FIND THE PROBLEM.  SATURDAY THE 18TH OF JAN. IT HAPPENED AGAIN AND I WAS ABLE TO TAKE IT TO THE DEALER WHILE IT WAS HAPPENING.  THEY FOUND THE PROBLEM WAS THE SLAVE CYLINDER LEAKING BUT BECAUSE NOW I AM OVER THE WARRANTY NISSAN WILL NOT COVER THE ISSUE.  I HAVE RESEARCHED THIS ISSUE AND SEEN SEVERAL PEOPLE COMPLAINING ABOUT THE INTERMITTENT ISSUE WITH THE CLUTCH THAT GOES TO THE FLOOR WITH VERY LOW MILES ON THE CAR.  THE ISSUE SEEMS TO BE THAT THE PART THAT BREAKS IS PLASTIC AND NISSAN HASN'T REDESIGNED IT SINCE THE 350Z MODELS THAT ALSO EXPERIENCE THE SAME ISSUE.  PLEASE CAN SOMEONE LOOK INTO THIS?  *TR",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "12/06/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560299,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 6, MY VEHICLE'S ENGINE DID NOT START AT A GAS STATION, SO I HAD TO TOW IT TO THE NEAREST NISSAN DEALERSHIP. WHEN I TOWED IT IN TO THE DEALERSHIP, THE SERVICE WRITER ALREADY KNEW THE CAUSE OF THE FAILURE AND TOLD ME THAT THIS WILL PROBABLY BE REPAIRED AT NO CHARGE. HE SAID THAT THIS IS VERY COMMON ON Z.    AFTER THE DIAGNOSIS, HE CALLED ME AND SAID THAT THE ELECTRIC STEERING COLUMN LOCK NEEDS TO BE REPLACED. THIS PARTS IS WHAT THEY REPLACES A LOT FOR THIS SERVICE CAMPAIGN, BUT SOMEHOW MY VEHICLE DOES NOT FALL IN TO THIS SERVICE CAMPAIGN, AND HE DOES NOT UNDERSTAND WHY IT DOES NOT, SO HE TOLD ME TO CALL 800-NISSAN1 TO FILE A COMPLAINT.          NOW, THIS SERVICE CAMPAIGN WAS RELEASED FOR ELECTRIC STEERING COLUMN LOCK PROBLEM FOR 2009-2010 370Z, AND NOW, BASED ON SERVICE WRITER?S OPINION AND MY RESEARCH ON THIS CAMPAIGN, MY VEHICLE ISSUE SHOULD BE INCLUDED IN THE SERVICE CAMPAIGN DUE TO       1   MY VEHICLE IS 2010 370Z.    2   THE PARTS WHICH CAUSED FOR MY VEHICLE ISSUE WAS ELECTRIC STEERING COLUMN LOCK, AND THIS PART IS THE EXACTLY SAME PARTS REPLACED TO TAKE CARE OF THIS SERVICE CAMPAIGN.  *TR",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/23/2013",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557009,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 NISSAN 370Z. THE CONTACT STATED THAT AFTER SEVERAL ATTEMPTS, THE ENGINE FAILED TO START. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE MALFUNCTION WAS RELATED TO A VOLUNTARY RECALL ISSUED BY THE MANUFACTURER. THE RECALL PERTAINED TO THE ELECTRONIC STEERING COLUMN LOCK, HOWEVER THE CONTACT'S VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 47,000.",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2013",
        "dateOfIncident": "10/26/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550025,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START, NO WARNING AT ALL. HAD CAR TOWED TO DEALER. REPLACED FAULTY STEERING LOCK ASSEMBLY. THIS IS A KNOWN ISSUE WITH NISSAN AND THEY NEED TO RECALL OR EXTEND THE WARRANTY ON THIS PART. I AM OUT $1200 FOR AN ISSUE NISSAN IS WELL AWARE OF.   *TR",
        "vin": "JN1AZ4EH8AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2013",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549354,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER SAYS IT'S THE STEERING WHEEL LOCK ISSUE. WARRANTY EXPIRED AND NOW THEY'RE ASKING 1,200 TO FIX THE ISSUE FOR PARTS AND LABOR. THIS IS RIDICULOUS. APPARENTLY IT'S A COMMON ISSUE FOR ALL 2009 AND 2010 Z'S AND THEY'RE ONLY RECALLING SOME 2010 MODELS. I NEED THIS RECALLED BECAUSE OF THE OBVIOUS DEFECTIVE PART THAT WAS INSTALLED IN THE CAR. UNLESS I CAN GET THIS FIXED AT NO COST I WILL NOT PURCHASE ANOTHER NISSAN. EVER. THEY ALREADY HAVE AWFUL BRAKES AND ROTORS AND NOW THIS? SHAME  *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STEERING LOCK FAILED AT 31,900 MILES. SAME STORY AS ALL OF THE OTHER COMPLAINTS ON HERE- CAR WOULD NOT START. INTELLIGENT KEY LIGHT FLASHED ON THE DASHBOARD. THIS DEFECT CAN BE EXTREMELY DANGEROUS, LEAVING THE DRIVER STRANDED IN ANY LOCATION AND ANY KIND OF WEATHER WITHOUT ANY WARNING. PROBLEMS WITH THE ELECTRONIC STEERING LOCK ARE WELL-DOCUMENTED AND WELL-PUBLICIZED AND HAVE RESULTED IN EXTENDED WARRANTIES OFFERED TO 2009 ALTIMAS, MAXIMAS, AND SELECT 2009-2010 370Z AND GTR. HOWEVER, IT IS THE SAME PART THAT IS FAILING ON ALL OF THESE MODELS. WHY ARE SOME VINS INCLUDED IN THE SERVICE CAMPAIGN/EXTENDED WARRANTY WHILE OTHERS ARE NOT? THEY ALL CONTAIN THE SAME DEFECTIVE PART (48700-JF00A, 48700-JF00B, OR 48700-JF00C; REVA, REVB, OR REVC). I PURCHASED THE CAR NEW AND HAVE OWNED IT FOR 3 YEARS AND 4 MONTHS SO IT IS OUTSIDE OF THE ORIGINAL WARRANTY. REPAIR COSTS ARE $1100-1400 INCLUDING LABOR. I AM TIRED OF NISSAN TELLING ME THAT MY VEHICLE IS NOT AN AFFECTED VIN. CLEARLY, IT IS. NISSAN NEEDS TO EXTEND THE SERVICE CAMPAIGN TO ALL VINS THAT CONTAIN THIS DEFECTIVE PART TO PREVENT PUTTING DRIVERS IN A POTENTIALLY DANGEROUS SITUATION. HOW MANY COMPLAINTS NEED TO BE FILED BEFORE A TREND IS NOTED BY ODI? THIS WILL BE MY LAST NISSAN.   *TR",
        "vin": "JN1AZ4EHXAM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "10/07/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548441,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO THE SUPERMARKET AND WHEN I RETURNED TO THE CAR 15 MIN LATER TO RETURN HOME THE CAR WOULDN'T START DEALER CONFIRMED THAT THE STEERING LOCK HAD BROKEN AND THE FIX WAS BETWEEN $1300-1700. THE SAME ISSUE WAS FOUND ON THE NISSAN GTR BUT NISSAN ISSUED A RECALL FOR THE $85K BUT NEGLECTED TO EXTEND THE RECALL TO INCLUDE THE 370Z.  *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "05/31/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524150,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DRIVER'S SEAT IS WORN IN THE AREA OF THE SEAT AIRBAG AND I AM CONCERNED THAT THE AIRBAG WILL NOT DEPLOY AS DESIGNED IN THE EVENT OF A SIDE CRASH. THE WEAR AREA IS WEAKER THAN DESIGNED AND THIS MAY ALLOW THE AIRBAG TO NOT PROTECT THE OCCUPANT IF AND WHEN REQUIRED.   *TR",
        "vin": "JN1AZ4EH3AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2013",
        "dateOfIncident": "03/14/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503030,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE ISSUE RECALL! STEERING LOCK CONTROL UNIT FAILED WITH COST APPROXIMATELY $1000-$2000. THANK YOU!  *TR",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT STRANDED IN A STRESSFUL SITUATION. I GOT INTO MY VEHICLE AND IT WOULD NOT START. THOUGHT IT WAS THE KEY, SO A DAY LATER AFTER LEAVING THE CAR STRANDED I CAME BACK WITH MY SPARE KEY. IT DIDN'T WORK EITHER. HAD TO TOW IT TO THE DEALERSHIP. THEY SAID IT WAS THE STEERING COLUMN LOCK WHICH FAILED IN PLACE RENDERING THE VEHICLE USELESS. ONCE THE STEERING LOCKS, THE VEHICLE BECOMES ELECTRONICALLY DISABLED. THIS SEEMS TO BE A COMMON PROBLEM WITH THE 370Z MODELS 2009 THRU 2011. 100% OF COMMENTS I HAVE READ CLAIM NISSAN DOES NOT COVER REPAIRS. TOTAL COST OF REPAIRS = $1000 TO $2000. THIS IS FRUSTRATING I BOUGHT THE CAR WITH 7K MILES ON IT, NOW 10000 MILES LATER AND ABOUT A YEAR OF OWNING IT THIS HAPPENS.  *TR",
        "vin": "JN1AZ4EH0AM"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2013",
        "dateOfIncident": "02/22/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499827,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START. LEFT ME STRANDED. HAD TO CALL A FLATBED TRUCK TO TAKE IT TO THE GARAGE.  THEY TOLD ME IT WAS THE STEERING LOCK UNIT THAT CAUSED THE PROBLEM.  *TR",
        "vin": "JN1AZ4EH4AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2013",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496308,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCK FAILED CAUSING CAR NOT TO START. PART WAS 48700-JF00B.  *TR",
        "vin": "JN1AZ4EH6AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2013",
        "dateOfIncident": "01/24/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494783,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCK RELAY FAILED AND CAUSED WHEEL TO REMAIN LOCKED (CAR WILL NOT START). COST OVER $1,000 AFTER LABOR AND TOW. WIDELY DOCUMENTED ISSUE ON MANY WEBSITES AND CAR FORUMS (THE370Z.COM). ALSO, ISSUE HAS BEEN ADDRESSED BY NISSAN FOR THE GT-R AND EVEN REMOVED THIS STEERING LOCK FROM NEWER 2011 MODELS, AND ALL 2012 AND 2013. THEY NEED TO RECALL THIS PART WITH AN UPDATED PART OR REMOVE IT COMPLETELY AND REIMBURSE THOSE AFFECTED!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2013",
        "dateOfIncident": "01/06/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STEERING LOCK FAILED CAUSING THE COMPUTER TO NOT START MY CAR. STRANDING ME WITH A CAR THAT WOULDN'T START.  *TR",
        "vin": "JN1AZ4EH7AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490329,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED VEHICLE IN PARKING SPOT AND SHUT OFF ENGINE. YELLOW KEY LIGHT TURNED ON AND STEERING WHEEL LOCKED. VEHICLE WOULD NOT TURN ON. STEERING WHEEL LOCK FAILURE ON NISSAN 370Z NISMO- YEAR 2010. PART MALFUNCTION 48700-JF00B . PROBLEM PART ON 2009 AND EARLY 2010 MODELS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2012",
        "dateOfIncident": "06/19/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST PROBLEM-EXCESIVE OIL LEAK COMING FROM U JOINT DRIVE SHAFT, AFTER 3/4 COMPLAINTS, I TOOK PICTURES AND THE THEY WERE FORCED TO REPLACE THE DRIVE SHAFT.  SECOND PROBLEM -VEHICLE WON'T START AT TIMES AND IF STARTS- CRANKS,CHECK ENGINE LIGHT CAME ON SEVERAL TIMES. AFTER 6/7 REFUSALS THAT A PROBLEM EXIST, THE DEALER ATTEMPTED TO RESOLVE THE ISSUE AND FINALLY REPLACE THE STEERING LOCK THAT ACCORDING TO THEM PREVENT STARTING THE CAR. SOMETIMES WHEN I AM ON THE FWY I HAVE THE FEELING THAT THE ENGINE IS ABOUT TO TURN OFF.  CURRENTLY THE CAR IS AT THE DEALER FOR THE SAME ISSUE AND AGAIN THEY REFUSE TO ACKNOWLEDGE THAT THERE IS A PROBLEM. FINALLY,WHEN I WENT TO TAKE THE CAR OUT OF THE DEALER AS SOON AS I CLOSED MY DOOR FROM OUTSIDE, THE DRIVER WINDOW ROLLED DOWN AND I WAS FORCED TO  LEAVE THE CAR  AT THE DEALER FOR ONE MORE DAY. TODAY   THEY  WERE ASKING ME TO PAY  ABOUT $500 FOR THE WINDOW EVEN THOUGH WHEN I LEFT THE CAR WITH THEM, THE WINDOW WAS WORKING PROPERLY.  I THINK THAT NISSAN IS WELL AWARE OF THE FAULTY LOCKS, THE OIL LEAKS FROM THE DRIVE SHAFT AND THE POWER WINDOW  PROBLEMS, HOWEVER THEY SIMPLY REFUSE TO FACE THE REALITY. DEALING WITH NISSAN CORP. AND THE GLENDALE NISSAN DEALER, IT IS AN ENDLESS NIGHTMARE.......",
        "vin": "JN1AZ4EH5AM"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "10/30/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482693,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOWN ISSUE ON SOME 370ZS,NISSAN GTRS  AND ALTIMAS.  WHEN STEERING LOCK FAILS CAR WILL NOT NOT START, WITHOUT LOCK RELEASE PUSH BUTTON START IS RENDERED USELESS.  NISSAN IS AWARE OF THE ISSUE BUT CHOSE NOT TO CORRECT IT.  *TR",
        "vin": "JN1AZ4EH2AM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449311,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCK MECHANISM FAILS, CAR WILL NOT START. IMPOSSIBLE TO TOW OUT OR PUSH OUT IF INSIDE NARROW GARAGE, OR GARAGE THAT REQUIRES MANEUVERING BECAUSE STEERING COLUMN IS LOCKED. THE SAME UNIT HAS BEEN RECALLED FOR NISSAN GTR - MUST BE RECALLED FOR 370Z, AS WELL. HAS VERY DANGEROUS POTENTIAL TO LEAVE SOMEONE STRANDED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2012",
        "dateOfIncident": "02/24/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449206,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN LISTEN UP  ------------------------------    THIS IS A KNOWN ISSUE WITH THE NISSAN STEERING LOCK MECHANISM AS OTHERS HAVE REPORTED. MY CAR WAS STRANDED IN THE MIDDLE OF NOWHERE. COULD NOT START THE CAR, THE MANUAL KEY WAS NOT HELP. CAR WOULD NOT START. I TRIED TO ORDER THE PART, STEERING LOCK VERSION 'D', BUT IT'S BACKORDERED AND NISSAN USA IS NOT SELLING THIS PART TO CONSUMERS ACCORDING TO NORTHERN VIRGINIA NISSAN DEALERS.  MY ONLY RESOURCE WAS IT GET IT TOWED AND PAY $1450.00 FOR PART + LABOR FROM THE DEALER DIRECTLY.    THIS IS DEFINITELY NOT RIGHT. MY CAR HAS 5000 MILES ON IT. AND THE STEERING LOCK FAILURE (VERSION A,B,C) HAS HAPPENED TO MANY OWNERS WHO HAVE KEYLESS IGNITION ON NISSAN ON THE GTR MODEL, AND THE PART WAS RECALLED. YET FOR 370Z OWNERS, NO ACTION.    DEFINITELY MY LAST NISSAN...  *TR",
        "vin": "JN1AZ4EH9AM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445523,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFF FAILED DUE TO OVERHEATING, REPLACEMENT UNIT FAILED 6 MONTHS LATER.  *TR",
        "vin": ""
    }
]