[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/12/2012",
        "dateOfIncident": "08/23/2012",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478963,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "PETERBILT",
                "productModel": "320",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2010 PETERBILT 320 GARBAGE TRUCK WAS RETURNING FROM THE WASTE DISPOSAL SITE. THE DRIVER APPLIED THE BRAKES AND THE BRAKE PEDAL BROKE OFF THE MOUNTING BRACKETS THAT SECURES THE BRAKE PEDAL TO THE FLOOR AND THE PETAL FELL OVER SIDEWAYS, RESULTING IN THE LOSS OF BRAKING ABILITY FOR THE TRUCK. THE TWO VERY SMALL BRACKETS, ONE ON EACH SIDE OF THE BRAKE PEDAL WHICH HAS A ROD IN THE BOTTOM THE GOES THROUGH THE PEDAL AND INTO EACH BRACKET WHICH PETERBILT CALLS A BEARING. THE BRACKETS (BEARINGS) BOTH DETERIORATED AS THEY ARE MADE OF A VERY LIGHT POT METAL TYPE MATERIAL AND WHEN THE BRAKE WAS APPLIED BROKE INTO SEVERAL PIECES.  THE TRUCK WAS PUT INTO SERVICE IN OCTOBER 2010, LESS THAN 2 YEARS AGO. WE ALSO HAVE ANOTHER PETERBILT 320 THAT HAS THE SAME COMPONENTS THAT ARE ALSO DETERIORATING. I WENT TO THE DEALER AND GOT REPLACEMENT BRACKETS (BEARINGS) WHICH ARE MADE OF A HEAVER STEEL TYPE MATERIAL BUT THE BRACKETS (BEARINGS) ARE STILL OF THE SAME STYLE WHICH ARE VERY SMALL AND I BELIEVE WITH THE FORCE THAT A DRIVER USES ON ANY BRAKE PETAL THESE SHOULD BE OF A HEAVIER  TYPE CONSTRUCTION AND SIZE.  I BELIEVE AT A MINIMUM THAT ALL PETERBILT 320'S WITH THESE STYLE BRACKETS (BEARINGS) SHOULD BE RECALLED AND THE NEW HEAVIER MATERIAL BRACKETS (BEARINGS) BE INSTALLED UNTIL THE WHOLE ASSEMBLY IS RESIGNED TO A HIGHER AND MORE RELIABLE STANDARD AND REPLACED ON ALL OF THESE TRUCKS.  I DO HAVE THE OLD PIECES AND PICTURES OF THEM THAT I COULD SEND YOU.",
        "vin": "3BPZL00X3BF"
    }
]