[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2014",
        "dateOfIncident": "02/07/2013",
        "fire": false,
        "manufacturer": "Piaggio Group Americas, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572577,
        "products": [
            {
                "manufacturer": "Piaggio Group Americas, Inc.",
                "productMake": "PIAGGIO",
                "productModel": "VESPA GTS 300",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VESPA SHUTS DOWN OUT OF THE BLUE WHILE DRIVING ON THE FREEWAY - TWICE WITHIN 2 MONTHS, ONE TIME IN THE FAST LANE, CAUSING A SAFETY HAZARD FOR MYSELF SINCE I HAD TO WAIT (AT 9:30 PM AT THE MEDIAN ON A HIGH TRAFFIC FREEWAY) FOR THE AAA TO HAUL ME TO THE SHOP. THANKS TO CHP OFFICERS WHO PROVIDED SUPPORT AND LIGHT DURING MY UNFORTUNATE EXPERIENCE.   READING THE ARTICLES ABOUT GM ENGINE SHUTDOWNS MAKES ME FILE MY INCIDENT AND WONDERING, WHETHER THERE ARE RECALLS FOR VESPAS, TOO? HAVING YOUR MOTORCYCLE SHUT DOWN WITHOUT ANY WARNINGS AT NIGHT ON THE FREEWAY IS REALLY SCARY AND UNSAFE!   MY MECHANICS DIAGNOSED \"PURGE VALVE STUCK OPEN NOT LETTING TANK VENT\" AND \"FUEL TANK VENT TUBE ISSUES\". THEY COULD NOT RECALL THE INCIDENT DURING THEIR TEST RIDES AFTER FIXING THE ABOVE MENTIONED, BUT SAID THERE MIGHT BE THE CHANCE IT HAPPENS AGAIN. HOW UNSAFE DO I FEEL NOW? I DO NOT WANT TO THINK WHAT HAPPENS WHEN I DRIVE IN THE MIDDLE LANE, THE ENGINE SHUTS DOWN AND I AM NOT ABLE TO \"ROLL\" OFF TO THE SIDE - I GET RUN OVER BY CARS, AND THAT'S IT I GUESS...  HOW SHOULD I RESPOND TO THIS ISSUE? DO I CONTACT VESPA USA?     THANK YOU FOR YOUR ASSISTANCE!   *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2013",
        "dateOfIncident": "03/06/2013",
        "fire": false,
        "manufacturer": "Piaggio Group Americas, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509892,
        "products": [
            {
                "manufacturer": "Piaggio Group Americas, Inc.",
                "productMake": "PIAGGIO",
                "productModel": "VESPA GTS 300",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VESPA GTS SUPER 300IE (2010) FAILED TO START ON TWO OCCASIONS.  EACH FAILURE WAS AFTER VESPA HAD WARMED UP AND HAD BEEN SWITCHED OFF FOR SHORT TIME.  RESTART WITH WARM ENGINE FAILED.  FUEL PUMP WOULD NOT OPERATE.  FUEL PUMP \"REMOTE\" RELAY CLICKED ON FOR TWO SECONDS (AS NORMAL WHEN IGNITION SWITCHED ON), BUT FUEL PUMP DID NOT OPERATE.  AFTER VESPA REMAINED OFF FOR OVER AN HOUR, IT STARTED NORMALLY.  STRANDED TWICE WITHOUT WARNING.  *TR",
        "vin": "ZAPM459LXA5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2012",
        "dateOfIncident": "04/19/2012",
        "fire": false,
        "manufacturer": "Piaggio Group Americas, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457097,
        "products": [
            {
                "manufacturer": "Piaggio Group Americas, Inc.",
                "productMake": "PIAGGIO",
                "productModel": "VESPA GTS 300",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RIDING HOME FROM DEALER SHIP 18 MILES, AT 292 MILES ON IT, AND CYCLE AT A WARM OPERATION TEMPERATURE IT WOULD NOT RESTART AND ACTED AS IF VAPOR LOCKED. RESTARTED FINE WHEN COOL HOURS LATER. HAS REPEATED THE SAME CONDITION  EVERY TIME SINCE , ABOUT 6 OR 7 TIMES AND HAS LESS THAN 390 MILES ON IT. THE DEALER SHIP SO FAR THINKS IT HAS GASOLINE IN THE CHARCOLE CANISTER. I HAVE AN APPONTMENT TO HAVE THEM CHECK IT TOMORROW.            *JS",
        "vin": "ZAPM459L3A5"
    }
]