[
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/12/2010",
        "dateOfIncident": "12/11/2010",
        "fire": false,
        "manufacturer": "POLARIS INDUSTRIES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10370285,
        "products": [
            {
                "manufacturer": "POLARIS INDUSTRIES, INC.",
                "productMake": "POLARIS",
                "productModel": "RANGER 800",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE CABLE STUCK WIDE OPEN ON MY 2010 POLARIS RAZER. MY SON WAS STARTING IT AND WHEN HE PUT IT IN GEAR , THE THROTTLE CABLE STUCK WIDE OPEN WHEN HE PUSHED ON THE GAS PEDAL. HE WAS UNABLE TO BRAKE AND GET IT TO STOP. THE MACHINE TRAVELED ABOUT 30 FEET BEFORE HE CRASHED THROUGH THE REAR GARAGE DOOR. HE CONTINUED THROUGH THE GARAGE AND SMASHED INTO A CAR THAT WAS PARKED IN THE DRIVEWAY. THE MACHINE WAS SPUN SIDEWAYS . MY SON JUMPED OUT OF IT AND THE MACHINE CONTINUED TO SPIN TIRES AT FULL THROTTLE.  I WAS FINALLY ABLE TO REACH IN AND TURN KEY OFF.  HAD MY SON NOT HIT THE CAR IN THE DRIVEWAY, I BELIEVE HE WOULD HAVE CONTINUED ACROSS THE STREET AT ABOUT 45 MPH AND WOULD HAVE RUN THROUGH THE NEIGHBORS HOUSE, POSSIBLY COULD HAVE BEEN A FATAL INCIDENT. THE DEALER SENT A MECHANIC TO MY RESIDENCE. THEY STARTED THE MACHINE TWO DIFFERENT TIMES IN NEUTRAL AND THE THROTTLE REVVED UP AGAIN. I BELIEVE THIS IS A SAFETY CONCERN FOR WHOEVER PURCHASES A POLARIS RZR 800. I HAVE READ SEVERAL ARTICLES ONLINE FROM CONSUMERS WHO HAVE HAD THE SAME PROBLEM. THANKFULLY MY SON ONLY SUFFERED A BUMP ON HIS CHIN FROM THE STEERING WHEEL AS A RESULT OF SMASHING INTO THE CAR. I BELIEVE THERE NEEDS TO BE  RECALL ON THIS MACHINE TO ENSURE THAT THIS DOES NOT CONTINUE TO HAPPEN. I CAN ONLY IMAGINE WHAT COULD HAPPEN IF SOMEONE WAS ON A STEEP MOUNTAIN TRAIL AND THE THROTTLE SENT SOMEONE OVER THE EDGE. SOMEONE IS GOING TO GET SERIOUSLY INJURED OR KILLED IF THIS PROBLEM IS NOT ADDRESSED. *TR",
        "vin": "4XAVH76A0AD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/24/2010",
        "dateOfIncident": "10/09/2009",
        "fire": false,
        "manufacturer": "POLARIS INDUSTRIES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368731,
        "products": [
            {
                "manufacturer": "POLARIS INDUSTRIES, INC.",
                "productMake": "POLARIS",
                "productModel": "RANGER 800",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS A FOUR WHEEL DRIVE, MID-ENGINE, OFF-HIGHWAY VEHICLE. THE SEAT BASE IS CONNECTED TO THE FRAME BY WAY OF TWO PLASTIC, MUSHROOM SHAPED, PRONGS ALONG THE FRONT EDGE OF THE SEAT AND TWO TABS ALONG THE REAR EDGE OF THE SEAT. THERE IS ONE PRONG AND ONE TAB ON BOTH THE LEFT AND RIGHT SIDES OF THE SEAT. THE TABS FIT INTO SLOTS ON THE FRAME AT THE REAR, AND THE PRONGS ARE PUSHED DOWN INTO HOLES WITH RETAINING CLAMPS, THEREBY SECURING THE SEAT TO THE FRAME.     IN OLDER MODELS, THE PRONGS WERE METAL AND AFFIXED TO THE SEAT BASE. IN THIS MODEL, THE PRONGS ARE PART OF THE MOLDED PLASTIC  SEAT BASE. THE ENGINE IS LOCATED UNDER THE SEAT. THE HEAT PRODUCED BY THE ENGINE SOFTENED THE PLASTIC PRONGS, ALLOWING THEM TO FLEX, CRACK, AND BREAK OFF OF THE SEAT BASE. THIS ALLOWS THE SEAT BASE TO COME LOOSE FROM THE FRAME AND SLIDE FORWARD. THE REAR TABS POP OUT OF THE SLOTS IN THE FRAME, RENDERING THE SEAT BASE UNSECURED FROM THE FRAME. THE SEAT IS UNSTABLE AND INTERFERES WITH THE DRIVER'S ABILITY TO CONTROL THE VEHICLE. WHEN THE SEAT SLIDES FORWARD, IT OPENS A  GAP BETWEEN THE SEAT AND THE ENGINE COMPARTMENT, EXPOSING THE DRIVER AND/OR PASSENGER DIRECTLY TO THE ENGINE HEAT.    THIS HAS HAPPENED ON TWO SEPARATE OCCASIONS. THE FIRST TIME, I WAS NEGOTIATING A STEEP, DOWNHILL TRAIL IN VERY ROUGH TERRAIN. ALL OF MY WEIGHT, AND THE WEIGHT OF MY PASSENGER WERE ON THE FRONT EDGE OF THE SEAT. WHEN THE SEAT BROKE LOOSE AND BECAME UNSTABLE, I HAD DIFFICULTY CONTROLLING THE VEHICLE DUE TO MY HAVING TO USE MY LEGS TO KEEP MY BODY FROM SLIDING FORWARD.  THE FIRST DEFECTIVE SEAT WAS REPLACED UNDER WARRANTY. THE REPLACEMENT SEAT ALSO FAILED IN A SIMILAR MANNER, WHILE AGAIN COMING DOWN A STEEP TRAIL ON FEBRUARY 12, 2010 AT 1433 MILES. THE MANUFACTURER SUBSEQUENTLY DENIED THE SECOND WARRANTY CLAIM.",
        "vin": "4XATH76A8A4"
    }
]