[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850932,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR HEADLINER MATERIAL BECOMES UNGLUED AND DROOPS DOWN CREATING A DISTRACTION AND OBSTRUCTING REARWARD VISION THROUGH REAR VIEW MIRROR.",
        "vin": "WP0AA2A85AU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2015",
        "dateOfIncident": "12/05/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808627,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT HIGHWAY SPEEDS (55-60 MPH), ATTEMPTED TO DOWNSHIFT DUE TO TRAFFIC AND THE MANUAL GEAR SHIFT LEVER DID NOT RESPOND. IT WAS COMPLETELY LIMP AND SEEMED DISCONNECTED FROM THE SHIFTING ACTION. LUCKILY I WAS ABLE TO NEGOTIATE THE VEHICLE THROUGH TRAFFIC, TO AN OFF RAMP AND INTO A SAFE PARKING SPOT. HAD THE VEHICLE TOWED TO THE NEAREST DEALERSHIP AND WAS INFORMED THAT THE SHIFTER CABLE HAD BROKEN. AFTER SOME RESEARCH I NOTICED THAT THIS IS A COMMON PROBLEM FOR THE PORSCHE CAYMAN, SO I'M REPORTING THIS AS IT POSES A SIGNIFICANT SAFETY HAZARD FOR DRIVERS OF THE VEHICLE AND THOSE AROUND THEM WHEN THIS PROBLEM OCCURS.  OBVIOUSLY NOT BEING ABLE TO SHIFT INTO DIFFERENT GEARS WHILE IN ANY SORT OF TRAFFIC CREATES A RISK OF INJURY OR DEATH. THE MANUFACTURER IS AWARE OF THE PROBLEM AND HAS APPARENTLY DONE NOTHING TO CORRECT IT.  THE REPAIR COSTS ARE ALSO STEEP -- IT COST ME $1,325 FOR THE CABLE TO BE REPLACED, AS WELL AS OVER $100 FOR THE TOW TO THE DEALERSHIP.  MY VEHICLE HAS 65,000 MILES ON IT, BUT I HAVE READ OF INCIDENTS WHERE THIS OCCURRED ON VEHICLES WITH FEW MILES AND SOME REPORT IT HAS BROKEN REPEATEDLY.  SO I WOULD LIKE TO REQUEST THAT NHTSA INVESTIGATE PORSCHE AND URGE THE COMPANY TO ADDRESS THE SAFETY ISSUE WITH A RECALL AND/OR REIMBURSEMENT FOR REPAIR COSTS.  THANK YOU.  *TR",
        "vin": "WP0AA2A81AU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704593,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ACCELERATING ONTO THE FREEWAY WHEN THE GEARSHIFT CABLE TO THE TRANSMISSION BROKE CAUSING ME TO LOSE CONTROL OF THE CAR BECAUSE I HAD NO CONTROL OF WHAT GEAR I WAS IN AND I WAS UNABLE TO SHIFT GEARS. AS IT TURNED OUT, I WAS STUCK IN FIRST GEAR AND I WAS ABLE TO GET OFF THE FREEWAY, LUCKILY.  I TOOK THE CAR TO MY MECHANIC WHO CONFIRMED THAT THE GEARSHIFT CABLE TO THE TRANSMISSION HAD BROKEN. HE SAID THAT THIS WAS COMMON FOR MY CAR.  IT COST ME $840 TO REPAIR. SEARCHING THE INTERNET, THIS APPEARED TO A COMMON PROBLEM WITH THIS MODEL OF PORSCHE.  I HAVE OWNED MANY CARS WITH MANUAL TRANSMISSIONS AND HAVE NEVER HAD THE GEARSHIFT CABLE BREAK. THIS IS A SAFETY ISSUE AND COULD HAVE CAUSED SERIOUS INJURY IF I HAD LOST CONTROL OF MY CAR  WHILE TRAVELING ON MOUNTAINOUS ROADS OR TRYING TO PASS ANOTHER CAR AT FREEWAY SPEEDS.  *TR",
        "vin": "WP0AB2A80AU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694285,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTER CABLE BROKE AS I WAS ENTERING THE FREEWAY LEAVING ME WITHOUT CONTROL OF THE TRANSMISSION.  AS IT WAS, I WAS STUCK IN FIRST GEAR, BUT I COULD HAVE BEEN STUCK OUT OF GEAR, WHICH WOULD HAVE BEEN MORE DANGEROUS. THIS APPEARS TO BE A COMMON PROBLEM AND KNOW DEFECT TO PORSCHE MECHANICS AND MANY OCCURRENCES ARE POSTED ON THE INTERNET.  THIS IS A SAFETY ISSUE, BESIDES BEING A MANUFACTURING DEFECT.  *TR",
        "vin": "WP0AB2A80AU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691091,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 PORSCHE CAYMAN. THE CONTACT STATED THAT WHILE DRIVING AT 25 MPH, THE CONTACT LOST CONTROL OF THE VEHICLE. THE VEHICLE WAS STUCK ON FIRST GEAR. THE VEHICLE WAS ABLE TO BE DRIVEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE SHIFT CABLE FRACTURED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 54,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    }
]