[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF POWER STEERING ASSIST WHILE DRIVING VEHICLE. FOUND THAT A RECALL FOR THIS FAILURE WAS IN PLACE. TAKEN TO THE DEALERSHIP AND BECAUSE THE PART (POWER STEERING MOTOR) HAD BEEN REPLACED PREVIOUSLY THEY SAID IT WOULD NOT BE COVERED. CALLED THE GM LINE AND ONCE MORE THEY WOULDN'T GIVE AN ANSWER EVEN AFTER TALKING TO THE SUPERVISOR. VIN DOES NOT SHOW UP IN THE RECALL LOOKUP, BUT THE VIN NUMBER FALLS WITHIN THE RANGE OF COVERED VEHICLES ON THE OFFICIAL BULLETIN. IN MY OPINION, REPLACING A DEFECTIVE PART WITH ANOTHER DEFECTIVE PART IS NOT HONORING THEIR RECALL.    2010 PONTIAC G5    BULLETIN NO.: 10023  RECALL NO.: 10V073000  RECALL DATE.: 03/03/2010  VIN: [XXX]    DATE OF FAILURE: 08/01/2019    PART: POWER STEERING ASSIST MOTOR  NEWEST PART #: 19368293  THEY HAVE CHANGED THE PART # NUMEROUS TIMES. (WHICH I BELIEVE INDICATES A RECURRING ISSUE)    WHEN CALLING THE GM LINE THEY COULD NOT GIVE A COMPLETE ANSWER. TALKED WITH THE SUPERVISOR, WHO SAID IT HAD TO BE DISCUSSED WITH THE DEALERSHIP'S SERVICE ADVISOR. I REQUESTED WHAT THE ANSWER WOULD BE IF IT WAS CONFIRMED THAT IT WAS THE SAME ISSUE THAT WAS SPECIFIED ON THE RECALL AND STILL THEY REFUSED TO GIVE ME ANY CLEAR INFORMATION.    BASICALLY, IT CAME DOWN TO EITHER SPEND THE $205 FOR THE PART AND REPLACING MYSELF, OR GAMBLING ANOTHER $200 TO TAKE IT IN AND HAVE IT POSSIBLY COVERED. ($400 QUOTED FOR PARTS AND LABOR.) I CHOSE TO REPLACE MYSELF.    THEIR RECORDS SHOW THAT THIS CAR HAS HAD THE RECALL REPAIR PERFORMED INSTALLING THE NEWER \"FIXED\" PART. BUT HAVING THE EXACT SAME DEFECT HAPPEN STILL VERY EARLY IN THE PARTS LIFETIME MAKES ME QUESTION HOW MANY CARS THEY CLAIM TO HAVE FIXED THAT STILL HAVE THIS FAILURE HAZARD. THERE IS NO WARNING, POWER STEERING ASSIST JUST SUDDENLY STOPS.    THANKS, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G2AD5F56A7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "02/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G5",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 PONTIAC G5. WHEN THE VEHICLE WAS STARTED, THE POWER STEERING OFF WARNING INDICATOR ILLUMINATED AND THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT POWERED THE VEHICLE OFF AND BACK ON AND IT RESUMED NORMAL OPERATION. THE FAILURE RECURRED ON ANOTHER OCCASION. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 61,000.",
        "vin": "1G2ZA5E0XA4"
    }
]