[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2013",
        "dateOfIncident": "06/14/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520819,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "911 GT3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE 8 COOLANT FITTINGS, PRONE TO EPOXY FAILURES, SECURED TO HOUSINGS BY WELDING. COST FOR WELDING WAS $275.  *TR",
        "vin": "WP0AC2A90AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2013",
        "dateOfIncident": "04/19/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509031,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "911 GT3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LINES / FITTINGS WELDED/ PINNED - MK2 MEZGER ENGINE HAS A FAULTY DESIGN OF COOLANT HOSES/LINES.    UPON RESEARCH ONLINE, I AM NOT THE ONLY PERSON AFFECTED BUT ALL TURBO/GT3/RS/GT2 CARS FROM 2004-CURRENT  I HAVE ALSO COME ACROSS CARS WITH LESS THAN 10K MILES THAT HAD THIS PROBLEM SO MY PROBLEM IS NOT ISOLATED.    THERE HAS BEEN INCIDENCE ON HIGHWAY WHERE THESE HOSES JUST BURST OR LOSES FITTING AND SPILLS COOLANT CONTENTS ALL OVER THE ROAD.  THIS ALSO CAUSE CAR TO SPIN OUT SINCE LOST IN PRESSURE AND TRACTION.  VERY DANGEROUS.    PORSCHE DEALER WILL ONLY USE DIFFERENT GLUE TO FIT THEM. PROPER WAY IS NOT USE RUBBER HOSE BUT TO USE METAL PIPES AND WELD THEM SO THESE COOLANT LINES DO NOT EVER FALL OUT.  THIS COULD HAVE CAUSED CATASTROPHIC INJURY IN PUBLIC ROAD. PORSCHE DENIES ANY FAULTY OR SUB-STANDARD MATERIAL THAT WAS USED IN A CRITICAL COMPONENT OF HIGH PERFORMANCE ENGINE.    IN ORDER FOR ME TO FIX THIS, I HAVE TO PAY MY PORSCHE MECHANIC TO REMOVE THE ENGINE, FIND THE COOLANT LINES, REPLACE ALL OF THE HOSES WITH METAL PIPE LINES, WELD THEM, THEN PUT IT BACK IN THE ENGINE BAY.  I FEEL THAT I SHOULD HAVE  TO PAY FOR THIS OUT OF POCKET FOR SAFETY OF MYSELF OR OTHERS IN PUBLIC ROAD.    PORSCHE SUGGESTED THAT THEY WILL USE THE SAME RUBBER HOSES WITH JUST A BETTER ADHESIVE GLUE TO HOLD THEM.  THEY WILL FAIL WITHIN TIME.  THIS IS A TEMPORARY FIX THEY ARE OFFERING.  IT IS FOR SAFETY OF THE MOTORIST.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/30/2012",
        "dateOfIncident": "05/25/2012",
        "fire": true,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460064,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "911 GT3",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR CENTERLOCK HUB FAILED/SHEARED OFF RESULTING IN HIGH SPEED EXIT FROM ROAD SURFACE AND 800' SLIDE.  WHEEL AND TIRE LEFT VEHICLE AND TRAVELED APPROXIMATELY 1500' CROSSING ACTIVE ROAD.  CENTERLOCK NUT WAS FOUND  ABOUT 700' FROM VEHICLE.  ISSUE SEEMS TO BE FAILURE OF THE CENTERLOCK HUB CAN RESULT IN LOSS OF WHEEL AND VEHICLE CRASH.    BUTTONWILLOW RACEWAY PARK, CA  UPON EXITING BUTTONWILLOW TURN 12 (CW DIRECTION), LOUD POP HEARD FROM RIGHT REAR OF CAR (WITNESS DESCRIBE VERY LOUD POP/BANG \"LIKE HAND GRENADE GOING OFF\"), VEHICLE IMMEDIATELY ROTATED COUNTER CLOCKWISE AND EXITED ROAD SURFACE, SLIDING SIDEWAYS (RIGHT SIDE IN DIRECTION OF SLIDE), RIGHT SIDE DOWN, LEFT SIDE UP (BOTH OCCUPANTS NOTED THEY FELT THE VEHICLE WAS GOING TO ROLL), PARALLEL TO THE ROAD SURFACE.  AFTER SLIDING POSSIBLY 600 FEET, CAR HIT INTERSECTING ROAD (ABOUT 6 INCH RISE IN SURFACE) BECOMING AIRBORNE FOR POSSIBLY 20 FEET PASSING OVER THE ROAD AND PIVOTING CLOCKWISE.  UPON LANDING, CAR SLID PARALLEL WITH ORIGINAL ROAD SURFACE, ALIGNED WITH ROAD COMING TO REST AFTER ABOUT 800 FEET AFTER THE HUB FAILED.      CAR DID NOT ROLL, THE SLIDE SIDEWAYS AND LIKELY THE IMPACT WITH THE CROSS ROAD DID SIGNIFICANT DAMAGE TO THE CAR.    DETAILS ON VEHICLE:  - WHEEL WAS INSTALLED 2 DAYS PRIOR TO INCIDENT AFTER CHANGING TO NEW DOT TIRES. PORSCHE CENTERLOCK MOUNTING AND TORQUING PROCEDURE WERE FOLLOWED, TORQUING TO 444 FT LB.  - TORQUE WRENCH SETTING WAS VERIFIED AFTER INCIDENT AND FOUND TO BE SET PROPERLY TO 444 FT LB.  - DATA SHOWS VEHICLE WAS TRAVELING ABOUT 100 MPH, WITH THROTTLE ON AND LOADED WITH 1.1 - 1.2 LATERAL GS (TURNING LEFT, LOADED ON RIGHT SIDE), BRAKE AND STEERING INFORMATION IS NOT AVAILABLE. WHEN HUB FAILED.  *TR",
        "vin": "WP0AC2A99AS"
    }
]