[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063403,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA S",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMSHAFT CONTROLLER RECALL.  ON 9/8/2015, MY VEHICLE ABRUPTLY STOPPED WHILE I WAS DRIVING ON THE HIGHWAY. I WAS TRAVELING ABOUT 60MPH AND SUDDENLY HEARD A LOUD NOISE AND THE CAR WENT COMPLETELY DARK. ALL OF THE ELECTRICAL COMPONENTS WERE DEAD. I COASTED OVER TO THE EMERGENCY LANE AND WHEN I TRIED TO RESTART THE VEHICLE NOTHING HAPPENED. AFTER HAVING THE VEHICLE TOWED TO THE PORSHE DEALER, I WAS TOLD THAT THE \"CAMSHAFT\" BROKE OFF IN THE ENGINE AND THE REPAIR WOULD COST OVER $5,000.  AS I HAD OWNED THE VEHICLE FOR SEVERAL YEARS AND IT WAS THOROUGHLY MAINTAINED AT THE DEALER, I INQUIRED AS TO HOW SUCH A MAJOR REPAIR COULD HAPPEN. THE CAR WAS ONLY 3/4 YEARS OLD AT THIS TIME.  I WAS TOLD THAT THERE WAS NO REASON AND THAT SOMETIMES \"THINGS JUST BREAK\".  MY PORSCHE WAS OUT OF WARRANTY SO I WAS FORCED TO PAY FOR THE REPAIR OUT OF POCKET.  WHEN I CONTACTED THE SERVICE MANAGER TO COMPLAIN THAT THE ISSUE MUST HAVE BEEN A MANUFACTURER'S DEFECT, THEY AGREED BUT WOULD NOT COVER THE COST OF THE REPAIR. I COMPLAINED DIRECTLY TO PORSCHE HEADQUARTERS AND RECEIVED $500 OFF OF THE COST OF THE REPAIR.  MIND YOU, I STILL HAD TO PAY OVER $5,000 TO CORRECT THE ISSUE. ABOUT A YEAR OR SO LATER, I RECEIVED A NOTICE IN THE MAIL THAT THERE WAS A RECALL PENDING ON THE EXACT ISSUE THAT I PAID FOR.  I HAVE CONTACTED PORSCHE HEADQUARTERS SEVERAL TIMES TO OBTAIN REIMBURSEMENT FOR THE REPAIR, HOWEVER I KEEP BEING TOLD THAT I HAVE TO WAIT UNTIL THEY SEND OUT AN \"OFFICIAL NOTICE\" OF THE RECALL AND ONLY THEN, WILL I BE ABLE TO SUBMIT FORMS TO RECEIVE REIMBURSEMENT.  I'M AT A LOSS AS TO WHY I, AS A CUSTOMER, HAVE TO JUMP THROUGH HOOPS TO GET MY MONEY.  ESPECIALLY SINCE THE REPAIR WAS DONE AT AN AUTHORIZED PORSCHE DEALER & THEY HAVE ALL OF THE DOCUMENTATION IN THEY SYSTEM. I ALSO HAVE A COPY OF THE INVOICE AND CAN PROVIDE IF NECESSARY.",
        "vin": "WP0AB2A76AL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012449,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA S",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL PUMP, HIGH PRESSURE SENSOR, AND IN TANK FUEL PUMP ALL HAD A FAILURE. ALL NEEDED TO BE REPLACED TO THE TUNE OF $2500. READ THERE IS A RECALL ON MOST OF THESE PUMPS BUT NOT THIS YEAR MODEL, WHICH USES THE EXACT SAME PUMP THAT IS BEING RECALLED. THERE HAVE BEEN HUNDREDS IF NOT IN THE THOUSANDS OF THESE HAVING TO BE REPLACED DUE TO FAILURE WHICH CAN CAUSE A SAFETY HAZARD AS THE CAR WILL CUT OFF UNEXPECTEDLY. THIS SHOULD BE A RECALL BY PORSCHE NORTH AMERICA THAT COVERS ALL VEHICLES WITH THESE FUEL PUMPS.",
        "vin": "WP0AB2A72AL"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "02/24/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967672,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA S",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY FEBRUARY 24, 2017 A SMALL FAMILY OF 4 WAS TRAVELLING ALONG INTERSTATE 5 (SOUTH) IN NORTHERN CALIFORNIA AT 8:03PM CRUISING AT 65 MPH IN THE FAR LEFT PASSING LANE WHEN THE DRIVER FELT A HEAVY VIBRATION AND BEGAN TO LOSE COMPLETE POWER OF THE VEHICLE INCLUDING ALL STEERING, ENGINE, AND BRAKES.  THE DASHBOARD DISPLAYED:  \"REDUCED ENGINE POWER\", \"CHECK ENGINE OIL PRESSURE\" , 'PSM FAILURE', 'START/STOP DEACTIVATION' FOLLOWED BY 'CHECK ENGINE\"-WHICH BEGAN BLINKING LEADING TO COMPLETE SHUTDOWN OF ENGINE WHILE TRAVELING AT 45-50 MPH. WITHOUT ANY CONTROL OF THE VEHICLE  IN THE SAME OCCURRENCE A LOUD SUCTION NOISE WAS COMING FROM THE ENGINE COMPARTMENT FOLLOWED BY A LOUD DEAFENING  NOISE.   UPON REVIEW OF THE MANUFACTURE AND CERTIFIED TECHNICIANS THE CAR WAS DIAGNOSED AND IT WAS DETERMINED THE CRANK SHAFT BOLT PULLEY WAS SHAKEN OFF THE CAR CAUSING A COMPLETE CATASTROPHIC ENGINE FAILURE RESULTING IN A COMPLETE ENGINE REBUILD.  THE PROBLEM LIES IN THE ALUMINUM CAMSHAFT ADJUSTER BOLTS WHICH HAVE A TENDENCY TO SHEER OFF, WHICH PREVENT THE CAMSHAFTS FROM RUNNING. IF THIS OCCURS IN THE CAMSHAFT THAT OPERATES THE VACUUM PUMP, THE POWER BRAKING WILL ALSO FAIL, WHICH WILL RESULT IN AN EXTREMELY DANGEROUS SITUATION ESPECIALLY IF THE DRIVER DOES NOT HAVE THE STRENGTH TO BRAKE THE CAR WITHOUT THE VACUUM POWDERED BRAKES. THE BOLTS THEMSELVES MAY ALSO DROP INTO THE ENGINE AND CAUSE THE ENGINE TO FAIL.   THIS LACK OF ATTENTION WILL EVENTUALLY LEAD TO FATALITIES IF THIS ISSUE IS NOT RESOLVED!!! PLEASE HELP!!!!",
        "vin": "WP0AB2A7XAL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "10/27/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923957,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA S",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE LIGHT CAME ON WHILE I WAS DRIVING SO I TOOK IT TO A MECHANIC AND HE TELLS ME IT'S THE CAMSHAFT ADJUSTER IS CAUSING THE PROBLEM. THIS SEEMS TO BE AN OCCURRENCE ON 2010-11 MODELS AND IS EMISSIONS RELATED BUT CAN CAUSE ENGINE STALL.  *TR",
        "vin": "WP0AB2A78AL"
    }
]