[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349490,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA TURBO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 PORSCHE PANAMERA. CONSUMER WRITES SEEKING REIMBURSEMENT FOR REPAIRS RELATED TO PCNA CAMSHAFT CONTROLLER SAFETY RECALL. *LD    THE CONSUMER STATED THE VEHICLE STALLED WHILE BEING DRIVEN.  THE VEHICLE WAS REPAIRED.*JS",
        "vin": "WP0AC2A7XAL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995234,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA TURBO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 PORSCHE PANAMERA TURBO. WHILE DRIVING 70 MPH AND ATTEMPTING TO PASS A VEHICLE, THE CHECK ENGINE AND ALL WHEEL DRIVE SYSTEM INDICATORS ILLUMINATED. THE REAR OF THE VEHICLE BEGAN TO SWERVE INDEPENDENTLY. THE CONTACT PULLED OVER AND WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO OKEMOS AUTO COLLECTION (2186 JOLLY RD, OKEMOS, MI 48864) WHERE IT WAS DIAGNOSED THAT THE ENGINE EXPERIENCED A LOWER END FAILURE, AS EVIDENCED BY THE ENGINE OIL AND COOLANT MIXING. THE ENGINE NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE CONTACT SHOULD PAY FOR THE DEALER TO DISASSEMBLE THE ENGINE TO DETERMINE IF IT WAS AN INTERNAL FAILURE, AND PORSCHE WOULD ASSIST, IF NECESSARY. THE DEALER ALSO STATED THAT A CAM SHAFT REPAIR WAS PREVIOUSLY PERFORMED ON THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V368000 (ENGINE). THE APPROXIMATE FAILURE MILEAGE WAS 36,000.  ...UPDATED 08/02/17 *BF    *CN",
        "vin": "WP0AC2A74AL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "05/09/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986397,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "PANAMERA TURBO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 PORSCHE PANAMERA TURBO (HAS ONLY 68,700 MILES ON IT) WAS ACCELERATING FROM A RED LIGHT ON A BUSY CITY STREET GOING STRAIGHT. AS I APPROACHED 50 MPH THE CHECK ENGINE LIGHT CAME ON WITH A MESSAGE THAT SAID \"4WD SYSTEM FAILURE AND AUTO STOP/START FUNCTION DISABLED\". SO, I HAD IT TOWED TO THE PORSCHE DEALER FOR SERVICE. THEY FOUND THE CAM ADJUSTER BOLTS ON ONE BANK HAD SHEARED OFF AND THE CAM ADJUSTER ON THE OTHER BANK HAD LOOSENED UP. THEN A SIMPLE INTERNET WEB SEARCH REVEALED THAT THIS IS A PROBLEM WELL KNOWN WORLD WIDE BY PORSCHE BUT ONLY CHINA FORCED A RECALL DUE TO SAFETY. SO THERE'S ALREADY A PRECEDENT FOR A RECALL ON THIS ISSUE. DEFECTIVE OR SUBSTANDARD CAM ADJUSTER BOLTS DESTROYS THE UNIT ITSELF THEN FALL OFF INTO THE ENGINE AND DESTROY THE ENGINE. YOU CAN'T JUST REPLACE THE BOLTS. PORSCHE DOES NOT SALE THE BOLTS SEPERATE BECAUSE THE BOLTS ARE APART OF THE UNIT ITSELF. THE BOLTS ARE MADE OF ALUMINUM WHICH IS BOTH A MAJOR DESIGN FLAW AND THE CAUSE OF THE FAILURE. THEY LATER UPDATED THE UNIT WITH TITANIUM BOLTS. HOWEVER, THIS IS ONLY A RED HERRING AND DOES NOTHING TO ADDRESS THE 1000'S OF PORSCHE OWNERS IN AMERICA THAT'S ALREADY SUFFERED AN ENGINE FAILURE AND SHOULD BE REIMBURSED AND IT DOES NOTHING TO PREVENT CATASTROPHE FOR THOSE WHOSE ENGINE WILL EVENTUALLY FAIL. THIS BANDAID ALSO DOES NOTHING TO ADDRESS ALL ENGINES MADE BEFORE THE 2013 UPDATE THAT'LL LIKELY SELF DESTRUCT AND LEAD TO COMPLETE ENGINE FAILURE WHICH CAN LOCK-UP THE MOTOR AND CAUSE SERIOUS INJURY OR DEATH AT HIGHWAY SPEEDS OR IN TRAFFIC. THE US GOVERNMENT SHOULD FORCE PORSCHE TO RECALL THESE ENGINES JUST LIKE CHINA DID AND HOLD PORSCHE ACCOUNTABLE TO REPLACE ALL THE DEFECTIVE CAM ADJUSTERS AND THE ONES THAT HAS ALREADY FAILED SHOULD HAVE ENGINE REPLACED IF IT'S SO BAD THEY CAN'T EVEN FIND THE BOLTS. PORSCHE SHOULD BE ASHAMED. IF RECALLED PORSCHE COULD OWE SOME PEOPLE BETWEEN $4K TO $45K.",
        "vin": "WP0AC2A75AL"
    }
]