[
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443944,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the 3rd time this happened to me.  The first time I was driving around 55 and the truck started to shake so bad I could not actually hold onto the steering wheel, and I made it to the side of the road.  I thought was a flat tire and I pulled over to find nothing wrong. The second was bad as it shook so violently, I was unable to make it to the side of the road, so I hit the brakes in the middle of traffic to stop. This 3rd time I happen to be traveling 65 mph on the interstate in PA and hit a small bump and all of the sudden the truck felt like it was bouncing off of the road.  I hit the brakes to slow down and drove to the side and into a field.   I purchased tie rods and actually the entire front suspension.  This was the worst shaking I have ever felt in 45 years of driving.  This is going to get me killed when this happens on the road.  Please help.   [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3D7TT2CT7AG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437231,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel pump failed with no warning. Best One of Indy confirmed and replaced. It was parked and would not start.",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415977,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT THE EXHAUST SYSTEM REGENERATION REQUIRED NOW WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 43,000.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "01/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408550,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A VE5 LATE LIFE EMISSION PERFORMANCE DEGRADATION RECALL IN JANUARY 2021.  I HAD THE RECALL PERFORMED ON 1.27/2021 AT RAZZARI DODGE, MERCED.  THEY INSTALLED A NEW CAT CONVERTER AND EXHAUST MANIFOLD.  WHEN I GOT MY TRUCK BACK, I HAD AN CEL ERROR CODE P2271 O2 SENSOR.  I HAD TO PAY $707.74 AND $978.98 TO GET THE TRUCK RUNNING.  I HAD NO PREVIOUS CEL.  I THINK THEY BROKE THE WIRING HARNESS OR O2 SENSORS WHEN THEY PERFORMED THE RECALL.  .  I THINK THE VE5 RECALL REPAIR, SHOULD MAKE THE ENTIRE EMISSIONS SYSTEM FUNCTION, INCLUDING THE CONTROL ELECTRONICS.",
        "vin": "3D7UT2HL8AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397778,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK IT TO THE DODGE DEALER FOR A RECALL NOTICE I RECEIVED, THE RECALL WAS FOR THE CATALYTIC CONVERTER AND THE EXHAUST MANIFOLD TO BE REPLACED. THE WORK WAS COMPLETED, I TOOK THE TRUCK HOME AND ASSUMED THINGS WERE FINE. IN JANUARY OF THIS YEAR I WENT UNDER THE TRUCK TO SEE ABOUT A OIL LEAK I WAS HAVING A PROBLEM WITH, I NOTICED THE CATALYTIC CONVERTER WAS DIRTY LOOKING AND HAD SCRATCHES ON IT. IT HAD A BROWNISH KIND OF LIGHT FILM ON IT. I DID NOT LOOK LIKE A NEW ONE. I TOOK IT TO ANOTHER REPAIR SHOP FOR THEIR OPINION. THEY COULDN'T BE SURE BUT THEY SAID IT LOOKS LIKE AN OLD ONE ALSO, THEY INSPECTED THE EXHAUST MANIFOLD AND TOLD ME IT HAS RUST STAINS ON IT AND DOES NOT LOOK LIKE A NEW ONE. I AM IN NEED OF SOMEONE TO REFER ME TO AN EXPERT SO WE CAN DETERMINE IF WEATHER OR NOT THE DEALER ACTUALLY REPLACED THE THE PARTS OR NOT. CAN YOU HELP PLEASE.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385056,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S A RANDOM OCCURRENCE. WHILE I'M STARTING IT, I HAVE TO RESTOP WHEN I'M DRIVING NO WARNING, IT'S A MANUAL TRANSMISSION. THAT ADDS A HUGE DANGER WHEN YOUR TRUCK DIES IN MOTION IT'S A BIG TRUCK IT'S A WORK TRUCK WHICH MAKES IT EVEN MORE HORRIFYING.!! PLEASE TAKE THIS SERIOUSLY THIS IS A HUGE DANGER I CAN'T STRESS HOW IMPORTANT THIS IS AND I'M SURE ALL THE ALL OF THEM ARE",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT BEGAN FLASHING OFF AND ON INTERMITTENTLY WHILE DRIVING. AFTER A FEW WEEKS, THE LIGHT JUST STAYED ON AND REMAINS ON.  WHEN MY TRUCK WAS IN FOR SERVICE, I WAS INFORMED THE OCR MODULE HAD FAILED AND WAS QUOTED APPROXIMATELY $750 TO REPAIR. SEEMS TO ME THIS IS A NON-SERVICEABLE SAFETY COMPONENT THAT HAS FAILED. I HOPE THIS SYSTEM FAILURE IS A RECALL ISSUE.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 DODGE RAM 2500 ST. THE VEHICLE IGNITION WON'T ALLOW THE VEHICLE TO START SOME TIMES. ALSO WHEN DRIVING DOWN THE ROAD, THE TRUCK CUTS OFF AND I HAVE TO RESTART IT IN THE MIDDLE OF TRAFFIC. IVE HAD TO ROLL TO THE SIE OF THE ROAD ON MUTIPLE OCCASSIONS UNTIL I CAN GET IT RESTARTED, LUCKILY I HAVENT HAD AN ACCIDENT YET. I GOOGLED THE ISSUE AND IT SEEMS TO BE A COMMON PROBLEM WITH THE WIN MODULE ON THE DODGE VEHICLES YET THERE HASNT BEEN A RECALL INITIATED. IT'S TURNING INTO A DAILY OCCURRACE WITH THIS.",
        "vin": "3D7TP2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11354897,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT POWER STEERING PUMP CAP DID NOT VENT PROPERLY AND AS THE CONTACT ATTEMPTED TO CHECK THE STEERING FLUID, NOT REALIZING THAT THE POWER STEERING FLUID WAS UNDER PRESSURE, THE FLUID EXPLODED AND BURNED THE CONTACT'S RIGHT HAND AND NECK. THE BURNS WERE SECOND DEGREE. THE CONTACT STATED THAT IF HE DID NOT HAVE SUNGLASSES ON, HE WOULD HAVE SUSTAINED MORE SEVERE INJURIES. THE CONTACT CALLED THE LA FONTAINE CHRYSLER DEALER, LOCATED IN SALINE, MICHIGAN AT: 248-887-4747 AND WAS TOLD THAT THE VIN WAS NOT PART OF NHTSA CAMPAIGN NUMBER: 10V616000 (STEERING). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 190,000.",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324674,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT WHILE DRIVING AT 50 MPH, THE VEHICLE RODE OVER A BUMP IN THE ROADWAY AND EXPERIENCED THE DEATH WOBBLE. THE VEHICLE WAS TAKEN TO SEVERAL INDEPENDENT MECHANICS DUE TO THE FAILURE TO BE DIAGNOSED AND REPAIRED. THE CONTACT STATED THAT THE STEERING TRACK BAR, THE STEERING COLUMN STABILIZER, INNER AND OUTER TIE RODS, STEERING DAMPENER, BALL JOINTS AND WHEEL BEARINGS WERE REPLACED HOWEVER, THE FAILURE RECURRED. A DEALER WAS NOT NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE EVENING OF MAY 1ST, 2020, I PULLED MY 2010 DODGE RAM 2500 TRX 4WD INTO MY SONS? DRIVEWAY AND DROPPED OFF MY GRANDDAUGHTER. I WENT TO BACK OUT OF THE DRIVEWAY TURNING MY WHEEL TO THE RIGHT AS I BACKED OUT I HEARD WHAT SOUNDED LIKE I RAN OVER A LARGE ROCK, AS I PULLED FORWARD I TURNED MY WHEEL TO THE LEFT AND PROCEEDED FORWARD ONLY TO HAVE THE TRUCK GO RIGHT BACK IN THE YARD WHERE I HAD JUST PULLED OUT. I REALIZED THAT THERE WAS AN ISSUE WITH THE STEERING. I CLIMBED UNDER THE TRUCK TO DISCOVER THAT THE TIE ROD HAD SHEARED OFF AT THE PITMAN ARM. THIS CAUSED A COMPLETE LOSS OF STEERING. I HAD A FRONT-END ALIGNMENT ABOUT 2 YEARS AGO WITH NO ISSUES. PRIOR TO THAT I HAD A RECALL ISSUE WITH THE DRAG LINK ABOUT 3 OR 4 YEARS AGO WITH NO OTHER KNOWN ISSUES. I DO NOT DRIVE THE TRUCK OFF ROAD JUST ON PAVED ROADS. THE PARTS ARE THE FACTORY SEALED TIE ROD WITH NO GREASE FITTING. I HAVE BEEN REPAIRING VEHICLES FOR OVER 40. I HAVE NEVER SEEN THIS TYPE OF FAILURE. THE NORMAL FAILURE MODE FOR THIS PART SHOULD HAVE BEEN LOTS OF SLACK IN THE JOINT FROM LOSS OF GREASE. THIS FAILURE MODE IS NOT ACCEPTABLE! IF I HAD BEEN TRAVELING AT HIGHWAY SPEEDS AND THIS PART HAD BROKEN I WOULD HAVE HAD TOTAL LOSS OF STEERING AND YOU KNOW AS WELL AS I DO WHEN YOU HIT YOUR BRAKES THE VEHICLE TENDS TO PULL TO THE RIGHT DUE TO THE SLOPE OF THE ROAD WHICH IS DESIGNED FOR WATER RUNOFF. THIS COULD HAVE RESULTED IN A CATASTROPHIC CRASH RESULTING IN SERIOUS INJURY OR DEATH. THIS IS SOMETHING THAT NEEDS TO BE ADDRESS IMMEDIATELY BEFORE SOMEONE DIES!  *TR",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321430,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONSTANTLY GETTING EXHAUST FUMES INTO CAB OF TRUCK.",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "09/16/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11277284,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 RAM 2500. WHILE DRIVING APPROXIMATELY 60 MPH, SMOKE SUDDENLY APPEARED UNDER THE HOOD. AFTER STOPPING THE VEHICLE, THE CONTACT NOTICED FLAMES COMING FROM THE ENGINE COMPARTMENT THROUGH THE WHEEL WELL OF THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. THE VEHICLE WAS DESTROYED AND TOWED FROM THE SCENE. A FIRE REPORT WAS FILED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 110,000.*DT  *TR    CONSUMER TOOK THE VEHICLE TO AUTO ONE (GRAND ISLAND, NE, 308-382-1091) FOR REPAIRS. THE MANUFACTURER DID NOT PROVIDE ASSISTANCE OR A REASON FOR THE FAILURE. *DL",
        "vin": "3D7TT2CT8AG"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT THE VEHICLE STALLED A COUPLE OF TIMES WHILE HER FATHER WAS DRIVING. THE VEHICLE STALLED AND SHUT DOWN WITHOUT WARNING. WHEN THE DRIVER ATTEMPTED TO PULL INTO THE DRIVEWAY, THE VEHICLE SHUT DOWN. WHEN THE VEHICLE WAS RESTARTED, IT IMMEDIATELY SHUT DOWN. THE DRIVER HELD THE IGNITION KEY IN THE ON POSITION TO KEEP THE ENGINE RUNNING, BUT THE ENGINE SHUT OFF. THE CONTACT CALLED LITHIA CHRYSLER JEEP DODGE OF ROSEBURG AT 541-378-4945 (LOCATED AT 1600 NE AIRPORT RD, ROSEBURG, OR 97470), BUT WAS UNABLE TO REACH SOMEONE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256680,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. WHEN THE CONTACT TURNED THE KEY IN THE IGNITION, THE VEHICLE FAILED TO START. THE CONTACT ALSO STATED THAT THE KEY FELL OUT OF THE IGNITION WHILE DRIVING. IN ADDITION, WHILE DRIVING 45 MPH OVER A BUMP IN THE ROAD, THE VEHICLE SHUT OFF. THE CONTACT PARKED THE VEHICLE AND JERKED THE KEY IN THE IGNITION TO RESTART THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO CHARLIE'S DODGE CHRYSLER JEEP RAM (LOCATED AT 725 ILLINOIS AVE, MAUMEE, OH 43537, (419) 893-0241) WHERE IT WAS DIAGNOSED THAT THE WIRE IGNITION NODE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE PREVIOUS VEHICLE OWNER HAD THE VEHICLE REPAIRED PER NHTSA CAMPAIGN NUMBER: 10V200000 (ELECTRICAL SYSTEM) IN OCTOBER OF 2010. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 325,725.",
        "vin": "3D7UT2HL2AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT THE TRANSMISSION MALFUNCTIONED AND FRACTURED WHILE DRIVING 70 MPH. THE CONTACT WAS ABLE TO COAST THE VEHICLE TO THE SIDE OF THE HIGHWAY. THE VEHICLE WAS TOWED BACK TO THE CONTACT'S HOUSE. RON LEWIS CHRYSLER DODGE JEEP RAM WAYNESBURG (1625 E HIGH ST, WAYNESBURG, PA 15370) WAS CONTACTED AND INFORMED THE CONTACT TO BRING THE VEHICLE IN FOR AN INITIAL DIAGNOSTIC AT THE COST OF $121. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 30,055. THE VIN WAS INVALID.  *BF *JB",
        "vin": "3D7UP2C13AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230568,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRELESS IGNITION NODE RECEIVER FAILURE. FAILS TO START SOMETIMES AND THE ENGINE HAS DIED WHILE DRIVING.",
        "vin": "3D7TT2CT5AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169980,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE SHOULD BE A RECALL ON THE EXHAUST MANIFOLD BOLTS BREAKING. WHEN THIS HAPPENS THE FUMES COULD ENTER THE CABIN. DODGE KNOWS THIS IS A PROBLEM, THEY FIXED SOME OF THE VEHICLES.",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/31/2018",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE RECENTLY BOUGHT THIS TRUCK JUST ABOUT HAD IT 90 DAYS IN THE THREE MONTHS I'VE HAD THIS VEHICLE I'VE NOTICED BOTH HEAD LIGHTS WILL GO OUT AT RANDOM WHILE DRIVING, SITTING STILL OR TURNING. I'VE REPLACED THE BULBS 4 TIMES TO NO AVAIL, IT APPEARS AFTER SOME RESEARCH THAT THIS IS A COMMON PROBLEM WITH THESE 2500 TRUCKS. AFTER SPENDING HUNDREDS OF DOLLARS I AM COURIOUS AS TO WHY CHRYSLER HAS NOT ISSUED A RECALL. I FOR ONE FEEL THIS ISSUE IS A MAJOR SAFETY CONCERN",
        "vin": "3D7TT2CT7AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161209,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL TIPM FAILED AT 151000 MILES CAUSING FRONT TURNING SIGNALS TO MALFUNCTION. THE TIPM CONTROLS ALL ELECTRICAL COMPONENTS AND SENSORS THROUGHOUT THE ENTIRE VEHICLE INCLUDING FUEL PUMPS AND AIR BAGS. I WAS DRIVING MY VEHICLE ON A CITY STREET WHEN AN ALARM DISPLAYED ON THE INSTRUMENT PANEL NOTING A FRONT RIGHT TURN SIGNAL LAMP NEEDS REPLACEMENT. I REPLACED THE BULB PER REPLACEMENT BULB NUMBER SPECIFIED IN THE OWNERS MANUAL. ALSO, REPLACED THE TURN SIGNAL MULTI SWITCH WHICH BOTH ITEMS DID NOT RESOLVE THE ISSUE. MADE THE DECISION TO HAVE A CERTIFIED MECHANIC TO DIAGNOSE THE PROBLEM.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151904,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO GO ON A ELK HUNTING TRIP IN WYOMING AND MY MODE SELECTOR DOOR GOT STUCK BLOWING ONLY ON THE FLOOR. MY WINDOWS WOULDNT DEFROST BECAUSE THERE WAS NO HOT AIR WOULD COME OUT OF DEFROST VENTS. LUCKILY IM A DIESEL TECHNICIAN BY TRADE AND HAVE THE ABILITY TO REPAIR PROBLEM. I REPLACED MODE DOOR AND PROBLEM WAS RESOLVED. AFTER READING ONLINE I FOUND OUT THAT THIS IS A VERRY COMMON PROBLEM.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ISSUES A RECALL NOTIFICATION THAT MY YEAR MAKE AND MODEL COULD POP OUT OF PARK AND GO INTO NEUTRAL RESULTING IN THE VEHICLE NOT BEING SAFE.  I CONTACTED THE LOCAL DEALERSHIP AND THEY ASSURED ME THE PART WAS IN.  I WENT AND AFTER 2 HOURS WAS TOLD THEY DIDN'T HAVE THE PART.    THEY SAID THEY WOULD CALL ME WHEN THE PART WAS IN.  I NEVER HEARD BACK FROM THEM.  IF THIS IS A SAFETY ISSUE I WOULD THINK THIS MIGHT BE IMPORTANT?",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11110941,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. WHILE THE VEHICLE WAS STATIONARY WITH THE GEAR SHIFTER IN PARK, IT ROLLED BACKWARDS. THE CONTACT ATTEMPTED TO RE-ENTER THE VEHICLE BY GRIPPING THE STEERING WHEEL, BUT THE STEERING WHEEL INADVERTENTLY TURNED AND THE CONTACT FELL. THE CONTACT FRACTURED HIS LEFT COLLAR BONE, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. A DEALER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V821000 (POWER TRAIN). THE VEHICLE WAS TOWED AND NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000. *TT  *JS",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104932,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC IGNITION SHUTS OFF WHILE DRIVING. DURING TURNS OR SPEED BUMPS VEHICLE MAY LOOSE ALL POWER AND VEHICLE NEEDS TO BE RESTARTED.",
        "vin": "3C6UD5ML5CG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "12/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101602,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V821000 (POWER TRAIN).  THE CONTACT CALLED FRONTIER MOTOR COMPANY AT 405-262-6433 (1700 OK-66, EL-RENO, OK 73036) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/29/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099230,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE THE TRUCK ABOUT 20MILES HOME, SHUT THE TRUCK OFF AND UNLOADED BOTH OF MY SLEEPING CHILDREN. BY THE TIME I GOT BACK TO THE TRUCK TO UNLOAD OUR STUFF MY WHOLE GARAGE WAS FILLED WITH SMOKE. I QUICKLY BACKED THE TRUCK OUT OF THE GARAGE AND CALLED 911 BECAUSE IT WAS CONTINUING TO SMOKE HEAVILY. THE FIRE DEPARTMENT CAME POPPED THE HOOD AND PUT OUT THE FIRE. THEY UNHOOKED BOTH BATTERIES AND THEY COULD SHOW ME WHAT WAS ON FIRE THE ALTERNATOR AND WIRES SURROUNDING OUTSIDE OF IT. TOLD ME NOT TO DRIVE IT ANYWHERE UNTIL A MECHANIC CAN COME. IVE ASKED THE FIRE DEPARTMENT FOR THE REPORT BUT THEY HAVEN'T SENT IT OVER YET.",
        "vin": "3D7UT2HL6AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V821000 (POWER TRAIN) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED A RECALL NOTIFICATION IN DECEMBER OF 2017 BUT HAD NOT YET RECEIVED A LETTER OF CONFIRMATION THAT THE PARTS WERE AVAILABLE OR AN EXPECTED AVAILABLE DATE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT EXPERIENCED A TRANSMISSION FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. PARTS DISTRIBUTION DISCONNECT. *TT    THE CONSUMER STATED THE TRANSMISSION WAS REPAIRED AT THE TUNE OF $6,000. *TR",
        "vin": "3D7TP2HL4AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11072292,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 RAM 2500. AFTER THE CONTACT'S HUSBAND PLACED THE VEHICLE IN PARK AND EXITED THE VEHICLE, IT PROCEEDED TO ROLL AND RAN HIM OVER. THE CONTACT'S HUSBAND SUFFERED A CONTUSION ON THE LEFT KNEE, LACERATIONS ON THE LEFT LEG, AND OTHER MINOR INJURIES. MEDICAL ATTENTION WAS RECEIVED. THE DEALER WAS NOT NOTIFIED. THE VEHICLE WAS NOT DIAGNOSIS OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT TO CALL NHTSA. THE CONTACT RECENTLY RECEIVED A RECALL LETTER FOR NHTSA CAMPAIGN NUMBER: 17V821000 (POWER TRAIN). THE FAILURE MILEAGE WAS 219,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH IS FAULTY    ( WIRELESS IGNITION NODE )  THE TRUCK CAN TURN OFF COMPLETELY IN TRAFFIC UNEXPECTEDLY     ON THREE SEPARATE CVASIONS IN TRAFFIC ON PUBLIC ROADS WHILE DRIVING THE TRUCK SPONTANEOUSLY TURNED OFF AND SHUT DOWN..    YOU HAVE TO PLACE IN PARK AND RESTART THE TRUCK      THIS IS VERY DANGEROUS AND CAN CAUSE A CRASH",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECENTLY EXPERIENCED \"THE DEATH WOBBLE\" IN MY TRUCK. (2010 DODGE RAM 2500) I WAS TRAVELING ON THE HIGHWAY AT APPROXIMATELY 75 MILES PER HOUR, WHEN I HIT A SMALL BUMP AND MY TRUCK BEGAN SHAKING VIOLENTLY AND UNCONTROLLABLY ON THE FRONT END. APPLYING MY BREAKS DID NOT HELP. ALL I COULD DO IS HOLD ON FOR THE RIDE UNTIL I SLOWED DOWN TO APPROXIMATELY 35 MILES PER HOUR. I PULLED OVER AND EXAMINED MY TRUCK THINKING THAT SOMETHING WAS SEVERELY DAMAGED DUE TO THE EXTREME NATURE OF THE INCIDENT AND COULD NOT FIND ANY DAMAGES. I SLOWLY DROVE HOME AFRAID OF IT HAPPENING AGAIN. I DID NOT KNOW WHAT THE VIOLENT SHAKING IN MY TRUCK WAS CALLED UNTIL I RESEARCHED THIS SCARY EXPERIENCE. UPON CONDUCTING MY RESEARCH, I LEARNED THAT THIS IS A COMMON PROBLEM WITH MY YEAR, MAKE AND MODEL OF VEHICLE. I HAVE ALREADY TAKEN IT IN FOR A COUPLE OF RECALL ITEMS REGARDING STEERING ISSUES. I AM AFRAID THEY MAY HAVE REPLACED ANY RECALL ITEMS WITH FAULTY PARTS.",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035786,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HIT A BUMP KEY FALLS OUT OR TRUCK SHUTS OFF WITH KEY STILL IN",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023436,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPER MOTOR MOUNT WELDS BREAK.",
        "vin": "3D7TT2CT1AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "05/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983761,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK KEEP SHUTTING IT SELF OFF AND WHILE DRIVING.",
        "vin": "3D7TT2CT4AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968268,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD LEAK ON 2010 DODGE RAM- THIS CAN DAMAGE PLASTIC COMPONENTS IN THE ENGINE BAY. IT CAN ALSO BECOME A HEALTH HAZARD, AS THE EXHAUST FUMES CAN ENTER THE CAR'S CABIN.   UPON DOING RESEARCH MANY DODGE OWNERS HAVE HAD THIS SAME LEAK AND DODGE HAS NOT ISSUED A RECALL.  MOST VEHICLES ONLY HAVE AROUND 50,000 MILES WHEN THE MANIFOLDS BREAK AND THE EXHAUST BEGINS TO LEAK.",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "02/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957723,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST SYSTEM GETS SO HOT THE BED LINER MELTED.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937808,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS THE TRUCK WILL COMPLETELY SHUT DOWN, NO POWER STEERING, BRAKES, LIGHTS IT JUST GOES DEAD. NO WARNING LIGHTS OR CODES THROWN. THIS HAS HAPPENED ABOUT 10 TIMES NOW. VERY DANGEROUS WHEN IT HAPPENS AT NIGHT.  *TR",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925871,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT SMELLED MOLD INSIDE THE VEHICLE AND THE HEADLINER AND STORAGE UNDERNEATH THE BACK SEAT WERE RETAINING WATER. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE CAB WAS LEAKING DUE TO A FAULTY SEALING ON THE REAR WINDOW. THE VEHICLE WAS TEMPORARILY REPAIRED AND THE DEALER DIAGNOSED THAT THE SEAL ON THE REAR WINDOW NEEDED TO BE REPLACED. THE VEHICLE DID NOT RECEIVE A PERMANENT REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DIRECTED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.   UPDATED 01/06/17*LJ   THE CONSUMER STATED REAR WINDOW SEAL LEAKING.  UPDATED 7/5/18*JB   *TR",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899391,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FIRST TAKING OFF YOU PUT YOUR FOOT ON THE GAS PEDAL AND IT GOES ALL THE WAY TO THE FLOOR AND DOESN'T GO. IT'S LIKE IT'S STUCK, NO POWER. FINALLY WILL GO AND THEN KEEPS REPEATING, JERKING. ONCE DRIVING FOR AWHILE IT WON'T DO IT AGAIN.",
        "vin": "3D7TP2CL0AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898104,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PULLING OUT ONTO A 5 LANE ROAD THE VEHICLE SHUT OFF, I WAS ABLE TO RESTART AND CONTINUE.  THEN WHEN TURNING OFF A 5 LANE ROAD THE VEHICLE SHUT OFF, I WAS ABLE TO RESTART AND CONTINUE.  ON THE EXPRESSWAY AT 70 MPH TOWING A CAR TRAILER THE VEHICLE SHUT OFF.  I WAS IN THE RIGHT LANE AND WAS ABLE TO PULL OFF AND RESTART TO CONTINUE.  THIS IS A VERY HEAVY TRUCK AND VERY HARD TO STEER AND STOP WHEN NOT RUNNING.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881251,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. IN MARCH OF 2013, THE DRIVER SIDE TIE ROD ASSEMBLY WAS REPLACED UNDER THE MANUFACTURER'S RECALL (L16). IN DECEMBER OF 2014, THE DRIVER SIDE TIE ROD ASSEMBLY WAS REPLACED AGAIN PER NHTSA CAMPAIGN NUMBER: 16V529000(SUSPENSION). IN NOVEMBER OF 2015, THE DRIVER SIDE TIE ROD FAILED WHILE DRIVING AT A SLOW RATE OF SPEED. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "3D7TT2CTXAG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "05/02/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862610,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. WHILE DRIVING 65 MPH, THE ENGINE STALLED AND THE CHECK ENGINE LIGHT ILLUMINATED. THE FAILURE WAS PERSISTENT. THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE COMPUTER FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED SEVERAL TIMES, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 38.",
        "vin": "3D7LT2EL9AG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "RADIAL STEEL BELT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING AND THE REAR PASSENGER TIRE BLEW (SOUNDED LIKE A CANNON GOING OFF) THE TREAD CAME OFF THE TIRE AND I COULD NOT FIND IT (HAVE PHOTO). THE TIRE WAS PURCHASED NEW WITH THE TRUCK 2010 DODGE 2500 SLT CREW CAB. THE BRAND BF GOODRICH LT265/70R17 121/118R. DOT INFO IS M3AH DR11 0510.",
        "vin": "3D7TT2CT8AG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "01/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818233,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT HEARD A KNOCKING SOUND BEHIND THE DASHBOARD OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE PLASTIC GEAR ACTUATOR WAS FAULTY AND NEEDED TO BE REPLACED. AS A RESULT, NONE OF THE HVAC FUNCTIONS WERE OPERATIONAL. THE DEALER STATED THAT THERE WAS A CUSTOMER SATISFACTION NOTIFICATION FOR THE FAILURE INITIATED BY THE MANUFACTURER; HOWEVER, THERE WERE NO RECALLS. THE CONTACT'S VEHICLE WAS NOT COVERED BY THE CUSTOMER SATISFACTION NOTIFICATION (K17). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED, BUT DID NOT ASSIST DUE TO THE VEHICLE NOT BEING INCLUDED IN THE MANUFACTURER'S RECALL. THE FAILURE MILEAGE WAS 69,500.",
        "vin": "3D7UT2HL3AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS 2010 DODGE RAM 2500 HD CREWCAB 4X4 FOR 3 YEARS.  I BOUGHT IT USED AT 74000.  SO FAR I HAVE HAD 3 ACTUATORS, TIE ROD, 3 DIFFERENTIAL SEALS, 1 TRANSMISSION SEAL, 1 REAREND SEAL, FULL HVAC CONTROL AND DUCT WORK WITH 2 HEATER CORES, 2 FRONT U-JOINT, AND NOW ALL THE BEARINGS IN THE FRONT DIFFERENTIAL.  AND EXTREME AMOUNT OF TIME, MONEY, AND TROUBLE OF NOT HAVING MY TRUCK INVESTED IN THIS.  I NEED TO KNOW HOW MAY OTHER OF THIS MODEL OF TRUCK HAS BEEN HAVING THIS TROUBLE.  99% HWY MILES, ONLY ABOUT 5% TOWING OR HAULING, NO OFF ROADING, VERY LITTLE LONG DISTANCE DRIVING. I HAVE AN EXTENDED WARRANTY FOR DRIVE TRAIN.  IS YOUR DEFINITION THE STANDARD TERM FOR DRIVETRAIN?",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "09/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790087,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC SYSTEM TROUBLE. VERY LITTLE HEAT AND AIRFLOW ON DRIVERS SIDE OF VEHICLE.  AC IS FINE.  PASSENGER SIDE HAS FULL AIRFLOW AND HEAT.  ACTUATORS HAVE BEEN CHANGED AND TESTED.  DEALERSHIPS HAVE CHANGED HEATER CORE, BUT TROUBLE PERSISTS.  NEW DEALER WANTS TO CHANGE HEATER CORE.  ON GOING ISSUE.  I AM NOT THE ONLY ONE HAVING THIS TROUBLE.  NUMEROUS REPORTS OF BLEND DOOR PROBLEMS BUT SERVICE WILL NOT DIAGNOSE OR FIX.  TROUBLE HAS BEEN ON GOING TO 3 YEARS.  NEED RESOLUTION.  STARTED WHEN ACTUATORS WERE CHANGED ON RECALL.  DO NOT REMEMBER EXACT DATE.",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "06/12/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789572,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE READ SOMEWHERE ELSE HTTP://WWW.DODGETALK.COM/FORUMS/SHOWTHREAD.PHP?T=364235) THAT OTHER PEOPLE HAVE BEEN HAVING THE SAME PROBLEM I HAVE HAD. MY HEATED MIRRORS ARE STARTING TO BURN WHEN I USE THE HEATED MIRROR FUNCTION TO GET RID OF THE CONDENSATION. I AM NOT SURE IF THERE IS A THERMAL REGULATOR SWITCH, OR A SAFETY THAT HAS BEEN ACTING UP, BUT THE HEAT FROM THE COIL ON THE BACK OF THE MIRROR IS STARTING TO DISCOLOR THE FACE OF THE MIRROR. I ATTACHED TWO PICTURES. THEY ARE OF THE RIGHT SIDE MIRROR, AND IT IS ONLY STARTING ON THE BOTTOM. WHEN I NOTICED IT, I STOPPED USING THE HEATERS, BUT IT WOULD BE NICE TO BE ABLE TO USE THEM AN NOT WORRY ABOUT THEM MAKING THE WHOLE MIRROR BROWN. I AM NOT SURE IF THERE NEEDS TO BE A TIMER ADDED, OR A THERMAL SAFETY SWITCH, OR WHAT, BUT SOMETHING NEEDS TO BE DONE.    2010 DODGE RAM 2500 HD DIESEL, ONLY PURCHASED APRIL/MAY 2015 WITH 52,000 MILES TOTAL.",
        "vin": "3D7LP2EL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/25/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785873,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIE ROD END RECALL WAS DONE AT DEALER WITH ABOUT 30000 MILES ON THE TRUCK. NOW AT 40000 IT IS GIVING ME PROBLEMS AGAIN DEALER SAID RECALL PART  IS OUT OF WARRANTY.             STEERING WHEEL PULSATES AT LOW SPEED TURNING IN PARKING LOT.",
        "vin": "3D7LT2ET9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/25/2015",
        "dateOfIncident": "10/25/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785878,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE CURRENT RECALL GOING ON WITH THE DODGE RAM TIE ROD ISSUE.  THE DEALERS ARE STILL WAITING ON PARTS. I'VE BEEN ON THE LIST FOR OVER A MONTH NOW AND THE DEALER IS STILL STAYING THE SAME THING. DON'T NOW WHEN \" DODGE \" IS GONNA SEND US THE PART. WE ONLY HAVE UNTIL JANUARY 1 TO GET THE PROBLEM CORRECTED. AS YOU KNOW DODGE ISN'T PROVIDING THE PARTS AND THE BUYBACK IS A JOKE. THEY WON'T PAY SUFFICIENT FOR THE TRUCKS. THEY ONLY WANTED TO GIVE ME 19K FOR A 26K TRUCK. SO OBLIVIOUS THE BUYBACK ISN'T WORTH MY TROUBLE. ALL WE WON'T IS ARE TRUCK FIXED WHERE IT?S ROAD WORTHY. CAN YOU HELP WITH DODGE SLOW RECALL PARTS PROBLEM?",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782545,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS THE TIE ROD END RECALL MAKING IT ELIGIBLE TO BE BOUGHT BACK BY DODGE. WHEN I TRIED TO SELL MY TRUCK BACK THE DEALER I DEALT WITH WAS GIVING ME A HARD TIME WHILE DOING SO. THE DEALER WAS TRYING TO ONLY OFFER ME TRADE IN VALUE FOR MY VEHICLE WHEN THEY ARE SUPPOSE TO OFFER ME A PREMIUM RATE. I WALKED OUT AND I AM STILL TRYING TO HAVE MY TRUCK BOUGHT BACK. I WOULD LIKE TO GET MORE HELP ON THIS SITUATION AND MORE INFORMATION AS TO THE ACTUAL PRICE DODGE SHOULD BE GIVING E",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782026,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHUT OFF WHILE DRIVING ON 2 SEPARATE OCCASIONS CAUSING COMPLETE LOSS OF ALL FUNCTIONS.  THIS OCCURRED IMMEDIATELY AFTER THE VEHICLE WAS SERVICED A HALEY AUTO GROUP (CERTIFIED DODGE DEALER) FOR A RECALL ITEM (P65/NHTSA 14V-635) AND BULLETIN ITEM (25-002-14).  THE VEHICLE'S COMPUTER SYSTEM DID NOT SHOW A CODE AS TO CAUSE ON EITHER OCCASION AND THE ISSUE HAS NOT BEEN RESOLVED.  THE INFORMATION WAS REPORTED TO DODGE FOR TECHNICAL ASSISTANCE AND A CASE MANAGER ASSIGNED (CASE # 27675333), TO WHICH A RESOLUTION WAS NEVER REACHED.  UNFORTUNATELY, AFTER PAYING HEFTY EXPENSES FOR EXPERIMENTAL PARTS THE ISSUE WAS NOT RESOLVED AND THE TRUCK WAS SOLD TO THE DEALERSHIP. I ACCEPTED AN OFFER AT A STEEP FINANCIAL LOSS TO MYSELF BECAUSE TO THE DANGEROUS SHUT DOWNS I HAD EXPERIENCED FIRST HAND WHILE DRIVING.  THIS VEHICLE IS NOW OFFERED FOR SALE BY THE DEALERSHIP AND I AM CONCERNED FOR THE UNAWARE POTENTIAL BUYER!  ALSO, I AM CONCERNED FOR THE SAFETY OF OTHER MOTORISTS IF THIS VEHICLE IS BACK OUT ON THE HIGHWAY.  I FEEL STRONGLY THAT THIS ISSUE NEEDS TO BE DISCLOSED WHEN SELLING THIS VEHICLE AND REPORTED AS A SAFETY CONCERN.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/10/2015",
        "dateOfIncident": "03/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762818,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER DURATRAC",
                "productYear": "9999",
                "size": "LT285/70R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500 EQUIPPED WITH GOODYEAR WRANGLER DURATRAC TIRES, SIZE: LT285/70R17. THE CONTACT STATED THAT THERE WAS SEPARATION OF TREAD DUE TO THE LENGTH OF TIME WAITING FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) TO BE HONORED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS CONFIRMED THAT THE TREAD SEPARATED FROM THE TIRE AND THE TIRE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE TIRE FAILURE MILEAGE WAS 4,000 AND THE VEHICLE FAILURE MILEAGE WAS 99,000. THE VIN AND DOT NUMBER WERE NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "08/04/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762173,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE REVERSING, THE FRONT WHEELS SEIZED AND TURNED INWARD.  THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT DRIVER AND PASSENGER SIDE TIE RODS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 59,000.   UPDATED 11/09/15*LJ    *CN",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "02/19/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761706,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN NUMBER:  13V529000 (STEERING); HOWEVER, THE FAILURE RECURRED. WHILE DRIVING APPROXIMATELY 60 MPH OVER A BUMP IN THE ROAD, THE VEHICLE VIBRATED EXCESSIVELY. THE APPROXIMATE FAILURE MILEAGE WAS 44,000.",
        "vin": "3D7UT2HL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "09/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760500,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 RAM 2500.  CONSUMER WRITES IN REGARDS TO VEHICLE STEERING PROBLEMS.  *SMD  THE CONSUMER STATED THE DEALER FOND A BROKEN JOINT AT THE LOWER END OF THE INTERMEDIATE STEERING SHAFT. THE SERVICE DEPARTMENT ADVISED HIM NOT TO DRIVE THE VEHICLE, UNTIL THE REPAIRS WERE COMPLETED.  *JB",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "09/30/2011",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760349,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 11V350000 (STEERING), 13V529000 (STEERING), AND 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL). WHILE DRIVING 55 MPH, THE CONTROL GAUGE INDICATED HIGH AND THE TRUCK OVERHEATED. THE ENGINE ENGULFED INTO FLAMES. THE CONTACT VEERED TO THE SIDE OF THE ROAD AND EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE VEHICLE OVERHEATED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2015",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746805,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 RAM 2500. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE SERVICE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE STARTED TO JERK VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE EXHAUST GAS PRESSURE SENSOR WAS DAMAGED AND NEEDED REPLACEMENT. THE CONTACT ALSO STATED THAT THIS WAS THE SECOND TIME THE FAILURE OCCURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 49,503.",
        "vin": "3C6UD5JL7CG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "09/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE FRONT SUSPENSION WAS UNSTABLE AND THE VEHICLE SWAYED FROM LEFT TO RIGHT. THE CONTACT HAD TO APPLY FORCE TO THE STEERING WHEEL EACH TIME THE FAILURE RECURRED. THE VEHICLE SHOOK VIOLENTLY IN THE FRONT AND THE REAR. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.   UPDATED 12/09/15. *JB",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN MY STREET TO MY HOUSE AND RIGHT BEFORE MY HOUSE I HEARD A BIG POP, I WAS DRIVING ABOUT 10-15 MPH.  I WASN'T SURE WHAT IT WAS UNTIL I NEEDED TO TURN AND I COULDN'T.  I GOT OUT AND MY TIRE DRIVERS SIDE TIRE WAS JAMMED INTO THE FENDER WELL AND THE TIE-ROD WAS BROKEN.  WELL ABOUT 3 MONTHS PRIOR TO THIS HAPPENING I GOT A SAFETY RECALL NOTICE IN THE MAIL FOR THAT EXACT TIE-ROD. I CALLED THE DEALERSHIP AND THEY SAID THEY DIDN'T HAVE THE PART AND WHEN THEY DID GET THE PARTS IN FOR THAT RECALL THEY WOULD CALL ME.  SO, BACK TO THE TIE-ROD BREAKING.  I CALLED THE DEALERSHIP DWAYNE LANE IN EVERETT,WA  AND ASKED THEM IF THEY TOW VEHICLES THAT ARE AFFECTED BY RECALLS AND IF I COULD GET A LOANER/RENTAL CAR AND THEY SAID NO.  THEY ALSO SAID THEY STILL DIDN'T HAVE THE PARTS TO FIX THE ISSUE(RECALL).  I WASN'T HAPPY WITH DODGE DUE TO THIS ISSUE.  SO ABOUT 3 DAYS LATER THE DEALERSHIP CALLS ME BACK AND SAYS THEY GOT THE OK FROM DODGE TO PUT ON THE \"RECALLED TIE-ROD\" SO I CAN HAVE MY TRUCK BACK UNTIL THE FIX(NEW PARTS FROM THE RECALL) IS AVAILABLE.  I ASKED THE SERVICE MANAGER IF HE WOULD EXCEPT THAT IF HIS FAMILY WAS IN THE VEHICLE AND HE SAID YES.  I WASN'T HAPPY WITH THAT DECISION FROM DODGE TO PUT ON THE RECALLED TIE-ROD END TO GET ME BACK ON THE ROAD.  SO, I ENDED UP GETTING MY TRUCK BACK WITH FAULTY PARTS ON IT AND DROVE IT FOR ABOUT 2-3 WEEKS AND THE DEALERSHIP CALLED TO SAY THE NEW PARTS ARE IN.  THEY FIXED IT AGAIN AND HERE I AM NOW.  NOW WITH THIS BUY BACK FROM DODGE, THE WAY I SEE IT SINCE THE RECALL HAS BEEN FIXED I WOULDN'T HAVE THE OPTION FOR DODGE TO BUY MY TRUCK BACK.  I THINK THEY SHOULD HAVE TO GIVE ME THE OPTION ESPECIALLY SINCE MINE ACTUALLY DID BREAK WHILE I WAS WAIT FOR DODGE TO GET THE RECALL PARTS.  PLEASE LOOK INTO THIS I DO NOT FIND THIS EXPECTABLE BUSINESS, IT WASN'T SAFE TO PUT THE RECALLED PART BACK ON MY TRUCK AND DODGE SAID IT WAS.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745604,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STARTED BOUNCING ALL OVER ,LOST CONTROL AND HIT TREE.",
        "vin": "3D7LT2ETXAG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/01/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745515,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PERSONAL VEHICLE, ONE OF TWO, DROVE ON INTERSTATE 87. EXPERIENCED VIOLENT SHAKING ON THE FRONT END WHEN DRIVING OVER PAVEMENT TO BRIDGE TRANSITION ANGLED LEFT WHEEL FIRST, WHILE TRAVELING AT 70 MPH. STEERING WHEEL SHOCK VIOLENTLY FOR 4 TO 5 SECONDS. THIS HAPPENED TWICE ON MY TRIP UP NORTH. I HAVE HAD SIMILAR EXPERIENCE, BUT NOT AS SEVERE. I BELIEVE THE PAVEMENT TO BRIDGE THEN BRIDGE TO PAVEMENT TRANSITION BEING ANGLED, AMPLITUDE THE SEVERITY OF THE FRONT END SHAKING. MY VEHICLE DID HAVE RECALL WORK ALREADY DONE, THAT HAS NOT CORRECTED THE PROBLEM. THOUGH I LOVE MY RAM, I WILL NOT LET ANYONE ELSE DRIVE THIS VEHICLE. I KEEP BOTH HANDS ON THE WHEEL, WHITE KNUCKLED AT TIMES. I CONSIDER THE VEHICLE UNSAFE FOR DRIVING.",
        "vin": "3D7TT2CT0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "04/30/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744856,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REPAIRED UNDER RECALL 13V-529 ON 11/06/2013, DEALER RECOMMENDED THE NEED TO REPAIR AND ESTIMATED COST OF REPAIR OF IDENTICAL ITEMS ON 04/30/2015.",
        "vin": "3D7LT2ET3AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744865,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOTALLY INTEGRATED POWER SYSTEM TIPS FAILURE  ...    I DID THE RECOMMENDED 10,000 MILE FUEL FILTER REPLACEMENT AND TURNED THE IGNITION KEY \"ON-OFF\" THREE TIMES WITHOUT STARTING THE VEHICLE AS OUTLINED IN THE OWNERS MANUAL.  I NOW HAVE AT LEAST 10 WARNINGS ON MY VEHICLE: CHECK ENGINE LIGHT, BRAKES, TRAILER, WILL  NOT START, NO AIR CONDITIONING, HEADLIGHTS STAY ON, ONLY DRIVER SIDE OF BRAKES WORK, DIESEL REGENERATION REQUIRED POWER WILL BE REDUCED.....ETC.   LOCAL DEALERSHIP STATED THE TOTALLY INTEGRATED POWER SYSTEM TIPS SHORT CIRCUITED.  THEY SAY IT WILL COST AT LEAST $1,200.00.  AFTER READING ALL OF THE COMPLAINTS AND PROBLEMS THESE VEHICLES ARE HAVING WITH THE TIPS, THERE MUST BE A RECALL.  IN FACT THE DEALERSHIP TOLD ME THAT HE HAS SEEN THE TIPS SORT CIRCUIT JUST BECAUSE THE OWNER WASHED THEIR VEHICLE AND WATER GOT INSIDE THE TIPS.",
        "vin": "3D7UT2HL3AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744333,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON RT 90 WEST ALBANY NY TRUCK AND TRAILER WENT IN A DEATH WOBBLE AND WENT OF THE ROADWAY THIS WAS THE FIRST ACCIDENT  TURNED TRUCK AROUND BROUGHT IT TO KEENE CHRYSLER IN KEENE NEW HAMPSHIRE THEY CHANGE ALL TIRES ALINED  FRONT END SENT ME ON MY WAY NEXT ACCIDENT TIE RODE BROKE ON LEFT SIDE TRUCK LANDED  IN DITCH DENTED BUMPERS TOWED TO LAMBERT CHRYSLER RAM JEEP AUTO  5 RIVER RD CLAREMONT NEW HAMPSHIRE 03743 . THEN THE NEXT ACCIDENT ACOURD ON 06/26/2013 SAME TIE RODE BROKE AGAIN TRUCK HAD TO BE TOWED TO LAMBERT AUTO SALES IN CLAREMONT NH 603 543 1507.. I HAVE TRYED TO GET CHRYSLER TO BUY BACK THIS LEMON I HAVE NAMES I SPOKE WITH THAT I COULD GET ANY ANSEWERS STILL HAVING PROBLEMS MATT IN NH THIS IS A DANGER,S TRUCK CHRYSLER HAS EGNORED MY CALLS BUT I STILL HAVE THE NAMES I SPOKE WITH AND PHONE NUMBERS MY TRUCK IS GOING TO BE OUT OF WARRANTY SOON AND THEY DON,T CARE THEY ONLY CARED THAT I GAVE THEM $ 45000.00 DOLLARS THE WHEN I STARTED TO HAVE ALL THESE PROBLEMS NO ONE WOULD LISTEN TO ME MY FAMILY IS STILL SCARED TO RIDE IN THIS TRUCK THANK YOU MATT.",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "03/14/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743885,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN A PARKING LOT THE LEFT SIDE TIE ROD BROKE, WHICH I WAS FORTUNATE ENOUGH TO HAVE HAD IT HAPPEN IN THE PARKING LOT AND NOT 2 MINUTES EARLIER WHEN I WAS TRAVELING AT 75 MPH ON THE TOLL WAY. I HAD JUST RECEIVED THE RECALL NOTICE 3 DAYS PRIOR TO THE INCIDENT, AND HAD NOT HAD TIME TO TAKE IN IN. ONCE THE TRUCK ARRIVED TO THE DEALERSHIP MAXWELL SUPER CENTER LOCATED IN AUSTIN TEXAS, THEY ARGUED WITH ME THAT THE TIE ROD THAT HAD BROKE WAS NOT A PART OF THE RECALL AND THAT I WOULD BE RESPONSIBLE FOR PAYMENT. I LITERALLY HAD TO PROVE TO THEM ON THE FOLLOWING MONDAY THAT THIS WAS THE TIE ROD UNDER THE RECALL AND THAT EVERYONE CONCERNED WAS LUCKY THAT I WAS NOT KILLED OR KILLED SOMEONE ELSE I WAS ALSO INFORMED THAT THERE WAS ANOTHER RECALL ON MY TRUCK AS WELL THAT THEY WERE NOT YET PREPARED TO FIX AND THAT I WOULD BE PLACED ON A LIST AND CALLED ONCE THE NEEDED ITEMS WERE AVAILABLE TO MAKE SUCH REPAIRS, AND TO THIS DATE I HAVE YET TO HERE BACK ON THAT RECALL SO HOPEFULLY MY TRUCK DOESN'T CATCH FIRE UNTIL THEY GET AROUND TO NOTIFYING ME.  THE SAD PART OF THIS WHOLE THING IS CHRYSLER WANTED ME OUT OF MY PREVIOUS TRUCK BECAUSE EVEN AFTER A COMPLETE ENGINE REPLACEMENT THEY STILL COULD NOT FIX THE ISSUES AND MAKE IT SAFE AND RELIABLE THIS WAS ON A 06 DODGE RAM 2500 THAT WOULD GET 21 MPG VS THIS 2010 THAT GETS 14 MPG WHICH THEY SAY THEY CAN FIND NOTHING WRONG, I HAVE ALSO HAD TO HAVE THE TRUCK IN 2 TIMES FOR A GASKET AROUND THE THIRD BRAKE LIGHT THAT LEAKS IN THE RAIN THUS FILLING THE TRUCK UP WITH WATER ON THE INSIDE.",
        "vin": "3D7UT2HL3AG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2015",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731952,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DEC. 2014 I RECEIVED RECALL P65 / NHTSA 14V-635. CONTACTED FOLSOM LAKE DODGE IN FOLSOM, CA AND WAS TOLD \"CORPORATE HAS NOT SENT US THE PARTS\". CONTACT AGAIN IN FEBRUARY AND WAS TOLD NHTSA HAD NO AUTHORITY TO COMPEL THE DEALERSHIP TO HONOR THE RECALL AND THAT CORPORATE IS THE RESPONSIBLE PARTY AND THAT I SHOULD CONTACT CORPORATE...I WAS GIVEN A NUMBER TO CALL. CALLED THE NUMBER AND WAS TOLD THAT THE LOCAL DEALER WOULD BE SENT THE REQUIRED PARTS AND IT WOULD BE TAKEN CARE OF. JUNE I WENT TO THE DEALER IN PERSON AND WAS TOLD CONFIDENTIALLY THAT \"WE ARE NEVER GOING TO GET THE PARTS\". I WAS TOLD THAT THE SERVICE DEPARTMENT HAD NEVER ENCOUNTERED THIS PARTICULAR RECALL PROBLEM AND NOT TO WORRY ABOUT IT. I AM SUM WHAT CONCERNED ABOUT USING MY VEHICLE, ESPECIALLY ON LONG HAULS WITH OUR TRAILER. I THERE ANY WAY FOR YOUR DEPARTMENT TO MOTIVATE CORPORATE TO SEND THE PARTS TO THE DEALER?",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706207,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRYSLER SAFETY RECALL P65/NHTSA 14V-635  I WAS SENT THE SAFETY RECALL NOTICE IN DECEMBER OF 2014.  AS OF APRIL 2015, I CALLED CHRYSLER AND THEY SAID THAT THE PARTS ARE NOT AVAILABLE.  5 MONTHS AFTER THE RECALL NOTICE WAS SENT OUT, AND THE PARTS ARE STILL NOT AVAILABLE FOR THIS CRITICAL SAFETY RECALL, WHICH IF NOT FIXED, COULD CAUSE AN ENGINE COMPARTMENT FIRE.  THEY DID NOT GIVE ME A DATE AS TO WHEN THE PARTS WOULD BE AVAILABLE.  CHRYSLER IS NOT ACTING IN GOOD FAITH TO FIX THIS SAFETY PROBLEM.  *TR",
        "vin": "3D7UT2HL0AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/13/2015",
        "dateOfIncident": "05/26/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705500,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECOND DAY I OWNED MY 2010 POWER WAGON I EXPERIENCED THE DEATH WOBBLE. IT ONLY HAD 16,000 MILES ON IT. TOOK IT BACK TO THE DEALERSHIP REPLACED STEERING DAMPENER AND TIRES. THIS WORKED FOR ONLY A FEW MONTHS. THAT WAS 2011 WHEN IT STARTED. IT IS NOW APRIL 2015 HAVE BEEN HAVING THE SAME ISSUE EVERY FEW MONTHS. I HAVE REBUILT THE ENTIRE FRONT END HELPED FOR A LITTLE WHILE BUT IT SOON CAME BACK. I HAVE PUT 4 SETS OF TIRES ON IT ALSO IN THIS TIME PERIOD. I INSTALLED AN AFTERMARKET DUAL STEERING STABILIZER SAME RESULT. MY TRUCK ONLY HAS 63,400 MILES ON IT NOW. TWO DAYS AGO RUNNING DOWN THE TOLL ROAD HIT AN EXPANSION JOINT AT 70 MILES PER HOUR AND STARTED THE DEATH WOBBLE CARS SCATTERED ALL AROUND ME AS TRUCK SHAKES VIOLENTLY UNTIL YOU CAN SLOWLY SLOW YOUR SPEED DOWN TO ABOUT 30 MILES PER HOUR PRAYING THAT NOBODY SLAMS INTO YOU. THIS HAPPENED TWICE IN A MATTER OF ABOUT FIVE MILES. TOOK IT BACK TO THE DEALERSHIP THEY ROTATED MY AXLE FORWARD TO GET THREE MORE DEGREES OF CASTER AND THEY SAID TRY THAT. ON MY WAY HOME STARTED TO DEATH WOBBLE AT 58 MILES PER HOUR. DODGE HAS WORKED ON MY TRUCK TO TRY AND SOLVE THIS PROBLEM ROUGHLY  12 TIMES IN THE LAST 4 YEARS. THE PROBLEM STILL EXISTS AND THEY DON'T KNOW HOW TO FIX IT. I WILL NOT ALLOW MY WIFE OR DAUGHTER TO DRIVE THIS TRUCK DO TO FEAR OF THEIR LIVES AND OTHERS IF THIS WERE TO HAPPEN WITH THEM BEHIND THE WHEEL. SOMETHING NEEDS TOO BE DONE TO CORRECT THIS PROBLEM AND SOMEBODY NEEDS TO BE HELD ACCOUNTABLE. THIS IS A VERY BAD SAFETY HAZARD.  *TR",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695445,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V635000(ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL). THE CONTACT STATED THAT THE PART NEEDED TO REMEDY THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/18/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695107,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 4/20/15*CN",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "02/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693381,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 14V817000 (AIR BAGS) HOWEVER THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "12/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692955,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL).HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE TISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 DODGE RAM 1500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL) HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 4/27/15*CN   UPDATED 10/9/2015 *JS",
        "vin": "3D7LP2EL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "12/29/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668878,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE PART TO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT6AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2014",
        "dateOfIncident": "12/27/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668614,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON RURAL HIGHWAY  65MPH WHEN TRUCK BEGAN TO MAKE GRINDING NOISE. AFTER STOPPING AND INSPECTING DRIVE TRAIN IT WAS DISCOVERED THE CENTER SUPPORT BEARING HAD FAILED AND ALLOWED THE 2 PIECE DRIVE SHAFT TO BECOME LOOSE. FORTUNATELY THE SUPPORT BRACKET KEPT IT IN PLACE. HAD BRACKET NOT HELD IN PLACE CATASTROPHIC DRIVE TRAIN FAILURE COULD HAVE OCCURRED AND POSSIBLY CAUSING ACCIDENT.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "11/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667930,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING, CHECK ENGINE LIGHT CAME ON, TEMPERATURE GAUGE WENT TO OVER 200 DEGREES. CALLED DEALER, TOOK IN. O2 SENSOR PROBLEM. SUPPOSEDLY FIXED ON 12/10/13, CHECK ENGINE LIGHT CAME ON AGAIN 12/25/13. CALLED DEALER, SUPPOSEDLY FIXED ON 12/30/13. CALLED CHRYSLER, CASE OPENED. CHECK ENGINE LIGHT CAME ON AGAIN, BACK TO DEALER. CHECK ENGINE LIGHT KEEPS COMING ON, EVERY TIME IS O2 SENSOR. NOT REPAIRED. HAVE TALKED TO CHRYSLER ABOUT LEMON, WON'T ADDRESS, SAID CONTACT STATE ATTORNEY GENERAL, MAKE COMPLAINT. HAVE TALKED TO MAN IN OHIO, HE HAS SAME PROBLEM, SUING. BOUGHT TRUCK BRAND NEW. PROBLEM STARTED WHEN TRUCK HAD LESS THAN 16000 MILES.  *TR",
        "vin": "3C6UD5ML5CG"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2014",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667162,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN ID NUMBERS: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL) AND 13V529000 (STEERING). THE CONTACT STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664444,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE DELAY. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 03/17/15*LJ  UPDATED 03/23/15.*JB",
        "vin": "3D7UT2HLXAG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663753,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DODGE/CHRYSLER IS NOT RESPONSIVE TO THE RECALL NOTICES.  WHEN WE RECEIVE THE NOTICES THEY HAVE NO PARTS AND TREAT CUSTOMERS INDIFFERENTLY.  WE HAVE NOT HAD AN INCIDENT BUT THE POSSIBILITIES ARE FRIGHTENING.  *TR",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THIS ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659456,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658952,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "LTX M/S",
                "productYear": "9999",
                "size": "LT225/75 R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500 EQUIPPED WITH MICHELIN LTX A/S,V TIRES (NA), SIZE 245/70/R17 (NA). THE DOT NUMBER WAS B7X6LJ4X0310. THE CONTACT STATED THAT ALL FOUR TIRES DEVELOPED CRACKS ON THE SIDEWALL AND THE TREAD WAS SEPARATING. THE VEHICLE WAS TAKEN TO DEALER. THE TECHNICIAN DIAGNOSED THAT THE TIRES WERE NOT OILING THEMSELVES DUE TO LACK OF WINTER DRIVING. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE OF THE TIRE AND VEHICLE WAS 13,000.    UPDATED 1/1315*CN  UPDATED 01/15/15.*JB",
        "vin": "3D7TP2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE (N49) ON THIS VEHICLE IN DECEMBER OF 2013. I CONTACTED THE DEALERSHIP IN JANUARY OF 2014 AS REQUESTED.  THE DEALERSHIP LOOKED AT MY VEHICLE AND CONFIRMED THE PROBLEM.  STILL NO REPAIR WAS MADE BY MAY OF 2014. I CONTACTED THE RECALL PHONE NUMBER SUPPLIED WITH THE NOTICE. THEY THEN SET ME UP WITH ANOTHER DEALER. WHICH I HAD TO TAKE MY VEHICLE TO THEM ALSO TO CONFIRM THE PROBLEM.  LONG STORY SHORT. HERE IT IS THE 17TH OF NOVEMBER AND I STILL DON'T HAVE MY VEHICLE REPAIRED. THE DEALERSHIP HAS NO IDEA WHEN I WILL HAVE THE WORK DONE.  THIS MAKES ALMOST A YEAR OF WAITING, AND TWO(2) DEALERSHIPS OF DEALING WITH.  *TR",
        "vin": "3D7UT2HL0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "10/31/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651710,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE ENTERING A DRIVE WAY, AN ABNORMAL SOUND EMITTED THROUGHOUT THE VEHICLE AS THE CONTACT LOST CONTROL. THE CONTACT AS A CERTIFIED MECHANIC DIAGNOSED THAT THE LEFT OUTER TIE ROD HAD SEPARATED FROM THE VEHICLE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED BY THE DEALER. THE VEHICLE WAS INCLUDED IN RECALL NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING). HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "3D7UT2HL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644520,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT0AG"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641789,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD BEEN WAITING OVER 6 MONTHS FOR PARTS FROM DEALERSHIP TO REPAIR LEFT TIE ROD RECALL N49.  ON 10/01/14, UPON LEAVING A GAS STATION AND ACCELERATING TO PROCEED DOWN HIGHWAY, THE LEFT TIE ROD BROKE, CAUSING THE VEHICLE'S LEFT WHEEL TO LOCK, RESULTING IN TOTAL LOSS OF CONTROL AND STEERING ABILITY, AND THE VEHICLE CROSSED OVER TO THE RIGHT SHOULDER, LANDING PARTIALLY IN A DITCH AND PARTIALLY REMAINING ON THE ROAD.  LUCKILY THERE WAS NO TRAFFIC NEXT TO ME AND NO ONE WAS INJURED.  THE TRUCK HAD TO BE TOWED TO THE LOCAL DODGE DEALERSHIP, WHO HAPPENED TO HAVE THE PART THEY WERE HOLDING FOR ANOTHER CUSTOMER WHO HAD NOT RESPONDED TO THE NOTICE THE PART WAS AVAILABLE, AND WAS USED ON OUR TRUCK THE SAME DAY.  THE DISTURBING THING IS THAT CHRYSLER WILL NOW NOT REIMBURSE MY TOWING EXPENSE, EVEN THOUGH IT WAS TOTALLY RELATED TO THIS RECALL FAILURE.  I HAVE BEEN CONTACTING MY LOCAL DEALERSHIP ROUTINELY FOR OVER 6 MONTHS TO INQUIRE ABOUT THIS PART AND BEEN TOLD EACH TIME THAT THE PART IS NOT AVAILABLE AND I AM 'ON THE LIST'.  ON THE DATE OF THE INCIDENT, I WAS TOLD BY THE SERVICE PERSONNEL THAT THEY ARE ALLOWED ON A SMALL NUMBER OF PARTS AND THAT THEY CANNOT GET ADDITIONAL PARTS UNTIL THEY SUBMIT PROOF OF INSTALLING THE PREVIOUSLY SENT PARTS.  YET THIS DEALERSHIP HAD PARTS THAT THEY HAD BEEN HOLDING FOR SEVERAL WEEKS FOR A CUSTOMER WHO HAD NOT RESPONDED TO THE NOTICE THEIR PARTS WERE IN.  MEANWHILE, MYSELF AND MANY OTHERS ARE WAITING FOR PARTS AND RISKING INJURY EACH TIME WE HAVE TO TAKE THESE VEHICLES ON THE ROAD.  I LIVE OUTSIDE THE CITY LIMITS AND MUST TAKE A HIGHWAY OR INTERSTATE TO TRAVEL ANYWHERE.  LUCKILY MY BREAKDOWN/ACCIDENT OCCURRED AT A SLOW SPEED AND NOT THE 60 MPH THAT I WOULD HAVE BEEN GOING IN JUST A FEW MORE MINUTES.  IT DOESN'T APPEAR THAT CHRYSLER TRULY VALUES THE SAFETY OF THEIR CUSTOMERS.  *TR",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK THIS VEHICLE TO MARTIN SWANTY CHRYSLER DODGE IN KINGMAN ARRZONA DUE TO A RECALL NOTICED THAT I HAD RECEIVED.  THIS WAS MY SECOND TRIP THEIR AS THE FIRST TIME THEY DIDN'T HAVE THE REPLACEMENT PARTS.  THE SECOND TIME I RETURNED AT THE APPOINTED TIME AND 5 HOURS LATER THEY STILL HAD NOT WORKED ON THE TRUCK.  NOT HAVING THE TIME TO SPEND AT THEIR SHOP I TOOK THE TRUCK BACK AND WAS TOLD BY THEM THAT'S THE WAY IT IS.  SO THIS TRUCK HAS NOT BEEN GIVEN THE REPLACEMENT PARTS AS CALLED FOR.  DEALER HANDLED THIS VERY POORLY AND I BELIEVE IT TO BE BECAUSE IT WAS NOT PURCHASED THERE.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD CONTACTED SHERIDAN MOTOR INC. IN SHERIDAN, WY TO REPAIR N49 / NHTSA 13V-529 RECALL, ABOUT 2 WEEKS PRIOR TO SCHEDULED SERVICE DATE.  WHEN I PICKED UP MY TRUCK, THE SERVICE REP, STATED THEY DIDN'T HAVE THE PARTS REQUIRED TO COMPLETE THE RECALL AND I WOULD BE PLACED ON A WAITING LIST AND NOTIFIED WHEN THE PARTS ARRIVE.  I HAVE STILL NOT BEEN CONTACTED.   THE FIRST TIME THIS RECALL HAPPENED (APPROX., 2012) THE SAME SITUATION HAPPENED, SHERIDAN MOTORS COULD NOT GET THE PARTS REQUIRED FOR THE RECALL.  I HAD TO DRIVE 60 MILES TO ANOTHER DODGE DEALER TO GET REPAIR DONE.    I HAVE NOW MOVED TO CHEYENNE, WY AND I HOPE THE LOCAL DEALER CAN GET THE PARTS REQUIRED TO REPAIR THIS RECALL.  *TR",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHSTA CAMPAIGN NUMBER: 13V529000 (STEERING) IN DECEMBER OF 2013. THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "05/15/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637232,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2HL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "09/11/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER:  13V529000 (STEERING). HOWEVER, THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "POWER TRAIN,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10632228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WEST IN ROAD TX-375-LOOP HEADING THE I10, I TOOK AN EXIT FOR I10 EAST WHICH IS A BRIDGE.    I TOOK IT AND THEN I HEARD A SOUND ON THE REAR WHEELS SO I SLOWED DOWN, AFTER THAT THE SOUND STOPPED AND I CONTINUED TO INCORPORATE TO I10-EAST.    AFTER I TOOK THE I10 I WAS DRIVING AROUND 60 MPH WHEN SUDDENLY I HEARD THE SOUND AGAIN BUT THIS TIME AFTER A FEW SECOND A DIFFERENT SOUND APPEARED AND THE REAR WHEELS STOPPED RESULTING IN COMPLETELY LOST OF CONTROL.    MY VEHICLE STARTED TO GO WITH NO DIRECTION AND THAN TOOK ME OUT OF THE HIGHWAY, ONCE I WAS ON THE SIDE OF THE ROAD THE VEHICLE MAKE A 180 DEGREES TURN AND I STOPPED HEADING WRONG WAY.    I WAS SO LUCKY BECAUSE THERE WERE SOME TRAFFIC SIGNS AND I DIDN'T CRASH ANY OF THEM AND ALSO BECAUSE EVEN THOUGH THAT HIGHWAY IS ALWAYS FULL WITH TRAFFIC I DIDN'T CRASH WITH ANY OTHER VEHICLE.    ONCE I TOOK A LOOK OF MY TRUCK I SAW THAT THE DRIVESHAFT WAS SEPARATED  FROM THE REAR AXEL.    I DIDN'T FILLED A CLAIM BEFORE BECAUSE CHRYSLER TOLD ME THEY WERE GOING TO FIX IT SINCE THAT INCIDENT HAPPENED BECAUSE OF A RECALL THEY DIDN'T FIX BEFORE.    THE RECALL NUMBER IS M34 AND ITS BEEN 3 MONTHS AND AFTER I COULD HAVE DIED IN THAT ACCIDENT THEY HAVEN'T HELPED ME AT ALL.    MY VEHICLE IS STILL IN THE DEALER AND CHRYSLER WONT AUTHORIZE TO FIX IT.  *TR",
        "vin": "3D7R61CT8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/26/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN UNSUCCESSFUL IN GETTING NHTSA 13V-529 RECALL DONE ON MY TRUCK. I HAVE BEEN PUT OFF BY THE CARSON VALLEY NEVADA DEALERSHIP SINCE APRIL 2014.  *TR",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "08/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627111,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER STATED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS PLACED ON A WAITING LIST. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621958,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING). THE CONTACT CALLED THE DEALER THREE MONTHS AGO TO HAVE THE RECALL REPAIR COMPLETED ON THE VEHICLE AND WAS RECENTLY ADVISED THAT THE PARTS WERE STILL UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "08/05/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS AND COMING TO A STOP TO MAKE A TURN, A LOUD ABNORMAL NOISE EMITTED FROM THE FRONT END OF THE VEHICLE. ADDITIONALLY, THE STEERING WHEEL BEGAN TO VIBRATE. THE CONTACT STATED THAT THE PART NEEDED FOR NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/11/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM 2500.  CONSUMER WRITES IN REGARDS TO THE DEFECTIVE TIE ROD ASSEMBLY RECALL REPAIRS.  *SMD  THE CONSUMER STATED HE CALLED THE DEALER IN JAN 2014, TO MAKE AN APPOINTMENT TO HAVE THE DEFECTIVE TIE ROD REPLACED. HOWEVER, HE WAS PLACED ON A WAITING LIST, BECAUSE THE PARTS WERE NOT AVAILABLE. AS OF JULY 11, 2014, THE CONSUMER IS STILL ON THE WAITING LIST. *JB",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2014",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619501,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE DEALER STATED THAT THE PART NEEDED FOR THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619556,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A RECALL NOTICE FOR OUR 2010 DODGE RAM 2500 TRUCK THE END OF DECEMBER 2013. IT STATED THE LEFT TIE ROD BALL STUD MAY BE FAULTY. WE HAVE BEEN TRYING TO HAVE IT REPLACE AS INSTRUCTED SINCE 1/6/14 WITH NO LUCK. THE DEALERS IN WICKENBURG AND AVONDALE, ARIZONA STATE THE PARTS ARE NOT AVAILABLE. WE HAVE BEEN WAITING 8 MONTHS TO HAVE THE PROBLEM ADDRESSED. IF SOMETHING HAPPENS DUE TO THE SHORTAGE OF PARTS WE WILL FOLLOW UP WITH LEGAL ACTION AS IT LOOKS LIKE IT WILL BE OUR ONLY CHOICE AS THE MANUFACTURES IS NOT MAKING PARTS AVAILABLE IN A TIMELY MANNER.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON ALBERT PIKE (GARLAND COUNTY ARKANSAS) WHEN I LOST CONTROL OF THE STEERING AND RAN OFF THE ROAD OVER THE SIDEWALK.  I PROMPTLY CALLED THE DEALERSHIP ([XXX]) AND FOUND OUT THERE WAS A RECALL NOTICE ON THE TIE ROD END.  WHICH I NEVER RECEIVED.  THE DEALERSHIP TOWED THE VEHICLE IN AND IT WAS REPAIRED A COUPLE DAYS LATER.  IN JUNE OF 2014 I WAS DRIVING DOWN 70 EAST (GARLAND COUNTY ARKANSAS) AND STARTED TO LOOSE THE ABILITY TO STEER PROPERLY BECAUSE OF A MASSIVE WOBBLE IN THE FRONT END.  I TOOK THE TRUCK INTO AMERICA TIRE AND WHEELS.  THEY PUT THE TRUCK ON THE LIFT AND THE FRONT WHEELS WERE SO LOOSE THAT YOU COULD WOBBLE THE TIRE BACK AND FORTH APPROX. THREE INCHES.  I AGAIN TOOK MY TRUCK TO [XXX] TO FIND OUT THERE WAS A RECALL ON THE RECALL.  ONCE AGAIN, WE NEVER RECEIVED ANY NOTIFICATION.  AT THIS TIME I HAD NEW SET OF TIRES WHICH HAD 14000 MILES ON THEM AND THE RIGHT FRONT WAS WORN THROUGH THE WEAR BARS AND THE LEFT FRONT WAS SEVERELY CUPPED.  I SPOKE WITH THE DODGE CUSTOMER SERVICE AND THE DEALERSHIP AND THEY REFUSED TO REPLACE OR PROVIDE ANY COMPENSATION FOR THE TIRE.  THEY SAID THE FRONT RECALLS HAD NOTHING TO DO WITH THE TIRE WEAR.  THEY. DODGE, HAD ALREADY PUT MY LIFE AND THE LIFE'S OF OTHERS IN JEOPARDY, BY THIS ISSUE AND BY NOT  NOTIFYING US OF THE TWO RECALLS UNTIL AFTER THERE WAS AN INCIDENT.  I FEEL LIKE THE MANUFACTURER AND THE DEALER, THERE DIRECT REPRESENTATIVE, SHOULD BE HELD RESPONSIBLE AND ARE LIABLE FOR ALL REPAIRS INVOLVED WITH THIS RECALL.  I COULD HAVE BEEN KILLED OR KILLED SOMEONE ELSE.  DODGE NEEDS TO BACK THE PRODUCTS THEY ARE SELLING TO THE PUBLIC.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).   *TR",
        "vin": "3D73Y3CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617705,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING); HOWEVER, THE DEALER STATED THAT THE PARTS NEEDED FOR THE REPAIR WERE UNAVAILABLE. THE CONTACT CALLED FOR MONTHS, BUT WAS UNABLE TO RECEIVE CONFIRMATION FROM THE DEALER AS TO WHEN THE PARTS WOULD ARRIVE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.    UPDATED 10/7/14*CN  UPDATED 11/18/14",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/27/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616875,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE REVERSING, THE VEHICLE BECAME DIFFICULT TO STEER.  THE VEHICLE WAS TOWED TO A LOCAL MECHANIC WHO STATED THAT THE LEFT TIE ROD FAILED.  THE MANUFACTURER WAS CONTACTED.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 67,000.",
        "vin": "3D7TT2HTXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609947,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART TO DO THE REPAIRS WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7LT2ET3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609651,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) HAD EXCEEDED THE REASONABLE AMOUNT OF TIME FOR REPAIR. THE DEALER STATED THE PART WAS NOT AVAILABLE FOR REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE DELAY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NO EXPERIENCED THE FAILURE.",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "03/05/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609320,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED FIRST NOTICE OF LEFT TIE ROD BALL STUD (RECALL N49) RECALL IN EARLY MARCH 2014.  SCHEDULED AND TOOK VEHICLE INTO DEALERSHIP FOR REPAIRS.  WHEN BROUGHT IN FOR REPAIRS, I WAS TOLD THE REPLACEMENT PART HAS BEEN RECALLED AGAIN AND DODGE WAS WAITING FOR NEW PARTS.  HAVE CALLED AND CHECKED EVERY 1-2 WEEKS ON STATUS WITH LITTLE OR NO INFORMATION JUST SAYING THEY ARE WAITING FOR PARTS AND THEY ARE ONLY GETTING ONE PART EVERY 7 DAYS AND WE ARE ON THE LIST...NOT RELEASING WHERE ON THE LIST, HOW MANY ARE ON THE LIST OR WHEN I CAN EXPECT THE SERVICE.  DODGE HAS TOLD ME THE TIE ROD IS BAD AND THAT THEY CANNOT GUARANTEE MY SAFETY OR RECOMMEND THE USE OF MY TRUCK.  THIS VEHICLE IS USED FOR CONSTRUCTION AND PERSONAL USE, INCLUDING HAULING AND TOWING AND I DO NOT FEEL SAFE DRIVING IT ON THE ROAD, FOR EITHER MYSELF, FAMILY OR OTHER PEOPLE.  THIS IS THE ONLY VEHICLE I HAVE FOR WORK, AND CANNOT AFFORD ANOTHER TEMPORARY VEHICLE.  *TR",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609342,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) IN DECEMBER OF 2013. THE CONTACT MENTIONED THAT A SECOND NOTIFICATION WAS RECEIVED IN JULY OF 2014. THE CONTACT STATED THAT THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE AND ONLY ONE PART WAS BEING RECEIVED EVERY THREE MONTHS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 09/09/14*LJ",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "11/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608926,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED RECALL NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) HAD EXCEEDED THE REASONABLE AMOUNT OF TIME FOR REPAIR. THE DEALER STATED THAT THE PART WAS NOT AVAILABLE FOR REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE DELAY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED THE FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609037,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER 13V528000 (STEERING). THE CONTACT STATED THAT SHE HAD CONTACTED THE DEALER AND THE MANUFACTURER NUMEROUS TIMES AND THEY WERE NOT ABLE TO PROVIDE A TIME FRAME FOR WHEN THE PARTS WOULD BE AVAILABLE FOR THE REPAIRS.  THE REPAIR WAS NOT TAKEN CARE OF IN A REASONABLE AMOUNT OF TIME. CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D73Y3HL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "05/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608558,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) HOWEVER, THE PART TO DO THE REPAIRS WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D73Y4CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607962,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECEIVING THE RECALL ON THE LEFT TIE ROD END FOR MY TRUCK, I TOOK THE TRUCK TO THE DEALER AND WAS TOLD THEY DID NOT HAVE GUIDANCE AS TO WHAT TO DO YET SO I SHOULD BRING THE TRUCK BACK.  A FEW WEEKS LATER, I RETURNED AND WAS TOLD THAT THEY WOULD ORDER THE PART, BUT THEY WERE ONLY ALLOWED TO ORDER 1 PER WEEK AND IT MAY BE MONTHS OR YEARS BEFORE MY PARTS SHOWED UP.  PART ORDER WAS PLACED IN MARCH OF 2014.  IT IS NOW JULY OF 2014 AND THE REPAIR HAS STILL NOT BEEN MADE.  IT WOULD APPEAR TO ME THAT AN \"IMPORTANT SAFETY RECALL\" WOULD BE HANDLED IN A MORE TIMELY MANNER.   *TR",
        "vin": "3D7UT2HLXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V58000 (STEERING). THE CONTACT STATED THAT THE REPAIR HAD EXCEEDED A REASONABLE AMOUNT OF TIME. THE DEALER STATED THAT THE PARTS WERE UNAVAILABLE TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607269,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NO INCIDENT, JUST A QUESTION OF CONCERN.  WE HAVE RECEIVED SEVERAL NOTICES OF A RECALL FOR OUR 2010 3/4 TON TRUCK, BUT THE DEALERSHIPS (2! BOTH GLENWOOD SPRINGS AND GRAND JUNCTION) STATE THEY CANNOT GET THE PARTS AND HAVE ON US A WAITING LIST.  WHAT THE HECK??!!  IT HAS BEEN 7 MONTHS!  IF A RECALL ABOUT THE STEERING IS IN PLACE, WHY IS THERE NO PREPARATION AND WAY TO RESOLVE THIS?  AND WE HAVE HAD TO HAVE OUR STEERING WORKED ON BEFORE, BUT NOT CORRECTING THIS RECALL.  SO, NOW WHAT HAPPENS IF THE STEERING FAILS AND I AM STILL ON THE LIST?  WHO IS RESPONSIBLE?  I TRIED TO DO THE RIGHT THING BUT APPARENTLY THE SHORTAGE OF PARTS IS CREATING ANOTHER HAZARD.  I CERTAINLY DON'T WANT TO BE CRUISING DOWN I-70 AT 75 MPH AND THE STEERING FAILS!    ONE OF THE DEALERSHIPS STATED THEY GET 2 REPAIR KITS A MONTH AND THIS MAY TAKE 1-2 YEARS TO GET THRU THE WAITING LIST FOR THE REPAIR.  THIS CANNOT BE RIGHT!  *TR",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607317,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) HOWEVER, THE CONTACT WAS NOT ABLE TO HAVE THE VEHICLE SERVICED UNDER THE RECALL BECAUSE THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE REMEDY PART TO BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7LT2ET8AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607460,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED SAFETY RECALL N49/NHTSA 13V-529 FOR THE LEFT TIE ROD OF MY DODGE RAM IN EARLY JANUARY OF THIS YEAR.  CALLED LOCAL DEALER YAKIMA CHRYSLER DODGE JEEP RAM (509-248-1300) BEGINNING 1/6/14 AND WAS TOLD THE NECESSARY REPAIR PARTS HAD NOT BEEN SUPPLIED BY CHRYSLER AND TO CALL BACK THE FOLLOWING WEEK.  THE NEXT WEEK WHEN I CALLED I RECEIVED THE SAME INFORMATION.  THIS WENT ON FOR SEVERAL MORE WEEKS UNTIL I GAVE UP MY WEEKLY CALLS.  I CALLED THE DEALER AGAIN IN APRIL OF THIS YEAR AND WAS TOLD CHRYSLER WAS ONLY SUPPLYING ONE SET OF PARTS ON THIS RECALL A WEEK AND THAT I COULD BE ADDED TO A LIST AND WOULD BE CALLED WHEN THE PARTS WERE AVAILABLE FOR MY REPAIR.  AT THAT TIME THEY ADVISED THERE WERE APPROXIMATELY 50 OTHERS AHEAD OF ME ON THE LIST.  HAVE HEARD NOTHING SINCE THAT TIME BUT TODAY RECEIVED ANOTHER NOTICE ON THE RECALL FROM CHRYSLER, APPARENTLY TO REMIND ME THAT I HAVE NOT HAD THE WORK DONE, DESPITE THE FACT THAT THEY ARE NOT PROVIDING THE APPROPRIATE PARTS TO THEIR DEALERS TO PERFORM THE REPAIR.  *TR",
        "vin": "3D7UT2CL0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED THE RECALL NOTIFICATION RELATED TO NHTSA CAMPAIGN ID NUMBER 13V528000 (STEERING). THE CONTACT STATED THAT THE REPAIR WAS NOT TAKEN CARE OF IN A REASONABLE AMOUNT OF TIME. THE DEALER INDICATED PARTS WERE NOT AVAILABLE. CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT CONTACTED.",
        "vin": "3D7TT2CT5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606467,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE DEALER INFORMED THAT ONE REMEDY PART WAS BEING SENT EVERY SIXTY DAYS. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE REMEDY PART TO BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL0AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE KEEP RECEIVING NOTIFICATIONS OF RECALLS.  WE HAVE CONTACTED A DEALER TO HAVE REPAIRS DONE.  FOR APPROX 6 MONTHS, WE HAVE BEEN ON A LIST FOR THE DEALER TO GET PARTS.  THEY SAY THEY CANT GET ANY PARTS. WE PULL A CATTLE TRAILOR WITH THIS TRUCK AND ARE WORRIED ABOUT AN ACCIDENT. WHY ARE WE NOT ABLE TO GET PARTS TO FIX?  *TR",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "02/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606093,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED TWO RECALL NOTIFICATIONS OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) AND STATED THAT THE PART NEEDED TO SERVICE THE VEHICLE UNDER THE RECALL WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE REMEDY PART TO BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2HL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING). HOWEVER, THE PART TO DO THE REPAIRS WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606181,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF A RECALL AND CONTACTED THE DEALER TO SCHEDULE REPLACEMENT OF THE LEFT TIE ROD END UNDER RECALL N49/NHTSA 13V-529 AND WAS PUT ON THE LIST FOR THE REPAIR, NOW I HAVE RECEIVED A SECOND NOTICE FOR THE SAME RECALL AND WHEN I CONTACT THE DEALER THEIR RESPONSE IS THEY ARE HAVING TROUBLE ACCESSING THE PARTS FROM DODGE. THIS IS UNACCEPTABLE THE DEALER ALSO STATED THAT THIS IS A PROBLEM THREW OUT THE DEALER NETWORK. NOBODY CAN GET THE TIE ROD END FOR THE LEFT SIDE. THIS SHOULD BE A PRIORITY FOR ALL INVOLVED AND NEEDS TO BE RESOLVED. A VERY SERIOUS SAFETY ISSUE!  *TR",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL FOR THIS VEHICLE IN JANUARY ABOUT A TIE ROD BALL STUD. IT SAYS \"THIS COULD CAUSE LOSS OF DIRECTIONAL CONTROL AND/OR CRASH WITHOUT WARNING. NOW THAT SOUNDS KIND OF SERIOUS TO ME SO I CALLED THE DEALER AND THEY SAID THEY DIDN'T HAVE THE PARTS TO MAKE THE REPAIR YET. SO I'VE CALLED EVERY 6-8 WEEKS TO SEE IF THEY HAVE THE PARTS AND THEY STILL DON'T. I HAVE MOVED FROM 8TH TO 5TH ON THE WAITING LIST IN 6 MONTHS SO THAT CERTAINLY MAKES ME FEEL BETTER. AT THIS RATE I SHOULD HAVE MY POTENTIAL \"CRASH WITHOUT WARNING\" PROBLEM RESOLVED ABOUT NEXT JULY.....IF I HAVEN'T \"CRASHED WITHOUT WARNING\". THE DEALER DOESN'T SEEM TO BE THE PROBLEM......IT SEEMS TO BE CHRYSLER. SO, WHAT TO I DO NOW????  *TR",
        "vin": "3D7LT2ETXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606051,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THEY TELL US NOW THAT THEY HAVE NO IDEA WHEN THEY CAN REPLACE OUR TIE ROD,  IT FIRST WAS RECALLED LAST DEC. 2013.  IT IS NOW JUNE 25, 2014.  I WOULD THINK IT SHOULD HAVE BEEN REPLACED BY NOW.  OR DODGE SHOULD NOT BE ALLOWED TO MAKE ANYMORE CARS, UNTIL THESE VEHICLES ARE REPAIRED.  *TR",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605735,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2014 WE RECEIVED A RECALL NOTICE FOR OUR DODGE RAM 2500.  WE TOOK THE LETTER TO OUR LOCAL DODGE DEALER, MARSHALL MOTORS, IN SALINA, KS TO VERIFY THAT OUR VEHICLE NEEDED THE REPAIR WORK INDICATED.  THE EMPLOYEE SAID IT DID AND THAT SHE WOULD KEEP OUR NOTIFICATION LETTER AND A PHONE NUMBER AND CALL US WHEN THE PART CAME IN TO SCHEDULE AN APPOINTMENT.  WE'VE WAITED AND WAITED AND I CALLED AGAIN ON JUNE 23, 2014 AND WAS TOLD THAT THE PART/PARTS NEEDED WERE STILL ON BACK ORDER FROM CHRYSLER AND THEY WOULD CALL US WHEN THEY RECEIVED THEM TO SCHEDULE AN APPOINTMENT.  I FIND THIS RIDICULOUS AS IT HAS BEEN 3 MONTHS SINCE WE RECEIVED THE FIRST NOTICE OF RECALL.  IF THERE IS INDEED SOMETHING THAT NEEDS FIXED ON OUR VEHICLE WE FEEL IT NEEDS TO BE TAKEN CARE OF FOR THE SAFETY OF OUR FAMILY.  WHAT HAPPENS IF THIS PART DOES CAUSE AN ACCIDENT WHILE WE'RE WAITING FOR THE BACK ORDERED PART?  CONCERNED AND FRUSTRATED.  THANK YOU.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605111,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE RECALL N49/NHTSA 13V-529 .HAVE HAD THIS NOTICE SINCE JANUARY 2014 AND NOW HAVE RECEIVED THE SECOND NOTICE. I WOULD LIKE TO KNOW WHY DODGE/CHRYSLER IS HAVING SUCH A HARD TIME IN PRODUCING REPLACEMENT PARTS FOR THIS RECALL. I  CONTACTED 2 DEALERS WHILE IN FLORIDA (JAN-APRIL2014) AND MY LOCAL DEALER WHEN I RETURNED. SAME ANSWER NO PARTS AVAILABLE. WE ARE RETIRED AND TRAVEL WITH A 5TH WHEEL TRAILER, ANY INFO WOULD BE APPRECIATED.  *TR",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED 2 NOTICES OF RECALL AND TAKEN THE TRUCK TO THE DEALER, BUT PARTS ARE NOT AVAILABLE FOR THIS RECALL N49 / NHTSA13V-529.  I HAVE CALLED CHRYSLER AND THEY HAVE SAID PARTS ARE NOT AVAILABLE OR SEVERELY LIMITED AND RATIONED.  *TR",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "05/20/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DODGE RAM WAS CHECKED BY THE DEALERSHIP THAT HAS NOT BEEN ABLE TO SUPPLE THE RECALL PARTS (RECALL N 49) SINCE THE DATE OF RECALL (DECEMBER 2013).  I CALLED EVERY MONTH FOR AN APPOINTMENT AND ONLY ON THE LAST CALL DID THE LOCAL DEALERSHIP TELL  ME THE FIRST TIME THEY COULD SUPPLY THE RECALLED TIE RODS ON MAY 29.  CONSEQUENTLY, I TOOK THE TRUCK TO BE INSPECTED  BY THE LOCAL DEALERSHIP FOR THE TIE ROD PROBLEM ON 5/14/2014 BECAUSE, AS I TOLD THEM, I PLANNED TO DRIVE 10 HOURS FROM SANTA FE NM (HOME) TO FT COLLINS CO PULLING A HORSE TRAILER WITH TWO VALUABLE HORSES AND DID NOT WANT ANYTHING TO HAPPEN.  THE TIE ROD BROKE AS I WAS BACKING UP TO ATTACH THE HORSE TRAILER FOR THE HOMEWARD BOUND TRIP.  TEN MINUTES LATER AND WE WOULD HAVE ALL BEEN DEAD.  THANK GOODNESS THE FT COLLINS DEALERSHIP DID HAVE THE NEW TIE RODS IN REPLACEMENT BUT I BELIEVE THE SANTA FE LITHIA DEALERSHIP WAS MUCH REMISS IN NOT OBTAINING THE REPLACEMENT PARTS FOR ITS LOCAL CUSTOMERS AND CLEARING THE TRUCK FOR A LONG ROAD TRIP.  *TR",
        "vin": "3D7TT2CT8AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595936,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UP COUNTRY ROAD AT 45 MPH IN MY DODGE RAM 2500 DIESEL, WITH ONLY 40K MILES ON IT.  ALL OF A SUDDEN, DEATH WOBBLE HITS.  NO ABILITY TO STEER AND NO BRAKES.  RIGHT WHEEL GETS JAMMED INTO FRAME OF TRUCK AT 45MPH AND CAN'T SPIN SO VIOLENT AND UNCONTROLLABLE SHAKING.  EVIDENCED BY TIRE MARKS ON THE FRAME OF MY TRUCK.  HAVE PHOTOS.  SENDS ME UP THE SIDE OF THE ROAD, AND ALMOST FLIPS THE TRUCK UPSIDE DOWN. MANAGED TO GET TRUCK UNDER CONTROL, BY SLAMMING ON MY BRAKES,  IN ONCOMING TRAFFIC, MY DOG HITS THE WINDSHIELD. POLICE OFFICER WAS RIGHT BEHIND ME AND WITNESSED THE ENTIRE EVENT, TOLD ME I WAS LUCKY TO BE ALIVE.  WHEN I CALLED DODGE THEY DENIED EVERYTHING.  LOOKED UP INTERNET AND FOUND \"DEATH WOBBLE\" WHICH IS EXACTLY WHAT TRANSPIRED WITH THE TRUCK.  FORTUNATELY AT THE TIME I WAS NOT HAULING MY HORSE TRAILER OR ALL WOULD HAVE BEEN DEAD.   DAMAGES TO DATE SO FAR IS 8K, INCLUDING FRAME, FRONT BUMPER, FRONT SUSPENSION, STEERING, FRONT AXLE ASSEMBLY.  THIS IS ABSOLUTELY OUTRAGEOUS FOR A TRUCK THAT ONLY HAS 40K MILES.  *TR",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT SHE ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING). THE CONTACT STATED THAT SHE WAS MADE AWARE THAT PARTS WERE NOT AVAILABLE AS A RESULT REPAIRS WERE UNABLE TO BE PERFORMED FOR THE RECALL. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED ANY FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "03/15/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594437,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2010 DODGE RAM CUMMINGS 2500 ON 06/20/2011. WEEKS INTO MAKING THE PURCHASE WE  STARTED HAVING ENGINE PROBLEMS. SUCH AS A CLOGGED FUEL FILTER, EGR VALVE, THE IGNITION KEY SWITCH, TRUCK WOULD NOT START WITH TURN OF THE KEY, YOU HAD TO WIGGLE KEY INSIDE IGNITION TO START TRUCK. THE CHECK ENGINE LIGHT IS ALWAYS ON, RECENTLY THE MESSAGE PANEL DISPLAYED EXHAUST IS 90% FULL. THE TRUCK WAS GOING ABOUT 5 MILES PER HOUR. AND RECENTLY IT TURNED OFF ON THE WAY HOME BARELY AVOIDING GETTING HIT BY ON COMING TRAFFIC. WE ALSO REPLACED THE WATER PUMP, THE BELT TENSIONER, AND IT HAD AC COILS CLOGGED. PAINT ALSO STARTED CHIPPING IN SOME AREAS.   *TR",
        "vin": "3D7TP2CL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/19/2014",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NHTSA RECALL CAMPAIGN NUMBER 13V529000 (STEERING); HOWEVER, THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE DELAY. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2HL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/19/2014",
        "dateOfIncident": "12/11/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*   THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER 13V529000 (STEERING).  THE CONTACT WAS INFORMED THAT THE PARTS FOR THE RECALL REMEDY WERE UNAVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME TO PERFORM THE RECALL REPAIR.  THE VEHICLE HAD NOT EXPERIENCED A FAILURE.      UPDATED 8/19/14*CN",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592144,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN WAITING FOR PARTS TO MAKE THIS REPAIR SINCE PUT ON THE LIST AT PRO JEEP/DODGE THORNTON, COLO. (NOW LARRY H. MILLER DODGE) ON 01/07/2014. I HAVE REPEATEDLY CONTACTED THE DEALER & CHRYSLER/DODGE AND AM GIVEN THE RUN AROUND EACH TIME AND AM NO CLOSER TO REPAIRS THAN I WAS 6 MONTHS AGO. DODGE KNEW THIS WAS A PROBLEM SINCE 2008 YET CONTINUED TO SELL THESE TRUCKS WITHOUT NOTIFYING CUSTOMERS OF THE PROBLEM. WAS SOLD AN UNSAFE VEHICLE.   *JS",
        "vin": "3D7TT2CT0AG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588398,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTACTED DEALER VEHICLE PERCHED SHEPHERD TEAM AUTO PLAZA, 1819 SOUTH MAIN, FORT SCOTT KANSAS 66701 (888-211-6244) WEEKLY SINCE FEB. 1, 2014 AND THEY CAN'T PROVIDE THE SERVICE FOR THE RECALL N49. MANY EXCUSES EVEN AFTER MY PERSISTENCE.  *TR",
        "vin": "3D7TT2CT6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "12/06/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587101,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) BUT WAS ADVISED BY THE DEALER THAT THE PARTS NEEDED TO COMPLETE THE REPAIR WERE NOT AVAILABLE. THE CONTACT HAD BEEN WAITING MONTHS TO HAVE THE RECALL SERVICE. THE MANUFACTURER WAS ALSO CONTACTED AND COULD NOT PROVIDE A REASONABLE DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.    UPDATED 7/25/14*CN",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT HE ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER:13V529000 (STEERING) BUT WAS MADE AWARE THAT THE PARTS WERE NOT AVAILABLE. THE REPAIRS WERE UNABLE TO BE PERFORMED FOR AND THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585250,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) AND STATED THAT THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE DEALER AND MANUFACTURER STATED THAT ONE REMEDY PART WOULD BE RECEIVED EVERY TWO WEEKS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 06/10/14 MA",
        "vin": "3D7TT2CT8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/27/2014",
        "dateOfIncident": "04/26/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM EXTREMELY CONCERNED ABOUT THE RECALL ON THE LEFT TIE ROD BALL STUD ON THIS TRUCK. WE RECEIVED THE RECALL NOTICE THE LAST WEEK IN DECEMBER 2013.  HOWEVER, IT STATED TO CALL OUR DODGE DEALER STARTING JANUARY 6TH! THIS RECALL COULD CAUSE A LOSS OF DIRECTIONAL CONTROL AND/OR CRASH WITHOUT WARNING. WHEN WE CALLED THE DEALER, THEY COULDN'T EVEN FIX THE RECALL BECAUSE THEY DIDN'T HAVE THE PARTS AND THERE WAS A WAITING LIST! IT IS THE END OF APRIL AND WE ARE STILL WAITING FOR THIS SERIOUS RECALL TO BE FIXED.  SHAME ON YOU CHRYSLER FOR TAKING SO LONG.   *TR",
        "vin": "3D7UT2HL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579146,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT RECEIVED A RECALL NOTIFICATION RELATED TO NHTSA CAMPAIGN ID NUMBER 13V529000(STEERING) BUT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE CURRENT MILEAGE WAS 180,000. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "01/12/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578154,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR ON THE VEHICLE. THE DEALER INFORMED THE REMEDY PART WAS IN THE PROCESSING OF BEING REDESIGNED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL0AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "02/24/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578336,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIMES I'VE LOST CONTROL OF THIS TRUCK AT RELATIVELY LOW SPEEDS AND NORMAL DRIVING CONDITIONS.  THE TRUCK WOULD GO INTO A RIGHT SKID AND FISHTAIL.  TWICE THE ROAD WAS DRY, ONCE THE ROAD WAS WET.  EACH TIME I WAS ABLE TO RECOVER BEFORE HITTING SOMETHING OR EXITING THE ROADWAY HOWEVER I USED BOTH LANES OF TRAFFIC TO RECOVER.  TWICE I LOST CONTROL WHILE ACCELERATING NORMALLY AFTER SLOWING FOR A CURVE OR OTHER SITUATION.  I HAD SLOWED TO ABOUT 40 AND WAS ACCELERATING BACK TO THE SPEED LIMIT OF 60.  INCIDENT OCCURRED AT ABOUT 50.  LOSS OF CONTROL CAME SUDDENLY LIKE THE FRONT OF THE VEHICLE TOOK A SHARP BID TO THE LEFT ON ITS OWN.  ONCE WAS AFTER HITTING SOME WASHBOARD TYPE BUMPS IN THE ROAD WHICH CAUSED THE BACKEND TO BOUNCE TO THE RIGHT AND BEGIN TO SKID.  I INSPECTED AND DON'T SEE ANYTHING OBVIOUSLY LOOSE OR BROKEN.  POSSIBLE RELATED ISSUES: A SLIGHT BUMP IS OFTEN FELT IN THE STEERING WHEEL AND ACCELERATOR PEDAL.  TRUCK IS UNDER RECALL N49 FOR A TIE ROD ISSUE.  BUT I DON'T SEE ANY SIGN THAT THE TIE ROD IS LOOSE ALTHOUGH THE U-BOLTS THAT HOLD THE DAMPER TO THE TIE ROD MAY BE SLIPPING.  *TR",
        "vin": "3D7TT2CT4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578356,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) HOWEVER, THE CONTACT WAS UNABLE TO HAVE THE VEHICLE REPAIRED BECAUSE THE PART NEEDED WAS UNAVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "11/14/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577848,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT HE ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER:13V529000. THE CONTACT STATED THAT HE WAS MADE AWARE THAT THE PARTS WERE NOT AVAILABLE AND AS A RESULT THE RECALL REPAIRS WERE NOT PERFORMED. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "04/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT HE ATTEMPTED TO HAVE HIS VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) BUT WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE AND THAT THE DEALERS WERE RECEIVING ONE PART PER WEEK. THE CONTACT STATED THAT SINCE THE FAILURE WAS REPORTED IN NOVEMBER OF 2013, THERE SHOULD BE A REMEDY AVAILABLE BEFORE APRIL OF 2014. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE TIME FOR REPAIR.  THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577226,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER:13V529000 (STEERING) BUT WAS ADVISED BY THE DEALER THAT THE PARTS NEEDED TO COMPLETE THE REPAIR WERE NOT AVAILABLE. THE CONTACT RECEIVED THE NOTICE MONTHS AGO. THE MANUFACTURER WAS ALSO CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576846,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY CONCERNED THAT CHRYSLER HAS ISSUED A RECALL FOR THE LEFT TIE ROD AND STATE IN THE RECALL THAT THE TIE ROD COULD FRACTURE AND CAUSE A LOSS OF DIRECTIONAL CONTROL AND CRASH WITHOUT WARNING, BUT THE PARTS FOR THE RECALL ARE NOT AVAILABLE. WE HAVE BEEN ON A WAITING LIST FOR 3 MONTHS AT THIS TIME. I THINK THIS SHOULD BE REVIEWED, IT SHOULD NOT REQUIRE PEOPLE TO DIE IN A CRASH BEFORE SOMETHING IS DONE. HOW CAN A COMPANY KNOW THIS PROBLEM EXISTS AND IT COULD RESULT IN FATALITY BUT IT APPEARS TO BE NO BIG DEAL THAT WE HAVE TO WAIT FOR A REPAIR PART TO BECOME AVAILABLE.  *TR",
        "vin": "3D7UT2CL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "01/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575819,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT HE RECEIVED RECALL NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) IN JANUARY. THE CONTACT ATTEMPTED TO GET THE VEHICLE REPAIRED ON NUMEROUS OCCASIONS BUT THE PARTS WERE UNAVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THERE ARE NO FAILURES AT THIS TIME. THE VIN WAS UNAVAILABLE.    UPDATED 5/19/14*CN  UPDATED 6/06/17*CN",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575871,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT SHE ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 11V350000. THE CONTACT STATED THAT SHE WAS MADE AWARE THAT PARTS WERE NOT AVAILABLE AS A RESULT REPAIRS WERE UNABLE TO BE PERFORMED FOR THE RECALL. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. UPDATED 06/17/14 MA",
        "vin": "3D7UT2HL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575328,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED RECALL NOTIFICATION NHTSA CAMPAIGN ID NUMBER OF 13V529000 (STEERING) AND STATED THAT THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7TT2HT7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2014",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575324,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED RECALL NOTIFICATION NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING); HOWEVER, THE CONTACT WAS UNABLE TO HAVE THE VEHICLE SERVICED UNDER THE RECALL BECAUSE THE PART NEEDED WAS UNAVAILABLE. THE DEALER STATED THAT ONE REMEDY PART PER WEEK WAS BEING SENT TO SERVICE THE VEHICLES. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7TT2CT4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "03/27/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT HE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER 13V529000 (STEERING) AND WAS INFORMED BY THE MANUFACTURER THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575204,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 13V529000(STEERING) HAD EXCEEDED A REASONABLE TIME FOR  REPAIR. THE CONTACT RECEIVED THE RECALL LETTER DECEMBER 2013. THE DEALER ADVISED THAT THE REPAIR KIT WAS RECEIVED ONCE PER WEEK AND THEY WOULD CONTACT HIM WHEN THE PART BECAME AVAILABLE. THE CONTACT HAD NOT EXPERIENCE A FAILURE.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/26/2014",
        "dateOfIncident": "03/24/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574927,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL N49/ NHTSA 13V-529  TOOK TO DEALER FOR RECALL AND THEY TOLD ME THAT MY TRUCK HAS BAD PARTS NEED TO BE REPLACED , THEN TOLD ME THAT IT WOULD BE 2-3 MONTHS BEFORE THEY CAN GET THE PARTS TO FIX TRUCK , FILED A COMPLAINT WITH DODGE AND STILL WAITING FOR THE CALL TO FIX TRUCK , I DO NOT FEEL SAFE DRIVING IT MT STEERING IS NOT WORKING CORRECTLY AND THE JUST SAID DRIVE IT OR DONT THATS ALL WE CAN SAY .   *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574725,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER:13V529000 (STEERING) AND STATED THAT THE PARTS WERE NOT AVAILABLE. THE DEALER DID NOT GIVE A SPECIFIC DATE WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS ALSO CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "03/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574014,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED IN DECEMBER 2013, SHE RECEIVED RECALL NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING). THE CONTACT STATED SHE ATTEMPTED TO HAVE THE VEHICLE SERVICED ON NUMEROUS OCCASIONS, BUT THE PARTS WERE UNAVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCE THE FAILURE.  THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.  UPDATED 05/12/2014*LJ  *TR",
        "vin": "3D7UT2CL0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/05/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573344,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) AND STATED THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE PART. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "12/12/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573358,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) HOWEVER, THE CONTACT WAS NOT ABLE TO HAVE THE VEHICLE SERVICED BECAUSE THE PART WAS UNAVAILABLE. THE DEALER ADVISED THAT THE VEHICLE NOT BE DRIVEN. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573572,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING)  AND STATED THAT THE PARTS WERE STILL NOT AVAILABLE. THE DEALER DID NOT GIVE A SPECIFIC DATE WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS ALSO CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIRS. THE CONTACT WAS EXPERIENCING A LOUD NOISE COMING FROM THE FRONT DRIVERS SIDE OF THE VEHICLE MORE THAN ONCE. THERE THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "03/12/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569379,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE DRIVING 3 MPH, HE HEARD A LOUD NOISE AS THE VEHICLE CAME TO A COMPLETE STOP. THE CONTACT MENTIONED THAT AFTER INSPECTING THE VEHICLE HE NOTICED THAT THE TIE ROD WAS FRACTURED AND BECAME JAMMED AGAINST THE FRONT DRIVER'S SIDE TIRE. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE TECHNICIAN VERIFIED THE FAILURE AND STATED THAT THE TIE ROD NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 84,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "12/27/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568952,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS BEEN RECALLED FOR TIE ROD END MALFUNCTION, NOTIFICATION N49.  THE LEFT TIE ROD END CAN SIMPLE BREAK IN HALF WITHOUT WARNING, A VERY DANGEROUS SITUATION.  I HAVE CONTACTED 2 DEALERSHIPS FOR SERVICE ON THIS RECALL; ADDYS DODGE IN MYRTLE BEACH ON DECEMBER 27 2013, AND BURGLUND DODGE ROANOKE VA MARCH 10 2014.  I HAVE BEEN PUT ON WAITING LISTS WAITING FOR THE PARTS AT BOTH DEALERSHIPS,.  NOTE I HAVE BEEN WAITING FOR NEARLY 3 MONTHS SINCE I 1ST CONTACTED ADDY DODGE.  ADDY DODGE TOLD ME IT WOULD BE A VERY LONG WAIT, THAT THERE ARE ONLY 1 OR 2 SETS OF PARTS AVAILABLE EACH WEEK.  NOTE THAT I HAVE NOT HAD AN ACCIDENT, THE TIE ROD END HAS NOT BROKEN.  AND THIS IS NOT A COMPLAINT AGAINST THE DEALERSHIPS, THE COMPLAINT IS AGAINST DODGE FOR NOT HAVING THE PARTS AVAILABLE.  I, AS MANY OTHER PEOPLE, AM CURRENTLY DRIVING THE TRUCK WITH THE DEFECT BECAUSE PARTS ARE NOT AVAILABLE TO FIX THE RECALL.  WHAT GOOD IS A RECALL IF THERE ARE NO PARTS TO FIX THE RECALL?  *TR",
        "vin": "3D7LT2ET0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568473,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM 2500.  CONSUMER WRITES IN REGARDS TO LEFT TIE ROD RECALL NOTICE ISSUES.  *SMD  THE CONSUMER CALLED THE DEALER IN DECEMBER 2013, ABOUT THE RECALL, AND WAS PLACED ON A WAITING LIST. THE CONSUMER CALLED THE DEALER, IN MARCH 2014 AND WAS INFORMED THEY ONLY RECEIVED 2 TIE ROD ENDS SINCE THE RELEASE OF THE CAMPAIGN AND THERE WAS NO ETA FOR ADDITIONAL PARTS. *JB",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568460,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM.  CONSUMER WRITES IN REGARDS TO LEFT TIE ROD RECALL NOTICE PROBLEMS.  *SMD  THE CONSUMER WAS INFORMED, THE PART HAD NOT BEEN MANUFACTURED YET.",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568484,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT RECEIVED A RECALL NOTIFICATION RELATED TO NHTSA CAMPAIGN ID NUMBER 13V529000(STEERING) HOWEVER, THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR.  THE MANUFACTURE WAS NOT NOTIFIED.  THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2CT5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2014",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567548,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY OF 2014, CHRYSLER ISSUED A RECALL FOR DODGE RAM TRUCKS. THE ISSUE IS THE TIE ROD MAY FRACTURE, WHICH COULD CAUSE LOSS OF CONTROL. THE REPLACEMENT PART FOR THIS RECALL IS UNAVAILABLE UNTIL AUGUST 2014. THIS IS AN UNREASONABLE AMOUNT OF TIME TO OPERATE A VEHICLE WITH A POSSIBLE SAFETY ISSUE. AS A WORK TRUCK WHICH IS USED TO CARRY AND TOW HEAVY LOADS, I FEEL IT IS UNSAFE TO USE IT WITH THIS ISSUE.   *TR",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566190,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW DODGE RAM 2500 TRUCK IN 2010. I RECEIVED AN \"IMPORTANT\" SAFETY RECALL ON JAN. 10, 2014 #N49/NHTSA 13V-529 FOR MY VEHICLE VIN [XXX]. IT STATES THE LEFT TIE ROD BALL STUD MAY FRACTURE UNDER CERTAIN DRIVING CONDITIONS CAUSING A LOSS OF DIRECTIONAL CONTROL AND/OR CRASH WITHOUT WARNING. I PHONED FOWLER AUTO DODGE TRUCKS IN LAKEPORT, CA 707-263-0500 ON JAN. 20, 2014 TO ORDER THE PARTS AND/OR MAKE AN APPOINTMENT. JOHN ADVISED ME IT WILL TAKE SOME TIME BUT HE WILL CALL WHEN IT GETS IN. TODAY IS FEBRUARY 26 AND NOTHING HAS COME IN. ACCORDING TO JOHN, THE PARTS ARE BEING RELEASED SLOWLY AS THEY DON'T HAVE ENOUGH. HE STATED THEY ARE PROBABLY 2-4 MONTHS OUT UNTIL THEY GET THEM. I ASKED FOR CHRYSLER HEAD OFFICE NUMBER 1-800-992-1977 A REPRESENTATIVE STATED THIS HAS BEEN A COMMON COMPLAINT FROM CUSTOMERS THIS PAST WEEK. ADVISED ME THEY SHOULD BE AVAILABLE TO DEALERS IN \"ABOUT\" TWO WEEKS. I AM CONCERNED FOR MY SAFETY AS WELL AS OTHERS IN MY FAMILY WHEN I RECEIVE AN \"IMPORTANT\" SAFETY RECALL LIKE THIS. WHY DO A RECALL IF PARTS CAN'T BE SUPPLIED TO RECTIFY THIS PROBLEM BEFORE YOU SEND OUT THE NOTICES?  CAN YOU HELP ME?    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3D7TT2CTXAG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "02/12/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564146,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON PURCHASING THIS USED PICKUP I PERFORMED AN INSPECTION OF THE UNDER CARRIAGE I NOTICED THAT THE OIL PAN HAD A PRETTY SIGNIFICANT DENT IN IT. IT WAS OBVIOUSLY CAUSED BY A SKID PLATE THAT WAS MOUNTED ON THE FRONT AXLE OF THIS TRUCK FROM THE FACTORY. I WENT ONLINE AND FOUND MANY OWNER OF THIS MODEL HAD THE SAME ISSUE. ONE PERSON WAS SUCCESSFUL IN GETTING A DEALERSHIP TO REMOVE THE SKID PLATE AND REPLACE THE OIL PAN. THE SERVICE DEPARTMENT SAID THAT THE SKID PLATE WAS ONLY MEANT TO BE PUT ON THE GASOLINE MODELS NOT THE DIESEL MODELS. THIS IS DUE TO NOT HAVING ENOUGH CLEARANCE. THIS CAN CAUSE A HOLE IN THE OIL PAN WHICH CAN EASILY LEAD TO AN EXPENSIVE BUT NEEDLESS ENGINE FAILURE. THIS IS UNACCEPTABLE ON A TRUCK THAT COST $50000, DODGE SHOULD PERFORM THESE REPAIRS AND SKID PLATE REMOVAL FOR THESE MODELS FOR NO COST.  *TR",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564043,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 13V529000 (STEERING) AND CONTACTED THE DEALER. THE DEALER ADVISED THE CONTACT THAT THE PARTS NEEDED TO COMPLETE THE RECALL REPAIR WOULD NOT BECOME AVAILABLE FOR ANOTHER THREE MONTHS. THE CONTACT WAS ADDED TO A WAITING LIST WITH ELEVEN VEHICLES AHEAD OF HER ALSO AWAITING THE SAME RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563759,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE FIRST EXPERIENCED WHEN TAKING DAUGHTER TO DOCTOR AND THE WHOLE TRUCK WOBBLED VIOLENTLY SAID WAS POSSIBLE IT SMALL BUMP ON A LEFT TURN GOING ABOUT 45-50 MPH   TODAY 2/10/13 WAS ON WAY HOME AND WAS DOING ABOUT 50 OR SO AND ON LEFT HAND TURN HIT SLIGHT BUMP AND WHOLE TRUCK STARTED VIOLENTLY SHAKING CALLED DEALER TODAY AND TOLD THE ISSUE AND ASKED IF THIS WAS A COMMON PROBLEM AND THEY SAID NOT THAT THEY HAVE HEARD OF AND DID SOME QUICK RESEARCH JUST NOW AND FOUND THAT IT'S POSSIBLE DODGE DEATH WOBBLE AND I FEEL IF I HAD MY THREE DAUGHTERS IN TRUCK THEY WOULD HAVE BEEN FRIGHTENED AND LUCKILY I WAS I GOOD CONTROL OTHERWISE I PROBABLY WOULDN'T BE SENDING THIS NOW     THANKS FOR LISTENING HOPE DODGE MAKES THIS BETTER FROM FORUMS READ ON   DOESN'T SEEM LIKE THEY WANT OR CARE ABOUT THE ISSUE.   *TR",
        "vin": "3D7UT2HL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2014",
        "dateOfIncident": "02/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563225,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING). THE CONTACT ATTEMPTED TO HAVE THE RECALL REMEDIED BUT WAS INFORMED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7KS28T99G"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563066,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM 2500.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS FOR TIE ROD BALL STUD RECALL NOTICE.  *SMD   THE CONSUMER STATED CHRYSLER WAS ONLY SENDING ONE PART PER WEEK, PER DEALERSHIP, WITH A WAITING LIST OF 90 PEOPLE. THE CONSUMER STATED IT WOULD BE 2 YEARS BEFORE, THE RECALL WAS FIXED.",
        "vin": "3D73Y3CL9AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562123,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE PART TO BECOME AVAILABLE. THE MANUFACTURER HAD NOT BEEN MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE",
        "vin": "3D7UT28LXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561757,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER 13V529000 (STEERING) AND THE CONTACT WAS UNABLE TO HAVE THE VEHICLE SERVICED BECAUSE THE PART WAS UNAVAILABLE TO PERFORM THE REPAIR. THE DEALER INFORMED THE CONTACT THAT THE REMEDY PART WAS BEING ISSUED AS ONE PER WEEK BY THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560991,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND STATED THAT THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE PART TO BECOME AVAILABLE. THE MANUFACTURER INFORMED THE CONTACT THAT THE REMEDY PART WILL NOT BE AVAILABLE IN ONE YEAR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.    *TR",
        "vin": "3D7LT2EL3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2014",
        "dateOfIncident": "01/05/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560332,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN ID NUMBER:13V529000 (STEERING) HAD EXCEEDED A REASONABLE TIME FOR REPAIR. THE MANUFACTURER ADVISED THE CONTACT THAT HE WOULD HAVE TO SCHEDULE AN APPOINTMENT AND THEY COULD NOT GUARANTEE WHEN THE REPAIR WOULD BE COMPLETED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7LT2EL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560350,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) HAS SURPASSED A REASONABLE TIME FOR REPAIR.  THE DEALER STATED THE PART WAS NOT AVAILABLE FOR REPAIR. THE MANUFACTURE WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559766,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL N49/NHTSA 13V-529 LATE LAST YEAR STATING THAT ON JANUARY 6 I COULD CONTACT MY DEALER FOR A REPLACEMENT OF THE LEFT TIRE ROD BALL STUD, BECAUSE IT MAY FRACTURE AND CAUSE LOSS OF DIRECTIONAL CONTROL.  I ATTEMPTED TO CONTACT THE DEALER \"WHITES ENERGY MOTORS\"  GILLETTE, WY ON JANUARY 6, AND THEY STATED THAT THEY COULDN'T HELP ME UNTIL JANUARY 15TH.  I CONTACTED \"WHITES ENERGY MOTORS\" AGAIN ON JANUARY 13TH TO SCHEDULE AND OIL CHANGE, AT THAT TIME I ASKED ABOUT THE RECALL, AND IF I COULD GET THAT SCHEDULED AS WELL.  THEY STATED THAT \"THEY COULD TAKE A LOOK AT THE VEHICLE TO SEE IF IT REQUIRED THE RECALL REPAIR BUT IT WOULD BE QUITE A WAYS OUT, BECAUSE \"THEY WOULD ONLY ALLOW US TO ORDER ONE PART PER WEEK\".  IF THIS IS A SAFETY ISSUE, WHO AND WHY CAN THIS DEALER ONLY ORDER ONE PART PER WEEK?  THIS AREA HAS MANY, MANY RAM TRUCKS OF ALL SIZES IN THE MODEL YEAR THAT MEETS THE RECALL.    *TR",
        "vin": "3D7UT2HL3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559770,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND CONTACTED THE DEALER, WHO STATED THAT THE REMEDY PART WOULD NOT BECOME AVAILABLE UNTIL APRIL. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559751,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A SHARP LEFT TURN AFTER STOP HEARD GRINDING NOISE FROM FRONT THEN WHEN GOING INTO CURVE LEFT TIE ROD FAILED CAUSING ONE WHEEL TO TURN AND THE OTHER NOT CAUSING THE TRUCK TO SHAKE VIOLENTLY AND TO GO OFF THE ROAD. THIS WAS A RECALL DONE IN DECEMBER 2012 BY WESTBURY JEEP. THEY WOULD NOT WARRANTY THIS . TOTAL COST  FOR NEW RIM ,NEW TIRE, TIE ROD, LABOR, AND TOW $1600.  *TR",
        "vin": "3D7TT2CT0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "12/31/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558803,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 13V529000 (STEERING) AND THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE DEALER INFORMED THE CONTACT THAT THEY ONLY RECEIVE ONE PART A WEEK FROM THE MANUFACTURER. THE DEALER WAS  UNABLE TO PROVIDE AN EXPECTED DATE FOR THE PART TO BE AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THERE ARE NO FAILURES AT THIS TIME.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558609,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT NHTSA CAMPAIGN ID NUMBER:13V529000 (STEERING) HAD EXCEEDED A REASONABLE TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN NOVEMBER OF 2013. THE MANUFACTURER WAS CONTACT AND STATED THAT THE PARTS FOR THE RECALL WERE NOT EXPECTED TO ARRIVE UNTIL APRIL 2013. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D7TT2HT2AG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "11/28/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558640,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE PARKED, HE NOTICED AN ABNORMAL NOISE FROM THE FRONT END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE THE TECHNICIAN STATED THAT THE HVAC RECIRCULATION DOOR ACTUATOR WOULD NEED TO BE REPLACED. THERE WAS A MANUFACTURER'S RECALL FOR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2013",
        "dateOfIncident": "11/11/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554979,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE STEERING WHEEL BEGAN TO SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE SWAY BAR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 98,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2013",
        "dateOfIncident": "08/25/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537135,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO YORK, PA A SECOND \"DEATH WOBBLE\" OCCURRED.  THIS TIME ON I 83.  SPEED LIMIT IS 65 MPH.  I DROVE OVER A COUPLE OF BUMPS IN THE ROAD AND MY STEERING WHEEL WAS SHAKING VIOLENTLY AS WELL AS THE TRUCK BOUNCING ALL OVER THE ROAD LIKE A JUMPING JACK.  AN 18 WHEELER WAS BEHIND ME AT THE TIME AND ALMOST REAR-ENDED ME AS A RESULT.  I HAD TO SLOW DOWN TO ALMOST NOTHING TO GET IT TO STOP AND WAS FORCED INTO THE SHOULDER.  THIS IS THE TIME THIS HAPPENED TO ME TODAY AND THE FOURTH TIME IN ONE WEEK!  THERE IS A SERIOUS PROBLEM WITH THIS TRUCK AS I HAVE SEEN NUMEROUS COMPLAINTS ONLINE ABOUT THIS EXACT SAME THING OCCURRING TO THIS VEHICLE.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2013",
        "dateOfIncident": "08/25/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537133,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE BALTIME BELTWAY (695) AFTER DRIVING OVER A COUPLE OF BUMPS IN THE ROAD MY STEERING WHEEL STARTED TO SHAKE VIOLENTLY OUT OF CONTROL AND THE TRUCK WAS SHAKING AND BOUNCING ALL OVER THE ROAD LIKE A JUMPING JACK.  OTHER CARS THAT WERE AROUND ME AT THE TIME WERE GETTING OUT OF MY PROXIMITY AS I WAS ALL OVER THE ROAD AND HAD TO SLOW DOWN TO ALMOST A STOP.  I ACTUALLY ENDED UP ON THE SHOULDER OF THE ROAD WHEN IT WAS ALL OVER.  THIS HIGHWAY IS 55 MPH AND USUALLY CONGESTED.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "08/21/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING 60 MPH ON A TWO LANE COUNTY ROAD IN A RURAL AREA, SPEED LIMIT 55MPH.  DROVE OVER A SLIGHT BUMP IN THE ROAD THAT WAS OVER A SMALL CREEK WHEN THE STEERING WHEEL SUDDENLY AND VIOLENTLY STARTED TO WOBBLE BACK AND FORTH AND THE VEHICLE STARTED TO SHAKE VIOLENTLY AS WELL.  THE VEHICLE WAS UNCONTROLLABLE AND STARTED TO FORCE ME OFF THE ROAD TOWARD A WOODED AREA.LUCKILY I WAS ABLE TO SLOW DOWN ENOUGH FOR THE \"DEATH WOBBLE\" TO SUBSIDE ENOUGH FOR ME TO REGAIN CONTROL.  I WAS ON MY WAY TO PERFORM A CHORE AND HAD TO RETURN FROM THIS CHORE ON THE SAME ROAD.  THE EXACT SAME THING HAPPENED ON THE RETURN TRIP.  VIOLENT SHAKING OF THE STEERING WHEEL AND VEHICLE AND TOTAL LOSS OF CONTROL.    THE SAME THING HAPPENED ABOUT TWO MONTHS AGO ON AN INTERSTATE HIGHWAY.  THE ROAD SURFACE WAS POORLY MAINTAINED AND THE \"DEATH WOBBLE\" OCCURRED WHEN I DROVE OVER AN IMPERFECTION ON THE ROAD SURFACE.  LUCKILY NO OTHER VEHICLES WERE NEXT TO ME OR AN ACCIDENT SURELY WOULD HAVE OCCURRED.  THIS FIRST EVENT I THOUGHT WAS JUST BY CHANCE, BUT AFTER THE LAST EVENT HAPPENING TWICE ON THE SAME DAY HAS ME CONVINCED THAT THERE IS A FLAW IN THE STEERING AND/OR SUSPENSION.    I WENT TO THE DEALER WHERE I BOUGHT THE TRUCK AFTER DOING A WEB SEARCH ON PROBLEMS WITH THIS VEHICLE (MANY COMPLAINTS POSTED DETAILING EXACTLY WHAT HAD OCCURRED WITH ME) AND TOLD THE SERVICE REP WHAT HAD HAPPENED AND SHE SAID SHE HAD HEARD NO SUCH COMPLAINTS FROM OTHERS.  THE ROADS IN MY COUNTY ARE VERY RURAL AND WELL MAINTAINED.  NO PROBLEMS ON WELL MAINTAINED ROADS, HOWEVER, ON POORLY MAINTAINED ROADS OR OVER EXPANSION JOINTS OR POTHOLES GOING 60 MPH WILL THROW THIS VEHICLE INTO A \"DEATH WOBBLE\" AS IT HAS BEEN CALLED.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "07/30/2013",
        "dateOfIncident": "07/27/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN MY TRUCK WITH MY FRIEND ON SR 101. APPROXIMATE SPEED WAS 60 MPH. WE WENT AROUND A BEND IN THE ROAD OVER A CONCRETE BRIDGE EXPANSION JOINT WHERE THE PAVEMENT CHANGED LEVELS. THE TRUCK JUMPED AND BEGAN VIOLENTLY VIBRATING AND FORCED ME INTO PASSENGER SIDE GUARD RAIL OF THE BRIDGE. THE VIBRATING CONTINUED UNTIL I SLOWED DOWN TO APPROX 10 MPH. THE PROBLEM I THOUGHT WAS FIXED WITH NEW STEERING STABILIZER AND SHOCKS, A.K.A. THE DEATH WOBBLE HAS RETURNED. AFTER RESEARCH ON THE INTERNET, I CALLED MY LOCAL DODGE DEALERSHIP WITH SKEPTICISM.  HE KNEW OF NO RECALLS AND IT WOULD NOT BE COVERED UNDER WARRANTY.  I DO NOT FEEL SAFE IN THE VEHICLE AND DO NOT WANT MY FAMILY RIDING IN THE TRUCK. I HAVE ESCAPED INJURY TO THIS POINT. THIS IS MY 1ST POSTING. PLEASE HELP. WHAT SHOULD I DO?   *TR",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/20/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532409,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 1500. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE CONTACT NOTICE A LOUD GRINDING NOISE FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE IT WAS STATED THAT THE BALL JOINTS NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "1D7RB1GP7AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2013",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531493,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 136,000.",
        "vin": "3D7UT28L3AG"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/18/2013",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM STATEMENT OF OPERATOR \"WHILE PERFORMING ROAD MAINTENANCE ACTIVITIES I WAS DRIVING UP A GRADE AT LOW SPEED WHILE IN FOUR WHEEL DRIVE AND IN LOW GEAR. THE FIRST INDICATION OF A PROBLEM WAS A SUDDEN BURST OF SMOKE FROM UNDER THE HOOD ACCOMPANIED BY THE ENGINE OIL LIGHT COMING ON. I TRIPPED THE HOOD RELEASE, WENT TO THE FRONT OF THE VEHICLE TO OPEN THE HOOD. THE SMOKE FROM THE ENGINE COMPARTMENT PREVENTED ME FROM SAFELY LOCATING THE HOOD RELEASE. I THEN RETRIEVED THE FIRE EXTINGUISHER FROM THE VEHICLE AND APPLIED IT THE BEST I COULD TO THE ENGINE COMPARTMENT. AT THE SAME TIME ANOTHER EMPLOYEE RETRIEVED AN ADDITIONAL 2 FIRE EXTINGUISHERS FROM ANOTHER FOREST SERVICE TRUCK AND APPLIED THEIR CONTENTS IN A SIMILAR FASHION. THE APPLICATION WAS INSUFFICIENT TO EXTINGUISH THE FIRE. OVER THE SUBSEQUENT HALF HOUR TO 45 MINUTES THE VEHICLE BECAME FULLY ENGULFED IN FIRE.    THE SECOND OPERATOR SAID WHEN HE SEEN THE SMOKE HE RAN UP TO THE FRONT SIDE OF THE TRUCK AND COULD SEE FLAMES IN THE ENGINE COMPARTMENT AND AT THAT TIME THEY TRIED TO EXTINGUISH THE FIRE USING 3  5ABC  FIRE EXTINGUISHERS. AFTER DEPLETING THE EXTINGUISHERS THEY MOVED BACK AND UNHOOKED THE ROCK RAKE THEY WERE PULLING AND WAITED FOR THE FIRE RESPONSE TO ARRIVE AT WHICH TIME THE VEHICLE WAS TOTALLY ENGULFED.  *TR",
        "vin": "3D7TT2CT4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2013",
        "dateOfIncident": "06/19/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521465,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POPPING NOISE WHEN APPLYING PRESSURE TO BRAKE PEDDLE. LOSS OF POWER STEERING CAUSING ME TO RUN OFF ROAD THIS HAPPENED TWICE ON MY WAY TO WORK.  *TR",
        "vin": "3D7UT2CL0AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2013",
        "dateOfIncident": "02/21/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500 HD. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH, HE HEARD A LOUD NOISE OUTSIDE THE VEHICLE. THE CONTACT MOVED TO THE SIDE OF THE ROADWAY AND NOTICED THAT THE FRONT DRIVER'S SIDE TIE ROD WAS FRACTURED. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE TIE ROD WAS REPLACED. THE VEHICLE WAS REPAIRED FOR THE SAME DEFECT IN 2012. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 32,145.",
        "vin": "3D7UT2CL4AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/10/2013",
        "dateOfIncident": "04/05/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511446,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A COMPLAINT ABOUT RECALL IIV350000. DEALERSHIP INSPECTED TIE ROD END UNBEKNOWNST TO ME ABOUT RECALL IN 2012. THE TIE ROD BROKE IN APRIL 2013. CHRYSLER STATED THEY FULFILLED THE RECALL REQUIREMENT WITH THE INSPECTION. THE FAILURE OCCURRED AFTER THE INSPECTION. THIS SEEMS HARDLY ACCEPTABLE AS A FAILURE CAN RESULT AFTER A VISUAL INSPECTION, UNLESS SOME TYPE OF NON-DESTRUCTIVE TESTING WAS COMPLETE. CHRYSLER CHARGED MY EXTENDED WARRANTY FOR THE DEDUCTIBLE FOR THE REPAIR. *TR",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "04/05/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505831,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS ALREADY A RECALL OUT FOR THIS LEFT TIE ROD END.  I HAD IT REPLACED BY DODGE ON MARCH 30, 2012.  LAST WEEK I HAD THE NEW REPLACED LEFT TIE ROD END, BREAK ON ME.  FORTUNATELY I WAS IN A PARKING LOT AND NOT DRIVING DOWN THE STREET OR THERE WOULD HAVE BEEN A WRECK. *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/01/2013",
        "dateOfIncident": "02/26/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500983,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "LTX M/S",
                "productYear": "9999",
                "size": "265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500 EQUIPPED WITH MICHELIN LTXA/F TIRES, SIZE: 265/70/R17. THE CONTACT STATED THAT ALL FOUR TIRES WERE CRACKED. THE VEHICLE WAS TAKEN TO THE DEALER HOWEVER, THE TECHNICIAN REFUSED TO PROVIDE ANY ASSISTANCE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE TIRES WERE NOT REPLACED. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "3D7TP2CL2AG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2013",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498379,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS PUT IN REVERSE OR DRIVE FROM THE PARK POSITION AT IDLE THE TRUCK WILL PULL THROUGH THE BRAKES. THIS HAS HAPPENED IN EXCESS OF 24 TIMES BETWEEN 7500 MILES AND 24000 MILES. THE TRUCK HAS BEEN LOOKED AT BY THE DEALERSHIP WITH NO IMPROVEMANT. THEY WERE UNABLE TO DUPLICATE THE PROBLEM. THERE ARE NO INDICATORS BEFORE IT HAPPENS. I BELIEVE THE PROBLEM IS IN THE TRANSMISSION VALVE CAUSING THE T/C TO BE IN THE LOCKED POSITION AS THE TRANSMISSION SHIFTS.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497819,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN MY TRUCK  WITH MY WIFE ON SR 25 IN A CONSTRUCTION ZONE.  I WAS HAULING MY 13 FT DETRO TRAILER.  APPROXIMATE SPEED WAS 55 MPH.  WE WENT AROUND A BEND IN THE ROAD WHERE THE PAVEMENT CHANGED LEVELS.  THE TRUCK JUMPED AND BEGAN VIOLENTLY VIBRATING.  THE VIBRATING CONTINUED UNTIL I SLOWED DOWN TO APPROX 10 MPH.  THE PROBLEM I THOUGHT WAS FIXED A.K.A. THE DEATH WOBBLE HAS RETURNED.  I CALLED MY LOCAL DODGE DEALERSHIP WITH SKEPTICISM.  THE DEALER OWNER STATED THEY COULD NOT FIX THE PROBLEM UNLESS THEY WERE ABLE TO DUPLICATE THE PROBLEM.  HE WAS DOUBTFUL THEY WOULD BE ABLE TO DUPLICATE IT.  THE OWNER CALLED HIS DISTRICT MANAGER WHO STATED HE HAS NEVER HEARD OF THIS PROBLEM (BUT THE OWNER SAID HE HAS).  THE OWNER SUGGESTED I BEGIN VIDEO TAPING WHILE DRIVING.  I HAVE BEEN VIDEO TAPING EACH TIME I ENTER THE INTERSTATE SO I CAN \"CATCH\" THE DEATH WOBBLE ON VIDEO.  AT THIS POINT, I DO NOT FEEL SAFE IN THE VEHICLE AND DO NOT WANT MY FAMILY RIDING IN THE TRUCK.  I HAVE ESCAPED ACCIDENT TO THIS POINT BECAUSE THERE WEREN'T ANY VEHICLES AROUND ME AT THE TIME THE DEATH WOBBLE OCCURRED.  THIS IS MY 3RD POSTING.  PLEASE HELP.  WHAT SHOULD I DO?  *TR",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497817,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY NORMAL ROUTE HOME ON I-65.  JUST BEFORE MY EXIT, THERE IS AN OVERPASS ON I-65 YOU MUST GO OVER.  THE EXPANSION JOINT IS DIAGONAL TO THE INTERSTATE. I HAVE GONE OVER THIS JOINT THOUSANDS OF TIMES BEFORE,IN MY OTHER VEHICLE.  DRIVING MY NEW TRUCK, I WENT OVER THE JOINT AND THE TRUCK JUMPED TO THE RIGHT.  IT SCARED ME BUT I ASSUMED IT WAS BECAUSE I WASN'T ACCUSTOMED TO DRIVING THE NEW VEHICLE.  *TR",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "10/20/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497818,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY SON IN THE VEHICLE GETTING ON I-65 GOING SB.  I CROSSED OVER AN EXPANSION AND THE TRUCK STARTING VIOLENTLY JUMPING AND VIBRATING.  IT THREW ME FAR ENOUGH THAT I WAS ALMOST IN THE GRASS.  ONCE I APPLIED THE BRAKES, THE TRUCK SLID COMPLETELY INTO THE GRASS.  THE VIBRATING CONTINUED UNTIL I WAS ALMOST COMPLETELY STOPPED (APPROX 10 MPH).  I NEW IMMEDIATELY SOMETHING WAS WRONG WITH THIS PARTICULAR TRUCK.  I TOOK THE TRUCK TO MY LOCAL DODGE DEALER AND EXPLAINED WHAT HAD HAPPENED.  THE INVOICE READS \"CUSTOMER THE FRONT END WOBBLES BAD FROM 65 MPH DOWN TO 10 MPH, AFTER HITTING A BUMP\".  \"REPLACED FRONT BRAKE CALIPERS AND HOSES.  ADD FLUID\".  I DID NOT BELIEVE THIS WAS THE PROBLEM SO I BEGAN RESEARCHING TO SEE IF ANYONE HAD EXPERIENCED THE SAME ISSUE.  TURNS OUT MANY OTHER DODGE TRUCKS HAVE EXPERIENCED THIS ISSUE.  SO MUCH SO THAT IT HAS BEEN GIVEN THE NAME \"THE DEATH WOBBLE\".  IN MY RESEARCH I HAVE FOUND NUMEROUS FIXES FOR THIS PROBLEM BUT THEY ARE ALL AFTER MARKET PARTS.  I CONTINUED TO DRIVE MY TRUCK HOPING THE PROBLEM WAS RESOLVED.  I HAVE DRIVEN THE SAME ROUTE MANY TIMES WITHOUT ISSUE AND I ASSUMED THE PROBLEM WAS RESOLVED.  *TR",
        "vin": "3D7TT2CT3AG"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "STEERING LINKAGE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2010 DODGE RAM 2500 TIE ROD BROKE ON TRUCK ON 1/21/2013.  HEARD POPPING NOISE IN THE FRONT END OF TRUCK - PULLED OVER TO INVESTIGATE. DRIVERS SIDE - INNER TIE ROD. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2012",
        "dateOfIncident": "11/12/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484462,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PINION NUT LOOSENING CAUSED COMPLETE DIFFERENTIAL FAILURE. *TR",
        "vin": "1D7RV1CT8AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482752,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED AND THE VEHICLE COULD NOT BE STARTED. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS. THE CONTACT WAS TOLD THAT THE KEY MODULE NEEDED TO BE REPLACED AND THE NEGATIVE BATTERY TERMINAL HAD BECOME LOOSE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO A DIFFERENT DEALER AND THE CONTACT WAS THEN INFORMED THAT THE OXYGEN SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO A DEALER AND THE CONTACT WAS INFORMED THAT THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 3,000 AND THE CURRENT MILEAGE WAS 9,859.",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "10/21/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING UNDER CRUISE CONTROL AT 75MPH ON I95 NORTH IN THE MIDDLE LANE, AND NOTICED MY TRUCK STARTED SLOWING DOWN AND ENGINE HAD STALLED.  POWER STEERING AND POWER BRAKES WENT OUT AND THERE WAS TRAFFIC COMING UP BEHIND ME IN ALL THREE LANES, SO I HAD DIFFICULTY STEERING THE TRUCK OFF TO THE SIDE OF THE ROAD.   ALL ELECTRONICS REMAINED ON, KEY WAS STILL IN ON POSITION, AND THERE WERE NO STATUS INDICATORS ANYWHERE ON THE INSTRUMENT PANEL OR EVIC TO INDICATE THERE WAS A PROBLEM.  THE FUEL GAUGE WAS STILL OVER HALF FULL.  ONCE THE TRUCK CAME TO A STOP, I PUT IT BACK IN PARK AND TURNED THE KEY OFF.  I WAS THEN ABLE TO START THE TRUCK BACK UP AND CONTINUE DRIVING THE REST OF THE WAY HOME WITHOUT ANOTHER INCIDENT.    I TOOK THE TRUCK INTO THE DEALER THE NEXT DAY AND THEY WERE UNABLE TO FIND ANY FAULT CODES FROM THE ECU.   BECAUSE THERE WERE NO FAULT CODES FOUND, THE DEALER WAS UNABLE OR UNWILLING TO PERFORM ANY REPAIRS TO PREVENT THIS DANGEROUS CONDITION FROM RE-OCCURRING.  SO, I'VE DONE SOME RESEARCH OF MY OWN ON THIS CONDITION AND FOUND THAT CHRYSLER HAS HAD IDENTICAL PROBLEMS IN OTHER VEHICLE MODELS FOR WHICH THEY ISSUED A RECALL (RE: NHTSA CAMPAIGN ID NUMBER: 11V139000).  IT SEEMS THIS PROBLEM IS CAUSED BY A LOSS OF COMMUNICATION BETWEEN THE KEY FOB AND THE WIRELESS IGNITION NODE (WIN).  THIS WIRELESS CONNECTION IS REQUIRED TO START THE VEHICLE, BUT FOR A GLITCH IN THE WIRELESS CONNECTION TO RESULT IN A COMPLETE ENGINE SHUTDOWN WHILE TRAVELING AT HIGH SPEED IS A HUGE SAFETY ISSUE.  I AM NOW AFRAID TO DRIVE MY TRUCK ON THE HIGHWAY UNLESS I STAY IN THE RIGHT HAND LANE.  *TR",
        "vin": "3D7TP2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "08/27/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481601,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TIE ROD END REPLACEMENT ON DODGE RAM TRUCKS (CHRYSLER RECALL L16) ALIGNMENT NEEDS TO BE CHECKED.  RECALL NOTICE L16 DOES NOT REQUIRE CHRYSLER TO CHECK ALIGNMENT, AND ONE DEALERSHIP IN GRESHAM OREGON DOES NOT CHECK CAUSING AN UNSAFE CONDITION IF ALIGNMENT IS OUT.",
        "vin": "3D7UT2HL9AG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2012",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477141,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS FUEL FUMES WERE EMITTED INTO THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 5,000 AND THE CURRENT MILEAGE WAS 28,000.",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2012",
        "dateOfIncident": "09/15/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475787,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE INTERSTATE AT 70 MPH HIT A SMALL BUMP AND THE FRONT END STARTED SHAKING VIOLENTLY,THE STEERING WHEEL WAS ALMOST UNCONTROLLABLE. I HAD TO PULL OFF AND STOP BEFORE IT WOULD STOP. THEN PROCEEDING ON DIDN'T HAVE ANYMORE PROBLEMS YET.  *TR",
        "vin": "3D7TT2CT4BG"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "08/24/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472865,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LEFT TIE ROD WAS A SAFETY RECALL IN MARCH.  I HAD IT LOOKED AT AND THE DEALER SAID IT WAS FINE.  ON FRIDAY AUGUST 24TH I WAS TURNING AROUND IN A DRIVEWAY AFTER I GOT OFF THE HIGHWAY 10 MINUTES PRIOR WHEN THE TIE ROD BROKE.  I CALLED ROADSIDE ASSISTANCE IN WHICH THEY TOWED TO THE NEAREST DEALER SINCE WE WERE 58 MILES FROM HOME.  THE DEALER GAVE ME A RENTAL CAR AND TOLD ME NOT TO WORRY ABOUT ANYTHING, CHRYSLER WOULD HANDLE IT.  ON SATURDAY THE 25TH, THE DEALERSHIP CALLED ME AND TOLD ME THAT I WOULD HAVE TO USE MY EXTENDED WARRANTY BECAUSE CHRYSLER SAID THEY WOULD NOT PAY FOR THIS, EVEN THOUGH THIS WAS A RECALLED PART.  I WOULD HAVE TO PAY THE 100.00 DEDUCTIBLE.  I THEN FILED A COMPLAINT WITH CHRYSLER, WHO THEN CALLED ME ON MONDAY THE 27TH AND TOLD ME THEY WOULD PAY THE DEDUCTIBLE AND I WOULD HAVE TO ISSUE THE CHECK FIRST AND THEY WOULD SEND ME THE CHECK.  I DID NOT HAVE 100.00 AND TOLD THEM THAT THEY WOULD NEED TO PAY UPFRONT.  THEY SAID THEY WOULD TALK TO THE DEALER AND TAKE CARE OF IT.  ON TUESDAY, THE 28TH I GO TO PICK UP MY TRUCK AND THEY SAID CHRYSLER DID NOT PAY AND I HAD TO BORROW 100 TO TAKE CARE OF THE DEDUCTIBLE AND ALSO HAD TO FILL UP THE RENTAL CAR.  I FEEL THAT THIS WAS ALL ON CHRYSLER AND I HAVE BEEN A DODGE OWNER SINCE EARLY 90'S AND I REFUSE TO BUY DODGE EVER AGAIN BECAUSE OF THEIR LACK OF CUSTOMER SERVICE.  I COULD OF BEEN KILLED IF THIS WAS TO HAPPEN ON THE HIGHWAY AND CHRYSLER JUST DOES NOT CARE. *TR",
        "vin": "3D7UT2HL1AG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2012",
        "dateOfIncident": "08/23/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472054,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500 EQUIPPED WITH BF GOODRICH TIRES, SIZE: 265/70/R17. THE CONTACT STATED THAT HE NOTICED THAT THERE WERE CRACKS IN ALL FOUR TIRES. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR INSPECTION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 24,000.",
        "vin": "3D7LT2EL9AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/11/2012",
        "dateOfIncident": "08/08/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470240,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY DOING AROUND 75 AND HIT A SMALL BUMP AND ALL 4 TIRES LOCKED UP, THE STEERING WHEEL AND COLUMN SHOOK VIOLENTLY, THE DASHBOARD AND EVERYTHING SHOOK REALLY HARD. I STARTED TO HIT THE BRAKES AND DID NOT LET GO OF THE STEERING WHEEL EVEN IF IT WAS SHAKING HARD.  MY TRUCK STARTED TO GO ONTO THE SHOULDER THEN WENT INTO THE GRASS ON THE RIGHT AND CAME TO A STOP.  IT WAS STILL RUNNING AND I GOT OUT TO LOOK AT THE TIRES AND UNDERNEATH BUT NOTHING WAS WRONG.  I TOOK IT TO A DIFFERENT DEALER AND TOLD THEM I EXPERIENCED THIS BEFORE AND NOT TO TRY TO DUPLICATE THE COMPLAINT BECAUSE IT WILL GO OUT OF CONTROL.  TODAY THEY CALLED ME TO SAY THEY REPLACED THE BALL JOINT (UNDER WARRANTY) BUT I HAVE TO PAY FOR AN ALIGNMENT. I TOLD THEM THAT I LOOKED THE SYMPTOMS UP ON THE INTERNET AND SAW THIS IS A REAL PROBLEM THAT CANT BE FIXED AND I DON'T WANT THIS TO HAPPEN TO ME AGAIN, THEY CAN KEEP IT.  WHY DO I HAVE TO PAY 700.00/MONTH PAYMENTS AND ALSO PAY WITH MY LIFE OR SOMEONE ELSE'S LIFE TOO?  I WILL NOT PICK THIS 'FIXED' TRUCK UP FROM THE DEALER.   ON THE INTERNET AND YOU-TUBE ITS CALLED, THE DEATH WOBBLE AND IS WHAT HAPPENED TO ME, ONLY WORSE AND TWICE!  SO, TODAY I WENT TO NHTSA AND FILED BOTH COMPLAINTS.  BELIEVE ME, I MAY NOT HAVE IT ON VIDEO BUT ITS VERY VIOLENT AND YOU CANT STEER!  THE STEERING SHAKES SO BAD THAT YOU CAN BARELY HANG ONTO IT AND I THINK ALL THE TIRES QUIT TURNING BECAUSE YOU LITERALLY ARE BOUNCING DOWN THE HIGHWAY.  *TR",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/11/2012",
        "dateOfIncident": "11/21/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470237,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY, IT WAS RAINING AND HIT A SMALL BUMP AND THE WHOLE TRUCK STARTED VIOLENTLY BOUNCING EVERYWHERE (INSIDE THE CAB AND OUTSIDE) LIKE ALL FOUR TIRES STOPPED TURNING.  IT WAS SO BAD THAT MY BRIEFCASE, CELL PHONE AND WATER GOT THROWN.  I COULDN'T STEER TOO WELL SO I HIT THE BRAKES AND STOPPED ON THE HIGHWAY THEN WENT VERY SLOW TO A GAS STATION AND TWO STRANGERS FOLLOWED ME TO SEE IF I WAS OKAY AND THEY BOTH SAID THAT THEY THINK MY TRUCK WENT INTO 4-WHEEL DRIVE BY ITSELF BECAUSE MY TIRES WEREN'T TURNING.  I TOOK IT INTO THE WYATT ARP DEALER, THEY GAVE ME A RENTAL FOR 2 DAYS.  THEY SAID THEY COULD NOT DUPLICATE AND MY 4-WHEEL DRIVE PROBLEM. THE PAPERWORK SAYS, \"CUSTOMER STATES WAS TRAVELING 75 MPH ON HWY I-10 WHEN RAINING REAR TIRES LOCKED UP AFTER HITTING BUMP.  UNABLE TO DUPLICATE CUSTOMER CONCERN AT THIS TIME\".   *TR",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2012",
        "dateOfIncident": "06/03/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HORRIBLE SQUEAK COMING FROM SOMEWHERE IN THE DRIVER SIDE REAR OF THE CAB. THE DEALERSHIP AND MYSELF CANNOT LOCATE THE SOURCE OF THE NOISE. I FEEL LIKE IM IN A SEINFIELD EPISODE. PLEASE SOMEONE HELP ME!!!!!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/08/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450721,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN ID NUMB: 11V350000 (STEERING:LINKAGES:TIE ROD ASSEMBLY). THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REMEDY THE RECALLED COMPONENT WERE NOT AVAILABLE. THE CONTACT WAS NOT PROVIDED A TIMETABLE AS TO WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE SITUATION. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2012",
        "dateOfIncident": "02/25/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449323,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING OUT OF A PARKING SPOT AND TURNED THE WHEEL TO THE LEFT AND HEARD A LOUD BANG FROM UNDER THE TRUCK. GOT OUT AND LOOKED UNDER THE TRUCK AND SAW THE LEFT OUTER TIE ROD BROKEN. LUCKILY I WAS ONLY GOING IN REVERSE AND NOT DOING 55 MPH. I HAD NY WHOLE WIFE AND 3 KIDS IN THE TRUCK. A QUICK SEARCH ON GOOGLE AND YOU WILL FIND NUMEROUS COMPLAINTS ON THE SAME PROBLEM. SOME EVEN 2X IN A MONTH ON THE SAME TRUCK.  *TR",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE TIE ROD END BROKE WHILE PULLING OUT OF A PARKING SPACE WITH WHEEL TURNED TO LEFT. THIS CAUSED COMPLETE LOSS OF STEERING CONTROL. THERE WAS NO PREVIOUS PROBLEMS, OR NOISES TO INDICATE A PROBLEM. HAD THIS HAPPENED WHILE DRIVING FORWARD AT A HIGHER RATE OF SPEED IT WOULD MOST LIKELY HAVE CAUSE A ACCIDENT. IN ADDITION HAD THE RECALL THAT WAS ISSUED FOR 2008 TO 2011 DODGE 2500 TRUCKS INCLUDED MY VIN NUMBER, THE FAILURE COULD HAVE BEEN AVOIDED.  *KB",
        "vin": "3D7UT2HL5AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2012",
        "dateOfIncident": "01/27/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445607,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE TIE ROD END BROKE IN HALF WHILE BACKING UP WITH WHEEL TURNED TO RIGHT. THIS CAUSED COMPLETE LOSS OF STEERING CONTROL.  THERE WAS NO PREVIOUS PROBLEMS, OR NOISES TO INDICATE A PROBLEM. HAD THIS HAPPENED WHILE DRIVING FORWARD AT A HIGHER RATE OF SPEED IT WOULD PROBABLE HAVE CAUSE A ROLL OVER.  IN ADDITION HAD THE RECALL THAT WAS ISSUED FOR 2008 TO 2011 DODGE 2500 TRUCKS INCLUDED MY VIN NUMBER, THE FAILURE COULD HAVE BEEN AVOIDED.  *TR",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444104,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT STATED THAT WHILE EXITING OUT OF THE PARKING SPACE, THE CONTACT HEARD SOMETHING SNAP COMING FROM THE FRONT DRIVER SIDE WHEEL.  THE CONTACT WAS UNABLE TO TURN THE STEERING WHEEL AFTER THE SOUND.  THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND THE MANUFACTURER WAS CONTACTED. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 10V657000 (STEERING:LINKAGES:TIE ROD ASSEMBLY)BUT WAS ADVISED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND THE CURRENT MILEAGE WAS 60,000.",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/24/2011",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441161,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTEGRATED TRAILER BRAKE CONTROLLER FAILED TO ADEQUATELY ACTIVATE THE BRAKES ON MY 24' PJ FLATBED TRAILER.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/19/2011",
        "dateOfIncident": "12/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440361,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500. WHILE DRIVING 25 MPH, THE DRIVER SIDE TIE ROD FRACTURED, CAUSING THE TIRE TO DETACH FROM THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER WHO ADVISED THE CONTACT THAT THERE HIS VIN WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 11V350000 (STEERING: LINKAGES: TIE ROD ASSEMBLY). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CLAIM WAS FILED (CLAIM NUMBER:21674760). THE FAILURE MILEAGE WAS 18,000.",
        "vin": "3D7UT2CL9AG"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/11/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439290,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT OR AROUND 55 TO 60 MILES PER HOUR WHEN HITTING A IRREGULARITY IN ROADWAY TRUCK WILL BOUNCE OUT OF CONTROL  UNTIL I SLAM THE BRAKES AND SLOW DOWN TO 35 MILES PER HOUR . THE TRUCK IS COMPLETELY STOCK. THE DEALERSHIP SAID IT WAS THE TIRES. THESE ARE THE STOCK TIRES ON THE TRUCK AND THEY ARE IN GOOD SHAPE. I DO NOT FELL I SHOULD HAVE TO REPLACE STOCK TIRES ON  A NEW TRUCK TO STOP IT FROM SHIMMING WHEN OVER 55 MILE AN HOUR. THIS WAS A EXPENSIVE TRUCK AND I AM VERY DISAPPOINTED IN IT. I FEEL THE DEALERSHIP SHOULD STAND BEHIND IT. PLEASE GET BACK TO ME ON MY NEXT STEP. I AM VERY UNHAPPY WITH THE TRUCK AND THE SERVICE I HAVE RECEIVED. THIS IS NOT MY FIRST DODGE TRUCK.  *TR",
        "vin": "1J4GA39197L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "12/03/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT STATED THAT THE DRIVER SIDE TIE ROD FRACTURED WHILE DRIVING 15 MPH.  THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 11V350000 (STEERING:LINKAGES:TIE ROD ASSEMBLY) BUT COULD NOT CONFIRM IF THE VEHICLE WAS INCLUDED IN THE RECALL.  NEITHER THE DEALER NOR THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND THE CURRENT MILEAGE WAS 15,700.",
        "vin": "3D7UP2CL78G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM 2500. CONSUMER WRITES IN REGARDS TO VEHICLE BEING A LEMON *TGW  THE CONSUMER STATED THE DEALER HAS BEEN UNABLE TO DETERMINE WHY THE CHECK ENGINE LIGHT CONTINUES TO ILLUMINATE.  ON ONE OCCASION, THE VEHICLE STALLED DURING RUSH HOUR TRAFFIC. THE VEHICLE HAD TO BE TOWED.  THE DEALER INFORMED THE CONSUMER, THE WIRING HARNESS WAS THE PROBLEM. HOWEVER, THE PART WAS ON BACK ORDER. *JB",
        "vin": "3D7UT2CL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "08/26/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426520,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY TRUCK WITH MY 6 YR OLD SON THE STEERING SYSTEM FAILED.  THE TRUCK LOST ALL CONTROL OF THE STEERING AND THE WHEELS LOCKED  IN PLACE.  THE LEFT TIE ROD FAILED, THE STEERING ARM JAMMED INTO THE LEFT WHEEL LOCKING THE WHEELS IN A TIGHT STEERING POSITION. CHRYSLER HAS NOT ACKNOWLEDGED THE PROBLEM OR ACTED IN RESPONSIBLE MANOR TO INFORM ME OF WHY OR HOW THIS HAPPENED.  CHRYSLER DID REPLACE THE LEFT TIE ROD BUT REFUSED TO REPLACE THE RIGHT SIDE OR COMPENSATE ME FOR THE COST OF A NEW RIM.  DUE TO THE FACT THE TIE ROD FAILED THE WHEEL WAS CRACKED BY THE STEERING ARM AND NEEDED REPLACEMENT.  THIS IS A HEAVY DUTY TRUCK BUILT FOR AND USE FOR TOWING.  FAILURE OF THIS COMPONENT UNDER LOAD OR AT A HIGHER SPEED WOULD BE CATASTROPHIC.  I AM VERY CONCERNED FOR THE SAFETY OF MY FAMILY AND THE AMERICAN PUBLIC.  *TR",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "08/16/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422855,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT END WAS VIOLENT, SHAKING FROM LEFT TO RIGHT, THE STEERING WHEEL WAS VIBRATING WILDLY.  *TR",
        "vin": "3D7UT2CL3AG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2011",
        "dateOfIncident": "07/08/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10416860,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 DODGE RAM 2500.  THE CONTACT STATED THAT THE EXHAUST FUMES ENTERED THE VEHICLE THROUGH THE CAB AND COULD CAUSE HEALTH COMPLICATIONS.  WHENEVER THE FUMES WERE PRESENT, THE CHECK ENGINE WARNING LIGHT WOULD ILLUMINATE.  THE DELAER INSPECTED THE VEHICLE AND REPROGRAMMED AND REPLACED THE O2 CENSOR SINCE IT HAD FAILED.  AFTER THE REPAIRS, THE CONTACT CONTINUED TO SMELL THE FUMES.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE; HOWEVER, DID NOT OFFER ANY ASSISTANCE.  THE APPROXIMATE FAILURE MILEAGE WAS 8,500.   UPDATED 09/21/11*LJ  CHRYSLER INFORMED THE CONSUMER THEY DIDN'T HAVE A FIX FOR THE EMISSIONS SYSTEM FAILURE AND THEY WOULD CONTACT HIM WHEN THEY DID. UPDATED 10/03/11",
        "vin": "3D7UT2HLXAG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/2011",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407210,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATE WHILE DRIVING AT A LOW SPEED HE HEARD A SNAPPING NOISE AND LOST CONTROL OF THE STEERING WHEEL.  THE CONTACT OBSERVED THAT THE DRIVERS SIDE  TIRE WAS OUT OF PLACE. THE VEHICLE WAS TOWED TO THE DEALER WHO PERFORMED A DIAGNOSTIC TEST AND STATED THE FAILURE WAS LOCATED ON THE DRIVERS LEFT TIE ROD STUD.  THE MANUFACTURER FILED REPORT 20991683. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILES WAS 22,000.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2011",
        "dateOfIncident": "06/11/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406088,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2010 RAM 2500 DIESEL NEW AND HAD TO TAKE TO DEALER TO THIS POINT 5 TIMES FOR CHECK ENGINE LIGHT ILLUMINATED.  THE TRUCK HAS CURRENTLY 16,338 MILES AND IS RETURNING TO DEALER TOMORROW FOR ANOTHER CHECK ENGINE LIGHT.  EACH TIME THE LIGHT IS IN RELATION TO THE EMISSION SYSTEM.  THE DEALER UNDER WARRANTY HAS CHANGED THE O2 SENSORS, CLEANED THE EGR VALVE AND STATES THEY MAY HAVE TO CHANGE THE O2 SENSOR CONTROLLER.  I'VE ALSO POSTED ON THIS SITE ABOUT A MAJOR STEERING WOBBLE TO WHICH THE DEALER CHANGED A LOT OF FRONT STEERING COMPONENTS.  THIS TRUCK DESIGN HAS A LOT OF HISTORY OF MAJOR DESIGN FLAWS.  I'M STRONGLY CONSIDERING FILING A LEMON LAW SUIT.  *TR",
        "vin": "3D7UT2HL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/10/2011",
        "dateOfIncident": "12/28/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING A CORNER ON A BLACK TOP ROAD, THE STEERING WENT COMPLETELY OUT AND THE WHEEL WOULD SPIN 360 WITH NO CONTROL. LUCKILY THERE WERE NO OTHER VEHICLES INVOLVED.  I WAS ABLE TO GET THE VEHICLE OFF THE ROAD AND PARTIALLY INTO THE DITCH.  IT WAS DETERMINED THAT A BOLT WAS EITHER MISSING OR FELL OUT OF THE STEERING COLUMN.",
        "vin": "3D7UT2CL2AG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2011",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399261,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 DODGE RAM 2500. THE CONTACT STATED THAT THE DASHBOARD WAS FRACTURED DOWN THE MIDDLE AND HAD DISINTEGRATED.  IN ADDITION, THE FRACTURE OF THE DASHBOARD WAS INTERFERING WITH THE AIR CONDITIONING UNIT AND THE UNIT HAD FAILED. THE VEHICLE WAS TAKEN TO A MECHANIC WHERE THE CONTACT WAS ADVISED THAT THE DASHBOARD AND AIR CONDITIONER WIRES WOULD NEED TO BE REPLACED.  THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THEY WERE UNABLE TO PROVIDE ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED AND THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/26/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397979,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALER PERFORMED RECALL K33 SERVICE TODAY. BEFORE SERVICE, THE BRAKE LIGHTS STAYED ILLUMINATED ABOUT 1 SECOND AFTER THE BRAKE PEDAL WAS RELEASED. AFTER SERVICE, THE BRAKE LIGHTS STILL STAYED ILLUMINATED ABOUT 1 SECOND AFTER THE BRAKE PEDAL WAS RELEASED. THE PS RESERVOIR CAP WAS REPLACED, BUT THIS DOES NOT SOLVE THE PROBLEM.  THE BRAKE SAFETY INTERLOCK FOR THE SHIFT LEVER ALSO STAYS DISENGAGED FOR THE SAME 1 SECOND WHEN THE SHIFT LEVER IS IN \"PARK\". HOWEVER, MY CONCERN HAS BEEN AND STILL IS THAT MY TRAILER BRAKES ALSO REMAIN ENGAGED FOR THE SAME 1 SECOND INTERVAL AFTER THE BRAKE PEDAL IS RELEASED. THIS IS MOST NOTICEABLE WHEN STOPPED AT A LIGHT. I HAVE TO RELEASE THE BRAKE PEDAL, WAIT ABOUT 1 SECOND FOR THE TRAILER BRAKES TO RELEASE, THEN BEGIN TO ACCELERATE. THIS PUTS UNNECESSARY STRAIN ON MY TRAILER BRAKES, AND IS A CONCERN IN WET OR SNOWY CONDITIONS WHEN THE VEHICLE IS MOVING. THE TRAILER BRAKE CONTROL WORKS PROPERLY, AND SINCE THE TRAILER BRAKES DISENGAGE AND THE TRUCK BRAKE LIGHTS TURN OFF AT THE SAME TIME, THIS IS OBVIOUSLY THE SAME PROBLEM, AND IS NOT SOLVED BY REPLACING THE POWER STEERING RESERVOIR CAP.  *TR",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "04/15/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396735,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 2010 RAM 2500 MEGACAB DIESEL 4X4 WITH 13950 MILES ON ODOMETER. PRIOR TO TRIP NOTED THAT STEERING WHEEL FREEPLAY WAS GETTING WORSE AND NOTED NEEDED TO HAVE CHECKED BY DEALER UNDER WARRANTY THE FOLLOWING WEEK. WHILE TRAVELING ON HIGHWAY AT 70MPH, WENT OVER AVERAGE BUMP - FRONT END CONTINUED TO SHAKE AND BOUNCE VIOLENTLY UNTIL SPEED DROPPED BELOW 40MPH.  PULLED OVER CHECKED TIRES, STEERING COMPONENTS AND GENERAL CONDITION FOR ROADSIDE INSPECTION -FOUND NO DEFECTS.  CONTINUED ON ROAD.  10 MILES LATER AT 64MPH HAD SAME VIOLENT REACTION TO BUMP TILL BELOW 40MPH.  20 MILES LATER EVENT OCCURRED AGAIN.  IMMEDIATELY TOOK TO DEALER FOR EVALUATION.  THE DEALER REMOVED AND REPLACED TRACKBAR AND TIE ROD, ALIGNED FRONT END, TEST DROVE AND STILL NOTED WOBBLE BUT IMPROVED.  THEY THEN DECIDED TO REPLACE THE STEERING SNUBBER.  THE DEALER CLOSED SO I DON'T KNOW IF THAT RESOLVED THE ISSUE YET OR NOT.  THE TECH SAID IF IT STILL WOBBLED THAT THEY WOULD CHANGE THE WHEEL BEARING TO RESOLVE THE ISSUE.  I WILL FIND OUT IN THE MORNING IF THE WHEEL BEARING WILL REQUIRE REPLACEMENT.  *TR",
        "vin": "3D7UT2HL8AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394470,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED WHILE ATTEMPTING TO PARK, HE PLACED THE VEHICLE IN REVERSE, TURNED THE STEERING WHEEL AND HEARD A LOUD THUMP.  AFTER THE LOUD SOUND, THE STEERING HAD BECOME DIFFICULT TO MANEAUVER.   WHEN HE GOT OUT TO LOOK AT THE VEHICLE, HE SAW THAT THE FRONT DRIVER SIDE TIRE WAS TURNED RIGHT AND THE RIGHT FRONT PASSENGER SIDE WAS STRAIGHT. THE CONTACT HAD THE VEHICLE TOWED TO A DEALER AND THEY REPLACED THE TIE ROD ASSEMBLY. THE DEALER TOLD THE CONTACT THERE IS A NHTSA CAMPAIGN ID NUMBER: 10V657000 (STEERING: LINKAGES: TIE ROD ASSEMBLY) THAT WAS ISSUED FOR THE 4500 AND 5500, BUT NOT THIS MODEL. THE CONTACT IS CONCERNED ABOUT THE SAFETY OF THE VEHICLE, BECAUSE THE TIE ROD WAS REPLACED WITH THE SAME TYPE OF TIE ROD ASSEMBLY, AND NOT A NEWLY MANUFACTURERD ONE. THE FAILURE AND CURRENT MILEAGE WAS 31,879.",
        "vin": "3D7UT2CL1AG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/27/2011",
        "dateOfIncident": "12/02/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393002,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NORMAL DRIVING, 2. CHECK ENGINE LIGHT, EMISSIONS FAILURE AND IT HAPPENS WITH TWO DAYS OF GETTING OUT OF THE SHOP, 3. REPLACED PARTS/REPAIRED AT LEAST 14 TIMES AND IS STILL BROKEN.  *TR",
        "vin": "3D7UT2CLXAG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/18/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392038,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 DODGE RAM 2500. CONSUMER STATES THAT HEADLIGHTS IN GENERAL ARE POOR AT BEST AND IN PARTICULAR THE HIGH BEAM HEADLIGHTS ARE TERRIBLE *TGW  THE CONSUMER STATED THE TRUCK IS EQUIPPED WITH A DUAL HEADLIGHT SYSTEM. THERE WAS LITTLE LIGHT PROJECTED ONTO THE HIGHWAY. *JB",
        "vin": "3D7LT2EL7AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374741,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 DODGE RAM 2500.  WHILE DRIVING AT ANY SPEED THE STEERING WHEEL WOULD EASILY TURN TO THE LEFT AND RIGHT, FORCING THE CONTACT TO CONSTANTLY CORRECT THE DIRECTION THE VEHICLE WAS TRAVELING IN.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON TWO OCCASIONS WHERE THEY WERE UNABLE TO DIAGNOSE THE FAILURE.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 150 AND THE CURRENT MILEAGE WAS 1,500.     UPDATED 3/7/11 *CN  THE DEALER INSTALLED A NEW GEAR BOX ON FEB 23, 2011. UPDATED 04/29/11",
        "vin": "3D7LT2ET3AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/30/2010",
        "dateOfIncident": "12/27/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373546,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BACKING  MY 2010 DODGE RAM 2500 4X4 WITH 6200 MILES ON IT OUT OF A PARKING SPOT.  THERE WAS SNOW ON THE GROUND AND THE TRUCK WAS IN FOUR WHEEL DRIVE. I BACKED OUT AND PUT THE TRUCK IN DRIVE AND I HEARD A LOAD SNAP. THE TRUCK WENT FORWARD ROUGHLY 30 YARDS THEN CAME TO A SUDDEN STOP AND WOULD NOT GO FORWARD NO MATER HOW MUCH I PUSHED ON THE ACCELERATOR PEDAL. I GOT OUT OF THE TRUCK WALKED TO THE FRONT AND NOTICED BOTH TIRES WERE TOED IN. THE DRIVER SIDE OUTER TIE ROD END HAD BROKEN. THE TRUCK WAS TOWED TO THE DODGE DEALER WHO SAID THAT I HIT SOMETHING CAUSE TIE RODS JUST DON'T BREAK LIKE THAT. I ASSURE YOU I HIT NOTHING! THEY CHARGED ME $637 TO REPLACE THE WHOLE STEERING LINKAGE WITH A KIT THAT THEY SAID WAS AN UPGRADED STEERING SYSTEM. SOMEONE IS GOING TO BE KILLED DRIVING ONE OF THESE TRUCKS AND HAVING THIS HAPPEN TO THEM. I AM NOT THE ONLY 2010 2500 RAM OWNER WITH THIS PROBLEM. I HAVE ALL OLD PARTS.  *TR",
        "vin": "3D7UT2CL6AG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "12/14/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370771,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "2500",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 DODGE RAM 2500. THE CONTACT STATED THAT THE VEHICLE STEERING TIE ROD WAS DEFECTIVE, HE EXPERIENCED TWO FAILURES WITH THE STEERING TIE ROD. THE FIRST FAILURE OCCURRED AT THE DRAG LINK TO THE PITMAN ARM, THE SECOND OCCURRENCE WAS ON DECEMBER 14, 2010 AT THE STEERING TIE ROD CONNECTED TO THE DRIVERS FRONT TIRE. THE VEHICLE WILL BE TOWED TO THE DEALER. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 10,000 AND THE CURRENT MILEAGE WAS 15,000.",
        "vin": ""
    }
]