[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "ROAD VENTURES",
                "productYear": "9999",
                "size": "15/85R16",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD 4 KUMHO LIGHT TRUCK TIRES FAIL ON MY MOTORHOME THIS SUMMER IN RAPID SUCCESSION.  EVERY TIME THEY WERE REPLACED, I WAS TOLD BY THE TECHNICIAN THAT IT APPEARED TO BE A MANUFACTURING DEFECT.  THE BELT SEPARATED INTERNALLY.  I HAVE HAD TO REPLACE THEM AT MY OWN EXPENSE AND THE KUMHO TIRE REPRESENTATIVE WAS NOT EVEN INTERESTED IN HAVING THE DOT NUMBER.  I BELIEVE THIS TO BE A LIFE SAFETY ISSUE AND THAT A RECALL SHOULD BE INITIATED.  *KB",
        "vin": "WDXPF445X89"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/10/2011",
        "dateOfIncident": "07/07/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411666,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "ROAD VENTURES",
                "productYear": "9999",
                "size": "15/85R16",
                "type": "Tire"
            }
        ],
        "summary": "UPON RETURNING HOME FROM A 3560 MILE TRIP WE DISCOVERED ONE FLAT TIRE ON THE INSIDE RIGHT DUAL WHEEL OF OUR 2010 FLEETWOOD QUEST MOTORHOME AND TWO BULDGES ON THE OUTSIDE OF THE LEFT OUTSIDE DUAL TIRE AND WHAT APPEARED TO BE A FLAP OF RUBBER STICKING OUT OF THE LEFT INSIDE DUAL TIRE. WE THEN DROVE, VERY SLOWLY A SHORT DISTANCE, TO OUR LOCAL DISCOUNT TIRE CO.  THE DISCOUNT TIRE SALESMAN, CALLED KUMHO TIRE CO. EXPLAINING THE VISIBLE FAILURE OF THE TIRES. OUR SALESMAN SAID THE KUMHO REPRESENTATIVE ON THE PHONE KNEW EXACTLY WHICH TIRE HE WAS REFERRING TO. ON FURTHER EXAMINATION OF THE 6 TIRES PLUS THE ORIGINAL SPARE ALL WERE KUMHO ROAD VENTURE AT LT 215/85R16 TIRES.  5 OF THE TIRES WERE FOUND TO HAVE SERIOUS DEFECTS OF BELT PACKAGE SEPARATION (ALL 4 DUAL WHEEL TIRES AS WELL AS THE FRONT TIRE ON THE DRIVER'S SIDE). THE SALESMAN HAD ALSO MEASURED THE TREAD SAYING IT WAS EXCELLENT WITH LITTLE SIGN OF WEAR. KUMHO IS PAYING 62 PERCENT OF THE COST OF 6 NEW KUMHO TIRES DIRECTLY THROUGH DISCOUNT TIRE WHICH WE WERE ABLE TO APPLY TO 6 NEW MICHELINS TIRES , AS WE DO NOT FEEL CONFIDENT IN KUMHO TIRES. THE DISCOUNT TIRE SALESMAN SAID IT'S OBVIOUS OUR KUMHOS HAD A SERIOUS PRODUCTION DEFECT AND HE WAS SURPRISED WE HAD NOT HAD AT LEAST ONE OF OUR TIRES LOSE A COMPLETE TREAD AND CAUSE MAJOR DAMAGE. WE ARE SO THANKFUL AS WE REALIZE WE COULD HAVE HAD A SERIOUS ACCIDENT. *TR",
        "vin": "WDXPF445989"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/21/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344435,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DEFECTIVE TIRES.  2 TIRES STATIC BLOWOUT, THIRD TIRE BUBBLE FORMED ON SIDEWALL, ALL WITHIN 2000 MILES.  THESE WERE ON THE ORIGINAL VEHICLE AT TIME OF PURCHASING NEW.  REPLACED WITH 7 NEW TIRES.  HAVE PICTURES AND 5 OF THE DEFECTIVE TIRES. *TR",
        "vin": "WDXPF445589"
    }
]