[
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438374,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a repetitive problem with mold and AC leaks with the Scion xD. I’m having breathing problems and I feel sick.  Geico and Toyota have discovered mold in my vehicle.  It is actually visible but I have no idea how long there has been a leak or how long I have been breathing in mold.  The AC line is under the carpet with no protective barrier which is an ideal environment for mold to grow. When I looked up a way to fix the issue several videos came up with many others who have the same issue which means it is not a maintenance issue it is a defect that has never been recalled. Toyota has serviced my vehicle for years and never brought up this issue.  I didn’t notice a problem until there was a pool of water in my car and mold growing on my seats. When I brought it in to Toyota they  told me what the problem was instantly. They’ve seen it plenty of times before.  When I looked online I see several owners of ScionxD made in different years with the same problem. How long has my car had this leak and how long have I been breathing in mold before it was visible to my eye? Seeing as there are so many Toyota Scion drivers/owners with this issue I am reporting it to NHTSA and calling Toyota Scion Corporate Headquarters. Corporate headquarters did nothing about the issue even after I expressed my concern for the children in danger of being exposed to mold who ride in these cars everyday. I am still breathing heavy and suffering from headaches. The Toyota dealership said it would cost $4400 to fix the entire issue. Why place a tube under a carpet without protection?  I wish I was informed of this earlier.",
        "vin": "JTKKU4B45A1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405431,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SCION XD. THE CONTACT STATED THAT THE REAR DRIVER'S SIDE SEAT BELT FAILED TO LATCH SECURELY. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE WARRANTY WAS EXPIRED AND THAT NO ASSISTANCE WOULD BE PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 69,000.",
        "vin": "JTKKU4B48A1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN HIGHWAY BEHIND A SLOW TRUCK. WENT TO PASS AND ACCELERATED TO 50 MPH WHEN ENGINE BECAME ABNORMALLY LOUD AND FELT AS THOUGH SOMEONE HAD TAKEN OVER THE CAR AND IT WANTED TO RACE. RPMS WERE MAXED. I FLOORED BRAKES AND GOT VEHICLE TO SLOW TO 40MPH. PULLED BACK INTO MY LANE, BUT COULD NOT GET THE CAR TO GO ANY SLOWER. I FELT AS IF I WAS GOING TO HIT THE VEHICLE IN FRONT OF ME. WITH TWO BIG TRUCKS BEHIND ME, I FEARED CAUSING AN ACCIDENT. I PULLED OFF ONTO THE GRAVEL ON THE SIDE OF THE ROAD AND CONTINUED DRIVING. I COULD NOT STOP SO THREW IT INTO PARK AT 40 MPH. ENGINE MADE A HORRENDOUSLY LOUD NOISE AS IF IT WAS GOING TO BLOW UP. TURNED CAR OFF AND ON. MADE SAME AWFUL NOISE. TURNED CAR OFF, WAITED 10 MINS, TURNED BACK ON AND IT WAS FINE. TOOK IT TO THE TOYOTA TO BE SERVICED ON MON AND DESCRIBED ACCIDENT. I ASSUMED THERE WAS A PROBLEM WITH THE CRUISE CONTROL, AND ASKED IF THERE WERE ANY RECALLS REGARDING THIS ISSUE. AFTER THAT I LEARNED OF THE UNINTENDED ACCLERATION (UA) ISSUE THAT TOYOTA DEALT WITH AND THE 1.2 BILLION DOLLAR SETTLEMENT FOR THE VICTIMS WHO HAD DIED OR WERE HARMED IN ACCIDENTS. MY CAR WAS MANUFACTURED AT THIS TIME AND MY ENGINE IS A TOYOTA COROLLA. I CALLED TOYOTA HEADQUARTERS AND WAS TREATED RUDELY AND SCOFFED AT . I CALLED MANAGER TO REPORT. SHE SET UP AN APPOINTMENT BACK AT THE SAME DEALERSHIP. 2-DAY INVESTIGATION DETERMINED IT WAS DUE TO MY AFTER-MARKET FLOOR MATS CAUSING THE PEDAL ENTRAPMENT. I HAD ACTUALLY TRIED TO REPLICATE THIS ISSUE IN MY DRIVEWAY PRIOR TO THE EXAM AND DID GET THE PEDAL TO STICK WITH MAT, BUT I COULD NOT GET THE RPMS TO ACCELERATE MUCH, NOTHING LIKE I HAD EXPERIENCED (10 RPM VS 3). I ALSO DID NOT FEEL A FLOOR MAT CATCH OR RELEASE DURING EVENT. IN MY SIMULATION I FELT  IT CATCH AND RELEASE. I ASKED TO SPEAK TO THE TECHNICIAN REGARDING THIS ISSUE. THE SERVICE MANAGER SAID I WAS NOT ALLOWED TO SPEAK TO TECHNICIAN.",
        "vin": "JTKKU4B48A1"
    },
    {
        "components": "SUSPENSION,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891510,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DOOR LOCKS SEATS. MOVING BRAKE PETAL.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2015",
        "dateOfIncident": "12/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SCION. THE CONTACT STATED THAT THE VEHICLE FAILED TO REVERSE WHEN PROMPTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "JTKKU4B42AJ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/15/2015",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SCION XD. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V169000 (SEATS) AND STATED THAT THE PART NEEDED WAS NOT AVAILABLE FOR AN EXTENDED PERIOD OF TIME. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JTKKU4B42AJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "11/23/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10654821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SCION XD. THE CONTACT STATED THAT WHILE MAKING A LEFT TURN AT APPROXIMATELY 15 MPH, ANOTHER VEHICLE CRASHED INTO THE CONTACT CAUSING THE CONTACT TO LOSE CONTROL OF THE VEHICLE. THE CONTACT CRASHED INTO A TRAFFIC SIGN AND THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED INJURIES TO THE SPINE AND BACK. THE PASSENGER SUSTAINED INJURIES TO THE KNEES, THE BACK AND NECK. THEY BOTH RECEIVED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS NOT AVAILABLE.   UPDATED 01/23/15*LJ   UPDATED 9/5/2017*CN",
        "vin": "JTKKU4B45AJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522366,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SCION XD.  CONSUMER WRITES IN REGARDS TO VEHICLE OIL AND OIL FILTER ISSUES.  *SMD  THE CONSUMER STATED THE VEHICLE WAS EMITTING BLUE SMOKE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512032,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING IN A SLOW SPEED WHEN I WANTED TO STOP SLOWLY AND THE CAR DID NOT STOP, AND FELT LIKE IT GOT STUCK IN THE MIDDLE OF THE WAY OF THE BRAKES, THEN STOP SUDDENLY AND ACCELERATED. IT WAS FRIGHTENING BECAUSE WE WERE TO A SHORT DISTANCE TO CRASH. I WAS WITH MY HUSBAND AND MY DOG WAS IN THE BACK SEAT WHEN ALL THIS HAPPENED. WE TOOK THE CAR TO THE DEALER, THEY MADE AN INSPECTION BUT THEY TOLD US THAT THE CAR WAS FINE AND THAT THE BRAKES WERE WORKING PRETTY WELL, THIS REVISION WAS THE NEXT DAY (APRIL 16TH). ON THE 28TH OF THE SAME MONTH WHEN WE WERE DRIVING IN THE FREEWAY IT HAPPENED AGAIN.  WE ARE REALLY CONCERN ABOUT THE SAFETY OF THIS CAR.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "04/18/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY THE CAR STALLED AND THEN PROCEEDED WITH ABOUT HALF POWER.  A VISIT TO THE DEALER HAS DIAGNOSED AN ISSUE WITH THE FIRST CYLINDER.  VALVE SPRINGS, ETC.  THEY HAVE DENIED WARRANTY COVERAGE..... *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/20/2010",
        "dateOfIncident": "12/07/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371784,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SCION. THE CONTACT STATED THAT WHILE TRYING TO DECREASE IN SPEED HER VEHICLE ACCELERATED UP TO 47 MPH. SHE WAS ABLE TO STOP THE VEHICLE BY PLACING IT INTO NEUTRAL. THE VEHICLE WAS INSPECTED BY A DEALER AND THEY HAVE NOT INFORMED HER OF THE DIAGNOSIS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 9600. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/08/2010",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "XD",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHTS ON NEW 2010 SCION XD WITH NAVIGATION SYSTEM STOPPED WORKING. THE PROBLEM WAS TRACED TO A BLOWN FUSE. *TR",
        "vin": "JTKKU4B49AJ"
    }
]