[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "12/13/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051765,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "1GNUCHE00AR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955108,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CVT TRANSMISSION SEEMS TO BE A PROBLEM ITEM. MY TRANSMISSIONS SEEMS TO BE SLIPPING SINCE AROUND 143,000 MILES. HAD A NEW OEM TORQUE CONVERTOR INSTALLED. WHEN DRIVING THE TRANSMISSION/TORQUE CONVERTER BANGS AT AROUND 20MPH AT SLOW ACCELERATION/DECELERATION. MOST ANY SPEED AT A CRUISING DRIVE THE TRANSMISSION SEEMS TO HAVE THE ENGINE LUGGING HARD. I'VE ALREADY BEEN ABLE TO PRESS THE GAS PEDAL AS THE RPMS INCREASE TO NEAR 2,000 RPMS BEFORE THE CAR WILL START MOVING. THERE'S A VIBRATION THAT FEELS LIKE ITS COMING FROM THE TRANSMISSION AS WELL. AT TIMES I HAVE TO USE THE PADDLE SHIFTER TO DOWNSHIFT OR UPSHIFT TO HAVE THE TRANSMISSION ADJUST AS NEEDED TO MAKE IT UP HILLS OR TO ACCELERATE AND TO DROP FROM HIGH RPMS A CRUISING TO PROPER RPMS. THIS 2010 CVT IS A DISASTER AND SHOULD BE RECALLED AT THE LEAST. SUBARU SAYS THERE'S NO FIX BUT IS AWARE OF THE ISSUE BEING WIDESPREAD. REALLY? ONGOING SINCE 143,000 MILES AND CURRENTLY AT 157,300 MILES.",
        "vin": "4S4BRBCC9A3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "04/16/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706305,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DROPPED OFF CAR FOR 45K MILE SERVICE AND WHILE ROTATING THE TIRES WAS WARNED THAT THE FRONT BRAKE ROTORS WERE SEVERELY WORN AND RUSTED AND PADS WORN AT 95%. THEY RECOMMENDED REPLACEMENT BECAUSE IF THE ROTORS WERE TO BE CUT, THEY WOULD FALL BELOW ACCEPTABLE SAFETY TOLERANCE. AS SUCH, THEY WERE REPLACED AND THOUGH WE HAD THE 7YR/70K MILE \"GOLD PLUS\" EXTENDED WARRANTY, THE ROTORS WERE NOT COVERED (OF COURSE) UNDER THE EXTENDED WARRANTY. THE TRIBECA IS OUR FIRST SUBARU HOWEVER, NOT OUR FIRST NEW CAR. WE HAVE A JEEP GRAND CHEROKEE WITH 98K MILES AND HAS THE ORIGINAL FRONT ROTORS AS DID OUR HONDA CR-V, CHEVY BLAZER AND FORD EXPLORER. ALL HAD ORIGINAL FRONT ROTORS WELL INTO THEIR RESPECTIVE 90-110K MILES. GOOD THING THAT THE SERVICE TECH CAUGHT THE PREMATURE RUST ON THE ROTORS AS THEY BOTH APPEARED TO BE CLOSE TO SEPARATING FROM THE CARRIERS. MY WIFE IS BEGINNING TO HAVE TRUST ISSUES WITH THE CAR NOW.   *TR",
        "vin": "4S4WX9HD3A4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681361,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 45 MPH, THE HOOD OF THE 2010 SUBARU TRIBECA OPENED AND CAME BACK FAR ENOUGH TO BREAK THE WINDSHIELD.  THE VIEW OF THE DRIVER WAS COMPLETELY BLOCKED ALMOST CAUSING A MAJOR ACCIDENT.  POLICE WAS CALLED TO FILE A REPORT.  THIS A MAJOR SAFETY ISSUE.  *TR",
        "vin": "4S4WX9GD0A4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "06/28/2014",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610780,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING THE CAR AND SUDDENLY SMELLED  SMOKE SO SHE PULLED OVER AND NOTICED THAT THE CAR WAS ON FIRE AND IT WAS COMING FROM THE BACK PASSENGER DOOR. LUCKILY TWO GUYS DRIVING BUY STOPPED AND HAPPEN TO WORK FOR HONDA AND THEY PUT OUT THE FIRE WITH AN EXTINGUISHER  THEN THE POLICE AND TOE TRUCK CAME AND TOOK THE CAR AWAY. THE REAR PASSENGER DOOR WAS COMPLETELY RUINED AS WELL AS MY 2 KIDS CAR SEATS AND THE WHOLE INTERIOR IN THE CAR FROM THE FIRE AND EXTINGUISHER AS WELL AS OTHER INTERIOR OF THE CAR THAT WAS AFFECTED.   PROGRESSIVE INSURANCE CAME TO CHECK THE CAR SINCE SUBARU OF AMERICA DIDN'T WANT TO TAKE BLAME WITHOUT THE INSURANCE COMING AND PLACING THE BLAME ON THEM FIRST THIS IS DEFINITELY SUBARUS FAULT AND THE CAR MUST HAVE FAULTY WIRING OR A DEFECT THAT NEEDS TO BE RECALLED.  *TR",
        "vin": "JF1GPAC67CH"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/03/2011",
        "dateOfIncident": "08/30/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423179,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "B9 TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ROUNDING A LEFT HAND TURN AT APPROXIMATELY 15- 20  MPH, THE PASSENGER LOWERED THE PASSENGER DOOR WINDOW USING THE POWER WINDOW SWITCH-  THE DOOR FLEW OPEN , BUT WAS CAUGHT BY THE PASSENGER GRABBING THE DOOR , PREVENTING IT FROM HITTING A TELEPHONE POLE NEXT TO THE ROADWAY.  THE VEHICLE WAS THEN STOPPED AND THE DRIVER EXITED VEHICLE AND WENT TO PASSENGER SIDE AND ATTEMPTED TO CLOSE DOOR, WHICH WOULD NOT LATCH AND STAY CLOSED.  AFTER CYCLING THE ELECTRIC LOCK SWITCH AND THEN CYCLING THE LOCK LEVER MANUALLY, THE DOOR CLOSED AND STAYED SHUT.  UPON ARRIVAL   HOME TO PARK CAR, PASSENGER DOOR WOULD NOT OPEN.  DRIVER THEN CYCLED WINDOW CLOSED AND DOOR LOCK RELEASED AND DOOR COULD BE OPENED AND CLOSED.  WE HAVE NOT RECEIVED ANY RECALL NOTICES FROM EITHER THE SELLING DEALER OR THE MANUFACTURER.  *TR",
        "vin": "4S4WX9GD9A4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370614,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STARTED WITH THE REMOTE CAR STARTER THE CAR DOES NOT SHUT OFF WHEN THE BRAKE IS ENGAGED ALLOWING THE CAR TO BE PUT INTO GEAR WITH OUT THE IGNITION IN ON POSITION.  CAR IS THEN ABLE TO BE DRIVEN WITH OUT KEYS IN ON POSITION. *TR",
        "vin": "4S4WX9KD9A4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370617,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "TRIBECA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUBARU TRIBECA. THE CONTACT STATED THAT THE REMOTE AUTOMATIC STARTER WOULD NOT DISENGAGE WHEN THE KEYS WERE NOT IN THE IGNITION. THE VEHICLE WAS TAKEN TO THE DEALER WHO COULD NOT DUPLICATE THE FAILURE AND ADVISED THAT A FAILURE WAS NOT PRESENT IN THE VEHICLE. THE MANUFACTURER WAS E-MAILED BUT HAD NOT RESPONDED YET TO THE CONTACTS INQUIRY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "4S4WX9KD9A4"
    }
]