[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291334,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,    THIS IS REGARDING RECALL VG/14V-464 FOR MY 2010 SUZUKI KIZASHI THAT I RECEIVED IN A LETTER DATED AUGUST 9, 2019    THE NEAREST SUZUKI DEALERSHIP IS OUT OF STATE AND REQUIRES ROUNDTRIP TRAVELING OF APPROX 50 MILES PLUS TOLL CHARGES.    I WOULD LIKE MY MECHANIC AT BD AUTOMOTIVE TO PERFORM THIS SERVICE. THEY ARE LOCATED AT:    24 MIDDLE RD,  NEWBURY MA 01951,  PH. 978-465-2900    SUZUKI HAS NOT RESPONDED TO MY REQUEST TO HAVE THIS SERVICE COMPLETED AT BD AUTOMOTIVE.  PLEASE LET ME KNOW WHAT I NEED TO DO SO THAT BD AUTOMOTIVE CAN PERFORM THE SERVICE.  THEY ARE LOCATED WALKING DISTANCE FROM MY HOUSE AND WILL ALLOW ME TO WORK FROM HOME DURING THE 5 HOURS THAT THIS SERVICE REQUIRES.    IT'S ALSO A LOT OF FUEL, WEAR & TEAR, TOLL CHARGES, AND I WOULD NEED TO ARRANGE CHILD CARE & TAKE A DAY OFF FROM WORK TO TRAVEL OUT OF STATE, AND WAIT 5+ HOURS IN THE SERVICE DEPARTMENT TO HAVE THE SERVICE COMPLETED.    THANK YOU FOR YOUR ASSISTANCE IN THIS MATTER.",
        "vin": "JS2RF9A10A6"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2017",
        "dateOfIncident": "09/17/2017",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023847,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LOOKING TO BUY THIS CAR HERE IN ARIZONA, AND THIS VIN SEEMS TO MATCH THE VEHICLE...BUT DOESN'T COME BACK WITH RESULTS WHEN I PLUG VIN # IN TO DATABASES. COULD YOU PLEASE CHK VIN [XXX] AND TELL ME IF THIS CAR IS AFFECTED AND IF SO, WHETHER RECALLS WERE COMPLETED?  THANK YOU.  -[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JS2RF9A76A6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/13/2017",
        "fire": true,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980506,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 SUZUKI KAZASHI. WHILE DRIVING APPROXIMATELY 15 MPH, THE CONTACT NOTICED A SMOKE ODOR FROM THE RADIO SPEAKERS NEAR THE BACK SEATS OF THE VEHICLE. THE CONTACT PULLED OVER AND STOPPED THE VEHICLE. THE RADIO SPEAKER IN THE BACKSEAT CAUGHT ON FIRE, WHICH SPREAD TO THE ENTIRE VEHICLE. THE VEHICLE WAS TOWED AND DEEMED TOTALED. A REPORT WAS FILED WITH THE FIRE DEPARTMENT. THE CONTACT DID NOT RECEIVE ANY INJURIES. THE APPROXIMATE FAILURE MILEAGE WAS 115,000. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.",
        "vin": "JS2RF9A7XA6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892957,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 (NA) SUZUKI KAZASHI. WHILE DRIVING APPROXIMATELY 40 MPH, THE AIR BAGS DEPLOYED WITHOUT WARNING OR IMPACT WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHO STATED THAT THE VEHICLE MUST HAVE CRASHED INTO SOMETHING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "JS2RE9A3XB6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746189,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THREE OF THESE CARS AND IT DOES NOT HAPPEN JUST ON MINE. THE BEGINNING OF LAST YEAR I TOOK A ROAD TRIP AND ON THE HWY MY CAR WENT FORM 78 TO LESS THEN 40 ON THE FREEWAY. I HAD TO PULL OVER. THROUGOUT THE COURSE OF HAVING OUR CARS THE DEALERSHIP CALLED IT VAPOR LOCK. YOU HAVE TO PULL OVER AND LET YOU CAR REST? ON 08/01/2015 I WAS DRIVING HOME FROM WORK AND IS ONLY A 35 MINUTE DRIVE MY CAR LOST ALL POWER IN THE MIDDLE OF A INTERSECTION I WAS ALMOST HIT BY ANOTHER CAR BUT THEY WERE ABLE TO SWERVE AND MISS MY CAR. IT IS STARTING TO LOSE POWER MORE AND MORE AND IN SHORTER DISTANCES TRAVELED. AS I STATED WE OWN THREE OF THEM AND IT HAPPENS IN ALL THREE. WE HAVE TO RENT A CAR WHEN DRIVING TO CA. THIS NEEDS TO BE LOOKED INTO.",
        "vin": "JS2RF9A8986"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/19/2014",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626368,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS RECALLED FOR AN EXAPORATOR LINE REPAIR ON THE FUEL TANK AND THE CLOSEST AUTHORIZED REPAIR CENTER IS IN WILMINGRON.NC A 3 HOUR DRIVE FOR ME AND RETURN AND I AM DISABLED AND CANNOT GO THAT FAR NEED ANOTHER SOLUTION SUZUKI WILL NOT SEND ME THE PARTS TO HAVE NEINEKE DO THE WORK LOCAL.  *TR",
        "vin": "JS2RE9A56A6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/07/2012",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483627,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "KAZASHI",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI KAZASHI GTS. THE CONTACT STATED THAT WHILE DRIVING THE HEADLIGHTS FAILED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE FRONT BUMPER NEEDED TO COME OFF THE VEHICLE IN ORDER FOR THE LIGHT BULB TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 45,550. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    }
]