[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "12/08/2010",
        "fire": false,
        "manufacturer": "Tesla, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425527,
        "products": [
            {
                "manufacturer": "Tesla, Inc.",
                "productMake": "TESLA",
                "productModel": "ROADSTER2",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 30MPH, MY CAR EXPERIENCED \"DRIVE LOSS\", WHICH MEANS THE POWER TRAIN WAS SHUT DOWN SO THE CAR COULD ONLY COAST TO A STOP. THIS HAPPENED WITH NO WARNING.  AS THE POWER WAS SHUT DOWN, THE ON BOARD SCREEN STATED \"POWER TRAIN SHUT DOWN\" OR A SIMILAR MESSAGE. I WAS NOT IN A DANGEROUS SITUATION AT THE TIME, SO I WAS ABLE TO STOP WITHOUT BEING HIT BY ANOTHER VEHICLE. THE MANUFACTURER INVESTIGATED THE PROBLEM. THE SOFTWARE ON BOARD THE CAR \"DECIDED\" TO CAUSE THE SHUT DOWN. IN THIS CASE, THE SOFTWARE DECIDED TO SHUT DOWN ALL SYSTEMS IN ORDER TO PROTECT THE BATTERY. IT DID THIS BECAUSE A FAULTY SENSOR ON THE BATTERY SENT A SIGNAL THAT THE TEMPERATURE WAS EXTREMELY COLD.  EXTREME COLD IS HARMFUL TO THE BATTERY LIFE, SO THE CAR SHUTS DOWN TO AVOID COSTLY BATTERY REPLACEMENTS. TESLA MANAGEMENT HAS CONFIRMED THAT THIS SHUT DOWN PROCESS CAN OCCUR FOR MANY OTHER REASONS AS WELL, AND IS USED IN GENERAL AS A WAY TO HANDLE EXCEPTIONAL CONDITIONS. I THINK IT IS EXTREMELY DANGEROUS FOR THE ON BOARD SOFTWARE TO SHUT DOWN A VEHICLE WHILE IN MOTION. I AM NOT AWARE OF ANY OTHER VEHICLE AUTONOMOUSLY MAKING SUCH \"DECISIONS\", SO I FEEL IT IS IMPORTANT TO REPORT THIS HAZARD TO THE SAFETY OF OCCUPANTS OF TESLA ROADSTERS. THE VEHICLE WAS COMPLETELY DRIVABLE AT THE TIME. I WAS ABLE TO START IT AGAIN, AND THE PROBLEM RECURRED 6 MORE TIMES SEQUENTIALLY. TESLA HAS PROMISED A SOFTWARE FIX TO ADDRESS THE PROBLEM, BUT HAS NOT DELIVERED ONE. I HAVE BEEN WAITING FOR A OVER 8 MONTHS FOR THEM TO FIX IT, HENCE THE DELAY IN MY REPORT TO NHTSA.  *KB",
        "vin": "5YJRE1A19A1"
    }
]