[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377700,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I NEED THE RECALL PAGE FOR THE POWER STERING , WAS IN MOTION",
        "vin": "JS2YA5A79A6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11118577,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COMING TO A COMPLETE STOP AT A STOP SIGN, I SLOWLY TURNED THE CORNER TO PULL INTO A PARKING LOT WHEN THE VEHICLE SUDDENLY ACCELERATED TO A HIGH SPEED ON THE CITY STREET. I WAS UNABLE TO STOP THE VEHICLE BEFORE HITTING A PARKED CAR. THE AIR BAGS DEPLOYED - MINOR INJURIES WERE SUSTAINED AND THE CAR WAS EXTENSIVELY DAMAGED.   IN RESEARCHING THE CAUSE, I SEE SIMILAR COMPLAINTS ABOUT THE SUZUKI SX4 AND ITS \"SUDDEN UNINTENDED ACCELERATION\" PROBLEM ON THE NHTSA WEBSITE, REPAIRPAL, AND CNN. AT THIS POINT, THE DAMAGE HAS NOT BEEN REPAIRED THOUGH IT IS LIKELY TO BE $4,000-$5,000.",
        "vin": "JS2YB5A71A6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041725,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SX4. AFTER PLACING THE VEHICLE IN PARK AND RELEASING THE BRAKE PEDAL, THE VEHICLE BEGAN TO ROLL BACKWARDS. THE CONTACT STOPPED THE VEHICLE, BUT WAS UNABLE TO SHIFT THE VEHICLE INTO ANY OTHER GEAR. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC. A DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THEY COULD NOT ASSIST BECAUSE THE VEHICLE HAD ALREADY BEEN SERVICED PER NHTSA CAMPAIGN NUMBER: 14V118000 (POWER TRAIN). THE APPROXIMATE FAILURE MILEAGE WAS 43,000.",
        "vin": "JS2YC5A25A6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/27/2016",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937641,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT PASSENGER DOOR WILL NEITHER UNLOCK NOR OPEN DUE TO FAULTY \"DOOR LATCH\", CREATING A SAFETY HAZARD AS VEHICLE EGRESS IS IMPOSSIBLE UNDER EMERGENCY CONDITIONS. SUZUKI DEALER OR AUTHORIZED SERVICE CENTER STATES OEM REPLACEMENT PART WILL TAKE THREE MONTHS TO REPLACE ONCE IT IS ORDERED, AS IT NEEDS TO BE SHIPPED FORM SUZUKI JAPAN, WITH AN ESTIMATED COST OF $250 FOR PARTS & LABOR EXCLUDING TAX.",
        "vin": "JS2YC5A92A6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913972,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2010 SUZUKI SX4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 13V405000 (AIR BAGS) AND 11V055000 (ELECTRICAL SYSTEM). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JS2YC5A25A6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2015",
        "dateOfIncident": "09/25/2015",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778209,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPOX 5MPH TURNING INTO A PARKING LOT THE PASSENGER SIDE SEAT AIRBAG AND CURTAIN AIRBAG DEPLOYED. THERE WAS NO ONE SITTING IN THE PASSENGER SEAT  NOR WAS THERE ANY WEIGHT ON THE SEAT. CAR HAS APPOX 33K MILES ON IT AND HAS NEVER BEEN IN AN ACCIDENT. I AM WAITING ON WORD FROM SUZUKI AS TO WHAT THEY WILL OR WILL NOT DO. DRIVER SIDE SEATBELT ALSO LOCKED IN PLACE ONCE RELEASED AND CANNOT BE RETRACTED.",
        "vin": "JS2YA5A99A6"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574673,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A VEHICLE RECALL NOTICE--13V405000. THAT HERE WAS A DEFECTIVE AIR BAG SEAT SWITCH. I CALLED THE DEALER AND WAS TOLD TO WAIT FOR A SECOND LETTER, CALLED SUZUKI AND WAS GIVEN THE SAME RUN AROUND. HOW LONG DOES IT TAKE. IF THIS SWITCH FAILS THE AIR BAG WILL NOT WORK AND SOMEONE COULD BE INJURIED.THIS IS GOING ON SIX MONTHS NOW. THE CAR IS LISTED UNDER MY WIFE'S NAME.  *TR",
        "vin": "JS2YB5A37A6"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/16/2014",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564650,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AND I HEARD A THUMP. I THEN REALIZED THAT THE BATTERY LIGHT WAS ON, AND I HAD LOST POWER STEERING. THE ENGINE STARTED HEATING UP SHORTLY THERE AFTER. I FEEL THAT THIS WAS A MAJOR SAFETY ISSUE BECAUSE THE POWER STEERING WENT OUT. I'M VERY THANKFUL I WAS CLOSE TO HOME AND NOT ON A MAJOR HIGHWAY, OTHERWISE THIS MAY HAVE RESULTED IN A CRASH.    THE BELT TENSIONER IN THIS VEHICLE HAD PREVIOUSLY BEEN REPLACED AS PART OF A RECALL. UPON CONSULTING THE MECHANIC, THAT WAS AGAIN THE PROBLEM. A BELT TENSION SHOULD LAST MORE THAN A COUPLE OF YEARS. THIS VEHICLE IS DRIVEN VERY LIGHTLY, MOSTLY AROUND TOWN. IT IS MY BELIEF THAT THE REPLACEMENT BELT TENSIONER WAS NO LESS FAULTY THAN THE ONE REPLACED IN THE ORIGINAL RECALL. BECAUSE MY WARRANTY HAD LAPSED, I HAD TO PAY FOR THE REPAIR OUT OF POCKET, EVEN THOUGH IT IS MY BELIEF THAT THE REPLACEMENT PART WAS CLEARLY DEFECTIVE.  *TR",
        "vin": "JS2YA5A35A6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/18/2013",
        "dateOfIncident": "11/17/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10552668,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SX4. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH IN RAINY WEATHER, HE LOST CONTROL OF THE VEHICLE AND CRASHED INTO A DITCH. THE AIR BAGS FAILED TO DEPLOY. THE FRONT SEAT PASSENGER SUSTAINED INJURIES TO THE NECK AND SHOULDER. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION CENTER AND WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE INCIDENT. THE APPROXIMATE FAILURE MILEAGE WAS 54,800.",
        "vin": "JS2YA5A31A6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2013",
        "dateOfIncident": "07/18/2013",
        "fire": true,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525650,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SX4. THE CONTACT STATED THE WHILE DRIVING 25 MPH, THE VEHICLE STARTED TO SHAKE AND SMOKE FROM THE ENGINE. THE CONTACT PULLED OVER AND HAD THE VEHICLE TOWED TO A DEALER. THE DEALER STATED THAT OIL HAD LEAKED ONTO THE ENGINE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "JS2YA5A90A6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "04/04/2013",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509224,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SK4. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED AND THE FUEL LEVEL GAUGE FAILED. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DETERMINED THAT THE COMPUTER WAS NOT REGISTERING TO THE INSTRUMENT PANEL. THE VEHICLE WAS NOT REPAIRED. THE CURRENT MILEAGE WAS 44,000.   *TR",
        "vin": "JS2YA5A30A6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2012",
        "dateOfIncident": "10/12/2012",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10481120,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SX-4. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, SHE HEARD A LOUD NOISE AND THE STEERING WHEEL LOCKED UP. THE CONTACT WAS UNABLE TO PULL TO THE RIGHT, SO SHE ABRUPTLY ENGAGED THE BRAKES CAUSING NJURIES TO HER BACK. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT TENSIONER HAD FRACTURED AND NEEDED TO BE REPLACED. THE MECHANIC WAS UNABLE TO DO THE REPAIRS AND ADVISED HER TO CONTACT THE DEALER. THE VEHICLE WAS TOWED DEALER WHERE THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER 11V055000 (ELECTRICAL SYSTEM: ALTERNATOR/GENERATOR/REGULATOR). IN ADDITION, THE CONTACT WAS INFORMED THAT HER AIR BAG LIGHT WAS ON AND THEY WOULD HAVE TO DIAGNOSE THE FAILURE BEFORE DOING ANY REPAIRS. THE CONTACT DID NOT APPROVE THE DIAGNOSIS SINCE IT WOULD BE AT HER EXPENSE. THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 5,050.",
        "vin": "JS2YC5A45A6"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/14/2012",
        "dateOfIncident": "12/27/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447935,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 SUZUKI SX4 AND HAVE HAD 2 FAILURES OF THE TIRE PRESSURE SYSTEM MONITORS IN LESS THAN 2 MONTHS. BOTH TPSM VALVES HAVE FRACTURES/CRACKS LEADING DOWN THE THREADING OF THE VALVE ALLOWING AIR TO LEAK. THE FIRST FAILURE WAS IN DEC 2011 AND RESULTED IN A FLAT WHILE PARKED IN A GARAGE. THE SECOND FAILURE WAS FOUND WHEN I NOTICED THE FRONT RIGHT TIRE WAS AT 15 PSI. ONCE AGAIN THE TPSM VALVE WAS CRACKED LENGTH WISE. THERE IS DEFINITELY A PROBLEM IT APPEARS IN THE MANUFACTURING OF THESE VALVES BY SCHRADER ELECTRONICS. INFO ON THE TPSM VALVE:   PART NO: 43130-54J2  FCC ID: 2546A-SUZ3MA4  SCHRADER ELECTRONICS  BARCODE: *09754328* AND *09754116*    I'M HAVING PROBLEMS GETTING THIS ISSUE RESOLVED BY THE DEALERSHIP ON A VEHICLE THAT IS ONLY 1 YEAR 4 MONTHS OLD AND I HAVE EXTENSIVE PLATINUM WARRANTY. THIS IS A HUGE SAFETY ISSUE FOR ME AND MY FAMILY. A SUDDEN FAILURE BY THE REMAINING VALVES COULD LEAD TO SERIOUS INJURIES OR DEATH AS WAS THE CASE IN 2008 TPSM VALVE FAILURES. THIS NEEDS TO BE SERIOUSLY LOOKED INTO CLOSELY.     NOTE: I HAVE HAD THE TWO FAULTY VALVES REMOVED AND REPLACED WITH RUBBER VALVES IN THE MEANTIME.  *TR",
        "vin": "JS2YB5A37A6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2011",
        "dateOfIncident": "04/21/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441195,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "- - - THE PROBLEM WITH THIS CAR IS A POOR AND DANGEROUS DESIGN FEATURE. THERE ARE TWO (2) ROOF FRAME SUPPORTS ON EACH SIDE AT THE WINDSHIELD. ONE IS FOR THE WINDSHIELD THE OTHER IS FOR THE SMALL SIDE WINDOW AND THEY BOTH COME TOGETHER AT THE TOP, AND WHEN THEY DO THEY TAKE UP SO MUCH SPACE THAT THEY TOTALLY BLOCK THE DRIVERS VIEW OF THE ROAD ON BOTH SIDES. ANY CAR OR PERSON IN THAT AREA BEHIND THE FRAME CAN NOT BE SEEN AT ALL. WHEN DRIVING THE DRIVER HAS TO CONSTANTLY BE MOVING THEIR UPPER BODY BACK AND FORTH TO SEE AROUND THE FRAME. WHEN I BOUGHT THE CAR I WAS NOT ABLE TO DRIVE IT FOR THE FIRST WEEK DUE TO FAMILY HEALTH ISSUES THAT I HAD TO STAY AT HOME FOR. IN TWO DAYS AFTER I DID DRIVE AGAIN I ALMOST PULLED OUT IN FRONT OF AND WOULD HAVE HIT A CAR COMING AROUND A CURVE THAT COLD NOT BE SEEN BECAUSE OF THIS DANGEROUS CONSTRUCTION. SINCE THEN I HAVE HAD THAT SAME CLOSE CALL OVER 1 DOZEN TIMES. IT IS SUCH A PROBLEM THAT I HARDLY EVER DRIVE THE CAR MORE THAN I HAVE TO  GO TO A STORE FOR FOOD. THE CAR IS OVER 1-1/2 YEARS OLD AND I HAVE LESS THAN 2,500 MILES ON IT TO CLOSE LOCAL STORES AND FAMILY DOCTORS.  - - THIS CAR IS SO DANGEROUS TO DRIVE THAT IT SHOULD NEVER HAVE BEEN ALLOWED TO BE SOLD IN THIS COUNTRY AND SHOULD BE TAKEN OFF THE ROAD. SOONER OR LATER IT IS GOING TO KILL PEOPLE. I HAVE ALREADY SEEN SOME IN USED CAR LOTS. IT LOOKS LIKE OWNERS ARE ALREADY GETTING RID OF THEM.  *TR",
        "vin": "JS2YA5A30A6"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "03/10/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419640,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 SUZUKI SX4 AND IT'S 4 TIRE PRESSURE SENSORS HAVE CORRODED AND SPLIT ON THE STEM. LEADING TO LEAKS AND LOW PRESSURE.  MY WIFE WAS GOING TO WORK AND WENT T A TIRE DEALER TO SEE WHAT THE LOW PRESSURE WARNING WAS ABOUT AND THEY FOUND THE CRACKED STEM AND REPLACED IT BECAUSE IT WAS UNKNOWN HOW LONG IT WOULD LAST. THE DEALER SAYS THAT ALL WARRANTY WORK HAS TO BE DONE BY A DEALER AND HAS GIVEN ME SOME PROBLEMS.  THIS I FEEL IS  A SAFETY ISSUE AND A POOR PRODUCT CONSTRUCTION THAT COULD LEAD TO DANGEROUS CONDITIONS WHILE ON THE ROAD.  *KB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "12/05/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10370682,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT FOUR WAY INTERSECTION, TRAFFIC LIGHT TURNS GREEN VEHICLE BESIDE ME  IN RIGHT LANE TAKES OFF, I TAKE OFF CROSSING INTERSECTION A VEHICLE COMING FROM LEFT FAILS TO STOP AT RED LIGHT, HITS ME ON LEFT FRONT CORNER ON CAR (DRIVER SIDE) PUSHES ME, MAKING MY CAR SPIN, WHERE MY LEFT REAR QUARTER PANEL HITS THE CAR IN QUESTION, THEN HE  PROCEEDS TO PUSH ME TWO LANES OVER TO RIGHT. VEHICLE WAS A TOTAL LOSS AND NO AIRBAGS DEPLOYED. ESTIMATED SPEED OF THE OTHER DRIVER WAS 40 TO 45 GIVE OR TAKE.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368347,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 SUZUKI SX4. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE SURGED FORWARD; THE CONTACT SHIFTED INTO NEUTRAL AND APPLIED THE BRAKES. THE CONTACT WAS ABLE TO CONTINUE DRIVING. THE CONTACT REMOVED THE FLOOR MATS; THE FAILURE CONTINUED INTERMITTENTLY. THE VEHICLE WAS BEING INSPECTED BY AN AUTHORIZED DEALER. THE FAILURE MILEAGE WAS 2,000 AND THE CURRENT MILEAGE WAS 8,500.",
        "vin": "JS2YB5A75A6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "10/14/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365750,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 SUZUKI SX4. THE CONTACT STATED THAT THE DRIVER SIDE FLOOR MATS WERE INTERFERING WITH THE BRAKES AND ACCELERATOR PEDALS AS SHE WAS DRIVING. THE VEHICLE WAS INSPECTED BY A DEALER AND REPAIRED SEVERAL TIMES TO NO AVAIL. THE FAILURE CONTINUED TO OCCUR. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS 9,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2010",
        "dateOfIncident": "07/29/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362805,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 SUZUKI SX4. WHILE DRIVING 65 MPH, THE VEHICLE BEGAN LOSING POWER AND SUDDENLY STALLED. THE FAILURE OCCURRED FOUR TIMES. SOMETIMES THE VEHICLE WOULD RESTART WITHIN AN HOUR OR HAD TO BE TOWED TO AN AUTHORIZED DEALER. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT CALLED THE MANUFACTURER WHO ADVISED HER TO SEND IN A WRITTEN COMPLAINT. THE FAILURE MILEAGE WAS 174 AND THE CURRENT MILEAGE WAS 3,400.",
        "vin": "JS2YC5A4XA6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/24/2010",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10357358,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS IN A CAR ACCIDENT  DRIVING A 2010 SUZUKI SX4. THE COLLISION WAS WITH A PICKUP TRUCK TRAVELING APPROXIMATELY 55MPH, MY DAUGHTERS CAR WAS TRAVELING APPROXIMATELY 20MPH. NO AIRBAGS FRONT OR SIDE DEPLOYED. MY DAUGHTERS HEAD HIT AND SHATTERED THE DRIVERS SIDE WINDOW CAUSING SEVERAL CUTS, BRUISES AND REQUIRING STITCHES ABOVE HER LEFT EYE AND NECK. THE CAR HAS BEEN DECLARED A TOTAL LOSS.   * THE IMPACT LOCATION ON THE SX4 IS THE FRONT DRIVERS SIDE HALF OF HOOD AREA EXTENDING TO THE FRONT FENDER AREA (CORNER OF FRONT). THE CAR WAS SPUN AROUND FROM THE IMPACT.  * THE CAR COMES EQUIPPED WITH DRIVER AND PASSENGER FRONT AIRBAGS, SEAT MOUNTED DRIVER AND PASSENGER SIDE AIRBAGS AND 1ST AND 2ND ROW SIDE CURTAIN AIRBAGS. NON DEPLOYED DURING ACCIDENT. *TR",
        "vin": "JS2YC5A2XA6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10323344,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SX4",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS 2010 SUSUKI SX4. WHILE DRIVING 20 MPH, HE ATTEMPTED TO ENGAGE THE BRAKE PEDAL AND THE VEHICLE ACCELERATED ON ITS OWN CRASHING INTO A WALL AND A THE VEHICLE IN FRONT OF HIM.  THE VEHICLE WAS TOWED AND A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE CONTACT AND PASSANGER SUFFERED MAJOR INJURIES FROM THE IMPACT OF THE CRASH. THE CURRENT AND FAILURE MILEAGES WERE 329.   GG",
        "vin": "JS2YC5A24A6"
    }
]