[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "12/22/2013",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958962,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS (12-22-2013 THROUGH 10-09-2016), WHILE DRIVING ON A MAJOR HIGHWAY OR INTERSTATE IN RAIN AND/OR SNOW THE WINDSHIELD WIPERS HAVE STOPPED WORKING. THEY TYPICALLY STOP MID STROKE AND WILL NOT OPERATE IN ANY OF THE LOW SPEED OR INTERMITTENT SETTINGS. TO GET THEM STARTED AGAIN YOU MUST TURN THE WIPERS OFF FOR A PERIOD OF TIME AND THEN TURN THEM BACK ON. ALTERNATIVELY, THEY WILL BEGIN WORKING AGAIN IF THE IGNITION SWITCH IS TURNED OFF AND BACK ON. THIS IS ONLY A TEMPORARY FIX AS THEY WILL STOP WORKING AFTER A SHORT PERIOD OF OPERATION. I HAVE REPLACED THE PULSE CONTROL MODULE TO NO AVAIL. I'VE HAD TWO TIFFIN AUTHORIZED REPAIR CENTERS AND A FREIGHTLINER REPAIR CENTER TO FIX THE PROBLEM, BUT THEY HAVE BEEN UNABLE TO DUPLICATE THE PROBLEM IN THE SHOP. THIS ISSUE PRESENTS THE DRIVER WITH THE SAME REDUCTION OF DRIVER'S VISIBILITY AS THE BROKEN WIPER ARM (NHTSA RECALL # 16V-532).",
        "vin": "5B4MPA7GXB3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649045,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "XRV",
                "productYear": "9999",
                "size": "235/80R22",
                "type": "Tire"
            }
        ],
        "summary": "COMPLAINT:  UNAVAILABILITY OF MICHELIN 235/80R 22.5 XRV TIRES.  THESE TIRES ARE SPECIFICALLY MANUFACTURED FOR CLASS A MOTOR HOMES.  MY ORIGINAL TIRES NEED TO BE REPLACED AND I CANNOT LOCATE THESE TIRES FOR PURCHASE ANYWHERE IN THE U.S.  COMPLAINTS/QUESTIONS TO MICHELIN HAVE NOT BEEN ANSWERED.  TIRE DEALERS ONLY KNOW THAT \"THEY ARE ON BACK-ORDER\".  FORD HAS INCREASED THE PRODUCTION OF CLASS \"A\" MOTOR HOMES BY OVER 30% THIS YEAR AND I SUSPECT THAT THE TIRES BEING PRODUCED BY MICHELIN ARE GOING TO FORD AND OTHERS FOR NEW CLASS A'S.  WHAT ABOUT THOSE OF US WHO NEED NEW TIRES FROM MICHELIN?  THIS PARTICULAR SIZE OF TIRE IS NOT MANUFACTURES BY ANOTHER OTHER VENDOR AS FAR AS I CAN DETERMINE.  THIS PRESENTS A SERIOUS SAFETY ISSUE AS WORN OLDER TIRES CANNOT BE REPLACED WITH TIRES SPECIFICALLY ENGINEERED FOR CLASS A MOTOR HOMES.  *TR",
        "vin": "1F6NF53Y490"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616498,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 ALLEGRO MOTOR HOME.  CONSUMER WRITES IN REGARDS TO A DEFECT THAT EXISTS IN THE CLEARANCE LIGHTS ON THE UNIT.  *SMD  THE CONSUMER STATED THE PROPOSED SOLUTION OF THE RECALL WOULD NOT CORRECT THE MANUFACTURER'S DEFECTIVE LIGHT AND MAY RESULT IN A FIRE AND PROBABLY WOULD RESULT IN THE LOSS OF THE CLEARANCE LIGHTS.  THE CONSUMER WOULD LIKE THE PROBLEM REVIEWED AND A NEW DIRECTIVE REQUIRING THE MANUFACTURER OF THE LIGHTS TO REPLACE THE DEFECTIVE LIGHTS WITH NEW LIGHTS THAT ARE PROPERLY DESIGNED. THE CONSUMER REFERENCED RECALL # 14V271000. *JB",
        "vin": "1F66F5DYXB0"
    }
]