[
    {
        "components": "STEERING,TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456022,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Toyota Sienna. The contact stated while driving approximately 15-20 MPH, the vehicle stalled inadvertently. The check engine warning light, the traction control warning light, and other unknown warning lights illuminated. Additionally, the contact stated that the steering wheel lost power steering functionality. The contact was able to veer to the side of the road. The contact stated that the vehicle failed to restart while in Park; however, the vehicle restarted when he shifted into Neutral. The contact drove the vehicle to his residence. The dealer was not notified of the failure. The vehicle was not diagnosed or repaired. The manufacturer was notified of the failure and informed the contact that they could not assist as there were no open recalls associated with the failure. The failure mileage was approximately 115,000.",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422816,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "One day when we tried to buckle the driver's side seat belt, little pieces flew out of the receiver side and it will no longer buckle. We took it to the Toyota dealer in N Syracuse NY and were told it would be a cost of $212 to replace and that it would be a two-week wait for the part to come in. This means that the owner and her two young babies would have to drive in an unsafe car, ILLEGALLY for two weeks putting her life and the life of her children in danger.  The Toyota dealer inspected the seat belt and confirmed it was a defect and had failed. I called Toyota customer service and was told that there were no recalls for this defect and they would take no responsibility for the dangerous situation or consequences because the car was no longer under warranty.  In fact, this is a problem that has been affecting many owners as indicated by an online search. Also, the fact that the dealer has to wait two weeks to obtain the part indicates that this seatbelt has failed many owners and they have used up the supply.  This should be a recall situation but Toyota will take no responsibility.",
        "vin": "5TDKK4CC9AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS DEFECTIVE.  TOYOTA ACKNOWLEDGE THIS DEFECT, AND ISSUES A FREE REPLACEMENT.  HOWEVER, TOYOTA CLAIMS THE WARRANTY PERIOD HAS EXPIRED, AND WILL NOT REPLACE MY DASHBOARD.  DUE TO COVID 19 LOCKDOWN, I DID NOT GET IT FIXED EARLIER, AND WAS NOT AWARE THAT RECALLS HAVE EXPIRING AN EXPIRING DATE.",
        "vin": "5TDYK4CCXAS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363691,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS RECENTLY BECOME STICKY EVEN THOUGH WIINDSHIELD IS ROUTINELY COVERED.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349820,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ENTERING A SLIGHT CURVE IN THE ROAD AT MODERATE IN TOWN SPEEDS THERE IS A CLICKING SOUND TO THE LEFT OF THE STEERING WHEEL IN THE DASH THEN THE TRACTION CONTROL SENSOR LIGHTT GOES ON. WHILE FREEWAY DRIVING,  IT HAS HAPPENED 3 TIMES  OUT OF THE BLUE AND WARNING BUZZERS SOUNDED VSC LIGHT AND TRACTION CONTROL LIGHT WENT ON AND THE STEERING JERKED...ENGINE LOST POWER ...VERY SCARY.I HAD RACK AND PINION STEERLING ASSEMBLY REPLACED AT ABOUT 40,000. THE PROBLEM STARTED AT ABOUT 110,000 MILES. I HAD ALL THE WHEEL SENSORS REPLACED AT ABOUT 115,000. I TOOK IT INTO TOYOTA DEALERSHIP THEY SAID THEY COULDN'T FIND A PROBLEM. TOOK IT TO 2 DIFFERENT MECHANICS ...ONE CHANGED THE SENSORS.COMPANY SAYS IT HASN'T BEEN A PROBLEM BUT ON THE INTERNET THERE ARE LOTS OF IDENTICAL POSTS. DEFINITELY A SAFETY ISSUE.I'VE HAD THE CAR 11 YEARS AND ALWAYS DID SCHEDULED MAINTENANCE.  PLEASE SEE WHAT THE ISSUE IS.",
        "vin": "5TDYK4CC0AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE SLOWING DOWN, A LOUD BOOMING NOISE OCCURRED AND THE VEHICLE SUDDENLY LOSS AUTOMOTIVE POWER AND CAME TO A ROLLING STOP. UPON INSPECTION, PART OF THE TRANSMISSION WAS DETACHED AND ON THE GROUND NEARBY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE TRANSMISSION HAD EXPLODED. THE CONTACT INDICATED THAT PIECES OF THE TRANSMISSION HAD DISLODGE FROM THE TRANSMISSION CASING. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340495,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERMEDIATE STEERING SHAFT STARTED MAKING A CLUNKING SOUND WHEN TURNING THE WHEEL AND DRIVING A LOW SPEEDS. ADDITIONALLY, THERE IS NOW PLAY IN THE STEERING WHEEL.  SO MUCH PLAY THAT DRIVING AT HIGHWAY SPEEDS FEELS UNSAFE.",
        "vin": "5TDKK4CC5AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE DRIVER'S AND PASSENGER'S SIDE DASHBOARD WAS STICKY AND MELTING. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, HIS VIEW WAS OBSTRUCTED DUE TO THE GLARE FROM THE DASHBOARD. LONGO TOYOTA OF PROSPER (2100 W UNIVERSITY DR, PROSPER, TX 75078 (469) 850-6315) WAS CONTACTED AND INFORMED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT WAS PROVIDED INFORMATION ON REGARDING AN EXTENDED WARRANTY ON THE VEHICLE REGARDING THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT THE EXTENDED WARRANTY INFORMATION WAS SENT OUT IN 2016. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328456,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME TURN THE STEERING IT MADE CLICKED FEELING LIKE STEERING SHAFT BEND? IT HAPPEN SINCE 2017 TO NOW. I LOOKED UNDER THE HOOD NO LEAK OIL. PLEASE INVESTIGATION BEFORE ACCIDENT.  *TR",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328459,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRASH ITSELF AND STICKY. I ALWAYS USE WINDSHIELD SUN SHADE COVER. I ASKED LOCAL TOYOTA DEALER BUT IT IS NOT RECALL.  *TR",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/12/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE RACK AND PINION SEAL STARTED LEAKING AND REQUIRED REPLACEMENT.  HAD TO HAVE RACK AND LIONIZING, TIE ROD ENDS, AND LINKAGE REPLACED FOR OVER $1,100.",
        "vin": "5TDDK4CC5AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MECHANISM INSIDE RIGHT SLIDING DOOR CRACKED AND DOOR IS PERMANENTLY CLOSED.  BOTH LEFT AND RIGHT  SIDE THE PULLY WIRE THAT OPENS THE DOOR SNAPPED.  BOTH DOORS NOW MALFUNCTIONED WITH ONE DOOR COMPLETELY SEALED CLOSED.",
        "vin": "5TDKK4CC6AS"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHEN THE VEHICLE WAS STARTED, THE AIR BAG WARNING INDICATOR ILLUMINATED AND REMAINED ILLUMINATED. THE CONTACT ALSO STATED THAT THE HORN AND AIR BAG, ALONG WITH OTHER STEERING WHEEL FUNCTIONS, WERE INOPERABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED; HOWEVER, THE CONTACT STATED THAT THE SPIRAL CABLE ASSEMBLY IN THE STEERING WHEEL WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT THERE WERE NO RECALLS PERTAINING TO THE FAILURE; THEREFORE, THEY WOULD NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 120,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277219,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR CABLE SNAPPED UNEXPECTEDLY CAUSING DOOR TO BECOME INOPPERABLE.  IT IS NOW JAMMED SHUT AND WILL NOT OPEN FROM INSIDE OR OUTSIDE, CAUSING A POTENTIAL SAFETY ISSUE.  THIS IS SECOND DOOR WHERE THE CABLE HAS SNAPPED AND INOPERABILITY OF DOOR COULD BECOME A SAFETY ISSUE IF PASSENGERS NEED TO EXIT.  TOYOTA WILL NOT STAND BEHIND THE DOOR AND ASKS UPWARDS OF $2K TO REPAIR.",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269077,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING TURNS AT SPEEDS HIGHER THAN 30 MPH SOMETIMES ON THE FREEWAY OR ESPECIALLY WHEN DRIVING UP A HILL, THE SLIP INDICATOR LIGHT, VSC LIGHT AND ALARM SOUNDS AND OCCASIONALLY WILL AUTOMATICALLY ACTIVATE THE ABS BRAKING SYSTEM (EVEN WHILE YOU'RE STILL PRESSING ON THE ACCELERATOR) WHICH CAUSES YOU TO LOSE CONTROL OF THE VEHICLE TEMPORARILY. THE ABS ACTIVATION DOES NOT HAPPEN EVERY TIME, BUT WHEN IT HAPPENS, IT IS VERY SCARY. THERE ARE MANY PEOPLE ONLINE COMPLAINING OF THE SAME EXACT ISSUE AND TOYOTA CANNOT FIND THE PROBLEM. ONE PERSON STATED THE PROBLEM WENT AWAY ONCE HE REPLACED THE ENTIRE RACK.",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255723,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH BACK SLIDING DOOR CABLES SNAPPED.  HAVE BEEN ADVISED THE MOTORS SIEZED CAUSING THE CABLES TO SNAP.  NEITHER DOOR WORKS.  DRIVER'S SIDE DOOR CAN ONLY OPEN 6 INCHES. THIS IS A SAFETY HAZARD IN EVENT OF EMERGENCY.  MY CHILDREN CAN NOT GET OUT OF THE CAR AND CAN NOT OPERATE THE ONE DOOR ABLE TO MANUALLY OPEN.  FIX HAS BEEN ESTIMATED AT $1900 PER DOOR.  TOYOTA KNOWS THIS IS AN ISSUE.  THEY ISSUED A CUSTOMER WARRANTEE ENHANCEMENT FOR IT BUT IT HAS EXPIRED. THEY REFUSE TO REOPEN IT. THERE HAS BEEN A RECALL FOR THIS ON THE 2004-2009 MODEL YEAR AND  CURRENTLY A RECALL FOR THIS FOR 2011-2018 MODELS BUT NOT THE 2010. THERE ARE HUNDREDS OF TOYOTA SIENNA'S ON THE ROAD WITH THIS ISSUE AND IT IS COMPLETELY UNSAFE AND TOTALLY UNACCEPTABLE THAT TOYOTA REFUSES TO TAKE RESPONSIBILITY FOR THE 2010'S AND COVER THE COSTS TO FIX THE PROBLEM.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233475,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "YEARS AGO, RESPONDING TO A RECALL ABOUT SPARE TIRE ASSEMBLY, THE DEALERSHIP SAID I WAS \"FINE.\" ON 6 /23/2019, WHILE DRIVING AT HIGHWAY SPEED, NORTH TOWARD LAKE GEORGE, NY, JUST SOUTH OF EXIT 18, THERE WAS A LOUD THUMP UNDER THE VEHICLE, AND AS I WAS SITTING IN THE PASSENGER SEAT, SAW THE TIRE FLY OUT AND SLIDE ONTO THE GRASSY MEDIAN OF THE HIGHWAY. DRIVER ALSO SAW IT IN THE REAR VIEW MIRROR. WE WERE UNABLE TO STOP OR RETRIEVE THE TIRE. WHEN WE RETURNED FROM TRIP, I CALLED DEALER SERVICE REP. AND ASKED: WASN'T THIS DEFECTIVE SPARE TIRE ASSEMBLY PART OF AN OLD SAFETY RECALL? SERVICE REP. SAID THEY WOULD FIX SPARE TIRE ASSEMBLY. I DEMANDED THEY ALSO INCLUDE THE SPARE TIRE. AFTER CALLING TOYOTA, THEY AGREED. VEHICLE IS BEING WORKED ON.",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE BEGAN TO SHAKE AND THEN STALLED. ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS ABLE TO COAST OVER TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. AN INDEPENDENT MECHANIC CAME TO THE CONTACT'S HOME AND DIAGNOSED THAT THE GEAR SHIFTER FAILED AND CAUSED THE TRANSMISSION TO FAILED. THE PARTS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V657000 (POWER TRAIN). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED EXCESSIVE TIRE WEARING ON ONE OF THE REAR WHEELS.     ALIGNMENT SHOP SAID IT'S CAUSED BY ALIGNMENT ISSUE OF THE REAR WHEEL AND UNFORTUNATELY IT'S NOT ADJUSTABLE.     WHEN I SEARCHED ONLINE, I SAW MULTIPLE PEOPLE COMPLAINING ABOUT THE SAME ISSUE.",
        "vin": "3N1CB51D54L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: SLIDING DOOR CABLE GOT CUT OFF AS I OPEN THE DOOR. NOW UNABLE TO OPEN ONE SIDE OF THE SLIDING DOOR",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/12/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172680,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC DOORS CONTINUING TO MALFUNCTION. I MADE A COMPLAINT TO DEALER ALMOST IMMEDIATLEY AFTER PURCHASE AND PROBLEM PERSISTS...I HAVE HAD MY DOORS REPAIRED SEVERAL TIMES AND I NOW HAVE 2 NON FUNCTIONING DOORS! IT HAS ALSO BEEN REPORTED TO MY CAR DEALER THAT THE REAR PASSENGER DOOR HAS OPENED WHILE I WAS DRIVING ON THE THRUWAY WITH MY CHILDREN.. I HAVE ALSO CALLED TO REPORT THE ISSUE AND TO PUT IN A COMPLAINT TO TOYOTA AND STILL HAVE THE ISSUE.",
        "vin": "5TDKK4CCOAS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT GETS STUCKED IN JAMMED AND WON'T RETRACT, EXTREME SAFETY HAZARD. CANNOT DRIVE WITHOUT WORKING SEAT BELT FRONT DRIVER SIDE. THIS HAPPENS FREQUENTLY AND I CAN'T GET IT ON JAM THIS TIME. THIS SHOULD BE A RECALL.",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162571,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC SLIDING DOOR CABLE BROKE, AND WE ARE NOW UNABLE TO OPEN THE DOOR.  OUR CHILDREN CAN ONLY EXIT THE CAR FROM THE DRIVER SIDE DOOR.  WE UNDERSTAND THAT TOYOTA IS REPAIRING CERTAIN MODEL YEARS WITH THIS SAFETY ISSUE, UNDER AN EXTENDED WARRANTY.  IF THE PART IS DEFECTIVE, WHY ARE SOME OWNERS COVERED AND OTHERS PAYING $2000 FOR REPAIRS?",
        "vin": "5TDKK4CC5AS"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT FREEWAY SPEEDS AND VEERING TO RIGHT OR LEFT, THE VEHICLE STABILITY CONTROL (VSC) SYMBOL LIGHTS UP AND BEEPS WHILE A CLICKING SOUND CAN BE HEARD FROM THE STEERING COLUMN. WHEN THIS HAPPENS, OCCASIONALLY THE BRAKES AUTOMATICALLY GET APPLIED CAUSING A BRIEF LOSS OF CONTROL.",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 45 MPH, THE REAR DRIVER SIDE SLIDING DOOR OPENED ON ITS OWN. THE DOOR AJAR WARNING INDICATOR ILLUMINATED AND THE DOOR CHIME SOUNDED. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD, CLOSED THE DOOR, AND CONTINUED DRIVING. THE CONTACT STATED THAT THE DOOR OPENED AT LEAST TEN TIMES IN A WEEK. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND FILED CASE NUMBER: 18009170105. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 164,000.",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118183,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER CABLE TO THE DRIVER'S SIDE DOOR SNAPPED OFF RESULTING IN NO MORE POWER DOOR.  THE VEHICLE WAS STATIONARY.",
        "vin": "5TDK4CC8AS3"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY MINIVAN WITH 70,000 MILES ON IT AND NEW TIRES.  BY THE TIME I ROTATED THE FIRST TIME, THE FRONT TIRE ON THE INSIDE WAS STARTING TO WEAR DOWN FASTER THAN NORMAL.  I HAD THE TIRES ROTATED IMMEDIATELY AND THEN CHECKED THE SUSPENSION AND ALIGNMENT.  THE MECHANIC SAID THAT THE ALIGNMENT IS OK.  OVER THE NEXT 20,000 MILES AND 3 ROTATIONS LATER, ALL THE TIRES ARE WORN ON THE INSIDE DUE TO SOMETHING IN THE FRONT SUSPENSION/DESIGN AREA.",
        "vin": "5TDDK4CC9AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099856,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE FAILED WHILE ENTERING THE HIGHWAY. ALL POWER WAS LOST AND VEHICLE HAD TO BE TOWED TO THE LOCAL TOYOTA DEALER. I WAS INFORMED TODAY THAT IN ORDER TO ANALYZE THE PROBLEM THE ENGINE NEEDS TO BE REMOVED AT $140 PER HOUR APPROX. 20 HRS OF LABOR.   I HAVE GIVEN THEM PERMISSION TO DO THIS SO I CAN RECEIVE A QUOTE AS TO HOW MUCH TO REPAIR. THIS SIENNA WAS JUST IN FOR 125,000 MILE SERVICE WITH NO KNOWN ISSUES.   I DO NOT HAVE ANY TYPE OF DOCUMENTATION AS OF TODAY JUNE 4,2018.",
        "vin": "5TDKK4CC6AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/22/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089282,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN ACTIVE DUTY SERVICE MEMBER TRYING TO PCS FROM GERMANY TO THE UNITED STATES.  I NEVER RECEIVED NOTIFICATION OF THE RECALL.  NOW THERE WILL BE A SIGNIFICANT DELAY IN SHIPPING OUR VEHICLE AND OUT OF POCKET EXPENSES IN THE FORM OF CAR RENTALS THAT COULD HAVE BEEN AVOIDED IF I WOULD HAVE BEEN NOTIFIED OF THIS RECALL.",
        "vin": "5TDYK4CC1AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089169,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR POWER CABLE BROKEN. TOYOTA HAS ENHANCED WARRANTY FOR 2004-07 MY BUT WILL NOT FIX MINE BECAUSE IT IS 2010 MY.",
        "vin": "5TDDK4CC7AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081494,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MOTION, WHEN I LET UP OFF THE ACCELERATOR TO ASSESS TRAFFIC, SUCH AS AT THE TOP OF AN ON-RAMP OR OTHER MERGING SITUATION, THEN I DECIDE IT IS SAFE TO MERGE, AND I PRESS THE ACCELERATOR, THE VEHICLE STALLS BRIEFLY BEFORE \"CATCHING\" AND ACCELERATING. THE ENGINE DOESN'T SPUTTER OR CUT OFF, THE VEHICLE JUST SITS STILL AS THOUGH IT ISN'T GETTING GASOLINE.  I'VE HAD A FEW CLOSE CALLS WHEN ATTEMPTING TO ACCELERATE AND MERGE INTO TRAFFIC. THIS ISN'T A GEAR DOWN-SHIFT/UP SHIFT TYPE THING...JUST A STALL.  IT'S NOT EVERY TIME I SLOW DOWN TO COAST, THEN DECIDE TO ACCELERATE, BUT SPORADICALLY. I'VE HAD THE VAN CHECKED BY THE DEALER AND THEY COULDN'T FIND ANYTHING. I WAS TOLD IT'S A \"COMPUTER THING,\" WITH THE COMPUTER GETTING CONFUSED BECAUSE TO DOESN'T KNOW WHETHER I WANT THE VAN TO COAST TO A STOP OR TO ACCELERATE, AND \"THE COMPUTER GETS CONFUSED.\" I DON'T HAVE SPECIFIC DATES",
        "vin": "5TDDK3DC7DS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065872,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V657000 (POWER TRAIN); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. MARINA DEL REY TOYOTA (4636 LINCOLN BLVD, MARINA DEL REY, CA) WAS CONTACTED AND REFUSED TO PERFORM THE REPAIR BECAUSE THE TECHNICIAN STATED THAT THE VEHICLE WAS MODIFIED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062504,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE SLIDING DOORS FAILED TO OPERATE ON OCCASION. THE DOORS  ONLY WORKED BY USING THE REMOTE CONTROL HANDLE FROM OUTSIDE THE VEHICLE. THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 84,600.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060765,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MARINA DEL REY TOYOTA HAS BEEN UNABLE TO OBTAIN THE PART REPLACING THE SHIFT SOLENOID FOR THE RECALL",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA OF MARINA DEL REY SAYS THE RECALLED SOLENOID IS STILL BACKORDERED A MONTH LATER",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055891,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V657000 (POWER TRAIN) AND 14V273000 (TIRES); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. OURISMAN CHANTILLY TOYOTA-SCION IN CHANTILLY, VIRGINIA WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDKK4CC4AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055520,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V657000 (POWER TRAIN). THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. BILL KIDD TOYOTA (107 INDUSTRY LN, COCKEYSVILLE, MD 21030, (410) 666-5030) AND THE MANUFACTURER WERE NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048613,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SLIDING DOOR.  CABLE HAS COME LOOSE.  DOOR NO LONGER OPENS AND CLOSES WHEN PRESSING THE OPEN/CLOSE BUTTON.  VEHICLE IS STATIONARY.  NOW IT IS VERY DIFFICULT TO MANUALLY OPEN OR CLOSE THE DOOR.  PASSENGER MUST NOW EXIT FROM PASSENGER SIDE OF CAR.  THIS IS A SAFETY HAZZARD.",
        "vin": "5TDYK4CC2AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND FAILURE OF SLIDING SIDE DOOR WHEREBY CABLE THAT OPENS AND CLOSES THE DOOR AUTOMATICALLY MALFUNCTIONS.THE DOOR GETS JAMMED PARTWAY OPEN TRAPPING PASSENGERS INSIDE. THE ONLY WAY OUT IS TO CUT THE CABLE.",
        "vin": "5TDYK4CC5AS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045753,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BOTH SIDE SLIDING DOORS ARE NOT FUNCTIONAL. I COULD NOT USE THE KEY FOB TO OPEN OR CLOSE THE DOORS. WONDER IF IT HAS ANY RECALL.",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SLIDING DOOR. THE CABLE SNAPPED AND THE DOOR WOULD NOT FULLY OPEN.",
        "vin": "5TDJK4CC3AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/11/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019728,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA.  CONSUMER WRITES IN REGARDS TO REAR POWER DOOR MALFUNCTION AND SEEKS REIMBURSEMENT FOR REPAIRS.  *LD    THE CONSUMER STATED THE WARRANTY WAS EXTENDED, BUT NOT FOR THE 2010 MODEL YEAR. UPDATED 09/11/017*JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021767,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE DRIVER SIDE REAR DOOR DID NOT OPEN AND THE CABLE WAS HANGING OUT THE TRACK. THE VEHICLE WAS TAKEN TO THE DEALER VANDERSTEIN TOYOTA IN ROCHESTER NEW YORK FOR A DIAGNOSIS. THE SLIDING DOOR CABLE FRACTURED AND NEEDED REPLACEMENT. THE CONTACT ALSO STATED THAT THE PASSENGER SIDE REAR DOOR EXPERIENCED THE SAME FAILURE LAST YEAR, BUT IN THE RECENT FAILURE, THE LATCH WAS FRACTURED. THE VEHICLE WAS REPAIRED LAST YEAR. THE VEHICLE WAS NOT REPAIRED FOR THE RECENT FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT THE VIN DID NOT QUALIFY FOR THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 105,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012730,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE POWER DOOR CABLE BROKE WHILE OPENING THE DOOR. CANNOT OPEN DOOR AT ALL NOW. HAVING TO PAY $2000 TO GET NEW CABLE AND MOTOR. LOTS OF SIMILAR POWER DOOR PROBLEMS RECORDED ON THE WEB. TOYOTA SHOULD SHARE REPAIR COST AS THE PARTS FAILURE OBVIOUSLY POSES SAFETY ISSUE IF NOT REPAIRED ASAP.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984623,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOORS JAMMED IN THE CLOSED (OR PARTIALLY OPEN POSITION) AS THE DOOR CABLE GOT HUNG UP IN THE SLIDING MECHANISM. BOTH DOORS OF OUR VEHICLE ARE NOW AFFECTED.     DRIVER SIDE SLIDING DOOR FAILED TO OPEN FULLY IN JAN 2017 - IT OPENED ABOUT 4 INCHES AND WOULD STOP. PASSENGER SIDE SLIDING DOOR FAILED TO OPEN AT ALL IN MAY 2017, IT WOULD MOVE A FRACTION OF AN INCH WHEN TRYING TO OPEN AND THEN GET JAMMED. THE VAN HAS SEEN MODERATE USE, AND THE DOORS WERE OPENED WITH THE AUTOMATIC MECHANISM (USED THE BUTTON) OVER 99% OF THE TIME. THE WEAR ON THE DOOR OPENING MECHANISM WAS NOT CAUSED BY INAPPROPRIATE MANUAL OPENING.     AFTER THE PROBLEM, IN BOTH CASES THE ONLY WAY TO BE ABLE TO OPEN THE DOORS WAS TO PHYSICALLY BREAK THE GUIDE CABLES - WHICH WAS DONE FROM OUTSIDE OF THE VEHICLE. IT IS UNLIKELY TO BE DONE FROM INSIDE THE VEHICLE DUE TO HOW THE PERSON WOULD NEED TO STAND AND THE STRENGTH THEY COULD GENERATE, ESPECIALLY DURING AN EMERGENCY EVENT.    FIX FOR THE PROBLEM IS OVER $1000 FOR EACH DOOR. REMEDY FOR ME IS THAT I CUT THE BROKEN CABLES AND WE OPEN THE DOORS MANUALLY NOW.    I BELIEVE THERE IS A RECALL THAT COVERS THIS PROBLEM FOR 2004-2007 SIENNAS, BUT HAS NOT BEEN EXTENDED TO COVER THE SAME MODEL FOR YEARS 2008-2010.    SNIPPET OF THIS IS:    CERTAIN 2004 TO 2007 MODEL YEAR SIENNA VEHICLES EXTENSION OF WARRANTY COVERAGE FOR POWER SLIDING DOOR CABLE ASSEMBLY    THIS CONCERNS THE CABLE ASSEMBLY, NOT THE LATCH ASSEMBLY.",
        "vin": "5TDKK4CC4AS"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981200,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE HEADLIGHT ASSEMBLY COVERS WERE FOGGY AND CREATED DULL ILLUMINATION AT A DISTANCE. THE DEALER STATED THAT THEY HAD A PROCESS TO SPRAY THE HEADLIGHT COVERS AND MAKE THEM ULTRAVIOLET, BUT THERE WAS NO EXPLANATION AS TO WHAT CAUSED THE ISSUE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT IT WAS NORMAL WEAR AND TEAR. THE FAILURE MILEAGE WAS APPROXIMATELY 57,000.",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/02/2017",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969955,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE DRIVING THE SLIDING DOOR JAMS WITH DOOR ONLY 9\" OPEN. OCCUPANTS COULD BE TRAPPED INSIDE VEHICLE. CABLE HAS TO ARE CUT TO OPEN THE DOOR COMPLETELY.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED DRIVER SIDE REAR PANEL WINDOW FELL FROM VEHICLE.      2ND ISSUED DRIVER SIDE REAR SLIDING DOOR CABLE SNAPPED CAUSING DOOR TO BE DISABLED.  UNKNOWN WHEN THE CABLE SNAPPED.",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR CABLES BROKEN BOTH RIGHT AND LEFT SIDES",
        "vin": "STDKK4CC1A3"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH ON THE BACK DOOR MELTS WHEN THE WEATHER IS HOT, LEAVING A BLACK, TARRY MESS IN MY HANDS.  NOW THAT THE WEATHER IS COLD, THE LATCH ON THE BACK DOOR IS FROZEN SOLID, MAKING IT EXTREMELY DIFFICULT TO OPEN THE BACK DOOR AT ALL.  THIS COULD BE DANGEROUS IF I NEED TO OPEN IT QUICKLY.  THE VAN IS, OF COURSE STATIONARY WHEN I TRY TO OPEN THE DOOR.    THE DASHBOARD ALSO MELTS IN THE HEAT.  *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930010,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE WENT TO OPEN THE POWER SLIDING SIDE DRIVERS DOOR..THE WIRE BROKE AND IT WOULD NOT OPEN ALL THE WAY. IT HAD TO BE FORCED CLOSED. THE WIRE THAT CONTROLS THE POWER DOOR HAD BROKE.  TOYOTA SAID IT WOULD COST ABOUT $2500.00 TO FIX. WE USED THE OTHER BACK SIDE DOOR UNTIL THE WIRE ON IT BROKE ALSO. IT WAS ABLE TO BE USED MANUALLY.  MY BROTHER-IN-LAW WAS ABLE TO GET THE DRIVERS SIDE DOOR UNSTUCK SO WE CAN USE IT MANUALLY ALSO. CAN NOT AFFORD TO PAY $5000.00 TO FIX POWER DOORS.",
        "vin": "5TDKK4CC4AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928320,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG INFLATOR NEEDS REPLACING. SLIDING DOOR COULD OPEN DURING CAR MOVEMENT",
        "vin": "5TDYK3DC5BS"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHEN THE CRUISE CONTROL WAS ACTIVATED, IT WOULD DEACTIVATE INDEPENDENTLY. IN ADDITION, THE BUMPER SENSOR DETECTED OBJECTS THAT WERE NOT IN FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 100,000.   UPDATED 01/27/17*LJ  CONSUMER STATED PROBLEM IS THE DYNAMIC CRUISE CONTROL. THE CRUISE CONTROL SHUTS OFF WITH A RED LIGHT AND AUDIBLE CHIME WHILE OPERATING. UPDATED 7/6/18*JB",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2010 TOYOTA SIENNA RECENTLY HAD A CEL GO ON.  NO CODES WERE FOUND BY LOCAL REPAIR SHOP SO TOOK THE CAR TO TOYOTA DEALER. DEALER GAVE US ERROR CODE U0123, U0124, U0126 AND SAID WE WOULD HAVE TO REPLACE THE ABS ACTUATOR PUMP WHICH WILL COST $3600+.  I SEARCHED ONLINE AND MANY HAVE/HAD THE SAME PROBLEM.  ALSO READ THAT TOYOTA HAS ALREADY COVERED A EXTENSION WARRANTY FOR THE CAMRY  HYBRID WITH THE SAME PROBLEM PART. ONE OF THE CODE WAS FOR THE YAW RATE SENSOR WHICH WAS ALSO PART OF A RECALL ON SOME TOYOTA AND LEXUS CARS.",
        "vin": "5TDKK4CC3AS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/17/2016",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH REAR SHOCKS FAILED AND STARTED WHILE DRIVING (IN MOTION) IN CITY TRAFFIC. VEHICLE HAD 69,000 MILES AT THE TIME. PURCHASED NEW IN 11/2009.  VEHICLE IS NOT USED TOW OR HAUL HEAVY LOADS. THE VEHICLE IS DRIVEN IN MAINE. THE TOYOTA DEALERSHIP PERFORMS ALL REPAIRS. VERY EXPENSIVE REPAIR. THE DEALERSHIP NOTED NO VISIBLE OR OBVIOUS REASON FOR 2 REAR SHOCK FAILURES AT SUCH LOW MILEAGE.",
        "vin": "5TDJK4CC2AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10901985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLES FOR BOTH AUTOMATIC SLIDING DOORS SNAPPED.  THE DOORS ARE BOTH COMPLETELY UNUSABLE, AS THEY WILL NOT OPEN AT ALL.    AS MY 8 YEAR OLD WAS TRYING TO GET OUT OF THE VEHICLE, THE DOOR STOPPED WORKING AND WOULD NO LONGER WORK.  THE DRIVERS' SIDE DOOR CABLE SNAPPED LAST WEEK, AND THE RIGHT ONE, TODAY.",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898765,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED WITH THE KEY REMOVED FROM THE IGNITION, A CHILD IN THE VEHICLE WAS ABLE TO MOVE THE GEAR SHIFT LEVER FROM THE PARK POSITION TO REVERSE. THE VEHICLE WAS ABLE TO ROLL BACKWARDS. THE VEHICLE WAS NOT INVOLVED IN A CRASH. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE FAILURE WAS UNABLE TO BE DUPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 168,837.",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  TOYOTA SIENNA 2010.  POWER SLIDING DOOR ON PASSENGER SIDE - THE CABLE FOR POWER DOOR OPERATION SNAPPED OUT OF NOWHERE.  THE POWER FUNCTION NO LONGER WORKS AND I HAVE AN 18\" CABLE HANGING OUT THE SIDE OF MY CAR NOW.  CAR IS ONLY 6 YEARS OLD WITH 85,000 MILES AND ESTIMATE FOR REPAIR IS OVER $2,000.  IT WAS PURCHASED AS CERTIFIED PREOWNED BUT WE WERE TOLD THE DOORS ARE NOT COVERED UNDER WARRANTY FOR THIS YEAR.  I'M READING ONLINE OF MANY OTHER OWNERS HAVING THE EXACT SAME ISSUE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884889,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOOR CABLE SNAPS MAKING IT IMPOSSIBLE TO TOTALLY OPEN DOOR. WOULD BE DANGEROUS IN CASE OF EMERGENCY EXIT.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883350,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE POWER SLIDING DOOR CABLE BROKE AFTER ONLY 6 YEARS AND 100,000 MILES. MADE IT IMPOSSIBLE TO OPEN DOOR AS CABLE WAS CAUGHT IN DOOR. CAR WAS STATIONARY.",
        "vin": "5TDDK4CC9AS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882036,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE OPERATING THE VEHICLE, THE PASSENGER SIDE AIR BAGS WERE DEACTIVATED EVEN THOUGH A 130 LB PASSENGER WAS SEATED IN THE FRONT PASSENGER SEAT. AFTER SWITCHING PASSENGERS, THE FRONT PASSENGER SIDE AIR BAG OPERATED NORMALLY FOR APPROXIMATELY 20 MINUTES BEFORE THE MALFUNCTION RECURRED, ALTHOUGH THE PASSENGER SEAT WEIGHED APPROXIMATELY 213 LBS. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881584,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE VEHICLE INDEPENDENTLY ACCELERATED AND CRASHED INTO ANOTHER VEHICLE. THE FAILURE OCCURRED TWO OTHER TIMES. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS KEPT FOR OVER A MONTH, BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.  UPDATED 10/13/16*LJ",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS 2010 TOYOTA SIENNA XLE AND HAVE 50,000 MILES. WHILE DRIVING VEHICLE ON HIGHWAY SUDDENLY CAR STOPPED ENGINE RAVS BUT CAR WONT MOVE. WE TOWED THE CAR TO DEALER AND DEALER SUGGESTED VAN NEEDS NEW TRANSMISSION AND WE CONTACTED TOYOTA CORPORATION AND THEY WONT COVER THIS UNDER WARRANTY.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/19/2016",
        "dateOfIncident": "05/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 102000 MILES LEFT POWER SLIDING DOOR CABLE BROKE DURING NORMAL OPERATION. IN ITS BROKEN STATE DOOR ONLY OPENS MANUALLY ABOUT 7 ITO 8 INCHES AND ONLY WITH SOME FORCE. THE CABLE MAY HAVE BROKEN ON THE PREVIOUS CYCLING OF THE DOOR. THAT IS NOT KNOWN. THE PROBLEM WAS DISCOVERED WHEN UPON STOPPING TO EXIT THE DOOR. NOT KNOWING WHY THE DOOR WOULD NOT OPEN, I PROCEEDED TO OPEN IT MANUALLY. DOOR SLID OPEN WITH A BIT OF FORCE REQUIRED THEN STOPPED. NO ADDITIONAL AMOUNT OF FORCE WOULD ALLOW IT TO OPEN FURTHER. THE SAFETY CONCERN IS: HAD PASSENGERS NEEDED TO ESCAPE RAPIDLY, AND NOT KNOWN THE CABLE WAS BROKEN, THEY WOULD HAVE BEEN BARRED FROM EXITING RAPIDLY FROM THE TWO ROWS OF SEATS.",
        "vin": "5TDYK4CC5AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2016",
        "dateOfIncident": "05/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864924,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH POWER DOORS BROKE THE SAME WAY. THE CABLE FRAYED AND WAS PULLED INTO THE DOOR BY THE MOTOR. THE DOORS WOULD NOT OPEN AT ALL UNTIL SERVICED, WHICH CAUSED A SAFETY CONCERN! THE FIX WAS ESTIMATED AT $1,500 PER DOOR.",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 SIENNA SPARE TIRE RECALL: MY SPARE TIRE COMPLETELY FELL OFF MY CAR WHEN I WAS DRIVING - NOT SURE IF IT CAUSED AN ACCIDENT OR DEATH BEHIND MY CAR.  TOOK VEHICLE TO THE DEALER AND THEY APPLIED THE RECALL FOR THE SPARE TIRE CARRIER, BUT THEY GAVE ME MY VEHICLE BACK WITHOUT A SPARE TIRE.  I HAVE BEEN DRIVING FOR 2 WEEKS WITH 4 KIDS IN MY CAR WITHOUT A SPARE TIRE.  THIS IS A SERIOUS SAFETY ISSUE, MADE WORSE BY INCOMPETENT DEALER PERSONNEL.  I WAS TOLD I WOULD HAVE TO BUY A NEW SPARE TIRE.  AFTER ESCALATING THE ISSUE THROUGH THE TOYOTA CALL CENTER, THEY ARE NOW OFFERING ME A USED SPARE TIRE AS A REPLACEMENT.  REPLACEMENT SPARE TIRE SHOULD NOT BE CUSTOMER RESPONSIBILITY DUE TO CARRIER FAILURE, ESPECIALLY WHEN IT COULD HAVE CAUSED DEATH BEHIND MY CAR.  RECOMMEND THAT NHTSA FORCE TOYOTA TO MAKE SPARE TIRE REPLACEMENT PART OF OFFICIAL RECALL OR EDUCATE DEALERS ON HOW TO AUTHORIZE IMMEDIATE REPLACEMENT.",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "08/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSHED THE BUTTON TO CLOSE THE DRIVER'S SIDE AUTOMATIC SLIDING DOOR AND THE CABLE BROKE LEAVING THE DOOR STUCK HALF-OPEN AND HALF-CLOSED.",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "04/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861960,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 20 MINUTES AWAY FROM HOME WE HEARD SOME \"GROWLING\" AND \"TICKING\" NOISE FROM THE ENGINE. NO INSTRUMENT WARNING LIGHTS CAME ON. AS WE PULLED INTO OUR STEEP DRIVEWAY, THE OIL PRESSURE LIGHT STARTED TO BLINK. WE SHUT THE ENGINE. UPON INSPECTION, THE OIL DIPSTICK APPEARED DRY. I ADDED ABOUT 4 QTS OF OIL, AND STARTED THE ENGINE. IT SOUNDED NORMAL, AND NO WARNING LIGHT WAS DISPLAYED. I BROUGHT THE CAR TO A LEVEL AREA AND CHECKED OIL AGAIN. I ADDED ANOTHER QUART - OIL WAS BETWEEN THE MARKS ON THE DIPSTICK. I NOTICED LIGHT DRIPPING FROM THE FRONT AREA OF THE ENGINE, NEAR THE OIL COOLER. I THEN DROVE THE CAR TO THE AUTO REPAIR SHOP (ABOUT 4 MILES AWAY). ENGINE SOUNDED OK, NO WARNING LIGHTS. NEXT DAY I WAS TOLD THAT THE OIL LINE TO THE OIL COOLER IS LEAKING, AND THERE'S DAMAGE TO THE ENGINE DUE TO RUNNING WITH NO OIL.   I ASSUME THAT THE ENGINE OPERATED WITH NO OIL WHEN WE HEARD NOISES - BUT HOW COULD THE OIL LEAK OUT AND RUN THE ENGINE DRY FOR 15 MINUTES *BEFORE* THE LIGHT CAME ON? HOW COMMON IS THE PROBLEM OF THE OIL-COOLER HOSE FAILING? DOES THIS MODEL SHARE THE SAME ENGINE AS THE LEXUS RX350? IF SO - IS THE PROBLEM RELATED (I READ THAT MANY RX350 OWNERS COMPLAINED ABOUT THIS) ?",
        "vin": "5TDDK4CC4AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852296,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME I HAD TO REPLACE MY TRANSMISSION IN MY SIENNA.  EACH TIME IT HAPPENED, I WAS ON VACATION.  THE FIRST TIME I REPLACED IT WAS LESS THAN 2 YEARS AGO, APRIL 2014.  THERE WAS AN ISSUE WITH THE CAR SHIFTING HARD AND HUMMING ON ACCELERATION.  LUCKILY I MADE IT HOME AND WAS ABLE TO FIX IT.  SPENT $1, 404.43 WHICH WAS 30% OF THE COST, TOYOTA PAID FOR 70% OF IT.  NOW MARCH OF 2016, THE CAR LURCHED, WAS SMOCKING AND SLOWED DOWN WHILE I WAS ON VACATION IN THE MIDDLE OF THE ROAD.  LUCKILY I WAS ABLE TO GET IT TO RIGHT OUTSIDE OF THE HOTEL ROOM.  PAID TOWING TO GET THE CAR TO AN OVERNIGHT LOCATION, MIKE ERDMAN TOYOTA. UNFORTUNATELY, THEY WERE NOT ABLE TO FIX IT WITHIN THE WEEK THAT I WAS ON VACATION.   I HAD TO COME HOME AND DRIVE BACK TO 224 MILES TO GET THE CAR.  THIS TIME, I AM PAYING $3600.00.  I SAW ANOTHER COMPLAINT SIMILAR TO MINE ON THIS SITE.  UNFORTUNATELY, I WILL HAVE TO GET RID OF THE CAR BECAUSE I AM AFRAID FOR MY SAFETY.  WHEN A CAR STALLS ON YOU ON THE TURNPIKE OR IN THE MIDDLE OF THE RODE, IT IS TIME TO CUT YOUR LOSES.  I AM VERY DISAPPOINTED BECAUSE MY FAMILY HAVE BEEN TOYOTA OWNERS BUT WILL NOW HAVE TO LOOK FOR A NEW COMPANY.",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823961,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOOR CABLE SNAPP.",
        "vin": "4T1BE32K95U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824084,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC DOOR TO MY VAN STOPPED WORKING I TOOK IT TO THE DEALER WHERE I WAS TOLD THIS IS A COMMON PROBLEM ON THESE VEHICLES. I WAS TOLD THAT THE CABLE ON THE DOOR IS WHAT NEEDED TO BE REPLACED BUT YOU CAN'T PURCHASE THE CABLE ITSELF. THE DEALER EXPLAINED THAT I WOULD HAVE TO PURCHASE THE MOTOR BECAUSE IT'S A \"PACKAGE\" DEAL BUT IN REALITY I DIDN'T NEED THE MOTOR, THE MOTOR ON THE VAN WAS IN GOOD CONDITION. THEY WANTED TOO MUCH MONEY SO I HAD TO CHOOSE BETWEEN PURCHASING SOMETHING I REALLY DIDNT NEED TO HAVING TO MANUALLY OPEN/CLOSE MY DOOR.",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2016",
        "dateOfIncident": "01/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER DOOR CABLE SNAPPED ON DRIVER SIDE REAR DOOR.",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2016",
        "dateOfIncident": "11/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820670,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE SNAPPED ON REAR PASSENGER SIDE POWER DOOR NOVEMBER 2014",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/24/2015",
        "dateOfIncident": "07/11/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10816190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND DAUGHTER WERE TRAVELING ON OUR 2010 SIENNA ON 07/11/2015 (SAT) AND THE GEARS SEIZED UP WHEN THEY WERE TURNING INTO A BUSY 4-LANE ROAD. IN SPITE OF COMPLETE LOSS OF TRANSMISSION, DUE TO THE SHEER MOMENTUM OF THE VEHICLE, MY WIFE WAS ABLE TO DIRECT THE VEHICLE TO THE RIGHT SIDE OF THE ROAD. WHEN SHE CALLED ME, I ARRIVED TO SEE MY DAUGHTER CRYING AND STANDING ON THE SIDE WHILE MY WIFE WAS TRYING TO PUSH THE VAN FURTHER RIGHT WITH THE HELP OF AN OLD COUPLE WHO WERE EXTREMELY HELPFUL. LUCKILY, MY WIFE AND DAUGHTER ESCAPED WITH NO INJURIES (EXCEPT FOR A STIFF NECK AND BAD HEADACHE FOR A COUPLE OF DAYS FOR MY WIFE) BUT LEFT WITH A LIFE-LONG MEMORIES OF THIS PAINFUL EXPERIENCE.    AFTER TOWING THE VEHICLE TO STEVENS CREEK TOYOTA, I WAS TOLD THAT THAT THE TRANSMISSION SYSTEM HAD COMPLETELY FAILED (METALLIC PARTS CHIPPED AND GROUND AS PER TECHNICIAN) AND HAD TO BE REPLACED WITH AN WHOOPING BILL OF $6K. CONSIDERING THAT BOTH OF US ARE OUR WORKING PARENTS, WE HAD TO PAINFULLY SWALLOW THE COST OF REPAIR AND MOVE ON WITH OUR LIVES UNTIL NOW WHEN I HAD TIME DURING THE END OF YEAR WHEN I WANTED TOYOTA AND ALL SIENNA OWNERS TO KNOW ABOUT OUR ORDEAL AND BE CAUTIONED ABOUT THEIR VEHICLES.    MY BIGGEST COMPLAINTS:  * WE TRUST OUR FAMILY MEMBERS LIVES IN THE HANDS OF REPUTED VEHICLE MANUFACTURES SUCH AS TOYOTA. WHEN THEIR VEHICLES DO NOT LIVE UP TO THEIR REPUTATION AND CAUSE MENTAL/PHYSICAL ANGUISH, IT IS DEFINITELY DISHEARTENING.   * I PAID NEARLY $48K FOR THIS FULLY-LOADED 2010 SIENNA XLE LIMITED. A COMPLETE TRANSMISSION FAILURE AT 70K MILES AND $6K TO REPLACE THE TRANSMISSION IS COMPLETELY UNACCEPTABLE AND I FEEL RIPPED OFF!    WE REALLY HOPE TOYOTA GET ITS ACT TOGETHER AND INVEST IN IMPROVING THE QUALITY OF CRITICAL SYSTEMS OF THEIR VEHICLES.",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "09/28/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE REAR POWER SLIDING DOOR STOPPED WORKING.  DOOR MUST NOW BE OPENED MANUALLY CREATING A HAZARD FOR MY CHILDREN WHEN EXITING/ENTERING IN A BUSY AREA.  THIS IS A WELL DOCUMENTED PROBLEM WITH THE SIENNA AND PRIOR MODEL YEARS HAVE BEEN COVERED FOR REPAIR OF THIS DEFECT UNDER A TSB BUT THEY REFUSE TO COVER THE 2010.",
        "vin": "5TDYK4CC2AS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780798,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION SYSTEMS SPECIFICALLY SHOCKS AND STRUTS ARE WEARING OUT QUICKLY. DIVIDED OPINION BETWEEN MANY LOCAL MECHANICS ON THIS, SOME SUSPECT IT IS CAUSED DUE TO WEAR AND TEAR WHILE OTHERS THINK IT COULD BE DUE TO POSSIBLE MANUFACTURING ISSUES SPECIFICALLY FOR RUNNING IT ON A FULL LOAD - 8 PASSENGER VS 7 PASSENGER CONFIGURATION)",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "08/28/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762299,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 TOYOTA SIENNA WITH POWER DOORS. THE CABLE TO THE DRIVER'S SIDE REAR SLIDING DOOR SNAPPED WHEN I OPENED IT USING THE INTERIOR OPEN/ CLOSE BUTTON. I AM UNABLE TO OPEN THE DOOR MANUALLY MORE THAN 1 FOOT. TOYOTA ISSUED A WARRANTY POLICY BULLETIN (POL 12-02) CONCERNING POWER SLIDING DOOR CABLES FOR 2004 - 2007 SIENNA VEHICLES. UNDER THE SAME BULLETIN, THEY INCLUDED REAR SLIDING DOOR LATCH ASSEMBLIES ON CERTAIN 2004 - 2010 SIENNA VEHICLES. MY VEHICLE IS SPECIFICALLY LISTED IN THE VIN RANGE FOR 2010, BUT TOYOTA SAYS THE CABLE IS NOT COVERED. TOYOTA EXTENDED THE WARRANTY FOR 9 YEARS OR 120,000 MILES. SEEMS TO ME THERE IS SOME ISSUE RECOGNIZED BY TOYOTA CONCERNING THE DOOR CABLES AND DOORS. I HAVE NO WAY OF USING THAT DOOR AS AN EGRESS POINT.",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735712,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "GRINDING NOISE FROM TRANSMISSION WHEN IN LOW GEAR FROM STOP. HAD DEFECTIVE X MISSION IN TWO OTHER 2010 TOYOTA AND RETURNED UNDER LEMON LAW. QUOTE FROM INDIVIDUAL NAT TOYOTA CORPORATE OFFICE IN 2010 STATED THEY WERE INCURRING DIFFICULTIES WITH TRANSMISSIONS IN THIS VEHICLE AT THE TIME. 3 RDE SIENNA APPEARED FINE UNTIL RECENTLEY AND DISCOVERED THAT THEY STATED TRANSMISSION FAILURE AND NEEDS REPLACING. CALLED TOYOTA AND THEY CLAIM EXCEEDED WARRENTY TO BAD SO SAD. MA 10/26/2015     UPDATED 12/05/2017*CN",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "06/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731065,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE CABLE THAT OPERATED THE OPENING AND CLOSING OF THE SLIDING DOOR ON THE PASSENGER SIDE WAS FAULTY. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "5TDDK4CC2AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723030,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED ANOTHER SAFETY RECALL NOTICE FOR A POTENTIAL EXCESSIVE CORROSION ON SPARE TIRE.  STILL NO REMEDY.  AS A TEMPORARY SOLUTION, TOYOTA WILL OFFER ROADSIDE ASSISTANCE AT NO CHARGE SHOULD THERE BE ANY TIRE ISSUES.  HOWEVER, NO PHONE NUMBER/CONTACT INFORMATION IS PROVIDED FOR ROADSIDE ASSISTANCE ON THE NOTICE.  I CALLED TOYOTA CUSTOMER SERVICE AND WAS TOLD THIS WAS AN OVERSIGHT AND THEY READILY PROVIDED ME WITH A NUMBER FOR A NATIONAL SERVICE.  I AM NOT EXPERIENCING ANY PROBLEMS BUT AM CURIOUS AS TO THE LACK OF TRANSPARENCY BY NOT INCLUDING THE PHONE NUMBER IN THE NOTICE.  IT HAS NEVER BEEN PROVIDED ON THE PAST INTERIM NOTICES THAT I WAS ABLE TO FIND.  ALSO, DO THEY EVER PLAN ON FIXING OR IS IT A CALCULATED BUSINESS DECISION NOT TO FIX GIVEN COST?",
        "vin": "5TDYK4CC0AS"
    },
    {
        "components": "STRUCTURE,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/18/2015",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717016,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V273000 (WHEELS) HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 7/21/15*CN",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER SLIDING DOOR IS AUTOMATIC.  THE DOOR MOTOR STARTED MAKING A LOUD NOISE WHEN ATTEMPTING TO OPEN THE DOOR AUTOMATICALLY.  SUDDENLY, THE CABLE WIRE THAT IS INSIDE THE VEHICLE INTO THE DOOR TO OPERATE THE AUTOMATIC MECHANISM SNAPPED AND IS STICKING OUT OF THE AREA BELOW THE LAST REAR WINDOW OF THE VEHICLE AND NOW THE DOOR WILL NOT OPEN, EVEN UPON ATTEMPTING TO OPEN IT MANUALLY.    *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V273000 (TIRES); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5TDKK4CC1AS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "04/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LOCAL GARAGE DISCOVERED THAT A SUSPENSION COIL SPRING IN MY 2010 SIENNA IS BROKEN.  I HAVE DISCOVERED BY SEARCHING THE INTERNET THAT THIS IS FAIRLY COMMON IN TOYOTA SIENNA MODELS (I SAW 2007, 2008 AND 2009 MODELS REPORTED TO HAVE THIS PROBLEM, IN MY VERY BRIEF INTERNET SEARCH).  THIS IS A FAMILY CAR, AND HAS SEEN ONLY NORMAL HIGHWAY DRIVING, NO HEAVY LOADS AND CERTAINLY NOTHING THAT WOULD NORMALLY BREAK A SPRING.  I HAVE DISCUSSED THIS WITH BOTH THE LOCAL TOYOTA DEALERSHIP'S SERVICE MANAGER, AS WELL AS THE CORPORATE TOYOTA \"CUSTOMER EXPERIENCE\" REPRESENTATIVE.  I HAVE EXPLAINED THAT A BROKEN COIL SUSPENSION SPRING COULD RESULT IN A SLASHED TIRE SIDEWALL AND ASSOCIATED BLOWOUT; A SLASHED BRAKE HYDRAULIC LINE AND ASSOCIATED LOSS OF BRAKING ABILITY; ERRATIC SUSPENSION MOVEMENT AND ASSOCIATED LOSS OF CONTROL OF THE VEHICLE AT HIGH SPEED.  I HAVE BEEN TOLD BY TOYOTA THAT THERE IS NO RECALL NOR REPAIR ASSISTANCE FOR THIS PROBLEM.  *TR",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705591,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE REAR DRIVER SIDE QUARTER VENT WINDOW FRACTURED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.   UPDATED 7/1/15*CN",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "04/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703926,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ADVISED THAT I HAD TO REPLACE MY STEERING RACK BECAUSE OF MULTIPLE LEAKS. I HAVE SPOKEN WITH QUITE A FEW PEOPLE INCLUDING MY TOYOTA SERVICE ADVISOR AND WAS ADVISED THAT THE TOYOTA STEERING RACKS FREQUENTLY FAIL BETWEEN 75K AND 90K AND HAVE TO BE REPLACED. THIS HAPPENS IMMEDIATELY AFTER THE 75K WARRANTY ENDS. ALSO, WHEN I DRIVE SPEEDS BETWEEN 50-70 MPH, AND LEVEL OUT THE SPEED, MY CAR PICKS UP SPEED WHEN I AM NOT INITIATING THE ACTION.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/02/2015",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 10V160000 (STRUCTURE); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.    UPDATED 6/3/15*CN",
        "vin": "5TDZA22C14S"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/01/2015",
        "dateOfIncident": "03/31/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2010 SIENNA IN FOR A 80000 MILE SERVICE, WAS TOLD THAT THE BOOTS AROUND STEERING RACK WAS IN BAD SHAPE. I WAS TOLD THAT THE STEERING NEEDED TO BE REPLACES AND THE POWER STEERING UNIT WOULD FLUSHING. I HAD EXPERIENCED NO STEERING PROBLEMS WITH MY CAR. THE CAR LESS THAN 77000 MILES. THE IS NO EVIDENCE OF OIL LEAKAGE. IS THIS TYPICAL FOR REPLACING THE STEERING RACK AT $1400?  *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701709,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA SIENNA 2010 MINIVAN ENGINE STALLS WHILE DRIVING. WHEN DRIVING ON HIGHWAY OR ON CITY ROADS, ENGINE STALLS AND LOOSES ENGINE POWER FOR A FEW SECONDS (SEEMINGLY HAPPENS WHEN SHIFTING GEARS) WHEN ACCELERATED OR DECELERATED. THE ENGINE BASICALLY STALLS DURING DRIVING AND MAY LEAD TO SUDDEN VEHICLE SLOWNESS IN MIDDLE OF TRAFFIC.     THE SUSPECTED PROBLEM ADVISED BY TOYOTA IS WITH TRANSMISSION AND THE ORIGINAL COST ESTIMATE WAS $5100 TO FIX THAT. LATER AFTER DISCUSSING WITH TOYOTA IT WAS LOWERED TO $3800 (APPROX) AND TOYOTA WARRANTY SUPPORT WAS READY TO PAY (ABSORB) $2000 AND $1800 TO BE PAID BY THE CUSTOMER. EVEN AFTER INITIAL REPAIR AND PAYMENT OF ($1800+TAX) $2166 THE VEHICLE STILL HAVE THE SAME SYMPTOMS AND ISSUES.      PRESENTLY THE VEHICLE IS UNDER REPAIR WITH THE DEALER (FREMONT TOYOTA, CA). THE VEHICLE USE WAS NORMAL, REGULAR CITY/HIGHWAY USAGE, WELL MAINTAINED SINGLE OWNER. NOTHING HEAVY WAS TOWED AND USED IN ROUGH OR ABNORMAL CONDITIONS.    IF POSSIBLE NTSB NEEDS TO:  1. TO LOOK INTO THIS MODEL OF VEHICLE AND SEE IF THERE ARE OTHER REPORTED PROBLEMS WITH SIENNA 2010 ENGINES.  2. TO INVESTIGATE WHY THIS VEHICLE HAVE THIS ISSUE WITHIN 46,847 MILES.  3. CAN MANUFACTURE BILLS THE ENTIRE COST OF REPAIR, SINCE THIS SEEMS A MAJOR DESIGN OR ENGINE ISSUE WITH THIS MODEL OF VEHICLE.  4. ADVISE TO ISSUE A SAFETY NOTICE TO ALL TOYOTA SIENNA 2010 V6 ENGINE MODEL OWNERS SINCE THIS CAN BE DISASTROUS IN MIDDLE OF TRAFFIC AND CAN CAUSE ACCIDENTS/PROBLEMS TO ALL ON THE ROAD.  *TR",
        "vin": "5TDYK4CC6AS"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "09/19/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695279,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V273000 (TIRES) HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 4/21/15*CN",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOOR CABLE SNAPPED ON 2010 SIENNA XLE.  DUE TO THE NUMBER OF COMPLAINTS ON THIS PARTICULAR ISSUE, IN 2012 TOYOTA OFFERED A WARRANTY ENHANCEMENT FOR MODEL YEARS 2004-2007 ONLY.  THEY SAID THAT THEY HADN'T YET RECEIVED ENOUGH COMPLAINTS ON MODEL YEARS 2008-2010 TO WARRANT AN EXTENSION FOR THESE YEARS.  WHEN ASKED IF THE 2010 MODEL HAD BEEN CHANGED IN ANY WAY FOR THIS EXISTING PROBLEM THEY SAID NO.    IF ENOUGH PEOPLE COMPLAIN TOYOTA WILL CONSIDER EXTENDING THEIR EXISTING WARRANTY ENHANCEMENT FROM 2004-2007 TO 2004-2010. TOYOTA IS AWARE THAT THIS CABLE ASSEMBLY IS FAULTY ON 2008-2010 BUT HAVEN'T INCLUDED US IN THEIR \"CUSTOMER SUPPORT PROGRAM\" DUE TO THE FACT THAT THEY HAVEN'T RECEIVED ENOUGH COMPLAINTS.  *TR",
        "vin": "5TDYK4CC9AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690539,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COVER BUSTED OPEN AT TOP WHILE I WAS DRIVING DOWN A BUSY ROAD.  TRANSMISSION FLUID DRAINED CAUSING GEARS TO SEIZE.",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679520,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT RED LIGHT.  WHEN I PROCEEDED TO DRIVE, I STARTED TO HEAR LOUD, CLANGING/THUDDING NOISES COMING FROM ENGINE, THEN I HEARD ONE LARGE THUD.  THE TRANSMISSION GEARS HAD SEIZED (COMPLETELY LOCKED UP), CAUSING SUCH TENSION/FRICTION THAT IT CAUSED TRANSMISSION COVER TO EXPLODE.  PARTS WERE FALLING OUT OF TRANSMISSION AND TRANSMISSION FLUID EMPTIED ENTIRELY ON THE ROAD.  I WAS TOLD BY A TRANSMISSION MECHANIC THAT IT WAS A MIRACLE I WAS ABLE TO MANEUVER CAR TO SAFETY ON SIDE OF ROAD.  *TR",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DUAL AUTOMATIC SLIDING DOORS ON OUR 2010 TOYOTA SIENNA HAVE FAILED WITHIN 3 MONTHS OF EACH OTHER. THE MECHANISM ON THE DRIVER'S SIDE FAILED IN SEPTEMBER 2014 AND THE PASSENGER SIDE DOOR FAILED IN DECEMBER 2014. ON THE LEFT SIDE IT SEEMS THE CABLE BROKE. WE CAN USE THE DOORS IN MANUAL MODE BUT ONLY FROM THE OUTSIDE. THE GREATER CONCERN IS THE SAFETY ISSUE WITH MY KIDS NOT BEING ABLE TO OPEN THE DOORS FROM THE INSIDE. THE INTERIOR DOOR HANDLES DON'T FUNCTION AT ALL - NOT EVEN IN MANUAL MODE. THERE SHOULD BE A REDUNDANT FUNCTION WHERE IF THE AUTOMATIC DOORS FAIL KIDS DON'T BECOME TRAPPED. THIS IS ESPECIALLY TRUE IN  AN EMERGENCY SITUATION.  *TR",
        "vin": "5TDKK4CCAS3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/13/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY SIMPLE. HIT THE BUTTON TO CLOSE THE REAR PASSAGE SIDE SLIDING DOOR, DOOR STARTED TO CLOSE AND CABLE SNAPPED. BROUGHT TO TOYOTA AND THEY SAID IT WAS NOT UNDER WARRANTY AND WOULD COST $1,500.00 TO FIX. TOLD THEM TO GET TO OPEN IN MANUAL AND LEAVE IT AT THAT AS WE DON'T HAVE $1,500.00. FROM WHAT I SEE ON YOUR SITE THIS IS AN ON GOING PROBLEM WITH TOYOTA AND I HOPE YOU CAN GET SOMETHING DONE.  *TR",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "STRUCTURE,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663413,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A FLAT TIRE ON I-95, USED THE SPARE WHEEL, NOW I AM UNABLE TO GET THE SPARE WHEEL BACK UP UNDER MY TOYOTA SIENNA.  THE TOYOTA SAFETY INTERIM NOTICE RECALL #E1S STATES \"EXCESSIVE CORROSION MAY OCCUR ON THE END OF THE SPARE TIRE CARRIER CABLE,\" WHICH IS THE CASE FOR MY SIENNA.  I HAVE CALLED THE TOYOTA CUSTOMER EXPERIENCE CENTER  AT 1-888-270-9371 AND THEY KEEP ON SAYING THAT TOYOTA HAS NOT YET COME UP WITH A REMEDY FOR THIS SITUATION.  I TOOK MY SIENNA TO THE TOYOTA LUSTINE DEALERSHIP IN WOODBRIDGE, VA, BUT THEY WERE UNABLE TO FIX THE PROBLEM.  MY SIENNA IS A VANPOOL FOR SIX PEOPLE COMMUTING BETWEEN WOODBRIDGE, VIRGINIA AND WASHINGTON, DC EVERY DAY.  I NEED TO HAVE MY SPARE WHEEL PROPERLY IN PLACE.  IT HAS BEEN OVER A HALF A YEAR.  PLEASE HELP.  *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "11/05/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652849,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS MELTING AND I AM NOT SURE IF THIS COMPROMISE THE AIRBAG DEPLOYMENT OR WILL CAUSE THE AIR BAG TO DEPLOY DUE TO THE RAPID DETERIORATION OF IT.   *TR",
        "vin": "5TDKK4CC9AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER POWER SLIDING DOOR WAS CLOSING WHEN DOOR CABLE ALONG REAR SIDE WINDOW SNAPPED. DOOR WILL NO LONGER OPEN OR CLOSE, EVEN IN MANUAL MODE. THIS IS A SAFETY HAZARD NOT ALLOWING PASSENGERS TO EGRESS IN AN EMERGENCY. A DOOR MALFUNCTION SHOULD FAIL IN A SAFE MODE ALLOWING THE DOOR TO BE OPENED AND/OR CLOSED WHEN A FAILURE OCCURS. TOYOTA COVERED THIS REPAIR UP THRU 2007 MODEL YEAR BUT REFUSE TO COVER REPAIR ON SUBSEQUENT MODEL YEARS DISREGARDING MULTITUDE OF DEFECTIVE DOORS ON LATER MODELS INCLUDING MY 2010 MODEL. THIS IS A POOR DESIGN AND THE CONSUMER SHOULD NOT BE PENALIZED FOR A COMPANY NOT PROPERLY CORRECTING A DOCUMENTED DESIGN ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 FIRST, MY DRIVER SIDE REAR POWER DOOR STOPPED WORKING DUE TO A BROKEN CABLE. IT WAS VERY DIFFICULT TO SHUT THE DOOR MANUALLY EVEN WITH THE POWER SWITCH SHUT OFF. I HAD TO CALL MY HUSBAND TO COME AND ASSIST ME IN CLOSING THE DOOR SO I COULD SAFELY DRIVE WITH MY THREE CHILDREN.  THIS REPAIR WAS NOT INCLUDED IN SB-0280-10 WHICH TOYOTA EXTENDED THE WARRANTY ON CERTAIN ISSUES.  THOUGH, THE REPAIR WAS COVERED BY TOYOTA AS A ONE TIME \"GOOD WILL\" PER REPRESENTATIVES.    I CONTINUED TO HAVE ONGOING ISSUES WITH REAR POWER SLIDING DOORS STICKING OR NOT CLOSING COMPLETELY.  OFTEN THE BEEPING ONCE THE VEHICLE IN GEAR INDICATING THAT THE DOOR IN FACT WAS STILL OPEN.  EACH TIME, IT REQUIRED ME TO SWITCH TO MANUAL TO CLOSE DOOR.  2014 THE PASSENGER SIDE REAR POWER DOOR CABLE BROKE.  AGAIN, I BROUGHT THE VEHICLE TO TOYOTA.  THIS TIME THEY SAID THAT THE REPAIR WOULD COST $1200.  AFTER SOME DISCUSSION THEY AGREED TO PAY FOR PARTS ONLY AS A \"GOOD WILL REPAIR\" LEAVING ME TO PAY OVER $500 FOR LABOR.  I CONTACTED TOYOTA CSP, WHO CONFIRMED THAT THIS REPAIR WAS NOT PART OF THE SERVICE BULLETIN LISTED ABOVE.  THEREFORE, I WILL NOT BE HAVING THE REPAIR.  WE WILL BE USING THE DOORS IN MANUAL MODE.  THIS IS A HUGE SAFETY CONCERN FOR FAMILIES WITH YOUNG CHILDREN SITTING IN THE SAFETY OF THE BACK OF A MINIVAN.  I HAD TROUBLE EVEN MANUALLY CLOSING THE DOOR AT ONE POINT.  FORTUNATELY, THE BEEPING INDICATING AN OPEN DOOR PREVENTED ME FROM DRIVING WITH A PARTIALLY OPEN DOOR.  BUT WHO'S TO SAY THAT WILL ALWAYS FUNCTION.  I DON'T UNDERSTAND HOW SOME PARTS ARE INCLUDED IN SERVICE BULLETIN AND OTHERS NOT IN THESE DOORS.   *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH IN A WEEK OF OTHER BOTH SLIDING DOORS CAN NOT OPEN , CABLE BROKE ON BOTH SLIDING  DOORS CAUSING THE DOORS TO JAM AND CAN NOT BE OPENED TO LET A PASSENGER OUT IN CASE OF EMERGENCY. SAFETY ISSUE !!!!  *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/12/2014",
        "dateOfIncident": "09/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS PULLING INTO A PARKING SPACE IN A COMMERCIAL PARKING LOT THE VAN SUDDENLY ACCELERATED WHILE MY FOOT WAS ON THE BRAKE.  I HIT THE CAR PARKED FACING ME WHICH STOPPED MY FORWARD MOTION.   *TR",
        "vin": "5TDKK4CC3AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "10/26/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630274,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR POWER DOORS LOCK UP AND DO NOT WORK.  HAVE TAKEN TO DEALERSHIP SEVERAL TIMES.  DRIVER SIDE REAR POWER DOOR NOW DOES NOT OPEN.  *TR",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I COME TO PARK THE VAN IN TO THE GARAGE VAN ACCELERATED  IT SELF WITHOUT I PUT LEG ON THE ACCELERATION AND TRY TO APPLIED THE BREAK AND IT DID NOT STOP.  THE VAN WENT FAST  AND HIT THE GARAGE DOOR AND BROKE THE WALL. VAN BUMPER GOT DAMAGED TOO.  IT NEVER HAPPENED BEFORE TO ME. IT WAS SUDDEN ACCELERATION OF THE VAN.  *TR",
        "vin": "5TDYK4CC0AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE PASSENGER SIDE REAR SLIDING DOOR FAILED TO OPEN. THE CONTACT MENTIONED THAT DURING COLD WEATHER THE FAILURE PROGRESSED. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE THE FAILURE WAS UNABLE TO BE DUPLICATED. THE CONTACT MENTIONED THAT THE DOOR WAS PREVIOUSLY REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 35,000.",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606097,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE REAR AUTOMATIC SLIDING DOOR WAS BECOMING DIFFICULT TO OPEN. HAD TO PULL AND HOLD OUT THE OUTSIDE DOOR HANDLE TO GET THE DOOR TO START OPENING. IT WAS DIFFICULT FOR A CHILD TO DO. HAD THE LOCK ASSEMBLY REPLACED FEB 2014 UNDER WARRANTY DUE TO A LETTER I RECEIVED PRIOR FROM TOYOTA SAYING THEY WERE HAVING DIFFICULT WITH THE LOCK ASSEMBLY AND WOULD REPLACE IF IT OCCURRED. THIS RESOLVED THE DOOR OPENING, HOWEVER IN JUNE THE DOOR CABLE BROKE CAUSING THE DOOR TO JAM. I HAD TO CUT THE CABLE UNDER THE REAR WINDOW TO ENABLE TO DOOR TO OPEN AND CLOSE MANUALLY. ALSO THE DOOR HINGE WAS WORN AND NEEDED TO BE REPLACED. DEALER SAID NEITHER ARE UNDER WARRANTY. I HAD THE HINGE REPLACED AT $280 SO THE DOOR SLIDES SMOOTHLY AND BECAUSE I WAS AFRAID IT MIGHT BREAK CAUSING THE DOOR TO FALL OFF. THE CABLE AND MOTOR ASSEMBLY (MOTOR STILL RUNS) WILL COST $1,800. THIS IS EXTREMELY DISAPPOINTING FOR A VEHICLE LESS THAN 5 YEARS OLD AND ~100K MILES. I BELIEVE TOYOTA HAD A RECALL ON THIS CABLE ASSEMBLY FOR MODEL YEARS 2004-2007. THEY SHOULD EXTEND THAT RECALL THROUGH 2010 TO COVER ALL THE 2ND GENERATION SIENNAS.  *TR",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA.  CONSUMER WRITES IN REGARDS TO SLIDING DOOR CABLE ASSEMBLY PROBLEMS.  *SMD  THE CONSUMER STATED A FEW MONTHS AGO, HE HAD ENDLESS PROBLEMS WITH THE LATCH ASSEMBLY ON BOTH SLIDING DOORS, WHICH THE DEALERSHIP REPAIRED, AS THEY STATED IT WAS ON RECALL. THE CONSUMER HAD TO GO BACK SEVERAL TIMES, BEFORE THEY FINALLY FIXED IT. SOON AFTER, THE PROBLEM WITH THE CABLE ASSEMBLY ON THE PASSENGER SIDE DOOR CROPPED UP, AND SURPRISINGLY, THAT PARTICULAR PART WAS NOT RECALLED. DUE TO THE FAILURE OF THE CABLE, THE CONSUMER WAS UNABLE TO OPEN THE DOOR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "04/19/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597969,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER POWER SLIDING DOOR STOPPED WORKING.  THE DEALER INFORMED THE CONSUMER, THE ISSUE WAS WITH THE CABLE ASSEMBLY. THE CONSUMER FURTHER FOUND OUT, THE PART WAS RECALLED ON PREVIOUS MODELS. WITH THE CABLE ASSEMBLY BROKEN, THE DOOR WOULD UN-LATCH, BUT COULD NOT BE MOTORIZED TO OPEN.",
        "vin": "5TDKK4CC5AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "07/23/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576906,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA  SIERRA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 5 MPH INTO A PARING LOT, THE VEHICLE ACCELERATED TO 85 MPH AND THEN CRASHED INTO TWO PARKED VEHICLES.  THE BRAKE PEDAL WAS ENGAGED REPEATEDLY AND THE IGNITION WAS TURNED OFF IN ORDER TO STOP THE ACCELERATION FAILURE.  THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS NOT FILED OF THE INCIDENT.  THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE FRONT END OF THE VEHICLE WAS REPAIRED. THE TECHNICIAN WAS UNABLE TO DIAGNOSE A FAILURE. THE FAILURE LATER RECURRED AND THE CONTACT SUSATINED SEVERE DAMAGES TO THE VEHICLE. A POLICE REPORT WAS FILED WITH NO INJURIES. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 68,000. UPDATED 07/01/14 MA",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA WAS STOPPED AT A RED LIGHT, WITH MY RIGHT FOOT ON THE BRAKE, WHEN IT SUDDENLY LAUNCHED ITSELF INTO THE BACK OF THE VEHICLE IN FRONT OF ME. (THIS WAS ALMOST UNBELIEVABLE, BUT THANK GOD I HAD A WITNESS! A GENTLEMAN PREVIOUSLY UNKNOWN TO ME, WHO JUST HAPPENED TO BE STANDING ON THE SIDE WALK WHEN HE SAW IT HAPPEN. AS I STEPPED OUT OF MY VEHICLE, I HEARD HIM DESCRIBING TO THE DRIVER IN FRONT OF ME WHAT I HAD JUST EXPERIENCED.)    UPDATED 04/07/14..UPDATED 04-29-14 *BF..UPDATED 06/16/14 *BF  UPDATED 09/20/2017*JS  *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING THE REAR LIFT GATE WITH THE REMOTE, THE LIFT GATE WILL AUTOMATICALLY BEGIN TO CLOSE ONCE FULLY OPEN.  ON SEVERAL OCCASIONS THIS HAS OCCURRED AS SOMEONE IS PLACING ITEMS IN THE BACK OF THE VAN.  IT TAKES AN EXTREME AMOUNT OF PRESSURE TO PRESS AGAINST THE LIFT GATE TO GET IT TO REOPEN WHEN THIS OCCURS.  *TR",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "03/08/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567975,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE, THE NAVIGATIONAL DISPLAY WHEN BLACK WITH A \"NO DVD.  PLEASE INSERT MAP DVD\" MESSAGE.  I EJECTED AND REINSERTED THE MAP DVD BUT IT DID NOT CORRECT THE PROBLEM.  TODAY, NONE OF THE BUTTONS (RADIO, NAV SYSTEM, BLUETOOTH, MAINTENANCE INFO) ON THE NAV SYSTEM OR ON THE STEERING WHEEL WORK.  THE SCREEN IS BLACK WITH A MESSAGE ASKING FOR THE MAP DVD TO BE INSERTED.  *TR",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "12/25/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567109,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER LIFTGATE OPENS THEN CLOSES AUTOMATICALLY. AS IT CLOSES IT DOES NOT RETRACT UPON LIKE PRESSURE AND CAN CAUSE INJURY BY CLOSING IN ON THE PERSON ACCESSING THE TRUNK. THIS OCCURS WHEN THE TEMPERATURE DROPS BELOW 40F. MY WIFE WAS HIT BY THE CLOSING LIFT GATE AND HURT HER ARM.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/26/2014",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561573,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELTS ARE ALWAYS JAMMED WHEN YOU ARE TRYING TO PULL THEM OUT, BOTH ON DRIVER SIDE AND PASSENGER SIDE.  *TR",
        "vin": "5TDKK4CC4AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "04/10/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT THE DRIVER'S SIDE AUTOMATIC SLIDING DOORS WOULD NOT OPEN FROM THE INTERIOR OR EXTERIOR OF THE VEHICLE. THE CONTACT MENTIONED THAT THE PASSENGER SIDE DOOR FAILED PRIOR TO THE RECENT FAILURE AND WAS REPAIRED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE CABLE ASSEMBLY WAS FRACTURED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 42,000 AND THE CURRENT MILEAGE WAS 67,000.",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/25/2013",
        "dateOfIncident": "11/21/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553797,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED THIS CAR USED AN LOVE IT EXCEPT FOR ONE THING: THE HEAD REST PUSHES MY HEAD FORWARD WHEN SITTING UPRIGHT. I HAVE GOOD POSTURE AND SIT VERTICALLY AND THE HEADREST FORCES MY HEAD FORWARD, CAUSING NECK PAIN. RECLINING THE SEAT MAKES IT DIFFICULT TO REACH THE STEERING WHEEL. I'M A FEMALE WHO IS 5' 8\" BUT WITH DISPROPORTIONATELY LONG LEGS AND A SHORT TORSO. I CANNOT MOVE THE SEAT TOO FAR FORWARD SINCE IT CRAMPS MY LEGS.  AN ADJUSTABLE HEADREST ANGLE WOULD ALLOW ME TO HAVE THE HEADREST PROTECT ME FROM WHIPLASH IN AN ACCIDENT WITHOUT INDUCING DISCOMFORT EVERY TIME I DRIVE.  *TR",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2013",
        "dateOfIncident": "07/28/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AUTOMATIC SLIDING DOOR FAILED TO OPEN, AND THE PASSENGER WAS NOT ABLE TO OPEN  THE DOOR MANUALLY. A CABLE THAT OPERATES THE DOOR HAD BROKEN, AND JAMMED THE DOOR. THIS COULD HAVE BEEN A VERY DANGEROUS SITUATION HAD THE PASSENGER HAD TO EXIT THE VEHICLE IN AN EMERGENCY. WE HAD TO TAKE THE   VAN TO A DEALERSHIP, WHERE THEY CUT THE CABLE IN ORDER TO OPEN THE DOOR.  *TR",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10525727,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIENNA HAS A PROBLEM WITH THE REAR SLIDING DOOR- AN ISSUE THAT TOYOTA IS AWARE OF ALREADY FROM ITS OTHER CUSTOMERS WHO OWN A SIENNA AS FAR BACK AS 2004. WHEN I RECEIVED  AN ALERT NOTICE FROM TOYOTA CONCERNING THIS ISSUE AND ALSO THE ALERT FOR THE CORROSION OF THE SPARE TIRE CARRIER CABLE BACK IN AUGUST 2012, I TOOK MY SIENNA INTO MY TOYOTA DEALER, ON AUG. 24, 2012, TO HAVE BOTH ISSUES FIXED . HOWEVER, I WAS TOLD THAT MY TOYOTA EXTENDED WARRANTY, WHICH I PURCHASED FOR ANY ELECTRICAL ISSUES THAT I MAY ENCOUNTER, DID NOT COVER THE SLIDING DOOR SENSOR, WHICH I CONSIDER IS AN ELECTRICAL PROBLEM BY THE MANUFACTURER, AND THERE WAS NO OFFICIAL PRODUCT RECALL FOR THE SLIDING DOOR PROBLEM WHICH OBLIGATED THEM TO REPAIR IT.  MY PROBLEM WITH THE SLIDING DOOR IS VERY RANDOM, AND HAS NO PATTERN OF WHEN (NO WEATHER CONNECTION) OR WHY IT OCCURS. THE SLIDING DOORS ON MY SIENNA HAVE INTERMITTENTLY CLOSED ON BOTH MY HUSBAND AND ME ON VARIOUS OCCASIONS, SINCE OUR PURCHASE IN AUGUST 2009 (FIRST OCCURRENCE WAS AROUND APRIL 2010), ALSO WHILE TRYING TO BUCKLE MY CHILDREN INTO THEIR SEATS OR JUST OPENING THE DOOR WITH THE REMOTE CONTROL OR MANUALLY, AND AS A RESULT, HAVE EXPERIENCE MINOR BRUISES TO OUR SHOULDERS.  THE DOOR IS NOT SUPPOSE TO OPEN WHEN THERE IS A PHYSICAL BODY IN THE DOOR'S PATH, BUT MY DOORS DO RANDOMLY, AGAIN A MAJOR SAFETY HAZARD WITH KIDS MOVING IN AND OUT OF THE CAR.  *TR",
        "vin": "5TDKK4CCXAS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/04/2013",
        "dateOfIncident": "05/04/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510644,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED DRIVER SEAT BELT TO PUT IT ON. IT GOT TWISTED AND JAMMED AND WAS UNABLE TO BE USED. *TR",
        "vin": "5TDDK4CC4AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/17/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503347,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR IS NOT WORKING CORRECTLY, IT APPEARS CENTER HINGE BEARING HAS FAILED. VAN IS NOT USED THAT OFTEN. 2010 WITH ONLY ABOUT 12K MILES. IT IS DISTURBING TO SEE SO MANY OTHER PEOPLE ON THE INTERNET ALSO HAVING MANY ISSUES WITH SLIDING DOORS ON TOYOTA VAN. I USE TO BE A MECHANIC FOR COLLEGE. IT SEEMS PARTS USED ARE EITHER UNDER SPEC'D OR COST SAVING QUALITY TO FAIL SO SOON LIKE THIS.  *TR",
        "vin": "5TDYK4CC2AS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2013",
        "dateOfIncident": "01/20/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494505,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WERE INSPECTED AT TIRE ROTATION IN DECEMBER 2012 BY LOCAL TRUSTED MECHANIC.  BRAKES CHECKED GOOD AND HAD APPROXIMATELY 10,000 MILES REMAINING.  ON JANUARY 20, 2013 FAMILY RETURNED HOME FROM A 3 HOUR DRIVE TO THE SMELL OF BURNING COMING FROM THE RIGHT REAR TIRE.  TIRE RIM WAS NOTED TO BE AS BLACK AS THE RUBBER OF THE TIRE.  WISPY SMOKE WAS SEEN RISING FROM THE RIGHT REAR ROTOR/BRAKE PADS.  EXTREMELY HOT TO TOUCH.    ON JANUARY 21 ,2013 BRAKES WERE EXAMINED BY SAME MECHANIC AND PADS WERE DESTROYED.  ROTOR WAS ALSO DAMAGED.  CAUSAL FACTOR COULD NOT BE DETERMINED.  BOTH ROTOR AND PADS REPLACED AND BRAKE FLUID DRAINED AND REFILLED.  ON JANUARY 23, 2013 SITUATION RETURNED WITH RIGHT REAR TIRE.  THE SMELL OF \"HOT BRAKES\" WAS COMING FROM THE TIRE AND RIM WAS VERY HOT TO TOUCH.  NEW ROTOR SHOWS EXCESSIVE SCARING.  *TR",
        "vin": "5TDYK4CC1AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/19/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493806,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT  THE FRONT PASSENGER SIDE DOOR WOULD NOT OPEN FROM THE INTERIOR OR EXTERIOR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN ADVISED THE CONTACT THAT THE CLIPS THAT HELD THE PANEL IN PLACE WERE FRACTURED AND WOULD HAVE TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490311,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT HEARD A LOUD ROARING SOUND COMING FROM THE REAR OF THE VEHICLE. THE REAR DRIVER'S SIDE WHEEL THEN SEIZED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THAT THE REAR BRAKING SYSTEM WOULD HAVE TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 57,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474327,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VAN HAS WATER LEAKING AND HAS AN AWFUL MOLD SMELL THAT IS CAUSING ILLNESS AND ASTHMA ATTACKS FOR MY KIDS.  TOYOTA WANTS ME TO PAY TO REPAIR THEIR FAULTY WINDOW SEALS.  POOR QUALITY AND EVEN POORER SERVICE.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2012",
        "dateOfIncident": "08/17/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR SUDDENLY STOPS WORKING AND THEN START WORKING AGAIN.  NOW IT STOPS WORKING AGAIN.  CAN NOT OPEN EITHER BY THE REMOTE CONTROL NOR BY MANUALLY PULL THE DOOR HANDLE OR INSIDE BUTTON.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2012",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460413,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A RIGHT HAND TURN IN TO A PARKING SPACE IN A PARKING LOT.  I HAD MY FOOT ON THE BRAKE AS IT WAS A SHARP RIGHT TURN IN TO THE SPACE AND WAS SLOWLY ENTERING THE SPACE.  WHEN I WAS ABOUT 2 FEET AWAY FROM THE PARKING BLOCK AT THE FRONT OF THE SPACE, THE VAN SUDDENLY ACCELERATED AND SHOT FORWARD OVER THE PARKING BLOCK AND ABOUT 8 FEET OUT IN TO A GRASSY YARD IN FRONT OF THE LOT.  AS IT SHOT FORWARD, I QUICKLY CHECKED TO MAKE SURE THAT MY FOOT WAS ON THE BRAKE AND NOT THE GAS PEDAL.  IT WAS ON THE BRAKE AND I WAS PUSHING THE BRAKE THE ENTIRE TIME.  THE ACCELERATOR OVERRODE THE BRAKE.  I HAD NO CONTROL OVER THE ACCELERATION.  WE TOOK THE VAN TO TOYOTA WHERE THEY KEPT IT OVERNIGHT.  THEY TOLD US THEY \"WERE UNABLE TO REPLICATE THE PROBLEM\".  THEY VERBALLY TOLD US THAT THERE WAS NOTHING WRONG WITH IT AND IT WAS SAFE TO DRIVE.  WE ASKED THEM TO PUT THAT IN WRITING AND THEY REFUSED AND SAID THAT THEY COULD NOT PUT THAT IN WRITING.  *TR",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "04/14/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT WAS DRIVING APPROXIMATELY 5-10 MPH WHEN HE ATTEMPTED TO SWITCH OFF THE INTERIOR LIGHTS AND INSTEAD, HAPHAZARDLY ENGAGED THE AUTOMATIC DOOR SWITCH, CAUSING THE SIDE SLIDING DOORS TO OPEN. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE DESIGN OF THE VEHICLE COULD NOT BE COMPROMISED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 50,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447456,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "GENERAL COMPLAINT ABOUT REAR SIDE VISIBILITY DURING REVERSING. WITH BABY CAR SEATS, ON THE DRIVER SIDE OF THE MINI VAN, THE DRIVER SIDE REAR WINDOWS ARE OBSTRUCTED AND THE VISIBILITY IS RESTRICTED CONSIDERABLY DURING BACK UP. ASKED TOYOTA IF I CAN BUY REAR CAMERAS BUT WAS TOLD THAT IT COMES ONLY FACTORY INSTALLED. I CONSIDER THIS A SERIOUS ANOMALY.     THE MINI VAN OCCASIONALLY RUNS WITHOUT SLOWING DOWN WHILE THE GAS PEDAL IS NOT USED. IT RETAINS  SPEED GIVING A FALSE HOPE THAT IT IS ON CRUISE CONTROL MODE. INFORMED TOYOTA ABOUT THE SAME AND WAS TOLD IT IS A FEATURE.  *TR",
        "vin": "5TDKK4CC0AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/26/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427243,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW 2010 SIENNA VAN. REMOTE CONTROL FAILED BEGINNING OF SEPT 2011. TOOK IT BACK TO DEALERS AND WAS CHARGED TO RE-PROGRAM.  *TR",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "08/22/2011",
        "dateOfIncident": "08/20/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421008,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS RETURNING HOME WITH HER 2011 TOYOTA SIENNA VAN. SHE PULLED INTO THE DRIVEWAY, TOOK HER FOOT OF THE GAS AND PUT ON THE BRAKE BUT THE VAN ACCELERATED RIGHT INTO MY 2011 FORD FUSION, CAUSING A LOT OF DAMAGE. I WON'T KNOW EXACTLY HOW MUCH UNTIL THE BODY SHOP CALLS ME TOMORROW. OF COURSE I KNOW THE SIENNA WASN'T EVEN ON TOYOTA'S RECALL, BUT I HAVE SEEN MANY REPORTS OF THE SAME PROBLEM ON LINE. MY WIFE IS NOW AFRAID TO DRIVE THE VEHICLE AND WE DON'T KNOW WHAT TO DO?  *TR",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/13/2011",
        "dateOfIncident": "06/06/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2010 TOYOTA SIENNA. THE CONTACT STATED THAT  THE VEHICLE DID NOT HAVE A SPARE TIRE, EVEN THOUGH THE OWNER'S MANUAL STATED THAT THE VEHICLE DID HAVE A SPARE. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE VEHICLE DID NOT COME WITH A SPARE TIRE DESPITE WHAT WAS STATED IN THE MANUAL. THE CONTACT BELEIVED IT TO BE A SAFETY ISSUE BECAUSE THE VEHICLE WAS SOLD UNDER THE IMPRESSION THAT A  SPARE TIRE WAS AVAILABLE AND COULD BECOME STRANDED BECAUSE OF A TIRE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 20,600.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/19/2011",
        "dateOfIncident": "10/30/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THAT ON OCCASION THE REAR HATCHBACK DOOR WOULD NOT CLOSE WITH THE ELECTRONIC REMOTE OR MANUALLY. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE, HOWEVER, THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE DEALER REPLACED THE SENSOR STRIP AND RE-INITIALIZED THE REMOTE, BUT THE FAILURE WAS NOT CORRECTED AND THE REAR HATCHBACK DOOR  WOULD STILL INTERMITTENTLY NOT CLOSE. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THEY ADVISED THAT THEY COULD NOT REPLACE ANY ADDITIONAL PARTS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 30,000 AND THE CURRENT MILEAGE WAS 34,000.",
        "vin": "5TDYK4CC1AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/04/2011",
        "dateOfIncident": "04/04/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO PARK MY 2010 TOYOTA SIENNA WITH ONE FOOT ON THE BRAKE THE VEHICLE ACCELERATED INTO A SIGN POST AND INTO THE VACUUM AT THE CAR WASH.  THE VEHICLE'S BRAKES WENT SOFT AND UNRESPONSIVE EVEN WITH BOTH FEET ON THE PEDAL, IT ONLY STOPPED WHEN IT COULD NOT GO ANY FURTHER AND I WAS ABLE TO PUT THE VEHICLE IN NEUTRAL.  THERE WAS DAMAGE TO THE DRIVER SIDE FRONT QUARTER PANEL AS WELL AS PROPERTY DAMAGE.  I SIMPLY COULD NOT STOP THE VEHICLE.  *TR",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2011",
        "dateOfIncident": "02/04/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10384998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED IN LEFT TURN LANE AND HIT HEAD ON BY ANOTHER VEHICLE AT ABOUT 30-35 MPH.  AIR BAGS DID NOT DEPLOY AND SEAT BELT RETRACTOR FAILED RESULTING IN SEVERE INJURY TO STERNUM AND RIBS",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2011",
        "dateOfIncident": "01/15/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 2007 TOOK OUR SIENNA TO DEALER FOR WARRANTY REPAIR.  THE PASSENGER DOOR WAS MAKING A POPPING NOISE AND WOULD NOT STAY OPEN WHEN PARKED FACING DOWNHILL.  DEALER CLEANED THE LATCH MECHANISM AND THE DOOR WORKED FOR A MONTH.  WE RETURNED TO THE DEALER FOR ADDITIONAL WARRANTY REPAIR IN SEPT. 2007.  THEY AGAIN CLEANED MECHANISM BUT REPLACED NO PARTS.  THE AUTOMATIC SLIDER DOOR CEASED WORKING SHORTLY AFTER THIS.  WE CONTINUED TO USE BOTH SLIDER DOORS IN MANUAL MODE UNTIL JANUARY 2011.  THE PASSENGER DOOR FAILED TO SEAL AND LATCH IN A CLOSED POSITION WITH THE BODY OF THE VAN.  WE DROVE 70 MILES TO THE DEALER WHERE THEY WERE ABLE TO GET THE DOOR TO CLOSE BUT INFORMED US THAT THE DOOR HINGE AND LATCH MECHANISM NEEDED TO BE REPLACED.  WE RETURNED 7 DAYS LATER TO HAVE THE REPAIRS DONE AND WE WERE TOLD THAT THE DOOR WHICH WOULD OPEN AND CLOSE, BUT NOT LATCH, 7 DAYS EARLIER WOULD NOW NOT OPEN AT ALL AND THE AUTOMATIC SLIDER DOOR CABLE WOULD NEED TO BE CUT TO PERFORM THE REPAIRS AND THEN WE WOULD NEED TO REPLACE THE AUTOMATIC DOOR MOTOR AS WELL.  WE WERE ALSO INFORMED THAT THE DRIVER'S SIDE PASSENGER SLIDER DOOR WOULD ALSO NEED TO HAVE SIMILAR WORK AND THAT BY REPLACING THE HINGE WE COULD POSSIBLY SAVE THE LATCH AND AUTO SLIDER MOTOR ON THE DRIVERS SIDE.  UNFORTUNATELY THERE WAS NO WARNING THAT THE SLIDER DOOR WAS GOING TO FAIL AND WE WERE SEVERAL MILES FROM A TOYOTA REPAIR SHOP WHEN THE LATCH PROBLEM OCCURRED.  WE DROVE 70 MILES WITH  THE DOOR UNSECURED.",
        "vin": "5TDZA22C74S"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "12/18/2010",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371167,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Diono",
                "productMake": "RADIAN",
                "productModel": "10600",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "WE BOUGHT A SUNSHINE KIDS RADIAN XTSL CAR SEAT IN JULY 2010. WE INSTALLED IT USING A SEAT BELT IN OUR 2010 TOYOTA SIENNA. THE SEAT SEEMED FINE UNTIL WE TRIED INSTALLING IT WITH LATCH THIS PAST MONTH. THE SEAT KEPT COMING LOOSE. IT WOULD HAVE LESS THAN 1\" MOVEMENT AT THE BELT PATH WHEN WE BEGAN OUR TRIP AND BY THE TIME WE GOT HOME, WOULD BE MUCH MORE THAN 1\", PROBABLY A COUPLE INCHES.     WE THOUGHT PERHAPS IT WAS OUR SON KICKING THE LATCH TIGHTENER, BUT THIS PAST WEEKEND, WE HAD TO USE LATCH WITH IT FOR OUR YOUNGEST CHILD. SHE CANNOT REACH THE LATCH TIGHTENER AT ALL AND THE SEAT KEPT COMING LOOSE AGAIN.    THE SEAT MODEL IS 19556 AND WASN'T LISTED IN THE OPTIONS WHEN FILING THIS COMPLAINT. SERIAL NUMBER IS [XXX].   (RELATED VEHICLE INFORMATION: MODEL YEAR=2010, MAKE=TOYOTA , MODEL=SIENNA). *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/02/2010",
        "dateOfIncident": "10/31/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "YOU HAVE TO PUSH THE BRAKES VERY HARD AND ALL THE WAY TO THE FLOOR TO GET THE VEHICLE TO STOP.  THE BRAKE PADS AND SHOES WERE CHECK AND THEY ARE GOOD.  WE ALSO HAD THE BRAKES FLUSHED TWICE.  NO FLUID IS LEAKING BUT THE MECHANIC SAID, IT MAY BE THE ABS SYSTEM OR THE MASTER BRAKE CYLINDER BUT THIS WOULD BE UNUSUALLY FOR A CAR OF THIS AGE A 2007 TOYOTA SIENNA. *TR",
        "vin": "5TDZK23C97S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/19/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10361272,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING 45 MPH A VEHICLE REAR ENDED HIM. THE DRIVER SIDE CURTAIN AIR BAG DID NOT DEPLOY BUT THE PASSENGER SIDE CURTAIN AIR BAG DID. THE VEHICLE WAS DESTROYED AS A RESULT. FOUR PEOPLE SUSTAINED MINOR INJURIES. A POLICE REPORT FILED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 11,940.",
        "vin": "5TDYK4CC1AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/25/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352095,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA. CONSUMER STATES SEVERE CORROSION OF A SPARE TIRE CABLE *TGW  THE CONSUMER STATED HE RECEIVED A RECALL NOTICE IN THE MAIL REGARDING SEVERE CORROSION OF THE SPARE TIRE CABLE.  AN INSPECTION OF THE SPARE TIRE CABLE REVEALED CORROSION. THE CONSUMER STATED TO SUGGEST STORING A SPARE TIRE CONTAMINATED WITH ROAD DIRT, SALT AND OTHER POSSIBLE CONTAMINANTS INSIDE THE VEHICLE IS UNPROFESSIONAL AND DANGEROUS. THE CONSUMER IS REQUESTING A NEW SPARE TIRE CABLE AS SOON AS POSSIBLE. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2010",
        "dateOfIncident": "08/19/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350717,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA : WHEN DRIVING, THE SLIGHTEST TOUCH OF THE GEAR SHIFTER CAUSES A SHIFT INTO NEUTRAL.  THE GEAR SHIFTER IS EXTREMELY (AND POSSIBLY DANGEROUSLY?) SENSITIVE. *TR",
        "vin": "5TDYK4CC6AS"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SEEM LIKE THE BRAKE TAKE ABOUT 1 OR 2 SECOND BEFORE IT IS FINALLY ENGAGE IF I BRAKE NORMALLY. IF I BRAKE HARD THEN IT IS STOP VERY GOOD BUT IF I BRAKE SLIGHTLY BY PRESS THE BRAKE NORMALLY THEN IT IS NOT DOING GOOD JOB TO STOP IT. DEALER COULD NOT FIND ANY WRONG WITH IT. DEALER LET ME TEST DRIVE 2011 AND THE BRAKE ON THE MODEL WORK GOOD AS THE BREAK I HAVE ON KIA RONDO AND CHEVY IMPALA. I CALLED TOYOTA COMPANY AND THEY TOLD ME GO TO ANOTHER DEALER TO ASK FOR SECOND OPINION. I TOLD THEM ABOUT THE BRAKE ON 2011 MODEL. THEY SAID MY VAN HAS 7K MILEAGE, THE ONE I TESTED DRIVE IS NEW VAN. I TOLD THEM MY VAN IS STILL NEW. THEY SAY I CAN PURSUE THE ISSUE MY OWN IF I STILL THINK THE BRAKE IS NO GOOD. I WENT TO ANOTHER DEALER THEY ALSO SAID NO PROBLEM WITH THE BRAKE.   ON THE WEBSITE EDMUND TOWN TALK (HTTP://TOWNHALL-TALK.EDMUNDS.COM) HAS FEW PEOPLE COMPLAINING ABOUT THE BRAKE. MY WIFE HAD THE 2001 CAMRY AND HAD THE BRAKE ISSUE THAT VERY SLOW TO ENGAGE JUST LIKE THE VAN WE HAVE NOW.  I THINK THE GOVERNMENT NEED TO LOOK INTO TO BREAK ISSUE SINCE I HAVE DRIVE MANY DIFFERENCE BRANCH CAR, AND I FIND OUT THE TOYOTA BRAKE DOES NOT BRAKE GOOD WHEN YOU PUT THE BRAKE DOWN NORMALLY. *TR",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "07/16/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343965,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2010 TOYOTA SIENNA. DURING A ROUTINE OIL CHANGE THE DEALER NOTICED THAT BOTH REAR TIRES WERE WORN TO THE METAL WIRE AND THAT THEY COULD FALL APART AT ANYTIME. THE DEALER INFORMED HER THAT THE REAR MEMBER BAR WAS TOO LONG AND WAS FOR A DIFFERENT VEHICLE WHICH CAUSED THE TIRES TO BE OUT OF LINE. THE DEALER AGREE TO REPLACE THE REAR MEMBER BAR BUT COULD NOT CONFIRM IF THAT WOULD CORRECT THE FAILURE. THE VEHICLE WAS IN THE DEALERS POSSESSION WHEN THE COMPLAINT WAS FILED. THE CONTACT WILL NOTIFY THE MANUFACTURER AND INFORM THEM OF THE FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 36,000.",
        "vin": "5TDKK4CC7AS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10341589,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 25 MPH THE SECOND REAR SEAT MOVED BACK AND FORTH WHILE TWO CHILDREN WERE SEATED IN THEM. ONE OF THE CHILDREN   SUSTAINED AN INJURY TO HER LEG WHEN IT HIT THE REAR OF THE FRONT PASSENGER SEAT. THE CONTACT STATED SHE STOPPED THE VEHICLE WHEN  SHE GOT A CHANCE TO CHECK THE CHILDREN. THE CONTACT HAD TO DRIVE ONTO THE EMERGENCY LANE WHENEVER THE FAILURE OCCURRED TO MAKE SURE THE PASSENGERS WERE NOT INJURED. THE FAILURE OCCURRED THREE TIMES. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT STATED THAT ON ANOTHER OCCASION, THE SEAT LUNGED FORWARD WITH A CHILD IN IT BUT HE WAS NOT INJURED. THE APPROXIMATE FAILURE MILEAGE WAS 2,800 AND THE CURRENT MILEAGE WAS 3,100.",
        "vin": "5TDDK3DC3BS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341708,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA SIENNA UNCONTROLLED ACCELERATION. I ATTEMPTED TO SLOW VEHICLE BY PUMPING BRAKES WHICH RENDERED THEM TEMPORARILY USELESS.  SHIFTING INTO NEUTRAL DIDN'T WORK.  THEN ACCELERATION NORMALIZED AND BRAKES REGAINED FUNCTION. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/01/2010",
        "dateOfIncident": "05/31/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341025,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE QFC PARKING LOT, AT AROUND 5PM ON A CLEAR MONDAY EVENING I WENT TO TURN LEFT INTO A PARKING SPOT.  I STEPPED ON THE GAS AND NOTHING HAPPENED, I LET UP A BIT AND STEPPED AGAIN AND MY 2010 TOYOTA SIENNA SHOT FORWARD.  I SLAMMED ON THE BRAKE HALFWAY INTO THE PARKING SPOT AND RAN INTO THE TREE IN FRONT OF THE VAN.  I LOOKED DOWN AND COULD SEE THE OUTLINE OF THE GAS PEDAL SO MY FOOT WAS DEFINITELY ON THE BRAKE.  I WAS VERY SHAKEN UP.  THE VANS BUMPER AND HOOD ARE DAMAGED AND THE TREE LOST SOME BARK.  I HAD IT TOWED TO THE TOYOTA DEALERSHIP AND TOYOTA IS HAVING IT INVESTIGATED.  IT HAS BEEN THERE FOR A MONTH NOW.  POLICE WERE CALLED, BUT DID NOT TAKE A REPORT AS THERE WERE NO INJURIES. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCONTROLLED ACCELERATION WHERE DEPRESSING THE BRAKE PEDAL WAS \"SOFT\" AND DID NOT HAVE ANY EFFECT IN STOPPING THE VEHICLE.  I WAS PULLING INTO MY GARAGE AND AS I NEARED THE POINT WHERE I WANTED TO STOP, I PRESSED ON THE BRAKE PEDAL.  THIS HAD NO EFFECT AND THE VEHICLE CONTINUED TO ACCELERATE.  THE VEHICLE PROCEEDED THROUGH THE OTHER END OF THE GARAGE.  THERE IS A DROP FROM THE FLOOR OF THE GARAGE TO THE GROUND ON THE BACK SIDE OF THE GARAGE.  WHEN THE HEAVY FRONT END OF THE 2010 TOYOTA SIENNA WENT THROUGH THE GARAGE WALL, IT DROPPED TO THE GROUND AND THE VEHICLE WAS BALANCED LIKE ON A TEETER-TOTTER WITH 1 REAR WHEEL IN THE AIR INSTEAD OF ON THE GARAGE FLOOR.  THIS POSITION STOPPED THE VEHICLE FROM CONTINUING TO MOVE FORWARD.  I WAS UNABLE TO GET OUT BECAUSE THE DOORS WERE LOCKED AND DID NOT RELEASE WHEN I TRIED TO OPEN THE DOOR.  I CALLED THE LOCAL SECURITY FORCE WHO CAME TO MY ASSISTANCE.  WITH THE SECURITY FORCE PULLING ON THE DOOR FROM THE OUTSIDE, I WAS ABLE TO GET OUT THROUGH THE REAR PASSENGER DOOR.  THIS HAS NEVER HAPPENED BEFORE BUT THE CONSEQUENCE WAS FRIGHTENING EVEN AT THE SLOW SPEED THAT I WAS GOING.  I CONTACTED MY INSURANCE COMPANY AND THOUGH NOT FINALIZED, IT APPEARS THAT THEY BELIEVE THEY WOULD BE ABLE TO REPAIR THE VEHICLE.  THEIR REPAIRS WOULD BE BODY WORK, PAINTING, AND A NEW FRONT WINDSHIELD.  MY CONCERN IS THAT THESE REPAIRS MAY NOT ADDRESS THE ROOT CAUSE OF THE PROBLEM - THAT THE BRAKE PEDAL DID NOT SLOW OR STOP THE VEHICLE AS INTENDED. *TR",
        "vin": "5TDKK4CC3AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/22/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331789,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPEN ON MAY 3, 2010 AROUND 9:50AM . MY WIFE , BY HERSELF, DRIVE TO THE PARKING PLAZA IN FRONT OF RETAIL STORE, BEFORE IT HAPPENS SHE HAS FULLY BRAKE AND STOP , AND WAITING FOR OTHER DRIVER TO FULL OUT OF PARKING SPACE. SHE SLOWLY MAKES RIGHT TURN TO PARKING  SPACE, THE CAR, SIENNA 2010 VAN, SUDDENLY ACCELERATES TO HIGH SPEED AND SMASHES TO THE FRONT STORE, CAUSING THE DAMAGE THE WHOLE FRONT STORE , LUCKILY NO BODY INJURY IN THE INCIDENT. I THINK SOMETHING UNUSUAL HAPPEN TO THIS CAR, I HAD CONTACTED TOYOTA TO FURTHER ANALYSIS OF THE CAR, RIGHT NOW THE CAR IS IN DEALERSHIP , AWAITING FOR REPAIR. *TR",
        "vin": "5TDKK4CC3AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10330095,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING AT SPEEDS OF 10 MPH, THE VEHICLE ABNORMALLY ACCELERATED WITHOUT WARRANT AND CRASHED. THE POLICE ARRIVED ON THE SCENE AND FILED A POLICE REPORT ACCORDINGLY. THERE WAS ONE REPORTED INJURY AND THE VEHICLE WAS DESTROYED. THE FAILURE AND CURRENT MILEAGES WERE 5,100.",
        "vin": "5TDKK4CC2AS"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "04/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327542,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS 2010 TOYOTA SIENNA. THE CONTACT WAS DRIVING AT 65MPH WHEN SUDDENLY THE SUN ROOF EXPLODED. SHE WAS NOT SURE WHAT HAPPEN AS SHE DROVE THE VEHICLE HOME .AFTER THE EXPLOSION AND CALL THE DEALER. THEY STATED THEY WILL TAKE INSPECTS THE DAMAGES BUT CANNOT GUARANTEE THE WARRANTY OR IF SHE WOULD HAVE TO PAY THE COST ON THE REPAIRS. SHE THEN CALL THE INSURANCE COMPANY FILE A CLAIM SET AN APPOINTMENT FOR THEM TO INSPECT THE DAMAGES. NO ONE WAS INJURED BECAUSE THE COVER OF THE SUN ROOF WAS CLOSED BUT THERE IS A HOLE IN THE TOP OF HER VEHICLE. THE FAILURE AND CURRENT MILEAGE WAS 5,900.....MW",
        "vin": "5TDYK4CC8AS"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/16/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR DRIVER'S SIDE ON 9 MONTH OLD 2010 TOYOTA SIENNA HAS FAILED TWICE IN PAST THREE MONTHS. THE SLIDING DOOR CLOSES AND IS UNABLE TO RE-OPEN. PREVIOUS TO THE TWO FAILURES, DOOR HAS ONLY BEEN LOCKED AND CLOSED USING REMOTE CONTROL, HANDLE FROM OUTSIDE, OR LOCKED AUTOMATICALLY UPON ACCELERATING. BECAUSE AN INFANT OCCUPIES THE SEAT FOR THAT DOOR 100% OF THE TIME, DOOR IS NEVER OPENED OR LOCKED FROM THE INSIDE AND IS NEVER TOUCHED BY PASSENGERS FROM THE INSIDE. DEALERSHIP INDICATES THAT THE INSIDE LOCK LEVER IS BEING MANUALLY FORCED PAST THE LOCK POSITION WHEN CLOSING THE DOOR; HOWEVER, THE INSIDE LOCK LEVER HAS NEVER BEEN USED AT ALL BY ANY OF THE OWNERS. DEALER REASSEMBLED THE LOCK CONTROLLER TO CORRECT THE ISSUE THE SECOND TIME. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "04/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10325214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 17 MONTH OLD'S HEAD GOT JAMMED BETWEEN THE RIGHT REAR WHEEL AND THE RIGHT REAR DOOR PANEL WHILE THE ELECTRIC DOOR SLID OPEN. EVEN THOUGH MY WIFE PULLED ON THE DOOR HANDLE THE DOOR KEPT SLIDING OPEN. MY BABY'S HEAD WAS CRUSHED BETWEEN THE TIRE AND DOOR PANEL. THIS IS A VERY UNSAFE DESIGN AS MY WIFE TRIED TO STOP THE DOOR FROM SLIDING BACK AND THE DOOR KEPT MOVING.  I NEED SOMEONE TO CALL ME TO FURTHER DISCUSS THIS MATTER. MY CAR IS A 2011 MODEL. *TR",
        "vin": "5TDKK3DC1BS"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2010",
        "dateOfIncident": "03/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323660,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBJECT: SMOKE FROM NEW 2010 TOYOTA SIENNA CE.  I BOUGHT WHAT APPEARED TO BE A NEW 2010 TOYOTA SIENNA FROM DCH BRUNSWICK TOYOTA IN NORTH BRUNSWICK, NEW JERSEY ON MARCH 29, 2010. ITS ODOMETER READ 95 MILES. WE LEFT THE DEALERSHIP AT ABOUT 7:00 PM. MY WIFE DROVE THE CAR AND MY MOTHER, WHO IS SUFFERING FROM SCIATICA AND HAS RECENTLY UNDERGONE AN OPERATION, SAT IN THE PASSENGER SEAT. (IT MUST BE MENTIONED HERE THAT BOTH MY WIFE AND MOTHER HAVE EXTENSIVE EXPERIENCE IN DRIVING CARS  THAT GOES BACK AT LEAST TEN YEARS, AND MY WIFE ESPECIALLY IS QUITE FAMILIAR WITH THE BASICS OF CAR MECHANICS.) AT ABOUT 7:30 PM, WHEN MY WIFE TURNED THE HEATER ON, THE ENGINE STARTED MAKING LOUD THUMPING SOUNDS. MY MOTHER NOTICED A GLOW IN THE HOOD.  A CONSIDERABLE AMOUNT OF THICK DARK SMOKE STARTED RISING FROM THE HOOD. MY WIFE STOPPED THE CAR IMMEDIATELY AND TURNED THE ENGINE OFF. THINKING THAT THE ENGINE WAS ABOUT TO EXPLODE, THEY LEAPED OUT OF THE CAR AND RAN AWAY TO A SAFE DISTANCE IN THE MUD ON THE SIDE OF THE STREET FEARING FOR THEIR LIVES. THE PHYSICAL AND EMOTIONAL TRAUMA THAT MY MOTHER WAS SUBJECTED TO HAS CAUSED A SUBSTANTIAL INCREASE IN THE BACK PAIN LEADING TO NIGHTMARES AND INSOMNIA.  THE SMOKE THAT THE CAR CONTINUED TO EMIT FOR ANOTHER HALF AN HOUR GAVE THE IMPRESSION THAT THE ENGINE COULD EXPLODE ANY TIME. WE CALLED THE DEALERSHIP AND THEY HAD TO TOW THE CAR BACK TO THEIR PLACE.  THE DEALERSHIPS SERVICE CENTER TRIED TO DIAGNOSE THE PROBLEM. THE BEST THEY CAME UP WITH WAS: A POSSIBLE AIR BUBBLE IN THE COOLANT AND THERMOSTAT FAILURE. BUT IT COULD BE ANYTHING ELSE, THEY ADDED.  UPDATED 04/13/10.*JB",
        "vin": "5TDKK4CC3AS"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "03/28/2010",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SIENNA. WHILE DRIVING AT APPROXIMATELY 5 MPH, THE VEHICLE SUDDENLY STOPPED AND ALL THE LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED. THE STEERING WHEEL ALSO LOCKED UP SO THE CONTACT TURNED THE VEHICLE OFF. UPON RE-STARTING THE VEHICLE, THE FAILURE REOCCURRED. A TOW TRUCK WAS CALLED AND A POLICE OFFICER WAS ALSO AT THE SCENE. THE TOW TRUCK DRIVER NOTICED SMOKE EMITTING FROM UNDER THE HOOD OF THE VEHICLE UPON ARRIVAL. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 4,500.",
        "vin": "5TDJK4CC6AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/20/2010",
        "dateOfIncident": "03/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321199,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INVOLUNTARY ACCELERATION.  THE FAILURE HAPPENED WITHIN THE FIRST 30 MILES THAT WE HAD POSSESSION OF THE VEHICLE.  THERE WAS ONLY 430 MILES ON THE VEHICLE.  THE VEHICLE IS CURRENTLY AT TOYOTA BODY SHOP AND WE ARE AWAITING DISPOSITION OF THE VEHICLE. *TR",
        "vin": "5TDYK4CC2AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318377,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS STARTED EVEN IN WARM WEATHER, ENGINE RACES AND CAN GET UP TO 30 MILES PER HOUR WITHOUT DEPRESSING ACCELERATOR. SOMETIMES TAKES 15 TO 20 MINUTES TO GET TO A NORMAL IDLE. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "01/28/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318294,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "1. I BOUGHT A NEW TOYOTA SIENNA 2010 IN NOVEMBER 2009 AND FOUND THE RAILS OF THE PASSENGER SIDE SEAT CORRODED IN LESS THAN TWO MONTHS  2. THE SPARE TIRE  MECHANISM OF  THE SAME CAR WAS FOUND STUCK AND HAD TO BE REPLACED IN THE SAME TIME PERIOD.  THE DEALER HAS REPLACED THE SPARE TIRE MECHANISM BUT FAILED TO ADDRESS THE ISSUE OF CORROSION. I AM CONCERNED AS THIS AFFECTS THE RESALE VALUE OF MY CAR AND ALSO IF THE CORROSION EXISTS IN OTHER PARTS OF THE VEHICLE WHICH ARE NOT CONSPICUOUS.",
        "vin": "5TDKK4CC4AS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316759,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2010 TOYOTA SIENNA CE FROM SOUTHBAY TOYOTA IN GARDENA, CA AT ON JANUARY 24, 2010. AFTER MY WIFE DROVE IT FOR A WEEK, SHE FOUND THE CAR STARTED TO MAKE \"CRACKING\" SOUND NEAR THE STEERING WHEEL AREA ESPECIALLY WHEN THE CAR IS IN REVERSE DRIVING AND MOVING THE STEERING WHEEL SLOWLY. I TESTED IT AND THE ABNORMAL SOUND REPEATED EVERY TIME. I BROUGHT THE CAR TO SOUTHBAY TOYOTA A WEEK AGO, THEY DIDN'T IDENTIFY THE PROBLEM SINCE THE STREET IS SO NOISY. MY WIFE CONTINUED TO DRIVE THE CAR AND THE \"CRACKING NOISE\" BECAME LARGER AND AT THE SAME TIME SHE FELT THE BRAKE PUSHED HER FOOT UP. ON MARCH 1ST, 2010, I SENT THE CAR TO SOUTHBAY TOYOTA  AGAIN. THIS TIME THEY DUPLICATED THE PROBLEM AND CONTACTED TOYOTA AND ORDERED A \"INTERMEDIATE STEERING SHAFT\" AND WILL REPLACE IT. I DON'T KNOW THIS WILL SOLVE THE PROBLEM OR NOT. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316918,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2009 TOYOTA SIENNA ACCELERATED UNEXPECTEDLY AFTER THE CRUISE CONTROL WAS SET.  THIS HAPPENED 2 DIFFERENT TIMES WHILE MY WIFE WAS DRIVING IT.  I WAS NOT IN THE CAR.  MY WIFE HAD TO IMMEDIATELY PRESS THE BRAKE PEDAL TO RELEASE THE AUTO CRUISE.  AFTER THE BRAKE WAS PRESSED THE AUTOCRUISE RELEASED THE ACCELERATION.  OUR CAR IS NOT IN THE RECALL LIST I THINK.  WE NEVER TOOK OUR CAR FOR THE RECALL REPAIR AT ANY TIME SINCE WE HAVE HAD IT. *TR",
        "vin": "5TDYK4CC3AS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "11/20/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315851,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE MULTIPLE PROBLEMS. INITIALLY THERE WAS A WHISTLING NOISE WHILE DRIVING. THE DEALER REPLACED THE TRANSMISSION OF THE BRAND NEW VAN. THE WHISTLING NOISE WAS REDUCED BUT THERE ARE A BUNCH OF OTHER PROBLEMS.   1. ON START THE RPM GOES TO ABOUT 1600.   2. THERE IS CONSTANT LOAD HUMMING NOISE COMING FROM THE TRANSMISSION/ENGINE.   3. THE VEHICLE PICKUP MAKES A KNOCKING NOISE SOMETIMES  OVERALL I DEFINITELY DON'T FEEL SAFE DRIVING THIS VEHICLE. THE DEALER AND MANUFACTURER SAYS ALL THIS IS CONSIDERED TO BE 'WITHIN NORMAL RANGE'. *TR",
        "vin": "5TDKK4CC8AS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314398,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE LOADING MY KIDS AT A PARKING LOT, WE OPENED THE REAR HATCH WITH THE REMOTE CONTROL, IT OPENED COMPLETELY AND WHEN ONE OF THE KIDS WAS PUTTING HIS STUFF IN THE BACK THE HATCH STARTED TO CLOSE TO THE POINT IN WHICH IT WOULDN'T STOP. MY WIFE AND I HAD TO HOLD THE HATCH TO NOT LET IT CONTINUE CLOSING WITH MY KID IN THE WAY. THE HATCH CONTINUED TO PUSH DOWN AND PRESSING MY KID. AFTER A FEW SECONDS OF PULLING THE HATCH UP, FINALLY IT CAME BACK AND OPENED AGAIN, JUST TO THEN CLOSE AGAIN BY ITSELF WITH NO APPARENT REASON. THERE WERE NO INJURIES, JUST A GOOD AMOUNT OF STRESS FOR THE 10-15 SECONDS OF THE INCIDENT. *TR",
        "vin": "5TDYK4CC5AS"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/21/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY DROVE A RENTED 2010 TOYOTA SIENNA VAN, FROM ALAMO RENTALS IN SAN ANTONIO TEXAS. I FOUND THE CRUISE CONTROL SYSTEM A BIT QUIRKY AND A BIT STARTLING AT FIRST. ONCE THE CRUISE CONTROL WAS SET TO 70 MILE PER HOUR, THE SYSTEM OPERATED FINE AND MAINTAINED THE SET SPEED. HOWEVER, ONCE EVERY 3 OR 4 TIMES THE CRUISE CONTROL WAS DISCONNECTED USING THE BRAKE PEDAL, THEN USING THE RESUME FUNCTION OF THE CRUISE CONTROL, THE VEHICLE WOULD ACCELERATE RAPIDLY PAST 75 MILES PER HOUR. ONCE I DISCONNECTED THE CRUISE CONTROL AND RESET THE DESIRED SPEED, THE CRUISE CONTROL OPERATED NORMALLY. THIS SEEMED TO BE A PERSISTENT BUT INTERMITTENT ISSUE. ONCE I WAS AWARE OF THE POTENTIAL FOR RAPID ACCELERATION AND SPEED OVERSHOOT, I WAS ABLE TO ANTICIPATE AND CONTROL THE  VEHICLE FROM RUNNING AWAY.  IN LIGHT OF ALL THE ISSUES CONCERNING TOYOTA PRODUCTS, I THOUGH I WOULD BRING THIS TO YOUR ATTENTION. DRIVING CONDITIONS AT THE TIME OF THESE INCIDENTS WERE DRY CONCRETE ROAD, 7 PASSENGERS IN THE VEHICLE, HIGHWAY SPEED OF 70 MILES PER HOUR, OUTSIDE TEMPERATURES WERE BETWEEN 34 DEGREES F TO 70 DEGREES F. HIGHWAY WAS STRAIGHT AND LEVEL. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/11/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY I HIT A DEER IN MY 2010 SIENNA. THE IMPACT WAS DIRECTLY IN FRONT OF THE DRIVER. THIS WAS A VERY HARD IMPACT AND MY AIRBAGS DID NOT DEPLOY. I BOUGHT THIS VAN BECAUSE OF TOYATA'S SAFETY REPUTATION. I HAVE 2 SMALL CHILDREN AND I AM VERY CONCERNED ABOUT THEIR SAFETY IN THIS VAN. I AM CONCERNED THAT IF I NEED THE AIRBAGS THEY WILL NOT DEPLOY AGAIN. I CAN SEND YOU A PICTURE OF THE ACCIDENT IF YOU LIKE. PLEASE CONTACT ME BY EMAIL . I AM TRYING TO DETERMINE MY NEXT ACTIONS CONCERNING MY FUTURE IN THIS VEHICLE AND WITH TOYOTA. MY FAMILIES SAFETY IS MY PRIORITY. THANK YOU. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "11/30/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305120,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT VEHICLE START- COLD AMBIENT TEMPS -APPROX 20F AND LOWER, ENGINE GOES TO ABOUT 1800 RPM AND STAYS THERE FOR ABOUT 2 MINUTES BEFORE DROPPING DOWN TO ABOUT 1100 RPM.  AFTER SHFITING AND THE DRIVER TAKING THE FOOT OFF THE BRAKE PEDAL THE VEHICLE HAS A TENDENCE TO LURCH DUE TO THE HIGH ENGINE SPEED. THIS IS A SURPRISE EVENT EVERY TIME I OR MY WIFE START THIS VEHICLE AND I CONSIDER IT A SAFETY RELATED ISSUE.   AS A COMPARISON, MY 2003 CHEVY TRAILBLAZER COLD ENGINE RPM NEVER GOES ABOVE 900 RPM AND DOES NOT EXHIBIT THIS LURCH TENDENCY.  I COMPLAINED TO THE TOYOTA DEALER SERVICE MANAGER, AND HE OFFERED NO RESOLUTION- BASICALLY \"...THAT'S THE WAY IT IS.\"  THE DEALER HAS NO KNOWN PROCEDURE TO ADJUST THE COLD START ENGINE SPEED TO A LOWER LEVEL. I HAVE A DOCUMENTED SERVICE REPORT. *TR",
        "vin": "5TDYK4CCXAS"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "01/28/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN LIGHT SNOW AT A SLOW SPEED (10-15 MPH) DOWN A VERY SLIGHT HILL (5 DEGREES).  I TRIED TO COME TO A STOP, ONCE AT A TRAFFIC LIGHT AND ONCE AT A STOP SIGN, AND THE BRAKES COMPLETELY FAILED.  THEY MADE A GRINDING NOISE, BUT DID NOT SLOW THE CAR WHATSOEVER.  LUCKILY I DID NOT HIT OR WAS HIT BY ANOTHER CAR, BUT INCIDENT WAS VERY FRIGHTENING.  I HAVE NOT YET SCHEDULED TO TAKE THEM IN FOR A SERVICE CHECK. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2010 TOYOTA SIENNA PURCHASED BACK IN SEPT. 2009. POWER LIFTGATE CLOSES ITSELF EVERYTIME WHEN OPEN USING THE KEYFOB OR THE BUTTON INSIDE THE CABIN. THIS WAS HAPPENING LIKE COUPLE OF MONTHS AFTER I GOT THE CAR. THERE WERE SEVERAL INCIDENTS THAT ME AND FAMILY MEMBERS WERE HIT OUR HEADS AND SHOULDERS BY SELF CLOSING LIFTGATE WHEN DIDN'T KNOW WHAT THE CAUSE WAS. AFTER RESEARCHING ABOUT THIS PROBLEM, TOYOTA HAD RECALLED SIENNA IN THE PAST ABOUT THIS SAME PROBLEM FOR OLDER MODELS FOR FAULTY STRUT USED FOR POWER LIFTGATES. I HAD NOT TAKEN THE CAR TO THE DEALER YET BECAUSE OF TIME. I USE THE LIFTGATE IN MANUAL MODE TO PREVENT THE PROBLEM FOR POSSIBLE INJURY UNTIL I FIX THE PROBLEM. I WILL BE TAKING THE CAR TO THE DEALER SOON. *TR",
        "vin": "5TDYK4CC4AS"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/02/2010",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 TOYOTA SIENNA REAR LIFTGATE AUTOMATICALLY CLOSES ON OCCASION WITHOUT PUSHING THE KEY FOB OR THE INTERIOR BUTTON.  IT HAS OCCURRED 5 TIMES IN THE LAST 2 WEEKS.  NO ONE HAS BEEN HIT BY THE DOOR YET BECAUSE WE ARE AWARE OF IT HAPPENING.  I WILL BE CONTACTING THE DEALER TOMORROW.  NO OTHER ACTION HAS BEEN TAKEN. *TR",
        "vin": "5TDYK4CC0AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/29/2010",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10303156,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2010 TOYOTA SIENNA XLE. THE PROBLEM IS WITH THE AUTOMATIC DOORS AND KEY FOB AND BACK HATCH DOOR. THE KEY WILL UNLOCK AND IMMEDIATELY RELOCK ALL THE DOORS. IF YOU TOUCH THE BUTTONS TO ACTIVATE SLIDING DOORS THEY WORK OFF AND ON. THE BIG PROBLEM THOUGH IS THE BACK DOOR - THE TRUNK. IT OPENS AND THEN AS YOU ARE GOING INTO THE TRUNK YOU DON'T KNOW IT IS CLOSING ON YOU. THIS HAS NOW HAPPENED AT LEAST 12 TIMES. I AM CONCERNED IF MY CHILD IS IN TRUNK GETTING BAGS. IT SEEMS SOME \"EYE\" MUST SEE AND THE DOOR STARTS RISING AGAIN. BUT I HAVE BEEN HIT IN THE BACK AND HEAD A FEW TIMES. MY CONCERN IS WHAT IF THE SENSOR DOES NOT ACTIVATE AND YOU ARE STUCK IN THE DOOR/BUMPER AREA? I AM TAKING CAR TO DEALERSHIP BUT THEY CLAIM TO HAVE NEVER HEARD OF A PROBLEM LIKE THIS. *TR",
        "vin": "5TDYK4CCXAS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2010",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299890,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 TOYOTA SIENNA. THE CONTACT STATED THE REAR ELECTRONIC DOOR INTERMITTENTLY FAILED TO REMAIN OPEN. THE DEALER STATED THAT THE STRUT NEEDED TO BE REPLACED SINCE THEY BECAME FAULTY. THE DEALER ALSO ADVISED HER THAT THE PARTS WERE ON NATIONAL BACK ORDER. THE FAILURE MILEAGE WAS 4,000.    UPDATED 02/1710 *BF  UPDATED 02/19/10",
        "vin": "5TDDK4CC5AS"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/01/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297727,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SPEED CONTROL , IT DOESN'T GO UP SMOOTHLY FROM 0 KLM  TO 55 KLM WHEN GOING INTO HIGHWAY. *TR",
        "vin": "5TDKK4CC4AS"
    }
]