[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/25/2013",
        "dateOfIncident": "03/20/2013",
        "fire": false,
        "manufacturer": "Triumph Motorcycles America, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513508,
        "products": [
            {
                "manufacturer": "Triumph Motorcycles America, Ltd.",
                "productMake": "TRIUMPH",
                "productModel": "THUNDERBIRD ABS A1",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING ON THE FREEWAY THE THROTTLE WENT \"LIMP\" IN MY HAND AND I LOST ALL SPEED.  I HAD TO PERFORM EMERGENCY MANEUVERS TO EXIT THE FREEWAY WITH NO THROTTLE RESPONSE.  HAD TO HAVE THE BIKE TOWED TO THE TRIUMPH DEALER TO REPLACE THE HEATED GRIP (WHICH THE PLASTIC BROKE INTERNALLY).  THIS WAS DONE PER WARRANTY AND TOOK ABOUT A WEEK.  I HAD TO PURCHASE A STOCK GRIP TO USE WHILE THE PART WAS ON BACK ORDER.      WAS RIDING IN-TOWN AND HAD THE SAME ISSUE HAPPEN AGAIN WITH THE REPLACED TRIUMPH GRIP.  I MANAGED TO USE BAILING WIRE AND ZIP TIES TO GET THE BIKE HOME AND TOOK THE BROKEN GRIP OFF TO BE REPLACED BY THE DEALER A 2ND TIME.  THE TRIUMPH BLOG HAS REPORTED MORE THAN A DOZEN OF THESE SAME INCIDENTS HAPPENING WITH THE AFTERMARKET TRIUMPH HEATED GRIPS BUT THE PART HAS NOT BEEN FIXED AND THIS PROBLEM CONTINUES TO PERSIST.  I'M LUCKY THAT I WAS NOT-INJURED AND THERE WASN'T A CRAZY AMOUNT OF TRAFFIC AROUND ME WHEN THIS HAPPENED.    WILL TRIUMPH TAKE NOTICE OF THIS ISSUE?  IT FRIGHTENS ME TO RIDE KNOWING THAT THE THROTTLE MAY GIVE OUT AGAIN WITHOUT NOTICE. *TR",
        "vin": "SMTB01WF8AJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2013",
        "dateOfIncident": "12/24/2012",
        "fire": false,
        "manufacturer": "Triumph Motorcycles America, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503986,
        "products": [
            {
                "manufacturer": "Triumph Motorcycles America, Ltd.",
                "productMake": "TRIUMPH",
                "productModel": "THUNDERBIRD ABS A1",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 TRIUMPH THUNDERBIRD MOTORCYCLE, PURCHASED NEW IN SEPTEMBER, 2012, INCLUDES DEALER-INSTALLED (11/12) TRIUMPH HEATED HANDGRIPS. ON CHRISTMAS EVE, AT A STOPLIGHT, 10 MILES FROM HOME AND IN HEAVY TRAFFIC, THE THROTTLE FAILED--THE CABLE HAD BUSTED OUT OF THE RETAINER SLEEVE. THIS IS AN OCCURRENCE THAT HAS BEEN DISCUSSED IN MANY RIDER FORUMS, SEEMS TO BE CLOSELY CORRELATED TO THE HEATED GRIPS, AND HAS BEEN RECEIVED WITH MINIMAL RESPONSIVENESS/ACKNOWLEDGEMENT FROM THE MANUFACTURER. HAD I BEEN RIDING IN THE CENTER LANE OF INTERSTATE 95, WHERE I HAD BEEN TRAVELING JUST MINUTES EARLIER, I MIGHT EASILY HAVE BEEN KILLED. AGAIN, THIS IS A FAILURE THAT HAS BEEN AMPLY DOCUMENTED IN RIDER FORUMS AND HAS BEEN MET WITH NON-ACKNOWLEDGEMENT FROM THE MANUFACTURER. PLEASE HELP US!  *TR",
        "vin": "SMTB01WF8AJ"
    }
]