[
    {
        "components": "FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174727,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN PASSAT WAGON. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V509000 (FUEL SYSTEM, GASOLINE) AND 18V148000 (AIR BAGS). THE VEHICLE WAS TOWED TO SCHUMACHER AUTOMOTIVE GROUP (561-935-4690, LOCATED AT 3001 OKEECHOBEE BLVD, SUITE C, WEST PALM BEACH, FL 33409) WHERE THE RECALL REPAIRS WERE PERFORMED. THE FOLLOWING DAY, THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE FUEL PUMP NEEDED TO BE REPLACED AT THE CONTACT'S EXPENSE. THE DEALER STATED THAT THE RECENT FUEL PUMP FAILURE WAS NOT RELATED TO THE RECALL. THE MANUFACTURER STATED THAT THE FUEL PUMP WAS NOT COVERED BY THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 34,000.",
        "vin": "WVWXK7AN6AE"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173682,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER RECALL 20AE  NHTSA RECALL 17V509",
        "vin": "WVWXK7AN6AE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151418,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VOLKSWAGEN PASSAT WAGON. 88K MILES. CHECK ENGINE CAME ON AS I WAS DRIVING IT IN THE CITY. WITHIN ONE HOUR OF CHECK ENGINE LIGHT APPEARING I STOPPED THE CAR. WHEN I TRIED TO RESTART 30 MINUTES LATER IT REFUSED TO START. PROMPTLY HAD IT TOWED TO DEALER.    VW DEALERSHIP MECHANIC SAYS: TIMING IN THE ENGINE SLIPPED DUE TO SLACK IN TIMING CHAIN. COMPRESSION MEASURED LOW TO NONE. INCORRECT TIMING HAS CAUSED DAMAGE TO VALVES AND CAMSHAFT. VEHICLE WILL NEED A CYLINDER HEAD, CAMSHAFT, TIMING CHAIN & TENSIONER TO START. THEY SAY THIS PORTION WILL COST ME $5,700 PLUS TAX.  ALSO A POSSIBILITY IT WILL NEED AN ENGINE BLOCK IF THE CYLINDER WALL IS DAMAGED IN ADDITION.  IN MY RESEARCH I'VE FOUND MANY VW OWNERS COMPLAINING OF THE SAME PROBLEM.  IT IS OBVIOUSLY A MAJOR REOCCURRING PROBLEM THAT VW IS AWARE OF. I CANNOT AFFORD TO FIX THIS CAR.",
        "vin": "WVWXK7AN9AE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144113,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECENTLY PURCHASED THIS VEHICE. I BRING IN TO THE KING VW TO HAVE IT DONE. BUT IT HAS NOT BEEN CLEARED BY NHTSA OR VOLKSWAGEN OF AMERICA. I HAVE NOT RECEIVED ANY PAPERWORK ABOUT THIS. I KNOW THIS FROM CARFAX. THERE WAS NO COLLISION, FIRE OR SUCH, SPEED WAS 0 MPH",
        "vin": "WVWXK7ANXAE"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097100,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS AN INTERRUPTION IN ELECTRICAL POWER FROM THE FUEL PUMP CONTROL MODULE. THIS RESULTED IN THE FUEL PUMP RUNNING CONTINUOUSLY, RESULTING IN A DRAINED BATTERY AND NO START CONDITION, OR CAUSE A LOSS OF MOTIVE POWER WHILE THE VEHICLE WAS IDLE AT TRAFFIC LIGHTS. TOOK THE CAR TO VW GARAGE WHO WERE AWARE OF THE PROBLEM SAID THERE WOULD BE A SAFETY RECALL SOON, BUT I SHOULD PAY FOR REPAIR AND CLAIM MONEY BACK ONCE RECALL WAS ACTIVE, WAS TOLD THIS WOULD BE EARLY PART OF 2018. STILL NO RECALL AND OVER $400 OUT OF POCKET. CAR STALLED AND CUT OUT AT TRAFFIC LIGHTS DUE TO THIS FAULT, VW WERE VERY AWARE OF PROBLEM BUT AS YET NO RECALL MADE, DESPITE VW ASSURING ME THERE WOULD BE ONE.",
        "vin": "WVWXM7AN3AE"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083491,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS INVOLVED IN THE AIRBAG RECALL.  AFTER IT WAS REPAIRED, THE CLOCKSPRING FAILED AND THE \"AIRBAG ERROR\" LIGHT CAME ON.  THIS VEHICLE ISN'T PART OF THE EARLIER CLOCKSPRING RECALL, BUT IT SHOULD BE.",
        "vin": "WVWXM7ANXAE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046156,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PCV VALVE FAILED, AT SOME POINT PRIOR TO JAN 11, 2016 AND 77,748 MILES.  NO WARNING LIGHTS OR OTHER INDICATION OF THE FAILURE EVER OCCURRED UNTIL THE PCV VALVE FAILURE CASCADED INTO FAILURE OF THE ENGINE REAR MAIN SEAL (BETWEEN THE ENGINE AND TRANSMISSION), RESULTING IN A MASSIVE OIL LEAK.  BASED ON A WEB SEARCH, THIS IS AN EXTREMELY COMMON SITUATION, NOT ONLY FOR THE VALVE FAILURE, BUT THE METHOD IN WHICH IT FIRST BECOMES APPARENT TO THE VEHICLE OWNER (REAR MAIN SEAL FAILURE).  COST TO REPAIR WAS OVER $1900.  PCV VALVE FAILED AGAIN AT SOME POINT PRIOR TO OCT 24, 2017  AND 116,102 MILES.  SIMILAR TO THE FIRST EVENT, NO INDICATION OF THE FAILURE OCCURRED UNTIL THIS CASCADED INTO AN UPPER TIMING COVER SEAL FAILURE.  COST TO REPAIR WAS OVER $600.    MY RESEARCH CLEARLY INDICATES VW PCV VALVES ARE KNOWN TO BE TROUBLE-PRONE.  VW EXTENDED THE WARRANTY ON PCV VALVES TO 10 YEARS/120,000 MILES ON CERTAIN VW MODELS (INCLUDING PASSATS) UP THROUGH 2008 MODEL YEAR.  MY EXPERIENCE, AND THE EXPERIENCE OF OTHER OWNERS, CERTAINLY SUGGESTS 2009 AND 2010 VW PASSATS STILL HAVE THIS PROBLEM, AND ONE HAS TO WONDER WHY THESE MODEL YEARS ARE EXCLUDED FROM THE EXTENDED WARRANTY, ESPECIALLY CONSIDERING THE OUTRAGEOUS COSTS THAT OWNERS ARE LEFT TO DEAL WITH.",
        "vin": "WVWXK7AN0AE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "10/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046157,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCK DEVICE FAILED.  INSTRUMENT PANEL MESSAGE CENTER BEGAN DISPLAYING \"STEERING COLUMN LOCK DEFECTIVE\", WITH ILLUMINATION OF A WARNING LAMP, AND WOULD IMMEDIATELY SHUT DOWN ENGINE UPON INITIAL START-UP (OR ON OCCASION, WOULD NOT ALLOW VEHICLE TO EVEN BE STARTED).  VEHICLE WAS STATIONARY AT ALL TIMES.  ON A SECOND OR THIRD TRY, SOMETIMES WITH A SMALL TWIST OF THE STEERING WHEEL, THE VEHICLE WOULD START AS NORMAL AND WAS DRIVEABLE.    VW RECALLED VEHICLES FOR THIS DEFECT, BUT IT APPEARS THE RECALL EXPIRED FEB 2013.  THIS CONTINUES TO BE A COMMON PROBLEM AND I'M PUZZLED HOW OR WHY THIS RECALL WAS ALLOWED TO EXPIRE.  COST TO REPAIR WAS OVER $600.",
        "vin": "WVWXK7AN0AE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT WAGON",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN BROKE AT 69,000 MILES. OIL CHANGES WERE KEPT UP WITH CONSISTENTLY WITH CAR. ENGINE NOW HAS TO BE REPLACED IN ORDER FOR CAR TO DRIVE. VEHICLE WAS STATIONARY WHEN IT STOPPED WORKING.",
        "vin": "WVWXL7AN7AE"
    }
]