[
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "08/16/2013",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541967,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "NESS VISION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A RIDE IN THE MOUNTAINS, I STARTED TO HEAR A LOUD NOISE FROM THE FRONT END OF MY MOTORCYCLE. I PULLED OFF THE ROAD TO CHECK AND FOUND THAT THE REAR PORTION OF MY FRONT FENDER HAD BROKEN AWAY FROM ITS FORK MOUNTS AND WAS RUBBING AGAINST THE WHEEL. WITHOUT THE FORK MOUNTS, THE FENDER IS LOOSE ENOUGH TO BOUNCE UP INTO THE MOTORCYCLE FAIRING AND EFFECT THE STEERING. I BELIEVE THE SOUND I WAS HEARING WAS THE FENDER HITTING THE FAIRING WHENEVER I TURNED.  SINCE THE FENDER PORTION WAS NOW ONLY BEING HELD ON BY TWO 'PUSH FASTENERS' TO THE FRONT PORTION OF THE FENDER, I IMMEDIATELY REMOVED THAT PORTION FOR THE REMAINDER OF THE RIDE. I WAS VERY FORTUNATE THAT THE FENDER DID NOT CATCH ON THE FAIRING AND LOCK UP MY STEERING.  THIS IS THE SECOND TIME I HAVE HAD THE FENDER BRAKE IN THE SAME SPOT. THE FIRST WAS ABOUT TWO YEARS AGO, BUT I CAUGHT IT WHEN IT WAS ONLY CRACKED AND HAD NOT DISLODGED FROM THE MOUNTING BRACKETS.",
        "vin": "5VPSC36LXA3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/26/2013",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500640,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "NESS VISION",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SEVERE PROBLEM WITH THE REAR BRAKES ON ALL VICTORY VISION MOTORCYCLES FROM MODEL YEAR 2008 TO 2010 THAT ARE NOT EQUIPPED WITH ABS. AIR SOMEHOW GETS INTO THE SYSTEM CAUSING THE REAR BRAKES TO BECOME COMPLETELY INEFFECTIVE WITH ABSOLUTELY NO WARNING. THERE HAVE BE NUMEROUS COMPLAINTS FROM MANY PEOPLE ABOUT THIS ISSUE AND VICTORY'S STANCE REMAINS THAT SIMPLY BLEEDING THE BRAKES IS THE SOLUTION TO THE PROBLEM. THIS IS NOTHING MORE THAN A TEMPORARY SOLUTION AND DOES NOT FIX THE DESIGN FLAW. SOONER OR LATER THIS PROBLEM IS GOING TO GET PEOPLE KILLED.    VICTORY APPARENTLY SOLVED THIS PROBLEM WHEN THEY SWITCHED TO THE NEWER ABS SYSTEM THAT WAS AN OPTION ON 2010 VISION MODELS AND STANDARD ON 2011 AND NEWER MODELS. IT SEEMS THAT IN THEIR MIND, THE PROBLEM IS SOLVED BUT THEY ARE TRYING TO SWEEP THE PROBLEM WITH THE OLDER NON ABS MODELS UNDER THE RUG. THIS IS UNACCEPTABLE. I CAN'T THINK OF A WORSE SAFETY ISSUE THAN FREQUENTLY LOSING BRAKES WITH NO WARNING ON THE HIGHWAY. VICTORY NEEDS TO STEP UP THE PLATE AND RECALL THESE AFFECTED MOTORCYCLES.  *TR",
        "vin": ""
    }
]