[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "12/13/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444816,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The windshield is loose at the top and can leak. The windshield may move under normal driving conditions.",
        "vin": "YV1672MK5A2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058139,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2010 VOLVO C30. IN LATE NOVEMBER 2017 I WAS IN A MINOR ACCIDENT ON THE FREEWAY. SOMETHING CAME OFF A BIG RIG IN FRONT OF ME AND HIT THE WINDSHIELD AS WELL AS ME RUNNING OVER SOMETHING. I ASSUME THE TRUCK BLEW A TIRE, AS THE TRUCK STARTED SPARKING UNDERNEATH. THE NOISE WAS SO LOUD, I THOUGHT THE WINDSHIELD HAD BROKEN. WHEN I PULLED OVER, I DIDN'T SEE ANY REAL DAMAGE BUT A SMALL PIECE OF MOLDING WAS LOOSE NEAR MY FRONT TIRE. OVER THE NEXT SEVERAL DAYS I WOULD HEAR A LOUD JARRING NOISE WHENEVER I HIT A BUMP A CERTAIN WAY. ALSO, WHEN THE PASSENGER DOOR WAS SLAMMED SHUT. IT SOUNDED LIKE MY CAR WAS FALLING APART. IT CONTINUED TO GET MORE FREQUENT, BUT I COULDN'T TELL WHERE IT WAS COMING FROM UNTIL WE STARTED GETTING FREEZING TEMPERATURES IN THE MORNING AND I COULD ACTUALLY SEE THE WINDSHIELD RATTLE OVER EVERY BUMP. WHEN I PLACED MY HAND ON THE UPPER DRIVER SIDE OF THE WINDSHIELD, I COULD ACTUALLY PUSH IT FAR ENOUGH TO CREATE A GAP BETWEEN IT AND THE CAR. TODAY I HAD THE WINDSHIELD REPLACED. THE WINDSHIELD TECH SHOWED ME THAT THERE WAS NO PRIMER ON THE GLASS ACROSS THE TOP AND IN LARGE AREAS DOWN BOTH SIDES OF THE GLASS. THIS IS THE ORIGINAL FACTORY INSTALLED WINDSHIELD. ALTHOUGH I HAD NEVER HAD ANY ISSUES WITH LEAKAGE, IT WAS PROBABLY THAT WAY FOR A LONG TIME AND THE ACCIDENT JARRED IT LOOSE. I SHUTTER TO THINK WHAT WOULD HAVE HAPPENED IF THE ACCIDENT HAD BEEN MORE MAJOR. IF THE AIRBAGS WOULD HAVE DEPLOYED, I IMAGINE THEY WOULD HAVE PUSHED THE GLASS RIGHT OUT. AFTER DOING A LITTLE RESEARCH ONLINE, I SEE MANY REPORTS OF THIS WINDSHIELD SEAL FAILURE ACROSS SEVERAL YEARS AND MODELS OF VOLVOS. I AM SHOCKED VOLVO HAS NOT ISSUED A RECALL.",
        "vin": "YV1672MK9A2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845823,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WAS LIFTING AS I DROVE HIGHWAY SPEEDS OR ON A WINDY DAY, AS WELL AS LEAKED WATER DURING HEAVY RAIN. TOOK IT TO AN AUTO GLASS SHOP (LIKE MY VOLVO DEALERSHIP SUGGESTED DUE TO A DIAGNOSTIC FEE OF OVER $100.00 FOR VOLVO SERVICE TO TOUCH THE CAR), WHERE THEY TOLD ME IT WAS A HUGE PROBLEM AND THAT IT SEEMED TO BE A PROBLEM WITH THE MANUFACTURING OF THE CAR. THEY SAID THERE IS NO WAY A PERSON COULD HAVE CAUSED THE WINDSHIELD TO BE COMPLETELY LOOSE ENOUGH TO POP OUT LIKE MINE IS, AND THAT IT LOOKS LIKE THE MANUFACTURER DIDN'T BOND THE WINDSHIELD PROPERLY TO THE CAR.",
        "vin": "YV1672MK8A2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/07/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780768,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN A SINGLE VEHICLE MISHAP WHERE SHE JUMPED A CURB AT APPROXIMATELY 15 TO 20 MPH, BLEW OUT THREE TIRES, AND DAMAGED THE RIGHT PASSENGER FRONT BUMPER AS WELL AS THE RIGHT AND LEFT FRONT QUARTER PANELS.  THE RIGHT FRONT TIRE IS BENT INWARD AND THE LEFT FRONT IS BENT OUTWARD.  THROUGH ALL OF THIS, THE DRIVER'S SIDE AIRBAG NEVER DEPLOYED.  I HAD TO GUESSTIMATE THE MILEAGE BELOW AT 53K AS I DON'T HAVE IT WITH ME WHERE I AM FILING THIS REPORT.",
        "vin": "YV1672MK5A2"
    },
    {
        "components": "WHEELS,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651420,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C30",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO C30. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH ON WET PAVEMENT, THE REAR TIRES LOST TRACTION WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE CAMBER ANGLE WAS TOO POSITIVE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 16,000.",
        "vin": "YV1672MKXA2"
    }
]