[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254546,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY NEWLY PURCHASED, USED V50 WAGON TO MY VOLVO DEALER. THE SERVICE TECH DEMONSTRATED THAT THE WINDSHIELD HAS BECOME UNSEALED FROM FRAME. IT WAS/IS LOOSE, AND CAN BE PARTIALLY PUSHED OUT. THEY HAD FOUND WET CARPET IN MY CAR. IT IS STILL LEAKING (THE CAR HAD NOT BEEN IN AN ACCIDENT). THIS WAS NOT COVERED BY VOLVO, NOR WAS IT COVERED BY THE EXTENDED WARRANTY I HAD PURCHASED WHEN I GOT THE LOAN. TURNS OUT THIS IS A KNOWN ISSUE THAT VOLVO SHOULD FIX AT NO COST TO ME.",
        "vin": "YV1390MWXA2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2010",
        "dateOfIncident": "04/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326869,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2010 VOLVO,V-50 , WE JUST BOUGHT MY WIFE DOES NOT HAVE ANY TROUBLE SWITCHING HER RIGHT FOOT FROM ACCELERATOR TO THE BRAKE PEDAL, AND BACK AGAIN,BUT IT SEEMS NO MATTER WHICH SHOES I'M WEARING ,I WEAR SIZE 12 D,MY FOOT HAS A TENDENCY TO CATCH BETWEEN THE PEDALS. I BROUGHT THIS TO THE ATTENTION OF THE VOLVO STORE OF WINTER PARK,TODAY APRIL 21,BOTH SALES AND SERVICE MANAGERS,THEY SAID THAT THEY CANT CHANGE THE DISTANCE BETWEEN THE PEDALS BECAUSE OF SAFETY. THEY SUGGESTED DRIVING WITH SOCKS INSTEAD OF SHOES OR USING RIGHT FOOT FOR ACCELERATOR,AND LEFT FOOT FOR BRAKE. I HAVE BEEN TAUGHT IN MANY SAFE DRIVING COURSES INCLUDING THE LAST 55 ALIVE BY AARP,TO AVOID THIS DANGEROUS PRACTICE I WAS WONDERING WHAT NHTSA 'S POSITION WAS ON THIS.   WE TRADED IN A 2000 VOLVO S 70 GLTSE THAT DID NOT HAVE THIS CONDITION.          THANK YOU FOR YOUR CONSIDERATION.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "YV1382MW6A2"
    }
]