[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458491,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The exhaust for the car is routed within inches of the subframe which does not have a heat shield. The paint has since deteriorated and large rust holes have formed.",
        "vin": "Yv1852ar0a1"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453263,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The stock oem windshield has come away from the body. This a common on-going issue with p3 volvos. My car leaks water into the cabin. It is dangerous not having a windshield glued down to the body.",
        "vin": "YV1852AR9A1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447027,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a leak or gap at the top of the windshield allowing water to get into the car.  Most notable when there is a heavy rain and the car sits overnight.  Then what happens is that the water that gets in either fills up in the interior dome light areas or splashes out onto the gear shifter creating puddles.  This can be distracting while driving as water will splash on one's face from the water that is pooled in the dome light areas.  Also there is a fear that this can cause further electrical damage,  Some of the lights on the gear shifter are already not working as a result.  This moisture has also begun to deteriorate areas of the instrument panel as well.",
        "vin": "yv1992ah6a1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437898,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The sub frame located near the front exhaust has premature rust and corrosion to the point there are holes in the frame.",
        "vin": "YV1852AR6A1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307638,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO S80. THE CONTACT STATED THAT THE FRONT WINDSHIELD BONDING DETACHED CAUSING SEPARATION OF THE WINDSHIELDS AND WATER LEAKING INTO THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 124,000.",
        "vin": "YV1960ASXA1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279861,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WINSHEILD LEAKS INSIDE WHEN IT RAINS ACROSS PASSENGER AND DRIVERS SIDE",
        "vin": "YV1982AS1A1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/23/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270411,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS JUST PURCHASED AT 127K MILES. THE CARFAX SHOWS 0 ACCIDENTS YET THE BALL BEARINGS IS NOW IN ITS 2ND REPLACEMENT.  WHEN I TEST DROVE IT MCGRATH VOLVO STATED THAT THERE HAD BEEN A SAFETY CHECK, BUT THE NOISE WAS NOTICABLE BUT THE SALESMAN PULLED IT OFF AS WEAR AND TEAR.  2 DAYS INTO OWNERSHIP SUSPENSION, BEARINGS (FRONT) NEED REPLACEMENT FOR SAFETY.",
        "vin": "YV1992AR9A1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034378,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO S80. WHILE THE VEHICLE WAS BEING SERVICED, THE INDEPENDENT MECHANIC NOTICED A FUEL ODOR DUE TO A LEAKING FUEL LINE. THE VEHICLE WAS REPAIRED. THE FUEL LINES WERE REPLACED AND THE FAILURE WAS REMEDIED. THE LOCAL DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 119,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/28/2015",
        "dateOfIncident": "03/28/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702380,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TPS TIRE PRESSURE SENSOR COMPLETE FAILURE, TOTAL LOSS OF AIR PRESSURE IN RIGHT FRONT TIRE. UNIT FELL INTO THE TIRE, NORTHERN STATES SALT CORROSION. CONTINENTAL PART #PA66 GF30 OEM  PART FOR FORD MOTOR COMPANY.  *TR",
        "vin": "YV1982AS4A1"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2015",
        "dateOfIncident": "02/09/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694336,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I HAVE BEEN DEALING WITH ORANGE LOW LEVEL OIL LIGHT COMING ON BETWEEN OIL CHANGES, IN MY 2010 VOLVO S80, FOR A COUPLE OF YEARS NOW.  ON OCCASION, THE RED LIGHT HAS APPEARED AS WELL IF I DON'T ADD OIL FOR MY WIFE. THERE IS OBVIOUSLY AN OIL CONSUMPTION ISSUE THAT NEITHER MY DEALER NOR CORPORATE HAVE BEEN HELPFUL WITH RESOLVING. I HAVE HAD THE  \"OIL CONSUMPTION TEST\", BUT FRANKLY I AM TIRED OF THE RUN AROUND BECAUSE I LIVE TOO FAR TO KEEP HAVING TO PROVE THAT THERE IS A PROBLEM AND BEING TOLD BY THE SERVICE PERSON THAT IT IS WITHIN SPEC. THIS IS A QUART OF OIL EVERY 1,000 MILES. THE TIP ON MY EXHAUST CLEARLY GIVES AN INDICATION OF THE BURNING OF OIL. WHAT CAN I DO TO GET THEM TO FIX THIS. I HAVE EVEN FOUND A TECHNICAL JOURNAL REF NO. 24643 (OIL CONSUMPTION) THAT SPEAKS ON MY EXACT PROBLEM.   *TR",
        "vin": "YV1992AHXA1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680411,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO BRAKE VACUUM PUMP IS LEAKING OIL ON THE 3.2 LITER MOTORS. VOLVO HAS FINALLY RECOGNIZED THE ISSUE WITH THIS LEAK AND HAS COME UP WITH A VOLVO BRAKE VACUUM PUMP REPAIR KIT (VOLVO 31401556 REPAIR KIT). ALONG WITH THE KNOW EXCESSIVE OIL CONSUMPTION OF THE 3.2 LITER MOTOR THIS COULD CAUSE LOSS OF BRAKE POWER.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/03/2013",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514811,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SRS (SUPPLEMENTAL RESTRAINT SYSTEM) AIRBAG FAILURE URGENT\" MESSAGE CAME ON. I TOOK VEHICLE TO THE DEALERSHIP FOR REPAIR. THE DIAGNOSIS WAS A FAULTY (R) FRONT PASSENGER SEAT BELT ASSEMBLY, WHICH WAS REPLACED. SEVERAL DAYS LATER THE FAULT MESSAGE RETURNED. DEALERSHIP CHECKED CODES AND INDICATED IT WAS THE SAME EXACT PART. I HAD THE PREVIOUS OWNER'S SERVICE HISTORY FOR THE CAR AND DISCOVERED THIS PROBLEM HAD OCCURRED 6 MONTHS PRIOR TO ME PURCHASING THE VEHICLE AND ANOTHER DEALERSHIP HAD ALREADY REPLACED THE SAME SEATBELT ASSEMBLY. SO INSTEAD, THE CURRENT DEALERSHIP REPLACED THE CONTROL MODULE FOR THE ENTIRE SRS SYSTEM. TWO DAYS LATER THE FAULT MESSAGE RETURNED AGAIN. THE CAR IS BACK AT THE DEALERSHIP FOR THE THIRD TIME NOW AND HAS BEEN THERE FOR A TOTAL OF ABOUT A MONTH. THEY ARE NOT SURE EXACTLY WHAT THE PROBLEM IS, BUT SUSPECT THE WIRING HARNESS UNDER THE FRONT PASSENGER FLOOR AREA. I HAVE RESEARCHED THIS ISSUE QUITE A BIT AND HAVE DISCOVERED A RECALL INVOLVING THE CONNECTION FOR THE CLOCK SPRING IN THE STEERING WHEEL FOR MY 2010, BUT MORE TELLING IS A RECALL AFFECTING 17,000 VEHICLES ENCOMPASSING MANY MODELS MY 2012 FOR A WIRING PROBLEM WHERE THE SEAT HARNESS MAY BECOME DISCONNECTED WHEN MOVING THE SEAT. PERHAPS EVEN THOUGH MY VEHICLE IS A 2010 IT STILL COULD BE THE SAME PROBLEM SINCE NOT MUCH HAS CHANGED BETWEEN THESE MODEL YEARS. I HAVE ALSO LEARNED THAT THE SRS SYSTEM DISABLES THE AIRBAGS WHEN THIS FAULT OCCURS SO THIS REPRESENTS A MAJOR SAFETY RISK TO ME AND MY FAMILY.  *TR",
        "vin": "YV1982ASXA1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/12/2012",
        "dateOfIncident": "07/09/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10465354,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 VOLVO S80. THE CONTACT STATED THAT WHILE DIRVING 30 MPH, SHE ATTEMPTED TO AVOID A DEER AND LOST CONTROL OF THE VEHICLE. THE VEHICLE WAS INVOLVED IN A CRASH WITH THREE ELECTRICAL POLES AS A RESULT. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS DEEMED DESTROYED. THE CONTACT AND A PASSENGER SUFFERED CONCUSSIONS FROM THE CRASH. THE CONTACT THEN NOTICED THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 10V489000 (AIR BAGS: FRONTAL), BUT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT AN ENGINEER WILL EXAMINE THE VEHICLE. THE FAILURE AND CURRENT MILEAGES WERE 13,700.",
        "vin": "YV1992AH7A1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "11/23/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438599,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON CITY STREET AT ABOUT 30-35 MPH.  AS I APPROACHED INTERSECTION I TOOK FOOT OFF ACCELERATOR PEDAL AND STEPPED ON BRAKE PEDAL TO SLOW DOWN AND STOP AT INTERSECTION.  AS I STEPPED ON BRAKE PEDAL, I COULD HEAR ENGINE START ACCELERATING AND CAR WOULDN'T STOP.  I NOTICED TACH READING BETWEEN 4 AND 5.  ALTHOUGH ENGINE WAS ACCELERATING AND VEHICLE WAS MOVING FORWARD IT WAS NOT MOVING AT EXCESSIVE SPEED.  I PRESSED HARDER ON BRAKE PEDAL AND WHILE CAR SLOWED SOMEWHAT IT WOULD NOT STOP.  SO I DECIDED THAT THE ONLY WAY TO STOP VEHICLE WAS TO MOVE GEAR SHIFT LEVER TO PARK AND THEN TURN OFF ENGINE.  I THEN RESTARTED CAR AND IT FUNCTIONED NORMALLY.  MY EXPERIENCE MIGHT BE AN EXAMPLE OF WHAT HAS BEEN CALLED \"SUDDEN, UNINTENDED ACCELERATION\".  *TR",
        "vin": "YV1992AR9A1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "12/17/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374983,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FROM VOLVO OF NA REGARDING MY 2010 S-80.  VOLVO SAID THEY WERE EXTENDING THE WARRANTY COVERAGE FOR THE STEERING GEAR TO 7 YEARS FROM 5 YEARS BECAUSE \"THERE IS A POTENTIAL FOR INSUFFICIENT SEALING IN THE STEERING GEAR.  THIS CAN LEAD TO WATER OR MOISTURE INTRUSION, RESULTING IN INTERNAL CORROSION AND OIL SEEPAGE.   THIS CONDITION CAN RESULT IN A LONG TERM GRADUAL INCREASE IN STEERING EFFORT AND NOISE.\"  VOLVO DID NOT ISSUE A RECALL TO FIX THIS PROBLEM SINCE THEY DETERMINED IT WAS NOT A SAFETY ISSUE.  I WOULD LIKE THE NHTSA TO INVESTIGATE THIS ISSUE AND DETERMINE IF A RECALL IS NECESSARY AS A SAFETY ISSUE--IT WOULD SEEM TO ME THAT ANYTHING AFFECTING THE ABILITY TO STEER THE CAR WOULD BE A SAFETY ISSUE.  THE LETTER FROM VOLVO WAS DATED DEC 17, 2010.  *TR",
        "vin": "YV1982AS7A1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "12/27/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373133,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO S80. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, BOTH FRONT AND REAR PASSENGER SIDE TIRES EXPLODED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE FRONT AND REAR PASSENGER SIDE RIMS WERE BENT AND CAUSING THE TIRES TO BLOW. THE CONTACT STATED HE HAD EXPERIENCED THE FAILURE SIX TIMES. THE VEHICLE WAS NOT REPAIRED. THE CONTACT BELIEVED THE VEHICLE TO BE UNSAFE TO DRIVE AND COULD POTENTIALLY CAUSE A CRASH. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "YV1992AH1A1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/21/2010",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371951,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 VOLVO S80. THE CONTACT STATED THAT WHILE STOPPING AT AN INTERSECTION AND TRYING TO ACCELERATE, THE VEHICLE SUDDENLY STALLED AND WOULD NOT MOVE. ONCE THE VEHICLE WAS STARTED, IT SUDDENLY STALLED AGAIN HALFWAY THROUGH THE  INTERSECTION; THE ENGINE REVVED BUT THE VEHICLE WOULD NOT MOVE. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 2,200.",
        "vin": "YV1960AS0A1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "05/08/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330010,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WANTED TO PURCHASE A NEW 2010 VOLVO.  THE AIRBAG LIGHT WAS ON, DEALERSHIP COULD NOT CLEAR THE CODE.  WAS TOLD BY A TECHNICIAN THAT THERE WAS A LOOSE CONNECTER AND THERE IS NO FIX AT THIS TIME, VOLVO OF AMERICA WANTED THE DEALERSHIP TO WRAP TAPE AROUND THE CONNECTOR AND JAM IT IN PLACE TO GET RID OF THE AIRBAG LIGHT.  I DID NOT PURCHASE FOR OBVIOUS SAFETY REASONS.  WHAT HAPPENS IF THIS \"FIX\" FAILS RIGHT BEFORE A CRASH, AND THE AIRBAG SYSTEM DOES NOT WORK AS DESIGNED?  APPARENTLY ALL 2010 S80, XC70, AND XC60 VEHICLES CAN BE AFFECTED.  THE OTHER THING THAT CONCERNS ME IS VOLVO OF AMERICA DOES NOT WANT THIS REPAIR IN WRITING - LOOKS LIKE THEY HAVE SOMETHING TO HIDE.  IS THIS HOW THE TOYOTA UNINTENDED ACCELERATION PROBLEM WAS FIRST HANDLED? *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "02/18/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316319,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VOLVO S80 TOTAL SYSTEMS FAILURE ON THE HIGHWAY.  VOLVO DEALER REPLACED THE COMPUTER.  THE COMPUTER HAD TURNED OFF THE FUEL PUMP, CAUSING ALL SYSTEMS TO FAIL.  THIS COULD HAVE BEEN A MAJOR ACCIDENT.  TWO OTHER FRIENDS WITH THE SAME MODEL VOLVO REPORT SIMILAR FAILURES. *TR",
        "vin": "YV1960AS7A1"
    }
]