[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431695,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The fusebox that was included in the NHTSA recall #13V569000  for lighting defects was never resolved correctly on this car and many other VW Tiquans like this.  I am a 45 year ASE licensed professional automotive technician.  I am an ASE Master tech with current L1-L9 licensing.  I am also an ex GM mastertech as well.  Part time automotive instructor too.  I've seen the multiple cases filed with the NHTSA regarding this melting fuse box that causes multiple issues whether they be with lighting, causes the engine & whole electrical system to shut down, same with several computers.  I've scanned the system using VAG-COM and have two different sets of scan data to show clearly the issue.  The car will load a multitude of erroneous codes because the central electrical, ABS, engine computer & other modules lose power causing a VERY dangerous situation for the operator of the vehicle.  Not to mention a fire danger.  I have pictures of the before and after repair I did on this vehicle.  It still needs the fuse box replaced.  I replaced the melted #6 wire that attaches to the fuse box (VW part# 1K0 937 125D) which was included in the original NHTSA recall I mentioned at the beginning of this essay.  The vehicle & component is available for inspection at any time.  This vehicle stalled & left my wife & kids stranded several times making it incredibly unsafe to drive. The car has been ok now for 2 weeks after my temporary repair.  Prior NHTSA complaints from other owners with similar issues were 10551509, 10552308, 10553122, 10553811, & 10776567.",
        "vin": "wvgav7ax5aw"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423724,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "Terrible odor in the vehicle , when I checked on vehicle forums it seems like it’s happens in Volkswagen vehicles where an animal can get caught in the engine and dies and causes an odor . This is something that happens in Volkswagen vehicles only",
        "vin": "Wvgbv7ax3aw"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420012,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Volkswagen Tiguan. The contact stated while reversing out of the driveway at approximately 3 mph, the vehicle stalled and failed to restart. The vehicle was towed to the dealer to be diagnosed. The contact was informed that the timing chain failed causing the engine to seize and valves to bend. The contact was informed that the engine needed to be replaced. The contact was informed that the manufacturer had extended the warranty on the vehicle however, the warranty had expired in April 2020. The vehicle was not repaired. The manufacturer was made aware of the issue and confirmed that the vehicle extended warranty expired and the vehicle was not eligible for a free repair. The contact was referred to the NHTSA for assistance. The approximate failure mileage was 90,666.",
        "vin": "wvgav7ax5aw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418774,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "the power steering light has gone on several times, and I then would turn off the car, which would make the light go off.  Last night, however, it went on along w the entire wheel violently shaking from side to side.  I had to drive the short distance back home to my house w no power steering and the emergency lights on.",
        "vin": "WVGAV7AX7AW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318121,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "POWERSTEERING FAILS INTERMITTENTLY, STEERING WHEEL WOBBLES WITHOUT USER INTERVENTION OCCASIONALLY (AT RED LIGHT). ISSUE SEEMS RELEASED TO ELECTRICAL POWER STEERING RACK OR CONTROL BOX, BUT VW DOES NOT SEEM TO ACKNOWLEDGE THIS IS A FREQUENTLY REPORTED PROBLEM.   WHEN DOES IT HAPPEN:  1. AFTER PARKING CAR, POWER STEERING IS COMPLETELY OFF, SLOWLY DRIVING FOR 20-30 SEC SO FAR BROUGHT IT BACK. HOWEVER, STEERING IS NOT ACCURATE (SOMETIMES VERY LIGHT AND WOBBLE STARTS). AFTER OVERNIGHT PARKING THINGS SEEM FINE  2. ON HIGHWAY, AFTER 20 MINS DRIVE STEERING BECAME RATHER ERRATIC WITH DIFFICULTIES TO KEEP CAR ON THE LANE, AFTER EXIT AND STOP ENGINE AND RESTART THINGS WERE FINE AGAIN. HAPPENED SEVERAL TIMES.  CAN SEND VIDEO SHOWING WOBBLING OF STEERING WHEEL...",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258827,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKGROUND: 2015 (70,733 MI), ENGINE LIGHT WENT ON & I BROUGHT IT TO VWHARTFORD. THEY FOUND FAULT FOR SYSTEM TO LEAN FOUND REAR MAIN SELA IS LEAKING OIL WHICH IS CAUSING FUEL TRIM FAULTS. OIL CAP IS LEAKING OIL & THE UPPER TIME CHAIN COVER IS LEAKING OIL BUT THE MAIN OIL LEAK IS COMING FROM THE REAR SEAL. THEY REMOVED THE TRANS & REPLACED THE MAIN SEAL & OIL CAP ($877). IN 2016 (94,999 MI), CAR FAILED EMISSIONS DUE TO INTAKE MANIFOLD. VW REPLACED THIS AND IT WAS COVERED UNDER WARRANTY. SUGGESTION - TO GET A CARBON CLEANING FOR THE VALVES DUE TO BUILD UP ($290). JUNE '18 (118,239 MI): MY COOLANT LIGHT WENT ON. VW SAID MY COOLANT WAS NOT LOW -  WATER PUMP WAS LEAKING. THEY RESEALED VALVE COVER & UPPER TIMING CHAIN DUE TO OIL LEAKS. THEY R AND R VALVE COVER CLEANING & RESEALED, INSTALLED UPPER TIMING CHAIN SEALS AND SIDE OF ENGINE BLOCK OF OIL & INSTALLED NEW WATER PUMP. I ASKED IF THIS WAS COVERED UNDER THE WARRANTY OR PREVIOUS WORK & WAS TOLD NO. I ASKED IF THIS WOULD PROLONG THE LONGEVITY & WAS TOLD YES ($1800). 8/19/19 (133,449 MI): ENGINE LIGHT WAS ON - COULD NOT LOOK AT FOR A COUPLE DAYS, BUT OK TO DRIVE AS LONG AS THE ENGINE LIGHT WAS NOT BLINKING. RESULT: SYSTEM LEAN AT IDLE, BREATHER IS LEAKING AIR CAUSING HESITATION. THEY INSTALLED NEW BREATHER. ASKED IF IT WAS COVERED THEY SAID NO. ASKED IF IT WOULD IMPROVE THE LONGEVITY OF MY CAR, I WAS TOLD YES ($480).     ISSUE 9/4/19: ENGINE LIGHT WENT ON. THIS WAS AFTER TRAVELING FOR LABOR DAY (360 MILES). ON MAIN ST. IN WHART, THE CAR STARTED TO SHAKE & BOUNCE AT 2 STOP LIGHTS. WENT 2 BLOCKS HOME. TOWED IT - WAS TOLD  TIMING CHAIN WENT & IT'S NOT COVERED UNDER THE TC RECALL. QUOTE - USED ENGINE $6500+. TOLD IT WAS WORTHLESS & NOT WORTH FIXING ($125 FOR DIAG) TOWED THE CAR TO ANOTHER PLACE - THEY FIXED IT FOR LESS THAN $3400. I HAVE TOLD VW AND VWHART THAT THERE IS SOMETHING WRONG WITH THIS MAKE/MODEL, BUT I AM IGNORED.",
        "vin": "WVGBV7AX6AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234272,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE CITY THE CAR DIED THANKFULLY I WASN'T GOING MORE THAN 25 MPH. ICOASTED TO THE SHOULDER AND HAD THE TIGUAN TOWED TO THE VOLKESWAGEN DEALERSHIP. THE TIMING GOING CAUSED DAMAGE TO THE HEADS AND VALVES ON THE MOTOR.  VOLKESWAGEN DEALSHIP REDID THE MOTOR. AT THE COST OF $5700.00",
        "vin": "WVGBV7AX6AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230871,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "07/05/19, WAS DRIVING AT APPROX 3:30 PM WEST ON I-90 AT THE 68 MILE MARKER WHEN THE CAR SUDDENLY AND WITHOUT WARNING DIED.  THE NEXT DAY I WAS INFORMED BY A AAA MECHANIC THAT THE TIMING CHAIN HAD MOST LIKELY BEEN THE CULPRIT AND ACCORDINGLY TO SAME, DESTROYED THE ENGINE REQUIRING A NEW ENGINE.  I FOUND OUT LATER THAT THERE HAD BEEN A CLASS ACTION SUIT AGAINST SAME THAT HAD BEEN SETTLED BETWEEN VW AND THE CLAIMANTS THOUGH I HAD TRAVELED 100,020 MILES WHEN THIS OCCURRED AND WAS ENTITLED TO \"0\".  I BELIEVE THAT THIS OCCURRENCE HAS HAPPENED TO NUMEROUSLY, AND LIKE MYSELF, MANY WOULD NOT BE APPRISED OF THE POTENTIAL ISSUE SINCE MOST WOULD NOT HAVE ANY REASON TO THINK OTHERWISE.  HOWEVER, I WAS TRAVELING AT 70 MPH AND IN THE MIDDLE OF A FOUR OR FIVE LANE FEDERAL INTERSTATE IN RUSH HOUR TRAFFIC -  AND IN THE CHICAGO VICINITY - HAD I HAD LESS FORETHOUGHT A TERRIBLE CALAMITY COULD HAVE OCCURRED.  I BELIEVE THAT VW  SHOULD RECALL EVERY ENGINE WITH THIS MALADY - AND SHOULD DO SO DESPITE SETTLING WITH A BUNCH OF LAWYERS.  [SEE HTTPS://TIMINGCHAINLITIGATION.COM/].  I AM OUT THE ENTIRETY OF MY INVESTMENT AND STILL WITH 6K LEFT TO PAY ON THE CAR [I BOUGHT IT USED] OVER THE NEXT 2.5 YEARS.  SAYING THAT, I AM WRITING TO YOU TO URGE YOU TO CONSIDER TAKING ACTION AGAINST THIS ENGINE FAULT  AND PRODUCED BY VW.  MY CAR IS NOW A BIG DOORSTOP IN A GARAGE IN SHAUMBERG ILL.  I HAD TO POP FOR TWO ONE WAY TICKETS FOR ME AND MY WIFE TO GET BACK HOME TO KANSAS CITY.  YES, PRECIOUS CARGO [MY WIFE]  WAS ALSO IN THE VEHICLE WHEN IT STOPPED DEAD GOING 70 MPH ON A FEDERAL INTERSTATE!  THANKS YOU - [XXX]",
        "vin": "WVGBV7AX0AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "05/31/2019",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING 45 MPH AND PROCEEDING TO MAKE A TURN, THE VEHICLE LOST POWER. IN ADDITION, WHILE MAKING THE RIGHT TURN, FIRE WAS COMING FROM UNDERNEATH THE HOOD AND WITHIN MINUTES THE HOOD OPENED RAPIDLY. THE CONTACT STATED THAT SHE WAS UNABLE TO EXIT THE VEHICLE DUE TO THE LOST OF POWER. THE CONTACT STATED WHEN THE FIRE REACHED THE BATTERY WAS WHEN SHE WAS ABLE TO EXIT THE VEHICLE ALTHOUGH IT WAS STILL IN MOTION. WHEN THE VEHICLE CAME TO A COMPLETE STOP THE FIRE BURNED ALL OF THE TIRES. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND A REPORT WAS FILED. THE VEHICLE WAS TOWED TO A POLICE LOT AND THEN TO AN IMPOUND LOT. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "WVGAV7AX7AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209420,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE TO A FRIENDS HOUSE AND ABOUT TWO HOURS LATER GOT IN THE CAR AND STARTED TO DRIVE THEN 10 OF MY EXTERIOR LIGHTS ALL  WENT OUT THE SAME TIME. MY FOOTWELL LIGHTS I CANNOT DIM OR BRIGHTEN THROUGH THE CONTROLS AND BACK UP SENSOR STOPPED WORKING.  I HAD NO HEADLIGHTS WHILE I WAS DRIVING AT NIGHT AT AROUND 11PM. ALL THIS HAPPENED AT ONCE AT THE SAME TIME. ALL OF THE BULBS WERE FINE. I REPLACED THEM. THEY WEREN'T EVEN BLOWN. FUSES WERE FINE. THIS IS A REAL SAFETY HAZARD AND CAN LEAD TO CRASH IF NOT LOOKED INTO.",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208268,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2010 TIGUAN ON A MINNEAPOLIS CITY STREET AT AROUND 25 MPH WHEN SUDDENLY THE VEHICLE STARTING RUNNING ROUGH AND ENGINE LIGHT CAME ON. IT THEN PROCEEDED TO START BLINKING. AT THIS POINT BECAUSE OF THE ENGINE LIGHT AND PERFORMANCE ISSUE, I LOOKED FOR A SAFE PLACE TO PULL OVER AND SHUT IT OFF. AFTER I SAFELY PULLED OVER AND SHUT DOWN THE VEHICLE, APPROXIMATELY AFTER 1/3 OF A MILE FROM THE INITIAL WARNING LIGHTS & VEHICLE FAILURE STARTED.   I CALLED THE DEALERSHIP AT THIS POINT AND TOLD THEM ABOUT THE INCIDENT AND MY SITUATION. WESTSIDE VOLKSWAGEN, THE DEALERSHIP WHERE I PURCHASED THIS VEHICLE, TOLD ME NOT TO TRY AND DRIVE THE CAR BUT GET IS TOWED TO THE DEALERSHIP.  THE DEALERSHIP INSPECTED AND FOUND THE TIMING HAD JUMPED AND CYLINDERS WERE DAMAGED- RECOMMENDATION WAS TO REPLACE THE ENGINE. NEITHER THE DEALERSHIP OR VW WOULD CLAIM ANY RESPONSIBILITY FOR THIS ISSUE EVEN THOUGH IT'S A DOCUMENTED PROBLEM. I HAD TO PAY FOR THE REPAIR. SINCE THIS WAS A DOCUMENTED PROBLEM, I BELIEVE VW/WESTSIDE VW SHOULD COMPENSATE ME FOR THIS REPAIR.",
        "vin": "WVGBV7AX3AW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207141,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL HAS A PUSH TO ACTIVATE EMERGENCY BRAKE. THE EMERGENCY BRAKE WILL ENGAGE WITHOUT TOUCHING IT WHENEVER IT WANTS. IT HAS HAPPENED A FEW TIMES WHILE I WAS GOING IN REVERSE WITH NO NOTICE NOR DOES THE LIGHT INDICATOR GO ON. I HAVE TOOK IT TO MOHEGAN VW DEALER AND THEY DID FIND ANY PROBLEM WITH THE VEHICLE . I TRIED TO EXPLAIN TO THEM THAT IT ENGAGES AT ANY GIVEN TIME BUT THEY INFORMED ME THAT WITHOUT A BRAKE INDICATOR ON THERE WAS NOTHING THEY CAN DO. I NEED HELP WITH THIS ISSUE BEFORE IT ENGAGES WHILE I'M DRIVING AND KILLS ME OR ANYONE ON THE ROAD.",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205175,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING THIS TRUCK FOR 13 MONTHS NOW I HAVE MORE THAN 20 PAYMENTS STILL TO MAKE ON THIS TRUCK EVERY TIME IT RAINS THE TRUCK GETS FILLED WITH WATER IN THE PASSENGER SIDE FILLS MORE THAN 5 GALLONS OF WATER DEPENDING ON HOW BAD IT RAINS MY HEATED SEATS DON'T WORK AM ASSUMING IT'S DUE TO THE WATER DAMAGE AND MY BACK LIGHTS CONTINUE TO BLOW OUT I AM ACTUALLY FIGHTING A TICKET DUE TO THIS MATTER THERE IS WATER DAMAGE ON TOP OF THE ROOF TOP AND FEEL I GOT RIP OFF WITH THIS JUNK",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202984,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. WHILE DRIVING, THE POWER STEERING FAILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE STEERING GEAR NEEDED TO BE REPLACED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 101,000.",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/17/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162367,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY MONDAY MORNING ON 12/17/18 WHILE DRIVING FROM ORLANDO,FL TO CLEARWATER,FL  ON A MAJOR HIGHWAY MY WIFE HAD TURNED ON THE PASSENGER SEAT HEATER. NOTHING WAS OUT OF THE ORDINARY UNTIL WE SMELLED SOMETHING BURNING, THINKING IT WAS PROBABLY COMING FROM THE OUTSIDE. THE SMELL DIDN'T GO AWAY SO WE TURNED OFF THE A/C AND BOTH DRIVER AND PASSENGER SEAT HEATER UNTIL THE SMELL OF SMOKE WHEN AWAY. WE LEFT THE SEAT HEATERS OFF AND LEFT ON THE AC. WHEN WE GOT HOME WE STILL DIDN'T NOTICE ANYTHING UNTIL LATER ON IN THE MORNING WHEN MY SWEATER HAD A BLACK BURN MARK. I WENT OUT TO THE CAR AND NOTICED THAT THE PASSENGER SEAT HAD A BURN HOLE CLOSE TO THE BACK. WHEN I TURNED ON THE CAR AND TURNED THE PASSENGER SEAT HEATER ON I NOTICED SMOKE COMING UP AND THEN A SPARK AS IF IT WHERE A LIGHTER.",
        "vin": "WVGAV7AX1AW"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/24/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11154363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING MY VEHICLE AND I SAT IN THE PASSENGER SEAT TURNED ON THE HEATED SEATING AND AFTER ABOUT 2 MIN I STARTED TO SMELL PLASTIC BURNING MY LEG WAS BURNING AND WE SEEN SMOKE IN THE CAR AND PULLED OVER.  WHEN I GOT OUT THE CAR MY SEAT HAD A HOLE IN IT WITH SMOKE BILLOWING OUT.",
        "vin": "WVGAV7AX5AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/22/2018",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF OF THE CAR LEAKS WHEN IT RAINS OR SNOWS.  ANY PRECIPITATION WILL GET INTO THE VEHICLE.  THE DRAINS ARE CLEARED AND VOLKSWAGEN HAS SAID THE SUNROOF DRAIN TUBS DETERIORATE AND  WATER DOES NOT MAKE IT OUTSIDE THE VEHICLE.  INSTEAD, ALL THE WATER LEAKS INTO THE FOOT WELL OF THE VEHICLE AND HAS CAUSED MOLD AND OTHER ELECTRICAL ISSUES.  THE DEALERSHIP QUOTED US $3,650 TO FIX THE ISSUE OF PUTTING IN NEW TUBES AND REPLACING THE CARPETS.  HOWEVER, NOT THE ENTIRE CAR HAS MOLD AND NEEDS THE SEATS REPLACED AS WELL.",
        "vin": "WVGBV7AX2AW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110483,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MERGING ONTO ONCOMING TRAFFIC - ON THE FREEWAY, TAKING A TURN, MY STEERING WHEEL LOCKED. WHEN THIS HAPPENED MY CAR WAS HEADING STRAIGHT INTO A CURVED CONCRETE WALL. I MANAGED TO SLIGHTLY TURN THE WHEEL JUST ENOUGH TO NOT HIT THE BARRIER. A RED LIGHT IN THE SHAPE OF A STEERING WHEEL COMES ON. ACCORDING TO VOLKSWAGEN THIS IS THE POWER STEERING RACK'S SCANNER. THE SCANNER JUST FAILS. THERE  IS NO REASON FOR THE FAILURE, IT JUST FAILS.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2018",
        "dateOfIncident": "06/24/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110088,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED OCTOBER 2017 AND IN JANUARY STARTED TO HEAR RATTLING SOUNDS.  TOOK BACK TO SUBARU SERVICE WHERE PURCHASED AND THEY DID NOT FIND ANYTHING WRONG WITH VEHICLE.  IN JUNE 2018 CAR STARTED TO SPUTTER AND MAKE SOUNDS WHILE DRIVING AND WOULD NOT ADJUST RPMS WHEN DRIVING.  COULD NOT GO FASTER WHEN STEPPING ON THE GAS PEDAL ON THE HIGHWAY.  THREE DAYS LATER, CAR WOULD START BUT WOULD NOT GO INTO GEAR AND HAD TO BE TOWED FROM A RESTAURANT PARKING LOT.  MECHANIC GAVE AN ESTIMATE OF OVER $6,000 BECAUSE TIMING CHAIN  BROKE AND ENGINE FAILED.  ENGINE LIGHT HAD NOT GONE ON BEFORE THAT INCIDENT.  POSSIBLE DEFECT BY VOLKSWAGEN WHEN LEARNING ABOUT CLASS ACTION LAWSUIT AND MY CAR IS SAME YEAR MAKE AND MODEL OF ONES IN LAWSUIT.",
        "vin": "WVGBV7AX2AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS DRIVEN TO A RESTAURANT AND PARKED. UPON RETURNING TO THE CAR, THE CAR WOULD NOT START. IT WAS TOWED TO A MECHANIC WHERE I WAS TOLD THAT THE TIMING CHAIN HAD BROKEN AND RUINED THE ENGINE BY BENDING PARTS OF THE VALVES. THE ENGINE NEEDS REPLACED AND USED ENGINES HAVE A STARTING PRICE AROUND $6000.00.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101664,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP INFORMED US TIMING CHAIN NEEDED TO BE REPLACED AND MANIFOLD WOULD BE REPLACED UNDER WARRANTY.  AFTER REPLACING TIMING CHAIN, THEY NOTIFIED US MANIFOLD WAS ALREADY REPLACED ON VEHICLE AND IT ALSO NEEDED NEW VALVES DUE TO BEING BENT FROM BAD TIMING CHAIN.  MANY OTHER VW OWNERS HAVE EXPERIENCED TIMING CHAIN ISSUES.  THESE ISSUES STARTED WHILE THE VEHICLE WAS IN MOTION AND WHILE DRIVING LED TO EXTREME SHAKING AND NOISE AT LOW SPEEDS.  VEHICLE FELT VERY UNSAFE TO DRIVE AND WAS PROMPTLY TAKEN TO DEALER.",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/29/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098657,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKAGE OF FLUID AROUND TRANSFER CASE NECESSITATING REPLACEMENT .  MILEAGE ONLY 43000",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079408,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VOLKSWAGEN TIGUAN. CONSUMER WRITES IN REGARDS TO HEADLIGHTS NOT BEING ALIGNED. *LD  *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11078651,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. WHILE DRIVING 30 MPH, ANOTHER VEHICLE FAILED TO YIELD AND CRASHED INTO THE FRONT DRIVER'S SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO WARNING INDICATORS ILLUMINATED. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DAMAGED, BUT NOT DESTROYED. THE VEHICLE WAS TOWED TO A SHOP. THE CONTACT CALLED FREMONT VOLKSWAGEN CASPER AT (307) 462-5509 (6001 E 2ND ST, CASPER, WY 82609). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 76,000.",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2018",
        "dateOfIncident": "02/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076090,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 37,500 MILES THE WATER PUMP ON MY VEHICLE CRACKED AND RESULTED IN LOSS OF COOLANT REQUIRING TOW FOR REPLACEMENT OF FUEL PUMP ON 04/19/17.  ON 2/28/18 AT 42,770 MILES A BROKEN MANIFOLD PLUG CLIP RESULTED IN DISPLACEMENT OF COOLANT TEMP SENSOR, AGAIN WITH LOSS OF COOLANT AND TOW FOR REPAIR.  BOTH OF THESE EPISODES WERE NOTED AFTER PARKING THE VEHICLE FOLLOWING A SHORT CITY DRIVE.",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "02/02/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11073883,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT HEATER ON THE DRIVER SIDE OVERHEATED, BURNED THE DRIVER'S SKIN AND BURNED A HOLE IN A COAT. A BURNING SMELL WAS CLEARLY NOTICED.",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072836,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING CAR ENGINE SHUT DOWN, HAD TO COAST TO A STOP BRAKES WOULD NOT ENGAGE. AFTER HAVING IT TOWED TO DEALER FOUND OUT MOTOR WAS BLOW DUE TO TIMING BELT ISSUE",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065327,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT REMAINS ON",
        "vin": "WVGBV7AX6AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "12/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061597,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 7 2017 THE ENGINE STARTED MISS-FIRING, ON NEXT RESTART THE ENGINE DESTROYED ITSELF,  CAUSED BY 'JUMPED TIMING' DO TOO A DEFECTIVE CHAIN TENSIONER.",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058166,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS GO OUT ABOUT EVERY MONTH AND NEED REPLACING.  ONE GOES OUT, IS REPLACED AND THEN THE OTHER.  I'VE HAD THE CAR FOR A YEAR AND HAVE HAD TO REPLACE   4 TIMES.",
        "vin": "WVGAV7AXXAW"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056567,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-CONTACT OWNS A 2010 VOLKSWAGON RUATUAN ----VEHICLE DOES HAVE RECALL BUT CONTACT STATED VOLKSWAGON STATED VIN NUMBER IS NOT INCLUDED IN RECALL... CONTACT CALLED DEALERSHIP AND DEALERSHIP STATED EVEN THOUGH VEHICLE HAS SAME PROBLEMS THERE IS NOTHING THEY CAN DO ... ENGINE TURNS OFF WITH KEY IN IGNITION AND IGNITION BECOMES LOOSE KEY TURNS TO OFF POSITION AND CAR SHUTS OFF WHILE DRIVING..CONTACT GIVEN NUMBER TO VOLKSWAGON.      CB    .0RECALLSASSOCIATED WITH THIS VIN",
        "vin": "2V4RW5DX1AR"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055787,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN TENSIONER FAILURE, CAUSING CATASTROPHIC ENGINE FAILURE AT 77,000 MILES. A NEWER MODEL OF TIMING BELT TENSIONER HAS BEEN USED SINCE DECEMBER 2011. EST. $5000 REPAIR BILL.",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033856,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. WHILE DRIVING 30 MPH, THE VEHICLE STALLED. PRIOR TO THE VEHICLE STALLING, THERE WAS AN ABNORMAL VIBRATION WHILE DRIVING. THE CONTACT STATED THAT THE FAILURE OCCURRED WHILE DRIVING TO THE DEALER (MOLLE VOLKSWAGEN, 808 W 103RD ST, KANSAS CITY, MO 64114, (816) 941-9500) FOR DIAGNOSTIC TESTING. THE CONTACT WAS INFORMED THAT THE TIMING BELT FRACTURED, WHICH CAUSED THE ENGINE AND TURBO CHARGER TO BE DESTROYED. THE CONTACT WAS INFORMED THAT THE ENGINE WAS IRREPARABLY DAMAGED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.",
        "vin": "WVGAV7AX3AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2017",
        "dateOfIncident": "09/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025182,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ANOTHER EXAMPLE OF THE WELL KNOWN, WELL DOCUMENTED, AND PRONE TO FAILURE TIMING CHAIN TENSIONER",
        "vin": "WVGBV7AXXAW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2010 VW TIGUAN A YEAR AGO. AT 10K MILES AS REQUESTED I DID THE OIL CHANGE. A MONTH LATER OR SO OIL STARTED TO LEAK. ONE DAY I DROVE MY CAR TO A STORE AND LEFT THE ENGINE RUNNING BECAUSE I WAS ONLY THERE FOR A FEW MINS. CAME BACK AND MY ENGINE DIED. MY MECHANIC DIAGNOSED IT AND STATED IT WAS THE TIMING BELT THAT WENT. A LOT OF OF PEOPLE HAS BEEN COMPLAINING ABOUT OIL LEAK IN GENERAL WITH THIS VEHICLE. WISH I KNEW SOONER I WOULD HAVE NEVER BOUGHT THIS CAR.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010963,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING BELT TENSIONER FAILURE WITHOUT NOTICE  HAPPENED WHILE DRIVING FROM PARKING LOT  CHAIN SKIPPED BECAUSE OF CHAIN TENSIONER FAILED CAUSING CHAIN TO SKIP A TOOTH MAKING THE TIMING  ISSUES. TOWED TO MECHANIC",
        "vin": "WVGAV7AX5AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005323,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TIGUAN STARTED SHAKING AND MAKING A HORRIBLE NOISE WHEN OUR 20 YEAR OLD DAUGHTER ATTEMPTED TO START DRIVING.  SHE NOTICED THE CHECK ENGINE LIGHT ON AND THE CAR SUDDENLY STOPPED IN THE MIDDLE OF A CITY ROAD- PRESENTING A DANGER TO HER AS SHE COULD NOT MOVE THE CAR AND WAS NOT IN A SAFE NEIGHBORHOOD.  SHE HAD TO WAIT FOR A TOW TRUCK.  AT THE REPAIR SHOP, IT WAS DETERMINED THAT THE TIMING CHAIN AND TENSIONER WERE BAD SO THEY WERE REPLACED.  AFTER THIS REPAIR THE CAR STILL WOULD NOT RUN SO IT WAS TOWED TO A VOLKSWAGEN DEALERSHIP.  THEY TORE DOWN THE ENGINE AND DETERMINED THAT IT NEEDED TO BE REPLACED.  THE COST AT THE FIRST REPAIR SHOP WAS NEARLY $1600 AND THE COST TO REPLACE THE ENGINE IS NEARLY $9000.",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003630,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAD 90,000 MILES AND STARTED HAVING TICKING ENGINE NOISES. VW DEALERSHIP SERVICE TECHNICIANS DIAGNOSED THE ISSUE AS A TURBO WASTE GATE NOISE (\"NOTHING TO WORRY ABOUT AT THIS TIME\"). TWO DAYS LATER THE ENGINE STARTS TO ACT LIKE IT'S MISFIRING ALMOST BUCKING THEN WITHIN MINUTES THE ENGINE GOES(WON'T START, TRYING TO START ENGINE JUST 'SPINS'). TOWED BACK TO SERVICE. INTERNAL INSPECTION FROM THEIR TECHNICIANS CONFIRMED BENT PARTS, ETC - $8,000 TO REPLACE ENGINE. MY RESEARCH INDICATES THE PROBLEM WAS WITH THE 2.0T TSI TIMING CHAIN TENSIONER FAILURE AS LISTED IN NHTSA SERVICE BULLETIN #TB-15-12-01 NHTSA ITEM NUMBER 10045560. CERTAINLY THE RESULTS INDICATE THAT WAS THE ACTUAL PROBLEM. ACCORDING TO THE TSB IT SEEMS LIKE THIS IS A KNOWN ISSUE ACROSS MANY VW MODELS/YEARS. WHY OWNERS ARE NOT NOTIFIED OF THIS POTENTIAL ISSUE AND GIVEN A CHANCE TO TAKE ACTION TO FIX IT BEFORE SOMETHING CATASTROPHIC HAPPENS IS DISHEARTENING.",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001951,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN FAILED CAUSING COMPLETE ENGINE FAILURE.  ENGINE STARTED LOSING POWER WHEN DRIVING HOME.  TIGUAN WOULD NOT RESTART ONCE PARKED AND TURNED OFF.",
        "vin": "WVGBV7AX9AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001390,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN SKIPPED OR BROKE WHICH CAUSED A FAILURE. IT COULD NOT BE DETERMINED IF THE TIMING CHAIN WAS THE FIRST TO FAIL OR IF SOMETHING ELSE (TENSIONER FAILURE) CAUSED THE TIMING CHAIN TO BREAK AS A RESULT. THIS RESULTED IN THE VEHICLE BEING TOWED TO THE DEALER SINCE IT WAS NOT SAFE TO DRIVE. I WAS LUCKY THIS OCCURRED WHEN THE VEHICLE WAS IDLING IN A TURN LANE. WHILE IDLING, THE VEHICLE STARTED SHAKING RATHER VIOLENTLY FORE/AFT. I IMMEDIATELY PULLED OF THE ROAD AND TURNED OFF THE VEHICLE.",
        "vin": "WVGBV7AX4AW"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM MECHANIC AT VW ROSEVILLE.                CHAIN TENSIONER FAILED CAUSING SLACK IN TIMING CHAINS, WHICH CAUSED CHAINS TO JUMP TIME AND CAUSED UPPER CYLINDER HEAD DAMAGE.     CAR HAS 87,702 MILES",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993335,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/3/17. OUT OF THE BLUE WHILE DRIVING IN THE NEIGHBORHOOD, THE CAR SEEMED TO \" HESITATE\" - WANTING TO TURN OFF - LASTED ABOUT 20 SECONDS THEN IT WAS FINE UNTIL I ARRIVED TO MY DESTINATION, PARKED  THE CAR.. 4 HRS LATER READY TO GO BACK HOME, THE CAR DIDN'T START. CALLED AAA, CHECKED BATTERY- FINE, POSSIBLY ALTERNATOR. ALTHOUGH AAA GUY SAID THE \"CRAKING \"NOISE WHEN TRYING 2 START THE CAR; DIDN'T THINK WAS ALTERNATOR EITHER. HE WAS PREPPING UP THE CAR  2 B TOWED; THE LIGHTS ON DASHBOARD STARTING FLASHING, STARTED WITH BRAKE LIGHT; LATER ALL THE LIGHTS WERE FLASHING FOR SECONDS & CAR WENT COMPLETELY DEAD. TODAY, 6/5/17 THE MECHANIC TOLD ME DIDN'T FIND ANY COMPRESION IN ENGINE. WOULD HAVE 2 TEAR DOWN 2 SEE WHAT EXACTLY FAILED. SAID TIMING CHAIN COULD HAVE JUMPED TIME . THIS IS A CAR WITH ONLY 88.000 MILES. I BOUGHT IT LAST YEAR- MAY2016- EXACTLY 3 MO. LATER I HAD 2 REPLACE ENTIRE BRAKE SYSTEM; COUPLE MONTHS AFTER THAT I HAD TO GET A NEW ENTIRE FLUSH SYSTEM. ALSO I HAD TO SPEND ON GETTING A KEY LOCK KIT TO REPLACE BREAKS A ROTATE TIRES.,ALIGNMENT- CAR WASNT ALIGNT  & OTHER MINOR EXPENSES . WHAT ARE MY OPTIONS WITH THIS CAR? I HAVE A LOAN ON A VEHICLE THAT REQUIRES A NEW ENGINE AND DOESN'T EVEN HAVE 90 000 MILES. ?PLEASE HELP.",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968834,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SEEMS TO BE A RECURRING PROBLEM WITH 2010, 2011, AND 2012 TIGUANS. GAS ON THE SPARKPLUGS. THE TIMING CHAIN SENSOR GOES. THEN YOUR ENGINE IS LIKE A HOME RUN IN BASEBALL. ITS GOING GOING GONE!!!!! THATS EXACTLY WHAT HAPPENED TO MY CAR I WENT HALFWAY ACROSS THE STATE AT 5 A.M. GOT HOME AT 11 A.M. AN HOUR LATER THE CAR DIED PERMANENTLY. THERE IS FOUR PAGES OF THIS HAPPENING. ON ARFC.ORG. THE VOLKSWAGEN DEALERSHIP THAT GAVE MY CAR ITS LAST RITES SAID THIS WAS A BIG PROBLEM FOR THOSE 3 YEARS AND WAS WONDERING WHY NO RECALLS. MY CAR HAD 115,00 MILES ON IT. THE OTHER CARS SEEMED TO HAVE ONLY 66-85,000 MILES ON THEM.",
        "vin": "WVGAV7AX1AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/09/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT THE EXTERIOR LIGHTING FAILED TO OPERATE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE A FUSE FOR THE EXTERIOR LIGHTING OVERHEATED AND CAUSED THE FUSE PANEL TO BECOME DAMAGED. THE FUSE PANEL NEEDED TO BE REPLACED. THE DEALER STATED THAT THE REPAIR FOR NHTSA CAMPAIGN NUMBER: 13V569000 (ELECTRICAL SYSTEM) WAS PREVIOUSLY PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945122,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL ELECTRONIC CONTROLS STOPPED WORKING FOR A FEW MINUTES.  NEXT TIME THE CAR WAS STARTED, THE AIR BAG ERROR LIGHT CAME ON. THERE IS A LOUDER THAN NORMAL \"BRUSHING\" FRICTION NOISE DURING STEERING, AND A METALLIC PING UPON THE FIRST TURN OF THE STEERING WHEEL AFTER STARTUP  THAT WAS REPORTED TO TWO VW DEALERS MULTIPLE TIMES OVER THE LAST TWO YEARS. DEALERS CLAIMED NOT TO HEAR ANYTHING. ISSUES WERE NOT ADDRESSED.  READING THE SYMPTOMS DESCRIBED BY THE CLOCK SPRING/AIRBAG RECALL, I BELIEVE THERE IS A CONNECTION TO THE ISSUES I'VE BEEN HAVING, THAT HAVE NOW RESULTED IN A PERMANENT AIRBAG MALFUNCTION WARNING.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910268,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS DRIVEN HOME WITH NO INDICATION OF AN ISSUE BUT VEHICLE WOULD NOT START THE NEXT DAY. BATTERY WAS CHECKED BY AAA AND WAS DEEMED CHARGED AND NOT THE PROBLEM. VEHICLE WAS TOWED BY AAA TO STONE'S GERMAN GARAGE IN SEATTLE WA. AND SGG TOLD ME THE NEXT DAY THAT THE TIMING CHAIN(S) HAD SLIPPED AND THE REPAIR INVOICE IS ATTACHED.",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/23/16 (77000 ESTIMATED MILES) VEHICLE SIGNALED \"OIL PRESSURE LOW\" IT IMMEDIATELY STALLED WHILE IN MOTION ON THE EXPRESSWAY DURING TRAFFIC HOUR DURING OUR VACATION WHILE IT WAS ON AND WE WERE DRIVING. MIRACULOUSLY WE WERE ABLE TO PUSH THE STALLED VEHICLE TO SAFETY AND THERE WERE NO INJURIES. IT HAS TO BE TOWED TO OUR HOMETOWN. VW DEALERSHIP ADVISED US THAT IT WOULD REQUIRE AN ENGINE REPLACEMENT. THAT THE TIMING BELT HAD TAKEN OUT THE ENGINE. ESTIMATED COSTS OF REPAIRS $7800. OWNER'S MANUAL STATES THAT THE TIMING BELT IS A LIFETIME PART, IT DOES NOT SUGGEST MAINTENANCE OR REPAIR OF IT AT ANY POINT. OUR PRIVATE MECHANIC REPAIRED IT FOR $3800. SPOKE TO VW STATED THAT THEY WOULD NOT REPAIR OR COVER THE COSTS. CASE #161500844 WITH VW.",
        "vin": "WVGAV7AX1AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898353,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO FAILURE DUE TO INTERNAL MECHANICAL FAILURE. VW WOULD NOT PAY ANY OF THE REPAIR COST OF $2697 DUE TO YEAR/MILEAGE OF VEHICLE. DEALERSHIP DIAGNOSED CHECK ENGINE LIGHT AND SAID THAT IT WAS UNSAFE TO DRIVE OFF THE LOT BECAUSE DRIVING WITHOUT A FUNCTIONING TURBO WILL DESTROY THE ENGINE.",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894124,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. WHILE STARTING THE VEHICLE, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS IMMEDIATELY TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TIMING CHAIN SKIPPED AND DESTROYED THE ENGINE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 68,000.",
        "vin": "WVGBV7AX3AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872428,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE NIGHT I PARKED MY TIGUAN EVERYTHING WAS OK, IN THE MIDDLE OF THE NIGHT MY WIFE WAS GETTING READY TO GO TO WORK COULDN'T GET THE CAR STARTED. NEXT MORNING I RENTED AN OBD2 SCANER AND READ THE CODES. HAD THE CAR TOWED TO THE DEALER SHIP. NEXT DAY THEY CALLED ME AND TOLD BE BECAUSE OF THE TIMING CHAIN TENSIONER FAILING MY MOTOR BASICALLY GRENADED AND THEY NEEDED $7216 TO REPAIR. THE CAR HAD 62K MILES AND IT WAS 6 MONTHS PASSED WARRANTY. I CONTACTED CUSTOMER CARE AND THEY ONLY AGREED TO COVER 50% WHICH LEAVES ME WITH 3K BILL THAT I COULDN'T HAVE AVOIDED. I NEVER KNEW THE TIGUAN HAD A 10K MILE OIL CHANGE SERVICE SO I ALWAYS CHANGED AT 3K. HOW COULD HAVE I AVOIDED THIS FAILURE.",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/08/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10863782,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS WAITING AT A RED LIGHT, ON AN INCLINE, CAR STOPPED, WITH MULTIPLE CARS AHEAD.  KNEW I WOULD BE WAITING FOR A WHILE FOR THE LIGHT TO CHANGE, SO GENTLY RELEASED SOME PRESSURE ON THE BRAKE.  CAR LUNGED FORWARD HITTING CAR AHEAD OF ME AND EACH TIME I DEPRESSED THE BRAKE THE CAR LUNGED, HITTING THE CAR IN FRONT OF ME THREE TIMES.  STOPPED THE FRIGHTENING ORDEAL BY DEPRESSING THE BRAKE AND TURNING OFF THE IGNITION.  CAUSED NECK AND BACK INJURY, (REPORTED BY THE INJURED, BUT NOT CONFIRMED) OF SHERYL BROWN, DRIVER OF CAR I HIT.  GOOGLED SEARCHED THIS PROBLEM AND APPARENTLY OTHERS HAVE REPORTED LUNGING AFTER BRAKING IN BOTH TIGUAN AND TOUREG.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855516,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LEFT TURN INDICATORS FLASH WHEN TURN SIGNAL CONTROL ARM PLACED IN THE POSITION TO MAKE A RIGHT TURN.  THIS PROBLEM OCCURS WHETHER IN MOTION OR STATIONARY AND EVERY TIME THE CONTROL ARM IS PLACED IN THE RIGHT TURN POSITION. I BELIEVE THE DEFECTIVE COMPONENT IS THE ENTIRE TURN SIGNAL CONTROL ARM ASSEMBLY.",
        "vin": "WVGBV7AX9AW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "12/09/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840229,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTOR STARTED TO RUN ROUGH. IT WAS IDELING FROM 1500 TO 2000 RPM. I WAS TOLD IT IS THE PRESSURE CONTROL VALVE. I CHANGED THE DIAPHRAM IN THE P.C.V. IT WAS TORN .  IT ALSO CAUSED MY REAR MAIN MOTOR SEAL TO START TO LEAK OIL. PROBLEM ONLY GOT WORSE AS NOW I HAVE A FUEL INJECTOR STUCK SHUT. I DRIVE CITY ONLY . CAR HAS 76000 MILES ON IT . REAR MAIN SEAL BLEW BECAUSE OF THE FAULTY  P.C.V. IT CONTROLS ENGINE AND OIL PREASSURE. ESTIMATED REPAIR IS 1500.00TO 2200.00  . I HAVE READ THIS HAS HAPPENED TO SOME OTHER VW TIGUAN OWNERS.  THALK YOU  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WVGBV7AX3AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823939,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGON TIGUAN. WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE BECAME UNRESPONSIVE AND THE ENGINE WOULD NOT OPERATE AS NORMAL. THE CHECK ENGINE LIGHT ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TIMING CHAIN TENSIONER BELT FAILED AND THE ENGINE WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 83,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "10/31/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789083,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25-30 MPH ON A CITY STREET, VEHICLE STOPPED ACCELERATING (MUCH LIKE RUNNING OUT OF GAS...) DEALER STATES TIMING CHAIN TENSIONER FAILED DESTROYING ENGINE-I UNDERSTAND VW HAS A TSB OUT ON THIS FOR YEARS AND THOUGH I SERVICED MY VEHICLE AT DEALER, NEVER KNEW OF THIS POTENTIAL PROBLEM",
        "vin": "WVGBV7AX6AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777827,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "EMAILED TO TO VW CUSTOMER CARE ON 9/26/15, ONE COULD ARGUE THESE ARE SAFETY RELATED, THE FUSE BOX WAS MELTED. THE ENGINE TIMING CHAIN SLIPPED & CAUSED ENGINE DAMAGE THAT WOULD HAVE BEEN MORE EXPENSIVE TO REPAIR THAN THE COST OF A NEW ENGINE.     TO CUSTOMER CARE:  WE'VE HAD SIGNIFICANT PROBLEMS WITH OUR 2010 TIGUAN  - DOES VW OFFER ANY FINANCIAL HELP WITH THESE (FACTORY DEFECTS?)  - REPLACE FUSE BOX: $550, 8/16/2013 PARTS & LABOR, ODOMETER WAS NOT STATED ON INVOICE  - NEW ENGINE: $6,866.16, 05/13/2015 PARTS AND LABOR, ODOMETER 66,539 MILES    THE DEALER OFFERED NO WARRANTY COVERAGE & THEIR PRICE WAS HIGH SO WE WENT ELESEWHERE  - DO NOT PLAN TO BUY OR RECOMMEND VW IN THE FUTURE CONSIDERING THESE LARGE ISSUES    I HAVE THE RECEIPTS, WILL SCAN & E-MAIL IF THAT HELPS  - SERVICE LOCATION:  VOLKS & RINGS, 13669 WARWICK BLVD, NEWPORT NEWS, VA  23602   - VOLKS & RINGS PHONE: 757-874-0018    [XXX]  [XXX]  YORKTOWN, VA 23693  CELL: [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *JB",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "08/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748008,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWING SECOND TIME OF CHANGING BOTH HEADLAMPS BULBS, ONLY ONE BULB TURNED ON, AFTER OPENING THE FUSE BOX ON THE ENGINE COMPARTMEN, IT WAS DISCOVER THE 30AMP FUSE MELTED ON ONE SIDE OF THE BLADE HOWEVER THE FUSE ITS SELF DID NOT MELT INSIDE AS ITS DESIGN AND THE SOCKET OF THE FUSE BOX APPEARS TO SUFFER A HI HEAT TEMPERATURE WITCH DEFORMED THE PLASTIC SUROUNDING THE FUSE.",
        "vin": "WVGBV7AX9AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2015",
        "dateOfIncident": "07/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR MAIN SEAL GUSHING OIL DUE TO DEFECTIVE SEAL, TIMING COVER SEAL LEAKING, RECIRCULATION VALVE LEAKING, CRANKCASE VALVE LEAKING. REGULAR MAINTAINANCE ON CAR, OTHERWISE IN PERFECT CONDITION. NO REASON FOR THIS TO HAPPEN WITH SUCH LOW MILES..",
        "vin": "WVGBV7AX4AW"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY 2014, MY TIGUAN BEGAN STALLING WHEN I WOULD SLOW DOWN TO ENTER AN OFF OR ON RAMP.  I WOULD SLOW DOWN, BUT WHEN I ATTEMPTED TO SPEED BACK UP, THE CAR WOULD BEGIN STALLING OUT, AT TIMES STALLING OUT COMPLETELY.  I CHANGED FUEL, THINKING THAT MIGHT BE THE PROBLEM, BUT IT WASN'T.  MY NEIGHBOR, WHO HAD JUST BOUGHT A 2014 TIGUAN, TOLD ME HE HAD RECEIVED A RECALL NOTICE REGARDING STALLING ISSUES INVOLVING THE FUEL PUMP IN ALL TIGUANS FROM 2009-2014.  I GOOGLED THE RECALL, AND THEN MADE AN APPOINTMENT REGARDING THIS ISSUE, TAKING MY CAR IN ON MAY 5, 2014 AT HALLMARK VOLKSWAGON, BAKERS BRIDGE RD IN FRANKLIN, TN.  THE SERVICE DEPARTMENT, ACCORDING TO MY PAPERWORK, STATES THEY \"REPLACED TRANSFER PUMP IN TANK ON DRIVER SIDE THEN TEST DROVE.  FOUND FUEL PRESSURE STILL LOW.  REPLACED IN TANK FUEL PUMP (PASSENGER SIDE) THEN RECHECKED.  FUEL PRESSURES OK AND NO LONGER STALLS.\"  SINCE THAT SERVICE DATE, MY TIGUAN HAS BEEN BACK TO BE SERVICED SEVERAL TIMES, FOR CONTINUED STALLING ISSUES, AND TO DATE, HAS NOT BEEN RESOLVED.  THE STALLING NOW OCCURS AT DIFFERENT TIMES AND MORE FREQUENTLY.  THE \"SAFETY ISSUE\" REGARDING THE STALLING IS A SERIOUS ONE, IN THAT WHEN MY TIGUAN BEGINS STALLING OUT, MY FOOT IS ON THE GAS PEDAL AND NOT THE BRAKE, RESULTING IN THE DRIVER BEHIND ME NOT KNOWING THAT I AM EITHER SLOWING DOWN OR COMING TO A STOP.  I HAVE COME VERY CLOSE TO BEING REAR-ENDED ON NUMEROUS OCCASIONS DUE TO THIS ISSUE, AND IT IS ONLY A MATTER OF TIME, BEFORE I DO GET REAR-ENDED, AND THE LIKELIHOOD OF IT BEING ON A HIGHWAY BY A SEMI TRUCK IS VERY GOOD, AS I DRIVE TO CINCINNATI OFTEN TO SEE MY CARDIOLOGIST FOR HEART ISSUES.  I LEAVE AGAIN IN 2 DAYS FOR HEART SURGERY IN CINCINNATI...I HAVE 3 THINGS TO FEAR: 1) GETTING THERE SAFELY  2) SURVIVING HEART SURGERY  3) GETTING BACK SAFELY ...THE STRESS OF DRIVING A CAR THAT MAY, OR MAY NOT, STALL OUT, IS NOT GOOD FOR MY HEART!",
        "vin": "WVGAV7AX3AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VW TIGUAN WOULD NOT START, HAD VEHICLE TOWED INTO VW DEALER SAID TIMING CHAIN HAD SKIPPED ESTIMATED REPAIR COST 2,300.00.  TWO WEEKS LATER DEALERSHIP CALLS AND SAYS IT LOOKS AS THOUGH WE HAVE A BENT VALVE.  ESTIMATED REPAIR WOULD BE ADDITIONAL 2,500 DOLLARS OR I COULD GET AN ENGINE REPLACEMENT 7,500.00.  THIS CAR HAS HAD OIL CHANGES AND MAINTENANCE DONE ON A ROUTINE BASIS.  DRIVEN VERY CONSERVATIVELY OVER DURATION OF OWNERSHIP.  CAR WAS PURCHASED BRAND NEW IN JUNE 2010.  VERY DISAPPOINTED IN VEHICLE WOULD NEVER RECOMMEND ANYONE BUYING A TIGUAN",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679323,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. AFTER STARTING THE ENGINE, THE RADIATOR WARNING LIGHT ILLUMINATED. THE CONTACT DISCOVERED THAT THE COOLANT FROM THE RADIATOR WAS PRESENT IN THE ENGINE COMPARTMENT. THE VEHICLE WAS TOWED TO THE DEALER WHO DIAGNOSED THAT THE WATER PUMP FAILED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "12/09/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678414,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON FREEWAY AT 70 MPH AND EXPERIENCED FAILURE OF TIMING CHAIN TENSIONER.  CAM SKIPPED CHAIN AND CAUSED PISTONS TO IMPACT VALVES.  TOTAL AND COMPLETE ENGINE FAILURE THAT WAS SUDDEN AND UNEXPECTED AT HIGHWAY SPEED.  MY RESEARCH FINDS THAT VW IS AWARE OF THIS PROBLEM BUT WILL NOT ISSUE A RECALL.  *TR",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "08/30/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643133,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE ENGINE STALLED AND TRANSMISSION FAILED. THE CONTACT WAS ABLE TO MANEUVER THE VEHICLE TO SIDE OF ROAD. THE BATTERY AND CDC-EDC WARNING INDICATORS WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE ENGINE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED WITH A REPLACEMENT ENGINE, FLY WHEELS THAT ASSISTED THE CRANK SIGNAL AND NEW BATTERY. THE CONTACT MENTIONED THAT SHORTLY AFTER THE REPAIRS WERE COMPLETED, THE INDEPENDENT MECHANIC DIAGNOSED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED PER THE TRANSMISSION FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 79,000.",
        "vin": "WVGBV7AX6AW"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641680,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT THE CHECK ENGINE WARNING INDICATOR ILLUMINATED AND THE VEHICLE STALLED. THE VEHICLE WAS ABLE TO RESTART AND WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE MANIFOLD NEEDED TO BE CLEANED DUE TO CARBON BUILD-UP. THE VEHICLE WAS REPAIRED. IN ADDITION, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO ACCELERATE. AN INDEPENDENT MECHANIC AND DEALER DIAGNOSED THAT THE TURBO VALVE NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED FOR THIS FAILURE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V441000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 64,624.",
        "vin": "WVGAV7AXXAW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626813,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT CAME ON. TOOK THE VEHICLE TO DEALER AND THE DIAGNOSE CAME MISFIRE FROM CYLINDER 2.  THEY TOLD ME IT WAS A CARBON BUILT UP ON THE VALVES AND IT'S NOT COVERED UNDER POWER TRAIN WARRANTY.  *TR",
        "vin": "WVGBV7AX9AW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618986,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS LEAVING THE CUL-DE-SAC WHERE WE LIVE AND THE FIRST INTERSECTION IS A \"T\". AS THE CAR STARTED TO MAKE A LEFT HAND TURN THE CAR SHUT DOWN WITH NO WARNING. WITH THE STEERING HYDRAULIC SYSTEM SHUT DOWN AND BRAKE SYSTEM SHUT DOWN, WE ARE BLESSED THE CAR WAS ABLE TO STOP BEFORE HITTING A PARKED TRAILER. PUT THE CAR ON PARK, RESTARTED THE CAR WITH NO PROBLEM, THEN THE ENGINE LIGHT CAME ON, PUT IT ON DRIVE TO DRIVE IT BACK HOME AND STALLED AGAIN, COMPLETELY OFF. AFTER TWO ATTEMPTS, MADE IT HOME AND INTO GARAGE. A COUPLE OF HOURS LATER I TURNED THE CAR ON AND ENGINE LIGHT WAS ON. DID NOT MOVE IT. NEXT MORNING, TO DRIVE IT TO DEALER HOPING NO TOW NEEDED, I NOTICED NO ENGINE WARNING LIGHT SO I DECIDED TO TRY DRIVING IT TO DEALER. IT STALLED AND SHUT DOWN AGAIN BACKING OUT OF GARAGE. PUT IT ON PARK, TURNED IT ON BUT DID NOT TURN ON A/C THIS TIME. MADE IT ALL THE WAY OK TO DEALER AND ENGINE WARNING LIGHT NEVER TURNED ON. AROUND THE DEALER, I DROVE IT WITH A/C ON AND COULD NOT REPLICATE THE EVENT. HIGHLY CONCERNED THAT THIS COULD HAVE HAPPENED AT A HIGHER SPEED ON A GRADUAL CURVE WOULD HAVE BEEN POTENTIALLY A DEADLY ACCIDENT. I'M EXPECTING A CALL FROM THE DEALER SOMETIME TODAY.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE VW TIGUAN BECAUSE IT WAS RATED #1 FOR SAFETY BUT THE MORNING OF FRIDAY JULY 25 2014 AS I WAS LEAVING TO WORK I STARTED MY CAR BUT THE POWER STEERING WAS GONE COMPLETELY. I COULD DRIVE FORWARD AND BACK BUT THE STEERING WHEEL DID NOT MOVE AT ALL AS IAND THE POWER STEERING FAILURE LIGHT CAME ON IN THE DASHBOARD.  THE TIGUAN IS ALMOST 4 YRS OLD WITH 73,000 MILES. THE AGE IS THE ISSUE WITH THIS PROBLEM.  THIS HAS ME VERY CONCERN BECAUSE WHAT IF I WAS DRIVING ON THE FREEWAY AND THE POWER STEERING FAILED THEN? I COULD ONLY IMAGINE WHAT COULD HAVE HAPPEN. WHAT IF MY CHILDREN WERE WITH ME?  THIS PROBLEM IS UNACCEPTABLE, INEXCUSABLE AND LIFE THREATENING. THIS IS A VERY SERIOUS SAFETY ISSUE WITH THE TIGUAN.   AT THE VW DEALERSHIP'S CAR SHOP I WAS TOLD THAT THEY NEVER HEARD OF SUCH PROBLEM WITH THE TIGUANS. I SEARCHED ON THE WEB AND IT TURNS OUT THERE ARE SEVERAL HUNDRED  2009-2011 VW TIGUANS OWNERS THAT HAD THAT SAME PROBLEM, I GOT AN ESTIMATE TO FIX IT OF $2,045. I CALLED VW CUSTOMER SERVICE AND THEY WHERE VERY NICE AND TOLD ME THAT THEY WERE GOING TO SEE IF THEY COULD HELP ME WITH THE REPAIR. NEXT DAY I GET A CALL FROM THEM AND TOLD ME THAT THEY WERE NOT GOING TO DO ANYTHING ABOUT IT BECAUSE MY TIGUAN HAD MORE THAN 70,000 MILES AND WAY OUT OF WARRANTY.   THIS POWER STEERING PROBLEM HAS NOTHING TO DO WITH THE TIGUANS AGE.  OTHER PEOPLE THAT HAVE HAD THIS SAME EXPERIENCE AND ONLY HAD THEIR TIGUAN FOR 2 MONTHS WITH 1,800 MILES ON AND THE PROBLEM KEEPS RECURRING!  WARRANTY OR NO WARRANTY THIS IS A DESIGN FLAW AND SHOULD BE COVERED BY VW.  ALSO IN MY OPINION THIS IS AN ISSUE WORTH A MAJOR RECALL BUT SO FAR VW SEEMS TO BE WAITING FOR THE FIRST DEATHS TO OCCUR BEFORE THEY WILL REACT. THERE IS ALWAYS POSSIBILITY THAT IN TRAFFIC, THE POWER STEERING REALLY COULD GO ANY MOMENT. I AM NOW VERY SCARED TO BE DRIVING THE TIGUAN IT'S NOT SAFE AND I DON'T FEEL SAFE!  *TR",
        "vin": "WVGAV7AXXAW"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "08/08/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583565,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VW TIGUAN, WITH REPEATED ENGINE FAILURES ASSOCIATED WITH POWER STEERING MODULE, BOOST SOLENOID / ENGINE COILS, WIRING HARNESS, FUSE RE-CALL, LOSS OF POWER / THRUST / ELECTRICAL PANEL INSTABILITY, BEGINNING IN JULY 2013 UPON THE LIMITED WOLFSBURG PLATFORM.   SERVICE WAS PROVIDED BY A VW DEALERSHIP, 16 DAYS PRIOR TO THE AUGUST 2013 ACCIDENT. THE CAR WAS NOT RETURNED TO ME UNTIL OCTOBER 1, 2013. (ALMOST 8 WEEKS) A RENTAL CAR WAS APPLIED, BUT THERE WAS SIGNIFICANT OUT OF POCKET EXPENSE FOR TAXES / FEE'S FOR A 2 MONTH RENTAL. THE VW UPON RETURN OCT 1, 2013 THEN BROKE DOWN AGAIN ON OCT 9TH, FOR ELECTRICAL FAILURE AGAIN. THE CAR WAS TOWED BACK TO VW DEALERSHIP FOR REPAIR. I WAS GIVEN A COMPLIMENTARY LOANER CAR. THE VW WAS THEN RETURNED AND THEN RAN WITHOUT SIGNIFICANT INCIDENT UNTIL MARCH 16TH, OF WHICH THE ENGINE FAILED FOR ENGINE COILS, AND WAS TOWED BACK TO THE VW DEALERSHIP FOR SERVICE, THE CAR THEN EXPERIENCED ANOTHER ELECTRICAL MECHANICAL FAILURE ON 3/25, RESULTING IN A 2ND FRONT END COLLISION. I RECEIVED A NOT AT FAULT DECISION ON THE FIRST ACCIDENT, PER THE COMMONWEALTH OF MA.   *TR",
        "vin": "WVGBV7AXXAW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572666,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IS SHUTTING OFF/STALLING WITHOUT ANY WARNING, THIS HAS HAPPENED A FEW TIMES. EACH TIME THE SYMPTOMS ARE THE SAME, AFTER DRIVING FOR ABOUT AN HOUR THE CAR IS PARKED AND LEFT FOR ONE OR TWO HOURS. WHEN IT IS RESTARTED IT RUNS FOR ABOUT 30 SECONDS AND THEN SHUTS OFF WITH NO WARNING, THE CAR CAN BE MOVING AT THE TIME OR STATIONARY AND STILL IN PARK, EITHER WAY THE ENGINE CAN BE RESTARTED BUT MAY SHUT DOWN FOR A SECOND TIME AFTER ANOTHER 30 SECONDS. SO FAR IT HAS NOT REQUIRED MORE THAN ONE RESTART, THERE ARE NO FAULT CODES WHICH MAY INDICATE A FUEL OR ELECTRICAL ISSUE. I HAVE RESEARCHED THIS AND IT APPEARS TO BE A COMMON ISSUE WITH THE TIGUAN. MY CONCERN IS THAT THE CAR MAY BE INVOLVED IN AN ACCIDENT AS YOU HAVE TO WAIT FOR THE CAR TO COME TO A COMPLETE STOP THEN SELECT PARK AND RESTART THE ENGINE, YOU CAN THEN PUT IT BACK INTO DRIVE BEFORE YOU CAN PULL AWAY AGAIN,AND REPEAT IF IT HAPPENS A SECOND TIME.  *TR",
        "vin": "WGVBV7AX3AW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "08/30/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569268,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM   I BRAKE, BUT THE PEDAL WAS REALLY STIFF, HARDLY MOVED AND THE CAR DID NOT BRAKE. ONLY LONG HARD PUSHING FINALLY SUCCEEDED. (AUTO HOLD SWITCH WAS OFF) MY OTHER ISSUE IS WHEN I'M DRIVING ON THE HIGHWAY AND PUT ON THE BRAKES LIGHTLY, IT FEELS LIKE I SLAMMED THEM ON! BOTH ISSUES KEEP HAPPENING INTERMITTENTLY AND IS VERY DANGEROUS! I HAVE ALMOST REAR-ENDED PEOPLE!    I PURCHASED THE VEHICLE LAST YEAR AND HAVE HAD THE PROBLEM SINCE THEN.  *TR",
        "vin": "WVGBV7AX2AW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2014",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568091,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL 97Z9  LETTER ASKING ME TO TAKE MY VW TIGUAN TO A VW DEALER TO HAVE THE AFFECTED FUSE (PLUG-IN POSITION F16) REPLACED.  I RESPONDED AND INFORMED THE COMPANY THAT THERE'S NO VW CAR DEALERSHIP ON ST. CROIX, IN THE US VIRGIN ISLANDS WHERE I HAVE THE TIGUAN.  I ASKED IF THE PART COULD BE SHIPPED AND THE VW MECHANIC COULD INSTALL IT, AND I WAS TOLD THAT CAN'T BE DONE.  THE GENTLEMAN THEN TOLD ME THAT THE NEAREST VW DEALERSHIP IS IN PUERTO RICO, AND I SHOULD SHIP MY CAR THERE TO HAVE THE WORK DONE.  PUERTO RICO IS SEPARATED FROM THE VIRGIN ISLANDS BY APPROXIMATELY 12,000 MILES OF WATER.  IT IS NOT PRACTICAL FOR ME TO SHIP MY CAR THERE.   I NEED SOME HELP IN RESOLVING THIS PROBLEM.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WVGCV7AX6AW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "09/13/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559681,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 TIGUAN HAS EXPERIENCED A COUPLE OF SIGNIFICANT ISSUES DUE TO DESIGN - ONE A BURNED FUSE BOX AND TWO A MAJOR WATER LEAK INSIDE THE RIGHT FRONT PASSENGER FLOORBOARD.  BOTH ISSUES STEM FROM DESIGN AND NOT WEAR AND TEAR.  BOTH REPAIRS WERE COSTLY - $561 AND $753. I HAVE RECEIVED A SAFETY RECALL 97Z9 FROM VW FOR A FUSE ISSUE AND WILL BE WAITING ON A RESPONSE.  I'VE ALSO SUBMITTED AN INQUIRY TO VW ASKING ABOUT PLANS TO REVIEW THE DRAIN HOSE ISSUE.  HAD I NOT INVESTIGATED THE STRONG DAMP SMELL IN THE INTERIOR OF THE VEHICLE I WOULD NOT HAVE FOUND THE SATURATED FLOORBOARD AND I DO MEAN SOAKING WET.  BOTH DRAIN HOSES WERE FOUND TO HAVE SMALL LEAKS AND THE ROUTE OF THE HOSES DUMPS RIGHT INTO THE CABIN - AGAIN THIS IS NOT A WEAR AND TEAR ISSUE - IT'S A DESIGN/PRODUCT ISSUE.  AS A PRECAUTION THE DEALER RECOMMENDED THAT I HAVE ALL OF THE HOSES REPLACED TO PREVENT FUTURE WATER DAMAGE.  I'VE SEEN NUMEROUS COMPLAINTS FROM OTHER VW OWNERS ABOUT THE DRAIN HOSES BEING DEFECTIVE SO THIS APPEARS TO BE A LARGER ISSUE THAN JUST A FEW VEHICLES.  THANK YOU.   *TR",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/31/2013",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558014,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING MESSAGE \"CHECK FRONT LEFT HEADLIGHT\".  TESTED THE LIGHT AND IT WAS NOT WORKING.  PURCHASED A NEW BULB, REPLACED THE BULB AND THE NEW BULB WAS NOT WORKING.  TESTED THE BULB AND IT WAS GOOD.  OPENED THE FUSE BOX UNDER THE HOOD AND NOTICED THE 30 AMP FUSE (TOP LEFT CORNER OF BOX) WAS BURNED/MELTED.  ATTEMPTED TO REMOVE AND WAS UNABLE TO REMOVE.  IN ADDITION THE CORRESPONDING 15 AMP FUSE WAS BURNED OUT BUT NOT MELTED.  CONTACTED THE DEALERSHIP AND WAS INFORMED THAT MY PARTICULAR VEHICLE WAS NOT INVOLVED IN THE NHTSA INVESTIGATION FOR FAULTY FUSE BOX.  RESEARCHED FURTHER AND DISCOVERED THAT TIGUAN MODELS FROM 09-12 WERE UNDER INVESTIGATION.  IN ADDITION TO THE FRONT  HEADLIGHT I ALSO REPLACED THE RIGHT REAR LIGHT WHICH WAS ALSO OUT.  I DID NOT TEST THE EXISTING BULB ON THIS LIGHT.  JUST REPLACED.  I WOULD LIKE FOR THIS TO SERVICE A FORMAL COMPLAINT TO THE NHTSA REGARDING WHAT APPEARS TO ME AS AN UNSAFE CONDITION IN THE FUSE BOX.    *TR",
        "vin": "WVGAV7AX8AW"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2013",
        "dateOfIncident": "12/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557246,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN HEAVY TRAFFIC MOVING APPROX. 5MPH AND STALLED. WAS ABLE TO STOP AND ATTEMPT TO RESTART A COUPLE OF TIMES AND ENGINE WOULD ATTEMPT TO START, BUT WOULD QUICKLY SHUT OFF AS IF ENGINE WAS NOT RECEIVING ANY FUEL.  PUSHED VEHICLE TO NEARBY PARKING LOT AND SAME THING, VEHICLE WOULD CRANK MAKE SOME SPUTTERING SOUNDS AND SHUT OFF.  EPC AND ENGINE LIGHTS ON. PRESSING ACCELERATOR DID NOT HELP.  THIS HAD OCCURRED 3-4 TIMES SEVERAL MONTHS EARLIER USUALLY WHEN BACKING OUT OF A PARKING LOT AFTER STARTING THE CAR. REPORTED TO DEALER AT THAT TIME AND THEY SAID A CODE WAS SEEN , BUT THEY COULD NOT REPLICATE THE PROBLEM AND CAR WAS FINE.  THOSE TIMES THE CAR WAS ABLE TO BE RESTARTED, THIS TIME NOT.  HAD TOWED TO DEALER AND WAITING FOR THEM TO CHECK AGAIN.  HAVE STRONG SAFETY CONCERNS GIVEN STALLING WHILE IN TRAFFIC.  *TR",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/13/2013",
        "dateOfIncident": "12/13/2013",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555988,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH, THE PASSENGER'S SIDE HEADLIGHTS, TURN SIGNALS AND BRAKE LIGHTS FAILED TO ILLUMINATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO STATED THAT THE FUSE BOX HAD OVERHEATED. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER 13V569000 (ELECTRICAL SYSTEM, EXTERIOR LIGHTING) HOWEVER THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "WVGBV7AX0AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/10/2013",
        "dateOfIncident": "09/29/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555527,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE AT FUSE BOX UNDER HOOD MELTED (NOT BLOWING) A 30AMP FUSE.SEVERAL LIGHT WARNINGS CAME ON AFTER OCCURRENCE. HEADLAMP, MARKER LIGHTS, TAG LIGHTS DID NOT WORK.  *TR",
        "vin": "WVGBV7AX7AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/10/2013",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555540,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT HEADLIGHT AND HIGH BEAM OUT, RIGHT TURN SIGNAL OUT, LEFT FRONT PARKING LIGHT OUT AND LEFT REAR TURN SIGNAL OUT ALL AT THE SAME TIME.  *TR",
        "vin": "WVGAV7AX8AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/06/2013",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555080,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE FAULT INDICATOR LIGHT CAME ON SAYING THAT THE RIGHT FRONT HEADLIGHT WAS OUT.  AFTER PARKING FOR A PERIOD OF TIME AND RESTARTING THE CAR, THE MMI WAS INDICATING NUMEROUS FAULTS WITH ABOUT HALF OF THE LIGHTING ON THE RIGHT SIDE OF THE VEHICLE.  I TOOK THE VEHICLE TO A VW DEALER THAT DID A DIAGNOSTIC TEST AND THE RESULT WAS THAT A FUSE HAD MELTED INTO THE FUSE BLOCK AND THAT WAS CAUSING THE LIGHT OUTAGES.  THE ENTIRE FUSE BLOCK NEEDED TO BE REPLACED AND THE TOTAL REPAIR WITH LABOR WAS JUST OVER $600.00.    I CALLED VW NORTH AMERICA ON 12-6-2013 AND THEY SAY THERE IS NO RECALL FOR THAT ISSUE ON MY VIN AND THAT OF COURSE IF THERE IS ONE IN THE FUTURE THAT I COULD POSSIBLY BE REIMBURSED AT THAT TIME FOR SOME OR ALL OF MY EXPENSES.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/02/2013",
        "dateOfIncident": "12/19/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554352,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HEADLIGHTS STOPPED WORKING, BRAKE LIGHT STOPPED WORKING, AND LICENSE PLATE LIGHTS STOPPED WORKING. BROUGHT IN TO SERVICE AND THEY SAID FUSE BOX OVERHEATED CAUSING A POOR ELECTRICAL CONNECTION.  THEY TOLD ME IT WAS DANGEROUS TO DRIVE VEHICLE, AS IF I WOULDN'T HAVE CAUGHT IT THIS EARLY IT COULD HAVE LEAD TO MORE SERIOUS ISSUES LIKE POWER STEERING OR EVEN BRAKES TO GO OUT.  THEN ON 9/4/2012 BATTERY WENT DEAD AND HAD TO HAVE IT REPLACED. THEN ON 10/13/2012 THE RIGHT SIDE HEADLIGHT STOPPED WORKING AGAIN, THEY REPLACED AND WORKED FINE UNTIL NOW.  ON 11/30/2013, HEADLIGHT STOPPED WORKING AGAIN, CHECKED FUSE BOX FOR BAD FUSE, FUSES LOOK FINE BUT CAR WILL NOT START.  HAVING IT TOWED IN THE DEALERSHIP.  PRETTY SURE IT'S FUSE BOX AGAIN.  *TR",
        "vin": "WVGAV7AX3AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/12/2013",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551853,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A MORNING COMMUTE TO WORK SEVERAL LIGHTS WERE OUT ON THE VEHICLE.  WARNING LIGHTS CONTINUED POP UP ON THE INFO DISPLAY IN THE DASH.  HALF THE EXTERIOR LIGHTS HAD STOPPED WORKING.  1/2 OF EACH TAIL LIGHT, 1 OF THE 2 BACK UP LAMPS, THE LICENSE PLATE LAMP, 1 HIGH BEAM, 1 LOW BEAN 1 OF EACH SETS OF TURN SIGNALS (FRONT AND REAR).  I INVESTIGATED THE FUSE PANEL UNDER THE HOOD ONLY TO FIND A COMPLETELY MELTED FUSE (SLOT 16, 30A FUSE).   AFTER SPEAKING WITH SEVERAL VW DEALERS, SOME ADMITTED TO SEEING HE ISSUE SOME DID NOT.  MOST OF THE DEALERS HOWEVER HAD THE PART AVAILABLE OR COULD GET IT IN 1 DAY.  NOT HAVING MANY OPTIONS, I PURCHASED THE PART ($280), AND REPLACED THE ENTIRE (NON SERVICEABLE) FUSE PANEL MYSELF.  AT THIS TIME, THE ISSUE HAS NOT RE-OCCURRED WITH THE NEW PART.   I STILL HAVE THE PARTS (FUSE BLOCK AND 30A MELTED FUSE) FOR REVIEW IF NECESSARY, ALONG WITH THE RECEIPT FRONT HE DEALER I PURCHASED THE PART FROM.  I BELIEVE THIS IS SOMETHING VW SHOULD BE CONCERNED WITH AND SHOULD BE TAKING STEPS TO SUPPORT THE REPAIR , NOT STICKING THEIR OWNERS WITH THE $$$ AND POTENTIAL SAFETY HAZARDS INHERENT TO ELECTRICAL FAULTS AND LACK OF VISIBILITY FOR THE DRIVER (AND TO OTHER DRIVERS).  *TR",
        "vin": "WVGBV7AX7AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/08/2013",
        "dateOfIncident": "11/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551538,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING MY CAR ONE MORNING, I WAS GREETED WITH MANY ALERTS HAVING TO DO WITH THE RIGHT FRONT HEADLIGHT, FOG LIGHT, BLINKER, BRAKE LIGHT, REAR PARKING LIGHT AND LICENSE PLATE LIGHTS, ALL OF WHICH DID NOT WORK. THE ALERTS CONTINUED TO CYCLE THROUGH DURING THE ENTIRE TRIP (20 MINUTES FROM HOME TO WORK) AND THE STATUS DID NOT CHANGE WHEN I RESTARTED MY CAR TO GO HOME THAT NIGHT. AS I WAS DRIVING HOME THAT NIGHT (10 MINUTES INTO THE DRIVE) MY RIGHT HEADLIGHT SUDDENLY TURNED ON AND ALL OF THE ALERTS WENT AWAY. THE NEXT MORNING, THE ALERTS WERE BACK ON AND NONE OF THE RIGHT EXTERIOR LIGHTS WERE WORKING. I HAD THE CAR CHECKED AND IT TURNS OUT THE 30 AMP FUSE IN THE BACK OF THE FUSE BOX WAS MELTED ALONG WITH PART OF THE FUSE BOX THAT SITS AROUND THE FUSE. IT IS GOING TO COST ME OVER $600 TO FIX THIS PROBLEM AND THIS IS CLEARLY NOT CAUSED BY NORMAL WEAR AND TEAR. I'VE DONE SOME RESEARCH ONLINE AND IT SEEMS THAT A LOT OF OTHER DRIVERS ARE POSTING ABOUT HAVING THE SAME ISSUE WITH THEIR TIGUANS. THIS IS A SAFETY ISSUE SINCE IT IS IMPERATIVE TO HAVE BOTH HEADLIGHTS AND BRAKE LIGHTS WHILE DRIVING AT NIGHT AND THE MELTING OF THE FUSE BOX AND FUSE INDICATES THERE WAS A SMALL FIRE UNDER THE HOOD. THIS NEEDS TO BE ADDRESSED BY VOLKSWAGEN AND THE SAFETY HAZARD NEEDS TO BE FIXED.  *TR",
        "vin": "WVGBV7AX5AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550903,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING MY 2010 VOLKSWAGEN TIGUAN, THE DASH INDICATOR WILL BEGIN CYCLING THROUGH THE EXTERIOR LIGHTS, (E.G., RIGHT FRONT LOW BEAM, RIGHT FRONT FOG LIGHT) NOTING THAT EACH IS NOT WORKING. THIS ISSUE INITIALLY HAPPENED ABOUT 6 MONTHS AGO AND HAS OCCURRED INTERMITTENTLY SINCE THEN. EACH TIME, THE LIGHTS THAT HAVE BEEN NOTED AS NOT OPERATIONAL ON THE DASH HAVE, IN FACT, NOT BEEN WORKING. UNTIL RECENTLY, THE PROBLEM WOULD SELF CORRECT, TYPICALLY AFTER RE-STARTING THE CAR. HOWEVER, AS OF YESTERDAY (11/3/2013), THE LIGHTS THAT THE DASH IS NOW INDICATING ARE NONFUNCTIONAL HAVE NOT STARTED WORKING AGAIN. THIS INCLUDES THE RIGHT HEAD LIGHT, THIRD BRAKE LIGHT, LICENSE PLATE LIGHT, AND ALL TURN SIGNALS. WHEN I CALLED MY LOCAL VOLKSWAGEN DEALERSHIP, A MECHANIC TOLD ME THAT I NEEDED TO BRING IT IN SO THAT A MECHANIC WHO SPECIALIZES IN ELECTRICAL COULD LOOK AT IT. WHEN I ASKED IF THIS WAS A PROBLEM THEY HAD SEEN WITH OTHER TIGUANS, HE LET ME KNOW THAT SIMILAR ISSUES HAD BEEN REPORTED AND THAT THE CULPRIT WAS OFTEN A MELTED FUSE BOX UNDER THE HOOD. HE ALSO INDICATED THAT MY SEPARATE COMPLAINT REGARDING THE INTERMITTENT FAILURE OF THE REMOTE FOR UNLOCKING (BUT NOT LOCKING) THE CAR MAY BE A RELATED ELECTRICAL ISSUE. I HAVE NOT TAKEN THE CAR IN YET, BUT I WILL NEED TO DO SO GIVEN THE SAFETY ISSUES PRESENTED BY FAILING AND UNRELIABLE EXTERIOR LIGHTS.   *TR",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2013",
        "dateOfIncident": "10/03/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING MY TIGUAN AN EMERGENCY APPEARED ON MY DASHBOARD, A LIGHT BULB. MESSAGE STATED THAT THE LEFT TAIL LIGHT WAS OUT. GOT OUT AND CHECKED THE LIGHT AND IT WAS OUT. THEN IT STATED MY FRONT RIGHT LOW BEAM HEADLIGHT WAS OUT, THEN MY BRAKE LIGHTS AND THE LIGHT FOR MY LICENSE PLATE. THIS WAS THE 1ST TIME THE CAR HAD EXPERIENCED THIS ISSUE. NO PREVIOUS WARNINGS.    TOOK THE TIGUAN TO MY DEALER, THE CAR WAS INSPECTED AND I WAS TOLD THAT THE FUSE BOX HAD MELTED. I ASKED WHAT THE CAUSE WAS AND THEY GAVE ME NO EXPLANATION, BUT DID STATE IT WOULD COST AROUND $630 TO REPAIR. WORK WAS COMPLETED AND THE SYSTEM IS WORKING FINE, BUT THEY COULD GIVE ME NO GUARANTEE IT WOULDN'T HAPPEN AGAIN.  *TR",
        "vin": "WVGBV7AX6W5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/08/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547334,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR AND THE RIGHT SIDE EXTERIOR LIGHTS WERE COMPLETELY OUT.  THE DASH DISPLAY SAID TO CHECK 11 DIFFERENT LIGHTS (FOG LIGHT, SIDE LIGHT, LOW BEAM, HIGH BEAM, LICENSE PLATE LIGHT, ETC.).  I OPENED THE FUSE BOX AND FOUND A MELTED CAP TO A 30A FUSE IN SOCKET 16.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "11/26/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545540,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE FUSE BOX THAT MELTED/BURNT. HEADLIGHTS INOPERABLE THIS WAS NOT A RESULT OF NORMAL WEAR AND TEAR.  THIS IS A BASIC DESIGN FLAW BY VOLKSWAGEN.   *JS",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545542,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FLOORBOARD AND RIGHT FRONT HEADLINER COMPLETELY DRENCHED IN WATER AFTER RAIN.  THERE WAS SO MUCH WATER IT COULD HAVE CAUSED A SHORT AND COULD POTENTIALLY LEAD TO MOLD ISSUES.  DESIGN ISSUE WITH SUNROOF DRAIN HOSES.  *JS",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/14/2013",
        "dateOfIncident": "09/10/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543629,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT ERRATIC BEHAVIOR OF SEVERAL LIGHTS (HEADLIGHTS, BLINKING, REAR BRAKE LIGHT, LICENSE PLATE LIGHT). DANGEROUS FOR VISIBILITY AT NIGHT.     AFTER INVESTIGATION TURNED OUT TO BE A PARTIALLY MELTED 30 A FUSE IN THE FUSEBOX (30A FUSE AT THE BACK OF THE BOX).     THIS EXACT PROBLEM HAS BEEN REPORTED BY MANY OTHER VW TIGUAN OWNERS ON DIFFERENT ONLINE FORA, THUS SEEMS TO BE A MANUFACTURING DEFECT. MAY EASILY CAUSE MORE SEVERE DAMAGE BECAUSE OF SHORT-CIRCUITING OR ARCING OF 30 AM CIRCUIT.  *TR",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522909,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED UP THE CAR AND MULTIPLE DASH WARNINGS THEN WENT OFF. THE EPC LIGHT, CHECK ENGINE LIGHT AND THE HEAD LAMPS WARNINGS ALL TURNED ON. I THEN POPPED THE HOOD AND OPENED UP THE FUSE BOX TO MAKE SURE THE FUSES WERE SEATED CORRECTLY. UPON CHECKING THE FUSES I NOTICED THE BOX ITSELF WAS MELTED AND SCORCHED MEANING THERE HAD BEEN FIRE AT SOME POINT UNDER THE HOOD. I THEN TOOK MY VOLKSWAGEN TO THE CLOSEST  VW DEALERSHIP SERVICE STATION. IT COST $400 (MICHIGAN) TO REPLACE THE FUSE BOX, ALSO LEAVING ME QUESTIONING IF THIS WILL HAPPEN AGAIN. AFTER SOME INVESTIGATION ONLINE I FOUND THAT THIS IS NOT RARE. THE VW DEALERSHIP THAT DID THE REPAIR STATED THAT THIS WAS THE 8TH ONE HE HIMSELF HAS DONE. HOPEFULLY THIS DOES NOT HAPPEN AGAIN. LIGHTS RANDOMLY GOING OUT IS A SAFETY HAZARD,AND COULD LEAD TO CAR ACCIDENTS, INJURYS, AND FATALITIES.  *TR",
        "vin": "WVGBV9AX9AW"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/18/2013",
        "dateOfIncident": "06/08/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512642,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 VW LE TIGUAN PURCHASED NEW AND IMMEDIATELY THE BACK-UP CAMERA COMES ON WHILE DRIVING STATING THAT YOU CAN'T USE THE BACK-UP CAMERA WHILE DRIVING.  WHILE SERVICE TRIED TO FIX SEVERAL TIMES, IT CONTINUES TO DATE.  WATER PUMP FAILED WHILE DRIVING, TRUNK HATCH MECHANISM FAILED AND HAD TO BE REPLACED AND DRIVERS DOOR LOCK AND WINDOW LOCK FAILED AND NEW DOOR REPLACED.  ELECTRICAL BOX FUSES MELTED AND HAD TO BE REPLACED AND THE FRONT PASSENGER SEAT WARMER OVERHEATED AND MELTED THE SEAT CAUSING FULL REPLACEMENT OF SEAT (FROM THE FACTORY IN GERMANY).  ENGINE MANIFOLD FLAP FAILED AND HAD TO BE REPLACED.  INTEGRATED IPOD JACK HAS NEVER WORKED CORRECTLY.  MOON ROOF DRAIN FAILED CAUSING THE INSIDE OF THE VEHICLE TO HAVE ICE ON THE WINDOWS AND WINDSHIELD CAUSING THE WHOLE MECHANISM TO BE REPLACED.  *TR N   UPDATED 9/19/13 *CN  THE INTAKE MANIFOLD MALFUNCTIONED AND HAD TO BE REPLACED. THE HIGH PRESSURE FUEL PIP FROM THE FUEL PUMP FAIL AS IT WAS LEAKING",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2012",
        "dateOfIncident": "08/28/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481447,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "(CYLINDER FAILING/INJECTORS LEAKING) ENGINE LIGHT CAME ON AND THE DEALER SAID IT WAS BAD GAS IN MY TANK TO LET THE GAS RUN OUT AND TO FILL UP SOMEWHERE ELSE.  CAR DIDN'T HAVE MUCH POWER AND IDLING WASN'T SMOOTH.  THEY ALSO SAID THAT IF I KEEP GETTING BAD GAS THAT IT WILL DAMAGE THE CATALYST CONVERTER WHICH I THEN REPLIED CHECK THE GAS RECEIPTS IN THE CAR SINCE I ONLY BUY BP AND MOBILE 93 OCTANE NOT MY FAULT THAT GAS STATION MIGHT BE SELLING BAD GAS.  WE DO OWN ANOTHER CAR AN AUDI WITH A TURBO ENGINE AS WELL AND WE GET GAS AT THE SAME GAS STATIONS AND WE HAVEN'T HAD ANY PROBLEMS.  WEEKS LATER THE CAR WASN'T RUNNING ANY BETTER SO I TOOK IT TO ANOTHER PLACE FOR THEM TO LET ME KNOW WHY THE LIGHT WAS ON.  CODE MEANT CYLINDER 2 AND 4 FAILING.  TOOK IT BACK TO THE DEALER AND THEY TOLD ME THAT THEY HAD TO CLEAN THE FUEL INJECTORS ON BOTH OF THOSE CYLINDER THAT IT WAS DUE TO THE GAS AND THAT IT WASN'T COVER UNDER THE WARRANTY WHICH I TOLD THEM AGAIN CHECK ALL THE RECEIPTS IN THE GLOVE COMPARTMENT FOR THE TYPE OF GAS THAT I HAVE BEEN PUTTING IN.  THEN HE ASKED ME IF I DRIVE IT IN THE EXPRESSWAY WHICH I SAID SOMETIMES ON THE WEEKENDS AND TO TAKE ROAD TRIPS 2 TO 3 TIMES PER YEAR.  HE MENTIONED SOMETHING ABOUT CITY DRIVING THAT THE CAR NEEDED TO BE DRIVING AT A HIGHER SPEED WHICH I THEN REPLY:  IT IS NOT ON THE MANUAL AND THIS IS MY FOURTH VW TURBO ENGINE AND NEVER HAD THIS TYPE OF PROBLEMS THEN HE CALLED ME BACK AND TOLD ME THAT IT WAS THE WAY THE NEW ENGINE WERE DESIGNED THAT THEY WILL TAKE CARE OF IT WHICH THEY DID.  I JUST HOPE THIS DOESN'T HAPPENS EVERY 23K MILES.  IT WILL BE VERY EXPENSIVE REPAIRS NOT COUNTING WHEN CYLINDER 1 AND 3 STARTS TO FAIL.  *TR",
        "vin": "WVGCV7AX4AW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/23/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10410226,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2011 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING 45 MPH THE VEHICLE CRASHED INTO ANOTHER VEHICLE AND THE AIR BAGS DID NOT DEPLOY. DURING THE FAILURE, THE CONTACT WAS THROWN AGAINST THE STEERING WHEEL AND DASHBOARD. AS A RESULT, THE CONTACT WAS TAKEN TO THE HOSPITAL TO TREAT THE INJURIES. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 7,500.  UPDATED 07/27/11*LJ   UPDATED 3/22/12 *CN",
        "vin": "WVGBV7AX8BW"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "05/16/2011",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401140,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT WHILE DRIVING SHE TRIED TO ENGAGE THE BRAKES AND THEY FAILED.  SHE ALSO MENTIONED THAT WHILE AT A STOP LIGHT HER BRAKES FAILED AND CAUSED HER TO CRASH INTO THE VEHICLE IN FRONT OF HER. THE CONTACT DIDN'T MENTION IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DIAGNOSED THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 25 AND THE CURRENT MILEAGE WAS 5,600.",
        "vin": "WVGAV7AX1AW"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/02/2011",
        "dateOfIncident": "06/23/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386198,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM STARTED WITHIN TWO WEEKS OF LEASING-GOING ON NINE MONTHS NOW. AFTER FIRST TIME, I IMMEDIATELY BEGAN TO KEEP TREMENDOUS SPACE BETWEEN ME AND THE CAR AHEAD OF ME. HIGHLY UNPREDICTABLE UNDETECTABLE PROBLEM..BRAKES LOSE POWER BRAKES FEATURE AS NOTED BY DRIVING DONE BY MYSELF (MORE THAN 20 TIMES), MY CAR SALESMAN (MORE THAN 3 TIMES) AND A BBB TEST DRIVE. BRAKES GET STIFF, MUST PUSH HARDER TO GET VEHICLE TO STOP CREATING GREATER STOPPING DISTANCE. VW TECH TICKET TECHNOLOGY SHOWS NO PROBLEM..SO NO REPAIR DONE, BUT THERE IS A PROBLEM. SINCE UNDETECTABLE, I'M CONCERNED ABOUT A TOTAL BRAKE FAILURE. MY BBB RESOLUTION..GIVE BACK MY DOWN PAYMENT, PAYMENTS MADE-TO-DATE SO I CAN GET OUT OF THE UNSAFE CAR. BBB RULING..VW IS TO FIX THE BRAKES, THEN I DRIVE IT 30 DAYS TO SEE IF PROBLEM IS CORRECTED. THAT RULING IS UNSAFE, UNREALISTIC AND IRRATIONAL-KEEPS ME AND OTHERS AT RISK. AT THE BBB HEARING, VW REP STATED THAT BRAKES WILL BE REPAIRED ONCE A PROBLEM IS DUPLICATED AND RECOGNIZED AS A PROBLEM. THEIR TECHNOLOGY CAN'T DO THAT AND YET DRIVING SHOWS A PROBLEM. NOW VW WANTS AUDI TO INSPECT VEHICLE AND DO A REPAIR. AUDI IS A VW DIVISION AND MOST LIKELY WOULD USE THE SAME TEST EQUIPMENT. HOW CAN VW FIX A PROBLEM ABOUT WHICH THEY KNOW NOTHING? THIS PROBLEM COULD ALSO BE COMPUTER RELATED. VW OFFERED ME A 10% OFF ANY VW VEHICLE USING MY CAR AS A TRADE-IN. MY DEALERSHIP DOESN'T WANT THE CAR DUE TO THIS PROBLEM. TO MY SHOCK, VW SAID THE OFFER IS GOOD AT ANY VW DEALERSHIP..BASICALLY TELLING ME TO LIE ABOUT THE PROBLEM. I WON'T DO THAT TO ANY DEALERSHIP. THE CAR PUTS LIVES AT RISK. AT THIS TIME, NOTHING HAS BEEN DONE TO CORRECT THE PROBLEM. VW HAS YET TO DUPLICATE/RECOGNIZE IT AS A PROBLEM AND IS UNABLE TO FIX IT. SO WRONG ON A HUMANISTIC LEVEL. VW SHOULD BUY BACK THIS CAR AT FULL PURCHASE PRICE WITH ALL MY MONEY REFUNDED TO ME. THE CONSEQUENCE OF  THIS IS I AM STUCK WITH A CAR I CAN'T TRADE-IN AND VW CAN'T FIX. VW DOESN'T CARE ABOUT SAFEY AS THEY SAY THEY DO, THEY ONLY CARE ABOUT MONEY.  *TR",
        "vin": "WVGBV7AX4AW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "01/04/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374663,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER ON MY 2010 VOLKSWAGEN TIGUAN READS 3% SLOWER THAN THE ACTUAL SPEED OF THE VEHICLE BASED ON COMPARISONS WITH MULTIPLE GPS UNITS. VOLKSWAGEN IS UNWILLING TO DIAGNOSE AND CORRECT THE DEFECT. THE PROBLEM OCCURS EVERY TIME THAT I DRIVE THE VEHICLE. *TR",
        "vin": "WVGAV7AX0AW"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/02/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373795,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTIPROCONTACT",
                "productYear": "9999",
                "size": "P205/60R16",
                "type": "Tire"
            }
        ],
        "summary": "DRIVING APPROXIMATELY 30-35 MPH ON DRY, FLAT PAVEMENT...NO POTHOLES OR ROAD HAZARDS. HEARD THUMP FROM REAR TIRE ON PASSENGER SIDE (THOUGHT SOMETHING FELL OVER IN TRUNK). DROVE APPROXIMATELY 1/2 MILE TO HOME AND WHEN EXITING VEHICLE HEARD HISSING NOISE FROM TIRE. THE TIRE HAS A SLIT IN THE TREAD/SIDEWALL OF APPROXIMATELY ONE-INCH IN LENGTH. *TR",
        "vin": "WVGBV7AX8AW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2010",
        "dateOfIncident": "12/31/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373644,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD THE POWER STEERING CUT OUT MULTIPLE TIMES IN THE VEHICLE.  IT HAS NOT HAPPENED WHILE DRIVING, THE RED POWER STEERING LIGHT SEEMS TO BE ON WHEN WE START IT THE SECOND TIME FOR THE DAY AND DOESN'T ALWAYS RESET WHEN RESTARTING THE CAR.  WE HAVE YET TO BRING IT TO GET FIXED AS THE NEAREST DEALER IS 1200KMS AWAY. *TR",
        "vin": "WVGBV7AX1AW"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362295,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. IN JULY 2010, THE ELECTRONIC POWER CONTROL LIGHT ILLUMINATED. THE DEALER REPLACED THE ACCELERATOR PEDAL AT THAT TIME. IN OCTOBER 2010, WHILE THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH AND ATTEMPTING TO TURN, THE VEHICLE SUDDENLY STALLED. THE CONTACT WAS ABLE TO RESTART AND DRIVE TO THE DEALER WHERE A FEW PARTS WERE REPLACED (THE NAME OF THE PARTS WERE UNAVAILABLE). THE CONTACT CALLED THE MANUFACTURER WHO OFFERED TO ASSIST WITH A ONE MONTH PAYMENT TOWARDS THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000 AND THE CURRENT MILEAGE WAS 6,053.",
        "vin": "WVGAV7AX6AW"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2010",
        "dateOfIncident": "08/16/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362124,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2010 VOLKSWAGEN TIGUAN I'VE HAD IT IN THE SHOP 3 TIMES GOING ON THE 4TH TOMORROW DUE TO THE BRAKING SYSTEM.  IN REVERSE THE BRAKES SQUEAL SO BAD, HOW SAFE IS THIS TO DRIVE?  THE AUTOMOBILE SHOP IS BASICALLY TELLING ME THERE IS NOT THING THEY CAN DO.  WHILE I DRIVE THE CALL AND HAVE TO APPLY BRAKES SOMETIMES I HAVE TO PUNCH THE BRAKE PEDAL ALL THE WAY DOWN TO THE FLOOR FOR THE CAR TO STOP.  *TR",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "08/30/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353264,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2010 VOLKSWAGEN TIGUAN. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 55 MPH, THE ACCELERATOR PEDAL STUCK TO THE FLOOR AND WOULD NOT RELEASE. THE ENGINE RPMS INCREASED TO 7,000 WITH AN UNINTENDED INCREASE OF ACCELERATION . WHEN THE BRAKE PEDAL WAS ENGAGED THE VEHICLE SLOWED DOWN AND THE RPMS REMAINED AT 7,000. THE GEAR WAS SHIFTED FROM DRIVE TO NEUTRAL AND THE VEHICLE CONTINUED WITH THE ACCELERATOR PEDAL REMAINING IN THE STUCK POSITION. THE BRAKES WERE APPLIED AND THE VEHICLE WAS PULLED OVER AND THE ENGINE TURNED OFF. THE ACCELERATOR PEDAL WOULD NOT RELEASE MANUALLY AFTER NUMEROUS ATTEMPTS, THEN SUDDENLY THE PEDAL RELEASED WITHOUT ASSISTANCE. THE VEHICLE RESTARTED WITH THE RPMS AT 7,000. THE CONTACT RESUMED WITH CAUTION. THE VEHICLE WAS IN THE PROCESS OF BEING TOWED TO A DEALER FOR DIAGNOSTIC TESTING. THE CONTACT EXPRESSED  SIGNIFICANT CONCERN OF THE LIFE THREATENING FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,490.",
        "vin": "WVGAV7AX4AW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2010",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343229,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2010 VOLKSWAGEN TIGUAN. THE CONTACT STATED THAT THE COOLING UNIT AIR RE-CIRCULATOR WOULD NOT SHUT OFF AND WOULD CONTINUE TO RUN AFTER THE ENGINE WAS SHUT OFF. THE OWNER'S MANUAL ADVISED THAT THE VEHICLE SHOULD NOT BE OPERATED WITH THE RE-CIRCULATOR CONTINUOUSLY RUNNING. THE DEALER ADVISED THAT THE VEHICLE WAS OPERATING AS DESIGNED AND DID NOT OFFER A REPAIR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 12 AND THE CURRENT WAS UNKNOWN. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "03/27/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342337,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TIGUAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY IN MY 2 MONTH OLD 2010 TIGUAN WHEN A CAR IN THE LEFT LANE CAME OVER INTO MY LANE.  I SWERVED TO THE RIGHT TO AVOID HIM HITTING ME AND WHEN I DID THE TIGUAN STARTED JERKING BACK AND FORTH (LEFT TO RIGHT AND BACK) SO HARD THAT IT JERKED THE STEERING WHEEL OUT OF MY HANDS.  IT WAS ALL I COULD DO TO KEEP THE CAR GOING STRAIGHT.  I HAD TO HOLD ON SO TIGHT WITH BOTH HANDS THAT I WASN'T EVEN ABLE TO LET GO LONG ENOUGH TO HONK AT THE OTHER CAR. *TR",
        "vin": "WVGBV9AX7AW"
    }
]