[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/26/2015",
        "dateOfIncident": "12/26/2015",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816240,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "JOURNEY",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS HAVE BECOME VERY CLOUDY AND ARE TURNING YELLOW DUE TO DETERIORATION OF THE PLASTIC WHICH APPEARS TO HAVE FINE CRACKING OR CRAZING THROUGHOUT THE MATERIAL THAT CAN NOT BE POLISHED OUT.     THE HEADLIGHTS ALSO CONTAIN THE TURN SIGNALS AND HAVE THE FOLLOWING IDENTIFICATION:         DOT SAE AHR15PP2 99 HB3  TYC 20-6173 R & TYC 20-6174 L    SEVERAL MONTHS AGO I CONTACTED WINNEBAGO INDUSTRIES REGARDING REPLACEMENT AND THEY SAID THEY WOULD NOT COVER THE COST, I WOULD HAVE TO BUY THEM.    AS TIME GOES ON THE CONDITION IS GETTING WORSE WHICH IS IMPAIRING THE NIGHTTIME ROAD VISIBILITY AND VIEW OF THE TURN SIGNALS BY ONCOMING TRAFFIC.    I DO NOT FEEL I SHOULD HAVE TO COVER THE COST OF REPLACEMENT DUE TO THE INFERIOR QUALITY OF THE MATERIAL USED FOR THESE HEADLIGHTS. I HAVE OWNED MANY VEHICLES OVER THE YEARS AND HAVE NEVER EXPERIENCED THIS ISSUE BEFORE.",
        "vin": "4UZACJDT3AC"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/30/2011",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410058,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "JOURNEY",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 WINNEBAGO JOURNEY. THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS THE FRONT WINDSHIELDS SUN BLOCKER SHADE WAS FRACTURED ON THE FRONT PASSENGER SIDE. IN ADDITION, HE NOTICED THAT THE FRONT WINDSHIELD WIPERS FAILED TO FUNCTION WHILE DRIVING IN INCLEMENT WEATHER. THE VEHICLE WAS NOT  INSPECTED BY A DEALER NOR HAD IT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 15,000.   UPDATED 07/18/11  *BF    UPDATED 07/26/11 *BF  THE CONSUMER STATED THE HOT WATER DID NOT WORK AND THE FRESH WATER SENSORS WERE IN THE WRONG PLACE, WHICH WAS GIVING A FALSE READING. THE FIREPLACE FAN WAS INOPERABLE AND THE CAP ON THE SEAT BELT WAS MISSING. UPDATED 02/06/12  UPDATED 3/22/12 *CN",
        "vin": "4UZACVBS4AC"
    }
]