[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450730,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2010 Volvo XC70. The contact stated that the rear differential was making an abnormal sound. The bearings were spalling metal into the gears. There was no warning light illuminated. The contact called the local dealer however, the vehicle was not diagnosed or repaired. The manufacturer was notified however, no further assistance was provided. The approximate failure mileage was 95,000.",
        "vin": "yv4992bz3a1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434699,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I would appreciate your deepest consideration for assistance with the problematic rear differential on the 2010 XC70 Volvo. I have spent considerable funds to maintain my vehicle at top working order through maintenance at Volvo.  I have always asked the Volvo advisors for service recommendations on the vehicle to keep my car running economically to ensure main components did not fail due to lack of maintenance. Therefore, when I learned that my rear differential is failing and there is no recommended service on that particular part which can be seen on the Maintenance Service manual below, there seems to be a lack of knowledge shared on this part. Unfortunately, I just started to look into this matter once my rear differential starting to fail, this knowledge was not shared to me during regular periodic maintenance, my Volvo Service advisors never recommended changing the rear differential oil. Moreover, it is a known defect for Volvo cars built throughout the years of 2008-2014. Volvo and Land Rover use the same part and there are many examples of this happening to Volvo owners around the mid-90K mile range. The cost is extremely expensive at an estimated $5,580.00.  Please look in to this matter, this should be a national recall for this vehicle!",
        "vin": "YV4992BZ3A1"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "11/02/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945693,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO XC70. WHILE DRIVING VARIOUS SPEEDS, A WARNING MESSAGE ILLUMINATED ALERTING OF A CHILD SAFETY LOCK MALFUNCTION. THE CONTACT STATED THAT THE REAR DRIVER SIDE DOOR FAILED TO LOCK WITH OR WITHOUT THE CHILD SAFETY LOCK ENGAGED. THE CONTACT MENTIONED THAT THE DOOR LOCK BUTTON HAD TO BE DEPRESSED SEVERAL TIMES TO ENGAGE THE DOOR LOCK. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE DOOR LOCK MOTOR FAILED AND A SOFTWARE UPDATE WAS NEEDED FOR THE CHILD SAFETY LOCK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT FILED A COMPLAINT WITH THE MANUFACTURER. THE FAILURE MILEAGE WAS 109,000.",
        "vin": "YV4960BZ5A1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928614,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR HAS ABOUT 93,000 MILES  ON IT. BEGINNING AT 60,000 MILES, THE CAR BEGAN TO USE AN EXCESSIVE AMOUNT OF OIL. THE LOW OIL INDICATOR COMES ON AND WE NEED TO ADD ONE OR MORE QUARTS OF OIL AT EACH 3,000 TO 3,500 MILES. THE CAR DEALER TELLS US IT IS \"NORMAL\" FOR SOME CARS TO USE THIS AMOUNT OF OIL AND THE PROBLEM HAS NOT BEEN RESOLVED. I NOTICED A RECALL NOTICETSB #TJ30021 COVERED SOME 2011 VOLVO XC 70S FOR OIL LOSS. WHY DOES IT NOT COVER THE 2010 CARS? THIS IS A CONTINUING PROBLEM WITH MY CAR. HAVE THERE BEEN OTHER COMPLAINTS SIMILAR TO MINE? I HAVE RECORDS FOR MY OIL CHANGES FROM THE CAR DEALERSHIP.",
        "vin": "YV4960BZ4A1"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670523,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE  THE TIRE PRESSURE LABEL ON OUR XC70 (VIN: [XXX]) LIST THE PROPER TIRE PRESSURE AS BEING 33 PSI.  AT THIS PRESSURE THE TIRE PRESSURE WARNING LIGHT IS CONSTANTLY ON.  THIS RENDERS THE FEDERAL MANDATED TIRE PRESSURE MONITORING SYSTEM ESSENTIALLY NON-FUNCTIONING AND PLACES THE DRIVER AT RISK.    VOLVO OF NORTH AMERICA HAS REVIEWED THIS ISSUE AND HAS CONFIRMED THE 33 PSI VALUE, NOT THE HIGHER VALUE IN THE OWNERS MANUAL, IS CORRECT. VOLVO HAS CONFIRMED THEIR RECALL TO REPLACE THE INCORRECT 33 PSI LABELS ON THE 08-10 XC70 DOES NOT APPLY TO THIS VEHICLE.    SINCE PROPER TIRE PRESSURE AND THE TIRE MONITORING SYSTEM IS AN IMPORTANT ELEMENT IN SAFE DRIVING, VOLVO NEED TO RESOLVE THIS ISSUE.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV4960BZ2A1"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615718,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JACK FAILED DURING TIRE CHANGING. THE CAR JACK FAILED CAUSING JACK TO BEND.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "02/25/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585438,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A VOLVO RECALL 226 (NHTSA CAMPAIGN #10V190000) TO REPLACE AN INCORRECT FMVSS LABEL THAT SHOWS TIRE PRESSURE OF 33 PSI AND TO REPLACE A PAGE IN THE OWNERS MANUAL THAT SHOWS THE PRESSURE SHOULD BE 35 PSI.  THE CORRECT PRESSURE IS 36 PSI.  THIS IS INFORMATION IS ALSO CONTAINED IN A LETTER FROM VOLVO TO NHTSA DATED 4 MAY 2010 (10V-190 3 PAGES).    ACCORDING TO VOLVO, OUR XC70 (MFD 8/09) IS NOT PART OF THIS RECALL.  HOWEVER, THE TIRE PRESSURE ON THE FMVSS LABEL AND LISTED IN THE OWNERS MANUAL MATCH THE INFORMATION IN THE RECALL.  SINCE THE INFORMATION ON THE FMVSS LABEL DOES NOT MATCH WHAT IS LISTED IN THE OWNERS MANUAL FOR OUR XC70, VOLVO NEEDS TO 1) INCLUDE OUR XC70 IN THE RECALL OR; 2) ISSUE A NEW RECALL OR; 3) INFORM US HOW THE TWO DIFFERENT PRESSURES (ON THE FMVSS LABEL AND OWNERS MANUAL) ARE CORRECT.      *JS",
        "vin": "YV4960BZ2A1"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "07/02/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523225,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST PICKED UP THE CAR FROM THE VOLVO DEALERSHIP WHERE THE CAR WAS THERE FOR TWO WEEKS. I STOPPED FOR GAS AND DID SOME SHOPPING AND AS I WAS ENTERING HIGHWAY THE 'TIRE PRESSURE LOW' WARNING LIGHT CAME ON. I THOUGHT IT WAS PROBABLY DUE TO WORK THAT WAS DONE IN THE SHOP. I ENTERED THE HIGHWAY AND AS I WAS SPEEDING UP, I NOTICED THE NOISE COMING FROM THE WHEELS, NOTICED THAT THERE WAS A FLAT. THE FLAT WAS DUE TO TPMS VALVE STEM FAILING AND AS I WAS TOLD LATER BY THE DEALERSHIP, THE LOSS OF AIR WAS VERY QUICK AND THE 13 MONTH OLD TIRE WAS DAMAGED AFTER ONLY DRIVING ON LOW PRESSURE FOR LESS THAN A MILE. AS I UNDERSTAND IT WOULD HAVE BEEN DANGEROUS IF IT HAPPENED WHILE DRIVING AT HIGH SPEEDS.    AFTER I TOOK THE CAR BACK TO THE DEALERSHIP, THEY REPLACED ALL TPMS SENSORS ON THE CAR DUE TO THE VOLVO TSB TJ-24767 DATED DEC 2011 TITLED 'TIRE MONITORING SYSTEM - TPMS SENSOR NUT CORROSION'. MY MAIN COMPLAINT IS THAT VOLVO KNEW ABOUT THIS ISSUE AND NEITHER THEY TRIED TO REPLACE THE TPMS SENSORS AT A FEW TIMES THE CAR WAS AT THEIR DEALERSHIP, NOR THEY TRIED TO EDUCATE THE CAR OWNERS ABOUT THE POSSIBLE RISKS. AS A RESULT, ONE OF THE TIRES WAS DAMAGED WHICH I HAVE BILLED TO PAY FOR.  *TR",
        "vin": "YV4992BZ4A1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515125,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE INTERSTATE HIGHWAY THERE WAS A SUDDEN LOSS OF TIRE PRESSURE.  THIS WAS CAUSED BY A FAILURE OF THE TIRE PRESSURE VALVE DUE TO CORROSION OF THE METAL.  THE NEW VALVES ARE MADE OF PLASTIC.  HOWEVER, THE ISSUE IS THAT ONE DOESN'T KNOW ABOUT THE PROBLEM UNTIL IT OCCURS.  IF THE FRONT TIRE HAD LOSS PRESSURE THERE MAY HAVE BEEN A WORSE INCIDENT.  THIS HAD PREVIOUSLY OCCURRED ABOUT 6 MONTHS EARLIER WITH ANOTHER TIRE.  I STOPPED TO ADD AIR TO A TIRE AND DISCOVERED THAT THE VALVE WAS PUSHED INTO THE TIRE WHEN TRIED TO APPLY THE AIR HOSE.  THE TIRE VALVE WAS REPLACED, BUT I DIDN'T THINK ANYTHING OF IT AT THE TIME.  THIS TIME AROUND I HAD ALL OF THE ORIGINAL VALVES REPLACED, AND FOUND THAT THE DEALERS IN THE AREA ARE ALL OUT OF STOCK WITH THE VALVES, SO IT APPEARS TO BE A UNIVERSAL PROBLEM.  I BELIEVE THAT THE ORIGINAL VALVE CAN BE CHARACTERIZED BY A DEFECTIVE DESIGN WITH RESPECT TO THE MATERIALS USED.  AS A RESULT, I HAVE HAD TO REPLACE TWO DAMAGED TIRES, AS WELL AS FOUR TIRE PRESSURE VALVES DUE TO THIS ISSUE.  MY SUGGESTION IS THAT THE ISSUE SHOULD BE QUICKLY INVESTIGATED FOR A POSSIBLE RECALL AND REPLACEMENT AT THE EXPENSE OF THE MANUFACTURER.  THANK YOU.  *TR",
        "vin": "YV4BZ982891"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/23/2012",
        "dateOfIncident": "09/15/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485820,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO XC70. WHILE DRIVING APPROXIMATELY 80 MPH, THE REAR PASSENGER SIDE TIRE DEFLATED SUDDENLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN ADVISED THE CONTACT THAT ALL FOUR VALVE STEMS WERE CRACKED AND WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "YV4992BZ9A1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/23/2012",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10462970,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2010 VOLVO XC70. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, SHE REALIZED THAT SMOKE WAS COMING FROM THE AIR VENTS. THE CONTACT MERGED ONTO THE EXIT RAMP AND STOPPED THE VEHICLE. THE CONTACT THEN EXITED THE VEHICLE AND NOTICED FLAMES COMING FROM THE ENGINE. THE FIRE DEPARTMENT WAS NOTIFIED AND EXTINGUISHED THE FIRE. THE CONTACT WAS TAKEN TO THE EMERGENCY ROOM TO TREAT INJURIES RESULTING FROM INHALING LARGE AMOUNTS OF SMOKE. NO OTHER PERSONS WERE INJURED. THE FIRE DEPARTMENT HAD THE VEHICLE TOWED BECAUSE IT WAS NOT DRIVEABLE. A POLICE REPORT WAS AVAILABLE IF NEEDED. THERE WERE EXTENSIVE DAMAGES TO THE FRONT END OF THE VEHICLE. THE DEALER WAS NOTIFIED AND OFFERED NO ASSISTANCE. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS UNKNOWN. THE FAILURE AND CURRENT MILEAGES WERE 17,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "05/21/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331599,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS - AIR BAG LIGHT CAME ON AFTER 1,000 MILES. *TR   UPDATED 10/20/10 *BF   UPDATED 10/22/10",
        "vin": "YV4992BZ1A1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/10/2010",
        "dateOfIncident": "03/11/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324823,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VOLVO X70 2010 STATION WAGON HAS HAD A NUMBER OF INCIDENTS WHERE THE CAR TRANSMISSION \"JUMPS\" WHILE THE GAS PEDAL IS NOT ENGAGED.  IT SEEMS THAT WHEN THE ENGINE IS AT IDLE, AT A STOP OR DURING A SLOW TURN, THE CAR SLIGHTLY AND SUBTLY JUMPS A BIT.  MY VOLVO DEALER HAS ATTEMPTED TO \"UPGRADE\" THE SOFTWARE BUT THE PROBLEM, ALTHOUGH SPORADIC, RECURS.  I AM CONCERNED THAT THERE IS A DEFECTIVE ISSUE HERE AND THAT OTHER POTENTIAL DANGEROUS PROBLEMS MAY ARISE IN THE FUTURE. *TR",
        "vin": "YV4960BZ1A1"
    }
]