[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2012",
        "dateOfIncident": "12/28/2011",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459787,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "OUTLOOK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "SIX MORE INCIDENTS OF ENGINE ACCELERATION - NOW A TOTAL OF EIGHT  28 DEC 2011WATERLOO, IA 1:13 PM @ 5548 MILES.  AFTER COMING TO A STOP AND PLACING SHIFT LEVER IN PARK, ENGINE SPED UP TO 2800 RPM THEN BACK TO IDLE.  DURATION 2 TO 3 SECONDS.    4 JAN 2012       SOUTH OF WACO, TX GOING SOUTH ON I-35 NEAR EXIT 320 @ 1:10 PM WITH 6780 MILES ON ODOMETER.  CRUISE CONTROL SET TO 60 MPH FOR SOME TIME GOING UP AND DOWN GRADES AND EVEN ON MODERATE GRADES RPM ONLY WENT TO 3800 RPM.  THIS TIME ON A SLIGHT GRADE, ENGINE RACED FROM 2500 RPM TO 5000 RPM FOR 4 TO 5 SECONDS THEN BACK TO NORMAL.  FEET WERE NOT ON ANY PEDALS.  4 JAN 2012      AT 1:35 PM ON I-35 NEAR EXIT 300 WITH 6805 MILES ON ODOMETER AND WITH CRUISE CONTROL SET TO 60 MPH, ENGINE RACED FROM 2400 RPM TO 5100 RPM FOR ABOUT 3 SECONDS THEN BACK TO NORMAL.  SLIGHT INCLINE WITH FEET OFF OF ALL PEDALS.  4 JAN 2012      AT 1:43 PM ON I-35 NEAR EXIT 293 WITH 6811 MILES ON ODOMETER AND CRUISE  CONTROL STILL SET AT 60 MPH. UPON APPROACHING A STEEPER GRADE, ENGINE RAPIDLY SPED UP FROM 2400 RPM TO 3400, TO 3800, TO 4300, TO 5200 RPM WITH THIS TOTAL SEQUENCE TAKING ABOUT 3 SECONDS.  FEET OFF BOTH PEDALS; AS IT IS MY USUAL CUSTOM WHEN ON CRUISE CONTROL.  2 FEB 2012AT 2:36 PM GOING NORTH ON I-35 [KS TURNPIKE IN WICHITA] WITH 8246 MILES ON ODOMETER AND CRUISE CONTROL SET TO 70 MPH AND OPERATING NORMALLY AT 2600 RPM, IT WAS DISENGAGED FOR ABOUT 1 MINUTE BY DRIVER.  UPON PRESSING THE RESUME BUTTON ENGINE RACED DIRECTLY TO 5100 RPM FOR ABOUT 30 SECONDS THEN BACK TO 2600 RPM.  ALL OTHER RE-ENGAGEMENTS BY RESUME FUNCTIONS WERE UNDER 4200 RPM.  3 FEB 20126:50 PM ON I-35 TWO MILES SOUTH OF ALBERT LEE MN AND CRUISE CONTROL SET AT 60 MPH.  ON A SLIGHT INCLINE ENGINE RACED FROM 2200 RPM DIRECTLY TO 5100 RPM FOR ABOUT 15 SECONDS.    NOTE: TWO PRIOR INCIDENTS REPORTED IN NHTSA ODI ID NO.: 10453149.  *TR",
        "vin": "1FDXE4FS8AD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/26/2012",
        "dateOfIncident": "05/21/2011",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453149,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "OUTLOOK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "RUNAWAY FORD V-10 ENGINE IN A 2010 WINNEBAGO OUTLOOK RV    INCIDENT # 1 - 21 MAY 2011 - CANON FALLS MN  WE WERE ON OUR WAY BACK ON HWY52 COMING TO A STOP LIGHT IN CANON FALLS AND I WAS SLOWING DOWN FROM REGULAR HWY SPEEDS 60-65MPH. I DIDN'T NOTICE ANYTHING DIFFERENT UNTIL I WAS GOING AROUND 10-15 MPH. I THEN NOTICED THE RV'S BRAKES DID NOT SEEM TO BE SLOWING US DOWN LIKE NORMAL AND THEN I COULD HEAR THE ENGINE ROARING SO I LOOKED AT THE RPM'S AND IT WAS STILL SOMEWHERE BETWEEN 2000-3000RPM.S AND NOT GOING DOWN AT ALL.  I WAS PUSHING THE BRAKE ALL THE WAY TO THE FLOOR STILL PROBABLY JUST GOING 5MPH OR SO AND IT DID NOT FEEL LIKE IT WAS GOING TO STOP. ALL OF THE SUDDEN IT JUST SLOWED QUICKLY THE LAST FEW FEET AS I WAS ALMOST IN THE INTERSECTION THE ENGINE STILL ROARING AND ONCE IT STOPPED I QUICKLY PUT IT IN NEUTRAL AND THEN THE RPM'S WENT DOWN BACK TO NORMAL. I SHIFTED BACK INTO DRIVE AND IT WORKED THE REST OF THE WAY HOME WITH OUT ANY PROBLEMS.    INCIDENT # 2 - 19 JUNE 2011- SAVAGE MINNESOTA  WHILE SLOWING DOWN [LESS THAN 20 MPH] TO A STOP AND BRAKING, RV WOULD NOT SLOW FOR A STOP.  HAD TO \"STAND\" ON BRAKE TO HOLD IT BACK, BUT IT WOULD NOT STOP!.  PUT IT IN NEUTRAL, ENGINE RACED TO 4000+ RPM, TURNED KEY OFF, RV STOPPED.  UPON RESTART ALL OK???  2ND INCIDENT OF THIS SAFETY PROBLEM [ABOVE GIVEN TO FORD RV CUSTOMER ASSISTANCE].  *TR",
        "vin": "1FDXE4FS8AD"
    }
]