[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Airstream, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11002419,
        "products": [
            {
                "manufacturer": "Airstream, Inc.",
                "productMake": "AIRSTREAM",
                "productModel": "INTERSTATE",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 2011 AIRSTREAM INTERSTATE MOTORHOME, A MECHANICAL STEP UNDER THE SLIDING DOOR RETRACTS AUTOMATICALLY WITH A POWERFUL ELECTRIC MOTOR.  THE STEP WILL RETRACT IF THE VAN IS STARTED, EVEN IF THE DOOR IS OPEN.  I WAS IN A HURRY TO LEAVE AND ENTERED THE DRIVER'S SIDE DOOR. MY WIFE OPENED THE SLIDING DOOR AND I STARTED THE VAN AT THE EXACT MOMENT SHE PLACED HER FOOT ON THE STEP. IT RETRACTED, PULLING HER OPEN FOOTT INTO THE SMALL STEP OPENING UNTIL THE STEP JAMMED. THE STEP KEPT PULLING ON HER FOOT UNTIL I TURNED OFF THE IGNITION WITH THE FRONT OF HER HER FOOT AND TOES JAMMED INTO THE OPENING. I HAD TO PUSH HARD DOWN ON THE STEP TO RELEASE HER FOOT SINCE THE OPENING OF THE STEP WAS PRESSED HARD AGAINST THE TOP AND FRONT OF HER FOOT. IF SHE HAD BEEN BAREFOOT OR HAD IT BEEN A CHILD'S FOOT, TOES COULD BE AMPUTATED OR THE FOOT CRUSHED AND PERCENT INJURY COULD OCCUR. SHE SUFFERED PAIN AND BRUISING BUT NO PERMANENT INJURY MAINLY BECAUSE OF THE THICK SOLE ON HER SANDLE HELPED STOP THE STEP FROM RETRACTING.  AIRSTREAM LATER ADDED A MAGNETIC SWITCH IN LATER MODELS  THAT PREVENTS THE STEP FROM RETRACTING IF THE DOOR IS OPEN BUT HAS NEITHER ISSUED A RECALL OR WARNED CUSTOMERS OF EARLIER MODELS THAT DO NOT HAVE THIS SWITCH OF THIS DEFECT THAT COULD CAUSE PAINFUL AND PERMANENT INJURY.     THE VEHICLE WAS STATIONARY, PARKED IN A PUBLIC SPACE, WHEN THE EVENT OCCURRED.",
        "vin": "WDPF4CC7B55"
    }
]