[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS DEVELOPED A TRANSMISSION PROBLEM IN THE MECHATRONIC UNIT.  CAR GIVES A GEARBOX MALFUNCTION DISPLAY IN THE CAR.  REVERSE WILL NOT WORKING AND THE CAR WILL REPEATEDLY GO INTO NEUTRAL AT ANY SPEED. SOMETIMES THEN IT WILL JERK BACK INTO GEAR VERY VIOLENTLY.",
        "vin": "WAUBGAFL5BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265330,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS KNOWN FOR THE TRANSMISSION ISSUES THAT CAN BE EXTREMELY DANGEROUS AT TIMES DUE TO THE VEHICLE MAKING SUDDEN AND UNEXPECTED MOVEMENTS.",
        "vin": "WAUBGBFL7BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181609,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION BLEW UP ON THE HIGHWAY AT CRUISING SPEED. HAS TO GET A TOW AND PAY 12000 FOR A NEW TRANSMISSION",
        "vin": "WAUBGAFL1BA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11081315,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS HAVING JERKY SHIFTING WHENEVER THE VEHICLE IS DRIVER, ESPECIALLY ONCE THE ENGINE GETS HOT. I HAVE HAD FELT THE CAR JERK FORWARD A COUNTLESS AMOUNT OF TIMES AND HAVE GOTTEN WHIPLASH A COUPLE TIMES WHERE I'VE BEEN IN PAIN. TRANSMISSION ON MY AUDI S4 IS GIVING THE SAME ISSUES AS MANY OTHERS HAVE ENCOUNTERED ON AUDIZINE.COM AND AUDIWORLD.COM, WITH THE SAME SYMPTOMS. AUDI NEEDS TO RECTIFY THIS ISSUE AND DO A RECALL ON ALL B8/B8.5 S4 VEHICLES!",
        "vin": "WAUKGAFL5BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071676,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2011 S4 STARTED GETTING THE \"TRANSMISSION MALFUNCTION CONTINUE DRIVING\" LIGHT AT ABOUT 40,612 MILES. AT THE SAME TIME MY VEHICLE WOULD JERK WHEN STOPPING AND ACCELERATION. WHEN SHIFTING DOWN THE GEARS MAKE A CLUNKING NOISE SPECIALLY FROM 3RD AND 2ND GEAR. I WAS ABLE TO USE MY EXTENDED WARRANTY THAT I BOUGHT BECAUSE AUDI DIDN'T WANT TO COVER MY VEHICLE. AUDI SERVICE ADVISORS RECOMMEND CHANGING THE MECHATRONIC AND CIRCUIT BOARD BUT MY WARRANTY ONLY AUTHORIZED THE CIRCUIT BOARD. MY VEHICLE STILL JERKS WHEN STOPPING AS IT DOWNSHIFTS AND WHEN I ACCELERATE FROM A STOP.",
        "vin": "WAUKGBFLXBA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067240,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY AT 25 MPH, CAR RANDOMLY SHOWS 'GEARBOX MALFUNCTION' AND 'TPMS' SIMULTANEOUSLY. CAR DROVE IN LIMP MODE FOR A FEW MINUTES UNTIL I WAS ABLE TO COME TO A STANDSTILL AND PUT IT IN PARK AND TURN IT BACK ON TO DRIVE. 'TMPS' SIGN IS STILL SHOWING. POSSIBILITY OF BEING A MECHATRONIC ISSUE, WHICH IS VERY WELL KNOWN AS AN ISSUE WITH THE 2010+ AUDI S4S.",
        "vin": "WAUKGAFL5BA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065848,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS EXITING OFF OF THE INTERSTATE AND THE CAR BEGAN TO SPUTTER. I HAD TO CUT 3 CARS OFF TO PULL ONTO TO THE SHOULDER, WHERE THE CAR CONTINUED TO LOSE POWER AND EVENTUALLY DIED. A GEARBOX MALFUNCTION WARNING LIGHT CAME ON, BUT SAID IT WAS STILL SAFE TO DRIVE. I WAS ABLE TO GET ME CAR INTO PARK AND START . AFTER SITTING FOR A FEW MINUTES I WENT ON MY WAY, HOWEVER, THE CAR SPUTTERED AGAIN OUT OF 1ST GEAR  BUT SMOOTHED OUT ONCE I GOT GOING. THE LIGHT REMAINED ON THE REMAINDER OF THE TRIP BUT DIDNT COME BACK ON THE NEXT MORNING. I CALLED AUDI USA TO EXPLAIN WHAT HAPPENED AND THEY ACTED LIKE THEY NEVER HEARD OF SUCH A THING HAPPENING AND SAID IT WAS OKAY TO DRIVE. I HAVE ONLY HAD THIS CAR FOR 6 MONTHS AND THAT GEARBOX MALFUNCTION HAS NOW HAPPENED 3 TIMES, THE LATEST OF WHICH ALMOST CAUSED AN ACCIDENT. I HAVE CALLED A COUPLE MECHANICS, INCLUDING A LOCAL AUDI DEALERSHIP, AND HAVE BEEN INFORMED THAT ITS A BAD MECHATRONICS UNIT  AND THAT IT IS EXTREMELY COMMON FOR MY PARTICULAR YEAR, MODEL AND TYPE (THERE IS A TSB FOR IT). WORST OF ALL, IT WILL COST ME $5000 + TO REPAIR. I BOUGHT THIS CAR 6 MONTHS AGO FROM A LARGE, WELL RESPECT DEALERSHIP AS A CERTIFIED PRE-OWNED, WITH 75,000 MILES. I ALSO PURCHASED AN EXTENDED WARRANTY THAT WILL NOT COVER IT. IM NOT SURE WHAT TO DO.",
        "vin": "WAUBGAFLXBA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015337,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UNDER NORMAL CONDITIONS (~30 MPH, CITY STREET) AND THE DSG AUTO TRANSMISSION SLIPPED FROM GEAR AND GAVE A WARNING THAT THERE WAS A MALFUNCTION, NO REVERSE GEAR AVAILABLE.  AFTER DRIVING TO THE NEAREST PARKING LOT TO STOP AND TRY TO DIAGNOSE, FOUND RESEARCH THAT STATED THE MECHATRONIC UNIT IN THESE TRANSMISSIONS ARE PRONE TO FAIL.  IT APPEARS THAT I LOST HALF OF MY GEARBOX.  R, 2, 3, 4, 6.  AFTER THE CAR WAS ABLE TO SIT OVERNIGHT, THE ISSUE APPEARED TO GO AWAY BY ITSELF, BUT A FEW DAYS LATER, THE ISSUE HAPPENED AGAIN. I WAS DRIVING ABOUT 45 MPH ON A CITY ROAD.    SAME EXACT ISSUE, LOST HALF OF THE GEARBOX.  I THEN GOT HOME AND IMMEDIATELY ORDERED PARTS TO ATTEMPT TO RECTIFY AND PREVENT ANY FURTHER DAMAGE FROM HAPPENING TO THE TRANS.  AND THEN AGAIN, JUST THE NEXT DAY, IT HAPPENED AGAIN. THIS TIME WHILE DRIVING ~70 MPH ON THE HIGHWAY. THE VEHICLE JUST GAVE UP ALL POWER AND INSTANTLY DROPPED TO ABOUT 55-60 MPH ,IN MORNING COMMUTER TRAFFIC, DUE TO BEING IN A STEEP CANYON.  IT TOOK A MOMENT BEFORE THE CAR FOUND A GEAR AND GAINED POWER AGAIN.  I LIMPED THE CAR TO WORK AND PARKED SOMEWHERE WHERE I CAN EASILY MOVE THE CAR IF THE TRANSMISSION IS STILL STUCK WITHOUT HALF OF THE GEARS.",
        "vin": "WAUKGAFL7BA"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971673,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "GEARBOX MALFUNCTION WARNING AND THE TPMS MALFUNCTION CAME ON AT SAME TIME. CONTINUED TO DRIVE IN LIMP MODE FOR ABOUT 1 MILE AND THE CAR SHUT COMPLETELY OFF. START THE CAR BACK UP AND STILL SHOWING WARNINGS. GET IT HOME AND ATTEMPT TO PUT INTO REVERSE AND THE CAR WON'T ENGAGE. I JUST HAPPENED TO START THE CAR AGAIN AND ALL LIGHTS WERE GONE. CAR WENT INTO ALL GEARS, DROVE FINE, AND GOT IT TO THE DEALER. TWO HOURS LATER I GET IN TO GO TO THE STORE AND AS SOON AS I SHIFT INTO D, THE TPMS AND GEARBOX MALFUNCTION LIGHT FLASH UP TELLING ME I HAVE NO REVERSE AND I'M STILL GOOD TO DRIVE. SO I DECIDE TO DRIVE DOWN THE STREET AND SEE WHAT THE ISSUE IS. AS SOON AS THE CAR WENT TO SHIFT FROM 1ST TO 2ND IT SKIPPED, REVVED IN NEUTRAL FOR ABOUT 2 SECONDS THEN DROPPED HARD INTO 3RD GEAR. THE NEXT MORNING I WENT TO DRIVE THE CAR AND DROVE AROUND THE NEIGHBORHOOD WITH NO PROBLEM - NO ERROR MESSAGE, NO FAULTY SHIFTING, NO JERKING OR ANYTHING. SO I DECIDED TO RUN TO THE STORE ABOUT 4 MILES AWAY AND SEE HOW IT HELP UP. I MADE IT TO THE STORE AND HALFWAY BACK BEFORE BOOM - IT HAPPENED AGAIN. CAR WILL START IN 1ST GEAR FINE, WENT SHIFTING INTO 2ND IT SLIPS INTO NEUTRAL FOR ABOUT 2-3SEC THEN DROPS ABRUPTLY INTO 3RD, WHEN YOU HAVE ENOUGH SPEED IT DOES THE SAME THING TRYING TO SHIFT INTO 4TH - SKIPS AND DROPS INTO 5TH, SAME THING INTO 6TH - SLIPS OUT OF 5TH AND DROPS HARD INTO 7TH. SLOWING DOWN WAS NOT A HUGE PROBLEM AS LONG AS YOU HAVE PLENTY OF ROOM TO TAKE IT EASY. IF YOU SLOWED TO FAST THE GEARS WOULDN'T KEEP UP AND IT WOULD JERK VERY HARD. THIS IS A SERIOUS MATTER SINCE IT IS A SYSTEM FACTORY FAILURE WITH THE DSG UNIT SIMPLE AS THAT. REASON WHY I AM CONTACTING THIS AGENCY AS THE CAR SHUT OFF ON ME WHILE YOU WERE DRIVING IT IN THE MIDDLE OF THE HIGHWAY AND I COULD HAVE BEEN HIT/KILLED THE FIRST TIME IT HAPPENED.",
        "vin": "WAUBGAFL5BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/05/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938546,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DEC 5 2016, WHILE PULLING OUT OF MY DRIVEWAY IN ROUTE TO A SCHEDULED SERVICE APPOINTMENT AT AUDI OF ASHEVILLE, MY 2011 AUDI S4 LURCHED AND SEVERAL WARNINGS CAME UP INCLUDING \"DSG FAILURE, NO REVERSE, TPMS WARNING\", FOLLOWED BY \"YOU MAY CONTINUE TO DRIVE\".  WITHIN 5 MILES AND AT A SPEED OF APPROX 35 MPH THE VEHICLE SUFFERED A CATASTROPHIC LOSS OF DRIVE AND CAME TO A STOP IN A TWO LANE ROAD, THE ENGINE WAS STILL RUNNING, BUT NO CONNECTION WITH THE REST OF THE DRIVE-TRAIN WAS EVIDENT.  I BELIEVE THE \"MECHATRONICS\" CONTROL UNIT FAILED CAUSING TOTAL LOSS OF DRIVE AND UNCONTROLLED, UNSYNCED GEAR CHANGES.     I WAS APPROX 5 MILES FROM BEING ON AN INTERSTATE WITH A 6% GRADE.  VEHICLE IS ONE OWNER, ORDERED AND SERVICED EXCLUSIVELY BY AUDI, 70000 MILES, NOT ABUSED.  REQUIRES COMPLETE TRANSMISSION REPLACEMENT, WITH THE NOTED EXCEPTION OF THE TRANSMISSION THERE WAS NOTHING MECHANICALLY WRONG WITH THE REST OF THE VEHICLE.",
        "vin": "WAUKGAFL8BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897826,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 49K MILES THE CAR WOULD SOMETIMES LURCH BACKWARDS WHEN IN REVERSE OR GOING FROM REVERSE TO PARK.  TOOK INTO MECHANIC.  NO DIAGNOSTIC CODES SHOWED UP.  AROUND 60K MILES THE CAR OVERHEATED.  AUDI STATED IT NEEDED A NEW THERMOSTAT WHICH WAS AROUND $1000.  DROVE THE CAR ACROSS COUNTRY FROM CA TO CO.  AROUND 62K MILES CAR WENT INTO LIMP MODE AND WOULD NOT GET OUT OF 1ST OR 2ND GEAR.  \"GEARBOX MALFUNCTION\" WARNING CAME ON.  STATED NOT TO GO INTO REVERSE.  DROVE HOME SLOWLY.  NEXT MORNING ALL WARNING LIGHTS WERE OFF.  TOOK TO MECHANIC.  NO PROBLEMS COULD BE FOUND.  MAY 2016 AT 69K MILES CAR WENT INTO LIMP MODE AGAIN.  COULDN'T GET RPMS UP.  RESET CODES USING DIAGNOSTIC TOOL.  DROVE FROM UTAH TO CO.  CAR WENT INTO LIMP MODE PROBABLY 40 TIMES ON I-70.  CAR WOULD LURCH FORWARD.  MADE IT TO DEALER (PRESTIGE IN LAKEWOOD, CO).  MECHATRONICS FOUND TO BE FAULTY AND CAR IN NEED OF ENTIRELY NEW TRANSMISSION.  COST $12,000.  DEALERSHIP 'PAID' $8000.  I PAID $4000.  THIS SEEMS TO BE A COMMON PROBLEM WITH THIS MAKE/MODEL/YEAR.",
        "vin": "WAUBGAFL6BA"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2016",
        "dateOfIncident": "04/19/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860407,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DSG MECHATRONIC FAILURE. WAS REPLACED UNDER CPO WARRANTY. HOWEVER PROBLEM PERSISTS. WHILE DRIVING CAR GOES INTO NEUTRAL WITH TPMS + GEARBOX MALFUNCTION. THIS IS A KNOWN PROBLEM WITH AUDI S4 2010 AND 2011.",
        "vin": "WAUBGAFL7BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "01/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823972,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE SUFFERS FROM A FAULTY MECHATRONICS UNIT, CAUSING THE CAR TO MIS-SHIFT AND SURGE WHILE DRIVING, OR FAIL TO MOVE FORWARD WHEN STOPPED IN TRAFFIC IN \"D\" DRIVE, DUE TO PARKING BRAKE DRIVE-SELECT MALFUNCTIONS. IN THESE CASES THE CAR MUST BE TURNED OFF, IN TRAFFIC IN ORDER TO MOVE FORWARD AGAIN. THIS TECHNIQUE HAS WORKED SO FAR BUT I AM AFRAID THIS WILL NOT WORK EVENTUALLY, AND BECOME A SAFETY ISSUE ON THE ROADWAY.",
        "vin": "WAUBGAFLXBA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/20/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785293,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE - EXCESSIVE OIL CONSUMPTION (1QT REFILL IS REQUIRE FOR EVERY 750MILES).  DSG TRANSMISSION ' GETTING GEARBOX MALFUNCTION, YOU CAN CONTINUE TO DRIVE ON DASHBOARD. THIS IS DUE TO P179E - DRIVE RANGE SENSOR ELECTRICAL ERROR.",
        "vin": "WAUBGAFL6BA"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "09/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767556,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING MY CAR ON A GEARBOX MALFUNCTION WARNING APPEARED BUT SAID I COULD CONTINUE DRIVING. AFTER DRIVING THE MESSAGE AND SERVICE LIGHT EVENTUALLY WENT OFF WITH EVERYTHING GOING BACK TO NORMAL. THE CAR APPEARS TO HAVE A VERY COMMON MECHATRONIC UNIT ISSUE THAT IS PART OF THE FAULTY DSG THAT AUDI HAS PUT IN THE B8 S4 MODEL.",
        "vin": "WAUKGAFL9BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767570,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD EXHIBIT STRANGE SHIFTING BEHAVIOR IN LOW GEARS. WHEN UPSHIFTING OR DOWNSHIFTING FROM 1-2-3 AND VICE VERSA THE TRANSMISSION WOULD SOMETIMES HESITATE OR SHIFT INAPPROPRIATELY. AUDI DEALERSHIP UPDATED SOFTWARE AND CHECKED THE PROBLEM NUMEROUS TIMES. THEY COULD NOT FIND ANY PROBLEMS NOT ANY ERROR CODES. PROBLEM WOULD COME AND GO USUALLY WHEN IT WAS HOT OUTSIDE. A LITTLE OVER A YEAR (SEPT 2015) CAR HAS AGAIN BEEN ODDLY SHIFTING IN LOW GEARS AND EVEN REVVING TO HIGH RPMS BEFORE DOWNSHIFTING IN AUTOMATIC MODE. CAR FINALLY THREW AND ERROR CODE SAYING GEARBOX MALFUNCTION AND CAR WENT INTO LIMP MODE. THE TRANSMISSION COULD NOT FIND THE RIGHT GEARS TO SHIFT. CAR HAS BEEN EXHIBITING SYMPTOMS OF MECHATRONIC UNIT FAILURE FOR OVER A YEAR NOW.",
        "vin": "WAUBGAFL9BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764211,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH/CLUNKING SHIFTING IN STOP AND GO TRAFFIC. CAR WILL LURCH FORWARD, OR LACK POWER WHEN ACCELERATING.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670583,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ACCELERATING, AFTER LEAVING A RESTAURANT, INTO TRAFFIC. I RECEIVED THE \"DSG MALFUNCTION LIGHT\" AND SUDDENLY AT ABOUT 20MPH MY LURCHED FORWARD AND FAILED TO RESPOND TO  THE THROTTLE AND SHUT OFF IN TRAFFIC. CAR RESTARTED AFTER ABOUT 30 SECONDS BUT DEFINITELY NOT SOMETHING THAT SHOULD GO WITHOUT NOTICE. IF I WAS ON THE INTERSTATE AND THROTTLE WENT OUT SITUATION COULD HAVE BEEN MUCH WORSE.  *TR",
        "vin": "WAUBGAFL6BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670345,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS CRUISING AT APPROX. 55MPH ON MY WAY TO WORK. I HAD NO SYMPTOMS OF ANYTHING PRIOR TO THE TRANSMISSION FAILURE. SUDDENLY THE CAR STARTED VIBRATING AND DECELERATING AS IF I HAD A FLAT TIRE. I MADE AN EMERGENCY MERGE INTO THE CENTER MEDIAN AND WAS LUCKILY NOBODY REAR ENDED ME.  AFTER INSPECTION OF MY TIRES WHICH WERE OK I GOT BACK IN CAR. D OR R WOULD NOT WORK. THE CAR WOULD NOT MOVE.",
        "vin": "WAUKGBFL4BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2014",
        "dateOfIncident": "08/14/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668609,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTS CLUNK WHEN COMING TO A STOP FROM 3, 2, TO 1, AND SHIFTS NOISILY AND ABRUPTLY PARTICULARLY IN STOP AND GO TRAFFIC, OR IN EXTREME TEMPERATURES IE MIDDLE OF SUMMER ON A HOT DAY.  *TR",
        "vin": "WAUBGAFLXBA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "11/29/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661438,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECENTLY REPLACED MY 2ND THERMOSTAT (1ST WAS 11/2012 AND THE 2ND WAS 11/24/2014), NOT UNDER WARRANTY, AND RETURNED MY CAR TO ME AFTER HOLDING ONTO MY CAR FOR TWO WEEKS. I WAS TOLD THAT MY VEHICLE CHECKED OUT OKAY VIA A DIAGNOSTIC AND MECHANICS REVIEW. I DROVE MY S4 FOR TWO DAYS AND WHILE DRIVING, I RECEIVED AN INDICATOR WARNING THAT READ, GEARBOX MALFUNCTION REVERSE NOT AVAILABLE, YOU CAN STILL DRIVE. I THEN NOTICED THAT THE CAR BEGAN TO VIOLENTLY BUCK WHEN I ACCELERATED. THE CAR SURGED FORWARD WHILE DRIVING IN TRAFFIC WHICH WAS ALARMING TO BOTH MY 10YR OLD DAUGHTER AND I. OTHER CARS HAD TO DRIVE AROUND US AND ONE VEHICLE ALMOST HIT MY CAR IN THE REAR. I CONTINUED TO DRIVE AT A LIMITED SPEED AND IMMEDIATELY, THE TPMS WARNING INDICATOR LIT UP AND THE CAR LOST SPEED. THE CAR WOULD BARELY MOVE AT 10 MPH AND I LIMPED BACK TO A RELATIVES UNDERGROUND PARKING GARAGE. ONCE I PARKED I COULD NOT GET THE CAR TO REVERSE OUT OF THE PARKING SPACE. I CALLED AUDI AND THEY STATED THAT I WOULD HAVE TO TOW THE VEHICLE TO THE NEAREST AUDI SERVICE CENTER. THE VEHICLE WAS TOWED TO AUDI AND I AM WAITING TO HEAR THE RESULTS OF THEIR FINDINGS. I HAVE ALREADY INVESTED OVER $1,750 IN VEHICLE REPAIRS (THERMOSTAT AND REAR BRAKES/ROTORS). I DO NOT WANT TO CONTINUE TO INVEST MONEY INTO THIS VEHICLE PIT. AUDI NEEDS TO RECALL THESE FAULTY PARTS (THERMOSTAT AND MECHATRONIC) AND STAND BEHIND THEIR PRODUCT. I'VE SEEN NUMEROUS COMPLAINTS IN FORUMS AND ON THIS SITE REFERENCING THESE SAME ISSUES.  *JS",
        "vin": "WAUKGAFL0BA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641193,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A WELL KNOWN ISSUE WITH THE AUDI 3.OT ENGINE'S PLASTIC THERMOSTAT FAILING! I WAS DRIVING AND THE THERMOSTAT FAILED CAUSING THE ENGINE TEMP TO SKYROCKET TO \"H\"! I DROVE HOME BECAUSE I WAS CLOSE ENOUGH WITH THE HEATER ON HIGH. THEY FLATBEDED MY CAR ON 9/29/14 FROM MY DRIVEWAY TO THE AUDI DEALERSHIP. DEALERSHIP DETERMINED IT WAS A FAILED THERMOSTAT AND REPLACED IT WITH ANOTHER \"PLASTIC THEMOSTAT.\" THE SECOND THERMOSTAT FAILED 2 DAYS LATER. I JUST TOOK THE CAR TO THE AUDI DEALERSHIP AGAIN THIS MORNING 10/3/14 TO HAVE IT REPLACED AGAIN! THIS PART NEEDS REENGINEERED BECAUSE ITS PLASTIC AND WILL FAIL AT SOME POINT. THANK GOD I WASNT OUT OF STATE WITH MY FAMILY AND IT FAILED BECAUSE I WOULD HAVE BEEN STRANDED!   *TR",
        "vin": "WAUBGAFL7BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "06/19/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625884,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY DRIVE A 2011 AUDI S4 DSG AUTOMATIC VEHICLE. THE CAR BUCKS INTERMITTENTLY WHEN GOING FROM STOP TO 1ST-2ND-3RD GEAR OR VICE VERSA. IT USUALLY OCCURS IN SLOW TRAFFIC AND WHEN THE CAR/TRANSMISSION HAS BEEN ON FOR AWHILE. THE CAR WAS TAKEN TO AUDI FOR REPAIR AND THE SOFTWARE AND ADAPTABILITY WAS UPDATED. THIS HELPED SMOOTH OUT THE SHIFTS BUT THE CAR STILL CONTINUED TO BUCK AT TIMES (ESPECIALLY IN DYNAMIC MODE), THE CAR WAS TAKEN BACK TO AUDI AGAIN, BUT THE TECHNICIANS DID NOT FIND ANY PROBLEMS WHEN DRIVING THE CAR. THE PROBLEM SEEMS TO BE A FAULTY MECHATRONIC UNIT WHICH IS KNOWN TO FAIL IN EARLY 2010-2011 S4'S. MULTIPLE PEOPLE HAVE GONE THROUGH THE SAME PROBLEMS UNTIL THIS UNIT WAS REPLACED.  AUDI OF AMERICA HAS BEEN CONTACTED AND DID NOT OFFER ANY SOLUTION AT THIS TIME.  *TR",
        "vin": "WAUBGAFL9BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558946,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT APPROXIMATELY 40 MPH, A WARNING MESSAGE CAME UP DO THE DASHBOARD SAYING \"GEARBOX MALFUNCTION, REVERSE GEAR NOT AVAILABLE, YOU CAN STILL DRIVE\".  AT THE SAME TIME, THE TPMS WARNING INDICATOR CAME ON.  THE CAR BEGAN TO LOOSE SPEED AND WOULDN'T RESPOND TO THE THROTTLE, AFTER A FEW SECONDS IT WOULD SURGE FORWARD, AND THEN LOOSE SPEED AGAIN.  THIS REPEATED A FEW TIMES, UNTIL I CAME TO A STOP AT AN INTERSECTION.  AT THE INTERSECTION, I TURNED OFF THE IGNITION AND RESTARTED THE CAR.  THE CAR BEHAVED NORMALLY FOR ABOUT 25 MINUTES OF DRIVING.  THEN ON THE FREEWAY AT ABOUT 65 MPH THE PROBLEM RECURRED.  I WAS ABLE TO LIMP TO THE NEAREST AUDI DEALERSHIP, WHERE THE CAR IS NOW BEING EVALUATED.  I'M VERY CONCERNED ABOUT THIS ISSUE, BECAUSE AT TIMES I WAS UNABLE TO MAINTAIN THE SAME SPEED AS THE FLOW OF TRAFFIC AND AN ACCIDENT COULD HAVE OCCURRED.  *TR",
        "vin": "WAUBGAFL9BA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "10/09/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481521,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE CONCERNS  MY AUDI 2011 S4, A CAR THAT I TOOK DELIVERY ON IN APRIL, 2011. I HAVE HAD NUMEROUS PROBLEMS WITH THE CAR SINCE THE DELIVERY, HOWEVER, IT IS A SAFETY CONCERN THAT HAS CAUSED  THIS SPECIFIC FILING.    THE PROBLEM SEEMS TO BE WITH THE DSG TRANSMISSION.  ON OCCASION, THE CAR WILL STRUGGLE AND \"BUCK\" IN LOW GEARS AT A VERY SLOW SPEED (OR FROMA COMPLETE STOP) UPON ACCELERATION.   THIS DOES NOT HAPPEN OFTEN BUT IT HAS HAPPENED SEVERAL TIMES SINCE TAKING DELIVERY. I HAVE TRIED ADDRESSING THE PROBLEM WITH AUDI CORAL SPRINGS IN THE PAST BUT BECAUSE I CANNOT DUPLICATE THE PROBLEM, THEY ARE UNABLE TO HELP.  CONSEQUENTLY,  I HAVE NOT BEEN ABLE TO ALWAYS DRIVE THE CAR IN THE MANNER THAT I WOULD LIKE TO.     HOWEVER, ON OCTOBER 9, 2012, THE PROBLEM HAPPENED  AGAIN, ONLY THIS TIME, IT OCCURRED WHILE ATTEMPTING TO MERGE INTO TRAFFIC. I WAS IN A MERGE LANE, TRAVELING APPROX 3-5 MPH AND WHEN THE OPPORTUNITY AROSE, I ACCELERATED INTO THE TRAFFIC. AT THAT PRECISE MOMENT,  THE CAR BUCKED VIOLENTLY (AS IT HAS DONE IN THE PAST) AND I HAD TO LIFT OFF THE THROTTLE TO CORRECT THE ISSUE.     LET ME EXPRESS THAT I IN NO WAY AM ATTEMPTING TO CAUSE PROBLEMS FOR AUDI. I AM ONLY CONCERNED FOR MY SAFETY. ITS QUITE CONCEIVABLE THAT WHEN MY CAR HAS THIS TROUBLE WHILE MERGING INTO TRAFFIC THAT I COULD GET HIT FROM BEHIND AS I  MUST IMMEDIATELY LIFT OFF THE ACCELERATOR TO RESOLVE THE ISSUE.  *TR",
        "vin": "WAUBGAFLXBA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/27/2012",
        "dateOfIncident": "03/23/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A BRAND NEW 2011 AUDI S4 SEDAN AND HAD A SUSPENSION AND/OR ALIGNMENT ISSUE WHICH CAUSED THE FRONT DRIVER SIDE TIRE BLOW OUT ON THE HIGHWAY, RESULTING IN TEMPORARY LOSS OF CONTROL. I GOT THREE PROFESSIONAL OPINIONS (INCLUDING THAT OF A CERTIFIED AUDI TECHNICIAN) AND ALL AGREED THIS WAS CAUSED BY AN ISSUE WITH THE SUSPENSION, CAUSING THE INSIDE EDGE OF THE TIRE TO WEAR PREMATURELY AND SPLIT OPEN. THIS INSTANCE IS ABNORMAL BECAUSE THE TREAD WAS WELL ABOVE THE TREADWEAR INDICATORS. THIS VEHICLE HAS ALWAYS BEEN SERVICED ACCORDING TO THE FACTORY SPECIFIED SERVICE PLAN FOR MY VEHICLE, BY AUDI CERTIFIED TECHNICIANS. THIS PLAN SPECIFICALLY STATES THAT THE TECHNICIANS ARE SUPPOSED TO INSPECT TIRES FOR WEAR AND DAMAGE AT THE 25 THOUSAND MILE SERVICE (TO ENSURE SAFETY, RELIABILITY, AND VALUE OF THE VEHICLE). HOWEVER, MY SERVICE ADVISORS FAILED TO NOTIFY ME OF THE ABNORMAL TIRE WEAR, AND THE POTENTIAL SAFETY RISK. HAD THIS ISSUE BEEN BROUGHT TO MY ATTENTION, THIS INCIDENT COULD HAVE BEEN AVOIDED. BOTH FRONT TIRES SHOWED THIS ABNORMAL WEAR, SO I HAVE SINCE REPLACED ALL FOUR TIRES. HOWEVER, IF THIS SUSPENSION PROBLEM IS NOT SOLVED, THE NEW TIRES WILL ALSO WEAR ABNORMALLY AND SPLIT OPEN, PUTTING LIVES IN DANGER. THE VEHICLE IS AT THE AUDI DEALER WAITING FOR THE ISSUE TO BE IDENTIFIED AND RESOLVED.  *TR",
        "vin": "WAUBGAFL7BA"
    }
]