[
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218424,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE SOLE OWNER OF A 2011 AUDI S5 CABRIOLET.   CHIEF COMPLAINTS:  ENGINE PROBLEM,.WARNING LIGHT SHUT DOWN ENGINE,GEARBOX MALFUNCTION,TPMS MALFUNCTION,. TRANSMISSION INTERMITTENTLY SLIPPING AND WOULD NOT GO IN REVERSE,TAKATA AIRBAG NOT CHANGED BY KEYES AUDI COMPLAINT FOR LEMON LAW WITH AUDI CORP.  CAR IS INOPERABLE REMAINS IN AUDI DEALERSHIP PENDING OUTCOME PER AUDI CORP.DIAGNOSTIC WORK ORDER REPAIR ESTIMATE,$5, 800. CAR HAD THE ENGINE LIGHT ALERT ON SINCE I BOUGHT IT.  DEALSHIPS SAID \"IT'S JUST A SENSOR,PROBLEM STILL EXISTS.  IN FACT DRIVING ON FREEWAY  \"DO NOT DRIVE\", IMMEDIATELY BROUGHT TO KEYES AUDI.THERMOSTAT IN THE ENGINE.TOLD THE CAR IS NO LONGER IN WARRANTY, HOWEVER FIXED NO CHARGE, \"THIS SHOULD NOT HAVE HAPPENED.\"BROUGHT CAR IN FOR AIRBAG CHANGE AT KEYES AUDI,  THE GEARBOX MALFUNCTION, TPMS. WARNINGS WERE ILLUMINATED. TRANSMISSION INTERMITTENTLY SLIPS OR DOESN'T WORK. MY SON TOLD \"DO NOT DRIVE THE CAR, THE COMPUTER SYSTEM CAN GO DOWN AND DISABLE THE CAR AS YOU ARE DRIVING\" CAR NOT DRIVEN SINCE APRIL. TOWED TO AUDI OF CALABASAS ON  MAY 14, 2019, FOR DIAGNOSTIC TESTING TO DETERMINE PROBLEM. TOLD AIRBAG RECALL NEEDS TO BE DONE. SAID IT WAS DONE AT KEYES AUDI. TOLD ON SENSOR CHANGED.  ATTACHED IS THEIR REPAIR ESTIMATE OF $5080. CAR HAS 61225 MILES.CAR REMAINS IN AUDI OF CALABASAS AWAITING DECISION FROM AUDI CORPORATE.  ORIGINAL PRICE OF CAR $63,530. ALL WORK INVOICES WERE SEND TO AUDI CORP.ATTACHED ARE WORK INVOICES RELATED TO ABOVE COMPLAINTS.   THIS CAR IS A HAZARD AND A RIPOFF!   I AM A SENIOR CITIZEN AND SHOULD NOT HAVE TO BE IN DANGER OF THIS CAR.  YOUR HELP IS NEEDED.",
        "vin": "WAUCGAFH5BN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165984,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONAL LACK OF PROPULSION WHEN ACCELERATOR PEDAL IS DEPRESSED, LOSS OF GEAR WHILE MOVING SLOWLY (FROM A STOP).  IN EITHER CASE, THE CAR MAY BE STUCK IN AN INTERSECTION OR OTHERWISE ACT UNPREDICTABLY TO OTHER TRAFFIC.  REMEDY IS TO EITHER TAKE FOOT OFF ACCELERATOR TO RE-ENGAGE MULTIPLE TIMES, OR TURN CAR OFF AND BACK ON.    TRANSMISSION SHOWS ERROR (MALFUNCTION - YOU CAN CONTINUE DRIVING) WHEN THIS FAULT OCCURS.      VEHICLE IS IN EXCELLENT CONDITION., REGULARLY MAINTAINED, AND UNDER 40K MILES.",
        "vin": "WAUCGAFH3BN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150038,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I WENT ON A DRIVE, TO GET LUNCH, AFTER LEAVING LUNCH , WE HEADED HOME, I PULLED OUT ON TO THE HWY, AND THE AUDI,\"CHECK ENGINE\" \"NO REVERSE\" LIGHT LIT UP, AND THEN THE TPMS LIT UP, THE WARNING STATED I HAD LOST REVERSE, AND I COULD CONTINUE DRIVING. HOME WAS OVER 10 MILES AWAY, SO I CONTINUED TO DRIVE HOME.  I WAS TRYING TO MOVE IN TO THE TURN LANE , PRESSED THE GAS PEDAL, AND THE CAR SLOWED DOWN, I JAMMED THE PEDAL TO THE FLOOR TO AVOID BEING RUN OVER BY TRAFFIC. IT SLOWED DOWN MORE THEN SHOT OFF QUICKLY, AND THEN SLOWED DOWN AGAIN, I MADE IT TO THE TURN LANE, EVENTUALLY, BEING TOLD I WAS NUMBER ONE SEVERAL TIME FROM OTHER DRIVERS.  MY WIFE WAS WHITE AS A GHOST.  WE TURNED ON TO THE STREET GOING TOWARDS OUR HOME AND THE AUDI TOOK OFF LIKE NORMAL AND THEN THE SAME THING IT SLOWED DOWN THEN SHOT OFF SEVERAL TIMES, WE DIDN'T MAKE THE LIGHT, THE FIRST TIME, WE EVENTUALLY MADE IT HOME.  THE VEHICLE IS NOW AT AUDI CLEARWATER, THEY ARE FIXING A KNOW ISSUE WITH THE TRANSMISSION 7 SPD DSG. THE MECHATRONICS UNIT APPARENTLY WAS THE ISSUE.  THEIR IS A TSB # SB-10054213-2278 ON THIS ISSUE, BUT NO RECALL SO IT GETS ADDRESSED WHEN PEOPLE ALMOST DIE DRIVING THEIR VEHICLES.  MY VECHILE WAS IN WARRANTY WHEN THE TSB WAS ISSUED, BUT NOW IT'S NOT COVERED, THAT ALSO CONFUSES ME WHEN IT TO ME IS A SAFETY ISSUE, IF THE CAR HAD TOLD ME TO \"DISCONTINUE DRIVING\"  I WOULD HAVE PULLED OVER AND HAD IT TOWED, BUT IT CLEARLY STATED \"SAFE TO CONTINUE DRIVING\"  THE DSG UNIT HAS BEEN SERVICED PER THE AUDI REQUIREMENTS.",
        "vin": "WAUCGAFH9BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111108,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL NOTICE WAS ISSUED BY AUDI OVER 24 MONTHS AGO.  AUTHORIZED DEALERS CANNOT SOURCE PARTS TO COMPLETE REPAIR JEOPARDIZING SAFETY OF OUR DRIVERS.  DEALERS ARE NOT ABLE TO SCHEDULE OR EVEN FORECAST WHEN PARTS WILL BECOME AVAILABLE.  GIVEN THE LENGTH OF ELAPSED TIME AND POTENTIAL DANGER PRESENTED, THIS SITUATION IS UNACCEPTABLE.",
        "vin": "WAUVGAFH2BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058325,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - RECEIVED URGENT RECALL AUGUST 2017.  MULTIPLE CALLS TO THE DEALERSHIP AND AUDI USA HAVE NOT PROVIDE INFORMATION REGARDING 1) WHEN PARTS ARE AVAILABLE FOR MY URGENT RECALL NOTICE, AND 2) IS THE CAR SAFE TO CONTINUE TO DRIVE?  I UNDERSTAND THE SCALE OF THIS RECALL, HOWEVER ADDITIONAL INFORMATION IS NEEDED TO MAKE DECISIONS.",
        "vin": "WAUCGAFH9BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971077,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG IN MY CAR NEEDS TO BE REPLACED BUT AUDI HAS OFFERED NO TIMETABLE AS TO WHEN THIS MAY BE POSSIBLE. NO SOLUTION IS CURRENTLY AVAILABLE. I FIND IT DISCONCERTING TO BE DRIVING A CAR THAT HAS AN AIRBAG THAT COULD CAUSE SIGNIFICANT INJURY. UPDATED 10/10/2017*JS",
        "vin": "WAUVGAFH7BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949017,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 AUDI S5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUCGAFH8BN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948673,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE INSPECTING MY 2011 S5 AFTER PURCHASE I NOTICED THAT THE REAR WINDOW WAS DETACHING FROM THE TOP.  THE DEALER REPAIRED AS A WARRANTY REPAIR.  A FEW YEARS LATER THE TOP OF THE CONVERTIBLE ROOF ON THE INSIDE STARTED TO SAG.  I CAN'T PROVE THE DEALER WAS AT FAULT BUT THEY WERE THE LAST TO WORK ON THE CONVERTIBLE ROOF. THE REPAIR IS NOT WORTH THE REMAINING VALUE OF THE VEHICLE AND THE DEALER WILL NOT INSURE THE REPAIR MORE THAN A YEAR.  SO BE CAREFUL WITH THESE PARTS AND NOW MOST OF YOU KNOW THESE VEHICLES HAVE TAKATA AIRBAGS SUBJECT TO A RECALL WHICH AUDI HAS NOT PROVIDE A TIME TABLE FOR RESOLUTION.",
        "vin": "WAUVGAFH7BN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948679,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2014 I NOTICED THAT THE CARBON FIBER INSERT ON THE PASSENGER SIDE WAS PEELING OFF. THE DEALER REPLACED IT BUT THEN TOLD ME THEY REPAIRED IT BY ACCIDENT BECAUSE IT SHOULD NOT HAVE BEEN COVERED.  A FEW MONTHS LATER THE CARBON FIBER INSERTS IN THE BACK SEATS STARTED TO PEEL OFF.  AUDI COULD NOT EXPLAIN IT. I HAD TO TEAR THEM OFF BECAUSE THEY WERE SCRATCHING MY CHILDREN WHEN THEY SAT IN THE BACK SEAT.  I PERSONALLY REPLACE THE INSERTS AND NOTICED THAT THE INSERT AROUND THE MMI WAS ALSO STARTING TO PEEL.  SOMEONE SAID THAT UV RAYS AND HIGH HEAT COULD CAUSE THIS TO HAPPEN.  I AM NOT HAPPY WITH THE QUALITY OF THIS PRODUCT.",
        "vin": "WAUVGAFH7BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 AUDI S5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V078000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUVGAFH7BN"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946189,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO GET PARTS FOR FAULTY MSE TRANSMISSION CURRENTLY IN MY 2011.  AUDI UPGRADED BECAUSE OF KNOWN PROBLEMS TO NSY MODEL TRANSMISSION AND EXPECTS OWNER TO PAY EXPENSE.  THEY DID NOT AND HAVE NOT MAKE THE CUSTOMER/CONSUMER AWARE OF THIS UNTIL YOU FORCED TO TAKE IT IN FOR SERVICE DUE TO SENSORS AND LIMITED FUNCTIONALITY IN DRIVING CAPABILITIES.  VEHICLE HESITATES AND DROPS GEARS WHILE IN MOTION.  THIS OCCURRED ON A MAJOR HIGHWAY CREATING A HAZARDOUS EVENT, IN ADDITION THEY WILL ALSO CHARGE YOU FOR A DIAGNOSIS AND BOGUS SERVICE WHILE THEY ARE ALREADY AWARE THAT THE PARTS ARE NOT AVAILABLE FOR THAT TRANSMISSION. UPON RESEARCH I HAVE FOUND THIS IS NOT AN ISOLATED PROBLEM, OR DUE TO DRIVING, MILEAGE, WEAR AND TEAR, PREVIOUS OWNER, LACK OF WARRANTY OR WHATEVER ELSE THEY WANT TO COME UP WITH.  *TR",
        "vin": "WAUVGAFH8BN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "08/03/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892990,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE BEEN NOTIFIED BY AUDI THAT THE AIRBAG IN MY CAR NEEDS TO BE REPLACED BUT THEY HAVE OFFERED NO TIMETABLE AS TO WHEN THIS MAY BE POSSIBLE.  NO SOLUTION IS CURRENTLY AVAILABLE.  I FIND IT DISCONCERTING TO BE DRIVING A CAR THAT HAS AN AIRBAG THAT COULD CAUSE SIGNIFICANT INJURY.",
        "vin": "WAUVGAFH3BN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/03/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883889,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A USED AUDI S5 CABRIOLET. AFTER RESEARCHING THE VEHICLE AND NOTING SEVERAL POSTS ABOUT THE REAR WINDOW DETACHING FROM THE TOP AND HAVING A FRIEND WHO JUST HAD HIS A5 REPAIRED THIS WAS SOMETHING I WAS LOOKING FOR. IN MY INSPECTION OF THE VEHICLE I DID CONFIRM THAT THE TOP HAD ALREADY PULLED AWAY AT THE BOTTOM OF THE WINDOW. I POINTED THIS OUT TO THE SALESMAN AND THE DEALER AGREED TO FIX IT AT NO COST. WHILE I'M GETTING THIS FIXED, THIS IS TO DOCUMENT THAT THIS IS A WELL KNOWN ISSUE THAT AUDI SHOULD ADDRESS. THIS CAR IS IN IMMACULATE CONDITION EXCEPT FOR THE ONE ISSUE.",
        "vin": ""
    }
]