[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/22/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375789,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN THE RAIN WITH MY WIPERS ON, SET ON LOW WHEN THE PASSENGER SIDE WIPER EJECTED ITSELF AND THE WIPER ARM BROKE NEAR THE BASE. TO KEEP MY WINDSHIELD FROM BEING SCRATCHED I HAD TO TURN MY WIPERS OFF ALTOGETHER FORCING ME TO DRIVE IN THE UNSAFE CONDITION OF POOR VISIBILITY. THERE WERE NO SIGNS THAT THE ARM WAS ABOUT TO BREAK OR THE WIPER WAS ABOUT TO COME OFF, THEY DID SO VERY SUDDENLY.",
        "vin": "WA1DGAFE6BD"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362330,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I HEARD A THUMPING SOUND FROM MY BRAKES AND IT CAUSED MY BRAKES TO MALFUNCTION. AND MY STEERING IS ALSO GOT HARDENED A BIT.  IS THERE A RECALL CAMPAIN FOR MY 2011 Q7 CAR FOR BRAKE AND STEERING ISSUE?  I'VE FOUND OUT THAT 2012 2013 AND 2017 MODELS HAD RECALLS.",
        "vin": "WAUAGD4L3BD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354039,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BACK PANEL FOR BOTH DRIVER AND PASSENGER SEATS CAME OFF DUE SUMMER TEMPERATURE. NOW ELECTRICAL PANELS ARE EXPOSED IF KIDS JUST PULL OFF THE BACK PANEL.",
        "vin": "WA1LGAFE6BD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354037,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING ENGINE, AROUND 20 SECS WARNING COMES THAT RIGHT REAR BRAKE NOT WORKING, RIGHT REAR PARKING LIGHT NOT WORKING. BUT THERE IS NO ISSUE WITH BRAKE LIGHTS OR PARKING LIGHTS. PHYSICAL INSPECTION SHOWS IT WORKS JUST FINE.",
        "vin": "WA1LGAFE6BD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/28/2019",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204261,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE WIPER ARM HAS BROKEN 3 TIMES.  ARM AND BLADE FALL OFF WHEN THE WIPERS ARE OPERATING IN HIGH SPEED.",
        "vin": "WA1LGAFE1BD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163117,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW AUDI Q7 S-LINE IN 2011. MULTIPLE REPAIRS AND RECALLS DURING AND AFTER WARRANTY PERIOD. ELECTRICAL IS PARTICULARLY PROBLEMATIC. CHANGED FIRST SENSOR DOOR HANDLE IN 2014, UNDER WARRANTY. NOW, WITH JUST OVER 70,000, ALL FOUR HANDLES FAILED, HAD TO REPLACE NEW BATTERY AND ALL FOUR HANDLES, TOTAL COST OVER $2,500. CLEARLY A MANUFACTURER DEFECT AND IF YOU SEARCH YOU'LL FIND MULTIPLE COMPLAINTS ABOUT THE PROBLEM, SO I CALLED AUDI CUSTOMER SERVICE. THE CAR WAS ALWAYS DEALER-MAINTAINED AND REPAIRED, WITH ALL RECORDS, BUT THEY'VE BEEN \"RESEARCHING MY INQUIRY\" FOR OVER A MONTH NOW WITH NO DECISION. NOT WHAT I WOULD HAVE EXPECTED OF A \"PREMIUM\" CAR BRAND. RECOMMEND THEY ISSUE A TSB",
        "vin": "WA1DGBFE1BD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118338,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RECALL RUBBER BAND FIX IS INADEQUATE.  MY MODEL GOT REPAIRED LAST YEAR FOR THE RECALL.  THIS REPAIR IS INADEQUATE AND PUT MY FAMILY'S SAFETY AT RISK. THE GASOLINE MELTED THE RUBBER BAND AND LEAK.  WE STARTED SMELLING GASOLINE INSIDE OUR VEHICLE AND WHILE THE VEHICLE IS PARKED IN OUR GARAGE.",
        "vin": "WA1LGAFEXBD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110916,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE IGNITION SWITCH ISSUE: I WAS DRIVING ON THE HIGHWAY AT AROUND 70 MPH WHEN THERE WAS CLICK SOUND ACCOMPANIED BY LOSS OF POWER, BRAKES DIDN'T FUNCTION PROPERLY, STEERING WHEEL BECAME INCREASING HARD TO MANEUVER.  I WAS ABLE TO BRING TO A STOP BY THE SHOULDER.  I NOTICED THAT THE IGNITION SWITCH HAD GOT TURNED OFF.  I TURNED THE IGNITION AND THE CAR STARTING WORKING AGAIN.  VERY SCARY!",
        "vin": "WA1LGAFE2BD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045764,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPER ARM BROKE OFF FROM THE MOUNTING ASSEMBLY AT THE BASE.  CONDITIONS WERE MEDIUM RAIN. TEMPERATURE APPROXIMATELY 50 DEGREES (F).  DRIVING AT LEGAL HIGHWAY SPEED OF 55 MPH.  THERE WAS NO OBJECT COLLISION.  IT SIMPLY SNAPPED, LEAVING ONLY THE DRIVER WIPER FUNCTIONAL.",
        "vin": "WA1DGAFE4BD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HAS BEEN A LOT OF INCIDENT THAT AN AUDI Q7 RIGHT WIPER BLADE CAN SNAPPED OFF AND CAN HIT ANOTHER CAR OF PERSON WHILE DRIVING IN A HIGHWAY. I WAS DRIVING LAST NIGHT AND LUCKILY SLOWED DOWN ABOUT TO MAKE A TURN WHEN ALL OF A SUDDEN MY PASSENGER WIPER ARM JUST SNAPPED IN HALF. IF I WAS DRIVING FASTER AT THAT TIME, THAT COULD HAVE WENT FLYING AND HIT ANOTHER CAR BEHIND ME. THE WIPER ARM IS METAL AND THE END WHERE IT SNAPPED IS SHARP. WHEN I SEARCH THE INTERNET, IT SEEMS LIKE THIS IS A COMMON PROBLEM WITH THIS MODEL CAR AND AUDI IS NOT DOING ANYTHING ABOUT IT AND WAITING FOR SOMEONE TO GET HURT FIRST. FORUM THAT I FOUND OF SIMILAR INCIDENTS. HTTPS://WWW.AUDIWORLD.COM/FORUMS/Q7-DISCUSSION-112/PASSENGER-SIDE-WIPER-ARM-BROKE-COMPLETELY-OFF-2895850/",
        "vin": "VIN WA1DGAF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2017",
        "dateOfIncident": "05/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992466,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 AUDI Q7. WHILE DRIVING, THE CONTACT NOTICED AN ABNORMAL FUEL ODOR EMITTING FROM THE FRONT OF THE VEHICLE. UPON INSPECTING UNDER THE HOOD, THE CONTACT NOTICED FUEL ON SEVERAL COMPONENTS UNDER THE HOOD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL SPRAY DERIVED FROM A FAILED OR FRACTURED FUEL INJECTOR. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V019000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL AND WOULD NOT BE ELIGIBLE FOR A FREE REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "WA1DGAFE2BD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905910,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT PERTAINS TO AUDI'S ADBLUE (NOX) SYSTEM. THE NOX SENSOR FAILED, WHEN THE CAR IS DRIVING OR STATIONARY.  THE WARNING ALERT STATES THE CAR WILL NOT START WITHIN 600 MILES. THE NOX SENSOR MUST BE REPLACE; OTHERWISE, THE CAR WILL NOT RUN DUE TO THE SOFTWARE LOCK OUT TRIGGERED BY THE SENSOR. I AM FORCED TO REPAIR THE CAR DESPITE THE FACT THE TDI ADBLUE SYSTEM NEVER WORKED PROPERLY AS ADVERTISED BY VW/AUDI. IN MY VIEW, VW/AUDI SHOULD REPLACE THE SENSOR OR VW/AUDI SHOULD OFFER A REIMBURSEMENT FOR ANY COST RELATED TO THE TDI ADBLUE SYSTEM THAT OCCURRED WHILE THE COURT CASE IS PENDING.",
        "vin": "WA1VMAFE3BD"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731421,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT PERTAINS TO AUDIS ADBLUE(NOX) SYSTEM. WE RECIEVED A FAULT ON A ROAD TRIP. IT STATED CAR WOULD NOT TURN ON WITHIN 600 MILES. IT STARTED TO COUNT DOWN. AFTER 3 DEALERSHIP VISITS THEY INFORMED ME THAT THE FIRST PART TO REPLACE IS A NOX SENSOR TO THE COST OF 1300 DOLLARS. I REFUSED AS I DIDN'T HAVE THAT AMOUNT. SO NOW I HAVE A CAR THAT CANT BE DRIVEN BECAUSE IT WONT TURN ON AND COMPLY WITH FEDERAL EMISSIONS. I FEEL THAT IF THERE IS A PART HAVING TO DO WITH FEDERAL EMISSIONS THEN AUDI SHOULD HAVE TO BE FORCED TO REPLACE IT LIKE THEY WOULD A CATALYTIC CONVERTER. OR NOT DISABLE THE VEHICLE IN CASE I'M IN THE MIDDLE OF NOWHERE!!!!!!  AUDI SHOULD REMOVE THAT PROGRAMMING, GIVEN THE FACT THAT IN A STATE OF EMERGENCY I WOULD APPRECIATE THE ABILITY TO CONTINUE DRIVING FOR MONTHS OR YEARS(IF NEED BE) IF THE COUNTRY IS LACKING INFRASTRUCTURE. ANOTHER SCENARIO  WOULD BE IF I DECIDE TO DRIVE ALL THE WAY TO THE SOUTHERN TIP OF SOUTH AMERICA. I WOULD HATE FOR MY CAR TO BE STRANDED BECAUSE OF A NOT SO CRITICAL ISSUE.",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "07/06/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637660,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES PURCHASED FROM LIBERTY TIRE AND BRAKE ON 05/01/14 WERE MANUFACTURED BETWEEN 2008-2009 WITH ONLY 3-9 MONTHS OF WARRANTY LEFT. ON OUR WAY HOME FROM OUR FAMILY VACATION FROM THE FL KEYS ON 07/06/14 ONE TIRE SEPARATED AND ALL FOUR TIRES WERE OFF BALANCE. WE PURCHASED FOUR NEW TIRES TO CONTINUE OUR 500 MILE JOURNEY HOME. DUE TO LIMITED TRUNK SPACE WITH LUGGAGE AND OUR CHILDREN IN THE BACKSEAT WE WERE ONLY ABLE TO BRING THE DAMAGED TIRE BACK WITH US WHICH NEXEN WILL REFUND US. HOWEVER WE WOULD ALSO LIKE A REFUND FOR THE OTHER THREE TIRES MANUFACTURE IN 2008-2009 WHO HAVE BEEN SOLD TO US WITHOUT THE AGE DISCLOSURE BY LIBERTY TIRE & BRAKE. THE RETAILER HAS BEEN VERY LITTLE HELP IN RESOLVING THIS ISSUE AND WE HAVE SINCE REPORTED HIM TO THE BBB, CONSUMER PROTECTION, AND SENT A LETTER OF DEMAND FROM OUR MILITARY LEGAL ASSISTANCE OFFICE HERE IN FT. STEWART, GA. WE ARE REPORTING THIS PER OUR TELEPHONE CONVERSATION WITH REF. # [XXX] ANY HELP WOULD BE GREATLY APPRECIATED. IF YOU NEED ANY ADDITIONAL INFORMATION OR PURCHASE RECEIPTS PLEASE FEEL FREE TO CONTACT US. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WA1LGBFE4BD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631921,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 AUDI Q7. WHILE DRIVING APPROXIMATELY 40 MPH, THE TEMPERATURE GAUGE SUDDENLY BEGAN TO FLUCTUATE FROM HIGH TO LOW AND THEN BACK TO NORMAL. THE VEHICLE DECELERATED AND STALLED. THE VEHICLE WAS TOWED TO THE DEALER WHO DIAGNOSED THAT THE ENGINE WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 90,700.",
        "vin": "WA1CGAFE8BD"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/06/2013",
        "dateOfIncident": "04/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 10507364,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I AND FOUR CHILDREN BETWEEN THE AGES OF 2 AND 9 WERE DRIVING A 2011 AUDI Q7 ON A RIGHT LANE OF A STREET. WE HAD A GREEN LIGHT AND ANOTHER DRIVER IN A HONDA MINIVAN FROM THE OPPOSITE SIDE OF THE STREET MADE A LEFT TURN IN FRONT OF US WITHOUT YIELDING AND THOUGH I HIT THE BRAKE IMMEDIATELY, I WAS NOT ABLE TO AVOID CRASHING HEAD ON INTO THE OTHER CAR ON THE PASSENGER SIDE OF THE VAN. I AM TOLD THAT MY AUDI IS PROBABLY TOTALED BUT WE ARE WAITING TO HEAR THE OFFICIAL RESULTS. WE WERE ALL WEARING SEATBELTS BUT THE AIRBAGS ON MY AUDI NEVER DEPLOYED. WE ALL HIT OUR HEAD BACKWARDS. I HAVE A SPRAINED KNEE AND PAIN ON MY NECK, SHOULDERS AND BACK; ONE CHILD SEATED ON THE FRONT PASSENGER SEAT, AGE 9, HAS CHEST AND WAIST PAIN, ANOTHER CHILD, AGE 6, SEATED BEHIND THE DRIVER SEAT, HAD A CONCUSSION AND PAIN ON HIS HEAD AND RIGHT FRONT SHOULDER; ANOTHER 9 YEAR OLD, SEATED IN THE MIDDLE BACK SEAT, HAD A CUT IN HIS NOSE AND WAS BLEEDING, NOT SURE WHAT CAUSED IT AND ALSO HAS A NECK AND BACK PAIN; A 2 YEAR OLD HAD SOME CUTS AND BRUISES ON BOTH SIDES OF THE NECK CAUSED BY THE SEAT BELT AND HAD PAIN ON THE BACK OF THE NECK. WE WERE ALL TRANSPORTED TO THE HOSPITAL IN AN AMBULANCE AND TREATED. THE BURNING QUESTION EVERYONE HAD WAS \"HOW COME THE AIRBAGS NEVER DEPLOY?\". WHEN WE ASKED AUDI, WE WERE TOLD IT HAPPENS EVEN IN THE WORST ACCIDENTS AS LONG AS THE SENSOR DOES NOT SENSE DANGER. OUR CAR'S FRONT CRUMBLED INWARDS AND IT IS BEING CONSIDERED TO BE TOTALED, IF THAT IS NOT DANGER, I DON'T KNOW WHAT MORE SHOULD HAVE HAPPENED TO US FOR THE SENSOR TO SENSE DANGER. *TR",
        "vin": "JHMCM56864C"
    }
]