[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428492,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I received error code P052B and the car had a high pitched whistle and was way down on power. I had it towed to the nearest dealer for service.  After speaking with the technician, they told me they'd gone through with a boroscope and saw nothing out of the ordinary and recommended a new valve cover since the PCV was bad. I opted to order replacement spark plugs, coils, an eccentric valve sensor, and figured why not replace the Vanos bolts while in there too.  Unfortunately after getting the cover off, it's been discovered that 7! of the Vanos bolts have already either sheared off or backed out. Pretty much a worst case scenario as my car was built in 2010 and is just outside the 10 year unlimited mile warranty outlined in the service bulletin (https://static.nhtsa.gov/odi/rcl/201...4V176-2716.pdf).  This service warranty does not appear long enough, and the item should have been recalled instead of warrantied. (Similar years similar issue in the BMW N55 motor was recalled https://www.autoblog.com/2014/04/11/bmw-broadens-engine-bolt-recall-nearly-half-million-cars-worldwide/)",
        "vin": "WBAUP7C54BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422305,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2011 BMW 128I. The contact stated while entering the vehicle she noticed that the passenger’s seat occupancy sensor light was illuminated however, there was no one occupying the seat. The contact stated that the warning light remained illuminated. The contact took the vehicle to the local dealer who inspected the vehicle and diagnosed the failure as a faulty memory SRS light and sensor. The contact was informed that to repair the failure the passenger’s seat needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 42,000.",
        "vin": "WBAUP9C5XBV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373441,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMSHAFT HOUSING BELTS ARE LOSSES OR BROKEN",
        "vin": "WBAUL7C51BV"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364505,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "VANOS FAILED ON 2011 BMW 128I, MANUFACTURE OFFERED EXTENDED WARRANTY AND FAILED TO HONOR SAID WARRANTY. VEHICKLE MAKES LOUD NOISE. CAR WILL EVENTUALLY BREAK MAKING CAR UNDRIVABLE EVER AGAIN, WITH 7K REPAIR COST WHICH EXCEEDS VALUE OF CAR WITH LESS THAN 100K MILES",
        "vin": "WBAUL7C53BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319195,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER ACCUMULATES IN THE TRUNK/BOOT OF THE VEHICLE CAUSING NUMEROUS ELECTRONIC FAULTS, ERROR CODES AND STATES PER BMW THIS ISSUE SIGNIFICANT. MANY ISSUES LIKE THE ONES I'VE DESCRIBED WERE RECALLED TO A DEGREE. NOW, THEIR 'FIXES' ARE FAILING AND MORE AND MORE ISSUE EMERGE WITH THE BMW E8X FRAME. I WAS TOLD PER BMW THAT THESE RECALLS REMEDY THE MISTAKE; THEREFORE, EVEN THOUGH I HAVE THE SAME ISSUES THE RECALL COVERED I'M HAVING THE SAME ISSUES. THESE ISSUES CAN HAPPEN AT ANY TIME. MOST OFTEN WHEN STARTING THE VEHICLE BUT ON PARTICULARLY RAINY DAYS IT CAN BE ANY TIME AND ANYWHERE.",
        "vin": "WBAUL7C54BV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234875,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES M",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 18TH,I PURCHASED THE VEHICLE. ON JUNE 19TH I WAS IN ROUTE TRANSPORTING MY DAUGHTER TO COLLEGE WHEN THE VEHICLE BEGAN TO SEVERELY SMOKE UNDERNEATH THE HOOD. A STATE TROOPER INFORMED ME THAT THE VEHICLE COULD CATCH ON FIRE IF IT WAS CONTINUOUSLY DRIVEN. I HAD THE CAR TOWED HOME (CHICAGO, IL).  CONTACT WAS MADE WITH THE DEALERSHIP. THE OWNER [XXX] HAD ANOTHER TOW TRUCK PICK THE VEHICLE UP. HE ASSURED ME THAT THE PROBLEM WOULD BE FIXED. THEY CALLED ME 4 DAYS LATER AND STATED THAT THE CAR WAS READY. WITHIN A WEEK THE CAR WAS SMOKING AGAIN. THE DEALERSHIP WAS NOTIFIED. I WAS TOLD TO BRING THE CAR BACK IN. I DID SO THEY KEPT THE CAR FOR 2 WEEKS. THE OWNER [XXX] THEN CALLED ME JULY 24,2019 STATING THAT THE MECHANIC SAYS THE VEHICLE IS REPAIRED AND WHY IS IT THAT I'M BRINGING IT BACK. I TRIED EXPLAINING TO HIM THAT THE CAR IS NOT FIXED AND THAT THERE IS PROOF (A VIDEO AND PICTURES). HE BECAME UPSET WHEN I TOLD HIM THAT AND BLATANTLY TOLD ME THAT HE WASN'T FIXING ANYTHING AND NEXT TIME NOT TO BUY A USED CAR. WITH HANGING UP IN MY FACE. I WOULD GREATLY APPRECIATE THE HELP IF IT IS POSSIBLE. THANK YOU, [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204967,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST HAD THE BOLTS ON BOTH THE (INTAKE AND EXHAUST REPLACED) THIS IS LISTED IN THE UNSPECIFIED RECALL AND NO ONE NOTIFIED ME ON THIS RECALL I DRIVE THE 2011 128I SERIES COUPE AND THIS COST ME OUT OF POCKET $1,800 DOLLARS TO REPLACE, WHAT I DO NOT UNDERSTAND IS WHY I WAS NOT NOTIFIED OF THIS I COULD HAVE BEEN IN A SERIOUS ACCIDENT AND ALSO I HAVE 2 OTHER RECALL ISSUES THAT ARE HAPPENING TO MY CAR THE AIR BAG THE SIGNAL KEEPS COMING ON AND OFF AND ALSO THE PCV VALVE OFF AND ON I SMELL SOMETHING BURNING I DO HOPE SOMEONE CAN CONTACT ME SO I CAN GET THESE RECALLS FIX NOW I AM REALLY SCARED THIS IS A MATTER OF LIFE AND DEATH.  I HAVE MY RECEIPT OF ME GETTING THE BOLTS ISSUE FIXED AND REQUESTING A REFUND",
        "vin": "WBAUP7C55BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193250,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I BRING IN TO LONGBEACH BMW DEALERS AND THEY MASS UP THE CAR AND THEY WANTED 10,000 DALLORS TO FIXED IT AND I ONLY BRING TO IN FOR RECALLS  I DON'T LET ME PICK UP THE CAR",
        "vin": "WBAPH5G59BN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191402,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CONVERTABLE TOP NOT OPERATING.",
        "vin": "WBAUN1C50BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/23/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161297,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS MOVING AT HIGHWAY SPEED WITH AC RUNNING.  SMOKE PLUMED FROM VENTS AND UNDER FRONT PASSENGER FOOTWELL.  ELECTRICAL FIRE STEMMING FROM BLOWER MOTOR FINAL STAGE UNIT AND WIRING HARNESS.",
        "vin": "WBAUC9C54BV"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153013,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION AND THE BLOWER MOTOR RESISTOR HARNESS BEGAN TO SMOKE HEAVILY. THE A/C STOPPED WORKING. I PULLED OVER AND DISCONNECTED THE WIRING HARNESS AND PULLED THE FUSE. THE WIRES MELTED, THE CONNECTOR MELTED, AND THE RESISTOR IS BROKEN.  AFTER SOME RESEARCH I SEE THAT BMW HAS RECALLED OTHER CARS FOR THIS EXACT SAME ISSUE, BUT NOT THE 1 SERIES.",
        "vin": "WBAUC9C54BV"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112223,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH PRESSURE FUEL PUMP HAS FAILED AND BEEN REPLACED MULTIPLE TIMES. IT BEGINS WITH THE CAR TAKING MUCH LONGER TO CRANK AND START. THEN IT COMPLETELY FAILS POTENTIALLY WHILE DRIVING, CREATING A SAFETY ISSUE, OR WILL NO LONGER START. THE HPFP IS EASILY REPLACED WITH JUST 3 BOLTS HOLDING IT TO THE SIDE OF THE MOTOR. ANY COMPETENT SHOP CAN REPLACE IT IN A COUPLE HOURS AT THE MOST. THE PROBLEM IS EXACERBATED AND MADE EXTREMELY FRUSTRATING BY THE SERVICE CENTERS REFUSING TO ADDRESS THE OBVIOUS PROBLEM. INSTEAD THEY FEIGN IGNORANCE WHILE HUNDREDS OF THOUSANDS OF THESE ARE REPLACED AFTER HAVING REPLACED NUMEROUS OTHER THINGS. THESE OTHER DISTRACTIONS ARE ALL MORE TIME CONSUMING TO REPLACE AND THE ROOT DEFECTIVE HIGH PRESSURE FUEL PUMP IS THE LAST THING TO BE ADDRESSED WHEN IT SHOULD BE THE FIRST AND QUICKEST. EVERY TIME ONCE THIS HAS BEEN REPLACED, IT HAS BEEN FIXED RIGHT AWAY. IT IS OFTEN THAT IT WILL LAST FOR A FEW MONTHS OR FEW THOUSAND MILES BEFORE FAILING AGAIN. BMW NEEDS TO PROPERLY DESIGN AND REPLACE THESE DANGEROUS FAILING UNITS ON N55 AND OTHER 3.0L TURBO DIRECT INJECTION MOTORS.",
        "vin": "WBAUN7C50BV"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109957,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RANDOMLY ACCELERATES FOR AN ADDITIONAL SECOND AFTER RELEASING THE GAS PEDAL.",
        "vin": "WBAUP7C56BV"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "04/25/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090321,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE CONVERTIBLE MODEL THERE IS A REAR BRAKE LIGHT BAR LOCATED ON THE TRUNK DECK.  THIS LIGHT BAR HAS FALLEN OFF MY VEHICLE 4 TIMES IN 43000 MILES.  IT IS NOT A VERY EFFECTIVE BRAKE LIGHT IF IT KEEPS FALLING OFF.  THIS IS OBVIOUSLY A DEFECT IN WHAT IS SUPPOSED TO BE A SAFETY FEATURE.",
        "vin": "WBAUN1C54BV"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089274,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ASD",
        "vin": "123456789AS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "12/01/2017",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071529,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT STATED THAT THE BATTERY WARNING INDICATOR FLASHED MORE THAN ONCE AND, WHILE DRIVING IN REVERSE, SMOKE EMITTED FROM THE VEHICLE UNDER THE HOOD. THE VEHICLE WAS PULLED BACK INTO THE GARAGE DUE TO THE FAILURE. THE DEALER (FIELDS BMW WINTER PARK, 963 WYMORE RD, WINTER PARK, FL 32789, (407) 628-2100) WAS UNABLE TO VERIFY WHEN THE MANUFACTURER WOULD SUPPLY THE REMEDY AND PARTS FOR NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBAUP7C56BV"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064648,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE PCV VALVE HEATER RECALL. MY CAR STARTED SMOKING BETWEEN A MONTH AND A HALF TO TWO MONTHS AGO. I HAVE TALKED TO BOTH REGIONAL AND LOCAL BMW. THEY SAID THERE WERE GOING TO MAKE ARRANGEMENTS FOR ALTERNATIVE TRANSPORTATION BUT I HAVEN'T HEARD FROM THEM SINCE 1/16/18. MY CAR IS NOTICEABLY SMOKING WHILE STATIONARY, AND YOU CAN SMELL PLASTIC BURN SMELL WHEN DRIVING. AT FIRST, I CONTACTED REGIONAL BMW SOMETIME DURING EARLY DECEMBER. THEY ADVISED ME TO CONTACT MY LOCAL BMW IN REFERENCE TO GETTING ME INTO ALTERNATIVE TRANSPORTATION UNTIL MY RECALL PARTS WERE AVAILABLE. BMW OF OCALA TOLD ME THEY HADN'T HEARD ANYTHING ABOUT ALTERNATIVE TRANSPORTATION AND THAT MY CAR WOULD NOT BE SMOKING DUE TO THE RECALL. I PARKED MY CAR AND UNDID THE BATTERY ON 12/30/17. I TRIED TO START MY CAR ON EITHER 1/14/18 OR 1/15/18 AND IT STARTED SMOKING AGAIN IMMEDIATELY. I CONTACTED REGIONAL ON 1/16/18. THEY TOOK MY INFORMATION (MILEAGE, PURCHASE DATE, PLACE PURCHASED, AND PLACE CALLED FOR ASSISTANCE), AND GAVE IT TO A CASE MANAGER AT REGIONAL. THE REGIONAL MANAGER TYLER CONTACTED ME BACK THE SAME DAY 1/16/18 AND TOLD ME HE FAXED MY INFORMATION AND INSTRUCTIONS OVER TO BMW OF OCALA AND I SHOULD HEAR FROM THEM IN 1-2 DAYS AND IF NOT, TO CALL HIM BACK. I'VE BEEN CALLING TYLER AND LEAVING MESSAGES SINCE 1/19/18 AND HAVE NOT HEARD BACK FROM HIM, OR BMW OF OCALA. MY CAR IS NOT SAFE AND I CAN NOT DRIVE IT. THE NUMBER I HAVE BEEN CALLING FOR REGIONAL BMW IS 1800-831-1117. TYLERS EXTENSION THERE IS 7389.",
        "vin": "WBAUL7C5BVM"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058578,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HEADLIGHTS AND ALL INSIDE PANEL LIGHTS WENT OUT ON THE CAR. I NEED HELP BECAUSE NO ONE SEEMS TO CAN TELL ME WHAT IS WRONG AND HOW TO GET IT FIXED. I DO KNOW THAT A RECALL ON ELECTRIC SYSTEMS HAPPENED IN OCTOBER BUT MY CAR WAS NEVER FIXED. I LIVE IN LAUREL MS. MY TWO FRONT WINDOWS STOPPED WORKING THE SAME TIME THAT ALL LIGHTS WENT OUT.",
        "vin": "WBAPH7C56BE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054214,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    THE TAKATA AIRBAGS ON MY CAR WERE RECALLED IN FEB 2016.  I HAVE SPOKEN TO MY LOCAL BMW DEALERSHIP MULTIPLE TIMES AND THE REPLACEMENT PARTS ARE STILL ON A \"NATIONAL BACKORDER.\"  THIS HAS ALMOST BEEN 2 YEARS WITHOUT A RESOLUTION - THIS IS COMPLETELY UNACCEPTABLE.",
        "vin": "WBAUN1C56BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044869,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "WBAUC9C51B "
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044935,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   BMW HAS FAILED TO REPLACE THE AIR BAG THAT WAS RECALLED ON 2/5/2016 AFTER MANY SERVICES THEY HAVE NOT TO DATE REPLACED THE DRIVER SIDE AIR BAG",
        "vin": "WBAUP7C59BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2017",
        "dateOfIncident": "10/28/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040740,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I RECEIVED A LETTER IN THE MAIL DATED SEPT 2017 FROM BMW USA STATING THAT THE PARTS ARE AVAILABLE AND TO SCHEDULE AN APPOINTMENT FOR A FREE REPAIR. WHEN I CALLED MY DEALER (STEVENS CREEK BMW USA IN SANTA CLARA, CA) THEY INFORMED ME THAT THE PARTS ARE ACTUALLY NOT AVAILABLE, THEY HAVE THEM ON ORDER, AND IT WOULD TAKE ANYWHERE FROM 3-5 MONTHS FOR THEM TO ACTUALLY GET THEM. SINCE THIS IS OCTOBER 2017, THIS WOULD BE MEAN AN ESTIMATED REPAIR DATE IN JAN-MARCH 2019!",
        "vin": "WBAUN1C51BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035852,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL BRAMAN BMW KEEP SAYING THEY DO NOT HAVE THE PARTS. I HAVE BEEN WAITING FOR 2 YEARS, AND EVERY TIME I CALLED THEY GIVE ME THE SAME \"SCRIPTED ANSWER\". I HAVE BEEN WAITING FOR 2 YEARS TO GET THIS PART REPLACED AND THEY JUST KEEP GETTING MY NAME ON A WAITING LIST, THAT IS NOT REAL.  I GOT A LETTER FROM BMW SAYING THE PART IS AVAILABLE AND THEY KEEP SAYING TO ME THAT IS NOT AVAILABLE.",
        "vin": "WBAUP7C5XBV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018738,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE NEVER BEEN CONTACTED BY BMW REGARDING THIS RECALL.  I HAVE NO IDEA IF MY AIRBAGS ARE FAULTY OR NOT.  I HAVE CALLED MY DEALER AND THEY SAID THAT I WOULD RECEIVE A LETTER IF/WHEN THEY WERE ABLE TO REPAIR THE AIRBAGS.  HAVE NEVER HEARD FROM THEM.",
        "vin": "WBAUP9C55DV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016262,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CALLED MY LOCAL BMW DEALERSHIP ON 4 OCCASIONS  AND HAVE RECEIVED NO HELP. THEY KEEP TELLING ME THEY DON'T KNOW WHEN IT WILL BE DONE. I FEEL NERVOUS EVERY TIME I DRIVE MY CAR.",
        "vin": "WBAUN1C58BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013976,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I CONVERTIBLE. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE CONTACT WAS MADE AWARE OF THE RECALL WHEN THE VEHICLE WAS PURCHASED IN JULY OF 2017 FROM A THIRD PARTY. IN ADDITION, THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED ONCE FOR AN ENTIRE DAY AND THEN TURNED OFF. THE LOCAL DEALER (BMW OF ESCONDIDO, 1557 AUTO PARK WAY, ESCONDIDO, CA, 92029)   STATED THAT PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER CONFIRMED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR, BUT STATED THAT THE PARTS SHOULD BE AVAILABLE IN ONE MONTH. THE MANUFACTURER STATED THAT THEY WOULD EXPEDITE THE CONTACT'S REQUEST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUN1C59BV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001540,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT STATED THAT WHILE ATTEMPTING TO ACCELERATE FROM A RED LIGHT AT 5 MPH, THE VEHICLE SHUDDERED AND STALLED WHILE MAKING A LOUD KNOCKING NOISE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ALUMINUM BOLTS IN THE VARIABLE CAM SHAFT TIMING ADJUSTMENT HOUSING HAD FAILED AND NEEDED TO BE REPLACED. THE MECHANIC ADVISED THE CONTACT TO SPEAK TO A BMW DEALER IN ORDER TO HAVE THE REPAIR WORK DONE UNDER A RECALL. THE CONTACT SPOKE TO BMW OF TULSA LOCATED AT 9702 S MEMORIAL DR, TULSA, OK 74133 AND WAS INFORMED THAT THEY WOULD NOT REPAIR THE VEHICLE FOR FREE AS THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER 14V176000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE CONTACT SHOULD SPEAK TO NHTSA TO HAVE HIS VIN ADDED TO THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 111,000.",
        "vin": "WBAUP7C58BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993200,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I FEEL THAT 15 MONTHS IS WAY TO LONG TO WAIT TO FIX A PROBLEM THAT HAS THE POTENTIAL TO MAIM OR KILL MY WIFE WHO DRIVES THIS CAR.  I KEEP ASKING THE BMW DEALERSHIP AND ALL THEY DO IS SHRUG THEIR SHOULDERS.",
        "vin": "WBAUL7C58BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2017",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956623,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) IN MID MARCH OF 2016 AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER INDICATED THAT THE PARTS MAY BECOME AVAILABLE IN MID SEPTEMBER OF 2016. THE PARTS HAD NOT BECOME AVAILABLE. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUP7C58BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946174,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. ..UPDATED 03/29/17 *BF      *CN",
        "vin": "WBAUL7C53BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944265,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I US. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 03/17/17*LJ    *CN",
        "vin": "WBAUP7C5XBV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940073,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I US. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V071000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUL7C52BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/31/2016",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938945,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  NO COMMUNICATION FROM BMW ABOUT RECALL OR AVAILABILITY OF PARTS.  THE DRIVER IS FIVE FEET TALL AND MUST SIT CLOSE TO STEERING WHEEL.",
        "vin": "WBAUP9C5XBV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937668,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN WAITING FOR NEARLY TEN MONTHS TO BE NOTIFIED ABOUT WHEN REPLACEMENT PARTS WOULD BE AVAILABLE FOR MY CAR'S RECALLED DRIVER-SIDE AIRBAG MODULE (RECALL CAMPAIGN NO. 16V-071). OVER THE PAST TEN MONTHS, I'VE CALLED BMW SEVERAL TIMES TO GET INFORMATION ABOUT WHEN IT EXPECTS TO RECEIVE REPLACEMENT PARTS. EACH TIME, I'VE BEEN TOLD TO SIMPLY WAIT! APPARENTLY, BMW EXPECTS ME TO WAIT LONG ENOUGH FOR IT TO EXPLODE IN MY FACE AND EITHER KILL ME OR CAUSE SEVERE BODILY INJURY! DURING MY MOST RECENT CALL WITH BMW, ON DEC. 27TH, 2016, I WAS INFORMED THAT IT WILL BE AT LEAST ANOTHER SIX MONTHS BEFORE BMW EXPECTS TO RECEIVE PARTS.  THAT IS COMPLETELY UNACCEPTABLE; THEREFORE, I AM SUBMITTING AN OFFICIAL COMPLAINT TO NHSTA ABOUT BMW'S LACK OF RESPONSIVENESS TO REMEDY THIS EXTREMELY DANGEROUS DRIVER AIRBAG MODULE SITUATION.",
        "vin": "WBAUP7C55BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933853,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUN1C55BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "11/17/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926605,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECIEVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER; 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUP7C59BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926239,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD A PASSENGER RESTRAINT MALFUNCTION THAT RENDERED THE PASSENGER AIRBAG INOPERATIVE.",
        "vin": "WBAUL7C52BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914128,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE FROM BMW IN MARCH 2016, WARNING OF  A DANGEROUS DEFECT IN THE DRIVER'S FRONT AIRBAG.  MY BMW CENTER HAS NOT REMEDIED THE DEFECT AS OF YET, OCT, 2016, UNREASONABLE.  I AM VERY UNCOMFORTABLE DRIVING THIS BMW, WILL NOT CARRY PASSENGERS AND PUT THEM IN DANGER.  I DO NOT HAVE AN ALTERNATE VEHICLE TO DRIVE TO WORK. AS ALWAYS, I AM AN ATTENTATIVE, DEFENSIVE DRIVER.  I CANNOT CONTROL THE OTHER CRAZY, STUPID, CARELESS, WRECKLESS DRIVERS OUT THERE.  IN JULY 2013, MY 2009 AUDI A4 WAS T-BONED, TOTALED, I SUFFERED A SEVERELY BROKEN COLLAR BONE, ALL WHILE I WAS SITTING STATIONARY, AT A RED LIGHT.  \"AT FAULT\" DRIVER MAKING A LEFT TURN, GIANT SUV DRIVER WHO HIT HIM AND TOTALED MY CAR, DEFINITELY SPEEDING AND PROBABLY  TEXTING WHILE DRIVING.  MY AIRBAGS DEPLOYED - THANKFULLY NO METAL DAGGERS SHOT OUT !!!!   PLEASE GET ON BMW ABOUT THIS!  BEFORE SOMEONE SUFFERS \"SERIOUS INJURY OR DEATH\"  !!!!!!!   THANK YOU  *TR",
        "vin": "WBAUN1C53BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911379,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL CAMPAIGN NO. 16V-071: DRIVER'S FRONT AIR BAG MODULE,  THIS IS A DANGEROUS SITUATION, NOT RESOLVED BY BMW.  AIRBAG COULD SHOOT METAL FRAGMENTS INTO DRIVER AND PASSENGER, RESULTING IN SERIOUS INJURY OR DEATH, IN THE CASE OF INFLATION.  NOT COMFORTABLE DRIVING MYSELF OR PASSENGERS IN THIS BWM.   RECALL RECEIVED IN MARCH 2016, STILL NO PARTS, NOT REPLACED, STILL FORCED TO DRIVE IN A DANGEROUS CAR.",
        "vin": "WBAUN1C53BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908453,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE VIN WAS INVALID. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUP9C5XBV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908304,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL NOTICE FROM BMW IS DATED AND WAS RECEIVED IN MARCH 2016.  CALLED BMW CUSTOMER RELATIONS NUMBER 800-525-7417 SEVERAL TIMES SINCE MARCH WITH THE SAME REPLY THAT BMW HAS NO PARTS AND DOESN'T KNOW ANY MORE.  IT IS NOW THE END OF SEPTEMBER,  2016 WITH NO RESOLUTION AND A POTENTIALLY DANGEROUS SITUATION STILL EXISTS.   THIS IS TERRIBLE CUSTOMER SERVICE FROM A WELL KNOWN CAR MANUFACTURER, LEAVING CUSTOMERS TO EITHER NOT DRIVE THEIR CAR FOR AN UNDETERMINABLE TIME OR RISK THE HAZARD OF A DEADLY EXPLOSION OF A KNOWN FAULTY AIR BAG.  PLEASE ADVISE AT ONCE ANY REMEDY!  [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAUL7C51BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907168,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES M",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 1 SERIES M. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBSUR9C56BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/20/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897392,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  THIS IS TAKING WAY TOO LONG TO RESOLVE FOR AFFECTED BMW VEHICLES.",
        "vin": "WBAUP7C52BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897120,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 10/13/16*LJ  UPDATED 09/25/2017*JS",
        "vin": "WBAUP7C52BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "05/29/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892455,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 135I. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAUN7C56BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887463,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBAUP7C51BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876848,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBAUP7C54BV"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875826,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ACCELERATING INTO HEAVY TRAFFIC AND MY DOOR FLEW OPEN AS I HIT 45 MPH.  I IMMEDIATELY PULLED OVER WHEN SAFE, AND FOUND MY DOOR WOULD NOT LATCH.  I DROVE HOME SLOWLY HOLDING ONTO THE DOOR.  AFTER SOME PLAYING WITH THE BUTTONS, IT FINALLY CAUGHT.  I CALLED THE DEALER AND THEY REPAIRED IT ON 3/25/16 FOR >$500.  AGAIN 6/14/16, I WENT TO GET IN MY CAR TO GO TO WORK AND THE DOOR WOULD NOT LATCH.  NO INJURIES OCCURRED BUT A SERIOUS SAFETY HAZARD.  I TOOK THE CAR BACK IN 6/17/16 AND THEY STILL HAVE IT.  TOLD ME THERE WAS \"WATER IN THE ACTUATOR\".  VERY WORRIED ABOUT THIS FIX.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874410,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBAUN1C5XBV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872061,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) WAS RECEIVED IN FEBRUARY OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 08/03/16*LJ",
        "vin": "WBAUP7C56BV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2016",
        "dateOfIncident": "02/11/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861473,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL...RECENTLY HAD THE AIR BAG CONTROL MODULE REPLACED.  AT A COST TO ME.  THE DEALER INDICATED THAT THIS IS NOT PART OF THE RECALL.  IS THIS PART OF THE PROBLEM WITH TAKATA AIRBAGS OR IS IT SEPARATE  MANY THANKS. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAUP7C59BV"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854451,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW 2011 52I , FUEL PUMP WIRE PLUG IS GET HOT BURN HOLD AT TOP OF PUMP HOUSING , WHEN TANK IS FULL IT LEAK OUT UNDER REAR SEAT . [XXX] AT SATTERFIELDS'  AUTO TECH , DECATUR , ALABAM 35601 , PHON # [XXX]I CAN SEND YOU PICTURES OR THE PUMP     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAFR1C57BC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "02/14/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846501,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL , I LIVE IN SOUTH FLORIDA JUST SAW MY VIN IN FEBRUARY UPDATE.I HAVE JUST PARKED THE CAR, AS YOU THE HUMIDITY IN THE SUMER HEAR IS VERY HIGH. DEALER COGGINS BMW FORT PIERCE SAYS THEY HAVE NO IDEA WHEN PARTS TO FIX WILL BE AVAILABLE.PLEASE HELP.",
        "vin": "WBAUL7C58BV"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/20/2015",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811348,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES, THE CAR FROM A STAND STILL OR LOW SPEED (BELOW 10-15 MPH) HAS A DELAY BETWEEN THROTTLE INPUT AND ACTUAL ACCELERATION.    THIS DELAY OF ACCELERATION HAS CAUSED MANY CLOSE CALLS FOR ACCIDENTS AND/OR SUDDEN BRAKING NEEDED BECAUSE OF OVER ACCELERATION.     BETWEEN MY RESEARCH ON THIS ISSUE AND EXPERIENCES WITH THIS, I CAN RELIABLY REPRODUCE THIS ISSUE. BUT DUE TO THE NATURE OF THIS ISSUE, WITHOUT PROPER DOCUMENTATION EQUIPMENT, I CANNOT PROVIDE ANY CONCRETE DATA (BESIDES OTHER DATA PROVIDED BY VARIOUS SOURCE WITH PROFESSIONAL EQUIPMENT.)",
        "vin": "WBAUC9C59BV"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788317,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS THE SAME N54 ENGINE AND SAME FUEL PUMP THAT WAS COVERED UNDER RECALL FOR FAILING FUEL PUMPS ON THE 2007-2010 BMW CARS.  IT WAS THE ONLY BMW VEHICLE THAT USED THIS MOTOR IN 2011 AND SUCH WAS LEFT OUT OF THE ORIGINAL RECALL.  THERE WERE ONLY ABOUT 600 OF THE VEHICLES MADE FOR THE USA SO I SUPPOSE THAT MIGHT ALSO BE WHY THEY WERE OMITTED.  BMW HAS INFORMED US THAT THEY CANNOT COVER IT UNDER THE RECALL SINCE IT WAS NOT INCLUDED EVEN THOUGH IT HAS THE SAME MOTOR AND FUEL PUMP THAT WAS RECALLED IN PREVIOUS YEARS.  THIS CAR HAS EXPERIENCED A FUEL PUMP FAILURE WHILE DRIVING ON A CITY STREET IN TRAFFIC.  THE ECU WENT INTO \"REDUCED POWER MODE\" AND THE CAR COULD NOT ACCELERATE PAST 15 MPH IN FAST MOVING TRAFFIC CREATING AN UNSAFE CONDITION AND A NEAR COLLISION.  THE CAR ALSO HAS THE LONG CRANK TIME AND ENGINE ERROR CODE P0087 WHICH IS NORMALLY EXPERIENCED WITH THE FUEL PUMP FAILURE.  THE 2011, 1-SERIES M COUPE SHOULD BE ADDED TO THE LIST OF VEHICLES COVERED UNDER THE ORIGINAL RECALL AND BMW SHOULD ADD THEIR EXTENDED WARRANTY TO THE FUEL PUMP LIKE THEY DID THE OTHER RECALLED CARS.",
        "vin": "WBSUR9C57BV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745872,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A 2011 BMW 1M COUPE.  WHILE PASSING ANOTHER VEHICLE ON A RURAL 2 LANE COUNTRY ROAD OUTSIDE OF HOUSTON, TX, ENGINE COMPLETELY LOST POWER IN THE MIDDLE OF THE PASS, ALMOST CAUSING WHAT WOULD HAVE BEEN A MAJOR ACCIDENT.  IT TOOK ALMOST TWO HOURS FOR A TOW TRUCK TO PICKUP THE CAR AND TEMPERATURES WERE IN THE MID 90'S WITH HEAT INDEX OF OVER 100 DEGREES, AND I HAD NO WATER OR ACCESS TO WATER OR SHADE RESULTING IN A VERY DANGEROUS SITUATION.  THE PRELIMINARY INDICATION FROM THE DEALERSHIP IS THAT THIS WAS A FAILURE OF THE CHARGE PIPE, AND THIS IS THE THIRD TIME THIS COMPONENT HAS FAILED IN LESS THAN 32K MILES.  THIS IS AN ONGOING ISSUE AND FAILURE SUFFERED BY MOST IF NOT ALL OWNERS OF THIS PARTICULAR MODEL, AND IS MOST LIKELY TO OCCUR DURING PERIODS OF HARD ACCELERATION, SUCH AS WHEN PASSING ANOTHER VEHICLE, AND AS SUCH RESULT IN A POTENTIALLY DANGEROUS SITUATION FOR THE DRIVER AND OTHER VEHICLES.",
        "vin": "WBSUR9C50BV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "06/01/2011",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725065,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS STALLED OVER 600 TIMES IN 4 YEARS.  THE CAR HAS FAILED TO START 4 TIMES.  BMW FAILED TO REPLACE THE BATTERY CABLE FOR 2 YEARS -- EVEN AFTER THE BATTERY CAUGHT ON FIRE AT A GAS STATION PUMP.  THE CAR CAN ONLY BE MOVED WITH WHEEL TROLLIES, SINCE YOU CANNOT PUT THE CAR IN NEUTRAL OR EVEN OPEN THE TRUNK (BATTERY IN TRUNK) DUE TO NO MANUALLY KEY OVERRIDE TUMBLE FOR EITHER.  BMW HAS CHARGED ME FOR LABOR AND TWO BATTERIES, EVEN THOUGH THEY ADMIT TO FAILING TO HONOR THE RECALL AND PERFORMING SAID REPAIRS.  THE CAR IS DANGEROUS, AND MY WIFE IS AFRAID TO DRIVE THE CAR.  THE CAR CHUGGES BETWEEN 4,000 TO 6,000 RPM, AND BOLT FORWARD UNCONTROLLABLY IF THE ENGINE STALL DOES NOT OCCUR UPON PRESSING THE ACCELERATOR.  I HAVE ALMOST HIT SEVERAL PEDESTRIAN, AND HAVE BEEN SWORN AT AND HONKED AT DUE TO CRAZY BEHAVIOR OF THE ACCELERATOR.  BMW 2011 135I M SPORT IS A DANGEROUS CAR.  I AM A SENIOR MECHANICAL ENGINEER AND WORK AT SPACEX ON THE RAPTOR ROCKET ENGINE FOR MARS.  I AM DESIGNING THE VALVES THAT THROTTLE THE ROCKET ENGINE, AND IN THE PAST I CONSULTED AT THE STEERING GEAR DIVISION AT ANOTHER AUTOMOTIVE MANUFACTURER IN TENNESSEE.  I AM NOT INTERESTED IN MONEY;  I WANT THEM TO BE HELD ACCOUNTABLE TO THE LAW AND FIX THE PROBLEM BEFORE MORE PEOPLE GET HURT.  I AM RESEARCHING THIS MATTER, AND I'VE FOUND INCIDENT WHERE PEOPLE HAVE BEEN  HURT.  I AM PUTTING TOGETHER A VIDEO OF THE STALLS, AND THE BMW REPAIR INVOICES SHOWING THE FAILED AND ABSENT REPAIRS OVER 4 YEARS.  THANK YOU... SINCERELY, [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAUC9C53BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702456,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "LED RUNNING LIGHTS IN PASSENGER SIDE TAIL LIGHTS HAVE FAILED.  FURTHER INSPECTION SHOWS THAT THE CIRCUIT BOARD THAT HOUSES THE LED TUBE LIGHTS HAS A MALFUNCTION DUE TO POORLY SOLDERED CIRCUIT BOARD.  LEFT TAIL LIGHTS RUNNING LIGHT FUNCTION FAILS COMPLETELY (BLINKER, AND BRAKES ARE STILL RETAINED).  LED TUBES DO NOT LIGHT UP AT ALL MAKING THE CAR LESS VISIBLE AT NIGHT.",
        "vin": "WBAUP7C56BV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655443,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "2011 BMW 128I. CONSUMER WRITES IN REGARDS TO A RECALL NOTICE CONCERNING ASSEMBLY BOLTS. *TGW  THE DEALER INFORMED THE CONSUMER, THE PARTS WERE  NOT AVAILABLE. RECALL # 14V176000. *JB",
        "vin": "WBAUP9C55BV"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632063,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS SOME SERIOUS ELECTRICAL DEFECTS. IT'S LEFT ME STRANDED AT LEAST 4 TIMES JUST DYING. ONCE WHEN IT WAS 14 BELOW ZERO. THE CAR WILL JUST DIE WHEN IT'S DRIVING. EACH TIME BMW HAS A DIFFERENT REASON FOR THE ELECTRICAL FAILURES BUT I BELIEVE THERE IS AN UNDERLYING DESIGN DEFECT THAT IS VERY DANGEROUS LEAVING PEOPLE IN A CAR WITHOUT POWER NO MATTER WHERE THEY ARE, EVEN IN THE MIDDLE OF A BUSY HIGHWAY. ONCE THE CAR DIES, IT HAS THIS BIG EXCLAMATION POINT IN THE INSTRUMENT CONTROLS INSIDE A TRIANGLE AND IT WILL NOT MOVE. IT'S VERY HARD TO EVEN GET IT OFF TO THE SIDE OF THE ROAD IN ORDER TO GET OUT OF TRAFFIC. THIS IS A VERY DANGEROUS SITUATION. THERE HAS ALREADY BEEN ONE RECALL ON THE ELECTRICAL SYSTEM OF THE CAR, BUT I THINK IT DID NOT CORRECT THE DESIGN DEFECTS. I HAVE NOW GIVEN THE CAR BACK TO THE DEALER AS I DID NOT FEEL SAFE DRIVING IT. IT LEFT ME STRANDED TOO MANY TIMES.  *TR",
        "vin": "WBAUN1C59BV"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595117,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "2011 BMW 128I.  CONSUMER WRITES IN REGARDS TO VEHICLE ACCELERATED WHEN THE BRAKE WAS APPLIED. *SMD  THE CONSUMER STATED THE VEHICLE ACCELERATED TO A HIGH RATE OF SPEED. AS HE APPLIED MORE PRESSURE TO THE BRAKE PEDAL, THE VEHICLE TRAVELED AN ADDITIONAL THREE FEET, LEAVING HIM TO TAKE DEFENSIVE MEASURES, SUCH AS PLACING THE GEAR SHIFT INTO NEUTRAL MODE. AT THAT TIME, THE ENGINE DROPPED BACK TO ITS NORMAL STATUS. AFTER KEEPING THE VEHICLE FOR THREE AND A HALF DAYS, THEY DETERMINED THE HIGH IDLING OF THE ENGINE WAS CAUSED BY THE FLOOR MAT JAMMING THE GAS PEDAL. THE VEHICLE WAS RETURNED TO THE CONSUMER. *JB",
        "vin": "WBAUP9C52BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "12/21/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560143,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW \"THIRD STOP LAMP\" (THE BREAK LIGHT) DOES NOT FIT THE 1SERIES CORRECTLY.  THEY FALL OFF, CRACK, AND DISAPPEAR FREQUENTLY.  THIS IS A COMMON PROBLEM WITH ALL 1 SERIES BMW'S.  AS THIS IS A BRAKE LIGHT, IT IS CONCERNING.  I BELIEVE THE PART NUMBER FOR THIS ITEM IS (63 25 7164978).  HERE IS A LINK TO THE PART WITH A PICTURE {HTTP://BMWETK.INFO/PARTS-CATALOG/PRD/BMW/VT/P/E82/COU/135I%20N54/USA/L/N/2009/06/50622/63/63_1055}    THOUSANDS OF INDIVIDUALS ARE COMPLAINING OF THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "05/24/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514370,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT STATED THAT WHILE DRIVING 35 MPH AND ENTERING A HIGHWAY, THE VEHICLE STALLED AND FAILED TO TURN. THE CONTACT RECEIVED ASSISTANCE FROM THE FIRE DEPARTMENT WHO ADVISED HIM THAT THE BATTERY WAS DEAD. THE VEHICLE WAS TOWED TO THE DEALER BUT A DIAGNOSTIC WAS NOT PERFORMED. THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE FAILURE AND CURRENT MILEAGE WAS 29,000.",
        "vin": "WBAUP9C50BV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/11/2012",
        "dateOfIncident": "12/10/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487977,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING TO WORK IN THE MORNING ON THE FREEWAY I HAD THE POP SOUND, NEXT THING I KNOW IS THE DRIVER SIDE DOOR POPPED OPEN AND THE WARNING LIGHTS WENT ON.  *TR",
        "vin": "WBAFR1C54BC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "04/25/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472928,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I",
                "productYear": "2011",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "ENERGY LX4",
                "productYear": "9999",
                "size": "P225/60R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW 128I EQUIPPED WITH MICHELIN ENERGY LX4 RUN-FLAT TIRES, SIZE: P225/60R17. THE CONTACT STATED THAT THE TIRES EXHIBITED SMALL PUNCTURES AND WOULD BECOME FLAT FREQUENTLY. THE CONTACT WAS UNAWARE OF THE CAUSE OF THE CONSTANT TIRE FAILURES. THE FAILURE MILEAGE WAS UNAVAILABLE. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/22/2012",
        "dateOfIncident": "06/22/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466966,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PURCHASED 02/27/11. WE FIRST NOTICED THE REAR WINDOW DEFROSTER WAS NOT WORKING THE FIRST WEEKEND OF OCT. 2011. WE TOOK THE CAR TO VALENCIA BMW ON 10/08/11. THE CAR FAILED AN ELECTRICAL TEST AND A NEW TOP WAS ORDERED BECAUSE THE REAR WINDOW AND CONVERTIBLE TOP ARE ONE PIECE. CAR WAS RETURNED ON 10/10/11. THE MILEAGE WAS 10273.ON 11/22/11, THE TOP WAS REPLACED AND CAR RETURNED ON 11/23/11. THE MILEAGE WAS 12168. ON 12/01/11, THE CAR WAS TAKEN TO THE DEALER BECAUSE THE FABRIC ON THE NEW TOP DETACHED ON THE FREEWAY ON 11/30/11 (TERRIFYING). REPAIRS WERE MADE AND CAR RETURNED SAME DAY. I POINTED OUT TO THE SERVICE ADVISOR THAT THE REPAIR WAS NOT SYMMETRIC TO THE OTHER SIDE OF THE TOP. THE REPAIRED SIDE DID NOT TUCK UP TIGHT TO THE REAR WINDOW AND MY CONCERN WAS THAT THE TOP WOULD FLY APART AGAIN. THE MILEAGE WAS 12495. ON 12/20/11, THE CAR WAS RETURNED TO THE DEALER AGAIN AND THE FABRIC WAS SECURED AGAIN AND REINSTALLED. THE MILEAGE WAS 13116. THE CONVERTIBLE TOP WAS NOT PUT DOWN AGAIN UNTIL MAY 2012. (ALL O.K.) DEFROSTER WAS FIRST USED AGAIN JUNE 2012 AND DIDN'T WORK AGAIN. BMW N.A. WAS CONTACTED BY EMAIL TO COMPLAIN ABOUT THE SAFETY OF THE CAR. ON 07/19/12, THE CAR WAS RETURNED TO VALENCIA BMW FOR ADDITIONAL REPAIRS. THE VEHICLE IS IN THE SHOP AND HAS BEEN PROMISED TOMORROW 07/23/12. THE MILEAGE IS 21619.    AFTER 5 REPAIRS FOR CONVERTIBLE TOP AND REAR WINDOW DEFROSTER, WE HAVE COME TO THE CONCLUSION THAT OUR SAFETY MAY BE AT RISK. THE CAR IS STILL UNDER A FACTORY 50000 MILE WARRANTY.    SINCE THE NUMBER OF REPAIRS ARE EXCESSIVE, UNDER CALIFORNIA LAW WE MUST NOW DISCLOSE THIS INFORMATION WHEN SELLING THE CAR. THE VALUE OF THE CAR HAS NOW BEEN DIMINISHED ADVERSELY.  *TR",
        "vin": "WBAUN1C59BV"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2012",
        "dateOfIncident": "07/05/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464836,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2011 BMW 128I. ON 7/5, MY WIFE WAS DRIVING THE VEHICLE WHEN IT SUFFERED A TOTAL ELECTRONIC FAILURE. SHE WAS UNABLE TO SEE HOW FAST SHE WAS TRAVELING DUE TO THE FACT, THE SPEEDOMETER FAILED.     WHEN SHE RETURNED HOME, ALL OF THE WARNING LIGHTS WERE ON. THE CAR WOULD REV WITHOUT TOUCHING THE GAS. I SPOKE TO D-[XXX] THE BMW DEALER. THEY HAD ME TOW THE CAR INTO THEIR SHOP.     7/9, I RECEIVED A CALL FROM [XXX] AT BMW DEALER. HE ADVISED ME THAT SOME WATER FROM A JUG I CARRY IN CASE OF AN EMERGENCY LEAKED AND GOT ONTO THE ELECTRONICS IN THE TRUNK AND IT WOULD COST ME 531.00. HE TOLD ME TO CONTACT MY INSURANCE TO HAVE THEM PAY.    I CALLED BMW CORPORATE BECAUSE THIS SOUNDED A LITTLE STRANGE. BMW TOLD ME THEY DO NOT RECOMMEND PUTTING GROCERIES IN THE TRUNK BECAUSE IT COULD CAUSE A DANGEROUS EFFECT. I WAS NOT TOLD OF THIS WHEN I BOUGHT MY CAR.    BMW (ANOTHER DEALER) ADVISED MY FATHER THAT THIS IS A COMMON PROBLEM AND AFFECTS ALL MODELS. THEY WILL NOT FIX IT AND WANT EVERYONE TO USE THEIR INSURANCE TO PAY FOR IT. BMW IS TOO LAZY TO PAY TO CORRECT THE ISSUE.     MY WIFE OR SOMEONE ON THE ROAD COULD HAVE BEEN INVOLVED IN A TRAFFIC ACCIDENT DUE TO THE FACT HER SPEEDOMETER WENT OUT.     THIS IS A DANGEROUS CAR. MY CAR IS STILL IN THE SHOP AS OF 7/10.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/24/2011",
        "dateOfIncident": "10/14/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378475,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "128I US",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2011 BMW 128I. THE CONTACT STATED THAT MICE WERE EATING THROUGH A CABLE THAT MADE THE CHECK ENGINE LIGHT ILLUMINATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER TWICE. THE CONTACT STATED THAT THIS VEHICLE WAS THE SECOND OF THE SAME MODEL; THE FIRST WAS TRADED IN BECAUSE OF THE SAME FAILURE. THE MANUFACTURER OFFERED NO ASSISTANCE.    UPDATED 02/16/11",
        "vin": "WBAUP7C54BV"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/02/2011",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373797,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            },
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "82110393954",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE NAVIGATION SYSTEM ON MY 2011 BMW 335I WILL TELL YOU TO TURN THE WRONG WAY, AND THEN TELL YOU TO MAKE A U-TURN.  I HAVE BEEN TURNING ONTO THE ENTRANCE RAMP TO  THE HIGHWAY AND IT WILL SAY TO MAKE A U-TURN. YOU CANNOT TRUST WHERE YOU WILL END UP IF YOU FOLLOW THE SYSTEM. IT COULD LEAD YOU TO A LOCATION THAT IS NOT SAFE. I NOTIFIED MY DEALER WHO THEN TESTED OTHER 2011'S WITH THE SAME RESULT AND TESTED 2010'S WITHOUT ANY ISSUES. THE DEALER AND I HAVE NOTIFIED BMW NA, YET NOW ALMOST 5 MONTHS LATER THEY HAVE NOT FIXED THE PROBLEM. WHEN I TALKED TO THE SUPPLIER OF THE MAPS, THEY INDICATED THEY ALSO HAD RECEIVED MANY CALLS ON THE 2011 MODEL. THE NEXT SCREEN DOES NOT LET ME SELECT THE BMW 3 SERIES. *TR",
        "vin": "WBAPM5C54BE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2010",
        "dateOfIncident": "10/03/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360031,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE HIGH PRESSURE FUEL PUMP ON BMW 2011 335I AFTER 4500 MILES    NOTE: THIS WAS A 335I. YOUR MODEL SELECTION DOESN'T NOT INCLUDE 3-SERIES SO I CLICKED 1-SERIES. *TR",
        "vin": "WBAKG7C57BE"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/05/2010",
        "dateOfIncident": "07/15/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347499,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO DISPLAY IN THE CAR HAS ITS POLARIZING FILTER OFF-SET SO THAT WHEN WEARING POLARIZED GLASSES YOU CANNOT SEE THE DISPLAY.  WHEN REQUIRED TO WEAR PRESCRIPTION GLASSES THIS IS A DISTRACTION AND A SAFETY HAZARD AS YOU HAVE TO REMOVE THE GLASSES TO SEE THE RADIO DISPLAY.    THIS IS EXPERIENCED IN THE 335I, WHICH DOES NOT APPEAR IN YOUR PULL DOWN LIST ON THE FOLLOWING PAGES  THE CLIMATE CONTROL SYSTEM HAS ITS POLARIZED FILTER CORRECTLY POSITIONED.  ONLY OCCURS IN THE CAR WHEN YOU DO NOT HAVE THE 'I'DRIVE OPTION. *TR",
        "vin": "WBAPM5G56BN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "07/03/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341539,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "1 SERIES",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT TEST DROVE A 2011 BMW 135I. WHILE DRIVING 35 MPH, THE VEHICLE SUDDENLY ACCELERATED. THE THROTTLE WAS OPEN AFTER DRIVING FOUR MILES AND THE SPEED INCREASED UP TO 80 MPH. HE WAS ABLE TO DRIVE ONTO THE EMERGENCY LANE AND HAVE THE VEHICLE TOWED BACK TO THE DEALER. THE DEALER STATED THAT THEY WOULD NOT DISCUSS THE FAILURE OR REPAIRS WITH HIM. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WERE 80.",
        "vin": "WBAUN7C57BV"
    }
]