[
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "BMS MotorSports Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10639709,
        "products": [
            {
                "manufacturer": "BMS MotorSports Inc.",
                "productMake": "BMS",
                "productModel": "SPORT FLASH 150",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 (NA) BMS MOTOR SPORT HERITAGE 150CC (NA). WHILE RIDING AT APPROXIMATELY 20 MPH, THE FRONT END OF THE SCOOTER BEGAN TO SUDDENLY WOBBLE. THE RIDER LOST CONTROL AND CRASHED. THE RIDER SUSTAINED MULTIPLE FRACTURES TO THE RIBS, STERNUM, AND SCAPULA AND ALSO SUFFERED A PUNCTURED LUNG. MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO SOLUTION WAS OFFERED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 500.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2014",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "BMS MotorSports Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558229,
        "products": [
            {
                "manufacturer": "BMS MotorSports Inc.",
                "productMake": "BMS",
                "productModel": "SPORT FLASH 150",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING THE BIKE ON A COUNTY ROAD IN THE VICINITY OF ANTONIO PKWY AND LA PROMESA IN THE COUNTY OF ORANGE ON THE ABOVE DATE. I NOTICED A MARKED DIFFERENCE IN THE STEERING OF THE BIKE. AT THE SAME TIME A MOTORIST FLAGGED ME AND POINTED TO ENGINE COMPARTMENT OF THE SCOOTER. WHEN I STOPPED I NOTICED THAT THE BRACKET THAT HOLDS THE ENGINE AND REAR WHEEL HAD FAILED. THIS IS POSSIBLY A CASTING DEFECT. ATTEMPTS TO RECTIFY THIS MATTER WITH THE DEALER HAVE BEEN NEGATIVE. THIS FAILURE CAUSED $419.86 IN DAMAGE TO THE SCOOTER, WHICH I CAN PROVIDE. HAD THE MOTORIST NOT FLAGGED ME DOWN, THIS WOULD HAVE RESULTED IN AN TRAFFIC ACCIDENT.  *TR",
        "vin": "L5YTCKPA6B1"
    }
]