[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234146,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE LEAK FROM FUEL PUMP FLANGE.   NOTICED A PUDDLE OF GASOLINE AFTER A RIDE LAST WEEK.   DURING THE RIDE , THERE WAS A STRONG SMELL OF GASOLINE.   THIS IS A VERY DANGEROUS SITUATION.     BMW ARE YOU LISTENING ?     THE PUDDLE WAS ON THE LEFT SIDE OF THE BIKE WHEN RIDING ( RIGHT SIDE IF YOU ARE FACING THE BIKE)     THIS WAS FIXED DURING A RECALL CAMPAIGN IN 2014 BUT ITS BACK AGAIN.  THIS INDICATES A SUBSTANDARD USED DURING RECALL FIX.     ITS BMW'S RESPONSIBILITY TO HAVE THIS ADDRESSED AND FIXED ASAP.",
        "vin": "WB1044002BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234286,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP OUTPUT FLANGE CRACKED, RESULTING IN FUEL LEAKING DOWN THE SIDE OF THE BIKE AND ONTO HOT COMPONENTS WHILE RIDING.   THIS ISSUE HAS ALREADY BEEN THE SUBJECT OF A BMW RECALL - BUT APPARENTLY THE \"INSPECT AND REINFORCE\" SOLUTION ISN'T REALLY ADEQUATE LONG-TERM.   THIS PUMP HAD BEEN INSPECTED AND REINFORCED - AND THE FLANGE STILL CRACKED AND CAUSED A DANGEROUS FUEL LEAK WITH THE POTENTIAL FOR BODILY INJURY OR WORSE.    ATTACHED PICTURE.     TOP SHOWS BEFORE IGNITION IS SWITCHED ON.  BOTTOM IS AFTER IGNITION IS ON.",
        "vin": "WB1044002BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205457,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2011 BMW R1200RT HAD A RECALL REPAIR PERFORMED IN 2015 TO ADDRESS A FUEL LEAK ISSUE AT THE FUEL PUMP FLANGE.  THE DEALER DID NOT REPLACE THE FUEL PUMP ASSEMBLY BUT DID A REPAIR WHICH INVOLVED INSTALLATION OF A REINFORCEMENT RING ON THE FUEL PUMP FLANGE WHICH WAS CRACKING AND LEAKING FUEL UNDER PRESSURE.  IN MARCH OF 2019 THE AREA THAT WAS REPAIRED ON THE FUEL PUMP DEVELOPED A FUEL LEAK CAUSING GASOLINE TO LEAK UNDER PRESSURE AND LEAK DOWN ONTO THE ENGINE WHICH COULD HAVE CAUGHT FIRE.  MY LEFT BOOT AND LEFT LOWER PANT LEG GOT WET WITH GASOLINE.  BMW SHOULD HAVE FIXED THIS PROBLEM PROPERLY WITH A NEW FUEL PUMP INSTEAD OF TRYING TO RIG IT UP IN 2015.  THEY HELD OFF FOR YEARS EVEN ISSUING THE RECALL UNTIL FORCED BY GOVERNMENT TO DO IT.  THEY SHOW A BLATANT DISREGARD FOR THEIR CUSTOMER'S SAFETY BY NOT FULLY REPAIRING THE VEHICLE AFTER THE RECALL WAS ISSUED.   NOW BMW CUSTOMER RELATIONS SAYS THE RECALL REPAIR IS OUT OF WARRANTY.  THIS CAUSED ME TO HAVE TO REPLACE THE FAULTY PART AT A COST OF OVER 500 DOLLARS.   THIS IMPROVED PART SHOULD HAVE BEEN INSTALLED DURING THE RECALL REPAIR INSTEAD OF TRYING TO BAND-AID THE PROBLEM.  WE ARE TALKING ABOUT HIGH PRESSURE FUEL.  THIS IS A MAJOR SAFETY CONCERN AND THE GOVERNMENT SHOULD SANCTION BMW FOR NOT PERFORMING THE RECALL PROPERLY.  CUSTOMERS THAT HAD TO GO BACK LATER AND REPAIR THEIR MOTORCYCLES FOR THIS FUEL LEAK ISSUE SHOULD BE REIMBURSED.",
        "vin": "WB1044000BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185809,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE VEHICLE GAS BEGINS TO LEAK OUT OF TANK ON LEFT SIDE OF VEHICLE. LEAK WILL CONTINUE UNTIL VEHICLE IS SHUT OFF",
        "vin": "WB1044007BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020121,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 23, 2017, I STARTED MY MOTORCYCLE AND LEFT MY HOME FOR A RIDE.  A SHORT TIME INTO THE RIDE I NOTICED THE SMELL OF GASOLINE.  I FOUND A PLACE TO PULL OVER TO CHECK OUT THE ISSUE.  WHEN I STOPPED I SAW GASOLINE FLOWING DOWN ON THE LEFT SIDE OF THE MOTORCYCLE ONTO THE GROUND, JUST PAST THE EXHAUST PIPE AND ONTO MY LEFT RIDING BOOT.  I IMMEDIATELY RETURNED HOME SLOWLY TO CHECK OUT THE LEAK.  WHEN I REMOVED THE UPPER LEFT SIDE OF THE MOTORCYCLE, I SAW GASOLINE PUDDLING AROUND THE TOP OF THE FUEL PUMP.  A METAL RING HAD BEEN INSTALLED OVER THE PLASTIC QUICK CONNECTOR ON TOP OF THE FUEL PUMP ON A PREVIOUS TRIP TO MY SERVICING DEALER ON JANUARY 24, 2015.  AT THAT TIME NO LEAK HAD BEEN DETECTED.  I THEN STARTED THE ENGINE AND SAW RAW GASOLINE STREAMING FROM THE TOP OF THE FUEL PUMP ONTO MY MOTORCYCLE AND ONTO THE GROUND.  THIS ISSUE HAS BEEN GOING ON WITH MANY OTHER OWNERS OF THESE BIKES FOR SEVERAL YEARS ACCORDING TO MY GOOGLE SEARCHES CONCERNING THIS ISSUE.  I FEEL THAT THE BMW CORP. SHOULD REPLACE THE FUEL PUMP AT THEIR EXPENSE DUE TO THE HISTORY OF DEFECTIVE FUEL PUMPS IN THE PAST AND NOW MINE.  THIS IS A VERY DANGEROUS SITUATION.  I AM VERY LUCKY THAT THIS ISSUE OCCURRED AT A LOW SPEED AND CLOSE TO MY HOME.",
        "vin": "WB1044000BZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "06/24/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013071,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE BIKE NEW. A RECALL FOR THE FUEL PUMP WAS COMPLIED WITH. TWO YEARS LATER THE FUEL PUMP STARTED SQUIRTING FUEL FROM THE INNER RADIUS AREA OF THE METAL CRIMP RING (WHICH IS THE RECALL FIX)STARTED LEAKING FUEL WAS FLOWING DOWN THE LEFT SIDE OF THE BIKE TO THE BOTTOM OF THE LEFT CYLINDER BASE. ONLY LEAKED WITH THE ENGINE RUNNING",
        "vin": "WB1044004BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006651,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP OUTPUT FLANGE CRACKED, RESULTING IN FUEL LEAKING DOWN THE SIDE OF THE BIKE AND ONTO HOT COMPONENTS WHILE RIDING. THIS ISSUE HAS ALREADY BEEN THE SUBJECT OF A BMW RECALL - BUT APPARENTLY THE \"INSPECT AND REINFORCE\" SOLUTION ISN'T REALLY ADEQUATE LONG-TERM. THIS PUMP HAD BEEN INSPECTED AND REINFORCED - AND THE FLANGE STILL CRACKED AND CAUSED A DANGEROUS FUEL LEAK WITH THE POTENTIAL FOR BODILY INJURY OR WORSE.",
        "vin": "WB1044002BZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2015",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715513,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMBINATION ENGINE RUN / START SWITCH DOES NO ENGAGE IN THE RUN POSITION DURING HOT DAYS, THUS NOT ALLOWING THE ENGINE TO START. AFTER COOLING THE SWITCH DOWN WITH AN INSTANT COOLING COMPOUND (IN THIS CASE SUPERFREEZE 2000 FROM LEONARD INDUSTRIAL SUPPLY) THE SWITCH WOULD ENGAGE, BUT THEN DISCONNECT AGAIN. THE DANGER IS THAT IF IT DISCONNECTS WHILE DRIVING THE ENGINE WILL CUT-OFF WITHOUT BEING ABLE TO RESTART IT.",
        "vin": "WB1044006BZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522464,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "SYMPTOM.  REAR OF MOTORCYCLE WEAVES WHEN RIDING IN A STRAIGHT LINE AND  IN TURNS.  REAR WHEEL HAD APPROXIMATELY 3MM PLAY WHEN HOLDING WHEEL AT 12 AND 6 O'CLOCK AND TWISTING WHEEL SIDE TO SIDE.      ANALYSIS.  BRAKE CARRIER ON FINAL DRIVE HAS LATERAL PLAY.  REMOVED BRAKE CARRIER, SLID OFF FINAL DRIVE BY HAND.  FINAL DRIVE NEEDS REPLACED.      SAME FAILURE AS DESCRIBED IN ODI 10439549 AND BEING INVESTIGATED UNDER CAMPAIGN DP 12001.  BMW PARALEVER.      RESOLUTION.  DEALER REPLACED FINAL DRIVE BMW PART NUMBER 33117726895, SYNTHETIC GEAR OIL 75 W90, AND ROTOR BOLTS BMW PART NUMBER 33177709205.    *TR",
        "vin": "WB1044009BZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/09/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435099,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT COMBINATION SWITCH ON THE VEHICLE HAS FAILED 4 TIMES. THE LEFT COMBINATION SWITCH CONTROLS THE HIGH BEAM LIGHTS, TURN SIGNALS, HORN, CRUISE CONTROL, AND NUMEROUS OTHER ITEMS. THE FOUR FAILURES HAVE INCLUDED FAILURE OF THE HIGH BEAM SWITCH TWICE, THE TURN SIGNAL SWITCH TWICE, THE HORN ONCE, AND CRUISE CONTROL ONCE.  *TR",
        "vin": "WB1044002BZ"
    }
]