[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911266,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2011 BMW R1200. THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 13V617000 (FUEL SYSTEM, GASOLINE). METAL CLAMPS WERE PLACED OVER THE FUEL PUMP FLANGE IN ORDER TO REINFORCE THE PIECE. THE CONTACT STATED THAT THE REPAIR FAILED AND THE VEHICLE WAS LEAKING FUEL FROM THE FUEL PUMP. THE VEHICLE WAS UNABLE TO BE DRIVEN. THE CONTACT WAS NOT TAKEN TO THE DEALER FOR REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 24,000. ..UPDATED 12/20/16 *BF  *TR",
        "vin": "WB1046005BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "03/09/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578398,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE QUIT WORKING. THE DEALER SAID THIS WAS DUE TO THE FUEL SENSOR.  MY BMW HAS ONLY 1100 MILES ON IT.  MULTIPLE POST ONLINE ON MY EXACT MODEL - AS WELL AS MULTIPLE SAFETY COMPLAINTS ON THIS VERY SITE TO NHTSA - SHOW THIS IS A FAIRLY COMMON PROBLEM. IT IS AN EXTREME HAZARD ON A MOTORCYCLE TO RUN OUT OF GAS AS A MOTORCYCLE BUCKS AS IT RUNS OUT OF GAS (DIES AND CATCHES, ETC.) AND I ALMOST COME OFF THE BIKE IN TRAFFIC.  AND IT MAKES LEAVING THE ROAD DIFFICULT SO A DANGER TO OTHER TRAFFIC (HTTP://WWW.STATE.NJ.US/MVC/PDF/LICENSES/MCM996.PDF).  WHAT I DON'T UNDERSTAND IS WHY NHTSA IS DOING NOTHING DESPITE MULTIPLE SAFETY COMPLAINTS ON THIS SITE OVER WHAT IS NOW A FOUR (4) YEAR PERIOD ON SOMETHING THAT HAS A SIMPLE FIX - A GAS GAUGE.  AS THE 2011 POST MAKES CLEAR, THAT OCCUPANT WAS \"ALMOST HIT FROM BEHIND, AND NEARLY CAUSED A REACTION ACCIDENT ...OF CARS ...THAT HAD TO SUDDENLY STOP AND/OR EVADE CONTACT WITH OTHER VEHICLES SLOWING DUE TO MY INABILITY TO KEEP UP IN TRAFFIC.\"  AS THAT POSTER NOTED, \" I HAVE SUBSEQUENTLY DISCOVERED MY FAULTY FUEL GAUGE ISSUE IS VERY VERY COMMON.... AFFECTING A VERY SIGNIFICANT NUMBER OF BMW R1200R MOTORCYCLES. ... THE \"REPAIR\" IS NOT NECESSARILY A GUARANTEED FIX, MANDATING THAT MANY R1200R OWNERS HAVE TO MAKE MULTIPLE TRIPS TO A BMW DEALER TO PERHAPS, AND FINALLY, RECEIVE A FUEL SENSOR STRIP THAT ACTUALLY IS FUNCTIONAL.\"  BMW HAS JUST ANNOUNCED ANOTHER RECALL FOR THIS BIKE BUT APPARENTLY IS STALLING NHTSA ON THIS ISSUE.    MY DEALER IS BMW OF FT. WORTH AND THEY WERE HAPPY TO TELL ME MY WARRANTY EXPIRED TWO WEEKS BEFORE HAD IT BROUGHT BACK  IN TO BE FIXED (IT ONLY HAS 1100 MILES) AND I COULD EITHER PAY HUNDREDS OF DOLLARS -OR- JUST PICK IT UP AS IS WITH A NON-FUNCTIONING AND DANGEROUS FUEL GAUGE.  NO CONCERN WHATSOEVER FOR MY SAFETY OR THE RISK CAUSED BY OPERATING A MOTORCYCLE WITH A DEFECTIVE GAUGE.    *TR",
        "vin": "WB1049007BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "02/23/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500556,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE SHOWED A RAPID LOSS OF FUEL, INDICATING A NEARLY FULL TANK ONE MOMENT AND THEN CHANGING TO INDICATE AN EMPTY TANK IN MATTER OF SECONDS.  THIS WAS VERY DISTRACTING ON THE HIGHWAY AND COULD PROVE DANGEROUS AND LEAD TO AN ACCIDENT..     *TR",
        "vin": "WB1049001CZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "02/24/2013",
        "dateOfIncident": "03/27/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499834,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE QUIT WORKING. THE DEALER SAID THIS WAS DUE TO A FAULTY FUEL SENSOR AND THIS WAS A FAIRLY COMMON PROBLEM. HE BLAMED THE ETHANOL IN THE GAS AND SAID WE NEEDED TO USE AN ADDITIVE TO PREVENT IT.  *TR    IF YOU RELY ON YOUR GAS GAUGE (WHO DOESN'T) AND IT READS FULL OR PART FULL AND YOU RUN OUT OF GAS IN TRAFFIC YOUR VEHICLE COULD STOP AND GET HIT.",
        "vin": "WB1049009BZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2013",
        "dateOfIncident": "07/06/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498401,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW R1200R MOTORCYCLES IS EQUIPPED WITH A FUEL GAUGE.  THE GAUGE VERY COMMONLY FAILS, ALLOWING THE OPERATOR TO BELIEVE HE/SHE HAS SUFFICIENT FUEL TO CONTINUE.  IN MY CASE, I WAS ACCELERATING WHILE ENTERING A CONGESTED FREEWAY WHEN I SUDDENLY RAN WHOLLY OUT OF FUEL.  I WAS ALMOST HIT FROM BEHIND, AND NEARLY CAUSED A REACTION ACCIDENT COMPOSED OF CARS BEHIND ME THAT HAD TO SUDDENLY STOP AND/OR EVADE CONTACT WITH OTHER VEHICLES SLOWING DUE TO MY INABILITY TO KEEP UP IN TRAFFIC.      I HAVE SUBSEQUENTLY DISCOVERED MY FAULTY FUEL GAUGE ISSUE IS VERY VERY COMMON.... AFFECTING A VERY SIGNIFICANT NUMBER OF BMW R1200R MOTORCYCLES.   WHILE THE FAULTY GAUGE ISSUE IS ADDRESSED BY BMW (IF THE BIKE IS UNDER WARRANTY), THE REPLACEMENT FUEL SENSOR STRIP (THE FAULTY PART) IS OF THE SAME STYLE AS THE ORIGINAL FUEL SENSOR STRIP.  THUS, THE \"REPAIR\" IS NOT NECESSARILY A GUARANTEED FIX, MANDATING THAT MANY R1200R OWNERS HAVE TO MAKE MULTIPLE TRIPS TO A BMW DEALER TO PERHAPS, AND FINALLY, RECEIVE A FUEL SENSOR STRIP THAT ACTUALLY IS FUNCTIONAL.  *TR",
        "vin": "WB1049000BZ"
    }
]