[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453690,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "Check airbag sensor keeps coming on intermittently.",
        "vin": "19uua8f29ca"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving in heavy traffic and making a right turn,the power steering screen began to blink and immediately the power steering locked up. I had to manually turn the wheel and was able to over to the side and stop. After several minutes, the wheel finally unlocked and I pulled into a parking lot where it occurred again. I turned the key on and the unlocked wheel began to work again After making it home, I checked the drivers manual and found nothing. I checked complaints and found 95 instances but no recalls. It was very frightening for this situation and dangerous. This happened on July 14,2021.",
        "vin": "19uua9f53ca"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399907,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT WAS DRIVING AT 60 MPH WHEN SHE HEARD AN EXPLOSION AND PULLED OVER ON THE SIDE OF THE HIGHWAY. THE CONTACT STATED THAT THE SUNROOF GLASS HAD EXPLODED. THE CONTACT INFORMED THE MANUFACTURER OF THE FAILURE AND WAS INFORMED TO CONTACT HER INSURANCE COMPANY SO THEY CAN PAY FOR THE SUNROOF REPLACEMENT. THE CONTACT WAS INFORMED THAT THERE WAS NO WARRANTY COVERAGE ON THE VEHICLE. THE CONTACT WAS REFERRED TO THE DEALER FOR A DIAGNOSIS TO VERIFY WHETHER THE FAILURE WAS CAUSED BY A FOREIGN OBJECT OR NOT. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 112,000.",
        "vin": "19UUA8F23CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOME JERKINESS WHEN CAR SWITCHES GEARS. READ IT COULD BE THE TORQUE CONVERTER OR BE FIXED WITH A SOFTWARE UPDATE. I HAD THE SOFTWARE UPDATE ALREADY.",
        "vin": "19UUA8F22CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349979,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS JUMMPY GEAR SHIFTING WHEN GEAR MOVES FROM 1ST TO 2ND AND 2ND TO 3RD. IT FEELS LIKE GEAR SLIPS WHILE CHANGE GEAR.",
        "vin": "19UUA8F59CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR FROM THE DEALERSHIP ABOUT APRIL OF 2019 WITH 59920 MILES AND THE RECALL WAS NOT FIXED NOW THEY ASKED ME TO DO A TEST TO BRING THE CAR BACK AND FOURTH ONLY TO RUN UP THE MILES AND TIME FRAME TO NOT FIX THE PROBLEMS THAT HAS OCCURRED FROM THE RECALL NOT BEING FIXED THERE WAS ALSO A LAWSUIT DOCUMENT SEND TO ME HOME STATING THEY WOULD FIX THE RECALL FOR FREE AND AT THIS POINT MY CAR COULD BRING DOWN ANY DAY I AM A FEDERAL EMPLOYEE OF THE UNITED STATES GOVERNMENT SOMETHING NEEDS TO BE DONE IMMEDIATELY THEY ARE SELLING PEOPLE DEFECTED CAR / LEMONS WITH OUT CONSEQUENCE AND NOT FIXING THE RECALL BEFORE THEY ARE BOUGHT.  *TR",
        "vin": "19UUA9F50CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323783,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN EXCESSIVELY USING OIL SINCE I BOUGHT IT.  HAVE IT DOCUMENTED BY THE DEALER WHEN TAKING IT FOR OIL CHANGES ABOUT THE OIL CONSUMPTION.  CAMPAIGN IS RELEASED FOR OIL CONSUMPTION AND I AM TOLD DON'T QUALIFY B/C NOW I SUPPOSED HAVE THREE OIL LEAKS.  I HAVE NEVER SAW OIL IN MY DRIVEWAY.  CALLED ACURA CLIENT SERVICES, USELESS.  DIDN'T HELP ME AT ALL.  FEEL THEY JUST RELEASED IT TO SHOW THEY ARE DOING SOMETHING WHEN, THEY AREN'T HELPING THE OWNERS.   NOW ENGINE HAS A TICK TO IT AT 120,000 AND I AM TOLD MY REAR CAM SHAFT AND ROCKER ARMS ARE DETERIORATING.  I CAN'T BELIEVE THIS.  THIS CAR HAS BEEN NOTHING BUT A NIGHTMARE.  IT WAS ONE THING AFTER ANOTHER.  MY REPAIR FILE IS INTO TWO FILE FOLDERS.  I PAID FOR RELIABILITY AND THAT IS NOT WHAT I GOT.  VERY DISAPPOINTED - THIS WAS A HORRIBLE ENGINE DESIGN, NO WONDER THEY STOP PRODUCING IT.  *TR",
        "vin": "19UUA9F27CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316486,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK AIR BAG SYSTEM MESSAGE ON AND OFF RANDOMLY WHILE DRIVING.",
        "vin": "19UUA9F58CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TACHOMETER WILL HUNT UP AND DOWN A FEW HUNDRED RPM UNDER LIGHT ACCELERATION. THE AUTOMATIC TRANSMISSION SEEMS TO SHIFT HARSHLY AND ALSO SHIFTS UP AND DOWN DURING ACCELERATION AT TIMES",
        "vin": "19UUA8F21CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258628,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE DOWN THE ROAD VEHICLE SHUT OFF UN-COMMANDED. CAR CAME TO STOP WHILE IN TRAFFIC. PLACED CAR IN PARK AND RE-STARTED. DROVE APPROXIMATELY 10 MILES AND CAR SHUT OFF AGAIN WHILE DRIVING. CAR CAME TO A STOP IN TRAFFIC PLACED CAR IN PARK AND RE-STARTED. DROVE CAR APPROXIMATELY 6 MILES HOME AND PARKED IT.",
        "vin": "19UUA9F54CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257463,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. WHILE OPERATING THE VEHICLE, A KNOCKING NOISE WAS HEARD COMING FROM THE ENGINE COMPARTMENT. ALSO, THE VEHICLE EXPERIENCED EXCESSIVE OIL CONSUMPTION. THE CAUSE OF THE FAILURES WAS NOT DETERMINED. ACURA FIRST (16 HIGHLAND AVE, RT 6 SEEKONK, MA) WAS NOTIFIED OF THE FAILURES. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 123,000.",
        "vin": "19UUA9F22CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256672,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE FOR 8 MIN AT 70 MPH ON A 70 DEGREE MORNING WHEN I LOST POWER TO THE ENGINE. LUCKILY, I WAS ABLE TO PULL OVER TO THE SHOULDER. MY CERTIFIED MECHANIC DIAGNOSED THE ENGINE LOST ALL COMPRESSION. THE CAR HAS 98,000 MI. I CALLED ACURA CLIENT SERVICES AND THEY STATED IT HAD TO BE DIAGNOSED BY ACURA DEALER. THE DEALER STATED IT WAS A BLOWN ENGINE AND THEY HAVE NO IDEA HOW IT HAPPENED. I CALLED ACURA AGAIN AND THEY STATED THERE WAS NOTHING THEY COULD DO. I STATED SOMETHING UNUSUAL HAS HAPPENED AND IT SHOULD BE RESEARCHED TO UNDERSTAND WHY. ENGINES SHOULDN'T JUST FAIL. ACURA STATED THE VEHICLE IS OUT OF WARRANTY AND THE CUSTOMER WOULD HAVE TO PAY FOR THE DIAGNOSIS BEFORE THEY WOULD REVIEW THE CLAIM. I PAID THE DEALER TO TEST. THE DEALER FILLED THE SYSTEM WITH FLUIDS AND SET THE VEHICLE OUTSIDE. HE CHECKED FOR LEAKS EVERY FEW HOURS. I TOLD HIM IT WAS A SLOW LEAK AND HE HAD TO MONITOR IT CLOSELY. THE DEALER STATED HE COULDN'T FIND ANY ISSUE. I CALLED ACURA AND TOLD THEM THE TEST WAS NOT CONDUCTED PROPERLY. ACURA STATED THE DEALER CAN'T FIND THE ISSUE AND NO MORE INVESTIGATION CAN BE DONE. I ASKED ACURA WHY THEY ARE NOT HAVING THEIR FIELD TEAM REVIEW THIS INCIDENT. ACURA STATES IT'S A CUSTOMER ISSUE NOT AN ACURA ISSUE. WITHOUT CONDUCTING THE PROPER TESTING & DIAGNOSIS THAT CONCLUSION CANNOT BE MADE. ACURA REFUSES TO AUTHORIZE THE DEALER TO INVESTIGATE THE DEFECT PROPERLY.     ACURA REFUSES TO HAVE THEIR FIELD TECHNICIANS, WARRANTY GROUP, AND SUPPLIER REVIEW THE DEFECT, ASKS THE CUSTOMER TO PAY TO DIAGNOSE THE PROBLEM. ACURA'S POLICY TO NOT REVIEW MAJOR FIELD ISSUES WITH THEIR VEHICLES OUTSIDE OF WARRANTY IS A DANGEROUS POSITION ESPECIALLY WHEN IT IS A MAJOR SAFETY ISSUE WITH A BLOWN ENGINE. ACURA'S CORPORATE STRATEGY TO SUPPRESS AN INVESTIGATION UNTIL A MAJOR INCIDENT HAPPENS CREATES A POTENTIAL RISKY PRODUCT LIABILITY WITH ALL THEIR CUSTOMERS.",
        "vin": "19UUA8F59CA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S ELECTRONIC POWER STEERING SYSTEM FAILS AND THE CAR IS NEAR TO IMPOSSIBLE TO STEER WHEN DRIVING DUE TO THE SYSTEM FAILING. DIFFICULT RESISTANCE IS EXPERIENCED IN MOTION ON CITY STREETS, HIGHWAYS AND BEING STATIONARY.",
        "vin": "19UUA8F22CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241158,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RED AIRBAG LIGHT & MY CHECK AIRBAG SYSTEM LIGHTS COMES ON AND OFF WHILE STATIONARY. WHEN IT COMES ON IT STAYS ON FROM ONE DESTINATION TO THE NEXT. WHEN I RETURN BACK TO THE CAR TO START IT AGAIN ITS NOT ON, BUT IF I WAIT A WHILE TO GO TO ANOTHER DESTINATION THE CHECK AIRBAG SYSTEM LIGHT COMES BACK ON AGAIN.",
        "vin": "19UUA8F56CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OIL CONSUMPTION WHEN THERE ARE NO LEAKS DETECTED UNDERNEATH.  THIS PAST WEEK MY ENGINE LIGHT CAME ON, THIS IS THE THIRD TIME THIS HAS HAPPENED.  I ADDED 2 QUARTS OF OIL WHEN I AM ONLY 50% THROUGH THE USE UNTIL MY NEXT OIL CHANGE.",
        "vin": "19UUA9F52CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221816,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECIEVED RECALL ON TORQUE CONVERTER .SO I TOOK IN FOR SERVICE BUT ALL THEY(ACURA SERVICE)DID WAS FLUSH TRANSMISSION .MY CAR RUNNING HORIBLE IT HAD NO POWER HAD NO ACCELERATION IT JUDDER BETWEEN 35-45MPH NOISE ON BUMPY ROAD NOT SAFE IF YOU TRY TO PASS OTHER.I HAVE TAKEN IN FOR SERVICE 5 TIMES TWO DIFFERRENT DRALERSHIP90",
        "vin": "19UUA8F57CA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208409,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS STOPPED AT A STOP SIGN AWAITING A BREAK TO ENTER INTO HEAVY TRAFFIC I SAW A GAP AND PRESSED THE GAS PEDAL BUT THE ENGINE DID NOT RESPOND. I GENTLY PRESSED UNTIL IT WAS ABOUT 1/4 DOWN AND STILL NOTHING HAPPENED. I THEN GENTLY PRESSED IT A LITTLE MORE AND THE CAR BOLTED FORWARD AT A DANGEROUS SPEED DIRECTLY INTO TRAFFIC WHICH COULD HAVE ALMOST KILLED ME. THIS WAS JUST ONE SITUATION, THERE ARE MANY OTHERS. THIS PROBLEM DOESN'T HAPPEN ON A PREDICTABLE BASIS AND CANNOT BE DUPLICATED WHEN DESIRED. THIS HAS HAPPED DOZENS OF TIMES OVER THE YEARS. I HAVE TAKEN IT TO THE DEALERSHIP WHILE IT WAS UNDER WARRANTY AND THEY SAID THAT THEY COULD NOT DUPLICATE THE SITUATION THEREFORE CANNOT DO ANYTHING ABOUT IT. I SPOKE TO SOMEONE THERE AND HE SAID THAT HE HAS HAD THE SAME PROBLEM WITH ONE OF THEIR FLEET VEHICLES AND HAD TO REPLACE THE APP ( ACCELERATOR PEDAL POSITION SENSOR) 2 TIMES FOR THE SAME PROBLEM. I PRESENTED THE PROBLEM TO THE DEALERSHIP SHORTLY AFTER BUYING THE CAR AND A COUPLE TIME AFTERWARDS OVER TIME TO GET THE SAME COMMENT THAT THEY COULD NOT DUPLICATE IT. LATELY IT HAS BECOME WORSE.  Q#1 WHAT LAW COVERS A SITUATION WHEN AN OWNER PRESENTS THE SAME PROBLEM TO A DEALERSHIP DURING THE WARRANTY COVERAGE PERIOD AND IT IS DOCUMENTED AND AFTER THE WARRANTY EXPIRES - IS IT STILL COVERED UNDER MFG EXPENSE? BASICALLY, IF A CAR IS TAKEN IN FOR A PROBLEM UNDER THE WARRANTY PERIOD AND THE SAME PROBLEM EXISTS AFTER THE WARRANTY EXPIRES IS IT STILL COVERED.   IN MY OPINION I BELIEVE THAT  THEY DENIED THAT THE PROBLEM EXISTED BECAUSE THIS WOULD PROVOKE A MASSIVE RECALL THAT THEY DIDN'T WANT TO PAY FOR. WHAT OPTIONS DO I HAVE TO MAKE THEM ACKNOWLEDGE THE PROBLEM AND REPAIR IT AT THEIR EXPENSE. Q#2 WHAT CAN I DO AT THIS STAGE? Q#3 WHAT CAN YOU DO AT THIS STAGE TO ENFORCE THIS?",
        "vin": "19UUA8F2XCA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192833,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE RECALL DONE ON THE TAKATA STEERING WHEEL AIRBAG, THEN IN JAN 2019 I GOT A AIRBAG WARNING 31-1 AIRBAG SYSTEM.  ACURA RESET THE WARNING , BUT 3 MONTH LATER IT HAPPEN AGAIN AND NOW I NEED TO REPLACE THE DRIVERSIDE AIRBAG CURTAIN.  THIS IS NOT COVERED ANYMORE, BUT I WOULD THINK ACURA WOULD HELP THERE LONG TERM CUSTOMERS.",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192595,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2012 ACURA WITH 20 MILES ON IT IN SEPT 2012.  MY POWER STEERING WENT OUT IN APR 2015.  I COULD NOT STEER THE VEHICLE GOING DOWN A WINDING ROAD.  IT TOOK A LOT OF EFFORT JUST TO STEER IT SLIGHTLY.  ACURA DEALERSHIP WHERE I BOUGHT IT WAS ABLE TO REPLACE THE POWER STEERING RACK AND CONTROL UNIT UNDER WARRANTY.  ON 3/29/2019 I EXPERIENCED THE SAME ISSUE.  THANKFULLY I WAS IN MY DRIVEWAY AT THE TIME.  I TURNED THE VEHICLE OFF AND TURNED IT BACK ON A FEW MINUTES LATER.  THE POWER STEERING ERROR CODE WENT OFF HOWEVER WHEN I STEERED THE VEHICLE WHICH IN PARK THE STEERING WHEEL WOULD MOVE TO THE LEFT OR RIGHT WITHOUT THE WHEEL TURNING.  I THEN TURNED IT OFF FOR A WHILE AND TRIED AGAIN AND IT SEEMS TO WORK.  HOWEVER, I AM NOT COMFORTABLE WITH THIS ISSUE AS IT IS A REAL SAFETY CONCERN WHILE DRIVING.  I CALLED THE RECALL LINE FOR HONDA AND THEY SAID THERE IS NO RECALL FOR THIS ISSUE ON THIS MAKE AND MODEL.  I CALLED THE DEALERSHIP AND THEY SAID THE FIX THEY DID IN 2015 IS NOT UNDER WARRANTY.",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192515,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. WHEN THE VEHICLE WAS STARTED, THE STEERING WHEEL FAILED TO TURN AND THE POWER STEERING WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO DAVID MCDAVID ACURA PLANO (LOCATED AT 4051 W PLANO PKWY, PLANO, TX 75093, (214) 516-7503), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 09459640. THE APPROXIMATE FAILURE MILEAGE WAS 62,000.",
        "vin": "19UUA8F24CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186841,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT SOON AFTER THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS), THE CONTACT TOOK THE VEHICLE TO DON CARLTON ACURA (918-664-2300, LOCATED AT 4905 S MEMORIAL DR, TULSA, OK 74145) FOR A CHECK-UP. THE DEALER DIAGNOSED THAT THE DRIVER'S SIDE AIR BAG NEEDED TO BE REPAIRED. THERE WAS NO WARNING INDICATOR ILLUMINATED AND THE CONTACT WAS INFORMED THAT THERE WAS NO RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000.",
        "vin": "19UUA8F57CA"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162670,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "HI I'M WANTING TO COMPLAIN ABOUT THIS YEAR ACURA MAKING MODELS BREAKS BECAUSE IN THE WINTER TIME WHEN YOU GO TO PRESS THE BRAKES AND START THE CAR THE BRAKES ARE COMPLETELY FROZEN. ALSO WANTED TO COMPLAIN ABOUT THE HEADLIGHTS THE HEADLIGHTS GET DULL AND DINGY WITH WEAR IN TEAR AND GET VERY DULL CAUSING IT TO BE VERY HARD TO SEE AT NIGHT AS WELL AS THE BODY ALL THE MOLDING ON THE TOP OF THE ROOF IS PEELING OFF THE CHROME TRIM MOLDING PLEASE LOOK INTO THIS FURTHER. MY CAR IS A DAILY DRIVER I DRIVE IT EVERYDAY I GET IT A CAR WASH EVERY OTHER DAY BUT THAT SHOULD BE NO REASON FOR THE TOP CHROME TRIM ON THE ROOF TO START PEELING OFF AND BE COMING UNDONE FROM YOUR CAR",
        "vin": "19UUA9F76CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161235,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME OFF WORK LAST NIGHT GOT INTO MY CAR START IT UP AND GOT A CHECK POWER STEERING WARNING ON MY DASHBOARD. VEHICLE STEERING WHEEL IS ALMOST IMPOSSIBLE TO TURN. VEHICLE IS NOT DRIVABLE. PROBLEM OCCUR WHILE VEHICLE WAS STATIONARY IN A PARKING LOT. TURN VEHICLE OFF AFTER A FEW MINUTES AND RESTART VEHICLE AND PROBLEM WENT AWAY. SAME EXACT THING HAPPENED AGAIN THIS MORNING WHILE VEHICLE WAS STATIONARY.",
        "vin": "19UUA8F27CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160679,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLES 6 SPEED AUTOMATIC TRANSMISSION RANDOMLY  DOWNSHIFTS AND SLIPS ON 3RD AND 4TH GEARS ON BOTH CITY AND HIGHWAYS. IT MAKES THE CAR UNSAFE TO DRIVE CAUSE YOU COULD GET REAR ENDED CAUSE RANDOM DOWNSHIFT WILL CAUSE THE CAR TO SLOW DOWN FROM 65MPH TO 15MPH  IN A MATTER OF SECONDS",
        "vin": "19UUA9F58CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144446,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION, ENGINE KNOCKING AND CAR FELT OUT OF POWER SPECIALLY IN LOW IN SPEED. FEW TRIPS TO ACURA BUT WAS TOLD THEY COULDN'T FIND ANY PROBLEM. I END UP GETTING RID OF THE CAR  AND AFTER FEW MONTHS I BOUGHT  OTHER TL SAME YEAR AND MILES AND UNFORTUNATELY HAVE A SAME PROBLEM. ITS USING 70 PERCENT OF OIL WITH IN A MONTH AND AROUND 12000 MILES...SO I HAVE TO FILL UP OIL BUT MAJOR ISSUE IS WHILE I AM TRYING TO ACCELERATE 50 PERCENT OF THE TIME CAR MOVE VERY SLOW WITH ENGINE KNOCKING SOUND AND FEW TIMES GOT HONKED BECAUSE OF THE CAR COMING BEHIND ME WHEN YOU JUST MADE A RIGHT TURN AND ALSO WHEN TAKING OF FROM STOP SIGN OR AT THE LIGHT IT FELT SO SLUGGISH .THIS IS MY 6TH TL BUT I NEVER HAD A PROBLEM IN LAST 4 BECAUSE MAY BE OLDER MODEL BUT LAST 2 2012 I HAVE  EXPERIENCE THE SAME PROBLEM.",
        "vin": "19UUA9F52CA"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "07/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/20/2017, I WAS DRIVING ON I-680 S TOWARDS FREMONT CA. I WAS DRIVING ROUGHLY 70 MPH. WHEN I WAS ABOUT TO PASS A CAR, ALL OF A SUDDEN, THE ENGINE LOST POWER. I HIT THE GAS PADDLE ALL THE WAY DOWN, AND IT DIDN'T WORK. AS I FELT A SIGNIFICANT LOSS OF POWER, I PULL OVER TO THE SIDE AND STOPPED THE VEHICLE. THE ENGINE SHUT DOWN IMMEDIATELY WHEN I CAME TO A COMPLETE STOP. I TRIED TO RESTART MY CAR, BUT IT DOES NOT WORK, AND THE ENGINE CHECK LIGHT POPPED UP. I HAD MY INSURANCE TOWED MY CAR TO OAKLAND ACURA, AS I DID AN OIL CHANGE THERE ON 7/19/2017. AFTER AN INSPECTION, OAKLAND ACURA INDICATED THAT THE INTAKE AND EXHAUST VALVE DOES NOT OPEN AND CLOSE NORMALLY. A VALUE ADJUSTMENT WILL SOLVE THE PROBLEM. I FELT THAT IT'S PRETTY IMPOSSIBLE FOR ALL THE VALVES TO BE MALFUNCTION ALL AT ONCE. THUS, I ASKED THE TECHNICIAN ARE ALL THE VALVES MALFUNCTIONING, THE TECHNICIAN SAID SHOULD BE. I THEN ASKED WHETHER SUCH A PROBLEM IS CAUSED BY AN IMPROPER OIL CHANGE SINCE THEY DID MY OIL CHANGE THE DAY BEFORE, AND I ONLY DROVE 25 MILES AFTER THE OLI CHANGE. THE TECHNICIAN SAID, \"I DON'T THINK SO\". I FURTHER ASKED WHETHER IT'S AN ENGINE DESIGN PROBLEM THAT IS SUBJECT TO A RECALL, THE TECHNICIAN COMMENTED THAT THESE ENGINES LAST FOREVER. THUS, THEY DID A VALVE ADJUSTMENT FOR ME, EVEN THOUGH I DON'T KNOW WHAT THEY REALLY DID. I GOT CHARGED FOR $499 FOR THIS VALVE ADJUSTMENT. I ALSO NOTICED THAT WHEN I STARTED MY ENGINE (ESPECIALLY IN COLD WEATHER), MY CAR HAS A BUBBLING NOISE. I NOTICED THAT ON MANY ACURA FORUM, MANY ACURA TL OWNERS HAVE THE SAME PROBLEM. I ASKED OAKLAND ACURA TO LOOK INTO THIS. THE CONCLUSION THEY GAVE ME WAS INCONCLUSIVE.     I WANT TO REPORT THIS ISSUE BECAUSE IT WAS REALLY DANGEROUS THAT AN ENGINE LOST POWER COMPLETELY ON A HIGH WAY. I AM NOT SURE IF IT'S AN ENGINE DESIGN PROBLEM OR NOT, SO I THOUGHT I SHOULD REPORT THIS.",
        "vin": "19UUA8F55CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN ACURA TL 2012. LAST WEEK WHEN I WAS DRIVING I SUDDENLY SAW THE STEERING WONT TURN ALL OF A SUDDEN. IT BECAME SO HARD TO TURN THE STEERING. LUCKILY I WAS ABLE TO STOP THE VEHICLE WITHOUT AN ACCIDENT. I LATER GOT THE VEHICLE TOWED TO ACURA DEALER AND THEY DIAGNOSED THAT THE EPS UNIT (ELECTRICAL POWER STEERING) FAILED.     I LATER DID RESEARCH ON NHTSA'S WEBSITE AND FOUND THAT LOT OF ACURA TL AND TSX CUSTOMERS OF 2012 ALSO HAVE REPORTED THE EXACT SAME ISSUE. THIS IS A SERIOUS SAFETY ISSUE AND MIGHT RESULT IN SEROUS ACCIDENTS AND INJURIES. SHOULDN'T THIS BE A MANUFACTURER RECALL WITH SO MANY ACURA TL 2012 CUSTOMERS REPORTING THE SAME PROBLEM?    THE ACURA DEALER WHERE I GOT THE PROBLEM FIXED CHARGED ME ABOUT 1000 BUCKS TO FIX THE ISSUE WHILE IT TRULY SHOULD BE A PROBLEM THAT MANUFACTURER SHOULD RECALL AND FIX.",
        "vin": "19UUA8F25CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129120,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC POWER STEERING FAILURE.  I HAD JUST DRIVEN MY ACURA FOR APPROXIMATELY 60 MILES AND STOPPED TO GET A BOTTLE OF WATER.  WHEN I CAME BACK OUT AND RESTARTED THE CAR, THE EPS FAILURE WARNING APPEARED IN THE INFO CENTER AN A CODE 32 SHOWED UP IN THE MESSAGE CENTER..  I HAD TO DRIVE MY VEHICLE FOR OVER 700 MILES UNTIL I WAS ABLE TO GET IT TO MY LOCAL ACURA DEALER.  THEY DIAGNOSED THE PROBLEM AND ORDERED A NEW EPS MODULE.  TOTAL COST OF THE REPAIR EXCEEDED $1100.  I CONTACTED ACURA TO REQUEST A GOODWILL DISCOUNT SINCE I HAVE NEVER EXPERIENCED A CATROPHIC STEERING FAILURE IN ANY VEHICLE.  THEY TOLD ME THAT SINCE I WAS NOT THE ORIGINAL PURCHASER OF THE VEHICLE, THEY WOULD NOT ASSIST.    THE CAR IS OUTSIDE THE WARRANTY, HOWEVER IT SEEMS RIDICULOUS THAT A CRITICAL COMPONENT PART THAT FAILS WITHIN THE FIRST 10 YEARS OR 150,000 MILE IN A NEW VEHICLE IS UNCOMPREHENSIBLE TO ME.  I HAVE NEVER HAD A POWER STEERING SYSTEM FAIL COMPLETELY.  I ASKED FOR HOW MANY FAILURES HAVE OCCURRED AND THE WOULD NOT ANSWER THIS QUESTION.  UNFORTUNATELY WHEN I EXPERIENCED AN ISSUE WITH A ENGINE SURGE, QUESTIONING THE AUTOMATIC TRANSMISSION AS A CULPRIT THEY GAVE ME THE SAME BLANKET ANSWER THAT THEY HAD NOT EXPERIENCED ANY PROBLEMS WITH THIS ISSUE.  I FOUND THE SOLUTION TO THIS ISSUE ON AN ACURA FORUM.",
        "vin": "19UUA9F73CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123159,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC POWER STEERING WENT OUT WHILE DRIVING ON THE HIGHWAY. I ALMOST CRASHED WHEN TRYING TO MOVE THE CAR TO A SAFE PLACE. LUCKILY I HAD ENOUGH STRENGTH TO STEER THE CAR WITHOUT POWER STEERING BUT A SMALLER WEAKER PERSON COULD HAVE CRASHED HURTING THEMSELVES AND OTHERS. NO WARNING OR INDICATION IT WAS WEARING OUT. THE CAR HAS RELATIVELY LOW MILES AND ALL OF THE MAINTENANCE HAS BEEN DONE ON TIME.      ACURA (HONDA) IS AWARE THIS IS A KNOWN ISSUE AND ACCORDING TO THE DEALERSHIP SERVICE DEPARTMENT THEY ARE EVEN WILLING TO COVER THE COSTS OF SOME OF THE REPAIRS. THEY KNOW ABOUT THIS ISSUE BUT WILL NOT ISSUE A RECALL.",
        "vin": "19UUA8F25CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/26/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON STARTUP, POWER STEERING DOES NOT WORK. VERY DIFFICULT TO TURN THE WHEEL. ERROR CODE 32-09 CAME UP WHEN TAKEN TO ACURA DEALERSHIP, AND DEALERSHIP CLAIMS THEY CANNOT DUPLICATE ISSUE AFTER CAR WAS TOWED THERE. ISSUE REOCCURED AFTER 8 SHORT TRIPS. LOW MILEAGE ON THE CAR.",
        "vin": "19UUA9F57CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113035,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TUESDAY, JULY 3RD, 2018, AT AROUND 8:30 AM WHILE DRIVING ON THE HIGHWAY A POWER STEERING FAILURE MESSAGE POPPED UP ON THE DASHBOARD, AND THE WHEEL BECAME RIGID, AND EXTREMELY DIFFICULT TO TURN. I PULLED OVER TO THE SHOULDER, AND CALLED THE DEALER SERVICE AT LEHIGH VALLEY ACURA.    I WAS TOLD THEY COULD NOT LOOK AT THE VEHICLE UNTIL FRIDAY, JULY 6TH AT THE EARLIEST, AND WAS INSTRUCTED TO TURN OFF THE CAR, LET IT SIT FOR THREE MINUTES, AND RESTART BECAUSE THE COMPUTER PROBABLY JUST NEED TO BE REBOOTED. THAT CLEARED THE ISSUE. I THEN DROVE THE CAR HOME, AND KEPT THE DRIVING TO SHORT TRIPS (1-10 MILES). I MADE AN APPOINTMENT FOR A DATE ABOUT TWO WEEKS OUT JUST TO HAVE IT DOUBLE CHECKED, BECAUSE THAT WAS THE FIRST DAY THEY HAD A LOANER VEHICLE, AND I THOUGHT FOLLOWING THE SERVICE CENTER REPRESENTATIVES ADVICE HAD FIXED AN ISOLATED OCCURRENCE,  ON SUNDAY, JULY 8TH THE SAME INDICATOR CAME ON, AN WOULD NOT CLEAR, EVEN FOLLOWING THE EARLIER ADVICE FROM THE SERVICE CENTER.    I HAD THE VEHICLE TOWED TO THE DEALER SERVICE CENTER ON MONDAY. THE VEHICLE WAS FIXED ON TUESDAY. IT NEEDED A NEW STEERING COMPONENT WHICH COST ME $1120. I ASKED WHY THIS WASN'T TREATED AS A MANUFACTURER'S DEFECT, OR A SAFETY RECALL, SINCE I HAD SEEN MULTIPLE INSTANCES DESCRIBING THE SAME ISSUE IN A SIMPLE GOOGLE SEARCH.  THE SERVICE REPRESENTATIVE SAID THAT THEY DIDN'T SEE IT THAT WAY.    I'M VERY CONCERNED THAT A CRITICAL SAFETY ISSUE WAS TREATED SO NONCHALANTLY, AND THAT THE COMPANY PASSED THE COST THE CORRECT THE ISSUE TO THE ME (THE CUSTOMER).    ALSO, I SHOULD MENTION, THE VEHICLE HAS ALWAYS BEEN MAINTAINED AT THAT SERVICE CENTER (LEHIGH VALLEY ACURA), AND HAD BEEN THERE FOR THE YEARLY INSPECTION A MONTH OR TWO BEFORE THIS ISSUE.    I CAN PROVIDE THE SERVICE BILL IF REQUESTED.  *TR",
        "vin": "19UUABF26CA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WARNING LIGHTS CAME ON AND THEN THE STEERING COMPLETELY WENT OUT WHILE DRIVING. THIS WAS A VERY DANGEROUS SITUATION. MY WIFE WAS BARELY ABLE TO GET THE CAR OFF THE ROAD. THIS HAPPENED TWICE. THE FIRST TIME, THE SERVICE DEPARTMENT REPLACED THE BATTERY AND TWO DAYS LATER IT HAPPENED AGAIN. IT TURNED OUT TO BE THE EPS MODULE. THIS WAS VERY SCARY AND DANGEROUS.",
        "vin": "19UUA9F74CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WENT IN FOR 100K SERVICE. VEHICLE WAS DIAGNOSED AS ALSO NEEDING VALVE ADJUSTMENT. WHILE VALVES WERE BEING ADJUSTED A BAD CAMSHAFT WAS IDENTIFIED AS CAUSE OF NOISE. I PAID TO HAVE CAMSHAFT REPLACED BUT HAVE BEEN IN AUTOMOTIVE FIELD 50 YEARS SO I KNOW UNLESS THERE IS A PROBLEM THIS IS NOT A NORMAL WEAR ITEM..  I ASKED FOR THE OLD PARTS AFTER THE REPAIR. INSPECTION OF THE OLD CAMSHAFT SHOWED ONLY ONE LOB HAD UNUSUAL WEAR WHICH AGAIN IS UNUSUAL. I DID A ROCKWELL HARDNESS TEST ON THE SUSPECT LOBE AND THE VERY NEXT LOBE AND FOUND A SIGNIFICANT DIFFERENCE IN HARDNESS. THE NON WORN LOB WAS 47.9C AND THE FAILED LOB MEASURED 42C. I LOOKED ON LINE AND NOTICED MANY OTHER ACURA/HONDA OWNERS HAD POSTED MESSAGES ABOUT THE SAME FAILURES. I CONTACTED HONDA CUSTOMER SERVICE AND GAVE THEM THIS SAME INFORMATION. ABOUT THREE WEEKS LATER I RECEIVED A CALL LETTING ME KNOW THEY DIDN'T,T FEEL RESPONSIBLE BECAUSE THE CAR IS OUT OF WARRANTY AND I USED A HONDA DEALER FOR THE REPAIR RATHER THAN AN ACURA DEALER. I DON'T UNDERSTAND THE THE SECOND EXCUSE BECAUSE THE ENGINES IN BOTH THESE VEHICLES ARE PRETTY MUCH THE SAME",
        "vin": "19UUA9F54CA"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093624,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ELECTRIC POWER STEERING BECAME TIGHT AND COULDN'T MOVE STEERING WHEEL LEFT OR RIGHT.  THE ELECTRIC POWER STEERING CONTROL MODULE",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2018",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090803,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEELS SEEMS TO CATCH ON TURNS, BRAKES RAISES SOME CONCERN AT TIMES.",
        "vin": "19UUA8F24CA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088624,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO GETS STRUCK ON A CHANNEL. IT WILL NOT TURN OFF OR SWITCH TO SATELLITE RADIO. IT OCCURS RANDOMLY WHEN DRIVING BUT CONTINUES EVEN WHEN CAR IS STOPPED. IT WILL JUST RANDOMLY START FUNCTIONING PROPERLY. NO PATTERN.",
        "vin": "19UUA8F28CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082426,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT A STOPLIGHT THE EPS (ELEC POWER STEERING) LIGHT CAME ON AND NO POWER STEERING WAS AVAILABLE. DROVE TO A PARKING LOT AND TURNED CAR OFF/ON WITH NO EFFECTS ON THE ERROR CODE.  WAS ABLE TO MANEUVER CAR TO THE DEALER AND AWAITING A EPS MODULE TO BE REPLACED.  THE APPEARS TO BE A RECURRING PROBLEM IN THIS MODEL ACURA BASED ON OTHER REPORTS.",
        "vin": "19UUA8F70CA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079725,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "VIN NUMBER DON'T FIND",
        "vin": "19UUA8F52CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066167,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS BURNING 1QT OF OIL EVERY 1000 MILES. THAT AMOUNTS TO 3QTS EVERY 3000MILES. WITH NO REMEDY IN SITE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AT 45MPH ON HIGHWAY WHEN ELECTRONIC POWER SYSTEM FAILED ON CAR MAKING IT INCREDIBLY DIFFICULT TO STEER.",
        "vin": "19UUA9F59CA"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058377,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 2012 ACURA TL TO THE DEALERSHIP AND TOLD THE TECH ABOUT THE AIRBAG SENSOR BEING DISPLAYED SINCE I BOUGHT THE CAR. I HAD IT TO THE DEALERSHIP FOR THAT ONE REASON ONE TIME AND THE OTHER 2X'S, I JUST MENTIONED IT AS I GOT MY OIL CHANGE AND CABIN FILTER.  NOTHING OR NO ONE IS IN THE SEAT; HOWEVER IT KEEPS BLINKING OFF AND ON.  I HAVE SOMEONE IN THE FRONT SEAT OF MY CAR A LOT AND I HOPE THAT IT IS NOT A DEFECT IN AIRBAG THAT WOULD INJURE SOMEONE. I HOPE IT WOULD DEPLOY IF IT NEEDED TO. I HAVE 60,000 MILES AND HAVE HAD SOOOOO MANY PROBLEMS WITH THIS CAR.  JUST HAD TO REPLACE ALTERNATOR (FIRST TIME)AND BATTERY(FOR THE SECOND TIME IN 2 YEARS). ACURA WILL NOT DO ANYTHING AS IT IS ALREADY OUT OF WARRANTY.  IN WARRANTY ACURA CUSTOMER SERVICE IS GREAT. OUT OF WARRANTY'THEY DON'T REALLY CARE. THANK YOU FOR YOUR TIME.",
        "vin": "19UUA9F21CA"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/02/2017",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051859,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. AFTER TAKING MY CAR IN TO THE ACURA OF ORANGE PARK FL TO HAVE AIRBAG SYSTEM CHECKED RELATED TO THE RECALL THE REPAIR WAS MADE AND A WEEK LATER THE INDICATOR LIGHT CAME ON AGAIN. I CALLED THE DEALERSHIP TO ADVISE AND WAS TOLD TO BRING IT BACK WHICH I DID AND WAS TOLD THE RECALL REPAIR WAS MADE. HOWEVER, THE SWITCH IS FAULTY AND NEEDED TO BE REPLACED FOR A COST. I THEN CALLED THE CORPORATE OFFICE AND WAS TOLD TO RETURN IT AT WHICH TIME I WAS TOLD THAT ISN'T COVERED IN THE RECALL. NOW I DON'T KNOW IF THE AIRBAG SYSTEM INDICATOR IS ACCURATE OR NOT BECAUSE THE LIGHT COMES ON AND OFF DAILY AS I DRIVE.",
        "vin": "19UUA8F22CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047040,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  ACURA WILL NOT ALLOW ME TO TAKE THE VEHICLE TO A CLOSE-BY HONDA DEALERSHIP, BUT IS MAKING ME DRIVE 1.5 HOURS EACH WAY TO AN ACURA DEALER.",
        "vin": "19UUA8F59CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/11/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 11046112,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL POWER STEERING INTERNAL FAILURE *BF  *TR",
        "vin": "19UUA8F20CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042057,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK ON THE HIGHWAY, THE \"CHECK POWER STEERING SYSTEM\" WARNING CAME ON. I NOTICED THE STEERING WAS ERRATIC AND FELT I DIDN'T HAVE MUCH CONTROL ANY LONGER. I IMMEDIATELY PULLED ASIDE AND TRIED TO SEARCH FOR THE WARNING. I TOOK IT TO MY ACURA DEALER AND WAS QUOTED $1200 TO FIX THE EPS MODULE. I WAS SHOCKED BY THE COST AND HOW QUICKLY THE SYSTEM FAILED. MY CAR IS 2012 ACURA TL WITH ABOUT 95K MILES. I HAVE NEVER HAD THIS HAPPEN TO ANY OF MY OTHER CARS. I HAVE OWNED TWO ACURA IN THE PAST. WITH THIS ISSUE, I HAVE TO GET IT FIXED. IT SEEMS LIKE THIS IS A MANUFACTURER DEFECT AND SHOULD BE COVERED BY HONDA/ACURA. DISAPPOINTED TO HAVE TO BEAR THIS COST...BUT RATHER BE SAFE THAN SORRY.",
        "vin": "19UUA8F26CA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032736,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND 40MPH AND ALL OF SUDDEN THE \"ELETRONIC POWER STEERING SYSTEM\" LIGHT WENT ON. I WAS NOT ABLE TO STEER AT ALL. I HAD TO USE ALL MY ENERGY ALONG WITH BODY WEIGHT TO PULL THE STEERING WHEEL TO THE RIGHT SO THAT I COULD PARK ALONG THE CURB. I ALMOST GOT HIT BY ANOTHER VEHICLE BECAUSE THIS HAPPENED WHEN I WAS TRYING TO CHANGE LANE.   I TOOK TO THE DEALER AND THEY TOOK ME THE DIAGNOSTIC CODE 32-09 (POWER STEERING MODULE FAILURE). THEY QUOTED ME $900. VERY EXPENSIVE.    THIS IS A VERY SERIOUS ISSUE AND WELL KNOWN ISSUE WITH HONDA AND ACURA. IT CAN BE LIFE THREATEN ISSUE TO SOME PEOPLE.",
        "vin": "19UUA8F29CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013711,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION DOES NOT SHIFT SMOOTHLY, DEALER COMPLETED A SOFTWARE UPDATE WHICH ONLY TEMPORARILY MADE THE SITUATION BETTER.  DEALER CLAIMS THERE IS NOTHING FURTHER THAT CAN BE DONE.  SHIFT FROM 1ST TO 2ND GEAR IS ROUGH AT TIMES AND TRANSMISSION DOWNSHIFTS MAKING IT FEEL LIKE A DRAG ON THE ENGINE.  TRANSMISSION IS ABRUPT AT TIMES.",
        "vin": "19UUA8F76CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861845,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TL.  CONSUMER WRITES IN REGARDS TO VEHICLE  TRANSMISSION HESITATION AND GEAR SHIFTER AUTOMATICALLY DOWN SHIFTS WHILE DRIVING.  *SMD    THE CONSUMER STATED THE GEAR SHIFT MALFUNCTIONED. IT WOULD LAG THEN AUTOMATICALLY THROW ITSELF INTO GEAR. THE VEHICLE AUTO-DOWN SHIFTED ALMOST CAUSING AN ACCIDENT WITH A SEMI TRUCK. THE CONSUMER WAS ADVISED THAT THE VEHICLE NEEDED A SOFTWARE UPDATE.  *JS",
        "vin": "19UUA8F54CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "01/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001298,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I HAD CALLED OUR LOCAL ACURA TL DEALER TO SCHEDULE AN APPOINTMENT TO GET THE PROCESS FOR THE AIRBAG RECALL STARTED BUT NEVER RECEIVED A CALL BACK FROM ACURA.",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994223,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION DUE TO FAULTY PISTON RINGS.  MINE IS NOT AN ISOLATED PROBLEM  ACURAZINE WEBSITE HAS DISCUSSION THREADS ABOUT THIS DEFECT.",
        "vin": "19UUA9F76CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993799,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, RPM MOVING UP AND DOWN AT 45 TO 50MPH, WEIRD SHAKING WHILE ACCELERATING. ACURA SHOULD SOLVE THIS PROBLEM ASAP",
        "vin": "19UUA8F25CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981051,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS MISSING A PISTON RING ON ONE OF THE CYLINDERS WAS OVERLOOKED IN FACORY. CAUSING CAR TO CONSUME 0VER 80% OF OIL EVERY 1000 MILES",
        "vin": "19UUA8F24CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/26/2017",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957136,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FOR MY AIRBAG LAST YEAR AND IT STATED I WOULD RECEIVE A FOLLOW UP RECALL NOTICE.  I HAVE RECEIVED THE SECOND NOTICE.  I CALLED MY LOCAL ACURA DEALER AND THEY TOLD ME THAT THEY ARE NOT ABLE TO HELP ME WITHOUT THE NOTICE.",
        "vin": "19UUA8F57CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954207,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "12/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. AFTER THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS), THE AIR BAG INDICATOR ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "19UUA8F24CA"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TL.  CONSUMER WRITES IN REGARDS TO UNSATISFACTORY CUSTOMER SERVICE WITH RECALL 16V-061 AND TORQUE CONVERTER SERVICE BULLETIN REPAIRS.  *SMD  THE CONSUMER ALSO SENT IN A RECALL LETTER FOR THE AIR BAG. *JB",
        "vin": "19UUA9F52CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "01/03/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939717,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING MY CAR AT 60 MPH THE POWER STEERING FAILURE NOTIFICATION WAS DISPLAYED ON THE CONSOLE.  IMMEDIATELY I LOST ALL POWER STEERING AND WAS FORCED TO DRIVE WITHOUT IT.  THIS WAS VERY DANGEROUS AND DIFFICULT TO DRIVE.  THE MECHANIC REPEATED THE PROBLEM AND REQUIRES THE POWER STEERING MOTOR TO BE REPLACED.  *TR",
        "vin": "19UUA8F24CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933644,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I RECEIVED A LETTER FROM ACURA AUTOMOBILE DIVISION MARCH 2016 ADVISING ME OF THE RECALL. THE LETTER STATED, \"ACURA WILL SEND ANOTHER LETTER WHEN PARTS BECOME AVAILABLE TO REPAIR YOUR VEHICLE.\" TO DATE, I HAVE NOT RECEIVED A LETTER FROM ACURA.  ON JULY 20, 2016, I CALLED RADLEY ACURA), FALLS CHURCH, VA  AND SPOKE TO GABRIEL TO REQUEST THAT THE PART BE ORDERED. I NEVER HEARD BACK FROM RADLEY ACURA.  ON SEPTEMBER 7, 2016, I CALLED TISCHER ACURA, LAUREL, MD AND REQUESTED THAT THE PART BE ORDERED. I WAS TOLD THAT IT WOULD TAKE UP TO EIGHT (8) WEEKS AND I WOULD BE NOTIFIED WHEN THE PART HAD ARRIVED. TO DATE (DECEMBER 7, 2016), I HAVE NOT HEARD FROM TISCHER ACURA.  I CALLED TISCHER ACURA TODAY AND WAS REFERRED TO SOMEONE'S VOICEMAIL.  IT IS CLEAR THAT ACURA AUTOMOBILE DIVISION IS NOT TAKING THE TAKATA RECALL SERIOUSLY. DOES THERE HAVE TO BE ANOTHER DEATH FROM THE MALFUNCTIONING AIR BAG INFLATOR BEFORE THIS PROBLEM IS FIXED?  CAN THE NHTSA ASSIST ME TO GET THIS RECALL ACCOMPLISHED?",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926042,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS 4.5 YEARS OLD, TROUBLE FREE.  DROVE CAR AT NOON, NO PROBLEM.  LEFT WORK AT NIGHT WITH TEMP 8C AND CAR STARTED.  COMPUTER SHOWED POWER STEERING FAILURE, AND POWER STEERING WAS NOT WORKING.   STOPPED CAR AND RESTARTED IT.  PS THEN WORKED.  STOPPED/RESTARTED 4-5 TIMES, NO PROBLEM.    I CHECKED UNDER THE HOOD AND THERE WAS NO APPARENT PROBLEM, NO FLUID SPRAYED AROUND ETC.",
        "vin": "19UUA9F54CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THE EPS WARNING LIGHT FLASHED, THE STEERING WHEEL WAS TIGHT AND THERE WAS A LOSS OF POWER STEERING. THE CONTACT WAS IN THE PROCESS OF EXITING A ROADWAY AND WAS ABLE TO PULL INTO A PARKING LOT TO TURN OFF THE VEHICLE AND RESTARTED THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 34,900.",
        "vin": "19UUA8F27CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918538,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916329,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  RECEIVED NOTICE IN MARCH 2016 THAT MY VEHICLE IS PART OF THE TAKATA AIRBAG RECALL.  I HAVE CONTACTED MY SERVICING DEALER MONTHLY SINCE THEN TO SCHEDULE AN APPOINTMENT FOR REPLACEMENT, BUT AM CONTINUALLY TOLD THAT THE REPLACEMENT FOR MY VEHICLE IS NOT YET AVAILABLE, AND THEY DO NOT KNOW WHEN IT WILL BE AVAILABLE.  IT IS NOW OCTOBER 16 - 7 MONTHS AFTER I RECEIVED THE NOTICE.  I'M DRIVING DAILY IN A CAR THAT COULD CONCEIVABLY KILL ME - EVEN IN A MINOR FRONT-END COLLISION. (YES, I KNOW - DON'T HAVE A FRONT END COLLISION.  I CAN'T CONTROL EVERY DRIVER ON THE ROAD).   I CAN'T TRADE IT IN, BECAUSE IT'S WORTHLESS DUE TO THE UNRESOLVED RECALL.  ACURA SHOULD BUY BACK THESE CARS THAT THEY CANNOT FIX IN A TIMELY MANNER.  COMPLETELY UNACCEPTABLE HANDLING OF THIS SITUATION.  *TR",
        "vin": "19UUA8F52CA"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913739,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. WHILE DRIVING 65 MPH  THE ACCELERATOR PEDAL FAILED AND THE VEHICLE HESITATED TO RESPOND. THE VEHICLE WAS TAKEN TO A DEALER  BUT THE FAILURE WAS UNABLE TO BE DUPLICATED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.   UPDATED 02/21/17*LJ  THE CONSUMER STATED DURING ACCELERATION, THE VEHICLE WOULD HESITATE AND JERK. LESS THAN FIVE MINUTES IN ACCESSORY MODE, THE BATTERY WOULD DIE. UPDATED 02/23/17.*JB",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA9F74CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2016",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905161,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  IN MARCH 2016, I RECEIVED AN OFFICIAL RECALL NOTICE REGARDING TAKATA AIRBAG ON MY 2012 ACURA TL FROM ACURA INTERNATIONAL. THE LETTER STATED THAT THE \"FIX\" WOULD BE AVAILABLE SUMMER 2016. SUMMER HAS COME AND GONE WITH NO NOTIFICATION THAT PART WAS IN STOCK AT DEALERSHIP (MIKE HARVEY, BURLINGAME CA).    IN THE MEANTIME, I HAVE BOUGHT A NEW CAR AND AM TRYING TO SELL MY TL. I HAVE BEEN TOLD POINT BLANK BY POTENTIAL BUYERS THAT THEY EITHER AREN'T INTERESTED OR ARE OFFERING SIGNIFICANTLY LESS THAN MY ASKING PRICE BECAUSE AIRBAG HAS NOT BEEN RESOLVED.      AFTER A WEEK OF CONVERSATIONS AND RUN AROUND WITH BOTH THE DEALERSHIP AND ACURA INTERNATIONAL, I HAVE BEEN TOLD THERE IS NOTHING THAT CAN BE DONE AND THAT NO ONE HAS ANY IDEA WHEN TO ANTICIPATE THE PART BEING AVAILABLE. WHAT I WAS TOLD (AS A SIDEBAR BY ACURA SERVICE DEPARTMENT) WAS THE AIRBAG IN QUESTION IS ACTUALLY THE DRIVER SIDE AIRBAG AND IT COULD POSE A RISK UNTIL FIXED THAT SHOULD BE MENTIONED UPON SELLING THE VEHICLE.     AT THIS POINT, IT IS 6 MONTHS PAST THE ORIGINAL DATE OF NOTIFICATION OF THE RECALL. I AM ESSENTIALLY BEING PREVENTED FROM SELLING MY CAR AT A FAIR AND REASONABLE PRICE BECAUSE ACURA CANNOT FIX THE PROBLEM AND I NOW HAVE TO QUESTION THE SAFETY OF DRIVING THE VEHICLE IN LIGHT OF THE INFORMATION THE SERVICE DEPARTMENT INADVERTENTLY SHARED WITH ME.     BOTTOM LINE, I JUST WANT ACURA TO RESOLVE THEIR PROBLEM IN A TIMELY MANNER (WHATEVER THAT IS 6 MONTHS LATER) SO I CAN PROCEED AND SELL MY CAR.   I HAVE ALREADY PURCHASED A NEW CAR AND DON'T REALLY WANT 2 CARS TO BE DEALING WITH.     ANYTHING YOU CAN FIND OUT AND RESOLVE WOULD BE GREATLY APPRECIATED. PLEASE CONTACT ME IF YOU NEED FURTHER INFORMATION.",
        "vin": "19UUA8F59CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898501,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE BACK IN MARCH ABOUT DEFECTIVE AIRBAGS. I HAVE SINCE BEEN TRYING TO GET THE PROBLEM RESOLVED BUT THE DEALER CONTINUES TO SAY THEY DON'T HAVE THE PART. I'M CURRENTLY PREGNANT WITH A 3 YEAR OLD AND WE ARE RIDING AROUND IN A CAR WITH A RECALL NOTICE THAT SAYS I COULD POTENTIALLY DIE IF THE AIRBAGS INFLATE. I WAS TOLD BACK IN MARCH THAT ACURA WOULD POSSIBLY PAY FOR US A RENTAL BUT THE CHANCE THAT MY CAR WAS AFFECTED WAS LOW. I'M JUST SURPRISED AND FRUSTRATED THAT THIS ISSUE HASN'T BEEN RESOLVED AND IT'S GOING ON 6 MONTHS.",
        "vin": "19UUA8F58CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897619,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F73CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896555,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I REPORTED NOTIFICATION OF THE RECALL TO MY DEALER, OPEN ROAD ACURA, EAST BRUNSWICK, IN MARCH 2016. PART WASN'T ORDERED UNTIL MAY 20, 2016.  I CALL THE DEALER EVERY 2-3 WEEKS, AND HAVE BEEN TOLD THE AIRBAGS HAVE NOT BEEN RECEIVED YET, 90 DAYS LATER. PLEASE NOTE THAT I HAVE MOVED SINCE RECEIVING THE RECALL NOTICE FROM 17 MILLBURN CT, OLD BRIDGE, 08857 TO 14 SAHALEE DR., MONROE, 08831.",
        "vin": "19UUA8F55CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896653,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    IN JUNE 2016 I RECEIVED A RECALL NOTICE FROM ACURA REGARDING THE ABOVE VEHICLE. EACH MONTH I HAVE CALLED ABOUT THE AIR  BAG RECALL AND I HAVE BEEN INFORMED THAT THE RECALL REPLACEMENT PARTS ARE NOT AVAILABLE. WHY ARE THEY DRAGGING THEIR FEET ON A POTENTIAL DEADLY AND LIBELOUS DEFECT?",
        "vin": "19UUA9F53CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V61000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894757,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    IN MARCH OF 2016 I RECEIVED NOTICE OF THIS RECALL ON MY VEHICLE.  THE NOTICE INDICATED THAT PARTS FOR THE RECALL WOULD BE AVAILABLE IN SUMMER OF THIS YEAR.  AS IT IS NOW AUGUST 10, 2016 AND I HAVE HAD RECEIVED NO FURTHER COMMUNICATION, I CALLED THE MANUFACTURER FOR AN UPDATE.      I WAS TOLD THAT PARTS ARE STILL NOT AVAILABLE AND THAT THEY ARE ANTICIPATED IN PARTS TO BE AVAILABLE IN SEPTEMBER - NO FIRM DATE.    ALL THE PASSENGERS IN MY VEHICLE ARE AT RISK OF SERIOUS INJURY OR DEATH DUE TO THIS FAULTY PRODUCT AND WILL REMAIN SO UNTIL THIS ISSUE IS CORRECTED.  FIVE MONTHS OF NO UPDATE AND NO CORRECTION TO THE ISSUE IS UNACCEPTABLE.  I HOLD THE US GOVERNMENT AND ACURA RESPONSIBLE FOR THE DELAYS IN CORRECTING THIS DANGEROUS, UNSAFE CONDITION AND ANY AND ALL DAMAGES, LIABILITIES AND CLAIMS THAT MAY ARISE FROM THIS UNACCEPTABLE DELAY.    A COPY OF THIS COMMUNIQUE IS BEING PROVIDED TO MY ATTORNEY.",
        "vin": "19UUA9F55CA"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "07/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10894631,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. WHILE AT A RED LIGHT, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE FROM THE REAR. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED NECK AND BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO THE TOWING FACILITY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 48,000.",
        "vin": "19UUA8F27CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894055,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F71CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885974,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I RECEIVED THE RECALL NOTICE IN EARLY APRIL 2016.  I BROUGHT MY CAR TO GILLMAN ACURA DEALER AT 18002 I-45 NORTH, HOUSTON, TX 77090 ON APRIL 15 AND PICKED UP A LOANER CAR ON APRIL 16, 2016.  I WAITED OVER 5 WEEKS AND STOPPED BY THE DEALER  (BY EARLY JUNE 2016).  I WAS TOLD BY THE DEALER THAT PART WAS NOT AVAILABLE BY THE TIME AND THAT THE DEALER WOULD CALL AND SEND ME A LETTER WHEN IT BECOMES AVAILABLE FOR REPAIR.  IT HAS BEEN OVER 3 MONTHS NOW AND I STILL HAVE NOT RECEIVED ANY CALLS OR LETTERS FROM ACURA DEALER.      I UNDERSTAND THAT ACURA DOES GIVE ME A LOANER CAR.  HOWEVER, I AM THE ONLY ONE WHO CAN DRIVE THE LOANER CAR DUE TO ACURA INSURANCE RULES WHILE MY WIFE AND I SHARE THE ACURA EVERY DAY.  THIS HAS GIVEN MY WIFE AND ME A LOT OF PROBLEMS IN THE PAST 3 MONTHS.    WHAT SHOULD I DO SO THAT I CAN GET MY CAR FIXED SOON?  ANY HELP WILL BE GREATLY APPRECIATED.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "19UUA8F51CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885416,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. AIR BAG LIGHT CONTINUES TO COME ON WHEN THERE'S A FRONT SEAT PASSENGER.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881864,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS);  HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F53CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA9F72CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "19UUA8F7XCA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT'S VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) ON JUNE 16, 2016. HOWEVER, THE VEHICLE WAS STILL EXPERIENCING THE SAME FAILURE WITH THE AIR BAG WARNING LIGHT REMAINING ILLUMINATED.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 62,900.",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "01/11/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873171,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN COMPLAINING TO ACURA ABOUT THE TRANSMISSION \"TACH HUNTING\" AND CAR VIBRATIONS SINCE THE CAR WAS BETWEEN 1-2 YEARS OLD.  NO ONE COULD FIGURE OUT THE PROBLEM.  THEY DID FIND AND REPAIR A LEAK ON THE DRIVE SHAFT THAT THEY SAID MIGHT HAVE BEEN THE CAUSE OF MY COMPLAINTS.  THAT DID NOT FIX IT AND I WAS TOLD THAT HONDA/ACURA TRANSMISSIONS WERE ABRUPT IN THEIR CHANGES, AND TENDED TO FAVOR LOWER GEARS, AS A METHOD OF INCREASING FUEL ECONOMY.  PROGRESSIVELY THE PROBLEM HAS GOTTEN WORSE AND NOW THE ACURA DEALER IS TELLING ME THAT THE PROBLEM IS THE TORQUE CONVERTER.",
        "vin": "19UUA8F59CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2016",
        "dateOfIncident": "05/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION NEEDING REPLACEMENT IN LESS THAN 100K MILES. HARD SHIFTING NOTICED SUBSTANTIALLY  WHILE  DRIVING. CAR ONLY AT ONLY 65K MILES.",
        "vin": "19UUA8F28CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- HAS THE PART BE CREATED TO FIX THE PROBLEM",
        "vin": "19UUA8F55CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I LIVE IN NORTH CAROLINA.  THE ACURA TL IS KEPT AT A HOME I OWN IN WOODRIDGE, IL.  I RECEIVED A NOTICE FROM ACURA IN MARCH 2016 THAT THE AIRBAG NEEDED TO BE REPLACED.  I CONTACTED MCGRATH ACURA OF WESTMONT WHERE I PURCHASED THE CAR TO HAVE THE AIRBAG REPLACED.  THE APPOINTMENT DATE THAT MCGRATH GAVE ME WAS TUESDAY MAY 10, 2016.  ON SATURDAY MAY 7 MY WIFE AND I FLEW FROM CHARLOTTE. NC TO MIDWAY, IL SPECIFICALLY TO TAKE THE ACURA TO MCGRATH FOR THE RECALL REPAIR TO BE CARRIED OUT TOMORROW.  THIS MORNING I RECEIVED A REMINDER NOTICE FROM MCGRATH THAT MY APPOINTMENT TIME WAS SCHEDULED FOR TOMORROW AT 8:00 AM.  I CONTACTED MCGRATH BY PHONE AND I'M NOW TOLD BY MCGRATH THAT THEY DO NOT HAVE THE PARTS TO DO REPLACED THE AIRBAG.    1).  NOBODY FROM MCGRATH CONTACTED ME TO TELL ME THAT THEY DO NOT HAVE THE REPLACEMENT PARTS FOR THE AIRBAG.  2).  TODAY I RECEIVE AN EMAIL FROM MCGRATH TELLING ME THAT THE WORK IS STILL SCHEDULED FOR TOMORROW EVEN THOUGH THEY DO NOT HAVE THE PARTS.  3).  I'M VERY UPSET.  I HAVE INCURRED COSTS TO FLY FROM NORTH CAROLINA TO ILLINOIS SPECIFICALLY TO HAVE THE AIRBAG REPLACED.  I HAVE INVESTED TIME AND EFFORT ON THIS MATTER AND MY TIME AND EFFORT HAS BEEN COMPLETELY WASTED.  4).  HOW DO I GO ABOUT GETTING REIMBURSED FOR MY TIME AND COSTS.  PLEASE ADVISE.",
        "vin": "19UUA8F23CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/15/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA9F53CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKAKA RECALL\".. MY DEALER TELLS ME THERE COULD BE AT LEAST A 3 MONTH WAIT FOR THE RELACEMENT PART BUT THE RISK TO ME IS \"LOW\". ?? SEEMS AT ODDS WITH WRITTEN INFO I VE READ ON LINE.",
        "vin": "19UUA8F55CA"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852272,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. WHILE THE ACCELERATOR PEDAL WAS GRADUALLY DEPRESSED, THE VEHICLE HESITATED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 29,700.",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850496,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER FAILURE. STALL WHEN PASSING AT 35-40 MPH.  WIDESPREAD PROBLEM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "03/11/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TL.  CONSUMER WRITES IN REGARDS TO VEHICLE ACCELERATION ISSUES.  *SMD  THE CONSUMER EXPERIENCED A HESITATION OR LAG WHEN TRYING TO ACCELERATE AT LOW SPEEDS AND THEN THE VEHICLE WOULD SURGED FORWARD IN A VIOLENT MANNER. THE CONSUMER STATED IT OCCURRED MORE OFTEN AT SPEEDS BETWEEN 8 TO 17 MPH.  *JB",
        "vin": "19UUA8F53CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807770,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS TO BE A RECALL ON 4TH GENERATION ACURA TL'S WITH THE 6 SPEED AUTO TRANSMISSION (MINE IS A 2012 SH-AWD TECH PACKAGE).  MY CAR PRODUCES THE TACHOMETER JUMPING APPROXIMATELY 300-500 RPM WHEN CRUISING IN 5TH GEAR AROUND 35-45 MPH.  THE TACH JUMP IS SO LARGE I ACTUALLY HAVE LOOKED AT IT WHILE DRIVING, IT'S DISTRACTING AND NEEDS TO BE FIXED, I AM WILLING TO BET IT'S THE TORQUE CONVERTER.  CAR IS GOING TO ACURA DEALER ON 12/3/2015 FOR \"DIAGNOSTIC TESTING:\".  BELOW IS A LINK TO A YOUTUBE VIDEO WHICH IS ALMOST IDENTICAL TO THE VIDEO ON MY CELL PHONE THAT THE SERVICE MANAGER WILL SEE THIS COMING THURSDAY (AROUND 19 SECONDS IN, THE CAR IS IN FIFTH GEAR AND DOES EXACTLY WHAT MINE DOES).  READ THE ACURAZINE.COM FORUMS, THIS IS A HUGE PROBLEM AND ACURA IS HOPING THEIR CUSTOMERS IGNORE IT OR JUST PLAIN DON'T NOTICE IT.  HTTPS://WWW.YOUTUBE.COM/WATCH?V=A-DWNEJ3G74.",
        "vin": "19UUA9F56CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807119,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION HAS NOW LED TO 2 ENGINE REPLACEMENTS (THIS IS THE CARS 3RD ENGINE, ORIGINAL PLUS 2 REPLACEMENTS). I HAVE HAD 3 OIL CONSUMPTION TEST (OCT), ALL SHOWING THAT THERE WAS SIGNIFICANT CONSUMPTION. THE LOCAL ACURA DEALERSHIP (AUTO NATION ACURA OF SPOKANE (ANA)), IS UNABLE OF BEING TRUSTED AND INCAPABLE OF ANY SIGNIFICANT REPAIR SO I HAVE BEEN TRAVELING TO ANOTHER ACURA DEALERSHIP OVER 700 MILES AWAY FOR HONEST AND QUALITY WORK (ANA BOTCHED THE 2ND OCT AS THEY KNOWINGLY ADDED OIL RIGHT BEFORE MY 2ND TRIP TO THE OTHER DEALER). THANKFULLY FOR ME I CHECK MY OIL EVERY FILL UP AS REQUIRED BY THE OCT AND MARK IT'S LEVEL. UNFORTUNATELY FOR ME, THIS NEGATED THE SECOND TEST (EVEN THOUGH IT SHOULD A SIGNIFICANT LOSS, ANA OF SPOKANE DENIED TOPPING IT OFF). I THEN HAD TO DO THE 3RD OCT, AND IN 3 DAYS PUT THE REQUIRED MINIMUM 1,000 MILES REQUIRED AND RETURNED TO DEALER 2. AGAIN THERE FINDINGS SHOWED EXCESSIVE CONSUMPTION AND PUT IN THE 3RD ENGINE. BECAUSE THE REPLACEMENT TIME WAS LONGER THAN I COULD STAY, I FLEW HOME. THERE ARE MANY FORUMS OUT THERE WITH THOUSANDS OF PEOPLE HAVING THE SAME OIL CONSUMPTION ISSUE. IT IS A MANUFACTORS DEFECT WITH THE J37 MODEL ENGINE (ALSO USED IN MANY OTHER ACURA & HONDA VEHICLES.",
        "vin": "19UUA9F51CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/01/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787532,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HAS A PINGING NOISE",
        "vin": "19UUA9F51CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "10/09/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TL 2012, DRIVING WITH LIGHT THROTTLE, SUFFERING JERKING AND SHUDDER. COASTING WITH LITTLE UPHILL ROAD SHOWS MORE JERKING AND SHIFTING HESITATION. WHEN ENGINE REV KEEPS AROUND 1000-1200, CAN FEEL THE VIBRATION AND SHAKING FROM GAS PEDAL AND DASHBOARD.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "08/28/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A *WELL DOCUMENTED* PROBLEM WITH ACURA TORQUE CONVERTERS AFFECTING THE 4TH GENERATION TL WITH THE 5-SPEED AUTO--SO MUCH SO THAT A TSB LETTER WAS SENT OUT.  WHEN LEISURELY ACCELERATING (LIGHT THROTTLE APPLICATION), THE VEHICLE EXHIBITS A CHARACTERISTIC \"LOW GROWL\" AND SORT OF RHYTHMICALLY SURGES FORWARD AS POWER IS ALTERNATELY APPLIED AND REDUCED BY THE TORQUE CONVERTER; THIS SYMPTOM IS ALSO VISIBLE ON THE TACHOMETER, AS THE REVS OSCILLATE UP AND DOWN A COUPLE HUNDRED RPM.  ON MY 2012 TL, THIS MOSTLY OCCURS BETWEEN 1ST/2ND GEAR (THIS IS THE 6-SPEED AUTO), BUT ALSO BETWEEN 2ND/3RD.  BASED ON ONLY CURSORY SEARCHING OF OWNER FORUMS, THIS IS ALSO BECOMING COMMONPLACE ON THE 2012 MODELS.  FAILING TORQUE CONVERTERS IN THESE CASES HAVE ALSO LED TO FAILURES IN THE TRANSMISSION ITSELF, A MUCH COSTLIER REPAIR.  HERE IS AN EXAMPLE LINK TO A FORUM PAGE WITH MANY EXAMPLES OF THE BEHAVIOR, INCLUDING LINKS TO OTHER FORUMS AND VIDEOS:  HTTP://ACURAZINE.COM/FORUMS/PROBLEMS-FIXES-297/ANYONE-DO-TORQUE-CONVERTER-TRANSMISSION-PROGRAM-RECALL-870425/",
        "vin": "19UUA8F57CA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "07/23/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2012 ACURA TL AND THE CAR JUST STALLED ON ME ALL OF A SUDDEN. THE CAR WOULDN'T START SINCE THEN. ALL THE LIGHT WERE COMING ON BUT THERE WAS NO CRANK. I TOOK IT TO THE DEALERSHIP, AND THEY TOLD ME ITS THE PCM. I DIDN'T SEE ANY SIGN, THE CAR WAS DRIVING GOOD BEFORE THAT HAPPENED. ANOTHER ISSUE WITH THE CAR THAT I NOTICED WAS, WHEN THE CAR SHIFT TO THE SECONF GEAR, IT JERKS WHICH IS NOT NORMAL TO ME. I HAVEN'T SEEN ANY OTHER PROBLEM YET, BECAUSE I JUST PURCHASED THE CAR.",
        "vin": "19UUA8F55CA"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730435,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. WHILE DRIVING 40 MPH, THE PASSENGER SIDE AIR BAG WARNING LIGHT FAILED TO ILLUMINATE WHEN THE PASSENGER SEAT WAS OCCUPIED. THE FAILURE RECURRED ON MULTIPLE OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,600.",
        "vin": "19UUA9F55CA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2015",
        "dateOfIncident": "02/12/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722433,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TL SH-AWD TECH. BEGAN TO NOTICE THAT I WAS HAVING TO HAVE MY OIL CHANGED EVERY 2,500 - 3,000 MILES. TOOK IT TO DIFFERENT DEALERS TO SEE WHAT THE PROBLEM WAS. NEITHER DEALER COULD FIND A PROBLEM. IN MARCH 2014, SEVERAL WARNING LIGHTS CAME ON AND THE VEHICLE WOULD NOT ACCELERATE PAST 20 MPH. I HAD IT TOWED TO AN ACURA DEALERSHIP AND WAS TOLD I HAD NO OIL. NO WARNING LIGHTS OR ERROR MESSAGES EVER ALERTED ME.  BEGINNING OF APRIL 2015 (MILEAGE WAS 33K), I STARTED HEARING A KNOCKING NOISE FROM THE ENGINE BETWEEN IDLE AND 2,500 RPM'S. AGAIN TOOK IT TO THE DEALER. THEY SAID I HAD ONLY A  QUART OF OIL. THEY PUT ME ON AN OIL CONSUMPTION TEST. JUST OVER A MONTH LATER AND 1,900 MILES, MY CAR WAS AGAIN OIL LESS. NO LEAKS EVER DISCOVERED. I WAS TOLD I WAS BURNING OIL. 1 QUART TO EVERY 500 MILES.  TOOK IT TO THE DEALERSHIP AND ACURA REPLACED THE ENGINE WITH A NEW ONE. WHILE I WAS AT THE DEALERSHIP I WAS TOLD BY THE SERVICE ADVISOR THAT ANOTHER '12 TL WAS ALSO GETTING ITS ENGINE REPLACED FOR THE SAME ISSUE.",
        "vin": "19UUA9F51CA"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "03/08/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715877,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CPSC:I1530151A. CAR CHARGER. CONSUMER STATED THAT WHILE THE CHARGER WAS IN USE IT SUDDENLY WAS A LOUD POP AND THE USB CHARGER WAS SMOKING AND BURNING HOT. *LN",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "02/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690225,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 10 MPH, THE TRANSMISSION SUDDENLY FAILED AND THE VEHICLE WOULD NOT ACCELERATE. THE VEHICLE WAS TOWED TO THE DEALER, WHO DIAGNOSED THAT THE CLUTCH ASSEMBLY NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "19UUA9E54CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668050,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE STEERING WHEEL SEIZED AND THE STEERING WHEEL LOCK WARNING LIGHT ILLUMINATED. THE VEHICLE WAS RESTARTED AND FUNCTIONED AS NORMAL. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN DIAGNOSED THAT THE ELECTRONIC POWER STEERING COMPUTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 46,000.",
        "vin": "1PUUA8S57TA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663317,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT UPON PURCHASING THE VEHICLE FROM AN INDEPENDENT DEALER, THE AIR BAG SENSOR ILLUMINATED. THE CONTACT WAS NOT PROVIDED WITH A MAIN KEY AND ONLY HAD A SECONDARY KEY. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO PERFORMED A MULTI POINT INSPECTION. THE MECHANIC STATED THAT THE VEHICLE WAS NOT ABLE TO BE REPAIRED DUE TO DAMAGES FROM A CRASH BEFORE THE CONTACT OWNED THE VEHICLE. THE VEHICLE WAS INSPECTED BY THE DEALER WHO STATED THAT THE VEHICLE WAS SAFE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT TOOK FURTHER ACTION WITH NO ASSISTANCE FROM THE DEALER AND TOOK THE VEHICLE TO AN AUTHORIZED DEALER. THE VEHICLE WAS NOT REPAIRED AND THE AIR BAG SENSOR CONTINUED TO ILLUMINATE. THE MANUFACTURER WAS NOTIFIED OF THE SAFETY CONCERN. THE APPROXIMATE FAILURE MILEAGE WAS 40,498.    UPDATED 1/16/15*CN       THE CONSUMER STATED THE COMPLAINT HAS BEEN RESOLVED. THE CONSUMER NO LONGER OWNS THE VEHICLE. IT WAS RETURNED TO THE DEALER. UPDATED 06/4/2015  *JS",
        "vin": "19UUA8F23CA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643218,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING MY 2012 ACURA TL FOR ROUGHLY 2YRS, I'VE BECOME CONCERNED WITH THE ENGINE WORKMANSHIP. ACCELERATION SEEMS TO BE AT A LOSS BETWEEN 30-45MPH IN BETWEEN GEAR CHANGES. IT'S ALMOST AS THOUGH THE TRANSMISSION DOESN'T KNOW WHAT TO DO. YOU HAVE TO EITHER LET UP ON THE ACCELERATION OR INCREASE YOUR SPEED TO AVOID THAT ANNOYING HESITATION. THE SECOND PROBLEM IS WHAT I WOULD DESCRIBE AS LIFTER/VALVE NOISE. THE NOISE OCCURS WHEN ACCELERATING, INTERMITTENTLY THOUGH. ALTHOUGH IT IS EMBARRASSING DRIVING A VEHICLE THAT LOOKS AS GOOD AS THE TL LOOKS AND HAVE IT SOUND LIKE AN OLD CHEVY WHEN YOU ACCELERATE, I HATE IT. I TOOK IT TO THE DEALER, THEY COULD NOT REPLICATE THE NOISE, OF COURSE. THEY TOLD ME THE CAR WAS FINE. I TOLD THEM SPECIFICALLY I BELIEVED THE NOISE WAS COMING FROM LIFTER/VALVE. THEY TOLD ME IT WAS PROBABLY POOR GAS SELECTION. I EXPLAINED TO THEM I USED THE RECOMMENDED PREMIUM OCTANE/CHEVRON. THEY HAD NO ANSWER.  LASTLY, MY BRAKES ARE SQUEALING,  I TOLD THE ACURA MECHANIC TO PLEASE CHECK MY BRAKE PADS, HE SAID THEY WERE PERFECTLY FINE AND SHOULD NOT WORRY. HE SAID THE  ROTORS DEVELOP A BLUE FILM OVER TIME, AND THE SQUEALING NOISE IS NORMAL. I COULDN'T BELIEVE IT, I AM SUPPOSED TO ACCEPT THAT ANNOYING BRAKE NOISE. THIS IS NOT WHAT I EXPECTED FROM ACURA/HONDA, IS THIS BAD WORKMANSHIP OR POOR MATERIALS BEING USED BY ACURA TO KEEP COSTS DOWN ON MANUFACTURING.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "06/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619308,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2012 ACURA TL IN MAY 2013. IN JUNE I TOOK IN BECAUSE IT KEPT STALLING WHILE I WAS DRIVING AND MORE SO WHEN I STOPPED AT A LIGHT AND BEGIN TO ACCELERATE. I KEPT TAKING IT BACK FOR THE SAME THING OVER THE PASS YEAR AND KEPT GETTING THE SAME RESPONSE.. WE CAN FIND ANYTHING WRONG WITH YOUR CAR. THE PROBLEM GOT PROGRESSIVELY WORSE AND IN FEBRUARY OF 2014, IT STALLED WHILE I WAS DRIVING  AND COASTED AND THEN PICKED BACK UP. I TOOK IT BACK AGAIN AND STILL THEY SAID THEY COULD NOT FIND ANYTHING WRONG. OVER THE NEXT FEW MONTHS AGAIN I TOOK IT BACK AND STILL THEY COULD NOT FIND ANYTHING WRONG WITH THE CAR.  WHILE WAS DRIVING ON VACATION TO WILLIAMSBURG VA WITH MY FAMILY AT 65/70MPH, THE CAR JERKED US ABOUT 3 TIMES AND THEN SLOWED DOWN WITH NO HOPE FOR ACCELERATION, I TRIED TO COAST OVER TO THE SIDE OF THE ROAD MEANWHILE 2 CARS ALMOST HIT ME AND ARE BLOWING THE HORN AT ME ALL WHILE I AM A NERVOUS REC ABOUT THE CAR. I TOLD MY HUSBAND THIS IS IT..THIS CAR IS CERTIFIED AND HAS A WARRANTY FOR 7 YEARS 100,000 MILES AND AT THAT POINT IT HAD $50K MILES AND I WAS DONE.. I TOOK MY CAR BACK AGAIN ON AUGUST 3RD WITH THE SAME COMPLAINTS AND THIS TIME WHEN I GET A CALL ITS TO TELL ME THAT I NEED A NEW TRANSMISSION.. WELL I NEEDED THAT LAST YEAR WHEN I FIRST BROUGHT THE CAR BACK WHEN IT WAS JUST A YEAR OLD...I AM NOT THE ONLY PERSON WITH THIS COMPLAINT AS I HAVE READ COMMENTS ON OTHER WEBSITES. BUT I HAVE SEEN WAY TO MANY OF THEM TO IGNORE THIS.   *TR",
        "vin": "19UUA8F50CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561330,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ACCELERATING FROM A STOP AND SHIFTING FROM FIRST TO SECOND GEAR, THE VEHICLE LOST ALL ENGINE POWER. THE ENGINE DID NOT STALL AND THE RPM'S DID NOT DROP, BUT THE GAS PEDAL DID NOT RESPOND TO INPUT. THE VEHICLE JUST COASTED. AFTER PRODDING THE GAS PEDAL MULTIPLE TIMES, IT BEGAN TO RESPOND AND I WAS ABLE TO ACCELERATE ONTO THE HIGHWAY. THE ISSUE LASTED FOR ABOUT 3-5 SECONDS. IT FELT AS IF THE GAS PEDAL WAS DISCONNECTED.  *TR",
        "vin": "19UUA9E58CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555625,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TL.  CONSUMER WRITES IN REGARDS TO VEHICLE ACCELERATION AND STALLING PROBLEMS.  *SMD  THE CONSUMER STATED WHEN ACCELERATING BETWEEN FIRST AND SECOND GEAR, THE VEHICLE HESITATED AND LOST POWER AND IT ALMOST SEEMED TO STALL OUT.",
        "vin": "19UUA8F78CA"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/10/2013",
        "dateOfIncident": "08/25/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542876,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS START (PUSH BUTTON) AND PROBLEM OCCURRED WHEN NO WARNING THAT KEY FOB WAS NOT IN VICINITY OF CAR AFTER CAR WAS STARTED AND DRIVEN 2 HOURS AWAY.  MY DAUGHTER HANDED ME HER KEYS TO THE ACURA TL (INCL KEY FOB) THROUGH THE DRIVERS SIDE WINDOW AFTER THE CAR HAD BEEN STARTED SO I COULD GET SOME ITEMS OUT OF OUR OTHER CAR BEFORE SHE LEFT TO RETURN TO HER HOME 5 HOURS AWAY.  I RETRIEVED HER ITEMS BUT FORGOT TO GIVE HER THE KEY FOB BACK AS THE CAR WAS RUNNING AND NO WARNING INDICATORS WERE GIVEN (AUDIO OR VISUAL) THAT THE KEY FOB WAS NOT IN THE VICINITY OF THE CAR.  SHE HEADED OFF AND STOPPED 2 HOURS LATER FOR GAS ONLY TO FIND THE CAR WOULD NOT RESTART  - DUE TO THE MISSING KEY FOB. AFTER EXPERIMENTATION AND READING THE OWNERS MANUAL I FOUND THAT ONLY WHEN THE DOOR IS OPENED AND THE FOB IS REMOVED FROM THE VEHICLE WILL A NOTICE AND ALARM BE GIVEN.  IF PASSED THROUGH AN OPEN WINDOW (AS WE DID) NO WARNING OF ANY KIND IS GIVEN AND THE DRIVER CAN DRIVE OFF AS IF EVERYTHING IS FINE.  THIS IS A SIGNIFICANT FLAW IN THE REMOTE FOB SYSTEM AND CAUSED MYSELF AND MY DAUGHTER SIGNIFICANT AMOUNTS OF STRESS AND TIME TO DRIVE TO HER LOCATION TO DELIVER THE FOB NEEDED TO RESTART THE CAR.  ACURA CLAIMS NO PROBLEMS FROM THEIR SIDE BUT I BELIEVE THIS IS A SIGNIFICANT ISSUE WITH THE SYSTEM THAT NEEDS TO BE ADDRESSED.  IT MAY BE MORE THAN JUST ACURAS THAT HAVE THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "02/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SUBMITTING MY COMPLAINT HERE BECAUSE, ALL NORTH AMERICAN ACURAS ARE BUILT SAME AND HAS SAME SAFETY/PROBLEMS. PLEASE EXCUSE MY INFO ON ADDRESS SINCE THERE WAS NO ENTRY FOR ONTARIO, CANADA. ===========ENCOUNTER WITH THE PROBLEM  CLICK OR POP SOUND COMES OUT OF STEERING WHEEL COLUMN WHEN STEERING IS ON CENTER AND WHEN I START TO STEER A LITTLE BIT TO LEFT OR RIGHT.  PLEASE SEE THE VIDEO - HTTP://YOUTU.BE/EVPAHLXXV5Y  OR FOR DETAILED FOLLOW UPS PLEASE SEE - HTTP://TL.ACURAZINE.COM/FORUMS/SHOWTHREAD.PHP?T=881249================2ND - I COMPLAINED TO ACURA CANADA  THEY SAID ELEVATING THE PROBLEM TO HIGHER LEVEL WILL START BY REPORTING TO DEALERSHIP. =================3RD - DEALER VISIT ABOVE PROBLEM WAS PRESENTED  TECHNICIAN WHO WENT ON THE TEST DRIVE WITH ME TO REPLICATE THE PROBLEM STATED ALTHOUGH, HE SEES WHAT THE PROBLEM IS, IT IS NORMAL AND THE PROBLEM IS EFFECTING ALL ACURAS SO, HE REFUSE TO DO ANY WORK ON IT BECAUSE IT IS NORMAL ============================4TH FAILED ATTEMPT, I HAVE CALLED ACURA CANADA AGAIN  THE PERSON (CLIENT SERVICES) SAID  - HE SUGGESTED VISITING OTHER DEALERSHIP IN VICINITY TO GET SECOND OPINION AND SEE IF THEY WILL AUTHORIZE THE REPLACEMENT (I DO NOT WISH TO TRAVEL AROUND WHOLE CITY TO BEG FOR WARRANTY)  - THERE IS NOTHING HE CAN DO TO AUTHORIZE THE REPLACEMENT SINCE DEALERSHIP (HANDS AND LEGS OF ACURA CANADA) THINKS IT IS NORMAL AND REPLACING THEM WOULD NOT RELIEVE THE ISSUE  - HE WOULD PASS THE INFO ALONG SO, IT WILL BE KNOWN TO FUTURE DEV. OF ACURAS    BOTTOM LINE - WHO AM I RELYING ON HERE FOR WARRANTY? WHERE SHOULD I BE CONTACTING NOW? OR SHOULD I JUST SHUT UP AND LIVE WITH IT LIKE THE DEALERSHIP AND ACURA CANADA SAID?  *TR",
        "vin": "19UUA9F76CA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2013",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533582,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK THE CAR INTO ACURA THERE WAS A \"CLUNKING NOISE\" IN FRONT END AND COULD BE FELT IN STEERING WHEEL  THE TECH HAD TO RETIGHTEN THE SUSPENSION BOLTS  THE NOISE AND FEELING IN WHEEL RETURNED AT APPROX. 23000 MILES TOOK THE CAR BACK TO ACURA THE SERVICE REP STATED SUSPENSION BOLTS SHOULD BE RETORQUED AT EVERY OIL CHANGE  THIS DOES NOT SOUND RIGHT..I NEVER OWNED A CAR THAT NEEDED THIS REPAIR AND JUST WANT TO KNOW IF THIS IS NORMAL AND COULD BE A SAFELY ISSUE  AFTER TECH RETORQUED THE BOLTS THE NOISE AND FEELING IN WHEEL GOES AWAY BUT RETURNS AND HAS RETURNED.  *TR",
        "vin": "19UUA8F54CA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/13/2013",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10519752,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRYING TO MAKE A STOP AT AN INTERSECTION AND THERE WAS A CAR IN FRONT OF ME. I SLOWED DOWN AND WHEN I ATTEMPTED TO MAKE THE STOP AND PLACED MY FOOT ON THE BRAKE THE CAR BEGAN TO ACCELERATE. AT THIS TIME, I HIT THE BACK OF A VEHICLE WHICH WAS STOPPED IN FRONT OF ME AND DID VERY LITTLE DAMAGE AS I WAS TRAVELING ONLY AT 12 MPH. THERE WAS MORE DAMAGE DONE TO MY VEHICLE THAN TO THE OTHER PARTY BECAUSE HE WAS DRIVING AN SUV WHICH SAT UP HIGH AND IT DAMAGE MY HOOD AND PUSHED THE FRONT OF MY VEHICLE IN AND BROKE THE VENT AND RADIATOR. *TR",
        "vin": "19UUA8F27CA"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/09/2013",
        "dateOfIncident": "12/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, HE HEARD A RATTLING SOUND IN THE SEAT BELT PILLAR. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT A NUT THAT WAS SUPPOSED TO BE WELDED TO THE PILLAR HAD NOT BEEN WELDED OR HAD BECOME FRACTURED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO EXPLANATION FOR THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 7,300.",
        "vin": "19UUA9F51CA"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500526,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY TL IN OCT OF 2011.  ABOUT A  MONTH LATER I NOTICED A CHIP IN THE LOWER REAR DOOR FRAME WHICH I APPLIED SOME TOUCH UP PAINT TO.  WELL THE CHIPS KEEP SHOWING UP IN THE SAME AREA OF THE LOWER REAR DOOR FRAME.  I HAVE ABOUT 8 ON THE PASSENGER SIDE AND SIX ON THE DRIVER SIDE.  THE DEALERSHIP BELIEVES THAT THE FRONT TIRES ARE THROWING ROCKS AND HITTING IN THIS PART OF THE CAR.  THE REAR QUARTER PANELS NEED TO BE REPAINTED NOW TO FIX THE CHIPS.  THE DEALERSHIP WANTS TO INSTALL MUD FLAPS (FLARES) ON THE TIRES AND A PAINT FILM TO THE DOOR EDGE.  THIS IS GOING TO HAVE TO COME OUT OF MY POCKET.  THE DEALERSHIP TOLD ME THAT THIS IS NOT AN ISOLATED ISSUE, OTHER CUSTOMERS ARE HAVING THE SAME PROBLEM.  THIS IS A DESIGN ERROR TO ME AND I BELIEVE ACURA SHOULD FIX IT.  SO FAR THEY WON'T EVEN THINK OF IT SINCE IT'S A ROCK.  BUT THE CAR IS DOING THIS TO IT'S SELF. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/05/2013",
        "dateOfIncident": "01/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496536,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR ON 01/21/2013. WAS BACK AT DEALER ON 01/26/2012 DUE TO A WEIRD VIBRATION AT HIGH SPEEDS (50-80 MPH). LONG STORY SHORT THEY HAVE BALANCED THE TIRES LIKE 3 TIMES AND PUT NEW TIRES BUT IT IS STILL VIBRATING NOT AS MUCH BUT STILL. GOING BACK TO DEALER TO SEE WHAT THEY HAVE TO SAY THIS TIME.  *TR",
        "vin": "1HGCP26319A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/25/2013",
        "dateOfIncident": "08/04/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494672,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAVE A VIBRATION ON A GAS PEDAL AND STEERING WHEEL OVER 70MPH. IT DID NOT GO AWAY AFTER REBALANCING. I PURCHASED A SET OF AFTERMARKET WHEELS, VIBRATION STILL THERE. DEALER WON'T FIX.  *TR",
        "vin": "19UUA8F70CA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY NEW 2012 SH-AWD ACURA TL ADVANCE  IN MARCH OF 2012.  THE CAR HAD LESS THAN 100 MILES WHEN PURCHASED AND CURRENTLY HAS 5K MILES (JANUARY 2013). THE CAR VIBRATES WHEN DRIVING AT SPEEDS BETWEEN 40 AND 80 MPH.  IT FEELS LIKE THE TIRES ARE FLAT SPOTTED OR WHEELS ARE OUT OF BALANCE.  THE WHEELS AND TIRES HAVE BEEN CHECKED AND CONFIRMED BY THE DEALER ON 2 SEPARATE OCCASIONS AS OK. THE DEALER CLASSIFIED THIS VIBRATION AS A \"VEHICLE CHARACTERISTIC.\"  I'M WORRIED IT IS THE SIGN OF A MAJOR ISSUE THEY DON'T WANT TO DEAL WITH.  *TR",
        "vin": "19UUA9F70CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/24/2012",
        "dateOfIncident": "12/22/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490025,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT ELECTRIC POWER STEERING (EPS) WARNING LIGHT AND LOST THE POWER ASSIST. COULD NOT RESET AND HAD TO DRIVE CAR TO DEALER WITH NO POWER ASSIST. VERY DIFFICULT TO STEER AT LOW SPEED.  *TR",
        "vin": "19UUA9F24CA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/20/2012",
        "dateOfIncident": "12/19/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489381,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "12/19/2012 9AM, I WAS DRIVING CALIFORNIA FREEWAY (110) ABOUT 30 MILES/HR. WEATHER WAS CLEAR, ROAD WAS DRY AND NO POT HOLES. I GOT \"POWER STEERING WARNING\" LIGHTS/BEEPS AND I COULD NOT STEER THE CAR. IT WAS VERY STIFF TO STEER AND I BARELY PULLED OVER TO THE CURVE.(ENGINE WAS STILL RUNNING).  AND I STOPPED THE ENGINE AND TURNED BACK ON THEN THE PROBLEM DISAPPEARED. BUT IT WAS THE SCARY EXPERIENCE ON THE FREEWAY.  I TOOK MY CAR TO THE DEALER, SANTA MONICA ACURA AND LEFT OVERNIGHT FOR TROUBLESHOOT.  NEXT DAY, THE SERVICE ADVISER TOLD ME THAT THEY COULD NOT DUPLICATE THE PROBLEM, RAN ALL THE TESTS AND CONTACTED \"TECH SERVICE\" BUT NOTHING ABNORMAL FOUND. THEY SAID IT IS OK TO DRIVE. MY CONCERN IS WHAT IF IT HAPPENS AGAIN ON THE CURVY ROAD AT HIGH SPEED AND I LOSE THE CONTROL OF STEERING.  *TR",
        "vin": "19UUA8F23CA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2012",
        "dateOfIncident": "10/20/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE VEHICLE FAILED TO ACCELERATE. THE CONTACT MENTIONED THE FAILURE OCCURS INTERMITTENTLY AND AT DIFFERENT SPEEDS. THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSTIC TESTING. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE AND DID NOT OFFER ANY FURTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75 AND THE CURRENT MILEAGE WAS 700.",
        "vin": "19UUA8F22CA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/26/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486025,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIRBAG WARNING LIGHT COMES ON INTERMITTENTLY FOR SEVERAL SECONDS (LONG ENOUGH TO HAVE PHOTOGRAPHED IT ON CELL PHONE ON SEVERAL OCCASIONS AND SENT TO RALLEYE ACURA DEALERSHIP) ALTHOUGH A PASSENGER IS SEATED.  PASSENGER IS FEMALE, 125 LBS, 5' 6\" TALL.  VEHICLE HAS BEEN BROUGHT BACK ABOUT 4 TIMES FOR THIS COMPLAINT.  EACH TIME IT HAS BEEN PROCLAIMED \"FIXED.\"  THE LAST TIME WAS ABOUT 6 WEEKS AGO AND IT WAS IN SHOP FOR ABOUT 8 DAYS.  A WEEK AFTER THAT IT HAPPENED AGAIN.  DEALER WAS TOLD AND SAID THEY WOULD \"GET BACK TO US.\"  THEY HAVE NOT.  CALLED ACURA CUSTOMER RELATIONS AND [XXX] IN THAT DEPARTMENT CALLED BACK THIS MORNING.  HE INSISTS IT IS THE PASSENGER'S FAULT, THERE IS NOTHING WRONG WITH THE CAR AND IT IS \"SUPPOSED TO FUNCTION THIS WAY.\"      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2012",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED CORNER IN LARGE CENTER CITY AND HIT A CONSTRUCTION LARGE POT HOLE  AND/OR OBSTRUCTION ON THE LEFT REAR.  AFTER COMPLETING TURN ONTO A NARROW ONE-WAY STREET ACCELERATION INCREASED, BRAKES DID NOT WORK, ENGINE COULD NOT BE TURNED OFF, GEARS COULD NOT MOVE. AFTER GOING THROUGH TWO MAJOR INTERSECTIONS WITHOUT ACCIDENT I KEPT PULLING ON THE EMERGENCY BRAKE. THE CAR SLOWLY STOPPED AND WAS THEN PERFECTLY NORMAL. COULD USE THE BRAKES, SHIFT, ETC. I PARKED OVERNIGHT IN A GARAGE. HAD THE CAR TOWED TO DEALER THE NEXT DAY (7/21/12), WHERE IT IS STILL UNRESOLVED. DEALER SAID CAR IS OK, BUT IS NOW BEING ANALYZED BY ACURA CORPORATE ENGINEERS. I HAD THREE OTHER PEOPLE WHO WERE IN THE CAR AT THE TIME, INCLUDING MY WIFE, WHO WILL NOT EVER GO INTO THIS CAR. THE CAR WAS ONLY 10 DAYS AFTER PURCHASING.  *TR",
        "vin": "19UUA9F74CA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2012",
        "dateOfIncident": "04/30/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2012 ACURA TL TECH ON 4/30/12 WHICH HAD 100 MILES ON THE ODOMETER. WHEN ACCELERATING AT SPEEDS BETWEEN 65 MPH AND 80MPH, THERE APPEARS TO BE A SLIGHT VIBRATION IMITATING FROM THE GAS PEDAL AND DRIVERS SIDE FLOOR. THIS SEEMS TO BE MECHANICAL AS BALANCING IS NOT AN ISSUE AND IT FEELS RHYTHMIC IN NATURE. I HAVE DRIVEN ON THIS FOR 2 MONTHS BEFORE REALIZING THIS CANNOT BE RIGHT. TOOK IT TO THE DEALER AND THEY COULD NOT FIND ANYTHING, USED THE COOKIE CUTTER SCRIPTED \"VEHICLE CHARACTERISTIC.\" THEY CLAIM THEY WILL CONTACT ACURA TECH TO WORK THROUGH POSSIBLE SOLUTIONS. MY CONCERNS ARE WHEN RESEARCHING IT APPEARS THIS IS A TREND HOWEVER NO TSB'S HAVE BEEN ISSUED AT THIS POINT. I HAVE SEEN THINGS SUCH AS AXLE OR TRANSMISSION CONCERNS. I COMMUTE VERY HEAVILY FOR WORK AND CHAUFFEUR MY 2 1/2 DAUGHTER AROUND WITH SERIOUS SAFETY CONCERNS. I HAVE PROBED A POSSIBLE TRADE FOR ANOTHER VEHICLE HOWEVER I WOULD HAVE TO TAKE A $10K HIT WHICH IS ABSOLUTELY UNACCEPTABLE. PLEASE OPEN A CASE TO RESEARCH THIS ISSUE! *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/22/2012",
        "dateOfIncident": "02/22/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459240,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2012 ACURA TL ON 2/8/12.  EACH DAY I DRIVE 35 MILES TO AND FROM WORK ON INTERSTATE 75 WITH A POSTED SPEED OF 70 MPH.  WITHIN A FEW DAYS I NOTICED THAT WHEN THE CAR REACHED 70 MPH A PERSISTENT HIGH FREQUENCY VIBRATION CAME UP THROUGH THE DRIVER'S SIDE FLOOR AND IN PARTICULAR THROUGH THE ACCELERATOR PEDAL.  BY THE TIME I REACHED WORK OR HOME MY ENTIRE RIGHT FOOT AND CALF WAS NUMB AND BUZZING.  IT FELT AS THOUGH I HAD 'FALLEN ASLEEP\" AND CAUSED THE NERVES TO BE TEMPORARILY NON-FUNCTIONAL.  I TOOK THE CAR TO THE DEALER AND THEY TOLD ME THE TIRES WERE OUT OF BALANCE, HOWEVER, WHEN THEY CHECKED THEM THEY WERE NOT.  THEN THEY TOLD ME THAT THE FRONT RIGHT TIRE HAD A TEAR IN IT AND IT WOULD HAVE TO BE REPLACED.  THEY ORDERED A NEW TIRE AND INSTALLED IT AND TRIED TO CHARGE ME $399 BUT THANKFULLY THE MANAGER GAVE IT TO ME A NO COST.  THE CAR HAS BEEN TO THE DEALER SIX TIMES.  AT THE DEALER URGING I OPENED A COMPLAINT WITH HONDA HEADQUARTERS.  FILE NUMBER B012012-04-1601260.  THE REPRESENTATIVE I DEALT WITH WAS \"PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA),5 U.S.C. 552 (B) (6) WHO CAN BE REACHED AT \"PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA),5.U.S.C 522 (B) (6). THREE CALLS WERE RECORDED BY HONDA. ONE OF THE SENIOR PERSONS AT THE DEALERSHIP CONFIDED IN ME THAT EVERYONE AT ACURA KNOWS ABOUT THIS PROBLEM AND THERE IS NO FIX.\"PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 522 (B)(6)  TOLD ME THE SAME.  SHE ACTUALLY CALLED THE VIBRATION A \"VEHICLE CHARACTERISTIC.\"  VIBRATION AT 70 MPH IS NOT A GOOD THING AND IN TIME IT MAY LEAD TO CATASTROPHIC CONSEQUENCES.  BOTH ACURA AND THE DEALER REFUSED TO BUY ME OUT OF THIS VEHICLE AND SO LAST SATURDAY I TRADED OUT TO ANOTHER CAR AT A SUBSTANTIAL COST TO MYSELF.  *TT  UPDATED 07/09/12",
        "vin": "19UUA9F54CA"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/12/2012",
        "dateOfIncident": "10/03/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454975,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE FRONT SEAT IN THIS VEHICLE IS SO LOOSE IT ROCKS BACK AND FORTH AND FROM SIDE TO SIDE.  IT FEELS AS IF THE SEAT IS GOING TO COLLAPSE IN THE EVENT OF AN ACCIDENT AND INJURE THE PERSON IN THIS SEAT, AS WELL AS ANY PASSENGER SEATED BEHIND IT, IN REAR PASSENGER SEAT.   I HAVE HAD THE SEAT INSPECTED BY ACURA DEALERSHIP, AND SENT MULTIPLE LETTERS TO BOTH ACURA AND HONDA MOTOR CO.   THEY CLAIM THIS IS A NORMAL \"CHARACTERISTIC\" OF THIS PASSENGER SEAT IN THIS CAR (MAKE/MODEL YR).   THE SERVICE MANAGER AT THE DEALER INDICATED THAT THE PROBLEM MAY HAVE SOMETHING TO DO WITH THE WEIGHT SENSOR ON THE PASSENGER SIDE AIR BAG CONTROL (THE DRIVER SEAT IS STABLE AND FULLY SUPPORTIVE).      NO OTHER CAR SEAT THAT I HAVE EVER SAT IN FEELS THIS LOOSE AND HAS THIS MUCH MOTION TO IT.   IT FEELS REALLY UNSAFE AND MAKES THE PASSENGER IN THIS SEAT EXPERIENCE MOTION SICKNESS.   CAN YOU PLEASE CONDUCT AN INVESTIGATION INTO WHETHER OR NOT THIS PASSENGER SIDE FRONT SEAT CAN HOLD UP IN THE EVENT OF AN ACCIDENT?  *TR",
        "vin": "19UUA8F79CA"
    }
]