[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451677,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my car home on 2/4/22 and the indicator light (check power steering system!) starting flashing and my steering was extremely hard to turn. I had to pullover in a parking lot and turned off the engine for a few minutes and the indicator light turned off and I was able to drive home. On 2/11, I was trying to pullout of my driveway and the indicator light went on again and I was unable to move the steering wheel. I turned off the engine and I tried again the next day and this time, the light remained on. I will need to tow the car to the dealership or mechanic to have it diagnosed.",
        "vin": "JH4CU2E80CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448439,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased new 2012, for the first time after 10 years, the car is unsafe, brake pedal becomes hard after start up cold - noticed if outside weather between 30-25 degrees brake pedal becomes hard for the first 2-3 times and car will not stop, if the weather below 16 degrees it will take 9-10 times  - if you push and pump the brake pedal the brake pedal power comes back to normal but not the first or 2nd time and also has something to do with weather. car was purchased in VIRGINIA and stayed in VIRGINIA last 10 years and this is the FIRST winter this happen.",
        "vin": "JH4CU2F82CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2012 Acura TSX. The contact stated that after restarting the vehicle, the \"power steering failure\" message was displayed, and the steering wheel was very difficult to turn in either direction. The cause of the failure was not yet determined. The local dealer was notified of the failure and an appointment was scheduled. The manufacturer was not yet notified of the failure. The failure mileage was 101,273.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406898,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP LIED ON CARFAX STATING THEY FIXED THE CRACK IN THE WINDSHIELD AND I DIDN'T KNOW THEY WEREN'T SUPPOSE TO SALE ME THE CAR WITH A BROKEN WINDSHIELD. ACCORDING TO CARFAX REPORT, DEALERSHIP LIED THAT IT WAS REPLACED BUT IT WASN'T.",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/25/2020",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384924,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHT TO \"CHECK POWER STEERING \"UNEXPECTEDLY APPEARS.  LOSS OF TURNING POWER SUDDENLY OCCURS.  NO PRIOR WARNINGS EXHIBITED.  DANGEROUS SITUATION COULD LEAD TO FATAL RESULTS.",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382883,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THE VEHICLE BRAKE SYSTEM FAILED. THE CONTACT STATED THAT IN COLD CLIMATE, THE VEHICLE BRAKE FAILED TO ENGAGE AND THE CONTACT HAD TO ENGAGE THE BRAKE WITH FORCE TO BE ABLE TO BRING THE VEHICLE TO A COMPLETE STOP. THE VEHICLE WAS NOT TAKEN TO A DEALER OR MECHANIC TO HAVE A DIAGNOSTIC TEST PERFORMED. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 71,000.",
        "vin": "JH4CU2F62CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "11/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378054,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAR STOP IN FRONT OF ME QUICKLY SO I PUSH THE BRAKE HARD TO STOP AND I HEARD THE ABS GRINDING, SO EVERYTHING FINE, I CONTINUE DRIVING THEN I WANT TO STOP ON THE STOP SIGN AND I FOUND THE BRAKE PEDAL IS NOT NORMAL I HAVE TO PUSH IT COMPLETELY DOWN FEELS LIKE NO BRAKES I TOOK IT TO ACURA DEALER AND THEY FLASH THE BRAKE OIL, AND I TOLD THEM WHAT HAPPENED THEY SAID NO AIR IN THE ABS OR THE SYSTEM AND ITS NORMAL BUT IF IT HAPPEN AGAIN YOU NEED ABS CONTROL MODULE THE CAR MILEAGE IS 109000 AND ITS ALL HIGHWAY MILES. NOW WHEN I PUSH ON THE PEDAL IT FEELS SPONGY AND IT GOES TO THE FLOOR. ITS KINDA SCARY TO DRIVE AND THE COST OF THIS PART INSTALLED $4000. FOR THIS MILEAGE AND THIS CAR I THINK SOMETHING WRONG GOING ON..",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360065,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "EPS FAILURE WARNING SHOWS UP ON THE CLUSTER PANEL... THE STEERING WHEEL LOCKED ALMOST MAKING ME CRASH MY VEHICLE. THE VEHICLE IS NOT DRIVABLE RIGHT NOW. THIS INCIDENT IT'S BEEN REPORTED FOR MANY ACURA TSX OWNERS BEFORE. ARE THE MANUFACTURERS WAITING FOR A FATAL ACCIDENT TO HAPPENED?!?",
        "vin": "JH4CU2F64CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355035,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, A WARNING MESSAGE TO \"CHECK POWER STEERING!\"  APPEARED AND THE POWER STEERING DEACTIVATED COMPLETELY.  THIS LEFT ME SUDDENLY IN A VERY HEAVY AND DIFFICULT TO TURN VEHICLE.  I HAD TO PUSH/PULL THE WHEEL VERY HARD TO THE RIGHT TO SLOWLY GET IT OFF THE HIGHWAY WHILE BARELY MISSING OTHER CARS.   THIS WAS A VERY UNSETTLING/HIGHLY DANGEROUS SITUATION.  I HAVE RESEARCHED THE ISSUE AND FOUND THAT THIS YEAR/MODEL CAR SPECIFICALLY HAS A WELL KNOWN ISSUE WITH THE POWER STEERING FAILING.  THIS IS ABSOLUTELY A SAFETY ISSUE AND NEEDS TO BE RECALLED.  ACURA HAS QUOTED $3800 TO FIX THE PROBLEM!  TOLD ME IT IS THE ENTIRE POWER STEERING GEARBOX/ASSEMBLY WHICH IMPLIES IT'S SOMETHING LIKE A WORN OUT MOTOR , HOWEVER THE ISSUE IS INTERMITTENT AND USUALLY DISAPPEARS ONCE THE CAR HAS FULLY COOLED DOWN, AT LEAST UNTIL IT HAS HEATED UP AGAIN AT  WHICH POINT IT WILL SUDDENLY HAPPEN AGAIN AT ANY TIME (TYPICALLY AFTER AN HOUR OR TWO AT MOST). THE FACT IT IS AN INTERMITTENT ISSUE WOULD SUGGEST IT IS A COMPUTER RELATED PROBLEM/WIRING PROBLEM - AKA ; DEFECTIVE PART .   CAR HAS ONLY 105K MILES AND HAS NEVER BEEN MISTREATED NOT HAD ANY DAMAGE SUSTAINED NOR HAVE ANY SERIOUS POTHOLES BEEN HIT.  APPARENTLY ACURA IS REPAIRING PROBLEMS WITH THE EPS UNIT UNDER A LIFETIME WARRANTY FOR THAT SPECIFIC PART, BUT NOT THE STEERING GEARBOX.  SO THEY CLEARLY RECOGNIZE THE DEFECTIVE NATURE OF THE POWER STEERING IN THIS MODEL/YEAR CAR BUT WANT TO MINIMIZE THE COST TO FIX THE PROBLEM BY ONLY WARRANTING THE CHEAPER OF THE POSSIBLE POWER STEERING ISSUES TO FIX WHILE LEAVING ANY OTHER ISSUES UP TO THE OWNER TO  PAY OUT TO FIX.  I CANNOT AFFORD THIS SO I EFFECTIVELY NO LONGER HAVE A VEHICLE..  SPENT 25K FOR THIS CAR AND GOT 105K OUT.OF IT ONLY.. THANKS HONDA!  I WILL NEVER PURCHASE ANOTHER HONDA ANYTHING AND WILL BE SURE TO SHARE THIS WITH ANYONE WHO WILL LISTEN.   UNBELIEVABLE.",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352575,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUE TOOTH HAS ALWAYS BEEN SOUNDING STATICKY AND I REALIZED THAT UNDER THE STEERING WHEEL WATER FALLS THREW  WHEN IT'S RAINING AND ACCUMULATE OR WETS MY FEET WHILE DRIVING THE CAR IF IT'S RAINING.",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342945,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON LOCAL ROAD APPROACHING AN INTERSECTION THAT LEADS TO AN ONRAMP IN OAKLAND CA, THE STEERING BECAME EXTREMELY RIGID, IT WAS ALMOST IMPOSSIBLE TO CONTROL THE CAR BY TURNING THE STEERING WHEEL. A WARNING LIGHT FLASHED RAPIDLY ON THE DISPLAY PANEL \"STEERING SYSTEM FAILURE\". LUCKILY I WAS DRIVING AT 5 TO 10 MPH AND ABLE TO PULL OVER. AFTER ABOUT 30 SECONDS, THE WARNING LIGHT STOPPED AND THE CAR'S STEERING THEN PERFORMED NORMALLY. THE PROBLEM OCCURRED AGAIN WITHIN MINUTES AND DRIVING LESS THAN 2 MILES. THE MILEAGE ON THE CAR IS 66,100, THE CAR AUTO OIL CHANGE / B1 REMINDER WAS SHOWING 5% REMAINING FOR THE B1 SERVICE.  I CONTACTED ACURA THEY WOULD NOT ACCEPT RESPONSIBILITY FOR REPAIRING THE CAR EVEN THOUGH THIS SEEMS LIKE A MANUFACTURE'S PROBLEM,",
        "vin": "JH4CU2F84CC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330812,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LIGHT IS SHOWING \"CHECK THE AIRBAG SYSTEMS. THIS JUST START ABOUT 4 MONTHS AGO. WHAT HAPPENS?  *TR",
        "vin": "JH4CU02F88C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330034,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY EPS (ELECTRIC POWER STEERING) MODULE FAILED WHILE I WAS MERGING TO MY RIGHT ON TO THE HIGHWAY ON RAMP. I WAS UNABLE TO STOP DUE TO THE CARS BEHIND ME AND UNABLE TO PULL OVER AS THE LAND SLOPED DOWN INTO A RETENTION POND. NOW I'M A YOUNG MEN AND WAS ABLE TO STEER THE CAR ON THE HIGHWAY AND PULL OFF TO THE SHOULDER. I TOOK MY CAR TO THE MECHANIC AND ALSO DID SOME RESEARCH AND FOUND THAT THE 2012-2014  TSX HAVE A RECURRING FAILURE ON THE EPS MODULE HAPPENING AROUND 75K MILES ( I HAVE ABOUT 100K).  THIS RECALL WOULDN'T BENEFIT ME AS I HAVE ALREADY HAD THE ISSUE FIXED, THIS IS ARE THE OLDER WOMEN OR MAN NOT STRONG ENOUGH TO STEER A CAR WITHOUT POWERING STEERING AND COULD POTENTIALLY CAUSE AN ACCIDENT ENDING IN A CATASTROPHIC EVENT. I FEEL THAT THERE IS ENOUGH HISTORY WITH THIS PROBLEM TO AT LEAST BE INVESTIGATED FOR THE SAFETY OF DRIVES.  *TR",
        "vin": "JH4CU2F41CC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328486,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUETOOTH MODULE CONTINUOUSLY RUNS EVEN WHEN THE VEHICLE IS OFF/NON-OPERATIONAL. IT'S LED TO ME HAVING TO REPLACE THE BATTERY 5X IN THE 8 YEARS OF OWNERSHIP. I DON'T HAVE ANY EXTERNAL ELECTRONIC DEVICES OR CHARGERS PLUGGED IN TO WHERE IT CAN CAUSE THE BATTERY TO DRAIN, NOR DO I LEAVE THE HEADLIGHTS OR CABIN LIGHTS ON. ACURA DEALERSHIPS CLAIM THERE IS NO ISSUE, HOWEVER THERE ARE MANY COMPLAINTS ABOUT IT BY ACURA CUSTOMERS ONLINE.  *TR",
        "vin": "JH4CW2H65CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/24/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING RIGHT FROM AN INCOMPLETE YET SLOW STOP, I SPED UP TO ABOUT 40 MPH. THE POWER STEERING WENT OUT AND THE LIGHT ADVISING SO CAME ON THE DASHBOARD.  *TR",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322496,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING, THE POWER STEERING MALFUNCTIONED AND I ALMOST GOT INTO A CAR ACCIDENT AS I COULD NOT TURN MY CAR. I WAS LUCKY BUT MY LIFE COULD HAVE BEEN IN SERIOUS DANGER BECAUSE OF ACURA. THIS IS NOT A VERY OLD CAR AND DOES NOT HAVE A LOT OF MILEAGE. THE CAR HAD TO BE TOWED TO A MECHANIC AND SAID IT WOULD COST $1850 TO FIX. RIDICULOUS.",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308264,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS PARKED AND OFF, AND TRYING TO LOCK/UNLOCK DOORS WITH KEY FOB (FROM OUTSIDE) OR FROM POWER LOCKS (ON THE INTERIOR), THE LOCKS DON'T LOCK OR UNLOCK. THIS IS A SAFETY RISK AS IT MAKES IT EASIER FOR CAR BREAK-INS TO OCCUR. PER DEALER SERVICE DEPARTMENT, THE ACTUATORS HAVE GONE BAD.",
        "vin": "JH4CU2F66CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER THE BRAKES FEEL 'FROZEN' OR 'WOODEN', AND DO NOT PERFORM  CORRECTLY.  THE CAR WILL NOT STOP.  AFTER USING THEM A FEW TIMES IN A ROW THEY SEEM TO RETURN TO WARM WEATHER PERFORMANCE. IT HAPPENS AGAIN EVERY TIME THE CAR IS DRIVEN IN COLD WEATHER' NOT EXTREME COLD,  BUT JUST NEAR FREEZING. IT SEEMS TO HAVE STARTED EARLY THIS YEAR.  SERVICE PEOPLE  CANNOT SEE A  CAUSE.",
        "vin": "JH4CU2F62CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALL OF SUDDEN POWER STEERING SYSTEM LIGHT COMES ON AND CANT STEER THE CAR HAVE TO GET IT TOWED HOME.VERRY DANGEROUS FOR WHOEVER MAKES THIS STEERING WHEEL LIKE THIS.FOR THIS CAR.WITH ONLY 100K MILES.",
        "vin": "JH4CU2F43CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WITH 94K MIKES. POWER STEERING STOPPED WORKING WHILE DRIVING. ALMOST IMPOSSIBLE TO TURN WHEELS. \"CHECK POWER STEERING\" LIGHT ON. FUSE FOR EPS IS WORKING, WHICH INDICATES THAT EPS UNIT HAS FAILED. WITH THE NUMBER OF  THE SAME COMPLAINTS OVER LAST FEW YEARS ACURA SHOULD ISSUE SAFETY RECALL, AS LACK OF STEERING COULD LEAD TO FATAL INCIDENTS.",
        "vin": "JH4CW2H63CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255198,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT CHECK POWER STEERING SYSTEM INDICATOR ON AND POWER STEERING JAMMED , CANNOT TURN. THIS HAPPENED ALL OF SUDDEN, FORTUNATELY IT HAPPENED WHILE DRIVING BACK HOME ON DRIVEWAY. CAR HAS 75K MILES,     NEVER HEARD FOR SUCH THING, BAD QUALITY FROM ACURA.",
        "vin": "JH4CU2F60CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/25/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246267,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED AND RIGHT AWAY POWER STEERING LIGHT FLASHES REPEATEDLY AND STEERING WHEEL IS ALMOST IMPOSSIBLE TO TURN",
        "vin": "JH4CU2E83CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235106,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY 65+ MPH THE EPS ALERT CAME ON AND THE STEERING WHEEL WAS EXTREMELY HARD TO TURN. LUCKILY I WAS ABLE TO GET THE CAR HOME SAFELY. I SEE MANY MANY COMPLAINTS FOR THE SAME ISSUE, THIS IS A HUGE SAFETY ISSUE AND VERY DANGEROUS. MY CAR HAS JUST OVER 90K MILES.",
        "vin": "JH4CU2F61CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228521,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WENT OUT DURING DRIVING. DASH IS DISPLAYING 'CHECK POWER STEERING SYSTEM!' AND ACURA SAYS THE PART IS $1200. THIS IS RIDICULOUS! I COULD HAVE BEEN INJURED BY THIS. IT'S APPARENTLY A KNOWN ISSUE IN THESE CARS.",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "05/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217240,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DROVE TO A PARKING LOT, THE STEERING SUDDENLY LOCKED. THE CAR HAD TO BE TOWED TO A DEALER FOR REPAIR",
        "vin": "JH4CU2F68CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209587,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING TO WORK THE STEERING WHEEL GOT REAL TIGHT AND WAS VERY HARD TO MOVE.  LUCKILY I WAS NOT ON THE HIGHWAY YET AND WAS ABLE TO PULL OVER SAFELY.  THIS WAS VERY SCARY AND DANGEROUS. I HAD TO LEAVE MY CAR THERE AND FIND A RIDE TO WORK.  I THEN HAD MY CAR TOWED TO A CAR SHOP TO HAVE IT CHECKED OUT.  THEY ARE TELLING ME IT IS AN ELECTRICAL PROBLEM BUT GOING TO DO A FULL DIAGNOSTIC ON IT AND GET BACK TO ME TOMORROW. AFTER SEEING ALL THESE COMPLAINTS THERE SHOULD BE A RECALL FOR THIS SITUATION.",
        "vin": "JH4CU2F85CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208654,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. WHILE THE VEHICLE WAS PARKED, THE STEERING WHEEL FAILED TO TURN LEFT OR RIGHT. THERE WERE NO WARNING INDICATORS ILLUMINATED AND THE SERVICE POWER STEERING MESSAGE DISPLAYED. THE VEHICLE WAS TOWED TO ISLAND ACURA (3350 SUNRISE HWY, WANTAGH, NY 11793, (516) 679-5400) WHERE IT WAS DIAGNOSED THAT THE CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 09555329; HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 80,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207869,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOST POWER STEERING DRIVING TO WORK AT INTERSTATE SPEEDS A COUPLE OF WEEKS AGO. I HAVE BEEN DRIVING THIS ROUTE TO WORK FOR MANY YEARS AND THIS EXPERIENCE STARTLED ME. THIS SITUATION COULD HAVE BECOME FATAL VERY QUICKLY WITH A LESS EXPERIENCED DRIVER.THE REPLACEMENT COST IS EXPENSIVE AND THE EPS MODULE NEEDED FOR REPAIR IS NOT EASY TO FIND. NONE OF THE LOCAL ACURA DEALERS WILL WORK WITH ME SO MY CAR IS SITTING IN A STORAGE YARD WHILE I TRY TO FIGURE OUT WHAT TO DO. AS A RESULT, I AM WITHOUT A CAR TO GET TO WORK EVERYDAY. TO ADD INSULT TO INJURY, I JUST GOT THE CAR OUT OF THE SHOP FOR A \"SOFT PEDAL\" BRAKE FAILURE, THAT HAPPENED AT HIGHWAY SPEEDS TOO. THIS ISSUE ALSO COULD HAVE ENDED VERY DIFFERENTLY WITH LESS EXPERIENCE BEHIND THE WHEEL. THAT REPAIR WAS EXPENSIVE AND IT DID NOT RESTORE THE BRAKING SYSTEM TO ORIGINAL FEEL. THE CAR STOPS BETTER BUT JUST NOT AS WELL AS IT DID BEFORE. LET ME REITERATE, THE CAR DOES NOT HAVE THAT MANY MILES ON IT. I MIGHT  EXPECT THESE PROBLEMS FROM A VEHICLE WITH TWICE THIS MILEAGE,BUT NOT FROM A CAR WITH LESS THAN 100, 000 MILES.",
        "vin": "JH4CU2F46CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204448,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2012 TSX POWER STEERING FAILED THIS WEEKEND WHILE DRIVING AND IT WAS A VERY DANGEROUS SITUATION.  I WAS ABLE TO GET THE CAR HOME BUT WAS QUITE LUCKY THAT NONE OF OUR TEENAGE DRIVERS WERE USING IT AT THE TIME.     THE DASH WARNING SIGNAL CAME ON FOR THE ELECTRICAL POWER STEERING.  I FOLLOWED THE INSTRUCTIONS IN THE CAR MANUAL AND TRIED TO RESET THE WARNING BY TURNING THE CAR ON AND OFF AND IT DID NOT MAKE THE ISSUE GO AWAY.      UPON MAKING AN APPOINTMENT TODAY AND DOING SOME RESEARCH ON THE PROBLEM, I FOUND THAT THIS HAS BEEN REPORTED MANY TIMES ON SEVERAL WEBSITES.  I BELIEVE THIS IS A SIGNIFICANT SAFETY ISSUE AND YOU SHOULD TAKE ACTION TO PREVENT FUTURE, MORE SERIOUS INCIDENTS.",
        "vin": "JH4CW2H54CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204641,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CHECK POWER STEERING SYSTEM\" ALERT FLASHES ON WHEN I WAS DRIVING ON HIGHWAY DURING RUSH HOURS. I CAN BARELY MAKE ANY TURNS WHEN THIS HAPPENS. THIS IS A HUGE SAFETY HAZARD AND PUTS MY LIFE AS WELL AS OTHERS AT RISK. OTHERS WITH SAME YEAR AND MODEL HAVE POSTED ABOUT THIS ONLINE. MY MILEAGE IS ABOUT 65K. THIS NEEDS TO BE RECALLED.",
        "vin": "JH4CU2F81CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204098,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CHECK POWER STEERING SYSTEM\" ALERT FLASHES ON AND OFF CONSTANTLY AND DOES NOT ALLOW ME TO STEER. I CAN BARELY MAKE ANY TURNS WHEN THIS HAPPENS. SOMETIMES IT IS NOT THERE BUT IT POPS BACK RANDOMLY. I WENT TO THE DEALER AND THEY TOLD ME NOTHINGS WRONG BUT CLEARLY SOMETHING IS WRONG. THIS IS A HUGE SAFETY HAZARD AND PUTS MY LIFE AS WELL AS OTHERS AT RISK. OTHERS HAVE POSTED ABOUT THIS ONLINE. THIS NEEDS TO BE RECALLED.",
        "vin": "JH4CU2F48CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190319,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING MODULE WENT OUT AT 90,000 MILES FOR A 7 YEAR OLD CAR AND COST FOR PARTS ALONE IS $900",
        "vin": "JH4CU2F81CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING WENT OUT ALL OF A SUDDEN WHILE I WAS DRIVING HOME ON THE FREEWAY. I WAS DRIVING AT NORMAL SPEED WITH NO TRAFFIC WHEN MY STEERING WHEEL WENT STIFF AND THE CAR BECAME VERY DIFFICULT TO STEER. MY DASHBOARD FLASHED A WARNING LIGHT AND A MESSAGE READING 'CHECK POWER STEERING SYSTEM!' I HAD TO EXIT THE FREEWAY CAREFULLY AS MY STEERING WHEEL WOULD BARELY MOVE. I NARROWLY MISSED HITTING SEVERAL CARS AS I EXITED THE FREEWAY. MY CAR JUST HIT 70,000 MILES LIKE THE OTHER PEOPLE WHO HAVE EXPERIENCED THIS ISSUE. I HAVE YET TO GET A REPAIR ESTIMATE FROM ACURA, BUT IT APPEARS TO BE A VERY EXPENSIVE ISSUE. PLEASE HELP AS THIS APPEARS TO BE AN ONGOING ISSUE WITH THESE PARTICULAR ACURA MODELS.",
        "vin": "JH4CU2F43CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187220,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER BRAKE BOOSTER CHECK VALVE STICKS IN COLD WEATHER NEGATING POWER ASSISTANCE. THIS CAME TO MY ATTENTION WITH SEATTLE'S RECENT COLD SPELL (FEB 2019). CHECK VALVE LOCATED WITHIN MASTER TUBE ASSEMBLY (46402-TL2-A11) WHICH IS ON BACKORDER ACROSS ALL STATES THAT EXPERIENCE WINTER WEATHER. I'VE SPOKEN TO NUMEROUS DEALERS AND SCOURING THE INTERNET, THIS IS A COMMON PROBLEM. ADDITIONALLY, I CONTACTED ACURA TWICE AND WAS TOLD FOLLOW UP WOULD BE IMMEDIATE, WITH ZERO RESPONSE TO DATE.",
        "vin": "JH4CU2F46CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTIRE POWER STEERING MODULE WENT OUT AT 70,000 MILES.  THIS SEEMS LIKE AN EXTREME ISSUE THAT SHOULD BE RECALLED, NOT JUST NORMAL WEAR & TEAR.  A MAJOR ISSUE THAT IS VERY EXPENSIVE TO REPAIR.",
        "vin": "JH4CU2F89CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182428,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY \"CHECK POWER STEERING SYSTEM\" LIGHT LIT UP ON MY DASHBOARD WITHOUT WARNING WHILE I WAS DRIVING, AND SUDDENLY MY POWER STEERING STOPPED WORKING. THE CAR BECAME HARD TO DRIVE AND TURNING BECAME DIFFICULT. THANK GOD I WAS MINUTES FROM HOME ON THE STREET BUT I CAN'T IMAGINE HOW SCARY AND DANGEROUS HAD I BEEN ON THE FREEWAY. THE LIGHT AND POWER STEERING HAVE INTERMITTENTLY GONE ON AND OFF SINCE THEN. ACURA SEEMS UNWILLING TO HELP ME REPAIR THE ISSUE (VERY EXPENSIVE FIX), AND I DON'T EVEN HAVE THAT MUCH WEAR ON THE CAR CONSIDERING HOW OLD IT IS.    I AM VERY DISAPPOINTED BECAUSE THIS IS A DANGEROUS PROBLEM AND I'M HONESTLY CONCERNED ABOUT GETTING ON THE FREEWAY TO DRIVE TO WORK. I AM REALLY HOPING ACURA WILL ACKNOWLEDGE THIS PROBLEM AND HELP ALL THESE CUSTOMERS RESOLVE IT, SINCE I SEE THAT MANY PEOPLE HAVE BEEN HAVING THIS ISSUE.",
        "vin": "JH4CU2F41CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180547,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A STATE HWY COMING HOME FROM WORK IN THE DARK & RAIN WHEN ALL OF A SUDDEN MY STEERING WHEEL LOCKED UP. I THANKFULLY WAS ABLE TO TAKE CONTROL. I VEERED OFF THE HIGHWAY WHEN I NOTICED I COULDN'T TURN MY WHEEL. AFTER GETTING IT HOME & LOOKING WHAT IT COULD BE I READ THE POWER STEERING. AFTER READING SEVERAL FORUMS REGARDING THIS ISSUE IT'S A KNOWN  PROBLEM WITH THIS VEHICLE & YEAR. THIS HAS HAPPENED TO NUMEROUS PEOPLE WHILE DRIVING WHICH IS BEHIND DANGEROUS & I COULDN'T IMAGINE IF I COULDN'T TAKE CONTROL. WHY HASN'T THIS BEEN RECALLED? IT'S A WHOLE FORUM ON THIS WHERE PEOPLE COULD HAVE LOST THEIR LIVES. THIS VEHICLE DOES NOT JUST TAKE POWER STEERING FLUID SO IT WOULD NOT BE AN EASY FIX. NOW IT'S IMPOSSIBLE TO TURN MY WHEEL. I REACHED OUT TO ACURA BUT GOT NO RESPONSE.",
        "vin": "JH4CU2F80CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165463,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE EXPRESSWAY AND MY STEERING WHEEL BECAME HARD TO TURN ALMOST CAUSING ME TO WRECK. A WARNING LIGHT CAME ON STATING CHECK POWER STEERING SYSTEM, I LATER FOUND OUT IT WAS MY EPS UNIT THAT HAD GONE OUT. ACURA IS AWARE OF THIS PROBLEM AND REFUSE TO RECALL THE ISSUE AND CONTINUE TO PUT FAMILIES LIVES IN DANGER. THIS MANUFACTURER NEEDS SOME ACCOUNTABILITY.",
        "vin": "JH4CU2F8XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2018",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161758,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  ACURA NEEDS TO BE AWARE OF WHAT HAPPENED TO ME YESTERDAY. YESTERDAY I WAS DRIVING HOME FROM WORK WHEN ALL OF A SUDDEN THE EPS SYSTEM LIGHT TURNED ON. THIS IS THE POWER STEERING LIGHT. MY STEERING WHEEL LOCKED WHERE I WAS HAVING DIFFICULTY STEERING MY WHEEL. LUCKILY I ONLY HAD 2 MAKE 2 TURNS BUT IT WAS HARD DOING SO. AN INEXPERIENCED DRIVER WOULD HAVE CRASHED AND IT COULD POSSIBLY LEAD TO A FATALITY BEING THAT A CAR IS NOT SUPPOSED TO LOCK ON YOU WHEN YOU ARE DRIVING ON THE FREEWAY. NOW, I CAN'T DRIVE MY CAR TO WORK OR AT ALL. I NEED TO TOW IT TO A DEALER AND I PROBABLY HAVE TO PAY THOUSANDS TO FIX IT. I'VE HAD MY CAR ONLY 6 YEARS. PLEASE BE AWARE THERE ARE MANY COMPLAINTS ONLINE WITH THE SAME MAKE YEAR AND MODEL WITH THE SAME ISSUE. I DON'T THINK IT IS FAIR I HAVE TO PAY TO FIX IT. I HAVE A 2001 HONDA ACCORD AND IT RUNS WAY BETTER WITH NO ISSUES LIKE THIS CAR.  THE CAR WAS IN MOTION WHEN THIS HAPPENED TO ME, WHICH MAKES THIS EVEN MORE DANGEROUS. I WAS FRIGHTENED FOR MY LIFE AND THAT IS WHY I AM TAKING IT TO THIS FORUM. IF NOTHING IS DONE ABOUT THIS I AM SEEKING LEGAL ADVICE.",
        "vin": "JH4CU2F85CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156995,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN THE ROAD RIGHT AFTER COMING OFF THE HIGHWAY AND SUDDENLY THE POWER STEERING LIGHT CAME ON AND STARTED BLINKING AND BEEPING. I TRIED TO TURN INTO A SIDE STREET AS SOON AS POSSIBLE AND THE POWER STEERING WAS DEFINITELY MALFUNCTIONING, MAKING IT VERY HARD TO TURN. GOOD THING I WASNT STILL ON THE HIGHWAY AT THE TIME OR IT COULD HAVE BEEN PRETTY DANGEROUS.",
        "vin": "JH4CU2F6XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2012 ACURA TSX WHEN MY STEERING BECAME VERY DIFFICULT TO TURN AND ALMOST CAUSED ME TO GET INTO AN ACCIDENT. A WARNING SIGN CAME UP ON MY DASHBOARD SAYING \"CHECK POWER STEERING\".  I ONLY HAVE 79,000 MILES ON MY VEHICLE AND HAVE SEEN TONS OF OTHER COMPLAINTS REGARDING THIS ISSUE. ADDITIONALLY, ACURA/HONDA PROVIDED A WARRANTY EXTENSION ON EARLIER MODELS.",
        "vin": "JH4CU2F48CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143350,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAME IS [XXX]  AND I WOULD LIKE TO FILE A COMPLAINT WITH ACURA LOCATED AT THE FOLLOWING TAKATA RECALL    ACURA CORPORATE OFFICE HEADQUARTERS  AMERICAN HONDA MOTOR CO., INC.  1919 TORRANCE BLVD.  TORRANCE, CA 90501-2746 USA  CORPORATE PHONE NUMBER: 1-800-999-1009  FAX NUMBER: 1-310-783-3023  CUSTOMER SERVICE NUMBER: 1-800-382-2238   MY COMPLAINT/CONCERN:  WHY HAS THERE NOT BEEN A RECALL ON A MAJOR AND NUMEROUS AMOUNT OF ISSUES (AND COMPLAINTS FROM A WIDESPREAD OF CUSTOMERS REGARDING THE SAME EXACT ISSUE WITH THE SAME EXACT VEHICLE) CONCERNING ELECTRIC POWER STEERING OF THE 2012 ACURA TSX? THIS ISSUE NEEDS TO BE RECALLED BY ACURA BUT INSTEAD THE CONSUMERS ARE PAYING THOUSANDS OF DOLLARS TO GET THE ELECTRIC POWERING STEERING REPAIRED (WHICH CAN ONLY BE REPROGRAMMED BY ACURA). ACURA HAS IT SET UP WHERE ONLY ACURA AND HONDA CAN REPROGRAM ISSUES SUCH AS THIS AND I GUESS THAT STILL KEEPS THE MONEY INSIDE THEIR COMPANY SO WE THE CONSUMER CAN NOT TAKE IT ELSEWHERE WHERE IT MAY BE CHEAPER FINANCIALLY TO GET REPAIRED. I CONTACTED ACURA CUSTOMER RELATIONS IN CALIFORNIA THROUGH EMAIL AND FAX INITIALLY. I THEN ON SPOKE ON THE TELEPHONE WITH THE DISTRICT MANAGER, APRIL BLANK AND HER SUPERVISOR, [XXX]. DURING THE CONVERSATION I ASK WAS THERE A RECALL ON THE ELECTRIC POWER STEERING AND THERE ANSWER WAS NO. I SHOWED THEM THE LIST OF CONSUMER COMPLAINTS WITH THE SAME EXACT VEHICLE AND MENTIONED TO THEM BOTH THAT THERE SHOULD BE A RECALL AND THEIR ANSWER WAS VERY NON-CHALENT AND BASICALLY TELLING MY WARRANTY IS OVER BECAUSE MY CAR IS OVER 150,000 AND THERE IS ABSOLUTELY NOTHING ACURA CAN DO TO ASSIST. NOW I NOT QUITE SURE WHAT THE WARRANTY HAS TO DO WITH A RECALL THAT I SUGGESTED, BUT I GUESS THEY WERE TRYING TO FIND ANYWAY OUT NOT TO ASSIST WITH HELPING WITH THE ELECTRIC STEERING PROBLEM. I CANT DRIVE THAT CAR BECAUSE IF IT LOCKS UP ON ME WHILE DRIVING IT TO THE ACURA DEALERSHIP.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142448,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I TRAVELED 150 MILES TO PURCHASE A 2012 ACURA TSX AT CALIDAD MOTORS IN CONCORD CA. I WAS TOLD MY DEAL WENT THROUGH SO THAT IS WHY I DROVE THAT FAR.  WHEN I GOT THERE, CHECKED OUT THE CAR AND STATED THE ISSUES TO THE DEALERSHIP, WHICH WERE PROMISED IN THE DEAL PAPER WORK THAT THEY WOULD GET FIXED. I HAVE CONTACTED DEALER AND THE DEALERSHIP REFUSES TO CONTACT ME BACK OR ASSIST ME IN THIS REPAIR. I EXPRESSED THAT THEY SOLD ME A VEHICLE THAT HAD BEEN IN AN ACCIDENT, DUE TO WHAT THE REPAIR SHOP HAD TOLD ME. I WAS TOLD TO SEND IN THE PHOTOS AND A VIDEO OF THE DAMAGED BUMPER AND FOG LAMP AREA. THEY STILL HAVE NOT RESPONDED TO ME. SINCE THEN, MY BUMPER HAS FALLEN OFF AND CAUSED DAMAGE TO THE VEHICLE. I HAD MY HUSBAND PUT THE BUMPER BACK ON TO THE VEHICLE.",
        "vin": "JH4CU2F63CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141898,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A HIGHWAY THE 'CHECK POWER STEERING SYSTEM LIGHT' CAME ON AND LOCKED MY STEERING WHEEL. THIS VERY DANGEROUS AND CONIDERED LIFE RISK-  NO PRIOR WARNING AT ALL GIVEN. MY CAR ONLY HAS 74K MILES, NEVER THOUGHT THIS COULD HAPPENED AT SUCH LOW MILEAGE.",
        "vin": "JH4CU2F60CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130457,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DAYS AGO I WAS DRIVING ACURA TSX 2012 ON THE HIGHWAY AND ALL OF A SUDDEN I HAD A MESSAGE WARNING CHECK POWER STEERING AND THE DRIVE WHEEL  COMPLETELY LOCKED. IT LASTED A COUPLE OF MINUTES. TOOK THE CAR TO AN ACURA SERVICE CENTER AND HAD TO REPLACE THE ESO UNIT. THIS IS A SERIOUS ISSUE THAT NEEDS TO BE ADDRESSED WITH PRIORITY BEFORE PEOPLE DIE OR A TRAGEDY HAPPENS. IT IS NOT BEING ATTENDED AS IT SHOULD AS A HIGH  LIFE THREATAMING ISSUE. ACURA HAS THE NUMBERS OF THE REPLACED UNITS AND  NEEDS TO TAKE ACTION. I EXPECTED MORE FROM A HIGH QUALITY COMPANY.  WHAT DOES IT NEED IN ORDER TO BE CALLED IN RECALL, THIS IS AN ANTICIPATED DEATH THAT CAN BE AVOIDED.. PLEASE TAKE IMMEDIATELY ACTION!",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/18/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130040,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK THIS MORNING ALL SUDDENLY MY CAR POWER STEERING SYSTEM FAILED.",
        "vin": "JH4CU2F46CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN STOP AND GO TRAFFIC AND SUDDENLY THE CHECK POWER STEERING SYSTEM WARNING LIGHT CAME ON AND I LOST ALL POWER STEERING TO THE VEHICLE. THE WHEEL WAS ABLE TO BE TURNED WITH SIGNIFICANT STRENGTH BUT WILL NEED TO GO IN FOR REPLACEMENT OF THE EPS SENSOR.",
        "vin": "JH4CU2F43CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122843,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A PARKING LOT, THE POWER STEERING QUIT COMPLETELY. TOOK VEHICLE TO DEALER AND THEY REPLACED THE EPS CONTROL UNIT AT A COST OF ABOUT $1800.",
        "vin": "JH4CU2F67CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING AND WE WERE ON OUR WAY TO A WEDDING IN SANTA ROSA CALIFORNIA WE LIVE IN VALLEJO CALIFORNIA WE WERE GOING ON THE HIGHWAY AT ABOUT 60 MILES PER HOUR AND THE CHECK POWER STEERING SYSTEM LIGHT CAME ON AND IT BECAME VERY HARD TO STEER MY HUSBAND PULLED OVER AT A GAS STATION AND WE SAT FOR ABOUT AN HOUR TURN THE CAR BACK ON AND IT WAS RESET IT WAS GOOD ABOUT 3 DAYS LATER I WAS DRIVING DOWN HIGHWAY 80 IN THE MIDDLE OF THE DAY GOING ABOUT 65 MILES PER HOUR AND THE LIGHT CAME ON AGAIN IT BECAME VERY HARD TO STEER I TRIED TO PULL OFF OF THE ROAD BUT THE SLOWER YOU GO THE HARDER IT IS TO STEER IT WAS VERY SCARY AND CARS WERE COMING PAST ME VERY QUICKLY I HAD TO PULL OVER IN AN UNSAFE AREA I LOOKED IT UP ONLINE AND APPARENTLY IT'S THE EPS MODULE THAT HAD GONE OUT IT'S HAPPENED TO A LOT OF OTHER PEOPLE BETWEEN 60 AND 81000 MILES SINCE THIS IS A ELECTRONIC MODULE PROBLEM I THINK THAT ACURA SHOULD PAY FOR IT IT'S ALSO VERY UNSAFE TO HAVE YOUR STEERING GO OUT WHEN YOU'RE GOING DOWN THE HIGHWAY AND IT BECOMES EXTREMELY HARD TO TURN TO GET OFF OF THE FREEWAY OR TURN DOWN A ROAD I'M LUCKY THAT NOTHING HAPPENED",
        "vin": "JH4CU2F86CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118457,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STATIONARY VEHICLE.  WITH NO WARNING, ALL MY POWER STEERING SENSORS STARTED BLINKING AND CHIMING WHEN TURNING ON MY VEHICLE. THE ELECTRIC STEERING IS COMPLETELY GONE. UPON RESEARCHING THIS ISSUE, IT TURNS OUT THIS IS A MASSIVE PROBLEM FOR ACURA AND HONDA AND YET NO RECALL HAS BEEN MADE??? INSTEAD HONDA/ACURA ARE CHARGING, AND I QUOTE DIRECTLY FROM THE ACURA TECHNICIAN 'OVER $1000, UNDER $3000' TO FIX THE ISSUE. WHY IS THERE NOT A RECALL?  THIS CAN TECHNICALLY HAPPEN WHILE DRIVING, WHEN THE CAR IS AT SPEED.  SOMEONE WOULD BE KILLED, EASILY, ESPECIALLY IF DRIVING ON ROADS THAT HAVE TURNS AND/OR CURVES.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118466,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING TO WORK THE EPS INDICATOR CAME ON AND I LOST POWER STEERING. I WAS DRIVING 65 MILES AN HOUR ON THE HIGHWAY. I WAS ABLE TO TURN THE WHEEL BY MUSCLING THROUGH IT BUT IT WAS EXTREMELY DIFFICULT TO TURN AND I WOULD NOT HAVE BEEN ABLE TO MAKE ANY TIGHT OR SHARP TURNS.",
        "vin": "JH4CU2F81CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115814,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY CAR TO THE STORE WITH NO PROBLEM BUT WHEN I LEFT THE STORE AND STARTED  MY CAR AND IT HAD A POWER STEERING FAILURE WARNING. I HAD TO DRIVE HOME WITHOUT POWER STEERING MAKING IT DIFFICULT TO TURN. UPON SEARCHING THIS ISSUE THERE ARE NUMEROUS OTHER COMPLAINTS FOR THE EXACT SAME THING.",
        "vin": "JH4CU2F85CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115619,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY TSX AND ROUNDED A CORNER AS THE EPS LIGHT CAME ON AND THE POWER STEERING WAS NO LONGER WORKING.  I WAS UNABLE TO TURN THE STEERING WHEEL AT ALL AT THIS POINT.  LUCKILY, I WAS CLOSE TO MY HOUSE AND WAS ABLE TO PULL OFF THE SIDE OF THE ROAD NEAR MY DRIVEWAY.  MY BOYFRIEND LATER WENT OUT AND STARTED THE CAR AND THE WARNING SIGN HAD DISAPPEARED AND THE CAR SEEMED TO FUNCTION AT THAT TIME.  THREE DAYS LATER MY BOYFRIEND WAS DRIVING THE CAR WHEN THE LIGHT CAME BACK ON, THE POWER STEERING WENT OUT AND HE NEARLY LOST CONTROL AS WE WERE IN THE MIDDLE OF A TURN ON THE ROAD.  WE FELT VERY FORTUNATE THAT NO OTHER CARS WERE NEAR AT THE TIME.  THIS IS EXTREMELY DANGEROUS AND I AM UTTERLY SHOCKED THAT ACURA HAS NOT RECALLED THIS PART.  MY CAR IS A 2012 WITH ONLY 53K MILES ON IT.  I BUY ACURA VEHICLES BECAUSE THEY ARE SUPPOSED TO BE RELIABLE AND SAFE. THIS IS JUST VERY SHOCKING THAT ACURA DOES NOT SEEM THIS TO BE A SAFETY HAZARD AND CORRECT THE ISSUE FOR THEIR CUSTOMERS BEFORE SOMEONE IS SERIOUSLY INJURED OR KILLED.",
        "vin": "19UUB1F38FA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113689,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING LEFT INTO MY NEIGHBORHOOD, THERE WAS DASH WARNING MESSAGE FOR COMPLETE POWER STEERING FAILURE.  IT TOOK A MASSIVE EFFORT, ON MY PART, TO TURN THE WHEEL AND COMPLETE THE TURN IN FRONT OF TRAFFIC.  AS I WAS IN MY NEIGHBORHOOD, I WAS NURSING THE VEHICLE BACK TO MY RESIDENCE.  ABOUT TWO MINUTES LATER, AFTER THE EVENT, THE WARNING LIGHT WENT OFF, AND THE POWER STEERING STARTED TO WORK AGAIN.",
        "vin": "JH4CU2F62CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2012 ACURA TSX THAT HAS HAD NO PRIOR ISSUES BEFORE THIS ONE. WHILE DRIVING ON THE HIGHWAY MY STEERING WHEEL LOCKED UP AND THE MESSAGE CHECK POWER STEERING CAME ACROSS THE DASH. THE ELECTRONIC POWER STEERING MODULE FAILED CAUSING MY STEERING WHEEL TO LOCK UP. THIS WAS VERY DANGEROUS AS I NO LONGER HAD CONTROL OF THE CAR AND WAS UNABLE TO TURN THE WHEEL. I HAVE SEEN AT LEAST 100 COMPLAINTS OF THIS ISSUE HAPPENING TO OTHER OWNERS WHILE ON THE HIGHWAY, IN BUSY INTERSECTIONS,  AND WHILE DRIVING. I LIVE IN THE UPSTATE OF SOUTH CAROLINA AND THERE IS MAJOR ROAD CONSTRUCTION GOING ON. THIS MEAN NO EMERGENCIES LANES, ONLY TWO LANE AND CONCRETE DIVIDERS SO THERE IS NO WAY TO PULL OFF THE ROAD. THEREFORE THIS IS A FATAL ACCIDENT WAITING TO HAPPEN. THIS DEFINITELY NEEDS TO BE CHECKED OUT FOR A RECALL SO THAT NO ONE LOSES THERE LIFE BECAUSE ACURA WOULD RATHER KEEP CHARGING PEOPLE $1,500.00 TO FIX IT INSTEAD OF REPORTING A RECALL FOR A FAULTY PART.",
        "vin": "JH4CU2F45CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113429,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. WHILE STARTING THE VEHICLE, THE STEERING WHEEL FAILED TO TURN LEFT OR RIGHT AND THE POWER STEERING WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE EPS MODULE AND POWER STEERING RACK ASSEMBLY NEEDED TO BE REPLACED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 72,553.",
        "vin": "JH4CU2F65CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113076,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LOCKED UP. COULD NOT DRIVE AS A RESULT OF BEING UNABLE TO MOVE THE WHEEL. THE POWERING STEERING WARNING INDICATOR CAME ON.",
        "vin": "JH4CU2F6XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/22/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL COMPLETELY LOCKED UP WHILE, LUCKILY, STATIONARY IN A PARKING LOT. THIS HAPPENED AT MIDNIGHT AFTER ATTENDING AN EVENT. AS A SINGLE WOMAN, IT WAS DANGEROUS FOR ME TO WAIT FOR ROADSIDE ASSISTANCE IN AN UNLIT PARKING LOT FOR AN HOUR.",
        "vin": "JH4CU2F63CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111936,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A SIDE STREET, ROUGHLY 25MPH WHEN MY POWER STEERING LIGHT CAME ON AND THE VEHICLE'S STEERING LOCKED UP. I PULLED OVER AND QUICKLY READ THE MANUAL, WHICH SAID TO RESTART THE CAR AND IF THE LIGHT GOES OFF, THE CAR IS OK. AFTER DOING SO, THE CAR WAS STEERING AS EXPECTED AND I WAS ABLE TO RETURN HOME SAFELY. THE CAR WAS FINE FOR 2 DAYS. THE THIRD MORNING, I AM LEAVING FOR WORK AND DRIVING ON A SIDE STREET AND THE SAME THING HAPPENED - THE LIGHT CAME ON AND THE VEHICLE'S STEERING SEIZED, EXCEPT THIS TIME RESTARTING DID NOT HELP. I TRIED SEVERAL TIMES BEFORE SUCCUMBING TO THE FACT THAT IT WAS NOT GOING TO HELP. I HAD TO LEAVE MY CAR IN THE STREET AND UBER TO WORK, WORK WITH AAA AND THE LOCAL ACURA DEALERSHIP TO GET MY CAR IN FOR REPAIR. IT WAS THE ESP THAT HAD FAILED. WITH PARTS AND LABOR THE BILL WAS $1,600. THE CAR HAS 77K MILES ON IT. THIS PART SHOULD LAST AT LEAST TO 100K, IF NOT THE LIFE TIME OF THE VEHICLE. LUCKILY FOR ME I WAS NOT ON THE HIGHWAY, OPERATING A VEHICLE WITH NO STEERING IS VERY SCARY AND VERY DANGEROUS. THIS IS A SERIOUS ISSUE THAT NEEDS TO BE RECALLED BY ACURA BEFORE SOMEONE IS KILLED. I BOUGHT AN ACURA BECAUSE I TRUST THEM, THEIR CARS AND THEIR BRAND AND I AM INCREDIBLY DISAPPOINTED IN THEIR LACK OF CARE AND SAFETY OF THEIR CUSTOMERS.",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING STEERING WHEEL LOCKED AND THEN AGAIN WHEN I TURNED IT ON TO GO TO WORK WHICH I WAS UNABLE TO MOVE THE CAR. THE STEERING WHEEL WOULD NOT MOVE RIGHT NOR LEFT",
        "vin": "JH4CU2F81CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110384,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE MY CAR AROUND TOWN TO SEVERAL STORES. STEERING WAS FINE. STOPPED AT A FRIENDS HOUSE BRIEFLY, RESTARTED MY CAR, UNABLE TO TURN STEERING WHEEL WITH EPS LIGHT BEEPING AND BLINKING ON THE DASH. LUCKILY, NOT IN MOTION WHEN THE STEERING MECHANISM FAILED.  HAD LOCAL MECHANIC DIAGNOSE, EPS MODULE FAILURE. CLOSET ACURA DEALER APPROXIMATELY 1.5 HOURS AWAY AND PRELIMINARY ESTIMATE OF $1400. IN REVIEW OF THESE COMPLAINTS, 45 OUT OF 64 RELATED TO STEERING. >70% STEERING COMPLAINTS. A RECALL SHOULD BE MADE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110060,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING THE 2012 ACURA TSX THROUGH A BUSY INTERSECTION WHEN THE \"CHECK POWER STEERING SYSTEM\" LIGHT WENT OFF ON THE DASHBOARD. THE VEHICLE BECAME VERY DIFFICULT TO STEER, HOWEVER, SHE WAS ABLE TO PULL IT OFF TO THE SIDE OF THE ROAD AND GET IT TOWED TO THE DEALERSHIP. THE TECHS AT THE DEALERSHIP COULD NOT REPLICATE THE ISSUE AND WE TOOK POSSESSION OF THE CAR AGAIN. THE WARNING AND DIFFICULTY STEERING OCCURRED TWO DAYS LATER. THE CAR WAS TOWED TO THE DEALERSHIP POWER STEERING CONTROL UNIT WAS REPLACED AT A COST OF $1,385. WE WERE FORTUNATE THAT MY WIFE WAS ABLE TO PULL OVER SAFELY, BUT COULD HAVE BEEN A SERIOUS ISSUE IF IT HAD OCCURRED AT A HIGH SPEED OR TURNING IN A BUSY INTERSECTION. THIS SHOULD BE RECALLED AS IT IS A FAIRLY COMMON COMPLAINT ON CARCOMPLAINTS.COM.",
        "vin": "JH4CW2H60CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104799,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED CAR ON TO LEAVE WORK FOR THE DAY AND RECEIVED A MESSAGE ON MY DASH SAYING POWER STEERING ERROR. TOOK THE CAR TO THE DEALER AND THE EPS MODULE FAILED.",
        "vin": "JH4CU2F42CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102199,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TSX POWER STEERING FAILURE    WHILE DRIVING OUT OF DRIVEWAY, WARNING LIGHT APPEARED AND POWER STEERING FAILED.  I CONTACTED ACURA AND ADVISED OF ALL THE SIMILAR PROBLEMS OTHER HAVE HAD WITH THIS VEHICLE AND THE EXTREME SAFETY ISSUE.  DUE TO IT BEING JUST A MATTER OF TIME UNTIL SOMEONE IS KILLED, I DEMANDED THEY PAY TO REPAIR THE STEERING.  THEY HAVE NOT RESPONDED BACK TO MY REQUEST.  I CONTINUE TO FOLLOW UP WITH MY CLAIM.  I HOPE THIS COMPLAINT RESULTS IN A RECALL NOT FOR JUST ME BUT TO SAVE THE LIFE OF PARENTS AND CHILDREN DRIVING AROUND WITH THIS VEHICLE THAT COULD KILL THEM ON THE HIGHWAY OR ANY ROADAND AND THEY HAVE NO NOTICE AND  DON'T EVEN KNOW.  I AM GRATEFUL MY FAMILY IS STILL ALIVE.",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO AN APPOINTMENT THE 'CHECK POWER STEERING SYSTEM' WARNING LIGHT CAME ON'I MADE IT HOME BUT HAD A HARD TIME TURNING THE STERRING WHEEL'I CHECKED IT LATER ON THAT DAY & THE LIGHT WAS NOT ON.  THEREFORE, I WAS ABLE TO DRIVE MY VEHICLE AGAIN FOR A FEW DAYS  WITH NO PROBLEM. 6/8/18, ON MY WAY HOME AGAIN, THE LIGHT CAME ON & WILL NOT GO OFF. BOTH TIMES I WAS ONLY DRIVING ABOUT 45 MPH. THE LOCAL ACURA DEALER ADVISED ME TODAY (6/11) THE EPS UNIT NEEDS TO BE REPLACED & ESTIMATE TO REPLACE IT $1639. I DID MY RESEARCH & WHAT DO I SEE, TOO MANY COMPLAINTS ABOUT THE SAME ISSUE. BOTH TIMES I WAS IN THE CITY & GOING NO MORE THAN 40 MPH.",
        "vin": "JH4CU2F48CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TSX 100K MILES EXTREMELY WELL MAINTAINED. SHORTLY AFTER LEAVING WORK YESTERDAY I WAS DRIVING ON A VERY BUSY STREET(45 MPH ZONE) IN RUSH HOUR AND LOST COMPLETE STEERING CONTROL. THE CAR WAS EXTREMELY DIFFICULT TO STEER. LOST ALL POWER STEERING ASSIST. I PROCEEDED TO PULL IN TO A PARKING LOT, TURNED THE VEHICLE OFF AND THEN ON AGAIN AND STEERING ASSIST WAS BACK. CONTINUED ON MY DRIVE HOME AND IT HAPPENED AGAIN WHILE IN MOTION 45 MPH. PULLED OFF THE ROAD, CYCLED THE IGNITION AGAIN AND POWER ASSIST WAS BACK. THANKFULLY I WAS NOT MID TURN WHEN THIS HAPPENED OR AN ACCIDENT VERY WELL COULD HAVE OCCURRED. THE VEHICLE GAVE NO WARNING WHATSOEVER BEFORE THIS HAPPENED. VERY DANGEROUS. MY HUSBAND IS A ASE CERTIFIED TECHNICIAN AND HAS NOT BEEN ABLE TO DUPLICATE THE PROBLEM AGAIN SINCE IT HAS HAPPENED, SO HE IS CURRENTLY NOT ABLE TO PIN POINT IF ITS THE EPS MODULE, STEERING GEAR, OR TORQUE SENSOR. WE DON'T WANT TO THROW A $1200 PART AT IT BASED ON A GUESS. THIS IS WAY TOO MANY COMPLAINTS ON SUCH A SERIOUS ISSUE FOR HONDA NOT TO HAVE ISSUED A RECALL. TOYOTA WOULD HAVE BEEN ON THIS LIKE WHITE ON RICE. WE BOUGHT A HONDA FOR A REASON, RELIABILITY. CURRENTLY ITS A NERVE RACKING CAR TO DRIVE WITH THE POTENTIAL OF CAUSING SERIOUS INJURY OR DEATH ALONG WITH ALL THE OTHER HONDAS/ACURAS USING THIS SAME EPS SYSTEM. PLEASE SUBMIT THIS TO HONDA.",
        "vin": "JH4CU2F41CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098873,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS DRIVING NICE, I STOPPED AT THE GAS STATION AND AFTER I FINISH I TURNED IT ON AND POWER STEERING LIGHT GOES ON, I DIDNT KNOW WHATS THE PROBLEM SO I TRIED TO MOVE MY CAR AND I FOUND THAT THE STEERING WAS HARD TO TURN LEFT OR RIGHT IT FEELS WORTH THAN A CAR WITH NO POWER STEERING THANKS GOD THE HIGH WAY WAS NOT BUSY BECAUSE ITS HARD TO CONTROL IT I DROVE IT SLOWLY TO GUNN ACURA IT WAS A MILE FROM WHERE I AM, AND THEY SAID IT POWER STEERING MODULE (MOTOR) AND IT COST ME $2000. MY CAR HAS 70 000 MILE, I CHECK AROUND THE NET AND I FOUND MOST TO ALL PEOPLE HAVE THIS PROBLEM HAPPENS ON 68 000 MILE TO 71 000 MILE.",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST PULLED INTO A PARKING SPACE AND MY CHECK POWER STEERING SYSTEM LIGHT CAME ON.  I WAS NO LONGER ABLE TO TURN THE WHEEL, AND THEREFORE, DRIVE THE CAR.  I HAD TO HAVE MY CAR TOWED AND WAS TOLD I NEEDED A NEW EPS SYSTEM TO THE TUNE OF $1,550!  THIS HAS BEEN A VERY COMMON PROBLEM WITH THIS VEHICLE AND I FEEL IT SHOULD HAVE BEEN RECALLED!  FORTUNATELY, FOR ME, I WAS NOT DRIVING WHILE IT HAPPENED.  SO MANY OTHERS HAVE HAD THIS HAPPEN WHILE DRIVING, WHICH IS EXTREMELY DANGEROUS!  WHY HAS ACURA NOT RECALLED AND FIXED THIS PROBLEM???!!",
        "vin": "JH4CU2F61CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097880,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC POWER STEERING MODULE (EPS) FAILED AT 90,0000 MILES.  RESEARCH ONLINE AT OTHER WEBSITES REVEALED THIS IS NOT AN ISOLATED INCIDENT.  THE LOCAL ACURA DEALERS QUOTED 1400 FOR THE REPAIR.  MY WIFE STARTED THE CAR ONE DAY AND THE POWER STEERING WAS NO LONGER FUNCTIONING. THE LACK OF POWER STEERING MADE THE CAR VERY DIFFICULT FOR HER TO DRIVE AROUND TOWN.",
        "vin": "JH4CW2H63CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY ACURA TSX 2012 FOR ALMOST A YEAR NOW, THE CAR CURRENTLY HAS A LITTLE OVER 49K MILEAGE AND ONLY HAD 1 OWNER. I WAS DRIVING ON THE BELTWAY AND NOTICED ON MY DASH THAT IT HAD A CHECK POWER STEERING LIGHT FLASHING. WHEN IT STARTED FLASHING I QUICKLY NOTICED ME NOT BEING ABLE TO TURN LEFT OR RIGHT DUE TO THE STEERING WHEEL TIGHTENING UP. THE FEELING WAS AS IF YOU TRIED TO TURN THE CAR WHEEL WHEN THE CAR IS NOT ON. THIS WAS A VERY SCARY FEELING BECAUSE, WITHOUT ME USING ALL MY FORCE I WOULD'VE BEEN UNABLE TO PULL OVER TO THE SIDE OF THE ROAD. I THEN TRIED TO CUT THE CAR OFF AND RESTART IT WHICH WAS OK FOR MAYBE THE FIRST MILE BEFORE IT HAPPENED AGAIN. THIS WAS A BIG INCONVENIENCE ESPECIALLY WITH ME NOT REACHING MY DESTINATION. I HAD TO REPEAT THE STEPS OVER HALF DOZEN TIMES BEFORE GETTING HOME SAFELY. THIS WAS ONE OF THE MOST SCARIEST EXPERIENCES I'VE WITNESSED AS A DRIVER AND I THINK THIS IS A MANUFACTURING ISSUE. EVEN THOUGH I'M SAFE NOW, THIS COULD'VE BEEN A LIFE OR DEATH SITUATION FOR ALOT OF DRIVERS. WHEN I LOOKED ONLINE THEIR ARE OVER 50 ISSUES WITH THE SAME STEERING PROBLEM WHICH MAY BE DUE TO THE ELECTRONIC POWER STEERING. I PURCHASED AN ACURA DUE TO THEIR HISTORY OF RELIABILITY & DEPENDABILITY BUT THIS ALTERED MY OPINION DRASTICALLY. I DEFINITELY THINK ACURA NEEDS TO SERIOUSLY LOOK AT A RECALL ON THESE VEHICLES BEFORE SOMEONE LOSES THEIR LIFE.",
        "vin": "JH4CU2F49CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097114,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I WAS DRIVING ON I-5 NORTH FREEWAY AT THE SPEED OF 65 MILES/HR. SUDDENLY,  ABOUT 1 MILE FROM ALTON EXIT,  THE \"CHECKING POWER STEERING SYSTEM\" LIGHT WAS ON, AND I COULD BARELY TURN THE WHEEL. IT WAS SUPER DANGEROUS. I EXITED  FREEWAY TRYING TO PARK IN THE NEAREST PARKING LOT. BUT I COULD NOT PARK PROPERLY INTO THE PARKING SPACE BECAUSE THE WHEEL WAS TOO HEAVY TO TURN. THIS WAS ON THE WAY TO MY JOB INTERVIEW. THIS INCIDENT CAUSED BIG TROUBLE ON MY JOB INTERVIEW. I HAD TO RESCHEDULE IT WITH THE COMPANY.  MY CAR ONLY HAS 55,000 MILAGE AND I ALWAYS KEEP VERY GOOD MAINTENANCE ON THE CAR.  SUCH BIG ISSUE IS NOT SUPPOSED TO HAPPEN ON THE VIECLE WITH SUCH LOW MILAGE. ACURA DEALER CHARGED ME $1800 TO REPLACE THE COMPUTER PART THAT CONTROLS THE POWER STEERING SYSTEM.  IT IS LOT OF MONEY, NOT MENTION THE TERRIBLE SAFETY HAZARD IT CAUSED. EVEN NEW PART HAS BEEN INSTALLED, I AM STILL WORRY SIMILAR ISSUE WILL HAPPEN IN FUTURE. I SAW LOTS OF COMPLAINTS ABOUT THE SAME ISSUE ON THE SAME MODEL. ACURA SHOULD DEFINITELY RECALL THIS.",
        "vin": "JH4CU2F4XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094130,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING LOCAL,STOPPED AT THE LIGHTS WHEN THE \"CHECK POWER STEERING SYSTEM\" SIGNAL CAME ON MY DASHBOARD SUDDENLY.I STOPPED IN THE MIDDLE OF THE STREET,TURNED OFF THE ENGINE THEN TURNED IT ON,THE WARNING LIGHTS DISAPPEARED.CONTINUED DRIVING HOME WHEN THE SAME HAPPENED AGAIN.THE WHEELS BECAME EXTREMELY DIFFICULT TO TURN ,SO I PARKED THE CAR.THIS IS AN EXTREMELY DANGEROUS ISSUE BECAUSE IF THE STEERING WHEEL TIGHTEN UP ON ME WHILE I WAS DRIVING AT A HIGHER SPEED, I COULD HAVE LOST CONTROL OF MY VEICHLE AND SEVERELY INJURED MYSELF AND OTHERS AROUND ME. THIS IS AN IMPORTANT ISSUE THAT ACURA HAS TO LOOK AT AND MAKE IT A RECALL BECAUSE IT SEEMS TO HAVE HAPPEN TO SO MANY OTHER 2012 ACURA TSX OWNERS, I, MYSELF INCLUDED.  P.S IT HAS AROUND 53K MILES ON IT",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093825,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 40 MPH ON A FOUR LANE, DIVIDED HIGHWAY, THE \"CHECK POWER STEERING\" LIGHT CAME ON, AND ALMOST IMMEDIATELY THE POWER STEERING SYSTEM FAILED.  STEERING WHEEL WAS VERY DIFFICULT TO MOVE AS CAR WAS GUIDED TO THE SIDE OF THE ROAD IN HEAVY TRAFFIC.  AFTER SHUTTING THE CAR OFF AND WAITING 30 MINUTES, CAR WAS RESTARTED AND THE ERROR CLEARED.  THE POWER STEERING SYSTEM FUNCTION RETURNED AND THE CAR WAS ABLE TO BE DRIVEN HOME.  CHECKING ONLINE FORUMS AFTERWARDS, DETERMINED THAT FAILURE OF THE ELECTRONIC POWER STEERING CONTROL MODULE IS VERY COMMON IN THESE CARS BETWEEN 75,000 AND 80,000 MILES.  THIS CAR HAD 77,900 MILES ON IT WHEN THIS FAILURE OCCURRED.",
        "vin": "JH4CU2F81CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING WENT OUT ON 2012 ACURA TSX WHILE DRIVING TO WORK. TOOK IT TO THE DEALER AND THEY TOLD ME IT WOULD BE 1580 TO REPAIR IT AS THEY NEED TO DO THE WHOLE POWER STEERING REPLACEMENT. THE CAR IS 6 YEARS OLD AND SHOULD NOT HAVE PROBLEMS LIKE THIS. NOT TO MENTION IT WAS VERY SCARY AND UNSAFE WHEN IT HAPPENED. THE WHEEL IS ALMOST IMPOSSIBLE TO MOVE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092338,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2012 ACURA TSX WITH 69000 MILES. STEERING WHEEL SUDDENLY FROZE AND LOST POWER STEERING. IT IS A WELL MAINTAINED CAR AND HAVING A STEERING PROBLEM WITH SUCH LOW MILEAGE IS UNACCEPTABLE. SHOULD DEFINITELY BE A RECALL. ON DIAGNOSIS, IT IS EPS UNIT AND IT WILL COST ME $1200+ ? ACURA, LOOK AT THE NUMBER OF COMPLAINTS. IT SHOULD BE A RECALL.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK POWER STEERING SYSTEM ERROR MESSAGE. I WASN'T ABLE TO MOVE THE STEERING WHEEL LEFT OR RIGHT.",
        "vin": "JH4CU2F43CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081917,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. WHILE DRIVING 45 MPH, THE POWER STEERING FAILED AND IT WAS EXTREMELY DIFFICULT TO TURN THE STEERING WHEEL LEFT OR RIGHT. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING CONTROL MODULE (EPS) SUDDEN FAILURE WHILE DRIVING. NOT ABLE TO MAKE LEFT/RIGHT TURNS.",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081275,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MY POWER STEERING MODULE STOPPED WORKING.    MADE IT VERY HARD TO STEER OBVIOUSLY.   GLAD I WAS NOT DRIVING AT HIGH SPEEDS, OR IN A TURN!      I'VE LOOKED ON LINE AND SEE THIS HAS BEEN A VERY COMMON PROBLEM.   EPS MODULES ARE GOING OUT.",
        "vin": "JH4CU2F86CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075483,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. AFTER STARTING THE ENGINE AND REVERSING THE VEHICLE, THE POWER STEERING SUDDENLY MALFUNCTIONED CAUSING THE STEERING WHEEL TO BECOME VERY DIFFICULT TO TURN. AFTER TURNING THE VEHICLE OFF AND RESTARTING THE ENGINE, THE FAILURE CONTINUED. DURING THE FAILURE, THE \"SERVICE POWER STEERING\" MESSAGE DISPLAYED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. IT WAS UNKNOWN IF A DEALER WAS CONTACTED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 70,000. *TT  *TR",
        "vin": "JH4CU2F66CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075538,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING LOCAL AND WAS ABOUT TO MAKE A LEFT TURN WHEN THE \"CHECK POWER STEERING SYSTEM\" SIGNAL CAME ON MY DASHBOARD ALL OF A SUDDEN. THE WHEELS BECAME EXTREMELY DIFFICULT TO TURN AND I GOT STUCK IN TRAFFIC WITH CARS HONKING AT ME BECAUSE I WAS BLOCKING TRAFFIC DUE TO MY INABILITY TO TURN THE STEERING WHEEL. THIS IS AN EXTREMELY DANGEROUS ISSUE BECAUSE IF THE STEERING WHEEL TIGHTEN UP ON ME WHILE I WAS DRIVING AT A HIGHER SPEED, I COULD HAVE LOST CONTROL OF MY VEICHLE AND  SEVERELY INJURED MYSELF AND OTHERS AROUND ME. THIS IS AN IMPORTANT ISSUE THAT ACURA HAS TO LOOK AT AND MAKE IT A RECALL BECAUSE IT SEEMS TO HAVE HAPPEN TO SO MANY OTHER 2012 ACURA TSX OWNERS, I, MYSELF INCLUDED.",
        "vin": "JH4CU2F43CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073299,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. WHILE DRIVING APPROXIMATELY 55 MPH, THE STEERING WHEEL SEIZED AND THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED AFTER ONE ATTEMPT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE POWER STEERING MODULE WIRING NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. IT WAS UNKNOWN IF A DEALER WAS CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO CALL NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 75,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073124,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OTHER DAY I WAS DRIVING ON THE FREE WAY AND MY STEERING WHEEL LOCKED UP ON ME WHILE I WAS DRIVING WHICH COULD'VE CAUSED AN ACCIDENT OR SOMETHING MORE WORSE. A LOT OF COMPLAINTS WERE ALREADY MADE ON ARFC SO I'M SURPRISED THIS HASN'T BECOME AN ISSUE FOR THE DEALERSHIP TO MAKE THIS A RECALL. IT'S A SAFETY HAZARD AND CAN CAUSE SOMEONE'S LIFE. I REALLY HOPE THIS GETS ESCALATED SO WE CAN SAVE SOMEONE'S LIFE AND GET A REFUND FOR REPLACING THIS COMPUTER CHIP MODULE  THAT'S COST 1500 DOLLARS. I SPOKE TO THE ACURA COMPLAINT CENTER AND THE REP SAID IF THEY GET MORE COMPLAINTS LIKE THIS IT WILL LEAD INTO A RECALL AND WE WOULD GET A REFUND. IT'S RIDICULOUS THAT THIS HASN'T ALREADY BECOME A RECALL DUE TO IT BEING A SAFETY HAZARD.",
        "vin": "JH4CU2F67CC"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073165,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT SMELLED A STRONG FUEL ODOR IN THE VEHICLE AND DISCOVERED THAT THE FUEL TANK WAS LEAKING. THE DEALER WAS CONTACTED (2175 S BRADLEY RD, SANTA MARIA, CA 93455) AND INFORMED THE CONTACT THAT THERE WAS A RECALL ON OTHER VEHICLES WITH THE SAME YEAR. THE DEALER REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER INFORMED THE CONTACT THAT, DUE TO THE WARRANTY BEING EXPIRED, THEY WOULD NOT BE ABLE TO ASSIST. THE VEHICLE REMAINED PARKED AT THE CONTACT'S RESIDENCE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "JH4CU2F84CC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "12/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064775,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STARTED FOR THE FIRST TIME OF THE DAY--ESPECIALLY IN COLD WEATHER:    SYMPTOM:  NOISE DURING START FOR A SECOND OR TWO.    INFO:  SOUND COMES FROM THE (TIMING CHAIN?) COVER ON THE LEFT TOP SIDE OF THE ENGINE--LOOKING FROM THE BUMPER.    CALLED ACURA DEALER AND MENTIONED ITEMS I HAD READ ABOUT---STRETCHED/LOOSE TENSIONER (PRESSURIZED WITH OIL?), STRETCHED TIMING CHAIN, VTC ACTUATOR---HE SAID YES,YES,---TENSIONER AND TIMING CHAIN WOULD BE CHANGED, I CANNOT REMEMBER WHAT HE SAID ABOUT THE VTC ACTUATOR. ANOTHER ACURA DEALER INDICATED IT IS THE VTC ACTUATOR IS THE ISSUE.  CALLED ACURA CONSUMER RELATIONS WHO NOTED THEY COULD NOT HELP. THIS PROBLEM SEEMS TO BE WELL KNOWN AMONG ACURA OWNERS ON VARIOUS WEBSITES. I DO NOT THINK THIS SHOULD BE HAPPENING AT 82K MILES. NOTE THE WARRANTY IS FOR 72K.  NOTE IT HAS HAPPENED FOR ALMOST A YEAR; BELOW I HAVE NOTED ONE DAY IT HAPPENED.",
        "vin": "JH4CU2F48CC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054965,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "JH4CW2H54CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041476,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TSX IS CLOSE TO 80K MILES. I HAVE HAD NO SIGNIFICANT ISSUES WITH THIS CAR UNTIL NOW. I STARTED MY CAR ONE MORNING AND SAW A \"CHECK POWER STEERING\" NOTIFICATION AND THE POWER STEERING ICON ILLUMINATED ON THE DASH. ONE SHOP ATTEMPTED TO RESET THE EPS (ELECTRIC POWER STEERING) SYSTEM AND MAKE SURE THE VOLTAGES LOOKED OK. THIS WORKED FOR 3 DAYS BEFORE I HAD THE SAME \"CHECK POWER STEERING\" NOTIFICATION AND LIGHT ILLUMINATED ON THE DASH. THIS WILL RESULT IN A FIX IN THE REALM OF $2000 FOR A TOTAL REPLACEMENT OF THE STEERING RACK. I'M VERY UNPLEASANTLY SURPRISED THAT ACURA HAS NOT ISSUED SOME SORT OF RECALL FOR THIS ISSUE BECAUSE OF THE LARGE AMOUNT OF ISSUES THAT ARE SIMILAR TO MINE. ACURA WAS VERY PROMPT WITH FIXING MY TAKATA AIRBAG, BUT AFTER THIS I HAVE TO SAY I AM NO LONGER IMPRESSED.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/04/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED MY CAR AND GOT \"CHECK POWER STEERING SYSTEM\" ERROR ON MY DASH WHILE BACKING OUT INTO THE ROAD...CAR HAD NO POWER STEERING. I DID MANAGE TO DRIVE THE CAR HOME AND THE NEXT DAY CALLED THE DEALER. WAS INFORMED IT WAS MOST LIKELY THE EPS (ELECTRONIC POWER STEERING)  MODULE AND WOULD BE $980 FOR HE REPAIR. UPON FURTHER INVESTIGATION I'VE LEARNED THAT THIS CAN LOCK THE STEERING WHEEL WHILE DRIVING! THE DEALERSHIP NOR ACURA THOUGHT THIS WAS A BIG DEAL OR A SAFETY HAZARD WHEN I SPOKE TO THEM...DEALER DIDN'T EVEN TELL ME TO STOP DRIVING THE CAR WHEN I ASKED THEM IF IT WAS SAFE FOR ME TO COMMUTE AN HOUR EACH WAY VIA INTERSTATE. ACURA OPENED A TICKET AS I REQUESTED \"GOODWILL FIX\" AND WAS DENIED ANY ASSISTANCE AS I DRIVE MY CAR TO MUCH AND THEY DIDN'T HAVE MANY REPORTS OF THIS ISSUE AND AGAIN DIDN'T FIND IT TO BE A SAFETY HAZARD. I TOOK MY CAR TO THE LOCAL DEALER AND REQUESTED A LOANER CAR UNTIL THE STEERING WAS FIXED. I AM OUT $980 AND HAVE LEARNED THE MANUFACTURER WONT BACK THEIR PRODUCT UNLESS IT KILLS SOMEONE...GOOGLE SEARCH SHOWS THIS HAPPENING TO MANY TSX OWNERS BUT DIDN'T SEEM TO MATTER TO ACURA. WE ARE A LONG TIME HONDA/ACURA FAMILY AND THIS SHOULDN'T BE FAILING ON A 5 YEAR OLD CAR, MAJOR SAFETY CONCERN.",
        "vin": "JH4CU2F48CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031447,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING VEHICLE HOME AND THE POWER STEERING LIGHT CAME ON AS I WAS ABOUT TO TURN LEFT ACROSS ONCOMING TRAFFIC.  FORTUNATELY STEERING WHEEL DID NOT LOCK BUT HAD TO TURN IT WITH GREAT EFFORT TO GET ACROSS ONCOMING TRAFFIC LANE.   IF THERE HAD BEEN HEAVIER ONCOMING TRAFFIC I LIKELY WOULD'VE BEEN T-BONED.  IT'S MY OPINION THAT THIS SYSTEM DID NOT FAIL SAFELY.  LOOKING AT OTHER REPORTS WHERE THIS REPAIR COST MORE THAN $1000.  ADDING MY STORY IN THE EVENT THIS LEADS TO A RECALL.",
        "vin": "JH4CU2F83CC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2017",
        "dateOfIncident": "09/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ANIMAL DESTROYED TWO WIRING HARNESSES UNDER THE HOOD, THAT I COULD SEE.  CAR WILL NOT START.  APPARENTLY THE INSULATION ON THE WIRES IS SOY BASED AND CRITTERS LIKE TO EAT IT.  THE CAR WAS SITTING IN MY DRIVEWAY, AND HADN'T BEEN DRIVEN FOR 1 DAY WHEN I DISCOVERED THE PROBLEM.",
        "vin": "JH4CW2H52CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015993,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE FOR 20 MINUTES TO MY DESTINATION AT A SPEED OF 40 MILES PER HOUR.  MY CAR WAS RESTING FOR ABOUT 30 MINUTES WHILE I WAS AT MY APPOINTMENT.  WHEN I WAS LEAVING THE LOCATION, I STARTED MY CAR AND THE ELECTRONIC POWER STEERING ALERT CAME ON, AND IT WAS EXTREMELY DIFFICULT TO TURN MY WHEEL, SO I COULD NOT DRIVE THE CAR.  I LOOKED AT MY CAR MANUAL, AND IT STATED THAT I WOULD NEED TO TAKE MY CAR IN IMMEDIATELY FOR MAINTENANCE.  MY CAR WAS TOWED TO THE DEALERSHIP FOR INSPECTION.  THE DEALER SERVICE DEPARTMENT ADVISED THAT THE CAR SHOWS A \"32-09 MOTOR CURRENT CORRELATION FAILURE,\" AND ADVISED THAT THE CONTROL UNIT HAS TO BE REPLACED.  THE DEALER ADVISED THAT THE MODULE CONTROLS ARE CONTAINED, AND THAT CONTROL UNITS TYPICALLY NEVER GO BAD (60% OF CARS WAS QUOTED). HE ADVISED THAT \"THEY TYPICALLY GO BAD IF SOMETHING HITS IT BUT THIS IS NOT THE CASE WITH YOUR VEHICLE.\"  IS THIS A MANUFACTURER DEFECT AND/OR SHOULD THERE BE A RECALL?",
        "vin": "JH4CU2F45CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015820,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THAT THE EPS FAILED INTERMITTENTLY AND THE STEERING WHEEL BECAME EXTREMELY DIFFICULT TO TURN LEFT OR RIGHT. THE VEHICLE WAS TAKEN TO A DEALER (CHAPMAN ACURA, 4600 E 22ND ST, TUCSON, AZ 85711, (520) 445-4061) WHERE IT WAS DIAGNOSED THAT THE EPS MODULE NEEDED TO BE REPLACED. THE DEALER INDICATED THAT THERE WAS NO SERVICE CAMPAIGN FROM THE MANUFACTURER AND NO RECALL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 106,000.",
        "vin": "JH4CU2F63CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012577,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A ACURA TSX 2012 - ABOUT 70,000 MILES. ONE EVENING LEAVING WORK MY CAR NOTIFIED ME THAT I NEEDED TO CHECK THE POWER STEERING SYSTEM. MY WHEEL WAS COMPLETELY LOCKED AND I HAD TO GET IT TOWED TO AN ACURA SERVICE CENTER. I THEN LATER LEARNED THAT I NEED TO REPLACE MY EPS UNIT AND MY COST WOULD BE $1028!!!!! THIS IS UNACCEPTABLE AS MY VEHICLE IS FAIRLY NEW AND WELL MAINTAINED!!! ACURA NEEDS TO FIX THIS ISSUE AND REIMBURSE ME! IT COULD'VE BEEN LIFE CHANGING FOR ME IF THIS HAPPENED WILL ON A MAIN HIGHWAY, ETC!!! UNACCEPTABLE FOR THIS VEHICLE!",
        "vin": "JH4CU2F40CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011705,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE BUSIEST FREEWAY IN CLEVELAND, OHIO (7/23/17); AN ERROR POPPED UP ON MY ACURA TSX SAYING \"CHECK POWER STEERING SYSTEM,\" AND I IMMEDIATELY LOST ALL POWER STEERING OF MY VEHICLE. I WAS ABLE TO PULL THE WHEEL (WITH GREAT FORCE) TO THE SIDE OF THE ROAD, AND READ THE OWNER'S MANUAL. IT SAID THAT THERE'S A PROBLEM WITH THE ELECTRICAL POWER STEERING OF THE VEHICLE AND TO SHUT OFF THE CAR AND TURN IT BACK ON TO SEE IF THE ERROR RESETS. THANKFULLY THE ERROR WENT AWAY. I CALLED THE DEALER THE NEXT MORNING (SINCE THIS HAPPENED ON A SUNDAY), AND THEY SAID IF IT HAPPENS AGAIN TO BRING IT IN FOR SERVICE.    I DROVE THE CAR FOR ANOTHER 6 DAYS (THINKING IT WAS A FLUKE), THEN TO MY PARENTS 2 HOURS AWAY TO YOUNGSTOWN, OHIO (7/29/17). WHEN I GOT BACK INTO MY CAR, TURNED THE KEY, THE ERROR \"CHECK POWER STEERING\" POPPED UP AGAIN. UNFORTUNATELY, IT DID NOT RESET. WHEN THIS ERROR OCCURS, THE ENTIRE POWER STEERING SYSTEM DOESN'T FUNCTION. THE STEERING WHEEL WILL TURN; HOWEVER, WITH GREAT FORCE! IT'S EXTREMELY DIFFICULT TO MOVE.     I DID SOME RESEARCH AND FOUND A TON OF ISSUES WITH THE ELECTRICAL STEERING SYSTEM OF  THE 2015 ACURA TSX. I'VE HAD THE CAR 5 YEARS AND DROVE IT 79,000 MILES (FREEWAY MOSTLY); IT'S ODD THAT THIS EARLY IN THE LIFE, A MAIN COMPUTER THAT HOUSES THE STEERING WOULD FAIL. I FOUND POSTS OF PEOPLE DRIVING WITH CHILDREN ON FREEWAYS AND ON WINDING ROADS ENCOUNTER THE SAME ISSUE AND THEY LOST CONTROL OF THEIR CARS!     SEE SITES:  1. HTTP://WWW.ARFC.ORG/COMPLAINTS/2012/ACURA/TSX/STEERING/PROBLEM.ASPX  2. HTTPS://WWW.YOUTUBE.COM/WATCH?V=8FFW9F9D854    SOME THING HAS TO BE DONE. THIS IS A $1000+ FIX AND NOT COVERED UNDER WARRANTY. THIS IS CLEARLY A DEFECT FROM WHOEVER SOLD ACURA THE ELECTRICAL STEERING COMPONENT MODULE OF THE VEHICLE. THE NEXT PERSON THIS HAPPENS TO MAY NOT BE ABLE TO MANEUVER OVER AND CAUSE A FATAL CRASH.",
        "vin": "JH4CU2F42CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011292,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FROZE UP AND ALMOST CAUSED AN ACCIDENT FOR MY WIFE AND SON . FOUND OUT ACURA HAS A LOT OF POWER STEERING MODULE ISSUE. NOT RELIABLE SINCE ITS NOT VERY OLD VEHICLE. I BELIEVE ACURA SHOULD REIMBURSE ME FOR MY COST OF REPLACEMENT OF POWER STEERING MODULE.",
        "vin": "JH4CU2F64CC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002006,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST WEEK DRIVING MY ACURA TSX 2012 CAR HOME FROM WORK, SUDDENLY THE ELECTRONIC POWER STEERING FAILED.  I WAS DRIVING ON A WINDING ROAD AND MID SHARP TURN THE POWER STEERING FAILED AND I ALMOST LOST CONTROL AND CAME CLOSE TO CRASHING INTO THE TREE LINE ON THE SIDE OF THE ROAD.  I HAD STOP SINCE MY HEART WAS PALPITATING SO HARD.  I ALMOST CRASHED INTO THE TREE LINE AND WOULD HAVE BEEN SERIOUSLY INJURED  OR WORSE.  LUCKILY MY INSTINCTS KICKED IN AND I WAS ABLE TO WITH ALL MY MIGHT SLOW DOWN THE CAR AND TURN THE WHEEL AS HARD AS I COULD TO AVOID CRASHING.  THIS IS REALLY DANGEROUS AND I AM LUCKY THAT I CAME AWAY UNSCATHED.  I TOOK MY CAR TO THE DEALER AND THEY TOLD ME THAT I NEEDED TO REPLACE THE WHOLE ELECTRONIC MODULE WHICH WILL COST APPROXIMATELY $1200 TO FIX/REPLACE.  THIS TYPE OF FAILURE IS VERY DANGEROUS AND SOMETHING NEEDS TO BE DONE ABOUT IT.",
        "vin": "JH4CU2F66CC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979298,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THAT AN INDEPENDENT DEALER SOLD THE VEHICLE WITHOUT DISCLOSING THAT THE AIR BAG DEPLOYED IN THE PAST, WHICH CAUSED THE SRS INDICATOR TO ILLUMINATE ON AND OFF. THE VEHICLE WAS TAKEN BACK TO THE SELLER WHO TOOK THE VEHICLE TO A CERTIFIED DEALER. THE TECHNICIAN DIAGNOSED THE VEHICLE AND INFORMED THE CONTACT THAT THE AIR BAG FAILURE INVOLVED THE ENTIRE AIR BAG SYSTEM AND NOT JUST THE SRS INDICATOR. THE DEALER STATED THAT THE VEHICLE WAS UNSAFE TO DRIVE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT STATED THAT THE SELLER DID NOT TAKE RESPONSIBILITY FOR THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 66,000.",
        "vin": "JH4CU2F65CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORK FOR BER NOW, AND I GIVE RIDES TO PEOPLE. SO I HAD JUST PICKED UP A SECOND PASSENGER AT A PARKING LOT AND WAS DRIVING AT AROUND 20-25 MPH AND I HAD TO TURN TO GET OUT OF THE PARKING LOT. AS I TRIED TURNING THE STEERING WHEEL LOCKED ON ME AND GOT A MESSAGE ON MY DASH TO CHECK POWER STEERING. SO I HAD TO BRAKE IMMEDIATELY AND LET THE PASSENGERS KNOW WHAT WAS GOING ON. I WAS BLOCKING TRAFFIC INTO THE PARKING LOT TO TRY TO FIGURE OUT WHAT WAS GOING ON. AFTER TURNING THE CAR OFF AND BACK ON AND FORCING THE STEERING WHEEL, I WAS ABLE TO UNLOCK THE WHEEL BUT I WAS STILL VERY HAD TO TURN. TOWED  THE CAR TO THE DEALERSHIP AND THEY SAID THEY HAD TO REPLACE THE ELECTRIC STEERING SYSTEM ON THE CAR WHICH WAS OVER $1400 OUT OF POCKET. LUCKY I WASN'T DRIVING AT HIGHER SPEEDS IN THE FREEWAY OTHER WISE I DON'T KNOW WHAT COULD OF HAPPENED.",
        "vin": "JH4CU2F89CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/08/2017",
        "dateOfIncident": "03/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST POWER STEERING WHILE DRIVING ON THE FREEWAY",
        "vin": "JH4CU2F62CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "02/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958805,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ALL OF A SUDDEN (ELECTRIC POWER) STEERING COMPLETELY LOOKED, COULD NOT MOVE RIGHT OR LEFT, VERY SERIOUS SAFETY ISSUE, LUCKILY PULL OVER AND TOWED TO MY AUTO SHOP, ELECTRIC POWER STEERING (EPS) MODULE NEEDS TO BE REPLACED COST ME $1,200.",
        "vin": "JH4CU2F66CC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/14/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945236,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT IN THE SNOW AND SLID INTO THE GUARDRAIL WHILE TURNING. NOT MUCH BODY DAMAGE, BUT THE STEERING COMPLETELY LOCKED. WAS STUCK IN THE ROAD FOR 2 HOURS WITH THE POLICE HAVING TO BLOCK OFF AROUND  ME.  HAD IT TOWED TO MY MECHANIC. HE COULD NOT DO ANYTHING WITH IT BECAUSE HE SAID IT WAS ELECTRICAL AND COULD NOT CLEAR THE CODE THAT WAS COMING UP AND NEEDED TO GO THE DEALERSHIP.HAD TO HAVE IT TOWED TO THE DEALERSHIP. THEY ARE REPLACING THE STEERING.",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945198,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST FINISHED RIGHT TURN AND WHEN DRIVING STRAIGHT AHEAD, THE WARNING LIGHT FOR EPS CAME ON AND ALL ASSIST LOST. DROVE 3 MILES HOME, TURNED CAR OFF IN DRIVEWAY WHILE CALLING DEALER AND WHEN IMMEDIATELY RESTARTED, ASSIST RETURNED. DRIVE ABOUT ONE MILE AND LOST ASSIST AGAIN. ON WAY TO DEALER, STRAIGHT HIGHWAY DRIVING, SOME ASSIST RETURNED BUT WHEEL WOULD NOT CENTER STRAIGHT AHEAD. THE FAILURE OCCURRED OUT OF THE BLUE WITH NO INDICATION BEFORE HAND. MY TSX HAS 52,078 MILES ON IT. WAS TOLD BY DEALER THE EPS MODULE NEEDED TO BE REPLACED @ ~$1200. WITHOUT SIGNIFICENT STRENGTH, DRIVER'S SAFETY AT SIGNIFICANT RISK.",
        "vin": "JH4CU2F41CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936367,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, IN MOTION, THE ELECTRONIC POWER STEERING (EPS) FAILED.  DASH INDICATOR LIGHT DISPLAYED \"CHECK POWER STEERING SYSTEM\".  STEERING WHEEL WAS INCREDIBLY DIFFICULT TO MANEUVER.  I HAVE DRIVEN CARS EQUIPPED WITH TRADITIONAL BELT & PUMP-DRIVEN POWER STEERING SYSTEMS THAT FAILED BEFORE WITH NOT MUCH ISSUE EXCEPT REASONABLY EXTRA EFFORT TO MANEUVER, BUT THE HIGHER LEVEL OF STRENGTH REQUIRED AFTER THE TSX'S ESP FAILED WAS SHOCKINGLY GREATER.  THE CAR WAS DIAGNOSED AT AN ACURA DEALERSHIP THAT CONFIRMED THE EPS MODULE HAD FAILED.  THIS MODULE IS BASICALLY A COMPUTER, SO IT CANNOT BE GIVEN REGULAR MAINTENANCE OR MONITORED.  THE CONSUMER WILL NEVER HAVE ANY SIGNS OF FAILURE UNTIL IT ACTUALLY FAILS.  *TR",
        "vin": "JH4CU2F84CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "11/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926502,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "EPS (ELECTRIC POWER STEERING) LIGHT COME ON WHILE DRIVING AND LOCK STEERING.   ERROR CODE: 32-09.  EPS LIGHT WILL TURN OFF AFTER RESTART ENGINE BUT WILL COME ON AGAIN AND LOCK STEERING AGAIN WHILE THE VEHICLE IS MOVING.   I BROUGHT MY CAR TO LOCAL SHOP TO RUN DIAGNOSTIC AND THEY SUGGEST THAT THIS IS BAD MANUFACTURE ISSUE AND SUGGEST TO CONTACT ACURA TO FIX IT UNDER ITS WARRANTY.  I HAVE CALL ACURA DEALER AND THEY SAID THEY ARE NOT COVER IT AND I HAVE TO PAID TO GET IT FIX.  IT IS A REALLY DANGEROUS PROBLEM AND CAN CAUSE MAJOR ACCIDENT IF IT WAS TURNING AND EPS LIGHT ON AND LOCK MY STEERING WHEEL.  I ATTACHED RECEIPT REPORT FROM AUTO SHOP.  THANKS",
        "vin": "JTEBU5JRXG5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917470,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 14 YEAR OLD DAUGHTER, WHO'S LEARNING TO DRIVE WAS BEHIND THE WHEEL WHEN THE CAR STEERING WHEEL LOCKED UP AND WOULDN'T ALLOW HER TO TURN THE VEHICLE.  LUCKILY WE HADN'T APPROACHED THE HIGHWAY YET OR WHO KNOWS WHAT WOULD HAVE HAPPENED WHILE DRIVING ON THE HIGHWAY.  WE WERE BACKING OUT OF OUR DRIVEWAY AND SHE SAID THE WHEEL FELT FUNNY.  WE WERE A MILE FROM OUR HOME ENTERING A ROUND AND HEADING ONTO THE HIGHWAY WHEN SHE SAID THE WHEEL WOULDN'T TURN AND SHE PANICKED.  I GRABBED THE WHEEL AND IT WOULDN'T BUDGE.  WE CAME TO A COMPLETE STOP IN THE ROUND ABOUT AND THANK GOD NO ONE WAS ENTERING OR EXITING IT.  I HAD TO SHUT THE CAR OFF AFTER SHE STOPPED THE CAR THAT WAS SIDEWAYS IN THE STREET.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874317,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. WHILE MAKING A LEFT TURN INTO A PARKING SPACE AT A VERY LOW RATE OF SPEED, THE VEHICLE SUDDENLY EXPERIENCED UNINTENDED ACCELERATION AND SURGED FORWARD. THE VEHICLE WAS TAKEN  TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO A FAULTY BATTERY. THE BATTERY WAS REPLACED. APPROXIMATELY 10 MONTHS LATER, THE SAME FAILURE RECURRED WHILE TURNING LEFT INTO A PARKING SPACE AT A VERY LOW RATE OF SPEED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO WAS UNABLE TO DUPLICATE THE FAILURE AND NO REPAIRS WERE PERFORMED. THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 32,000. UPDATED 08/22/16*LJ  THE CONSUMER HAS SINCE TRADED THE VEHICLE. UPDATED 08/30/16.*JB",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861321,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY APRIL 11, 2016 AT APPROXIMATELY 9:40AM WHILE DRIVING ON I-15 NORTH I HEARD A VERY LOUD NOISE WHICH I FOUND OUT AFTER PARKING MY CAR THAT THE MOONROOF HAD SHATTERED AND WAS BENT OUTWARD. IT WAS NOT CLEAR TO ME WHAT HAPPENED OR WHERE THE NOISE CAME FROM WHEN I WAS DRIVING, SINCE THERE WERE NO OTHER VEHICLES IN CLOSE VICINITY AND THERE WERE NO LOOSE OBJECTS ON THE ROAD.   I WAS DRIVING ROUGHLY AROUND 70MPH WHEN THE MOONROOF UNEXPECTEDLY SHATTERED, ALL WINDOWS WERE CLOSED, RADIO WAS OFF AND THE VISOR/SHADE TO THE MOONROOF WAS ALSO CLOSED.   I IMMEDIATELY REPORTED THE SITUATION TO ACURA OF RIVERSIDE IN CALIFORNIA WHERE I ORIGINALLY PURCHASED THE CAR (BRAND NEW) AND WAS REFERRED TO ACURA CLIENT RELATIONS WHO THEN INSTRUCTED ME THAT I GO TO THE NEAREST ACURA DEALERSHIP TO HAVE THE CAR INSPECTED.I TOOK THE CAR TO KEARNY MESA ACURA IN SAN DIEGO AND THEY HELD MY CAR ALL DAY ON APRIL 14. THEY DID NOT INSPECT AND EXAMINE THE MOONROOF TO DETERMINE WHAT CAUSED IT TO SHATTER.  IN CONCLUSION, IT IS DISINGENUOUS FOR KEARNY MESA ACURA TO NOT EVEN INSPECT THE CAR AND IT IS APPALLING AND INEXCUSABLE FOR THE CASE AGENT AT ACURA CLIENT RELATIONS TO NEGLIGIBLY DISMISS THE REPORT AS 'DAMAGE IS FROM OUTSIDE INFLUENCE'. LASTLY, I TOOK THE CAR FOR INSPECTION TO ACURA OF RIVERSIDE ON APRIL 23 AND WAS TOLD THERE IS NO IMPACT ON THE MOONROOF BUT THE DECISION IS UP TO DISTRICT PARTS & SERVICE MANAGER AT AMERICAN HONDA MOTOR COMPANY, INC. ACURA OF RIVERSIDE CALLED ME ON APRIL 25, 2016 STATING THE DISTRICT PARTS & SERVICE MANAGER SAYS DAMAGE WAS DONE BY OUTSIDE INFLUENCE WOW!  THIS EXPERIENCE TO SAY THE LEAST HAS BEEN HORRENDOUS AND UNFAIR, AS I WRITE THIS I HAVE A 2002 CIVIC EX ON THE DRIVEWAY CURRENTLY ON RECALL FOR THE TAKATA AIRBAGS AND MY FAMILY OWNS TWO MORE ACURA TSX'S. I CAN ONLY SAY SHAME ON EVERYTHING ACURA AND SHAME ON EVERYTHING HONDA.    POST NOTE: (FULL LETTER ATTACHED IN PDF)",
        "vin": "JH4CU2F62CC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2016",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853040,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RED PAINT IS FADING IN PATCHES ON THE TOP SURFACES-HOOD, ROOF, AND TRUNK. OTHER BOARDS REPORT SAME PROBLEM WITH HONDA/ACURA RED CARS. CAR HAS ONLY 40,000 MILES, GARAGE KEPT. DEALER ACKNOWLEDGED ISSUE. OFFERED TO REPAINT HOOD ONLY BUT COULD NOT GURANTEE MATCH. ACURA/HONDA HAS DEFECT IN RED PAINT THEY WILL NOT BACK",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "08/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758477,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING VEHICLE I NOTICED INTERMITTENT \"CHECK POWER STEERING SYSTEM\". DURING DRIVE CYCLE I ENCOUNTERED FAILURE OF ELECTRIC POWER STEERING ASSIST, VERY DIFFICULT TO STEER VEHICLE. WENT TO DEALER FOR SERVICE, THEY WITNESSED SAME SYMPTOMS STATED ABOVE, BUT INTERMITTENT CHECK LIGHT WILL NOT PRODUCE A FAULT CODE, TECHNICIAN STATED IT SEEMS LIKE A GROUND PROBLEM. UNABLE TO DRIVE VEHICLE DUE TO UNSAFE CONDITION, VERY DIFFICULT TO STEER, WOULD NOT BE ABLE TO AVOID AN EMERGENCY WHILE DRIVING BECAUSE OF THE AMOUNT OF FORCE NEEDED TO STEER VEHICLE.",
        "vin": "JH4CU2F65CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "01/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST THING IN THE COLD MORNING MY BRAKE PEDAL WAS SOLID, NO MOVEMENT WHEN I PRESS IT, AND THUS NO BRAKES. THIS IS THE 2ND TIME, BUT THE FIRST TIME (A WEEK AGO) I THOUGHT I DID SOMETHING WRONG BECAUSE IT WENT AWAY QUICKLY. THIS MORNING I ALMOST DROVE INTO TRAFFIC. AND AFTER I ENTERED THE ROAD, IT TOOK A FEW MINUTES BEFORE THE BRAKES RETURNED TO NORMAL. I'M GUESSING THERE IS SOME MOISTURE IN THE BRAKE LINE THAT IS FROZEN AND EVENTUALLY IT THAWS AND THE BRAKES RETURN.  *TR",
        "vin": "JH4CU2F65CC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/25/2015",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678768,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD I NEED TO REPLACE MY BRAKES.  HAS ANYONE ELSE HAVE THIS PROBLEM WITH 2012 TSX AT 28K MILES?  *TR",
        "vin": "JH4CU2F6XCC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644740,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL EPISODES OF ENGINE HESITATION. I HAVE ALWAYS USED PREMIUM GAS.  I RETURNED FOR AN OIL CHANGE (ANNUAL SERVICE) AND ALSO ASKED IF ANY ENGINE HESITATION SERVICE BULLETINS OR ADVISORIES HAD BEEN ISSUED. NONE HAD BEEN. THESE EPISODES HAVE OCCURRED ABOUT 20 TIMES WITH THE CAR. IT ALWAYS OCCURRED WHEN ACCELERATING MODERATELY FROM BELOW 20 MILES AN HOUR. IT LAST FROM 2 TO 3 SECONDS, WHILE THE ENGINE DOES NOTHING. THE HESITATION CANNOT BE SUMMONED UPON DEMAND. ON SOME OCCASIONS, THE HESITATION HAS PUT ME AT RISK OF COLLISION, WHERE I COULD NOT GO FORWARD BUT HAD TO BRAKE. THE RISK OF NONPERFORMANCE IS ALWAYS PRESENT AND IS A CONSTANT SOURCE OF DISSATISFACTION FOR US.  *TR",
        "vin": "JH4CU2F47CC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626545,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/3/2013, I TOOK MY CAR IN TO THE DEALER FOR SERVICE BECAUSE IT HAD DEMONSTRATED SEVERAL EPISODES OF ENGINE HESITATION.  I HAVE ALWAYS USED PREMIUM GAS.  THE CAR WAS CHECKED, BUT THE SYMPTOMS WERE NOT OBSERVED AND NO CAUSE COULD BE DETERMINED.    ON 9/19/2013, I RETURNED FOR AN OIL CHANGE (ANNUAL SERVICE) AND ALSO ASKED IF ANY ENGINE HESITATION SERVICE BULLETINS OR ADVISOR'S HAD BEEN ISSUED.  NONE HAD BEEN.    THESE EPISODES:  ?HAVE OCCURRED ABOUT 15 TIMES WHILE OWNING THE CAR.  ?HAVE ALL OCCURRED WHEN ACCELERATING MODERATELY FROM BELOW 20 MILES AN HOUR.  ?HAVE OCCURRED UNDER ALL COMBINATIONS OF ENGINE AND AIR TEMPERATURES.  ?LAST FROM 2 TO 3 SECONDS, WHILE THE ENGINE DOES NOTHING.  ?ARE INTERMITTENT AND CANNOT BE SUMMONED UPON DEMAND.    ON SOME OCCASIONS, THE HESITATION HAS PUT ME AT RISK OF COLLISION, WHERE I COULD NOT GO FORWARD BUT HAD TO BRAKE.  THE RISK OF NONPERFORMANCE IS ALWAYS PRESENT AND IS A CONSTANT SOURCE OF DISSATISFACTION FOR ME.    BASED ON MY LIMITED UNDERSTANDING, MY GUESS IS THE CAUSE INVOLVES A SENSOR OR COMPUTER.  *TR",
        "vin": "JH4CU2F61CC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "03/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614650,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS STARTED IT MAKES A NOISE AS IF MY CAR WAS ALREADY STARTED AND I WAS TRYING TO START IT AGAIN. HAPPENS WHEN CAR HAS SAT FOR A FEW HOURS.   IF THE VEHICLE IS ACCELERATED FAST IT SMELLS AS IF SOMETHING IS BURNING.  *TR",
        "vin": "JH4CU2F63CC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/23/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THAT WHILE STOPPED AT A STOP SIGN HE DEPRESSED THE ACCELERATOR PEDAL AND NOTICED THE VEHICLE WAS HESITANT TO ACCELERATE. THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 300.  *TR",
        "vin": "JH4CU2F44CC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10502566,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END DAMAGE BOTH SIDES DAMAGED AIR BAGS DID NOT COME ON WIFE DIED, DEALER SAY BAGS OK BUT DIDNT KNOW WHY THEY DIDNT COME ON.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2013",
        "dateOfIncident": "01/28/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496006,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THAT WHEN THE ENGINE RPMS INCREASED BETWEEN 4000 AND 4200, THE ENGINE WOULD EXHIBIT A MOMENTARY DELAY BEFORE RESPONDING AND CONTINUING NORMAL OPERATION. THE FAILURE OCCURRED WHEN THE CONTACT WAS DRIVING IN BOTH AUTOMATIC AND MANUAL MODE. IN ADDITION, WHEN THE CAR IS IN UPSIDE A HILL,  THE VEHICLE WOULD SPORADICALLY STALL WHEN THE FAILURE OCCURRED.  THE FAILURE MILEAGE WAS 4,800 WAS AND THE CURRENT MILEAGE WAS 4,906.  *TR",
        "vin": "JH4CU2F46CC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2013",
        "dateOfIncident": "11/21/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494674,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2012 ACURA TSX. THE CONTACT STATED THAT WHEN THE ENGINE RPMS INCREASED BETWEEN 3500 AND 4200, THE ENGINE WOULD EXHIBIT A MOMENTARY DELAY BEFORE RESPONDING AND CONTINUING NORMAL OPERATION. THE FAILURE OCCURRED WHEN THE CONTACT WAS DRIVING IN BOTH AUTOMATIC AND MANUAL MODE. IN ADDITION, THE VEHICLE WOULD SPORADICALLY STALL WHEN THE FAILURE OCCURRED. THE CONTACT HAD THE VEHICLE INSPECTED BY A DEALER AND WAS TOLD THAT THE VEHICLE WAS RUNNING PROPERLY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 4,750 WAS AND THE CURRENT MILEAGE WAS 4,817.  UPDATED 03/07/13*LJ",
        "vin": "JH4CU2F46CC"
    }
]