[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144151,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CLICKS WHEN ACCELERATING OR DECELERATION",
        "vin": "5UXZV8C51BL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144153,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COOLANT LINES NEEDED COMPLETELY REPLACED CAUSING THE ENGINE TO START BARRELING SMOKE AFTER ABOUT 400-500 FT.  LOOKED LIKE IT WAS ON FIRE THERE WAS SO MUCH SMOKE. GOT REPAIRED AT BMW OF WESTLAKE IN OHIO. THEY TOLD ME THERE WAS NOTHING I COULD DO TO HAVE PREVENTED IT.",
        "vin": "5UXZV8C51BL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083702,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO REPORT A VANOS ISSUE THE CAMSHAFT BOLTS LOOSEN AND BREAK AND IT COULD BE CATASTROPHIC.  MY BOLTS LOOSENED AND I CAUGHT IT IN TIME BUT IF I DIDN'T KNOW ANY BETTER I COULD'VE HAD A COMPLETE ENGINE FAILURE.  MY CODE ORIGINALLY CAME UP AS CAMSHAFT STICKING. WHEN THE PROBLEM ORIGINATED I WAS TRAVELING ON A MAIN CITY ROAD AND MY CAR WENT INTO REDUCED POWER MODE.",
        "vin": "5UXZV4C54BL"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "12/16/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080383,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HARD ACCELERATION OF THE CAR WHILE GETTING ON THE FREE WAY RAMP, THE CAR WENT INTO LIMP MODE. THE ENGINE PERFORMANCE WAS DEGRADED AND I HAD TO PULL ON THE SIDE OF THE ROAD TO RESTART THE CAR. THE CAR WAS TAKEN TO BMW OF BELLEVUE NEXT WEEK AFTER INITIAL DIAGNOSIS OF A DME INTERNAL FAULT BY A SIGNATURE INDEPENDENT KIRKLAND. BMW OF BELLEVUE REPLACED AIR MASS FILTER AND OIL FILLER CAP. A FEW WEEKS LATER THE ISSUE HAPPENING AGAIN DURING REGULAR DRIVING ON THE FREEWAY. BMW OF BELLEVUE DIAGNOSED THIS AS A VACUUM HOSE LEAK. A FEW WEEKS LATER THE CAR WENT INTO LIMP MODE AGAIN WHILE GETTING ON THE FREEWAY, BMW OF BELLEVUE DIAGNOSED THIS AS A HIGH PRESSURE FUEL SENSOR SHORT, BMW OF NORTH AMERICA OPENED A PUMA CASE, BUT DID NOT RECOMMEND REPLACING THE DME YET. RIGHT AFTER PICKING UP THE CAR I HIT THE ISSUE AGAIN WHERE THE CAR WENT INTO LIMP MODE WHILE ACCELERATING ON THE FREEWAY RAMP. BMW OF BELLEVUE WORKED WITH BMW OF NA TO REPLACE THE DME WHICH IS COVERED UNDER WARRANTY. BEFORE HANDING THE CAR BACK THE SERVICE ADVISOR DID A TEST AND WAS ABLE TO STILL REPRODUCE THE CAR GOING INTO LIMP MODE GETTING ON THE FREEWAY, DIAGNOSIS IS STILL NOT KNOWN. IT HAS BEEN 3 MONTHS TODAY SINCE THE ISSUE FIRST HAPPENED AND THE CAR HAS BEEN OUT OF USE FOR MORE THAN A MONTH AND THERE IS STILL NO CONCLUSION ON THE ROOT CAUSE.",
        "vin": "5UXZV4C52BL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066500,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SERVICE ADVISER AT THE BMW DEALERSHIP MENTIONED THAT THE DMTL PUMP IN MY VEHICLE HAS FAILED. I FOUND THE BELOW DOCUMENT REGARDING THE DMTL PUMP.   HTTPS://STATIC.NHTSA.GOV/ODI/TSBS/2012/SB-10051299-3508.PDF    CAN YOU PLEASE CHECK THIS AND LET ME KNOW OF MY OPTIONS?    THANKS  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXZV4C54BL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030853,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "X5 XDRIVE 35I SAV; WHILE DRIVING UNDER NORMAL STREET AND HIGHWAY CONDITIONS, VEHICLE SPEED AND ENGINE RPM HAVE BECOME UNSTABLE. THIS CAUSES THE VEHICLE TO INCREASE AND DECREASE IT'S SPEED INTERMITTENTLY AND WITHOUT WARNING. THE VEHICLE IS NOT TRUSTWORTHY AS YOU MAY LOSE POWER, OR UNINTENTIONALLY ACCELERATE WHILE TRYING TO EXECUTE A DRIVING MANEUVER, CAUSING A DANGEROUS CONDITION. CHECK ENGINE WARNING LIGHT ILLUMINATES. VEHICLE WAS BROUGHT TO BMW DEALERSHIP (ZT MOTORS) FOR DIAGNOSTICS. SERVICE PERSONNEL STATED THAT THE HIGH PRESSURE FUEL PUMP INDICATED A LOW FUEL PRESSURE AT THE INLET. THIS WOULD TELL ME THAT THE LOW PRESSURE FUEL PUMP IS NOT DELIVERING THE CORRECT FUEL FLOW/PRESSURE TO THE HIGH PRESSURE FUEL PUMP. REF NHTSA CAMPAIGN # 16V746000 ET AL.    DIAGNOSTICS ALSO INDICATED THE VALVETRONIC MOTOR SHOWS IT SHORT CIRCUITING. DEALER RECOMMENDED REPLACEMENT OF VALVETRONIC MOTOR, CAM SHAFT AND OIL INJECTORS. THE REPLACEMENT OF THE CAM SHAFT AND OIL INJECTORS ARE UNNECESSARY MAINTENANCE ITEMS, ONLY THE VALVETRONIC MOTOR WOULD NEED TO BE REPLACED, AND FUEL SYSTEM REPROGRAMMED. REF NHTSA CAMPAIGN # 14V176000 ET AL.    RECOMMEND RECALL REPLACEMENT OF BOTH HIGH PRESSURE AND LOW PRESSURE FUEL PUMPS, VALVETRONIC MOTOR, VANOS CAM SHAFT AND OIL INJECTORS AS WELL AS REPROGRAMMING OF FUEL OPERATING SYSTEM. ALSO REPLACE CAM SHAFT MOUNTING BOLTS.",
        "vin": "5UXZV4C50BL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/18/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024054,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS HAVING A RECALL REGARDING THE IN-TANK FUEL PUMP SINCE OCTOBER 2016 BMW OF SAN DIEGO HAS FAILED TO PROVIDE A REPLACEMENT PART IN A TIMELY MANNER AND BMW OF EL CAJON HAS JUST PROVIDED THE NECESSARY PART FOR MY PERSONAL VEHICLE I HAVE WAITED ALMOST A YEAR FOR A PART TO BE PROVIDED FOR MY VEHICLE. MOREOVER, THE CAR HAS BEEN EXPERIENCING FAILURES IN IGNITION AND STALLING DUE TO THIS PARTICULAR ISSUE AND POSSIBLY OTHER ISSUES THAT ARE DERIVED FROM THIS SPECIFIC RECALL. OTHER ISSUES REGARDING THE ENGINE COULD BE IN QUESTION DUE TO THE FACT THAT THE ENGINE RARELY SHUTS BY ITSELF WHEN STARTING THE IGNITION, ALSO THERE IS A PROBLEM INVOLVING COLD STARTS IN MOST BMW VEHICLES AND MY CAR IS NOT AN EXCEPTION. THE ENGINE SHUTTING OFF BY ITSELF IS A SPECIAL CONCERN BECAUSE THIS MAY MEAN THERE ARE OTHER FAULTY PARTS LOCATED DEEP WITHIN THE VEHICLE.",
        "vin": "5UXZV4C59BL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/26/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020569,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE THE VEHICLE ON VACATION AND THE ENGINE WOULD STUDDER AND STALL ON THE HIGHWAY AND AN ERROR PROMPTED ON THE VEHICLE DASHBOARD THAT DISPLAYED \"ENGINE MALFUNCTION\" REDUCED POWER. OCCASIONALLY THE VEHICLE ENGINE WOULD CUT OFF WHILE ON THE ROAD AND NEEDED TO BE TOWED TO THE DEALERSHIP. THE DEALER DIAGNOSED THAT IT HAS A HIGH PRESSURE FUEL PUMP MALFUNCTION THAT NEEDED TO BE REPLACED AND ALTHOUGH THE VEHICLE IS NOT PART OF THE RECALL IT SHOWED THE SAME SYMPTOMS AS SOME PROBLEMATIC MODELS. THIS OCCURRED WHILE DRIVING THE VEHICLE ON BOTH LOCAL ROADS AND THE HIGHWAY. IN ONE OCCASION, I NEEDED TO RESTART THE CAR TO GET IT TO A SAFE LOCATION.",
        "vin": "5UXZV4C56BL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006391,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER PUMP  I WAS DRIVING DOWN THE HIGHWAY WHEN I GOT THE SIGNAL TO DRIVE SLOW OR MODERATE  BECAUSE THE ENGINE IT'S GETTING HOT I PULLED OVER TURN OFF THE CAR GOT OUTSIDE TO SMOKE A CIGARETTE AND I COULD SMELL SOMETHING BURNING MORE LIKE WIRE BURNING",
        "vin": "5UXZV4C57BL"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2017",
        "dateOfIncident": "05/06/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985577,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY MAY 6TH 2017. I WAS DRIVING WHEN I HEARD THIS NOISE TO MY UNTRAINED EAR IT SEEMED AS IF THE NOISE WAS COMING FROM MY FRONT TIRES? I PULLED OVER GOT OUT TO CHECK MY FRONT TIRES/WHEEL'S AND THERE WAS NOTHING, I GET BACK INTO MY VEHICLE AND START DRIVING AGAIN AFTER A FEW MINUTES THE SAME NOISE COULD BE HEARD AGAIN SO ONCE AGAIN I PULLED OVER GOT OUT AND CHECKED MY TIRES/WHEELS AND UNDERCARRIAGE. AS I AM LOOKING THERE IS NOTHING HANGING OR LOOSE, I GET BACK INTO THE VEHICLE AND STARTED TO HEAD TOWARDS MY HOUSE I WAS ONLY ABOUT 6 BLOCKS AWAY FROM HOME SO I CALL MY FIANCE AND ASKED HE TO COME OUTSIDE (I WANTED HER TO DRIVE THE VEHICLE JUST A LITTLE SO THAT I COULD SEE IF MY WHEELS WERE DOING ANYTHING STRANGE, THIS WOULD HELP ME TO BETTER EXPLAIN WHAT I THROUGH WAS HAPPING TO MY VEHICLES WHEELS/TIRES) AS SOON AS I HANG THE PHONE UP I SLOWED DOWN TO GO OVER A SPEED HUMP AT THE TIME I DID NOT NOTICE BUT I HAD LOST POWER IN THE VEHICLE AS I TRIED TO USE MY BREAKS THE VEHICLE DID NOTHING AND I DO MEAN NOTHING SO NOW I AM ROLLING STRAIGHT AND GO THROUGH TWO STOP SIGNS HOPING AND PRAYING THAT ONE HITS ME, DUE TO THE VEHICLE HAVING NO POWER. A MESSAGE SHOWS UP ON THE SCREEN SAYING 'TRANSMISSION MALFUNCTION' THE MALFUNCTION MAYBE RESOLVED BY RESTARTING. CONTRACT NEAREST BMW CENTER IF NECESSARY. USE EMERG. RELEASE TO DISENGAGE PARK DETENTION PRIOR TO TOWING OR PUSHING VEHICLE. NOW MINE YOU THIS MESSAGE ONLY SHOWED AFTER THE VEHICLE LOST ALL POWER. AS I AM GOING THROUGH THE SECOND STOP SIGN THERE IS A SLIGHTL/SMALL HILL THAT I WENT UP AND THE VEHICLE LOST ENOUGH SPEED THAT I WAS ABLE TO SMASH THE BRAKES REAL HARD TO STOP THE VEHICLE FROM MOVING. A CAR ALL MOST HIT ME IN THE REST BECAUSE OF THIS ACTION, AND NOW I AM SITTING ON THIS SLIGHT HILL HOLDING MY FOOT ON THE BREAK.  ONCE THE VEHICLE WAS TOWED TO A BMW DEALERSHIP I WAS TOLD ABOUT THE DRIVESHAFT RECALL.",
        "vin": "5UXZV4C52BL"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985509,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVESHAFT RECALL- WHEN OPERATING THE VEHICLE LOW AND HIGH SPEED, VIBRATIONS CAN BE FELT THROUGHOUT THE CAR. WHEN TAKEN TO THE MECHANIC, THERE WAS SOME FOREPLAY IN THE DRIVESHAFT AND COULD HAVE GIVEN OUT AT ANY MOMENT. HAD THE DRIVESHAFT GAVE OUT WHILE THE VEHICLE IS IN MOTION AT HIGHER SPEED, RESULTS COULD HAVE BEEN FATAL. THE ISSUE HAS ALREADY BEEN ADDRESSED BY THE NHTSA FOR THE SAME MODEL OF LATER PRODUCTION DATES. MAIN CONCERN IS WHY ARE THE VEHICLES BEFORE THE COVERED PRODUCTIONS DATES AND MODELS THAT HAVE THE SAME ISSUES NOT BEING COVERED?    PARKING BRAKE MALFUNCTION- PARKING BRAKE MOTOR FAILS WHICH CAUSES THE PARKING BRAKES TO BE LOCKED. DRIVER AND PASSENGERS WERE STRANDED. BASED ON INDEPENDENT RESEARCH, THIS IS A COMMON ISSUE WITH BMW VEHICLES. THIS SHOULD BE ADDRESSED.",
        "vin": "5YMGY0C55BL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983527,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY FILED A COMPLAINT WITH YOU, BUT INADVERTENTLY SAID MY CAR WAS MFG IN MARCH 2011, BUT IT WAS ACTUALLY MFG IN MARCH 2010. BMW PREVIOUSLY RECALLED VEHICLES MFG FROM APRIL 4 TO NOV 30 2010. DUE TO CONTINUING COMPLAINTS, BMW RECALLED THE ENTIRE MODEL YEAR, BUT ONLY ADDED THE NEW RECALL TO THE PREVIOUS RECALL, SO IT GOES FROM APRIL 2010 TO 2013. MINE WAS ONE OF THE FIRST MFG IN 2010 AND HAS THE SAME ISSUE BUT WAS NOT RECALLED. CAN YOU PLEASE EXTEND THE RECALL BACK ONE MONTH TO GET THE FIRST CARS PRODUCED THAT YEAR?  MINE IS ABOUT THE ONLY ONE LEFT OUT OF THE RECALL AND HAS ALREADY FAILED AND IS IN THE SHOP BUT BMW DENIES THE CLAIM.",
        "vin": "5UXZV8C5XBL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2017",
        "dateOfIncident": "03/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972406,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "CRYSTALLIZED DIESEL EXHAUST FLUID (DEF) CLOGGING SELECTIVE CATALYST REDUCTION (SCR) METERING VALVE. VALVE FAILURE. ADDITIONAL SUBSEQUENT DAMAGE TO DEF METERING LINE, NOX SENSOR, WIRING, CONNECTORS, ETC. CHECK ENGINE LIGHT ON. MULTIPLE CODES SET IN COMPUTER. SAME ISSUE WITH SAME SCR METERING UNIT PART # 18 30 7 807 206 (BOSCH OEM) AS ACKNOWLEDGED IN BMW TECHNICAL SERVICE BULLETIN SI B 18 04 12 WHICH COVERS REPLACEMENT OF SELECTIVE CATALYST REDUCTION (SCR) METERING UNIT IN E90 SERIES VEHICLES WITH SAME M57Y DIESEL ENGINE AS MY VEHICLE. BMW HAS EXTENDED WARRANTY COVERAGE FOR MY VEHICLE TO 10 YEARS/120,000 MILES FOR OTHER RELATED DIESEL EXHAUST FLUID (DEF) ISSUES, INCLUDING, BUT NOT LIMITED TO ACTIVE DEF TANK/SENSOR, FOOTWELL MODULE, EGR/NOX SENSORS, ETC.",
        "vin": "5UXZW0C54BL"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "03/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960363,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING MESSAGE APPEARED: RESTRAINT SYSTEM MALFUNCTION! FAULT IN PASSENGER RESTRAINT SYSTEM AFFECTING AIRBAG, BELT TENSIONER OR BELT-FORCE LIMITER.    ALSO DRIVER'S ELECTRIC SEAT CONTROL NOT WORKING.",
        "vin": "5UXZV4C53BL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893483,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED THE ORIGINAL RECALL NOTICE IN MARCH 2016 FOR MY DRIVERS FRONT AIR BAG, RECEIVED ANOTHER ONE JULY 2016 FOR PASSENGER FRONT AIR BAG. WONDERING HOW MANY OTHER ONE'S I WILL RECEIVE. NOTHING HAS BEEN REPAIRED. ALL I HEAR IS BY SUMMER, THEN BY MID SUMMER NOW, THEY DON'T KNOW. BUT THEY SUGGEST I WARN ANYONE DRIVING MY CAR THEY COULD GET KILLED IF IN AN ACCIDENT. I CONSIDER THAT I AM DRIVING A $85000 DEATH TRAP. SINCE THERE IS SUCH DANGER SHOULD NOT SOMEONE HAVE TO PROVIDE ME WITH A LOANER CAR OR RENTAL AT THEIR EXPENSE!. BECAUSE I AM TELLING YOU IF I OR SOMEONE SHOULD BECOME INJURED OR DEAD THE LAWSUIT WILL BE BIG. ISN'T THERE SOME TIMEFRAME THAT BMW HAS TO COMPLY IN.?? I WAS INFORMED TODAY BY BMW THAT THEY DO NOT HAVE ANY TIMEFRAME \"MAYBE\" BY END OF MONTH, HAHA BEEN HEARING THAT SINCE MARCH \"MAYBE\" \"MAYBE\" \"MAYBE\".",
        "vin": "5UXZW0C5XBL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893064,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AIRBAG RECALL IN FEBRUARY AND WE STILL HAVE NOT RECEIVED THE PART. 6 MONTHS IS UNACCEPTABLE WHEN IT COMES TO THE SAFETY OF MYSELF AND MY FAMILY.",
        "vin": "5UXZV4C50BL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/26/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888691,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 84,500 MILES, DURING FRONT DRIVESHAFT RECALL SERVICE, THE VEHICLE WAS DIAGNOSED WITH A FAILED TRANSFER CASE. SYMPTOMS INCLUDE VIBRATION DURING ACCELERATION, AND TURNING.",
        "vin": "5UXZV4C55BL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854756,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED A HIGH PRESSURE FUEL PUMP FAILURE. UPON MERGING ON TO A HIGHWAY THE FOLLOWING SYMPTOMS OCCURRED: BACKFIRING, LOSS OF POWER, MISFIRES, AND REDUCED ENGINE PERFORMANCE. THE VEHICLE WAS UNABLE TO MAINTAIN NOMINAL FUEL PRESSURE IN THE FUEL RAIL. THE HIGH PRESSURE FUEL PUMP WAS REPLACED AS PER BMW SERVICE DOCUMENTATION WHICH REQUIRED THE REPLACEMENT OF THE THROTTLE BODY GASKET, AND 2 ALUMINUM BOLTS SECURING WIRING HARNESS TO THE ENGINE BLOCK. THERE WERE NUMEROUS FAULT CODES PRESENT. ALL WERE CONSEQUENTIAL EXCEPT FOR \"002C01 HIGH PRESSURE FUEL, PLAUSIBILITY PRESSURE TOO LOW\".",
        "vin": "5UXZV4C55BL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2016",
        "dateOfIncident": "03/13/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849680,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 70MPH EB ON INTERSTATE 10, BILOXI, MS AREA, A SUDDEN RUMBLING SOUND WAS HEARD COMING FROM BENEATH THE VEHICLE FOLLOWED BY A LOUD POP AND SEVERE BANGING AND VIBRATION. THE VEHICLE IMMEDIATELY LOSS POWER AND I WAS FORCED TO MANEUVER THROUGH MODERATE HIGH SPEED TRAFFIC IN DANGEROUS CONDITIONS TO THE SIDE OF THE INTERSTATE. ONCE COMING TO A STOP, FURTHER MOVEMENT WAS NOT POSSIBLE. THE VEHICLE WAS TOWED APPROXIMATELY 50 MILES TO NEAREST BMW DEALERSHIP IN MOBILE, ALABAMA WHERE THE ISSUE WAS DIAGNOSED AS A SNAPPED DRIVESHAFT. BMW WAS AWARE OF THE POTENTIALLY DEADLY DRIVESHAFT ISSUE AS I HAD RECEIVED A LETTER EXTENDING THE DRIVESHAFT WARRANTY 5 MONTHS PRIOR. THEY CHOSE NOT TO ISSUE A RECALL BUT INSTEAD ONLY ISSUED A LIMITED EXTENDED WARRANTY ON THE DRIVESHAFT. EXPERIENCING THIS FAILURE AT HIGHWAY SPEEDS HAS SHOWN ME THAT THIS FAILURE HAD FATAL POTENTIAL. MY VEHICLE HAD BEEN CHECKED AND PRONOUNCED FIT BY A LOCAL BMW DEALERSHIP 6 DAYS PRIOR TO THIS INCIDENT......UPDATED 06/23/16 * BF    *CN",
        "vin": "5UXZV4C5XBL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "12/25/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820472,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH PRESSURE FUEL PUMP ALONG WITH HIGH PRESSURE FUEL PUMP SENSOR AND INJECTOR HAS FAILED, CAUSING THE ENGINE TO REDUCE POWER AND MAKING IT AN UNSAFE CONDITION TO DRIVE AT HIGHWAY SPEED.",
        "vin": "5UXZV4C52BL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790747,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 5 YEARS SINCE I BOUGHT THIS VEHICLE NEW, I HAVE HAD TO REPLACE THE AIR CONDITIONER EVAPORATOR 4 TIMES. THE FIRST THREE TIMES WERE COVERED UNDER WARRANTY, AND THE LAST ONE I HAD TO PAY FOR OUT-OF-POCKET.",
        "vin": "5UXZV4C55BL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2015",
        "dateOfIncident": "05/09/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716078,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  VEHICLES  PURCHASED LAST YEAR FROM BMW LOCAL DEALER {JACKIE  COOPER IMPORTS] IS EQUIPPED WITH 8- OR 12-CYLINDER, TURBOCHARGED ENGINES .THE CIRCUIT BOARD FOR THE ELECTRIC AUXILIARY WATER PUMP OVERHEATED. THIS  LEAD TO A SMOLDERING OF THE PUMP AND AN ENGINE COMPARTMENT .   BMW WAS SUPPOSED TO NOTIFY OWNERS, REPLACE THE AUXILIARY WATER PUMP, THERMOSTAT, AND COOLANT  RESERVOIR FREE OF CHARGE. THE TWO SAFETY RECALLS RELATED TO THIS PROBLEM APPARENTLY DID NOT INCLUDE MY VEHICLE. REF  NHTSA COMPAIGN RECALL #11V521000 AND NHTSA COMPAIGN RECALL # 12V161000. I HAVE LOGGED A COMPLAINT ABOUT THIS WITH THE DEALERSHIP, AND THEIR RECALL RESOLUTION DEPARTMENT IN VAIN. I AM BEING CHARGED FOR PARTS AND LABOR WHICH I BELIEF SHOULD BE FREE A SNOTED BY THE TWO RECALLS .",
        "vin": "5UXZV4C58BL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638026,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT SPECIFICALLY ADDRESSES THE RECALL LISTED BELOW. EVEN THOUGH THIS RECALL WAS ISSUED IN APRIL, NO RESOLUTION HAS BEEN AVAILABLE. THE VERY THING THE RECALL WAS TRYING TO PREVENT, HAPPENED TO ME AND MY FAMILY.  REPORT RECEIPT DATE: APR 10, 2014   NHTSA CAMPAIGN NUMBER: 14V176000    I WAS STRANDED FRIDAY, 09/19/14, ALONG WITH MY WIFE AND DOG BY MY NEW TO ME X5. YES, IT WAS THE VANOS RECALL BOLTS THAT FAILED. THE CAR ONLY MADE IT A FEW HUNDRED YARDS AFTER THE CEL AND ENGINE MALFUNCTION LIGHTS CAME ON. THE CAR SHOOK, SPUTTERED, AND DIED AND WOULD NOT RESTART. WE WERE LEFT IN A DANGEROUS SITUATION. ADDITIONALLY, SINCE THE CAR WOULD NOT START, WE COULD NOT GET IT INTO NEUTRAL. IT ENDED UP TAKING US MORE THAN 5 HOURS TO GET A TOW TRUCK THAT HAD THE EQUIPMENT THAT WOULD HELP US. NO TOW TRUCK OPERATOR KNOWS HOW OR IS WILLING TO CRAWL UNDER AND REMOVE THE TRANSMISSION COVER AND UNLOCK THE GEARS. THE LACK OF ABILITY TO GO THIS ELECTRONIC TRANSMISSION INTO NEUTRAL IS REALLY UNBELIEVABLE. I CANNOT IMAGINE A MUCH MORE UNSAFE SCENARIO.    I CHECKED ON THE VANOS BOLTS RECALL TWICE IN THE LAST MONTH AND WAS TOLD NO PARTS WERE AVAILABLE. THIS RECALL SHOULD HAVE BEEN HANDLED IN A TIMELY MANNER AND NOT LEFT UNTIL THE CAR FAILS AND PLACES IT'S OWNERS IN A VERY DANGEROUS SITUATION. I'M WAITING TO HEAR BACK FROM BMW OF NASHVILLE ABOUT HOW EXTENSIVE THE DAMAGE IS TO INTERNALS, BUT THEY ALREADY CALLED AND SAID IT IS SHEARED / BROKEN VANOS BOLTS. SPECIFICALLY THE RECALL ISSUE.    P.S.  THIS HAPPENED ON FRIDAY. I TRIED TO GET A LOANER CAR, FRIDAY, SATURDAY, AND TODAY AND AM TOLD NONE ARE AVAILABLE. WE NEVER RAN INTO THAT SITUATION WITH OUR LAST 2 VEHICLES, WHICH WERE BOTH INFINITI'S. IT'S RIDICULOUS THAT I AM STRANDED AND CAN'T EVEN GET TO WORK DUE TO A RECALL FOR A CAR THAT ONLY HAS 47K MILES.  *TR",
        "vin": "5UXZV4C56BL"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2013",
        "dateOfIncident": "12/26/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505048,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 26, 2012, WHILE DRIVING NORTH AT A HIGH SPEED IN HEAVY TRAFFIC IN THE SECOND LANE ON A FOUR LANE SEGMENT OF HIGHWAY 11 KENOELEHUA HIGHWAY AT ITS MERGING JUNCTION WITH THE HIGHWAY 130 KEAAU BYPASS ROAD, AN ENGINE PARTIAL MALFUNCTION OCCURRED CAUSING DECELERATION AND A COMPLETE ENGINE SHUT DOWN ON THE ROAD SHOULDER.    ON JANUARY 4, 2013, AFTER RETRIEVING THE VEHICLE FROM REPLACEMENT OF THE LOW PRESSURE FUEL PUMP PURSUANT TO THE DECEMBER 26, 2012 MALFUNCTION, WHILE DRIVING NORTH AT A HIGH SPEED IN HEAVY TRAFFIC ON HIGHWAY 19 QUEEN KAAHUMANU HIGHWAY AFTER RECOVERING THE VEHICLE FROM THE BMW OF HAWAII REPAIR SHOP, AN ENGINE PARTIAL MALFUNCTION OCCURRED CAUSING A DECELERATION AND A COMPLETE ENGINE SHUT DOWN ON THE ROAD SHOULDER.  *TR",
        "vin": "5UXZV4C54BL"
    }
]