[
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/07/2021",
        "dateOfIncident": "11/04/2021",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439625,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Internal vehicle fire started around front passenger seat and burned for an unknown amount time before it extinguished on its own while vehicle was off and parked. Fire department was contacted upon fire discovery and they confirmed it was out, could be electrically related, and disconnected my battery Vehicle is available for inspection for the time being (pending insurance). If I or any passenger was in the vehicle they could've been seriously injured or died. There were no warning lamps or issues of any prior problem.",
        "vin": "2HNYD2H20DH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424043,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2013 Acura MDX with an estimated 87k miles. Over the past 3 months, the engine will cut off while I'm driving and the steering wheel and brakes lock up. This has happened about 5 times in a three-month period. There are no warning lamps on my dashboard and no codes appeared during the diagnostic tests. My mechanic is unable to reproduce the issue. I have two young sons and am terrified of driving them in the MDX. The engine failure happens very randomly as it's cut off while driving at varying speeds.",
        "vin": "2HNYD2H34DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405269,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY HAS HAD TO BE REPLACE THREE TIMES DURING OWNERSHIP OF CAR. ALSO CURRENTLY EXPERIENCING FOR THE THIRD TIME SINCE PURCHASE IN FALL OF 2013, TOTAL ELECTRICAL FAILURE. LIGHTS TURN ON AND OFF W/O PROMPTING, CAR DOESN'T TURN OVER WITH PROPER KEY USAGE. DASHBOARD LIGHTS WARNING FLASH, CHECK ENGINE, TPMS. MAJORITY OF ERROR CODES ARE LOSS OF COMMUNICATION BETWEEN ALL MODULES. ELECTRIC WINDOWS AND ELECTRIC SEAT ADJUSTMENT NON-RESPONSIVE.THIS HAPPENS WHILE THE CAR IS PARKED AND IN THE \"P\" POSITION AND REMAINS STATIONARY.",
        "vin": "2HNYD2H22DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PER THE MECHANIC MANY ACURA'S HAVING ISSUES WITH HANDSFREELINK BLUETOOTH WHICH DOESN'T TURN OFF RESULTING DRAINING BATTERY. WE JUST REPLACED OUR BATTERY AND ISSUE STILL PERSISTS. I CALLED ACURA AND THEY SAID THEY ARE AWARE OF THE ISSUE BUT CAN NOT DO ANYTHING SINCE OUR VIN IS NOT PART OF THE RECALL. THIS CAN BE A BIG SAFETY ISSUE SINCE PEOPLE HAVE EXPERIENCED CARS STOPPED MID ROAD DUE TO NO POWER. PLEASE HELP SINCE ACURA IS IGNORING SAFETY OF THEIR CONSUMERS! REFERENCE LINK FOR THE ISSUE WHICH HAS BEEN REPORTED BY MANY PEOPLE.     HTTP://WWW.ACURAPROBLEMS.COM/HANDSFREELINK-BATTERY-DRAW/  HTTPS://TOPCLASSACTIONS.COM/LAWSUIT-SETTLEMENTS/LAWSUIT-NEWS/840256-ACURA-HANDSFREELINK-DEFECT-CLASS-ACTION-LAWSUIT-GETS-TRIMMED/  HTTPS://TERRELLMARSHALL.COM/CLASS-ACTIONS/HONDA-ACURA-CLASS-ACTION/",
        "vin": "2HNYD2H25DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364818,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH JUDDER FROM THE TORQUE CONVERTER LOCK-UP CLUTCH/UPDATE THE PGM-FI ORA/T SOFTWARE AND FLUSH THE ATF. ACURA SENT SERVICE BULLETIN 16-062 ON 09/28/2018 JUST FOR 8 YEARS/80,000 MILES I HAVE A 2103 ACURA MDX WITH 103,102 MILES WITH THE SAME BULLETIN ISSUE, THEY WANT ME TO PAY CLOSE TO $500.00 FOR AN ISSUE THAT THEY READY KNOW WITH OUT DOING A DIAGNOSTIC ON MY VEHICLE.",
        "vin": "2HNYD2H33DH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291712,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTIFICATION OF EXCESSIVE OIL CONSUMPTION AFFECTING MY VEHICLE FROM ACURA (2013 MDX) I TOOK THE CAR AS INSTRUCTED TO BRIDGEWATER ACURA AND THEY PERFORMED AN OIL CONSUMPTION TEST. ACCORDING TO THE MANUFACTURER THE CAR HAD TO CONSUME AT LEAST 1 QUART OF OIL PER 1,000 MILES. THE DEALER STATED THAT MY CAR SHOWED THAT MY CAR CONSUMED 1 QUART AT THE FIRST 1,000 MILES, AND 1/2 QUART EACH TIME AT THE FOLLOWING 3 -1,000 MILE MARK. SO ACURA WOULD NOT PAY FOR THE REPAIR NECESSARY TO CORRECT THE PROBLEM. AFTER THIS I HAD AN NEW OIL CHANGE DONE AND AFTER TRAVELING 4,260 MILES AND  BEFORE I WAS DUE FOR ANOTHER OIL CHANGE THE LOW LEVEL INDICATOR CAME ON. SURE ENOUGH THE SERVICE DEPARTMENT OF DCH HONDA IN OLD BRIDGE, NJ VERIFIED THAT MY CAR WAS OUT OF OIL. THE DIPSTICK WAS NOT REGISTERING ANY OIL ON IT. I HAD AT THAT TIME AN OIL CHANGE DONE TO SAVE MY ENGINE EVEN IF ACCORDING TO MANUFACTURER'S RECOMMENDATION AND CAR COMPUTER I WAS NOT DUE FOR ONE FOR ANOTHER 3,000 MILES. MY CAR IS OBVIOUSLY BURNING MORE OIL THAN EXPECTED AT 77,000 MILES ON THE ENGINE. I AM NOT AN AGGRESSIVE DRIVER AND DON'T IDLE THE CAR. I SUSPECT THE TEST WAS NOT DOCUMENTED CORRECTLY SINCE I AM CONSUMING CLOSE TO 5 QUARTS OF OIL PER 4,260 TRAVELED MILES. I WOULD LIKE TO HAVE A NEW TEST DONE AND PROPERLY WITNESSED BY ME THIS TIME.",
        "vin": "2HNYD2H30DH"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132688,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA HAS EXTREMELY POOR PERFORMANCE IN LOW LIGHT OR NIGHT TIME SETTINGS IF THERE IS NO OTHER AMBIENT LIGHT LIKE STREET LIGHTS. REVERSE LIGHTS ARE NOT SUFFICIENT TO BE ABLE TO SEE OBSTACLES OR DANGERS IN THE BACKUP MONITOR. BODY PANELS PRODUCE A BLIND SPOT REQUIRING THE BACKUP CAMERA TO SEE BEHIND YOU. THE BACKUP CAMERA HAS SHIFTED ANGLE SLIGHTLY CAUSING THE MARKINGS INTENDED TO ALLOW BACKUP INTO PARKING SPACES TO BE OFF CENTER AND GUIDE THE VEHICLE TO AN INAPPROPRIATE PARKING ANGLE. THIS LOW LIGHT PERFORMANCE ISSUE HAS BEEN KNOWN TO OWNERS FOR SOME TIME, IN LIGHT OF ACURA'S NEW RECALL RELATED TO BACKUP CAMERAS THIS WARRANTS INVESTIGATION AS WELL.",
        "vin": "2HNYD2H37DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "03/25/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PULLED THE CAR INTO THE PARKING LOT SLOWLY AND WAS ABOUT TO PUT IT IN PARK  I REALISED THE CAR SUDDENLY ACCELERATED AND  JERKED UP ON THE CURB/WALKWAY. AS THERE WAS NO PLACE FOR ME TO MANOUVER I TRIED TO TURN IT TO THE LEFT AND HIT A WALL TO STOP THE CAR. DURING THIS WHOLE  PROCESS THE ENGINE NEVER STOPPED.",
        "vin": "2HNYD3H3XDH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883911,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2013 ACURA MDX FROM HONDA OF BOWIE ON JULY 1, 2O16.  THAT SAME DAY I HAD TO BRING IT BACK BECAUSE THE AIR CONDITIONER DID NOT WORK.  ON FRIDAY, JULY 9 I HAD TO BRING IT BACK BECAUSE THE NAVIGATION DOES NOT WORK, THERE IS A GRINDING NOISE UNDER THE CAR AND THE STEERING WHEEL SHAKES WHEN DRIVING AT A HIGH SPEED.  I BELIEVE THIS CAR HAS SEVERAL ISSUES AND SHOULD NOT HAVE BEEN SOLD TO ME.  THE CAR HAD JUST COME IN (AS I WAS TOLD)AN D IT HAD NOT GONE THROUGH THE PROCESS REQUIRERD FOR USED CARS BEFORE BEING SOLD.  I INITIALLY WENT THERE TO TRADE MY KIA AND BUY A USED CAR.  I WAS TOLD I HAD TO BUY A  NEW CAR BECAUSE OF THE NEGATIVE EQUITY.  SO I DID NOT TRADE MY KIA AND BOUGHT A USED ACURA FOR 40,000.  THIS CAR HAS MANY ISSUE WITH IT,",
        "vin": "2HNYD2H32DH"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882413,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER PROBLEM...... I BOUGHT A USED 2012 MDX WITH 4300 MILES 5 MONTHS LATER I HAD THIS ISSUE. I TOOK THE CAR TO A ACURA DEALER AND THEY FIXED IT BUT I DID FEEL SAFE SO I TRADED IT IN FOR A NEWER MODEL THINKING IT WOULD BE BETTER...LONG BEHOLD THE 2013 MDX I GOT DID THE SAME THING 5 MONTH LATER. THE DEALER NEVER TOLD ME AFTER BRING THE FIRST CAR BACK THAT THIS WAS AN ISSUE WITH THESE CARS. AND SOLD ME A SECOND ONE , WHICH BY THE WAY I LOSS $8000 ON THE FIRST CAR FOR TRADING IT IN SO SOON.I ONLY TRADED IT IN BECAUSE I DID FEEL SAFE AND I TOLD THEM THAT..LUCKY I  BOUGHT WARRANTY BECAUSE THE 2013 MDX HAD 6700 MILE AND WARRANTY WAS UP......",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836993,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS A AT A USED CAR FROM ACURA OF LOS GATOS AN PICKED THE CAR UP LATE ON JAN 27TH 2016. AT NOON ON FEB 5TH (JUST ABOUT  7 DAYS) THE CAR SUDDENLY STOP WHEN TRYING TO PULL UP TO THE DRIVE WAY OF MY FRIEND HOUSE. THE ENTIRE CAR IS IN THE MIDDLE OF A SMALL STREET, BLOCKING CARS FROM MOVING. CAR CAN'T GET STARTED EVEN WITH JUMPER FROM A TOWING COMPANY. THE CAR WAS TOWED BACK TO LOS GATOS ACURA AND FEW HOURS LATER WE WERE TOLD THE THE ENTIRE ENGINE IS GONE. WE PURCHASE THIS USED CAR BECAUSE IT'S SUCH A NEW CAR JUST ABOUT 2 YEARS OLD AND DRIVEN JUST ABOVE 25,000 MILES AND SUPPOSED TO RUN THROUGH ALMOST 200 POINTS CHECK FROM LOS GATOS ACURA, BUT IT FAILED IN OUR FACE AND WE ARE FEAR FOR OUR LIVES DUE TO THE REASON THAT WE ARE LUCKY ENOUGH THAT THE CAR BROKE DOWN IN A MIDDLE OF THE ROAD IN A LIGHT TRAFFIC AREA. IF THE ENGINE DID BREAK DOWN IN THE MIDDLE OF FAST AND HIGH TRAFFIC FREEWAY, OUR LIVES COULD BE IN SERIOUS DANGER.",
        "vin": "2HNYD2H37DH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "01/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING PROBLEMS WITH DELAYED ACCELERATION MAINLY WHEN I ACCELERATE INTO TRAFFIC. WHILE DRIVING MAINLY ON THE HIGHWAY MY CAR WILL RANDOMLY AND RHYTHMICALLY START ACCELERATING AND DECELERATING BETWEEN 1500-2000RPMS",
        "vin": "2HNYD2H28DH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/03/2015",
        "dateOfIncident": "06/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731925,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY FLASHERS WERE STUCK IN THE ON POSITION.   WE HAD PULLED OVER BRIEFLY ON THE FREEWAY AND TURNED ON THE HAZARD FLASHERS. SHORTLY THEREAFTER WE WANTED TO RESUME DRIVING BUT THE FLASHERS WOULD NOT TURN OFF FOR A COUPLE MINUTES, SO WE DID NOT WANT TO DRIVE. THE SWITCH DID NOT RESPOND, DURING A COUPLE MINUTES OF PRESSING THE SWITCH.  UNKNOWN WHY THE SWITCH BECAME STUCK OR HOW IT BECAME UNSTUCK.",
        "vin": "2HNYD2H39DH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/11/2015",
        "dateOfIncident": "02/25/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693695,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 ACURA MDX. WHILE DRIVING AT VARIOUS SPEEDS, THE STEERING WHEEL MOVED UPWARDS INDEPENDENTLY. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 68,200.",
        "vin": "2HNYD2H2XDH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "01/30/2015",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680786,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2012 ACURA MDX. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, SMOKE STARTED TO EMIT FROM UNDER THE HOOD OF THE VEHICLE AND INTO THE VEHICLE. THE CONTACT MERGED TO THE SIDE OF THE ROAD WHERE THE VEHICLE CAUGHT FIRE. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FLAMES. A FIRE REPORT WAS FILED AND STATED THAT THE FAILURE WAS DUE TO AN ELECTRICAL PROBLEM. NO INJURIES WERE REPORTED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 36,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640928,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE VEERED TO THE LEFT WHILE DRIVING VARIOUS SPEEDS. THE DEALER STATED THAT THE TORQUE CONTROL NEEDED TO BE REBOOTED. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 4,800.  UPDATED 12/01/14*LJ  THE CONSUMER STAED A NON-ACURA DEALER IDENTIFED THE STEERING WHEEL ASSEMBLY AS DEFECTIVE. UPDATED 01/20/15",
        "vin": "5FRYD4H89EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "08/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627877,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING APPROXIMATELY 20 MPH WHEN THE ENGINE COMPLETELY SHUT DOWN WITHOUT WARNING.  THE CAR WAS STILL IN DRIVE, THE IGNITION ON, WHEN IT SUDDENLY SHUT DOWN AND DECELERATED.  I MANAGED TO MAKE A RIGHT TURN ONTO MY STREET, ALTHOUGH THE POWER STEERING WAS NOT FUNCTIONING.  I PUT THE CAR IN PARK AND RESTARTED IT WITH NO PROBLEM.  I DID HAVE A SMALL WALLET (DIMENSIONS WERE @ 4IN BY 5IN, WEIGHT  @ 3 OZ) ATTACHED TO THE KEY WHILE IT WAS IN THE IGNITION.  I CONTACTED THE ACURA DEALERSHIP THE SAME DAY AND WAS TOLD BY THE TECHNICIAN THAT HE WAS UNAWARE OF ANY PROBLEMS WITH OR RECALL ON THE IGNITION.   *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/07/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604829,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 4 YEAR OLD WAS IN A BOOSTER SEAT IN THE BACK SO SEAT BELT WAS ON HIM.  WHEN WE WENT TO UNBUCKLE THE SEATBELT IT LOCKED.  WE ATTEMPTED SEVERAL TIMES TO UNLOCK IT, WE TESTED ALL THE OTHER SEATBELTS WHICH DID LOCK AND UNLOCK.  WE COULD NOT GET IT UNLOCKED AND HAD TO GO INTO A LOCAL RESTAURANT AND BORROW SCISSORS TO GET HIM OUT.  WE TRIED FOR 15 MINS AT LEAST TO GET THE SEAT BELT UNLOCKED AND EVERY TIME IT SEEMED TO GET TIGHTER.  MY 4 YEAR OLD HAD NIGHTMARES THAT EVENING ABOUT THE SEAT BELTS AND RED MARKS ON HIS SHOULDER.  IT IS SCARY TO THINK WE MAY NOT HAVE BEEN ABLE TO GET HIM OUT IN AN EMERGENCY.  *TR",
        "vin": "2HNYD2H31DH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2014",
        "dateOfIncident": "11/05/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560389,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A 2013 ACURA MDX VEHICLE (ADVANCE MODEL) WAS BOUGHT IN THE ACURA DEALER ON JULY 27, 2013.  STARTING ON OCTOBER 2013, STRONG SMELL OF FUMES HAS SPORADICALLY BEEN SENSED INSIDE THE VEHICLE, MAKING IT UNCOMFORTABLE TO BREATHE.  SINCE NOVEMBER 5, 2013, THE VEHICLE HAS BEEN IN AND OUT OF THE SHOP (THREE TIMES) TO TARGET THE CAUSE OF THE FUMES.  THE SMELL OF FUMES INSIDE THE CABIN ARE SENSED NOT ONLY WHILE DRIVING AT 10MPH, 40MPH, OR 60MPH BUT ALSO ON SHORT DISTANCE RIDES, DURING RAINY DAYS AND WHILE WAITING FOR A LIGHT TO CHANGE (THE SMELL WAS ALSO SENSED OUTSIDE THE VEHICLE WHEN THE WINDOWS WERE DOWN).  ON THE SECOND SERVICE APPOINTMENT, THE SHOP VERIFIED THE A/C SYSTEM AND THE RECIRCULATION CASE OF THE AIR CONDITIONING (A/C) SYSTEM WAS SEALED; BUT IT DID NOT CORRECT WHAT WAS CAUSING THE SPORADIC SMELL OF FUMES.  THE VEHICLE HAS BEEN IN THE SHOP SINCE DECEMBER 23 AND NOT RETURNED SINCE THEY DO NOT FIND WHY THE VEHICLE EMITS SUCH STRONG FUMES THAT SURPASSED THE A/C SYSTEM.  THE VEHICLE HAS HARDLY BEEN USED DUE TO THE SAFETY AND HEALTH CONCERN.  AS OF TODAY, THE PROBLEM WITH THE VEHICLE HAS NOT BEEN DETECTED NOR CORRECTED.  *TR",
        "vin": "2HNYD2H82DH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/30/2013",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532687,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK-UP CAMERA VIDEO / NAVIGATION MODULE, AND STEREO / CLOCK SCREENS REMAINED BLANK AFTER STARTING ENGINE, PLACING CAR IN REVERSE GEAR AND MOVING SLOWLY DOWN DRIVEWAY IN AN APPROXIMATE TIME FRAME OF 3-4 MINUTES. ALL SCREENS CONTINUED TO BE BLANK AFTER EXITING DRIVEWAY, STOPPING, THEN PLACING CAR IN DRIVE AND TRAVELING 5-7 MPH ON STREET. STOPPED VEHICLE AT STOP SIGN AFTER TRAVELING 200 YARDS. RE-ENGAGED REVERSE, THEN DRIVE GEARS WITH FOOT ON BRAKE. BOTH SCREENS FINALLY ACTIVATED, SHOWING CORRECT TIME AND BLUETOOTH CONNECTION STATUS ON STEREO SCREEN, AS WELL AS REAR CAMERA VIDEO PICTURE ON NAV MODULE SCREEN WHILE REVERSE GEAR ENGAGED.    SIMILAR INCIDENTS HAVE OCCURRED ON TWO PRIOR OCCASIONS SINCE PURCHASING THIS USED VEHICLE IN MAY 2012.  *TR",
        "vin": "2HNYD28398H"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/09/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515905,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHOWS ALL TROUBLE CODES, VSA STABILITY, TRAILER STABILITY, ALL WHEEL DRIVE, ENGINE SYSTEM. ERROR. ONCE CODE COMES ON LOSS OF POWER AND STABILITY CONTROL.  *TR",
        "vin": "2HNYD2H36DH"
    }
]