[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING MODULE DIED AT 95K...    FIRST NOTICED AFTER STARTING IT UP AT THE END OF WORK DAY IN THE PARKING GARAGE.  IT WAS DRIVEABLE WITH LOTS OF EXTRA MUSCLE DURING ANY KIND OF TURN.    AFTER DIAGNOSTIC PERFORMED BY DEALER, ISSUE DID NOT OCCUR FOR A 30 MINUTE DRIVE HOME.  THE NEXT MORNING THOUGH...IT WAS OUT AGAIN.",
        "vin": "JH4CW2H59CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174451,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "EPS (ELECTRIC POWER STEERING UNIT) FAILED WHILE DRIVING ON HIGHWAY. AMBIENT TEMP OUTSIDE WAS -11 F. LIGHT TURNED OFF OVERNIGHT. NEXT DAY WAS FINE, -4 F, NO WARNING LIGHT, POWER STEERING ACTIVE. DAY AFTER, AT MORNING STARTUP, 20 F, LIGHT WAS BACK ON. NO POWER STEERING SINCE.",
        "vin": "JH4CW2H6XCC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165408,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND 30 MPH AND THE EPS WARNING LIGHT CAME ON, THEN IMMEDIATELY AFTER THE POWER STEERING WENT OUT. I ALMOST CRASHED AS THE WHEEL WAS EXTREMELY DIFFICULT TO TURN.",
        "vin": "JH4CW2H69CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128834,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS LESS THAN 57K MILES AND FANTASTICALLY MAINTAINED. WHILE DRIVING WITH MY 3.5 YEAR OLD DAUGHTER THIS AFTERNOON, THE POWER STEERING LIGHTS AND MESSAGE CAME UP AND THE STEERING IMMEDIATELY FAILED CAUSING PANIC FOR MY DAUGHTER'S AND MY SAFETY. THE INFOTAINMENT SYSTEM ADVISED OF THE PROBLEM AND SUGGESTED TO TURN VEHICLE OFF THEN BACK ON AND THE PROBLEM PERSISTED FOR THE NEXT 4 MINUTES OF DRIVING THEN A MANDATORY STOP WAS MADE, VEHICLE TURNED OFF AND SAT FOR 20 MINUTES THEN STARTED AGAIN AND PROBLEM WAS NONEXISTENT BUT WHILE DRIVING FOR ANOTHER 4 MINUTES, THE SYSTEM SHUT OFF AGAIN WITHOUT WARNING. LUCKILY I WAS NEAR MY HOME ABLE TO PARK. THIS WAS AN AWFUL FEELING AND I FEARS FOR MY DAUGHTER'S AND MY LIFE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119424,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING APPROXIMATELY 35 MPH ON RESIDENTIAL COLLECTOR ROAD POWER STEERING FAILURE MESSAGE APPEARED AND STEERING WHEEL INSTANTLY BECAME ALMOST IMPOSSIBLE TO TURN. FORTUNATE ABLE TO WRESTLE STEERING AND TURN INTO RESIDENTIAL NEIGHBORHOODCOMING TO A COMPLETE STOP. TURNED CAR OFF TO INVESTIGATE ISSUE. UPON TURNING CAR BACK ON NO FAILURE LIGHT APPEARED AND NOW APPEARS OK TO DRIVE? IT WILL BE TAKEN TO SHOP FOR DIAGNOSTIC TESTING BUT LIKELY THIS IS THE ELECTRIC POWER STEERING UNIT. IF THIS HAPPENED SUDDENLY ON A A HIGHER SPEED TURN OR CURVE DRIFTING INTO ONCOMING TRAFFIC MORE THAN LIKELY. AN INABILITY TO STEER YOUR CAR JUST DRIVING DOWN THE ROAD WITH NO EXTERNAL EVENT IS A MAJOR SAFETY PROBLEM.",
        "vin": "JH4CW2H65CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064150,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES ELECTRONIC POWER STEERING CONTROL UNIT FAILED.  VEHICLE WAS STATIONARY WHEN THIS HAPPENED, BUT BECAME INCREDIBLY DIFFICULT TO STEER.  THIS APPEARS TO BE A COMMON ISSUE ON THESE CARS WITH SIMILAR MILEAGE (73,000).  ACURA WILL NOT HONOR THE PART AND OWNERS HAVE TO PAY OUT OF POCKET FOR A COMMON SAFETY ISSUE.",
        "vin": "JH4CW2H6XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/20/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016381,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LUCKILY I WAS MAKING A VERY SLOW LEFT TURN WHEN MY POWER STEERING COMPLETELY FAILED IN MY ACURA TSX WAGON.  I WOULD PROBABLY NOT BE SITTING HERE WRITING ABOUT THIS EXPERIENCE IF I WAS DRIVING AT A HIGH SPEED.  MY HEART WAS POUNDING OUT OF MY CHEST AS A STRUGGLED TO PULL OVER.  THIS IS SO UNACCEPTABLE AND THESE CARS SHOULD BE RECALLED.",
        "vin": "JH4CW2H63CC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972316,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OUT ON A SHOPPING TRIP I STARTED THE CAR AND THE POWER STEERING WARNING INDICATOR AND ALARM DISPLAYED.  I COULD NOT TURN THE WHEEL OF THE CAR TO EXIT MY PARKING SPACE SO I CALLED A TOW TRUCK.  THE TOW TRUCK OPERATOR WAS ABLE TO MUSCLE THE CAR ONTO THE FLATBED.  MY MECHANIC'S DIAGNOSTIC TEST INDICATED THAT THE ELECTRONIC POWER STEERING MODULE HAD FAILED.  THERE WAS NO INDICATION OF ANY PROBLEM PRIOR TO THIS FAILURE.  THE CAR HAS 59K MILES AND IS WELL MAINTAINED.  THE WEATHER WHEN THIS OCCURRED WAS CLEAR.  I HAVE FILED A COMPLAINT WITH ACURA (CASE #05948611) BECAUSE I SEE THAT THIS UNIT HAS FAILED FOR OTHER OWNERS WHILE THE CAR IS IN MOTION CREATING AN EXTREME SAFETY HAZARD.",
        "vin": "JH4CW2H5XCC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865611,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "2012 ACURA TSX SPORTS WAGON (~31K MILES) - FAILURE OF ELECTRONIC POWER STEERING (EPS).      LAST WEEK I PARKED THE VEHICLE WITH WHEELS TURNED TO THE LEFT AND WHEN I RESTARTED THE CAR AFTER FEW MINUTES, THE POWER STEERING WAS GONE. I TURNED THE CAR OFF, RESTARTED IT AGAIN AND THE POWER STEERING CAME BACK. DID NOT THINK MUCH OF IT.    THE POWER STEERING WENT OUT AGAIN (COMPLETE FAILURE) A COUPLE OF DAYS AGO WHILE DRIVING ON A STREET WITH MY FAMILY.  I FELT THE STEERING WHEEL \"JERK\" TO LEFT AND RIGHT AND THEN A COMPLETE LOSS OF THE POWER STEERING.  LUCKILY, I WAS ABLE TO MAINTAIN THE CAR IN LANE AND PULL IT OVER WITH USING A LOT OF FORCE.  TURNING THE CAR ON AND OFF DID NOT HELP.  THIS IS A GREAT SAFETY CONCERN.  HAD I BEEN DRIVING ON A HIGHWAY OR A CURVY ROAD, COULD HAVE ENDED IN A HORRIBLE ACCIDENT.  WITHOUT THE POWER STEERING IT REQUIRES A LOT OF FORCE TO CONTROL THE CAR.  TOOK THE CAR TO THE DEALER AND WAS TOLD IT IS THE EPS UNIT (~$1,200 PARTS PLUS LABOR) .  I CALLED ACURA'S MAIN OFFICE WITH MY CONCERN. THEY PROMISED TO LOOK INTO THIS AND TALK TO THE DEALER ABOUT DISCOUNTED FIX (MANUFACTURER WARRANTY JUST EXPIRED).    I CHECKED THE INTERNET AND THERE IS OVER A HUNDRED OF SIMILAR EPS COMPLAINTS FOR ACURA AND HONDA.  THERE WAS AN INVESTIGATION OPENED UNDER HONDA, HOWEVER, IT WAS CLOSED WITHOUT A RECALL.  THIS IS A GREAT SAFETY CONCERN AND SHOULD BE A RECALL.",
        "vin": "JH4CW2H67CC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY CAR HOME, NO OTHER TRAFFIC CLOSE BY WHEN I HEARD A LOUD POP, THEN A SECOND POP. BOTH SOUNDED LIKE AN IMPACT FROM SOMETHING, BUT THERE WASN'T ANYTHING AROUND. I FELT COOL AIR ON THE BACK OF MY NECK, OPENED THE SUNROOF SHADE AND SAW THAT MY GLASS WAS SHATTERED. AFTER A FEW MINUTES I COULD HEAR A CRACKLING SOUND THAT PERSISTED UNTIL I WAS HOME. UPON EXAMINATION, THERE WAS NO IMPACT MARKS, THE SUNROOF GLASS WAS SHATTERED, BOWED OUTWARD. WE PLACED PACKING TAPE OVER THE GLASS TO KEEP IT INTACT. I WAS GOING 55 MILES AN HOUR WHEN THIS HAPPENED, THE WEATHER WAS PROBABLY LOW 60'S OUT.  *TR",
        "vin": "JH4CW2H66CC"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/15/2012",
        "dateOfIncident": "03/08/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455306,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING VIBRATES FROM 45 TO 75MPH, DEALER HAS TEST DROVE AND ALSO FELT THE VIBRATION, AND TOLD THAT IS THE TSX WAGON CHARACTISTIC, AND REFUSED TO DO A FURTHER DIAGNOSE. 2 WHEEL ALIGNMENT FOR THE 1ST 2 WEEKS OF OWNERSHIP THEN 2 ROAD FORCE TIRE BALANCED AND STILL DID NOT FIX THE PROBLEM, THIS IS ALL HAPPENED IN 4 WEEKS. THE STEERING VIBRATION COULD CAUSE BY BAD MOTOR MOUNT, TRANSMISSION MOUNT, AXELS, BAD SUSPENSION COMPONENTS, BAD ROTORS. NEW CAR SHOULD NOT HAVE ANY STEERING VIBRATION, SPECIALLY ON HIGHWAY SPEED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2012",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX SPORT WAGON",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM STOP LIGHT AND THE CAR IN FRONT SLOWS DOWN, I LET OFF OF ACCELERATOR, THEN PRESS DOWN ON ACCELERATOR AGAIN WHEN APPROPRIATE, THE CAR STALLS AND THEN LEAPS FORWARD. THIS CAUSES AN IMMEDIATE PROBLEM AND THE BRAKES HAVE TO BE APPLIED OR THE CAR IN FRONT GETS REAR ENDED. THE ACURA DEALER TELLS ME THAT THEY HAVE HAD NUMEROUS COMPLAINTS ABOUT THIS, BUT, THEY CAN'T FIX THE PROBLEM BECAUSE ACURA WON'T FIX IT.  *TR",
        "vin": "JH4CW2H67  "
    }
]