[
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851909,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN GIVING A LOUD NOISE FROM THE REAR OF IT.  WE HAVE HAD THIS NOISE FOR SOME TIME NOW AND AT 90K THE BEARING ARE BAD AND NEEDS TO BE REPLACED.  THIS NOISE AND NOW BEARING(S) COMPONENT IS RESULTING IN WEARING OF TIRES THAT WE ONLY PURCHASED LAST YEAR.  NO ONE IS WARRANTYING THEM SO IT ANOTHER OUT OF POCKET COST.  THE VEHICLE HAS BEEN SERVICED UP TO DATE WITH NO WARNING OF THIS ISSUE.      THIS BECOMES A SAFETY AND FINANCIAL CONCERN IN THAT, ONCE THE BEARING BECOMES TOO HOT THEY CAN FREEZE UP AND MOBILITY IS NO LONGER.  THE IMPORTANT TAKE AWAY IS THAT TOYOTA KNOWS ABOUT THIS AND HAS NOT COMMUNICATED TO THE DEALERSHIPS ABOUT CHANGING THE CHAMBERS WHEN THE BEARINGS ARE REPLACED TO PREVENT AND EVEN STOP THIS TYPE OF FINANCIAL EXPENSE ON NEW WHEELS AND BEARING EACH YEAR.  THIS IS NOT A SOMETHING THAT AS A CUSTOMER WE SHOULD BE PAYING FOR, TOYOTA SHOULD BE FITTING THE BILL FOR THIS ENTIRE REPAIR AND SAFETY OCCURRENCE.",
        "vin": "5TDDK3DC1CS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823675,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING ELECTRIC DOOR DOES NOT CLOSE PROPERLY AFTER CHILDREN ENTER THE VEHICLE. THE DOOR LATCH SAGS SO THAT THE LATCH CAN NOT PULL THE DOOR SHUT PROPERLY. THE HAPPENS WHEN THE VEHICLE IS STATIONARY.",
        "vin": "5TDDK3DC9CS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2016",
        "dateOfIncident": "12/16/2015",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818305,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATION.  THIS IS THE THIRD TIME THIS HAS HAPPEN TO ME IN THE CAR.  ONCE ABOUT SIX MONTHS AFTER I PURCHASED THE CAR.  AUGUST OF 2015 AND DECEMBER OF 2015.  I AM AT A COMPLETE STOP, THE LAST TWO TIMES AT A CORNER WAITING TO MAKE A RIGHT HAND TURN.  FOOT ON THE BRAKE AND THE CAR SUDDENLY ACCELERATES.  MAKING A HORRIBLE REVVING NOISE.  I AM PRESSING MY FOOT ALL THE WAY DOWN ON THE BRAKE AND IT'S STILL MOVING.  THE CAR THEN IS HEADING INTO ONCOMING TRAFFIC, BUT THANK GOODNESS, NO ONE HAS BEEN HURT.  IT THEN JERKS AND STOPS.  FIRST TIME WAS ABOUT 8 AM IN THE MORNING AND THE CAR HAD JUST BEEN STARTED.  THE LAST TWO TIMES IT WAS LATE IN THE AFTERNOON, AUGUST ABOUT 4 PM AND DECEMBER ABOUT 3 PM.  NICE WEATHER AND THE CAR HAD BEEN RUNNING OVER 20 MINUTES AT THAT POINT.  CAR WAS NOT COLD AND IT WAS NICE OUTSIDE.  I DID NOT THINK ABOUT IT THE FIRST TIME IT HAPPEN.  AUGUST I BROUGHT IT INTO THE DEALERSHIP AND THEY SAID IT WAS MY FAULT AND THE CAR SHOWED I HAD MY FOOT ON THE BRAKE AND GAS PEDDLE AT THE SAME TIME.  NO, I DID NOT.  BUT IT HAPPENED AGAIN.  ONE FAMILY MEMBER HAS BEEN IN THE CAR WITH ME ALL THREE TIMES.  IT HAS HAPPEN TO A FRIEND OF MINE AND SHE RECALLED THE SAME EXPERIENCE, BUT HER CAR DID GO OUT FARTHER THEN MINE AND HAD DAMAGE.  I AM NOT WAITING FOR THAT TO HAPPEN TO ME.  IT IS VERY UNCOMFORTABLE TO DRIVE NOT KNOWING IF THIS WILL HAPPEN AGAIN.  I HAVE NO PAPERWORK FROM DEALERSHIP.",
        "vin": "5TDDK3DCOC5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2015",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760147,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE SLIDING DOOR WILL NOT OPEN. THE DOOR YOU CAN HEAR IT ENGAGE THE LOCKING MECHANISM TO UNLOCK THE DOOR AND OPEN IT'LL GET STUCK BEEP TWICE THEN AUTOMATICALLY CLOSE IF YOU TURN THE POWER DOOR OFF THE DOOR WILL NOT OPEN AT ALL",
        "vin": "5TDKK3DC7CS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "06/07/2015",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724017,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOYA SIENNA 2012 WOULD NOT GO INTO GEAR AFTER THE BRAKE ABS WARNING LIGHTS, VSC WARNING LIGHTS APPEARED.  MY VEHICLE IS UNDER WARRANTY WITH FIDELITY INSURANCE THAT I PURCHASED FROM THE DEALERSHIP AND THEY WANT TO CHARGE A DIAGNOSIS FEE.  THE SAD PART IS THE DEALERSHIP OR MECHANICS HAVE SEEN THIS BEFORE AND KNOW EXACTLY WHAT IT IS.  I AM NO MECHANIC, BUT I AM EDUCATED ENOUGH TO KNOW IT ELECTRICAL FAILURE WITH THE ABS SYSTEM, BECAUSE MY BRAKES WERE INSPECTED AND PASSED.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10610858,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWIN BOYS ARE 5 YEARS OLD BOYS SO I BUCKLE THEM BOTH SO WHEN I GOT HOME THEY TAKE BELTS OFF THEY ARE IN BOOSTER SEATS SO THE MIDDLE ROW SEAT BELT GOT WTAP AROUND MY SON STOMACH AND I COULDN'T RELEASE IT AND JUST STARTED TO GET TIGHTER AS HE MOVED AROUND ALMOST TO A POINT HE LOOSING AIR SEAM LIKE I HAD TO CUT THE SEAT BELT I TRY TURNIN CAR ON TO RELEASE IT HAD HIM STAND UP IN SEAT EVEN LEAN IT BACK SO I CAN SLIDE HIM UP I TOOK ALL CLOTHS OFF DIDN'T WORK I JUST CUT IT THIS WAS REALLY SCARY AND BAD CAUSE SHOULD BE A SAFETY REALLY BUTTON HIDDEN THANK GOD I HAD A POCKET KNIFE SO NOW I HAVE NO SEAT BELT AND THIS NOT GOOD..  *TR",
        "vin": "5TDDK3DC6CS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "05/06/2014",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587026,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LONG TERM PROBLEM, FROM DAY OF PURCHASE (26 DEC 2011). WHILE MAKING A RIGHT OR LEFT TURN FROM A STOP, VAN HESITATES FOR 2-6 SECONDS AND THEN SURGES FORWARD TO PICK ONES DESIRED SPEED. NORMALLY WHEN THE VAN IS COLD. THIS HAS HAD A PERIOD WHEN IT DOES NOT EXECUTE THIS PROBLEM, THEN SHOWS UP FOR A PERIOD. SELLING DEALER HAS CHECKED IT 3 TIMES, VAN DOES NOT DUPLICATE SYMPTOMS THEN. PROBLEM HAS BEEN DOCUMENTED AT TOYOTA HEADQUARTERS.  *TR",
        "vin": "5TDKK3DCXCS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "Eldorado National-Kansas",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546141,
        "products": [
            {
                "manufacturer": "Eldorado National-Kansas",
                "productMake": "AMERIVAN",
                "productModel": "TOYOTA SIENNA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED LEFT CAR RUNNING IN DRIVE WAY, SLIGHT INCLINE, GOT OUT TO PUT A GARBAGE BIN INTO THE GARAGE, THEN RETURNED TO VEHICLE, REACHED IN TO TURN IT OFF AND ALL OF A SUDDEN THE VEHICLES DOOR HAD ME TO THE GROUND AND I WAS TRYING TO JUMP IN AND STOP THE VEHICLE FROM ROLLING INTO THE STREET.  *TR",
        "vin": "5TDYK3DC9CS"
    }
]