[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447242,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering Rack Assist has a recall for my car because my steering locked up. Audi replaced the recall part two times. the first didnt work after the second time it works but now they cant reset the check engine lights, TPMS, Steering Fault do not drive it says, ECS Fualt, Stability Fault, Child Safety Lock Fault etc. Dealer told they did everything they could even flew in an Audi Engineer still cant reset anything and that they exceeded the cars value in man hours to figure out what is the issue. Now they tell me the car is drivable but my question is, is it safe for me to accept it like that and risk something happening while driving and the steering locking up or any other problems that may arise but I wouldn\"t know because of the other alarms may override the current alarm that may pop up. My insurance said they wouldnt accept the car back in that condition because its a recall issue related and that Audi needs to address this but in just getting the run around. My car has been at the dealer for about 6 months trying to figure it out. Now they tell me \"You brought your car because steering was locked up wasnt able to drive and now the car is drivable and the only thing we cant clear are the alarms that i mentioned above but it is drivable its just like an oil change alarm that you do the oil change but we just cant reset it so its kinda the same thing\" they told me that and i was like okay. No is not the same i said, my question is is this even safe to accept and risk something happen and get into an accident because of the steering lock up. Now they wont even take my wife audi because has the same recall that needs to be replaced. the only way they replace it is till it happens. So they waiting for my wifes car to lock up while driving and not have control of car and crash especially if my kids are with her because she takes them to school. What do i do please help? I also requested the total estimate to see how much I owe and they will not send it to me.",
        "vin": "WAUHGAFC3DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434309,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I start getting coolant leak and it was at Audi dealership. Nothing was done just today get biger leak and took to shop and they say my water pump is broken. I think this is part of Audi A6 2013 water oump problems. Need to fix it",
        "vin": "WAUDFAFC4DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390122,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER HEATING CAUSED BY THERMOSTAT STICKING. THIS PROBLEM WAS COMMON ON THE 2.0 AUDI A6 WHICH WAS RECALL. THE CAR OVERHEATS EVERY TIME I DRIVE. ALSO, I HAD A SPARK PLUG END IP IN THE CYLINDER CAUSING DAMAGE TO THE INNER WALL OF THE ENGINE.",
        "vin": "WAUHGAFCXDN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375555,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS LEAKING & BURNING OIL AND IS HAVING ELECTRICAL PROBLEMS OPEN SHORT TO GROUND I ONLY HAD THE CAR 2 MONTHS THE FUEL SYSTEM IS MALFUNCTIONING MY ENGINE LIGHT & MY EPIC LIGHT IS ON SMOKE IS COMING COMING FROM THE ENGINE & THE ENGINE IS SHAKING ROUGHLY & THESE ARE SOME OF THE RECALLS BUT THERE SAYING THE RECALLS HAVE ALREADY BEEN TAKING CAR OF BUT SEEMS LIKE THE PROBLEM IS REOCCURRING. I WAS IDLED IN A PARKING LOT WHEN THIS PROBLEM STARTED. I FEEL LIKE THIS IS A SAFETY ISSUE AND MY CAR COULD POSSIBLY CATCH FIRE.",
        "vin": "WAUHGAFCXDN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375329,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS STATIONARY AND OIL IS LEAKING FROM THE ENGINE MY FUEL SYSTEM IS MESSING UP. ALSO I'M HAVING ELECTRICAL PROBLEMS CYLINDER 1 MISFIRE OPEN GROUND OR SHORT TO GROUND CIRCUIT .",
        "vin": "WAUHGAFCXDN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360807,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 AUDI A6 AROUND 77K MILES.   I GOT THE CEL AND BROUGHT IT TO THE DEALER. THERE IS AN INTERNAL TRANSMISSION COOLANT VALUE THAT IS PART OF THE COOLING SYSTEM AND OBVIOUSLY, THAT COMPONENT ALSO HELPS KEEP THE TRANSMISSION TEMPERATURE IN CHECK. THE ISSUE WITH THIS DEFECTIVE PART IS THE VALVE MALFUNCTIONS CAUSING COOLANT TO PENETRATE THE TRANSMISSION CONTROL MODULE AND FROM THERE INTO THE WIRING HARNESS. WHEN THIS HAPPENS, IT IS A CATASTROPHIC MALFUNCTION OF THOSE COMPONENTS AND A POTENTIAL FIRE HAZARD. WATER AND ELECTRICAL DO NOT MIX WELL.",
        "vin": "WAUHGAFCXDN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE PASSENGER SIDE AIR BAG WARNING LIGHT WOULD REMAIN ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (AUDI STRATHAM LOCATED AT  58 PORTSMOUTH AVE, STRATHAM, NH 03885) WHO DIAGNOSED THAT THE PASSENGER OCCUPANT DETECTION SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT INDICATED THAT THE VEHICLE WAS PREVIOUSLY SERVICED UNDER THE NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAG) FOR THE SAME FAILURE BUT THE FAILURE HAD REOCCURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 73,000.",
        "vin": "WAUGGAFCXDN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322317,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/6/2020, AUDI NORWELL, MA DIAGNOSED MY 2013 AUDI A6 WITH A PASSENGER OCCUPANT DETECTION SYSTEM (PODS) MALFUNCTION AND ALERTED OF A PODS SYSTEM PROBLEM BY ILLUMINATION OF THE AIRBAG MONITORING LIGHT AND BY THE STATUS OF THE PASSENGER AIRBAG OFF INDICATOR LIGHT.  I WAS QUOTED $1,389.81 TO REPLACE/REPAIR, BUT ASKED IF THERE IS A RECALL ON THIS 'AIRBAG' RELATED ISSUE, SINCE IT HAS BEEN WELL PUBLICIZED ON THESE AUDI MODELS. UPON LOOKING UP MY VIN# IN THE RECALL DATABASE, WE DISCOVERED THE VIN# FOR THIS VEHICLE WAS NOT LISTED AS AN IMPACTED VEHICLE.  HOWEVER, IT IS A 100% MATCH TO SAFTEY RECALL CODES: 74D5 OR 74D1 (SEE BELOW).  I FILED A RECALL CASE WITH AUDI MANUFACTURING ON 4/21/2020, BUT THEY RESPONDED BACK ON 4/24/2020 THAT THERE WAS NOTHING THEY COULD DO IF THE VIN# IS NOT ON THE LIST.  THUS FILING MY COMPLAINT WITH NHTSA.      RECALL CODE: 74D5  SUBJECT: PASSENGER OCCUPANT DETECTION SYSTEM (PODS)   AFFECTED VEHICLES: 2013 A6  DESCRIPTION: THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS) CAN MALFUNCTION DUE TO STRESS/WEAR FACTORS AFFECTING AN INTERNAL CONNECTOR OR CONTACT RESISTANCE INCREASE AT BODY-SENSING MAT IN THE SEAT. IN THIS SITUATION, A FRONT PASSENGER SEAT OCCUPANT RISKS INJURY IN A CRASH BECAUSE A MALFUNCTIONING PODS MAY NOT MAKE THE CORRECT AIRBAG DEPLOYMENT DECISION FOR THE TYPE OF OCCUPANT SEATED THERE.    RECALL CODE: 74D1  SUBJECT: PASSENGER OCCUPANT DETECTION SYSTEM (PODS)   AFFECTED VEHICLES: 2013 AUDI A6  DESCRIPTION: IN AFFECTED VEHICLES WITH CLIMATE CONTROL SEATS (HEATED/COOLED), THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS) CONTROL MODULE CAN MALFUNCTION DUE TO STRESS/WEAR FACTORS AFFECTING AN INTERNAL CONNECTOR AND/OR A BODY-SENSING MAT IN THE SEAT. SHOULD A MALFUNCTION OCCUR, VEHICLE OCCUPANTS WILL BE ALERTED OF A PODS SYSTEM PROBLEM BY ILLUMINATION OF THE AIRBAG MONITORING LIGHT AND BY THE STATUS OF THE PASSENGER AIRBAG OFF INDICATOR LIGHT.",
        "vin": "WAUHGAFC4DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG GASOLINE ODOR INSIDE THE CAR WHILE BEING DRIVEN AND WHILE PARKED INSIDE MY GARAGE RESULTING FROM FUEL PUMP LEAK. ODOR IS WORSE WHEN FUEL TANK IS FULL.",
        "vin": "WAUGFAFCXDN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2019",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280529,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUES WITH ELECTRICAL CABLES MORE THAN ONCE, ALSO FUEL EXHAUST ISSUE AND COOLING SYSTEM. VEHICLE STATIONARY AND OR DRIVING UNDER 50 MILES.",
        "vin": "WAUGGAFCXDN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189613,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 AUDI A6. CONSUMER WRITES IN REGARDS TO POWER STEERING FAILURE. *LD  *TR",
        "vin": "WAUHGAFC5DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170758,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LATE DECEMBER 2017 OUT OF NOWHERE, MY CAR BEGAN TO DISPLAY THE WARNING, 'TURN OFF ENGINE AND CHECK COOLANT LEVEL' (PHOTO ATTACHED) ;  THIS WAS VERY ALARMING AS I TAKE VERY GOOD CARE OF MY CAR AND HAVE HAD ALL OF THE REQUIRED MAINTENANCE DONE AT THE DEALERSHIP.  I IMMEDIATELY CALLED AND HAD AN APPOINTMENT SCHEDULED AT THE DEALER.  JUST A FEW DAYS LATER ON JANUARY 5, 2018 I TOOK MY CAR IN FOR SERVICE AND WAS TOLD THAT THE WATER/COOLANT PUMP NEEDED TO BE REPLACED (ATTACHED).  UNFORTUNATELY, I FELT THAT THE COST WAS TOO MUCH AT THE DEALER AND I TOOK MY CAR TO A REPUTABLE MECHANIC IN THE AREA WHO REPLACED THE WATER/COOLANT PUMP.    TO MY SURPRISE IN SEPTEMBER 2018, AUDI ANNOUNCED A RECALL FOR THE WATER/COOLANT PUMP.  TO MY UNDERSTANDING, THIS MEANS THAT THEY ARE LIABLE FOR ANY DAMAGED PUMP.  WITH THAT BEING SAID, I WOULD ASSUME THAT ANY ISSUES RELATED TO THE PUMP SHOULD ALSO BE COVERED UNDER THAT RECALL.  AS NOTED ON MY SERVICE MEMO FROM THE AUDI DEALERSHIP WHEN I HAD MY CAR INSPECTED FOR THE WARNING 'IF NOT REPLACED, THE ENGINE'S COOLING SYSTEM WILL NOT BE OPERATING EFFICIENTLY AND AT THE PROPER TEMPERATURE RESULTING IN CATASTROPHIC ENGINE DAMAGE.'   IN FEBRUARY 2018,  A LITTLE OVER A MONTH AFTER HAVING MY CAR'S WATER/COOLANT PUMP REPAIRED, THE CAR STARTED TO IDLE WHEN I TRIED TO PULL OUT OF MY DRIVE WAY.  NOT EVEN A BLOCK AWAY AND THE CHECK ENGINE LIGHT FLASHED ON AND OFF AND THE CAR CUT OFF WHILE DRIVING AND STOPPED IN THE MIDDLE OF THE STREET.  I WAS SO SCARED, BUT RELIEVED THAT I WAS NOT HIT BY ANOTHER CAR.  I WAITED A FEW MINUTES AND WAS ABLE TO GET IT BACK TO MY HOME WHERE I IMMEDIATELY HAD IT TOWED TO MY MECHANIC WHO TOLD ME I NEEDED TO REPLACE THE ENGINE.  I DIDN'T HAVE HIM DO THE REPAIRS, BUT I THEN HAD IT TOWED TO THE AUDI DEALER WHO TOLD ME THE SAME THING, TO REPLACE THE ENGINE.",
        "vin": "WAUDFAFC3DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152195,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - MY AUDI DEALERSHIP STILL DOES NOT HAVE THE PARTS TO REPAIR THIS DEFECT.  IT'S BEEN FIVE MONTHS.  THIS IS UNACCEPTABLE.",
        "vin": "WAUDFAFC4DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151798,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI SHREWSBURY (780 BOSTON TURNPIKE, SHREWSBURY, MA 01545, (508) 581-5800) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUGFAFC1DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151246,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. WHILE STATIONARY, & STILL IN PARK, WITH AN ADULT IN THE FRONT PASSENGER SEAT, THE AIRBAG MONITORING LIGHT COMES ON TO ALERT ME THAT THE PASSENGER SEAT AIRBAG IS \"OFF\". SAFETY RECALL NOTICE RECD. JULY 2018. I HAVE NOT BEEN ABLE TO USE THE FRONT PASSENGER SEAT SINCE THEN DUE TO SAFETY REASONS. AUDI USA STILL TELLS ME TODAY, 4 MONTHS LATER, THAT THEY HAVE NO SOLUTION FOR THIS ISSUE, & NO EXPECTED DATE TO FIX THIS PROBLEM.",
        "vin": "WAUGGAFC0DN"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2018",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150834,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VACUUM PUMP OIL LEAK (06J145100G). 76K MI, FOUND VIA MULTI POINT INSPECTION ON 10/25/18 (AUDI OF HONOLULU). VEHICLE PROD DATE: 07/2012, ENGINE CODE: CAEB, TRANSMISSION: 0BK, QUATTRO AWD.     THE VACUUM PUMP, LOCATED AT THE REAR OF THE ENGINE IS LEAKING MOTOR OIL. EITHER THE INTERNAL SEALS OF THE PUMP OR GASKET IS FAULTY. MOTOR OIL IS LEAKING ONTO THE EXHAUST, TRANSMISSION, FIREWALL INSULATION, ENGINE BELLY PAN, TRANSMISSION MOUNTS/CROSSMEMBER, TRANSMISSION BELLY PAN, AND LOWER REAR OF ENGINE.     UNDER MODERATE BRAKING, WHITE SMOKE WOULD APPEAR FROM UNDER THE HOOD (PRESSURE FORCING THE OIL THROUGH THE PUMP SEALS, WHICH THEN LEAKED ONTO THE EXHAUST.) BRAKING POWER IS SOMETIMES DIMINISHED DUE TO LACK OF VACUUM POWER TO BRAKE BOOSTER (AIR LEAK). AFTER SHUTTING OFF ENGINE (AFTER NORMAL DRIVING), A BURNT SMELL WOULD APPEAR (WHOLE CARPORT WOULD SMELL).    EST COST OF PARTS + LABOR, $1K(AUDI OF HONOLULU). VEHICLE IS LESS THAN 10 YEARS OLD AND OUT OF WARRANTY. I'M HIGHLY CONCERNED OF A POTENTIAL FIRE HAZARD AND REDUCED BRAKING ABILITY.",
        "vin": "WAUGFAFCXDN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150319,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 AUDI A6. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED AND REMAINED LIT FOR MONTHS. AUDI CHANDLER (7460 W ORCHID LN, CHANDLER, AZ 85226, (480) 470-7367) INSPECTED THE VEHICLE AND PROVIDED A DIAGNOSTIC INVOICE WITH A COST ESTIMATE, BUT HAD NOT SPECIFIED A PART NAME AND PART NUMBER. THE DEALER MADE NO MENTION OF ANY RECALLS ISSUED FOR THIS YEAR, MAKE, AND MODEL VEHICLE PERTAINING TO THE AIR BAGS. THE VEHICLE WAS LATER INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAGS). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "WAUGFAFC9DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2018",
        "dateOfIncident": "02/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144967,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN SHAKING, DRIVING VERY ROUGH AND CHECK ENGINE LIGHT CAME AND EPC LIGHTS CAME ON THE DASH.  CAR WAS NOT DRIVABLE.  THIS HAPPENED LESS THAN TWO MONTHS AFTER I HAD THE WATER PUMP REPLACED FOR LEAKAGE AND FAILURE (WHICH HAS NOW BEEN RECALLED).  I BELIEVE THE TWO ARE CONNECTED, BUT AUDI CHARGED ME A TO REPLACE THE ENGINE.  I FEEL THAT THE ENGINE FAILURE WAS A DIRECT LINK TO THE ISSUE WITH THE PUMP.",
        "vin": "WAUDFAFC3DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139375,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "START SMELLING GASOLINE AND EVERY DAY WAS WORSE. I BRING THE A6 FOR THE RECALL BUT I JUST REALIZE THAT AUDI DID THE 20AR BUT I REMEMBER PRIOR TO THIS RECALL THE CAR HAD THE 24BZ . I TRIED TO CALL THEM AND MY VIM SOES NOY SHOW FOR THIS RECALL .  THE A6 IS WITH AUDI LIVERMORE THEY WANT ME TO PAY TO UNMOUNT THE GAS TANK TO PROCEDURE WITH A DIAGNOSTIC. I JUST KNOW THAT MY CAR IS LEAKING GAS AND NO RESPONSE THAT WHY TGIS HAPPEND THE CAR OR THE TANK HASN'T RECEIVED A DAMAGED AT ALL SO HOW THIS HAPPEND .  OTHER OPTION THAT AUDI WANT IS CHARGE 3500 FOR FIX AND THEY PAY THE 20% WICH ITS NOT RIGHT .  WHY THIS AUDI A6 2013 3.0 DOESN'T MATCH LIKE THE OTHER A6 FOR THE RECALL REPAIR  U CAN LOOK VIDEO AND PHOTOS ON THIS LINK   HTTPS://WWW.DROPBOX.COM/SH/SBQ6UF4L11HI6BO/AADHNWHAL8XKVQPLDVHMLJ8UA?DL=0",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139153,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON AND PODS SYSTEM FAILS TO DETECT A PASSENGER.  DEALER DID NOT FIX THIS PROBLEM.  NO PARTS AVAILABLE.",
        "vin": "WAUGFAFC6DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128202,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2012 A6 HAS BEEN RECALLED FOR THE FRONT PASSENGER SEAT AIRBAG SENSOR. AUDI HAS NO DATE THAT THEY WILL HAVE THE PARTS, THEIR ONLY ANSWER IS TO NOT HAVE ANYONE SIT IN THE FRONT SEAT. THIS IS UNACCEPTABLE AS I CAN'T EVEN FIT MY FAMILY ANYMORE.",
        "vin": "WAUBGAFC5CN"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122835,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 74D5 (PASSENGER OCCUPANT DETECTION SYSTEM) THAT HAS BEEN ISSUED FOR MY CAR. IVE HAD MY CAR APPRAISED AT MY LOCAL AUDI DEALERSHIP AND AT TWO PROMINENT USED CAR DEALERSHIPS, WERE MUCH LOWER ($3,000-$6,000) THAN THE VALUE OF THE CAR ACCORDING TO KBB.THE REPRESENTATIVE AT THE AUDI DEALERSHIP MENTIONED THAT THEY ARE UNABLE TO SELL THIS PARTICULAR MAKE AND MODEL OF VEHICLE BECAUSE IT HAS A RECALL FOR WHICH A REPAIR IS NOT YET AVAILABLE.  THUS, THE DEALERSHIP MUST SEND THE CAR DIRECTLY TO AUCTION RATHER THAN PREPARING IT FOR RESALE.  I DONT THINK IT'S FAIR THAT I'MLOSING MONEY ON MY VEHICLE BECAUSE OF THE NEGLIGENCE OF THE CAR MANUFACTURER AND BECAUSE OF DEFECTS IN THEIR DESIGN.  I AM CONCERNED ABOUT THE SAFETY OF THE VEHICLE.  THE RECALL NOTICE CLEARLY STATES THAT THE PASSENGER OCCUPANT DETECTION SYSTEM MAY MALFUNCTION, AND IF THIS OCCURS, 'DO NOT ALLOW ANYONE TO USE THE FRONT PASSENGER SEAT'IN THIS SITUATION, A FRONT PASSENGER SEAT OCCUPANT RISKS INJURY IN A CRASH BECAUSE A MALFUNCTIONING PODS SYSTEM MAY NOT MAKE THE CORRECT AIRBAG DEPLOYMENT DECISION FOR THE TYPE OF OCCUPANT SEATED THERE.' I FEEL FEARFUL ABOUT USING THE CAR, ESPECIALLY SINCE THERE IS NO REPAIR AVAILABLE.  IT IS AN INCONVENIENCE TO NOT BE ABLE TO USE THE FRONT PASSENGER SEAT WITHOUT FEAR THAT THERE MAY BE A MALFUNCTION.        NOTICE: THIS E-MAIL MESSAGE AND ALL ATTACHMENTS TRANSMITTED WITH IT MAY CONTAIN LEGALLY PRIVILEGED AND CONFIDENTIAL INFORMATION INTENDED SOLELY FOR THE USE OF THE ADDRESSEE. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT, YOU ARE HEREBY NOTIFIED THAT ANY READING, DISSEMINATION, DISTRIBUTION, COPYING, OR OTHER USE OF THIS MESSAGE OR ITS ATTACHMENTS IS STRICTLY PROHIBITED. IF YOU HAVE RECEIVED THIS MESSAGE IN ERROR, PLEASE NOTIFY THE SENDER IMMEDIATELY BY TELEPHONE (281-649-3000), AND DELETE THIS MESSAGE AND ALL COPIES AND BACKUPS THEREOF. THANK YOU.",
        "vin": "WAUDFAFC9DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121256,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CURRENTLY THE OWNER OF A 2013 AUDI A6.  I HAVE RUN INTO SOME SIGNIFICANT DIFFICULTIES TRYING TO SELL MY CAR BECAUSE OF TWO RECALLS, RECALL 74D5 (PASSENGER OCCUPANT DETECTION SYSTEM) AND RECALL 19N4 (OVERHEATING ELECTRIC COOLANT PUMP) THAT HAVE BEEN ISSUED FOR MY CAR.  WHEN I HAVE HAD THE CAR APPRAISED AT MY LOCAL AUDI DEALERSHIP AND AT TWO PROMINENT USED CAR DEALERSHIPS, ALL OF THE ESTIMATES WERE MUCH LOWER ($3,000-$6,000) THAN THE VALUE OF THE CAR ACCORDING TO KELLEY BLUE BOOK.  THE REPRESENTATIVES MENTIONED THAT THEY ARE UNABLE TO SELL THIS PARTICULAR VEHICLE BECAUSE IT HAS RECALLS FOR WHICH A REPAIR IS NOT YET AVAILABLE.  THUS, THE CAR MUST BE SENT DIRECTLY TO AUCTION.  IT IS NOT FAIR THAT I AM NOW LOSING MONEY ON MY VEHICLE BECAUSE OF THE NEGLIGENCE OF THE CAR MANUFACTURER AND BECAUSE OF DEFECTS IN THEIR DESIGN.  I AM CONCERNED ABOUT THE SAFETY OF THE VEHICLE.  THE RECALL NOTICE CLEARLY STATES THAT THE PASSENGER OCCUPANT DETECTION SYSTEM MAY MALFUNCTION, AND IF THIS OCCURS, 'DO NOT ALLOW ANYONE TO USE THE FRONT PASSENGER SEAT'IN THIS SITUATION, A FRONT PASSENGER SEAT OCCUPANT RISKS INJURY IN A CRASH BECAUSE A MALFUNCTIONING PODS SYSTEM MAY NOT MAKE THE CORRECT AIRBAG DEPLOYMENT DECISION FOR THE TYPE OF OCCUPANT SEATED THERE.' THE RECALL FOR THE COOLANT PUMP STATES THAT 'A SHORT CIRCUIT OR OVERHEATING WITHIN THE ELECTRIC COOLANT PUMP MAY LEAD TO A VEHICLE FIRE.' I FEEL FEARFUL ABOUT USING THE CAR, ESPECIALLY SINCE THERE IS NO REPAIR AVAILABLE.  IT IS AN INCONVENIENCE TO NOT BE ABLE TO USE THE FRONT PASSENGER SEAT WITHOUT FEAR THAT THERE MAY BE A MALFUNCTION AND/OR TO USE THE CAR IN GENERAL BASED ON THE POSSIBILITY OF AN ELECTRIC FIRE.  I AM NOT SURE OF THE PROPER COURSE OF ACTION TO RECTIFY THIS MATTER, BUT I WOULD LIKE TO BE ABLE TO SELL THIS VEHICLE AT A FAIR PRICE SO I CAN SET MY MIND AT EASE ABOUT THE PERSONAL SAFETY OF THOSE WHO OCCUPY THE CAR.",
        "vin": "WAUDFAFC9DN"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "07/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115886,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG SENSOR GOES OFF AND ON WHILE I'M DRIVING, EVEN WHEN THE SEAT IS EMPTY. I KNOW THERE IS A RECALL ON THIS, BUT THE DEALERSHIP IS TELLING ME MY CAR ISN'T COVERED. I FALL UNDER THE YEAR AND MAKE OF THE RECALL, WHY ISN'T MY CAR COVERED?",
        "vin": "WAUHGAFC1DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110651,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR CUPLE DAYS WHEN EVER I TURN ON THE AC I CAN SMELL LIKE SOMWTHING IS BURNING N TOOK IT DEALER THEY COUDNT FIND OUT  WHAT IS GOING ON N RECENT I FOUND OUT ITS RECALL  AND I HAVE 6 MONTH BABY I DONT FEEL SAFE TAKING HIM IN THAT CAR AND I TRY TAKING BACK TO AUDI DEALER IN FREMONT TO SELL THY WONT TAKE IT SAYING IT HAS RECAL N ALL",
        "vin": "WAUCFAFC3DN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/06/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. WHILE DRIVING AT AN UNKNOWN SPEED, SMOKE COULD BE SEEN COMING FROM THE ENGINE COMPARTMENT. THE ENGINE OVERHEATING WARNING INDICATOR ILLUMINATED DURING THE FAILURE. THE DEALER (AUDI VALENCIA, 23923 CREEKSIDE RD, VALENCIA, CA 91355, (661) 735-1778) INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE COOLANT PUMP FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE FAILURE MILEAGE WAS 61,871. *TT",
        "vin": "WAUGGAFC8DN"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101389,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER  SEAT BELT AND PASSENGER AIRBAG CONSTANTLY BEEPS -  THE PASSENGER AIRBAG AND SEAT BELT BEEPS WHEN THE VEHICLE IS IN MOTION AS WELL AS  IF THE VEHICLE IS STATIONARY.   IT BEEPS WHEN I'M ON THE STREETS, HIGHWAY AS WELL AS TURNING IT'S A CONSTANT BEEPING SOUND AND IT LIGHTS UP WITH AN ORANGE COLOR.",
        "vin": "WAUGFAFC8DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093454,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. IT LOOKS LIKE THERE IS AN OPEN RECALL FOR THE 2013 AUDI A6 AWD \"PASSENGER SEAT OCCUPANT DETECTION SYSTEM MAY FAIL\" I LOOKED UP MY VIN AND FOR MY CAR VIHICLE IS NOT LISTED BUT MINE JUST FAILED. I WOULD LIKE TO GET THIS TAKEN CARE AND GET LISTED PART OF THE RECALL.",
        "vin": "WAUGGAFC1DN"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092762,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BETWEEN 35 AND 60 MPH I HEARD A NOISE FROM THE FRONT OF THE VEHICLE, IT IS A BUZZING, HUMMING, WHISTLING, WHINING SOUND. AFTER SEVERAL TRIPS TO THE CAR REPAIR SHOP, I WAS REFERRED TO TIRE SHOP. AFTER 3 TRIPS TO THE TIRE SHOP, TIRE BALANCE AND AFTER BUYING ALL NEW TIRES AND ALIGNMENT. IT WAS RECOMMENDED THAT I REPLACE THE FRONT WHEEL BEARINGS. I WENT HOME AND DID SOME RESEARCH ON THE INTERNET I FOUND THAT I MAY HAVE FAULTY WHEEL BEARING OR BEARINGS.     THERE IS A SERVICE BULLETIN ON AUDI YEARS 2009-2016     CARS.COM ' VEHICLES AFFECTED BY SERVICE BULLETIN:        2009 AUDI A4, 2010 AUDI A4, 2011 AUDI A4, 2012 AUDI A4, 2013 AUDI A4, 2014 AUDI A4, 2015 AUDI A4, 2016 AUDI A4      2009 AUDI A5, 2010 AUDI A5, 2011 AUDI A5, 2012 AUDI A5, 2013 AUDI A5, 2014 AUDI A5, 2015 AUDI A5, 2016 AUDI A5      2009 AUDI A5 CABRIOLET, 20AUDI Q510 AUDI A5 CABRIOLET, 2011 AUDI A5 CABRIOLET, 2012 AUDI A5 CABRIOLET, 2013 AUDI A5 CABRIOLET, 2014 AUDI A5 CABRIOLET, 2015 AUDI A5 CABRIOLET, 2016 AUDI A5 CABRIOLET      2009 AUDI Q5, 2010 AUDI Q5, 2011 AUDI Q5, 2012 AUDI Q5, 2013 AUDI Q5, 2014 AUDI Q5, 2015 AUDI Q5, 2016 AUDI Q5      2012 AUDI A6, 2013 AUDI A6, 2014 AUDI A6, 2015 AUDI A6, 2016 AUDI A6      2012 AUDI A7, 2013 AUDI A7, 2014 AUDI A7, 2015 AUDI A7, 2016 AUDI A7      2011 AUDI A8, 2012 AUDI A8, 2013 AUDI A8, 2014 AUDI A8, 2015 AUDI A8, 2016 AUDI A8    THE PROBLEM: BETWEEN 35 AND 75 MPH, A NOISE CAN BE HEARD IN THE FRONT OF THE VEHICLE, DESCRIBED AS A BUZZING, HUMMING, WHISTLING, WHINING, GRINDING, HOWLING, AND/OR DRONING. THIS IS DUE TO A FAULTY WHEEL BEARING OR BEARINGS.  CORRECTIVE ACTION: DEALERS WILL REPLACE AFFECTED WHEEL BEARINGS.    I CONTACTED THE DEALER AND THEY SAID THEY CAN REPLACE FOR A FEE.  THERE IS OBVIOUSLY ENOUGH VEHICLES AFFECTED, THIS SHOULD BE A RECALL AND THERE SHOULD NOT BE A FEE.",
        "vin": "WAUGFAFC1DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091032,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ADVISED THAT MY 2013 AUDI A6 REQUIRES PASSENGER OCCUPANT DETECTION SYSTEM (PODS).  THIS EXACT PART WAS RECALLED VIA RECALL #74D1.  AUDI HAS ADVISED THAT MY VIN WAS NOT INCLUDED IN THE RECALL.  HOWEVER, THE AUDI SERVICE TECHNICIAN AT AUDI NORTH AMERICAN ADVISED ME THAT THE PODS PART IN MY CAR IS THE EXACT SAME PART NUMBER IN THE RECALL NOTICE.  THE DIFFERENCE IS THAT THE RECALL HAD FOR HEATED AND COOLING SETS, WHILE MY VIN HAS ONLY HEATED SEATS.  AS A RESULT, AUDI NORTH AMERICA IS NOT EXTENDING THE RECALL TO MY VEHICLE.  THIS IS PREVENTING THE PASSENGER AIRBAG FROM BEING OPERATIONAL.  AGAIN, MAIN POINT IS THAT THE EXACT SAME PART NUMBER THAT HAS BEEN RECALLED, IS THE SAME PART NUMBER THAT IN MY VEHICLE THAT I AM BEING TOLD IS THE ISSUE AND NEEDS TO BE REPLACE.  THE DEALER TRIED TO \"RESET\" IT PODS SYSTEM, BUT IT IMMEDIATELY STOPPED WORKING ONE DAY LATER.  I EXPECT THAT AS THIS IS AN EXTREME IMPORTANT SAFETY ISSUE, AND BY LAW MANUFACTURERS MUST REMEDY FAULTY PART, THE AUDI NORTH AMERICAN NEEDS TO REMEDY.  THESE ARE NOT TWO DIFFERENT VERSION OF THE PART, MINE IS THE SAME AS WAS FOUND TO BE DEFECTIVE AND REQUIRED BY THE NHTSA TO REPLACE.  THE CAR WAS SERVICE BY AUDI IN FEBRUARY, BUT I HAVE BEEN IN DISCUSSIONS WITH THEM SEVERAL TIME OVER THE LAST TWO MONTHS, WITH NO RESOLUTION.",
        "vin": "WAUGGAFC1DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090004,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I  PASSED A PUDDLE, THE WATER SPLASHED.  THEN A WARNING CAME OUT AND ASK ME DO NOT DRIVE THE VEHICLE.AFTER THAT IT WAS TOWED TO AUDI, THEY SAID THEY NEED TO CHANGE THE STEERING RACK",
        "vin": "WAUJGAFC5DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088694,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. WHILE OPERATING THE VEHICLE, THE AIR BAG SENSOR INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (MISSION VIEJO AUDI, 28451 MARGUERITE PKWY, MISSION, CA) WHERE IT WAS DIAGNOSED THAT THE PASSENGER OCCUPANT DETECTION SYSTEM WAS FAULTY AND NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED BY THE DEALER THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V823000 (AIR BAGS). THE CONTACT INDICATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 66,000. *TT    VEHICLE WAS REPAIRED AND PAID FOR BY OWNER IN APRIL 2018. *TT",
        "vin": "WAUGGAFC3DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080077,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A MESSAGE ON MY WASH IT SAID \"STEERING DETECTIVE DO NOT DRIVE\". MY STEERING WHEEL GETS HARD AND MOVES ON ITS OWN SOMETIMES. IT DOES IT INTERMITTENTLY IN ANY CONDITION OR DRIVING SPEED.",
        "vin": "WAUDFAFC4DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "10/07/2017",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033170,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS DRIVING, WE SMELLED BURNING OF RUBBER BUT THOUGHT THAT IT MUST BE FROM OUTSIDE. HOWEVER AFTER DRIVING OF ANOTHER 3-4 MILES, SUDDENLY SMOKE STARTED TO COME OUT FROM AIR VENT MAINLY ON DRIVER AND WINDSHIELD SIDE INSIDE OF CABIN. I STOPPED CAR AND TURNED OFF. I TOOK IT TO NEARBY GARAGE AND THEY CHECKED ANY LEAKAGE OF FLUID THAT CAN CAUSE BURNING BUT CAN'T FIND IT WHICH INDICATES THAT PROBLEM OF SHORT CIRCUIT AND MAY NEED TO RESEARCH MORE. IN THE NIGHT, WHEN I TRIED TO TURN CABIN LIGHTS ON, IT DIDN'T WORK WHICH NOW CLEARLY SHOWS THAT IT'S INCIDENT OF SHORT CIRCUIT THAT CAUSE INSIDE LIGHTS DOME, READING AND OTHER LIGHTS OFF. I WAS LUCKY THAT IT DIDN'T CAUGHT FIRE AND BURNED DOWN MY CAR. HOWEVER THIS NEEDS TO BE INVESTIGATED. I WILL APPOINTMENT WITH DEALER AND SEE IF I CAN GET PICTURES OR DOCUMENTATION ON THE DETAILS",
        "vin": "WAUGFAFC1DN"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030517,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG SENSOR PERIODICALLY DISENGAGED AND THE AIR BAG WARNING INDICATOR DIMMED WHEN THE PASSENGER SEAT WAS OCCUPIED. THE VEHICLE WAS TAKEN TO AUDI SHREWSBURY (780 BOSTON TURNPIKE, SHREWSBURY, MA 01545, PHONE NUMBER: (888) 699-9619) WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SEAT NEEDED TO BE REMOVED TO INSTALL A NEW SEAT SENSOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER STATED THAT THE CONTACT WOULD HAVE TO PAY OUT OF POCKET FOR THE REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "WAUGGAFC6DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL HOSE APPEARS TO HAVE DETERIORATED FROM THE INSIDE. SMALL PINHOLE LEAK APPEARED AND ALLOWED FOR GASOLINE TO SPILL ONTO HOT ENGINE. CURRENT VOLKSWAGEN RECALL 24BZ DOES NOT APPEAR TO INCLUDE MY VIN, ALTHOUGH CHARACTERISTICS ARE EXACTLY AS DESCRIBED IN RECALL. I BELIEVE THE RECALL NEEDS TO BE EXPANDED TO INCLUDE MY VIN.  THE VEHICLE WAS IN MOTION AND THE STRONG SMELL OF GASOLINE STARTED TO PERMEATE THROUGH THE CABIN. AS I INVESTIGATED THE CAUSE, I FOUND THE CRACK IN THE FUEL HOSE. SUBSEQUENTLY, I CUT THE HOSE AT THE FAILURE POINT AND FOUND DEEP CRACKS ALL ALONG THE INTERNAL LAYER OF HOSE, OUTER LAYER APPEARED IN TACT EXCEPT WHERE THE HOLE EMERGED.",
        "vin": "WAUGGAFC9DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910537,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TIRING TO TRADE MY AUDI A6 2013 IN ON ANOTHER VEHICLE. I LEARNED FROM A DEALER THAT THERE WAS A RECALL #74D1 PODS SYSTEM ON MY AUDI. TO MY KNOWLEDGE I HAVE NOT RECEIVED A NOTICE FROM THE MANUFACTURER NOR HAS THERE BEEN A FIX OFFERED OR AVAILABLE. NO ACCIDENT HAS HAPPENED TO ME, MY PODSYSTEM SEEMS TO WORK FINE FOR NOW, HOWEVER THE VALUE OF MY VEHICLE IS MUCH LOWER AND I' M UNABLE TO TRADE THIS CAR.",
        "vin": "WAUHGAFC7DN"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/30/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI REPLACED PODS MODULE IN FRONT PASSENGER'S SEAT, WHICH MONITORS IF THERE IS AN OCCUPANT IN THE SEAT AND THIS TRIGGERS THE AIRBAG ACTIVATION. AFTER THIS REPLACEMENT MY FRONT PASSENGER SEAT SENSOR STARTED MALFUNCTIONING. IT SEEMS TO BE WORKING FINE WHEN MY HUSBAND SITS THERE (ABOUT 170 LB.), BUT IT WOULD NOT FUNCTION WHEN I WAS OCCUPYING THE SEAT (ABOUT 128 LB.). THE DEALER MADE TWO MORE ATTEMPTS TO CORRECT THE ISSUE. THEY FINALLY ASKED ME TO TRY THE SEAT WITHOUT WEARING MY LONG COAT IN WHICH CASE THE SENSOR SEEMED TO WORK CORRECTLY. THE FINAL CONCLUSION WAS THAT IN ORDER FOR THE AIRBAG SENSOR TO ACTIVATE, LIGHTER PASSENGERS NEED TO TAKE THEIR LONG COATS OFF. THIS IS A LAUGHABLE SUGGESTION THAT AIRBAG FUNCTION IS CONTINGENT ON THE TYPE OF COAT THE PASSENGER IS WEARING.  I CONTACTED AUDI USA CUSTOMER SERVICE. THEY IN TURN CONTACTED THE DEALERSHIP AND CAME BACK TO ME WITH THE SAME CONCLUSION THAT THE SEAT PERFORMS UP TO MANUFACTURER'S STANDARDS.   I ASKED WHERE IN THE OWNER'S MANUAL THERE IS A NOTE THAT THE PASSENGERS MUST NOT WEAR LONG COATS IN ORDER FOR CRUCIAL SAFETY FEATURE SUCH AS AIRBAG TO FUNCTION CORRECTLY. I ALSO ASKED REPEATEDLY TO EXPLAIN TO ME WHY THIS PROBLEM ONLY PRESENTED ITSELF AFTER THE RECALLED PART WAS REPLACED, TO NO AVAIL.  AT THIS POINT AUDI REFUSES TO TAKE NECESSARY STEPS TO FIX THE PROBLEM WHICH THEY CREATED. AUDI SHOULD BE HELD LIABLE FOR ABANDONING THE CUSTOMER WHEN THERE IS A POTENTIALLY SERIOUS SAFETY ISSUE INVOLVED.",
        "vin": "WAUHGAFC0DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838469,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A6. WHILE BACKING THE VEHICLE OUT OF THE DRIVEWAY AT 5 MPH AND ATTEMPTING TO TURN LEFT, THE VEHICLE FAILED TO TURN. THE CONTACT PULLED BACK INTO THE DRIVEWAY, TURNED OFF, AND RESTARTED THE VEHICLE. A \"DO NOT DRIVE VEHICLE STEERING FAILURE\" WARNING MESSAGE APPEARED. THE CONTACT SHUT OFF THE VEHICLE AND CALLED THE DEALER AND THE MANUFACTURER. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL MECHANICAL POWER STEERING MODULE FAILED. THE POWER STEERING CONTROL MODULE AND THE STEERING GEAR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,400.",
        "vin": "WAUFGAFCXDN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763844,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LANE CHANGE ASSIST GIVES ERROR MESSAGE ON THE DASHBOARD AND TURNS OFF.",
        "vin": "WAUHGAFC9DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763846,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION.  UNDER NORMAL DRIVING CONDITIONS, THE ENGINE LIGHT CAME ON TO ADD 1 QUART OF OIL 3,000 MILES BEFORE THE NEXT SERVICE INTERVAL.  ONLY 22,000 MILES ON THE CAR.",
        "vin": "WAUHGAFC9DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "08/02/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690239,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2013 AUDI A6. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE STEERING WHEEL SEIZED AS THE STEERING WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED TWO TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ELECTRONIC MAGNETIC STEERING NEEDED TO BE REPAIRED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 20,000.   UPDATED 04/08/15*LJ",
        "vin": "WAUHGAFC6DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671338,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FEELS LOOSE-HARD TO KEEP THE CAR GOING STRAIGHT.AUDI PERFORMED SOFTWARE UPDATE FOR THE STEERING-SAME PROBLEM STILL EXIST-MOST NOTICEABLE  IN COLD WEATHER.  *TR",
        "vin": "WAUGFAFC3DN"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/11/2014",
        "dateOfIncident": "09/25/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10644104,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING MY GARAGE AND THE CAR KEPT ACCELERATING. I SLAMMED INTO ANY FRONT WALL DOING LOTS OF DAMAGE TO THE STRUCTURES IN AND OUT AS WELL AS TO MY BODY. MY CAR WAS TOTALED. MY FIRST ACCIDENT EVER AND THE SCARIEST MOMENT OF MY LIFE.     I HAVE HAD PRIOR ACCELERATION/DECELERATION ISSUES WITH THIS CAR. ON AT LEAST 6 OCCASIONS, I WAS GOING DOWNHILL APPROACHING A STOP SIGN AND THE CAR SEEMED TO STOP RESPONDING (STEERING, BRAKING, ENGINE) AND YET THE RPM'S WERE GONG HIGHER AND THE ENGINE WAS RACING. VERY FRIGHTENING SINCE YOU DID NOT KNOW WHAT WOULD HAPPEN NEXT!!!  *TR",
        "vin": "WAUGFAFC6DN"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "04/11/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10534829,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "HAD A FRONTAL CRASH AS I WAS TRYING TO CLICK IN THE SAFETY BELT WHILE IN MOTION. THE IMPACT WAS SEVERE ENOUGH THAT MY HEAD WENT FORWARD AND CRACKED THE WINDSHIELD INJURING MY FOREHEAD. I LOST CONSCIOUSNESS FOR 30 MINUTES. THIS WAS A NEW CAR (115 MILES) AND NONE OF THE MULTIPLE AIRBAGS WENT OFF. TRIED TO HAVE AUDI EXPLAIN TO ME WHY NONE OF THE AIRBAGS WENT OFF AND I GOT 2 NONSENSICAL REASONS (ONE SALESPERSON SUGGESTED THAT THEY DID NOT GO OFF BECAUSE THE SAFETY BELT WAS NOT ENGAGED, A CUSTOMER REPRESENTATIVE RELATED TO ME SOME MYSTERIOUS ANGLE - 30 DEGREES FROM THE MIDLINE OF THE CAR- WHERE AN IMPACT WOULD NOT ACTIVATE AIR BAGS (!) . I WAS ALSO GIVEN A LECTURE REGARDING THE SAFETY OF AUDI CARS. I ASKED THEM TO TEST THE FRONT ACCELEROMETERS IN THE CRASHED CAR BUT THEY DID NOT SEE ANY POINT IN DOING IT.   I HAVE SEEN A RECALL FOR THE CURTAIN AIR BAGS OF LAST YEAR A6 MODEL. IT SEEMS THAT THE SENSORS OF THE 2013 A6 I WAS DRIVING DO NOT FUNCTION RELIABLY AND DO NOT GUARANTEE THE SAFETY OF THE DRIVER.  *TR",
        "vin": "WAUGGAFC5DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "03/27/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511651,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS DOES NOT REFER TO ANY SPECIFIC INCIDENT.  AFTER PURCHASING THE CAR I BEGAN TO NOTICE THAT WHEN I ACCELERATED FROM A STOP, THE CAR ALWAYS SURGED AHEAD AFTER A FRACTION OF A SECOND.  I WAS TOLD THAT THE TURBOCHARGER ON THE 2 LITER ENGINE \"SPOOLED\" AT 1600 RPMS AND CAUSED THE SURGE.  IT IS A VERY UNCOMFORTABLE FEELING TO FIND THE CAR SURGING AHEAD WHEN YOU JUST TOUCH THE GAS PEDAL SLIGHTLY.  WHEN YOU'RE STOPPED IN BACK OF ANOTHER CAR, THE CAR SURGES AHEAD AND YOU HAVE TO BE VERY WARY OF \"REAR ENDING THE OTHER CAR.  UNFORTUNATELY, IT IS MY UNDERSTANDING THAT THIS SURGE IS A NORMAL PART OF THE TURBOCHARGER, BUT IT CREATES A DEFINITE POSSIBILITY OF A SLOW SPEED COLLISION.  *TR",
        "vin": "WAUGFAFC5DN"
    }
]