[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2022",
        "dateOfIncident": "03/19/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457556,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The car has only 60,000 miles and it is gently driven. In the middle of the interstate it started making a rattling noise. Immediately the car ceased to run. Luckily there was no vehicle otherwise it would have been a disaster. I managed to start the car back and bring it to my home which was nearby. I called a friend who is the mechanic and he mentioned the turbo had failed",
        "vin": "WAUR2AFD6DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "09/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "On the afternoon of September 12, 2018, my 2013 Audi A8L 4.0T started with somewhat of a rough idle, but no warning lights or error codes were present on the dashboard.  I owned the car for approximately 18 months at that point, and this had never happened before.  As soon as I started to drive, the tachometer became steady and there were no other indications anything was wrong, even stopping at traffic lights the problem did no persist nor were there any indications anything was wrong.  Once back in Spartanburg, the car stalled while slowing down for a traffic light.  The engine cut off completely, the steering became very rigid, and the Check Engine light turned on.  I was able to coast to a stop and turn on my hazard lights, and then tried to restart the car to no avail.  The engine would turn over, but the car would not start.    Another car stopped behind me, and we were able to push the car onto the grassy shoulder out of traffic, which was dangerous in itself but safer than sitting in the middle of a busy road.  I had the car towed to Steve White Audi in Greenville, SC.  Once there, they informed me that the error codes indicated that both turbo's failed simultaneously and the failure of those turbos caused the first set of downstream catalytic converters to fail also.  See attached repair report and payment receipt = $10,975.57 for the replacement parts and labor ($12,070.85 including the 115,000 mile service).    Once they told me the cost of the repair, I called Volkswagen USA corporate headquarters to ask if there were any pending recalls for the turbos.  Multiple message boards and FaceBook pages go into detail about how the turbos are a known point of failure on the 4.0T cars, and the astronomical cost to replace them.  I was informed by Volkswagen that there were no pending recalls, and that I would have to pay for the repairs out of pocket, which I did.",
        "vin": "WAUR2AFD3DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452589,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I experienced the engine stall/turbo failure as described in NHTSA Action Number PE21009. I have all of the supporting documents regarding this turbo failure. Volkswagen auto group had previously issued a voluntary TSB regarding this known design shortcoming in the turbo system of the 4.0T engine. The oil screens that filter the turbo cooling were engineered with a mesh that was too fine. This mesh eventually clogged and severed oil flow to the turbo units, causing failure. There is discussion of this design shortcoming in every single Audi online group, so much so, that when new members join the owners Facebook group, they are nearly all immediately warned to change their oil screens. The concept that I was without a vehicle for months as well as having to pay for this repair out of pocket still shocks me - I had several heated calls with the Audi warranty headquarters and an incident at the dealership that required retraining of the service staff. Needless to say, this turbo failure on my vehicle was an absolute nightmare. I’d be more than happy to share all of my documents and story with the NHTSB. Thank you.",
        "vin": "WAUA2AFD2DN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "12/28/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445582,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle windshield started leaking from top and visibly moves when pressed from outside. This is the original windshield, never in an accident.",
        "vin": "WAUR2AFD3DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "11/05/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444597,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Car is not blowing hot air. I have a transmission fault code related to this which is P2753. Coolant is leaking and has run through the control valve to the wiring and connector causing corrosion.",
        "vin": "waur2afd9dn"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442867,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "While traveling on Interstate 65 through Nashville, TN my 2013 Audi A8L showed an EPC light alert then <5 miles later while traveling through interstate split going 20mph the car without alert shut down and I lost power steering, brake control, accelerator control, electric control and was forced to navigate hazardously across 3 lanes of traffic to a modified left side median.  I had large vehicle traffic dodging my car going 50-60mph and was forced to call 911.  I stayed in the car because much too dangerous to leave the vehicle and was able for a brief minute to restart and get off an exit ramp where it abruptly died again.  I had the car towed to Audi dealership where diagnosis showed dual turbocharger failure and they recommended replacement.    * Catastrophic turbo charger failure - it is available for inpsection * Car catastrophically shut down going 15-30 mph on interstate in downtown nashville causing loss of power steering/brake control.  This led to immediate danger and harm caused by loss of vehicle control and traffic collision risk * Yes - dealer confirmed in multiple locations (Nashville and Louisville of turbocharger failure * No * The car EPC light came on <5 miles prior to shutdown  I understand that the NHTSA already has an investigation into this model and year audi regarding turbocharger failure and I would like to add that I have had a similar problem with this vehicle.  It should be recalled to address these safety concerns",
        "vin": "WAUR2AFD2DN"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "08/06/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440536,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE BOTH TURBOS Purchased Audi Naples Jan 2018 Maintained at Audi Ft Myers Audi While on a vacation from our home in Florida to New England our Audi A8 experienced a major turbo failure while on an Interstate highway. On 8/6/21  I was traveling in the middle lane of I495 at 65 mph, when traffic slowed, the car stalled. With cars passing me on both sides I eventually managed to get the car started and made it to exit 15 (rt44) going toward Plymouth, MA. This truly was a scary situation, waiting to be rear ended. While on rt 44 it died again in traffic. I managed to make it into the breakdown lane. At about 2:55 pm a state Trooper stopped and asked if he could help me get to a safer spot but by that time I had called AAA. At 3:30pm AAA arrived and towed us to a safe spot. At no time before, during or after this failure did I receive any message or warning that this failure was imminent. The car was taken to Audi Norwell and diagnosed with defective turbos due to failure of turbo shaft  bearings . The screens were clogged preventing oil from reaching the bearings. The turbos were the original equipment. I have read in the Audi Forum this is not an uncommon problem. I understand the screens have been redesigned as a result.",
        "vin": "WAUR2AFD2DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426929,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The car start chugging and lost power while driving. My safety and the safety of other drivers were at risk, because the vehicle stalled immediately. This issue happened while exiting off the highway. The vehicle was inspected by an Audi dealer and the issue reported was Turbo Charger issue. There were no warnings prior to the failure.",
        "vin": "WAUA2AFD3DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420342,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "After exiting the highway the car just stopped running.  There was no warning and all power was lost.  Engine would not start up and vehicle had to be towed from the road.  It was at night and the car stopped dead at an intersection (safety). We are grateful that the problem did not happen on the Ohio Turnpike we just exited. There was a clunk sound before it stopped. I suspect the turbo let loose.  This has not been confirmed yet by the dealer.  There was no warning. Consumer stated vehicle has been repaired.",
        "vin": "WAUR2AFD4DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416095,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS A SLOWED TO MAKE A TURN IN AN INTERSECTION (DOWNTOWN IN A MAJOR CITY) THE CAR STARTED JUMPING AND THEN THE ENGINE SHUT OFF IN THE MIDDLE OF A MAJOR INTERSECTION AND THE STEERING LOCKED UP.  I TURNED ON MY HAZARDS AND LUCKILY NO ONE HIT ME, BUT THE CAR WOULD NOT START UP.  HOWEVER, ONE I GAVE IT SOME GAS WHILE STARTING THE IGNITION IT TURNED OVER, BUT THE CAR DIED TWO MORE TIMES BEFORE I COULD SAFELY PARK IT. I TOOK IT TO THE DEALERSHIP AND THEY TOLD ME MY TURBOS WERE BLOWN.  MY CAR HAS LESS THAN 60K MILES, WELL MAINTAINED, AND IT'S ONLY BEEN USED AS A COMMUTER VEHICLE.",
        "vin": "WAUR2AFD9DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413285,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR FROM PROVO, UT TO CALIFORNIA, APPROX 250 MILES INTO THE TRIP NOTICED THE EPC LIGHT ON, I PULLED OFF THE FREEWAY TO CHECK THE ENGINE AND IT STALLED. I WAS ABLE TO RESTART VEHICLE AND DRIVE IT TO LAS VEGAS IT RAN FINE AT FREEWAY SPEEDS. WHEN I GOT OFF THE EXIT THE CAR STALLED AND ENGINE QUIT WHILE I WAS ROLLING DOWN THE OFFRAMP. I CAME TO A COMPLETE STOP IN THE CENTER LANE OF A THREE LANE EXIT, COULD NOT GET PULL OUT OF TRAFFIC BECAUSE HAD CARS IN BOTH LANES BESIDE ME. WHEN THE LIGHT TURNED GREEN I GOT THE STARTED (USING 3/4 THROTTLE)BUT NOT UNTIL THE LIGHT HAD CYCLED TO YELLOW, CAR HORNS HONKING PEOPLE YELLING, I PUT THE CAR INTO DRIVE, SHOT ACROSS THE INTERSECTION AND ROLLED INTO AN EMPTY EMPLOYEE PARKING LOT BEHIND THE RIO. AFTER SEVERAL ATTEMPTS GO NO GO I MADE IT TO AN OVERFULL PARKING AREA AND THE NEXT MORNING HAD THE CAR TOWED TO LAS VEGAS AUDI. I CONTINUED MY TRIP TO CA. AFTER RENTING A VEHICLE IN LV. THE NEXT DAY THEIR SERVICE DEPARTMENT CALLED AND TOLD ME THAT ONE OF MY TURBOS HAD FAILED AND THAT IT WAS RECOMMENDED THAT I REPLACE BOTH. QUOTED 13,800 TO FIX THE CAR.I FELT TRAPPED BECAUSE MY CAR WAS 400 MILES FROM HOME AND I NEEDED IT FIXED. AFTER TALKING TO SOME INDEPENDENT SHOPS I REALIZED THAT PRICE WAS IN THE NORMAL PRICE RANGE. WHAT I AM MOST DISAPPOINTED WITH IS THAT AUDI HAD ISSUED A TSB ON THIS ENGINE EXPLAINING THAT THE CHECK VALVE AND OIL SCREEN COULD GET CLOGGED AND STARVE THE TURBOS OF LUBRICATION. I WAS ALSO SCARED WHEN I BROKE DOWNWHEN I EXITED THE FREEWAY. I COULD HAVE VERY EASILY GOT IN A WRECK BECAUSE I HAD TO KEEP THE THROTTLE SO HIGH SO THE ENGINE WOULDN'T DIE. IT WAS A DANGEROUS SEVERAL MINUTES FOR ME AND LUCKILY I WAS IN A AREA THAT I COULD GET TO A VACANT PARKING LOT WITH CROSSING TOO MUCH TRAFFIC. MY CAR HAD 67065 MILES ON IT WHEN I HAD IT TOWED TO THE DEALERSHIP.",
        "vin": "WAUR2AFD8DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396241,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TRAVELING 4 HOURS FROM SAVANNAH, GA TO ATLANTA, GA; I PROCEEDED TO GET OFF THE INTERSTATE ON EXIT 228. UPON GETTING OFF THE EXIT, THE CAR SHUT OFF WITHOUT WARNING. THE COMPUTER ADVISED TO RESTART THE ENGINE, HOWEVER THE CAR WOULD NO LONGER START. AFTER SEVERAL ATTEMPTS, I CALLED TO HAVE THE CAR TOWED AS I WAS IN THE MIDDLE OF A BUSY EXIT AND COULD NOT MOVE THE CAR, WHICH WAS A VERY DANGEROUS SITUATION. AT THE DEALERSHIP, I WAS ADVISED THAT BOTH TURBOS ON THE ENGINE HAD GONE BAD. HOW COULD THIS BE, THE CAR ONLY HAS 38,542 MILES ON IT. THIS SITUATION COULD HAVE BEEN A LOT WORSE THAN IT WAS HAD THE CAR DECIDED TO STALL & SHUT OFF WHILE STILL TRAVELING ON A BUSY TRAFFIC ON I75.",
        "vin": "WAUA2AFD1DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387166,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND NOTICED THE CAR WAS IDLING RUFF. SO I PUT THE CAR IN NEUTRAL AND IT STALLED THEN I RESTARTED IT THEN NOTICED MASSIVE POWER LOSS. SO I DROVE HOME AND CALLED FOR A TOW TO THE NEAREST DEALER AND THEY TOLD ME THE CAR HAD TWO BLOWN TURBOS AND ITS GOING TO COST ME $10.000.00. AND MY WARRANTY WON'T COVER IT BECAUSE ITS ON THE TECHNICAL SERVICE BULLETIN BOARD AND AUDI SHOULD HAVE TO TAKE CARE OF THERE OWN PROBLEMS KNOWING ITS AN ISSUE. AND I ABSOLUTELY FEEL THE SAME ESPECIALLY FOR HOW MUCH YOU SPEND ON THIS CAR AND AUDI'S REPUTATION. IF THEY DON'T EVER RECALL THIS ISSUE I WILL NEVER BUY ANOTHER AUDI AGAIN, AND I WAS JUST TRYING TO GET MY MOTHER TO BUY ONE.",
        "vin": "WAUR2AFD0DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354242,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A8.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V397000 (STRUCTURE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. FATHERS & SONS-AUDI WEST SPRINGFIELD (434 MEMORIAL AVE, WEST SPRINGFIELD, MA 01089) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUA2AFD6DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342497,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-20 IN TEXAS THE EPC LIGHT CAME ON, ENGINE POWER DECREASED NOTICEABLY.  LIMPED OFF I-20 TO AN EXIT. WHEN I STOPPED AT THE STOPLIGHT AT END OF RAMP, ENGINE QUIT.   I TRIED SEVERAL TIMES TO RESTART. NOTHING BUT SPUTTERING.  FORTUNATELY, I FOUND THAT SLIGHT PRESSURE ON THE ACCELERATOR WHILE CRANKING WOULD START ENGINE.   ENGINE WOULD NOT RUN BELOW 1000 RPM.   VERY DANGEROUS HAVING TO KEEP ENGINE RUNNING WHILE NAVIGATING CITY STREETS.    THIS ENGINE HAS HAD A SERIES OF RECALLS, INCLUDING AN OIL SEPARATOR FAILURE.  AUDI TSB, ATTACHED, FINDS AN OIL SIEVE RESPONSIBLE FOR STARVING THE TURBOCHARGERS CAUSING MY VEHICLE TO FAIL WITHOUT WARNING ON THE FREEWAY AT 62,000 MILES.  I HAVE KEPT THE FAILED PARTS INCLUDING BOTH TURBOCHARGERS, ONE WOBBLING AND THE OTHER COMPLETELY SEPARATED ON THE EXHAUST SIDE.    THIS IS A CLEAR DANGER TO VEHICLE AND OCCUPANTS.  THIS VERY EXPENSIVE REPAIR WARRANTS A NHTSA RECALL.",
        "vin": "WAUR2AFD4DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHLICE WAS IN MOTION APPROACHING A STOP LIGHT. THE VEHICLE STALLED AND I LOST THE ABILITY TO STEER AND BRAKE PRESSUE WAS LOST. FORTUNATELY, I WAS GOING SLOW ENOUGH TO ENGAGE THE ELECTRONIC PARKING BRAKE TO BRING THE CAR TO THE STOP. THE CAR THEN WOULD NOT RESTART WITHOUT GIVING IT HARD GAS. IT WOULD DIE WITHIN A MINUTE OR TWO. AFTER TOWING TO THE DEALERSHIP, I WAS TOLD BOTH MY TURBOS HAD FAILED AND WOULD NEED TO BE REPLACED. MY CAR ONLY HAS 52,000 MILES. THIS IS A MAJOR FAILURE FOR A VEHICLE WITH SO FEW MILES. IN ADDITION, AUDI HAS ISSUED A TSB ACKNLOWLEDGING THE ISSUE. I AM JUST FORTUNATE IT HAPPENED FOR ME AT SUCH LOW SPEEDS. I CAN'T IMAGINE BEING ON THE HIGHWAY WHEN THIS HAPPENED.",
        "vin": "WAUR2AFD5DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338981,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A STRONG GAS SMELL. I CHECKED INTERNET AND READ, 2013 AUDI A8 (VOLKSWAGEN) IS RECALLING CERTAIN 2013-2015 AUDI S8 AND A8 VEHICLES. THE FUEL SUPPLY LINE FOR THE HIGH PRESSURE FUEL PUMP MAY BECOME POROUS OVER TIME, RESULTING IN A FUEL LEAK. IT COULD CAUSE FIRE. ACTION NEED TO FIX IT: AUDI WILL NOTIFY OWNERS, AND DEALERS WILL REPLACE THE FUEL LINE, FREE OF CHARGE. WHEN I NOTIFIED FLOW AUDI IN GREENSBORO, NC, THEY SAID THEY WOULD NOT FIX IT. THEY TOLD ME TO CONTACT AUDI AMERICA. WHAT DO I DO?",
        "vin": "WAURGAFD6DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT CAME ON AND I DROVE A VERY SHORT DISTANCE TO RETURN HOME DURING WHICH ODD NOISE CAME FROM THE ENGINE.  DIAGNOSTICS SHOW THAT ONE OF TWO TURBOS FAILED DUE A FAILURE OF THE LUBRICATION SYSTEM FOR THE TURBOS.",
        "vin": "WAUR2AFDXDN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321688,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2X TURBO DAMAGE 66000KILOMETERS",
        "vin": "WAUZZZ4H7EN"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "03/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY, THE VEHICLE EPC LIGHT CAME ON. VEHICLE BEGAN TO RUN ROUGH, AND SHORTLY AFTER DIED OUT COMPLETELY. LUCKILY THERE WAS NO ONE BEHIND ME WHEN THE CAR DIED, AND THAT I WAS IN THE RIGHT LANE AND WAS ABLE TO LIMP ONTO THE SHOULDER. WAITED FOR TOW TRUCK. HAD CAR TOWED TO DEALER WHERE A FAULTY TURBOCHARGER WAS DIAGNOSED AS THE REASON FOR VEHICLE BREAKING DOWN",
        "vin": "WAUR2AFDXDN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246579,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAILING MY WIFE AND CHILDREN HOME ONE EVENING WHEN THE CAR BEGAN TO STALL ON HER AT AN INTERSECTION. I SIGNALED FOR HER TO PULL INTO A NEARBY GAS STATION SO I COULD TAKE A CLOSER LOOK AT THE CAR. AS THE IDLING GOT ROUGHER, IT FINALLY STALLED OUT COMPLETELY AND WOULD NOT RESTART. WE HAD IT TOWED TO A LOCAL DEALER, WHERE THEY INCORRECTLY DIAGNOSED THE CAR AND SAID IT NEEDED A CRANKCASE VENTILATION VALVE. I WAS CALLED AND TOLD THAT THE CAR HAD BEEN REPAIRED $3,500 LATER. WHEN I ARRIVED, THE CAR STILL HAD THE SAME SYMPTOMS. I REFUSED TO DRIVE THE CAR HOME IN THE CURRENT CONDITION EVEN THOUGH AUDI SAID THE CAR WAS SAFE TO DRIVE. THEY REDIAGNOSED THE CAR AND SAID THE TURBOS WERE GOING OUT AND NEEDED TO BE REPLACED. CLEARLY, THIS IS A MANUFACTURER'S DEFECT THAT'S EVENTUALLY GOING TO GET SOMEONE KILLED OR SERIOUSLY INJURIED. BECAUSE THESE PARTS FAIL WITHOUT WARNING AND AUDI IS PUTTING A PATCH ON THEM TELLING AND CUSTOMERS THAT THE CARS ARE SAFE TO DRIVE IS IRRESPONSIBLE, EXTREMELY DANGEROUS, AND NEED TO BE ADDRESSED IMMEDIATELY!",
        "vin": "WAUR2AFD0DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234714,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WITH MY 3 KIDS ON THE HIGHWAY, THE CAR LOST POWER AND STALLED. WOULDN'T START. AFTER RESEARCH, FOUND OUT I WAS THE NEXT IN A LONG LINE OF FOLKS WITH A 4.0T ENGINE TURBO FAILURE. AUDI HAS A TSB HTTPS://STATIC.NHTSA.GOV/ODI/TSBS/2018/MC-10153123-9999.PDF  BUT THE ISSUE STEMS FROM FAULTY ENGINEERING OF AN OIL STRAINER. CAR HAS FULL DEALER MAINTAINED SERVICE RECORDS.     BOUGHT THE CAR USED FROM A DEALER. FAILED LESS THAN 500 MILES AFTER PURCHASE. MILEAGE IS 82000. PLEASE HELP HOLD AUDI ACCOUNTABLE FOR A KNOWN SAFETY ISSUE AFFECTING ALL CARS WITH THE 4.0T.",
        "vin": "WAUR2AFD1DN"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229714,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION FAILS DURING DRIVING AT HIGH SPEEDS.",
        "vin": "WAURGAFD4DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217604,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PULLING OFF OF THE PA TURNPIKE THE IDLE BECAME ROUGH AND THE CAR CUT OFF AND WOULDN'T START. HAD IT TOWED TO READING(PA) AUDI AND THE DIAGNOSIS WAS FAILED TURBOS.",
        "vin": "WAUA2AFD6DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197149,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE EXPERIENCED CATASTROPHIC FAILURE RELATED TO THE FOLLOWING AUDI TSB & NHTSA DOCUMENTED BULLETINS AND COMPLAINTS:    NHTSA 1-888-327-4236  NHTSA ID 10118418  TSB ID A211724 2044640 & TSB 2040644/10 FOR REPLACEMENT OF THE OIL SEPARATOR -   $254 (WITH FREE SHIPPING) FROM AUDIUSAPARTS.COM. YOU WILL WANT PART NUMBER 079-103-542-E.    AMIDST THE NUMEROUS COMPLAINTS FROM OTHER AUDI OWNERS THE DEALER IS UNWILLING TO BE ACCOUNTABLE FOR THE DAMAGES NOR WILLING TO PERFORM THE NEEDED REPAIRS WHEN THE VEHICLE IS UNDER FACTORY WARRANTY. THIS PLACES THE BURDEN ON THE VEHICLE OWNER (EXCESS OF $11,000 OF REPAIRS) TO EXPERIENCE THE FAILURE AND BE PLACED IN HARMS WAY WHEREVER THE VEHICLE SHOULD BE AT THAT TIME. MY VEHICLE AT THIS TIME WAS IN MOTION IN CITY DRIVING FORCING ME TO PULL OVER UNEXPECTEDLY OFF THE ROAD.    I AM ASKING TO TO HOLD AUDI OF AMERICA ACCOUNTABLE FOR THIS KNOWN DOCUMENTED ISSUE AND MAKE REPAIRS PRIOR TO THE FAILURE FIRSTLY AND SECONDLY COVERING THE EXPENSES RELATED TO THE FAILURE FOR MY VEHICLE AFTER THE VEHICLE IS OUT OF WARRANTY FOR FAILURE TO DO SO INITIALLY.",
        "vin": "WAUR2AFD8DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191025,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK FROM WINDSHIELD. TECHNICIAN NOTED LEAK FROM WINDSHIELD SEALANT. EVERY TIME IT WOULD RAIN PASSENGER SIDE WOULD GET FLOODED WITH WATER FROM LEAK CLEARLY A MANUFACTURE PROBLEM FROM THE SEALANT.",
        "vin": "WAURGAFDXDN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182890,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 69946 MILES IT STARTED LEAKING WATER WHEN RAINING FROM TOP OF WINDSHIELD IN THE MIDDLE BY THE REAR VIEW MIRROR,ON TOP OF ALL ELECTRONIC COMPONENTS.FROM THAT INCIDENT CAR IS NOT RUNNING,BECAUSE WATER GOT ON TO ALL KIND OF ELECTRONICS THAT CONTROL ENGINE,TRANSMISSION,RADIO.......WHEN I DID RESEARCH,FIND OUT THAT ITS KNOW PROBLEM WITH THOSE VEHICLES AND IM NOT THE FIRST ONE WITH THIS PROBLEM",
        "vin": "WAUR2AFD0DN"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166305,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLING OF ENGINE COOLANT. AFTER DRIVING FOR AN HOUR, YOU CAN SEE STEAM COMING FROM THE HOOD BUT NO LEAK.",
        "vin": "WAUR2AFD7DN"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152418,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT SPEED LIMIT ON US HIGHWAY IN HEAVY TRAFFIC IN THE NEAR NORTHERN SUBURBS OF CHICAGO, EXPERIENCED SUDDEN LOSS OF POWER. VEHICLE BEGAN RUNNING VERY ROUGH AND EVENTUALLY STALLED IN LEFT LANE.  SUDDEN LACK OF POWER, STALL AND UNANTICIPATED LOSS OF SPEED NEARLY CAUSED ACCIDENT AND DID CAUSE MAJOR TRAFFIC BACK UP.  VEHICLE WAS TOWED TO LOCAL SHOP.  DIAGNOSIS DETERMINED CAUSE OF SUDDEN POWER LOSS WAS DAMAGED TURBOCHARGERS (X2).  TURBO IMPELLER BEARINGS WERE COMPLETELY DESTROYED DUE TO LUBRICATION STARVATION, WHICH CAUSED DISINTEGRATION OF TURBOCHARGER IMPELLERS.  SHOP INDICATED THIS IS A KNOWN PROBLEM WITH THE AUDI (VAG) 4.0 TWIN TURBO V-8 ENGINES.  SUPPORTING THIS NOTION, THE DEALER HAD THE TURBOS AND ASSOCIATED REPAIR PARTS IN STOCK (OVER $6,000 OF PARTS).  VEHICLE IS METICULOUSLY MAINTAINED BY CERTIFIED AUDI DEALER.  VEHICLE INDICATED ABOUT 63,000 MILES ON ODOMETER AT TIME OF INCIDENT.    VAG USES THIS ENGINE IN SEVERAL MODELS ACROSS THE AUDI LINE: S6, S7, RS7, A8, AND S8 (SOME MODIFICATIONS BETWEEN SOME MODELS).",
        "vin": "WAUR2AFD4DN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000234,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A8. WHILE DRIVING APPROXIMATELY 70 MPH, A LOUD BOOMING NOISE WAS HEARD AND THE GLASS SUN ROOF SUDDENLY SHATTERED. THE SUN ROOF WAS CLOSED AT THE TIME OF THE FAILURE. THE VEHICLE WAS TAKEN TO AUDI OF LAFAYETTE LOCATED IN LAFAYETTE, LOUISIANA. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V448000 (VISIBILITY). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604770,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEPRESSING ACCELERATOR AT FIRST FAILED TO MOVE THE CAR; THEN IT SURGED UNTIL BRAKED; THEN IT FAILED TO MOVE THE CAR ON THE NEXT DEPRESSION; AGAIN FOLLOWED BY A SURGE. THIS HAPPENED AS I WAS TURNING INTO A LANE OF ONCOMING CARS WHERE I HAD PLENTY OF TIME TO MAKE THE TURN SAFELY BUT THAT TIME WAS CHEWED UP TRYING TO GET THE CAR MOVING.     THE EXACT SAME THING HAPPENED AGAIN EXCEPT THIS TIME I EXPECTED NON-PERFORMANCE AND WAITED 2 OR 3 MINUTES FOR ALL TRAFFIC TO STOP AT A LIGHT. THEN THE SAME THING HAPPENED AGAIN.    THERE IS NO DOUBT THIS COULD LEAD TO A FATAL CRASH.  *TR",
        "vin": "VIN WAURGAF"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/08/2013",
        "dateOfIncident": "03/09/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507526,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A8L. THE CONTACT STATED THE BRAKE PEDAL WAS INSTALLED TOO CLOSE TO THE SIDE WALL ON THE FLOOR BOARD. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO STATED THAT WAS A MANUFACTURER DESIGN WITH THE BRAKE PEDAL INSTALLATION. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 300....UPDATED 05/08/13 *BF     THE CONSUMER STATED AFTER FURTHER INVESTIGATION WITH THE DEALER, IT WAS DETERMINED THAT THE SPACING BETWEEN THE BRAKE PEDAL AND THE FOOTWELL SIDE WALL WAS DIFFERENT BETWEEN 2011 AND 2013 MODEL YEARS. THE LOSS OF 3/4 OF AN INCH IS WAT IS CAUSING THE FAILURE.  UPDATED 05/30/2013 *JS",
        "vin": "WAURGAFD5DN"
    }
]