[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "August of 2021. It was raining out and I drove through a puddle and my electric steering shut down. This has been a known defect for at least 10 years with Audi and NHTSA has done NOTHING about it.",
        "vin": "wauffafl7dn"
    },
    {
        "components": "STEERING,ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436916,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 Audi A4 with a 2.0 turbo engine approximately 62.5K miles and up to date with all services.   I was driving on the highway at highway speeds when the engine suddenly started to misfire with a partial loss of power making the car difficult to steer.  At that time the check engine light was not illuminated.  I was able to get off the highway and drive home about 2 miles away from when the misfires first occurred.  The police did not get involved as I was able to return home.  The following week the car was towed to my mechanic where it was diagnosed that cylinder 3 had a problem. At that time the check engine light illuminated.  He recommended that I tow my car to the Audi dealership as they have better availability of parts.  The dealer took apart the engine and diagnosed a broken piston ring which destroyed many other parts of the engine. The engine had to be replaced with a new one from the factory.   Audi should be held accountable for catastrophic engine failures that may result in injury to others due to poor engine design.",
        "vin": "WAUDFAFLXDA"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11434947,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Two of my four kids were in the rear seat. My 7 year old panicked because her seatbelt came unbuckled and she couldn’t get it back. My initial reaction was to hit the breaks and slow down. My daughter was ejected from her seat into the passenger seat head first and then landed on the floor with her booster seat on top of her. I pulled over and checked the seat belt and it would not latch. I had to drive her home unrestrained!! A few days later, different child experienced a similar situation with the middle seat. This is a concern because if the seatbelts failed during a car accident, my children’s lives were at risk. Repeated risk of the lives of children by ignoring this common issue. How many lives will it take to be protected? Minus the fear of being unable to afford repairs, or to get the vehicle in to the repair shop? As this has happened to 2/5 buckles in a matter of days, how do I know all of the buckles are not defective? Why are we repeatedly waiting for the tally marks on lives lost before we protect our children? When is it worth a single life EVEN HARMED because the life saving device has failed to keep us safe? Our family is so strict about seatbelt safety, how can this even be a gamble that anyone is willing to take? Furthermore, how do I explain to my children that this “very important” seatbelt that I check every time they kids get into a vehicle.. how am I supposed to explain that this very important piece of equipment may or may not be there when you need it and they still must wear it?I have read hundreds of forums reporting the same failures in both Audi and VW. I have contacted Audi Denver and am waiting on a quote. I am a nurse and my husband is unemployed due to the economy downturn. We are financially stretched to our absolute limits, raising children and we will not have the means to fix the failed seat belt buckles. Any safety failure like this or with airbags should be 100% under manufacturers warranty for the LIFE of the vehicle.",
        "vin": "WAUBFAFL7DA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423863,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Coolent migration from the coolant valve through the wire into the connection to ecu. This caused corrosion which in turn caused an unsafe driving condition by shutting the throttle pedal control to the engine off. This has been recalled on many other models and is quite prevalent in the a4 with manual transmission as mine is.",
        "vin": "WAUHFAFL1DN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423636,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Audi A4  The contact stated that while driving between 50-60m mph when driving in the dark on an unfamiliar road when they missed a turn and ended up crashing into a pole on the side of the road. As a result, the vehicle flipped few times. The vehicle ended up coming to a stop. No airbags deployed. A police report was filed. The vehicle was towed but had not been deemed totaled officially as of yet. The contact stated that the vehicle suffered severe damage. There were no injuries. The vehicle had not been diagnosed or repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 50, 000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396136,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL RANDOMLY LOCKED WHILE THE CAR WAS IN MOTION. THE CAR WAS ALMOST INOPERABLE. IT WAS EXTREMELY DANGEROUS AND IS ALSO A SAFETY HAZARD. THERE HAVE BEEN SEVERAL COMPLAINTS, BUT NO RECALL FROM AUDI. IT NEEDS TO ADDRESSED AND FIXED. LIVES ARE AT RISK.",
        "vin": "WAUFFAFL4DN"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362244,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ON OR OFF THE HIGHWAY STEERING STIFFENS MAKING IT HARD OR IMPOSSIBLE TO MAKE TURNS. IT IS A SCARY SITUATION, WHICH FORCED ME TO PULL OVER ON THE HIGHWAY ONCE- I WAS NOT ABLE TO SWITCH LANES DUE TO THE HARDNESS OF THE STEERING WHEEL. THIS OCCURS RANDOMLY, AT ANYTIME OR SPEED, EVEN AT SLOW SPEEDS WHILE DRIVING IN THE NEIGHBORHOOD. IT OCCURS TO EITHER SIDE, SOMETIMES ONE SIDE OF THE WHEEL OR BOTH SIDES.",
        "vin": "WAUFFAFL3DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341701,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED LOSING POWER WHEN STEPPING ON THE GAS TO GO FASTER OR UP A RAMP OR MERGING INTO THE FREEWAY. I TOOK MY CAR TO THE MECHANIC I TRUST. HE CHECKED MY CAR AND STATED IT IS LOSING POWER IN THE FOURTH CYLINDER.  HE DID THE SPARK PLUGS AND OTHER TESTS, I'M NOT GOOD REMEMBERING THE NAMES. STATES HE WOULD NEED TO DO A REBUILD OR REPLACEMENT OF THE ENGINE.  THE CAR HAS ONLY 87,000 MILES. DOENT MAKE ANY SENSE.",
        "vin": "WAUEFAFL6DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323093,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED THE CAR APRIL 13, 2020. STRONG GASOLINE SMELL EMITTING FROM FRONT END OF VEHICLE AND IN CABIN. SEEMS TO BE COMING FROM THE DRIVER SIDE OF CAR. DOES NOT HAPPEN ALL THE TIME. DOES NOT MATTER IF THE GAS TANK IS FULL, HALF, OR EMPTY. CAN'T FIND ANY LEAKS UNDER THE HOOD, BUT STILL HAS A VERY STRONG SMELL OF GASOLINE.",
        "vin": "WAUBFAFL8DN"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319206,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN BURNING THROUGH OIL. IT HAS BEEN REQUESTING A QUART OF OIL BE ADDED JUST ABOUT EVERY 500-700 MILES. ABOUT A YEAR AGO THE PROBLEM STARTED IN EARLY 2019 AND AT FIRST IT WAS JUST EVERY 1200-900 MILES THAT THE CAR WOULD ASK FOR AN EXTRA QUART OF OIL. THEN IN THE PAST 6 MONTHS IT HAS GOTTEN WORSE ASKING FOR A QUART OF OIL EVERY 500-700 MILES; THIS IS ALL IN ADDITION TO THE REGULARLY SCHEDULE OIL CHANGES.",
        "vin": "WAUFFAFL4DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317151,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR RECENTLY STARTED FEELING STIFF WHILE TAKING TURNS AND IT LOOKS AS IT'S BEEN AN ONGOING REPORTED ISSUE.  NOTHING THAT HAS BEEN RECALLED IN THE PAST HOWEVER MOST REPORTS ARE OF PEOPLE \"FIXING\" THE PROBLEM ONLY FOR IT TO CONTINOUSLY COME BACK.",
        "vin": "WAUFFAFL3DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL BECAME DIFFICULT TO MAKE  TURNS.",
        "vin": "WAUFFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306560,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY 2013 AUDI A4 IN 2017 AND SIMILAR TO ALL THE OTHER COMPLAINTS THE STEERING SEIZED SPORADICLY INDICATING IT WAS UNSAFE TO DRIVE ETC.. THE CAR WAS TOWED AND I AFTER A COUPLE WEEKS THE PROBLEM WAS THAT THE POWER STEERING MODULE WAS DEFECTIVE. I HAD A NEW ONE INSTALLED AT THE COST OF 2500$ (THE DEALER WANTED TO CHARGE 4000$!) . THE CAR WAS RUNNING SMOOTHLY UNTIL RECENTLY (IT ALWAYS SEEMS TO BE IN THE WINTER WHEN IT BECOMES MILD) THE STEERING HAS BEGUN TO STICK ONCE AGAIN AND ITS ONLY A MATTER OF TIME BEFORE MY DASH LIGHTS UP NOTIFYING ME THE CAR CANT BE DRIVEN. THIS IS CLEARLY A PROBLEM AS THERE ARE HUNDREDS OF COMPLAINTS FOR THE SAME ISSUE. PLEASE FIX IT!",
        "vin": "WAUFFCFL7DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288494,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING 65 MPH, A STRONG ODOR OF FUEL WAS PRESENT INSIDE THE VEHICLE. THE FOLLOWING DAY, THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE FUEL TANK WAS LEAKING UNDER THE REAR SEAT. THE VEHICLE WAS TAKEN TO AUDI DOMINION (21105 IH-10 W, SAN ANTONIO, TX 78257) WHERE IT WAS DETERMINED THAT THE FUEL TANK WAS LEAKING AND NEEDED TO BE RESEALED. THE VEHICLE WAS REPAIRED UNDER WARRANTY, BUT THE REAR SEAT WAS SEVERELY DAMAGED; WHICH WAS NOT COVERED UNDER WARRANTY. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 101,000.",
        "vin": "WAUFFAFL3DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283102,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED TO SMELL LIKE GAS INSIDE, AND IT WAS A VERY STRONG ODOR. I WENT TO AN AUOZONE TO GET A DIAGNOSTIC, IN THE SYSTEM IT HAD SAID IT WAS A VERY SMALL GAS LEAK AND THAT IT WOULD HAVE BEEN OKAY TO DRIVE. I KEPT DRIVING AND IT STILL SMELLED LIKE GASOLINE AND STRONGER EACH TIME. THEREFORE, I TOOK IT TO THE MECHANIC THE NEXT DAY DRIVING IT, AND UNDER THE BACK SEATS WAS FILLED WITH GASOLINE. THE MECHANIC STILL CANT FIND THE LEAK. HOWEVER, IF I WOULD HAVE KEPT DRIVING IT, THE CAR COULD HAVE EXPLODED ON ME.",
        "vin": "WAUFFAFL3DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281409,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING SEIZED WITHOUT WARNING INTERMITTENTLY. THE CONTACT TOOK THE VEHICLE TO AUDI INDIANAPOLIS (4610-B E 96TH ST, INDIANAPOLIS, IN 46240, (317) 853-4582) WHERE THE INTERMEDIATE STEERING SHAFT WAS REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "WAUFFAFL8DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278436,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING 5 MPH, THE FRONT PASSENGER TIRE STRUCK A CURB AND THE \"STEERING WHEEL DEFECTIVE DON'T DRIVE\" WARNING INDICATOR ILLUMINATED. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TOWED TO AUDI SAN FRANCISCO (1525 HOWARD ST, SAN FRANCISCO, CA 94103, (888) 779-0546) WHERE IT WAS DIAGNOSED THAT THE STEERING MECHANISM WAS DEFECTIVE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "WAUBFAFL9DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278332,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING 25 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN LEFT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT PARKED THE VEHICLE ON THE SIDE OF THE ROAD FOR TEN MINUTES. ONCE SHE CONTINUED DRIVING, THE FAILURE RECURRED. THE CONTACT CALLED VAN HORN VOLKSWAGEN OF SHEBOYGAN (LOCATED AT 5515 RACETRACK RD, SHEBOYGAN, WI 53081, (920) 457-8844) WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "WAUBFAFL8DN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/05/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY, VEHICLE'S RPM WOULD GO UP, BUT VEHICLE WOULD NOT ACCELERATE WITH THE INCREASED ACCELERATION. STRONG SMELL OF BURNT CLUTCH FLUID. AND SOME SMOKE WAS COMING FROM ENGINE BAY. DRIVING VEHICLE HOME, TRANSMISSION SLIPPED IN EVERY GEAR. VEHICLE STRUGGLED TO GET UP TO SPEED AND RPM WOULD RISE AND FALL WITH THE PRESS/DEPRESS OF THE ACCELERATOR PEDAL. VEHICLE HAS 80K MILES, NEVER ABUSED AND HAS ALL RECALLS COMPLETED.",
        "vin": "WAUHFAFL1DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253286,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE AT 39,600 MILES. HAD AN OIL CHANGE PERFORMED AT 37,000 MILES. CAR THREW ROD INTO ENGINE BLOCK RESULTING IN TOTAL ENGINE FAILURE. REMEDY IS A NEW ENGINE VALUED ROUGHLY AT $4,000 AND LABOR VALUED AT $4,000 BEFORE TAXES. CAUSE OF FAILURE HAS BEEN UNABLE TO BE DETERMINED BY AUDI BUT THERE WAS SUFFICIENT OIL. VEHICLE WAS TRAVELING STRAIGHT AT 65 MPH ON THE FREEWAY AT TIME OF INCIDENT.",
        "vin": "WAUFFAFL1DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234299,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEELS PRESENT TEMPORARY PROBLEMS SINCE THE CAR WAS NEW, SHOWING NOISES (LIKE A PRESSURE VALVE AIR LEAKING), AND CHANGE IN RESISTANCE TO STEERING THE VEHICLE. I'VE ASKED THE DEALER TO CHECK IT SOMETIMES, BUT THEY COULD NOT REPRODUCE THE PROBLEM. LAST SUNDAY, JULY 21, 2019, AFTER STOPPING THE CAR, THE STEERING WHEEL LOST ALL POWER, STOP WORKING, AND SEND A MESSAGE NOT TO DRIVE THE VEHICLE. I TOW IT TO A DEALER WHICH RECOMMEND CHANGE THE STEERING RACK AND MADE ALIGNMENT ($2900). THE CAR IS IN THE DEALER RIGHT NOW.  READING THIS SITE, I REALIZE IT MAY BE A MORE GENERIC PROBLEM, WITH SERIOUS SAFETY IMPLICATION,  ON THIS PARTICULAR MODEL OF AUDI. I HAVE TO SYA THAT OTHERWISE IT IS AN EXCELLENT CAR.",
        "vin": "WAUFFAFLXDN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232160,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON. CAR STOPPED RUNNING--WAS UNABLE TO START IT. AUDI DEALERSHIP SERVICE IDENTIFIED IT TIMING TENSIONER FAILURE AT JUST 70000 MILES. REPAIR COST ESTIMATED AT $3100. RECENT CLASS ACTION SETTLEMENT IDENTIFIES THIS AS A CONSISTENT PROBLEM WITH AUDI/VW BUT DOES NOT INCLUDE MY VIN. HOWEVER, THIS IS IDENTICAL ISSUE AS OTHER AUDI UNDER RECALL",
        "vin": "WAUFFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220191,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE THE VEHICLE WAS PARKED, THE STEERING WHEEL SEIZED AND WAS DIFFICULT TO TURN. IN ADDITION, \"DO NOT DRIVE THE VEHICLE, STEERING WHEEL FAILURE\" APPEARED ON THE INSTRUMENT PANEL. THE VEHICLE WAS UNABLE TO BE DRIVEN. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE CONTACT CALLED AUDI WEST HOUSTON (LOCATED AT 15865 KATY FWY, HOUSTON, TX 77094, (855) 627-2941) AND INFORMED THEM OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "WAUEFAFL5DA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219494,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE AS AT A STOP OR MOVING FORWARD VERY SLOWLY AND THE GAS PEDAL (ACCELERATOR) IS DEPRESSED THE TRANSMISSION (WHICH IS IN DRIVE) DOES NOT ENGAGE - THE ENGINE WILL SIMPLY REV AND THE VEHICLE WILL NOT MOVE FORWARD FOR SEVERAL SECONDS. THE TRANSMISSION WILL ULTIMATELY ENGAGE WITH A RATHER SEVERE JOLT. THIS PRESENTS A SUBSTANTIAL SAFETY ISSUE, AS THE CAR WILL NOT ACCELERATE UPON COMMAND. ON MORE THAN ONE OCCASION THIS HAS PUT ME IN A VERY DANGEROUS SITUATION. IN ONE INSTANCE, A CAR WAS STALLED AHEAD OF ME ON A VERY BUSY FREEWAY.  I STOPPED MY CAR ABOUT 15 FEET BEHIND THE STALLED VEHICLE. IT WAS IMPERATIVE THAT I BE ABLE TO TURN INTO THE ADJOINING LANE AND BE ABLE TO ACCELERATE QUICKLY WHILE DOING SO, AS TRAFFIC IN THAT LANE WAS BUSY AND MOVING AT A HIGH RATE OF SPEED. WHEN I DEPRESSED THE ACCELERATOR THE CONDITION I DESCRIBED OCCURRED AND I WAS FRANKLY LUCKY TO AVOID A SERIOUS ACCIDENT.    THE ON-BOARD COMPUTER DOES NOT INDICATE ANY MALFUNCTION, AND THE DEALER ASSURES ME THAT THIS IS A NORMAL OPERATING FEATURE OF THIS AUTO.",
        "vin": "WAUAFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210187,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GETS STIFF AND ALMOST IMPOSSIBLE TO TURN. THE ISSUE HAPPENS SPORADICALLY WHILE DRIVING AT ANY TIME. IT'S BEEN EXTREMELY DANGEROUS.",
        "vin": "WAUFFAFL6DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208214,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 AUDI A4 QUATTRO WITH APPROX. 61K MILES - THE STEERING WHEEL HAS STARTED TO OFFER INCONSISTENT RESISTANCE TO DRIVER INPUT. THE STEERING WHEEL APPEARS TO INTERMITTENTLY LOSE THE ELECTRIC POWER ASSIST WHICH IMPACTS DRIVERS ABILITY TO JUDGE THE AMOUNT OF FORCE IT WOULD TAKE TO MAKE A TURN OR CHANGE A LANE.     ISSUE OCCURS INTERMITTENTLY AT VARIOUS SPEEDS INCLUDING THE VEHICLE BEING STATIONARY. WHILE ROTATING THE WHEEL, IT FEELS LIKE THE STEERING HAS HIT A DEAD END AFTER TURNING A MERE 20 DEGREES, UPON ADDITIONAL FORCE THE STEERING WHEEL WILL ROTATE FURTHER. THIS BEHAVIOR IS INTERMITTENT WHICH MAKES IT HARD TO DRIVE THE CAR SAFELY THROUGH TURNS AND AT HIGH SPEEDS.",
        "vin": "WAUBFAFL6DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PRESTIGE NEWPORT (9201 WEST COLFAX, LAKEWOOD, CO 80215, (303) 238-8101) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THE PART WAS NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUFFAFL0DN"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM: A CLICKING OR CLACKING NOISE MAY EMANATE FROM THE FRONT WHEEL BEARINGS DUE TO A LACK OF WHEEL-BEARING LUBRICANT ON THE BEARING HOUSING ASSEMBLY.    VEHICLES AFFECTED BY SERVICE BULLETIN:    2008 AUDI A4  2009 AUDI A4  2010 AUDI A4  2011 AUDI A4  2012 AUDI A4  2013 AUDI A4  2014 AUDI A4    AUDI DOES HAVE A SAFETY ISSUE ON FRONT WHEEL BEARING AFFECTED 2008-2017 AUDI. I CALL THE DEALER AND THEY SAID NO RECALL.  I DO EXPERIENCED THE NOISE/ VIBRATION ASSOCIATED WITH WHEEL BEARING",
        "vin": "WAUHFAFL0DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195827,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI HAWTHORNE (LOCATED AT 151 SAW MILL RIVER RD, HAWTHORNE, NY 10532, (914) 747-1077) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUBFAFL6DN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193795,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EPC LIGHT ILLUMINATED, ROUGH IDLING, LOSS OF POWER, CAR WILL NOT TURN ON. 2017 IT DID THE SAME THING, FOUND ELECTRICAL FAULT NEAR GAS TANK (COULD HAVE BLOWN UP). AUDI FIX AT GOODWILL. COMPRESSION OF ENGINE WAS NEVER CHECKED. 2019 SAME THINGS HAPPENING, ENGINE LOST COMPRESSION IN 2 CYLINDERS. ALL SERVICES DONE AT AUDI. TOLD NEW ENGINE $10K-13K AND THEY WILL NOT HELP COVER COSTS. ONLY 60'000 MILES DONE ON THE CAR AND NO OVERHEATING ISSUES EVER.",
        "vin": "WAUFFAFL0DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187388,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 AUDI A4, I LOVE MY CAR, BUT AT 39K MILES I STARTED HAVING ISSUES WITH MY STEERING. THE PROBLEM IS INTERMITTENT, IN THE BEGINNING I FELT LIKE AT TIMES THE STEERING WAS JUST VERY HARD TO TURN, NOW IT IS DOING IT MORE AND MORE OFTEN AND THE STEERING WHEEL DOES NOT COME BACK ON ITS OWN ONCE YOU TURN A 90 DEGREE TURN. PLUS THE WHEEL GETS EXTREMELY HARD TO TURN WITHOUT WARNING, THIS IS VERY DANGEROUS, AT TIME I HAVE TO USE BOTH HANDS TO REALLY PUT ON THE WHEEL TO MAKE A TURN. I HAVE TAKEN IT TO THE DEALERSHIP AND THEY SAID THAT THEY DO NOT FEEL ANYTHING WRONG WITH THE CAR, THEY STATED THAT THEY PLACED IT ON THE COMPUTER AND THAT NO FAILURE CODES WERE REGISTERED. I HAVE THREE SMALL KIDS, THIS IS A VERY DANGEROUS SITUATION, I CAN'T BELIEVE THAT AUDI DOES NOT HAVE A RECALL ON THIS, WHEN I SEE THAT WERE ARE SO MANY COMPLAINS ON THIS ISSUE. I JUST HOPE THAT THERE WON'T BE A FATAL ACCIDENT BEFORE SOMETHING IS DONE TO ADDRESS THIS ISSUE.",
        "vin": "WAUHFAFL0DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187191,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED ROUGH HALF A DOZEN INTERMITTENT WARNINGS OF A \"DYNAMIC STEERING FAULT. YOU MAY STILL DRIVE THE VEHICLE.\" (YELLOW WARNING SYMBOL) WHILE DRIVING AND MAKING TURNS WHICH LASTED 15 SECONDS, AT MOST BEFORE GOING AWAY. DURING THESE INTERVALS THE STEERING BECAME MILDLY STIFF AND NOTCHY. YESTERDAY I ATTEMPTED TO CRANK THE CAR IN MY DRIVEWAY AND IT WOULDN'T CRANK BUT GAVE ME THE FOLLOWING ERROR, \"STEERING DEFECTIVE! DO NOT DRIVE VEHICLE! NOW THE CAR WON'T START.",
        "vin": "WAUAFAFL8DN"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASE A AUDI A4 2013 IN FEBRUARY OF 2019. STEERING WHEEL IS AN ONGOING ISSUE WITH AUDI ELECTRIC POWER STEERING RACK AND NEEDING IT TO BE REPLACED. ITS DANGEROUS TO DRIVE BECAUSE TURNING TAKES STRENGTH AND A HANDFUL OF EFFORT. IT IS EXTREMELY DANGEROUS TO DRIVE TO THE POINT WHERE I DONT WANT TO RISK MY LIFE DRIVING THE CAR. AFTER RESEARCHING THE \"ELECTRIC POWER STEERING RACK\" ISSUE MULTIPLE PEOPLE HAVE IT. SEARCHING YOUTUBE, AND GOOGLE MULTIPLE OWNERS HAVE THE ISSUE AND AS A RESULT SOME DONT DRIVE OR HAVE TO SPEND AN ENORMOUS AMOUNT OF MONEY TO GET IT FIXED. IT IS AN ISSUE FOR MULTIPLE MODELS THE STIFFNESS OF THE STEERING WHEEL IS SEVERE. NEARLY CRASHED MULTIPLE TIMES DUE TO THE STIFFNESS AND HAD TO REVERT BACK TO MY OLDER CAR. I WANT TO SEE WHETHER THIS IS AN ONGOING ISSUE WITH THE \"ELECTRIC POWER STEERING RACK\" AND WOULD LIKE TO GET A RECALL OR SOMETHING SINCE THIS IS AN ONGOING ISSUE. GOT IT CHECKED BY DEALER AND THEY ALSO SAID THIS IS AN ONGOING ISSUE BUT, THERE IS NO RECALL AS OF NOW.",
        "vin": "WAUBFAFL0DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION ISSUE, THERE IS A CLASS ACTION LAWSUIT ON 2.0 AUDI'S ENGINE THAT COVER 2009 TO 2011, MINE IS A 2013 WITH SAME ISSUE THOUGH. SO OBVIOUSLY ISSUE HAS NOT BEEN RESOLVED IN FURTHER PRODUCTION.  I AM CONSUMING 1.66 QUARTS IN 600 MILES WHICH HAS BEEN DOCUMENTED BY MY LOCAL AUDI DEALER. I WAS TOLD CALL AUDI USA CUSTOMER SUPPORT TO START CLAIM. I DID AND WAS TOLD THEY UNDERSTAND THAT MY CAR HAS AN ISSUE BUT SINCE IT DID NOT FALL IN THE YEARS OF CLASS ACTION LAWSUIT THEY WOULD NOT BE ABLE TO ASSIST IN ANY MATTER. NOW I HAVE DONE MY HOMEWORK AND HAVE FOUND AUDI DOES MAKE EXCEPTIONS BUT WILL DO NOTHING IN MY CASE. UNFORTUNATELY I CAN NOT  UPLOAD DOCUMENTS FROM AUDI BECAUSE IT HAS ALL MY INFORMATION AND VEHICLE IDENTITY. BUT I CAN SAY MY AUDI CASE NUMBER IS [XXX].  SO MAYBE AUDI CAN RESPOND TO MY CLAIM IN THE APPROPRIATE WAY AND EXTEND THEIR HELP TO OTHER VEHICLES WITH THE SAME ENGINE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUFFAFL5DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "YOU KNOW OF THE ISSUE I AM WRITING ABOUT, AS I RECEIVED A LETTER FROM AUDI IN JUNE 2018 TELLING ME ABOUT RECALL 19N4, THE AFTER RUN COOLANT PUMP. THE LETTER SAID TO PARK OUTSIDE, NOT IN A GARAGE, UNTIL FIXED. KIND SCARY. WILL MY CAR BURST INTO FLAMES? AUDI DID NOT HAVE THE PART. I RECEIVED A SECOND LETTER IN SEPTEMBER 2018. STILL NO PART. I RECEIVED A THIRD LETTER IN JANUARY 2019.  IT IS NOW FEBRUARY 2019 AND STILL NO PART (ALTHOUGH IN JANUARY THEY PERFORMED A TEMPORARY FIX RECOMMENDED BY AUDI. I AM WRITING AS I THOUGHT YOU SHOULD KNOW HOW LONG THIS PROCESS IS DRAGGING OUT. IT MUST BE SERIOUS FOR MY ENGINE AS WELL, AS THEY ALSO SAID THEY HAVE EXTENDED THE WARRANTY.",
        "vin": "WAUFFAFL9DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING RANDOMLY BECOMES INOPERABLE LEADING TO HARD STEERING OR WHEELS NOT RETURNING TO CENTER.  FEEL CAN BE NOTCHY WHERE STEERING ASSIST IS INCONSISTENT AS A FUNCTION OF STEERING WHEEL POSITION. ISSUE HAPPENS RANDOMLY WHILE CAR IS IN MOTION AT VARIOUS SPEEDS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170579,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE: 2013 AUDI A4 QUATTRO.  THE STEERING HAS SUDDENLY BECOME VERY STIFF.  STEERING WHEEL WILL NOT RETURN TO CENTER AFTER MAKING A 90 DEGREE TURN ON URBAN STREETS.  I MUST TURN IT BACK MANUALLY.  I HAVE BEEN DRIVING NON-POWER STEERING VEHICLES AND POWER STEERING VEHICLES FOR 60+ YEARS.  THIS IS NOT THE WAY THAT ANY STEERING SYSTEM THAT I HAVE EVER DRIVEN WORKS.  I CONSIDER THIS A VERY SERIOUS SAFETY ISSUE THAT SHOULD WARRANT A RECALL OF ALL AUDI VEHICLES SO AFFECTED.",
        "vin": "WAUBFAFL5DN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140029,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING 45 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO AUDI VALENCIA (23923 CREEKSIDE RD, VALENCIA, CA 91355, (661) 735-1778) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS TOWED TO A TRANSMISSION SHOP AND WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 43,029.",
        "vin": "WAUAFAFL6DN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131950,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE IN APRIL, ANOTHER LETTER IN JUNE, AND A 3RD LETTER IN SEPTEMBER. THIS IS THE AFTER RUN COOLANT PUMP RECALL 19N4.  NO PARTS ARE AVAILABLE AFTER MANY MONTHS, AND AUDI RECOMMENDS THAT CAR BE PARKED OUTSIDE, NOT IN GARAGE. THIS IS UNACCEPTABLE AS WE LIVE IN MASSACHUSETTS AND WINTER IS COMING SOON.",
        "vin": "WAUFFAFL0DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130781,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL BECAME STIFF AFTER 57500 MILES. VERY VERY OCCASIONALLY THE ISSUE GOES AWAY. BUT IT IS PERSISTENT FOR MOST OF THE TIME. DIAGNOSED WITH NO FAULT CODES.  IT IS A NIGHTMARE TO TAKE A RIGHT OR LEFT TURN. I TOOK THE CAR TO AN OUTSIDE TECHNICIAN TWICE BUT BOTH THE TIMES MY CAR DID NOT REPLICATE THE ISSUE. HE DID NOT BELIEVE ME AND THINKS I'M WASTING HIS TIME. THIS IS A VERY SERIOUS ISSUE IF IGNORED. SINCE NO ONE BELIEVES ME, I DO NOT WHAT TO DO. THE ISSUE HAS BECOME WORSE. AUDI NEEDS TO ADDRESS THIS ISSUE AS SAFETY IS AT STAKE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129951,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT TOOK THE VEHICLE TO AUDI SILVER SPRING (3151 AUTOMOBILE BOULEVARD, SILVER SPRING, MD 20904) FOR SCHEDULED MAINTENANCE AND WAS INFORMED THAT THERE WAS AN ISSUE WITH THE COOLANT AND THE ENGINE NEEDED REPLACEMENT. IN MAY OF 2018, THE VEHICLE WAS TAKEN TO THE SAME DEALER WHERE A SOFTWARE WAS UPDATE PER NHTSA CAMPAIGN NUMBER: 17V002000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 86,000.",
        "vin": "WAUFFAFL7DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129697,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING DOWN ROUTE 1 IN NJ WITH MY FAMILY AND NEARLY GOT INTO A FATAL ACCIDENT WITH A TRACTOR TRAILER BECAUSE MY STEERING WHEEL GOT EXTREMELY TIGHT AND NEEDED AN EXCESSIVE AMOUNT OF FORCE TO MOVE. I HAVE A COLLEAGUE THAT ALSO HAS A 2013 AUDI A4 AND HE WAS TELLING ME HIS CAR IS EXPERIENCING THE SAME STEERING ISSUE. I LOOKED IT UP ONLINE AND APPARENTLY A LOT OF PEOPLE WITH THIS YEAR MAKE AND MODEL ARE HAVING THE ISSUE. THIS IS A VERY SERIOUS AND POTENTIALLY LIFE THREATENING ISSUE. PLEASE SEE THE HOW UNETHICAL IT IS FOR THIS ISSUE TO BE NOT FIXED ALREADY WITH SO MANY PEOPLE REPORTING THIS ISSUE.",
        "vin": "WAUFFAFL2DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/08/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129557,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "USED DEALERSHIP CLAIMED THEY DID THE RECALL FOR 18V229/ RECALL NUMEBER 19N4 AND SOFTWARE UPDATED BUT THEY SAID THEY DID THE RECALL FOR THE PUMP BUT NOT UPDATE. SO I NEED SOMEONE TO LOOK INTO THIS FOR MY OWN SAFETY. AND THE STEERING WHEEL LOCKS ON ME THEY ARE SUPPOSED TO BE REPLACING SOMETHING ON THE SHAFT.   HOWEVER I DON'T KNOW FOR SURE.",
        "vin": "WAUFFAFL4DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124695,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD, THE POWER STEERING ASSIST SUDDENLY WAS GONE. ALMOST HIT A BICYCLIST ON THE SHOULDER. COULD HAVE BEEN A FATALITY. NOW, STEERING IS JERKY, AND CAR IS SCARY TO DRIVE. DOING SOME RESEARCH ON THE INTERNET, SEEMS THAT THIS IS A COMMON PROBLEM.",
        "vin": "WAUHFAFL5DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "06/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121279,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUBFAFLXDN"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115164,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE AND ENGINE COOLING:COOLING SYSTEM",
        "vin": "WAUAFAFL9DA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113851,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC COOLING PUMP DEFECT THAT BLED ONTO THE POWER STEERING RACK RENDERING THE CAR INOPERABLE - LIGHT CAME ON AND SAID DO NOT DRIVE DEFECTIVE STEERING.  $3770 TO REPLACE BOTH THE RACK AND PINION AND THE COOLING SYSTEM. THIS WAS DONE IN MAY.  NO REFUND HAS COME THROUGH AFTER SEVERAL ATTEMPTS. RECALL SAYS REMEDY NOT AVAILABLE YET - I NEED THE MONEY NOW.",
        "vin": "WAUFFAFL6DN"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105053,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EPC FUEL PUMP FAILURE, DEALER NOT RESPONDING, NO REMEDY YET, ENGINE MAY EXPLODE UNSAFE TO DRIVE.",
        "vin": "WA1UFAFL6DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102653,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOWN TSB BY AUDI FOR PROBLEMS WITH THE STEERING SHAFT. TURNING BECOMES DIFFICULT AND HAPPENS RANDOMLY. SEEMS TO BE AN ELECTRICAL ISSUE. HAPPENS WHEN BOTH STATIONARY AND IN MOTION. I FEAR THAT IF THIS HAPPENS AT A HIGH RATE OF SPEED THAT I COULD CRASH.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102374,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR COIL OF SUSPENSION BROKE ON DRIVERS SIDE, 49800 MILES ON THE CAR. INDEPENDENT SHOP AND DEALER CLAIM IT IS COMMON AND I FIND IT WEIRD FOR A PART TO FAIL (IT SNAPPED) AT SUCH LOW MILEAGE. I WAS NOT AWARE OF ANY HARD HITS OR POT HOLES THAT I HAD HIT OUTSIDE OF NORMAL DRIVING. THE PART WAS A HAZARD AS IT WAS LOOSE BOUNCING INSIDE OF SUSPENSION AND MADE A NOISE. NO SENORS WENT OFF DUE TO THE FAILED PART.",
        "vin": "WAUBFAFL7DN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102021,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AN EPC AND COOLANT SENSOR ISSUE FOR THE PAST MONTH, BUT IT TOOK AUDI 1 MONTH TO FINALLY INFORM ME OF THE RECALL NOTICE. THEY ISSUED THE RECALL MAY 15, 2018 BUT I RECEIVED THE LETTER JUNE 15, 2018. IN ADDITION, AUDI DOES NOT HAVE A SOLUTION TO REPAIR THE DAMAGED PARTS.",
        "vin": "WAUFFAFL2DN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102111,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING 15 MPH, A WARNING INDICATOR ILLUMINATED FOR A COOLANT LEAK. THE VEHICLE WAS TAKEN TO THE DEALER (AUDI OF LYNBROOK, 855 SUNRISE HWY, LYNBROOK, NY 11563) WHERE IT WAS DIAGNOSED THAT THE WATER PUMP FAILED AND NEEDED REPLACEMENT. THE DEALER STATED THAT THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIR COST. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT REFUSED TO REIMBURSE THE CONTACT FOR THE REPAIRS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 98,400.",
        "vin": "WAUFFAFL3DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098518,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL SUDDENLY MALFUNCTIONED AND BECAME VERY DIFFICULT TO TURN IN EITHER DIRECTION. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER (AUDI FARMINGTON HILLS, 37911 GRAND RIVER AVE, FARMINGTON HILLS, MI 48335) WAS NOTIFIED OF THE FAILURE, BUT THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 91,000.",
        "vin": "WAUFFAFL6DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096525,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "13 AUDI A4 WITH APPROX 56K MILES - THE STEERING WHEEL HAS STARTED OFFER INCONSISTENT RESISTANCE TO DRIVER INPUT. THE STEERING WHEEL APPEARS TO INTERMITTENTLY LOSE THE ELECTRIC POWER ASSIST WHICH IMPACTS DRIVERS ABILITY TO JUDGE THE AMOUNT OF FORCE IT WOULD TAKE TO MAKE A TURN OR CHANGE A LANE.   ISSUE OCCURS INTERMITTENTLY AT VARIOUS SPEEDS INCLUDING THE VEHICLE BEING STATIONARY. WHILE ROTATING THE WHEEL, IT FEELS LIKE THE STEERING HAS HIT A DEAD END AFTER TURNING A MEAGRE 20 DEGREES, UPON ADDITIONAL FORCE THE STEERING WHEEL WILL ROTATE FURTHER. THIS BEHAVIOR IS INTERMITTENT WHICH MAKES IT HARD TO DRIVE THE CAR SAFELY THROUGH TURNS AND AT HIGH SPEEDS.",
        "vin": "WAUFFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096432,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT ROAD SPEED (30MPH) STEERING LOCKED UP, NO WARNING. IT WAS AS IF POWER STEERING STOPPED WORKING. YOU COULD MOVE THE STEERING WHEEL ABOUT 15 DEGREE WITHOUT ANY IMPACT; BEYOND THAT YOU NEEDED TO TURN THE WHEEL VERY HARD. TO MOVE TO THE SIDE OF THE ROAD. THE CAR HAS 54K MILES. FIXED BY AUDI (OUT OF WARRANTEE) - ELECTRIC STEERING FAILURE AND UNIVERSAL STEERING RACK FAILURE. ACCORDING TO AUDI, IT IS A KNOWN PROBLEM WITH A4 FROM 2013 AT ABOUT 50K MILES - CATASTROPHIC FAILURE. IF I WAS AT HIGHWAY SPEED IT'S UNCLEAR I WOULD HAVE BEEN ABLE TO CONTROL THE CAR.",
        "vin": "WAUHFAFL7DN"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "04/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091493,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BACK OUT FROM MY GARAGE THE VEHICLE FAILS TO MOVE FORWARD WHEN THE SHIFTER IS MOVED FROM REVERSE TO DRIVE. I HAVE TO APPLY AN EXCESSIVE AMOUNT OF PRESSURE TO THE ACCELERATOR TO GET THE CAR TO MOVE FORWARD. WHEN THE FRONT WHEELS ENGAGE, THE EXCESSIVE FORCE FROM INCREASING THE POWER CAUSES THE VEHICLE TO LAUNCH FORWARD MANY TIMES ALMOST UNCONTROLLABLE WITH THE FRONT TIRES SQUEALING. IT APPEARS THE FRONT BRAKES ARE ENGAGED AND SUDDENLY DISENGAGES AND THEN SUDDENLY LAUNCHES FORWARD. THERE HAS BEEN NO ASSISTANCE FROM THE DEALERSHIP TO ASSIST WITH THE PROBLEM. THIS ISSUE ALMOST ALWAYS HAPPENS AFTER THE VEHICLE HAS SETTING OVERNIGHT IN MY GARAGE AND BACKING DOWN A SLIGHT SLOPE TONTO THE PUBLIC STREET.. THIS HAS BEEN AN ONGOING PROBLEM FOR THE PAST 3 PLUS YEARS OF OWNERSHIP.",
        "vin": "WAUEFAFL1DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088497,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE HOME WITH MY WIFE AND LOSS ALL CONTROL OF STEERING IT ALMOST GOT US KILLED AND MAY BE MORE,CAR HAS ALWAYS BEEN KEEP IN GARAGE AND DRIVEN VERY LITTLE CAR HAS ONLY 24.K MILES ON IT.HAD AAA TO PICK IT UP AND TAKE IT TO DEALERSHIP ( AUDI OF DAYTON).LOOKING ON LINE AND DOING SOME CHECKING IT LOOKS LIKE I AM NOT THE ONLY ONE,DO WE WAIT UNTILL SOMEBODY GETS KILLED BEFORE A RECALL IS DONE?",
        "vin": "WAUBFAFL8DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084524,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 AUDI A4 QUATTRO HAS 52,346 MILES. THIS WEEK, WHILE DRIVING AT ANY SPEED, I EXPERIENCED SIGNIFICANT RESTRICTION IN THE STEERING WHILE TURNING THE WHEEL TO CHANGE LANES AND MAKE TURNS RIGHT AND LEFT. I IMMEDIATELY CONTACTED MY LOCAL AUDI DEALER AND TOOK THE CAR IN FOR INSPECTION. THE SERVICE TECH CONFIRMED THAT THERE IS A SERIOUS PROBLEM WITH THE INTERMEDIATE STEERING SHAFT WHICH IS CAUSING THE STIFFNESS AND BINDING THAT IS INTERFERING WITH THE FREE MOVEMENT OF THE UNIVERSAL JOINTS. THE ONLY SOLUTION IS TO REPLACE THE INTERMEDIATE STEERING SHAFT.    FURTHERMORE, I'VE SINCE ASCERTAINED THAT AUDI HAS A \"TECHNICAL SERVICE BULLETIN\" REGARDING THIS ISSUE DATING TO JULY 10, 2014 COVERING A NUMBER OF AUDI MODELS AND MODEL YEARS BUT HAS NOT INSTITUTED A RECALL. (SEE ATTACHED)    IN ADDITION, I WAS INFORMED BY THE DEALERSHIP REPRESENTATIVE THAT THE SPECIFIC PART IS CURRENTLY ON BACKORDER AND MAY TAKE FROM TWO WEEKS TO TWO MONTHS. HE LED ME TO BELIEVE THAT THERE ARE AS MANY AS THIRTY (30) CUSTOMERS AWAITING THIS PARTICULAR PART. I HAVE BEEN ADDED ME TO THE WAIT LIST.    I ASKED THE SERVICE TECH ABOUT THE SAFETY ISSUE AND IF IT'S AT ALL POSSIBLE THAT I COULD EXPERIENCE TOTAL STEERING LOSS WHILE DRIVING. HE SAID THAT ALTHOUGH THAT'S NOT LIKELY, IN AN EMERGENCY SITUATION WHERE I MAY NEED TO SWERVE TO AVOID AN ACCIDENT THAT THE STEERING RESPONSE COULD BECOME AN ISSUE.     MY MAJOR CONCERN IS DO I DRIVE THE CAR WHILE WAITING FOR THE PART? AUDI IS NOT AT THIS MOMENT PROVIDING ANY ASSISTANCE IN THE WAY OF A LOANER VEHICLE SO I'M ON MY OWN.  I'VE UPLOADED THE TECHNICAL SERVICE BULLETIN.",
        "vin": "WAUFFAFL4DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084578,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE DRIVING APPROXIMATELY 55 MPH AND ATTEMPTING TO TURN, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE AND THEN TO THE DEALER (MAGUIRE AUDI, 370 ELMIRA ROAD, ITHACA, NEW YORK). THE DEALER DIAGNOSED THAT THE STEERING SHAFT WAS SEVERELY CORRODED AND NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. *TT  *TR",
        "vin": "WAUFFAFLXDA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOESN'T ENGAGE IMMEDIATE PROPULSION WHEN STARTING FROM A STOPPED POSITION. IT HESITATES, THEN JERKS, AND FINALLY DRIVES. IT IS A SIGNIFICANT SAFETY CONCERN WHEN PULLING OUT INTO TRAFFIC. SOMETIMES THE GAS RESPONDS, AND OTHER TIMES DOESN'T. THE AUDI DEALERSHIP SAID THAT THEY'VE GOTTEN COMPLAINTS ABOUT IT, BUT THAT IT'S \"NORMAL\" FOR THE FWD MODELS OF THE CAR. MY WIFE WON'T DRIVE IT ANYMORE BECAUSE SHE THINKS IT'S TOTALLY UNSAFE AND UNPREDICTABLE. WE PURCHASED THE VEHICLE USED A FEW WEEKS AGO AND THOUGHT THAT THE PROBLEM WAS JUST OCCURRING BECAUSE THE CAR NEEDED NEW TIRES.",
        "vin": "WAUEFAFLXDA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072433,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TWO TEST DRIVES WE PURCHASED A USED AUDI A4 ON 2/10/2018. WHILE TEST DRIVING WE DIDN'T NOTICE ANY ISSUES WITH STEERING, BUT THE FOLLOWING DAY WITH MY FAMILY IN THE CAR WE NEARLY SIDE SWIPED A TRACTOR TRAILER ON THE I80 OHIO TURNPIKE. THE STRAIGHT LINE STEERING IN THIS VEHICLE IS COMPLETELY UNPREDICTABLE, SCARY AND DOWNRIGHT DANGEROUS AT ANY SPEEDS ABOVE 20+ MPH. NHTSA ISSUED A VEHICLE SAFETY RECALL TO REPLACE THE AUXILIARY HEATER, I GUESS I DON'T UNDERSTAND HOW THE AUXILIARY HEATER IS MORE DANGEROUS THAN THIS STEERING PROBLEM. STEERING COMPLAINTS CLEARLY OUTNUMBER OTHER COMPLAINTS ON THIS WEBSITE, BUT SEARCH OUTSIDE OF THIS SITE AND SEE JUST HOW WIDESPREAD THIS PROBLEM IS. AUDI IS WELL AWARE OF THE ISSUE, A TSB HAS BEEN ISSUED FOR SOFTWARE CHANGES AND STEERING RACK, NEITHER ADDRESS THE ISSUE, AND BOTH ARE AT THE CUSTOMER EXPENSE.  IT'S TIME FOR NHTSA TO ACKNOWLEDGE THE STEERING COMPLAINTS AND ISSUE THE SAFETY RECALL THAT SHOULD'VE BEEN ISSUED YEARS AGO.  LET'S DO IT BEFORE A FAMILY IS KILLED.",
        "vin": "WAUFFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054744,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY 2013 AUDI A4 USED I NOTICE A NOTCHY FEEL WHILE DRIVING JUST AFTER I BOUGHT IT, BUT THOUGHT THIS WAS NORMAL. AS TIME WENT ON IT BECAME MORE UNCOMFORTABLE AND FELT UNSAFE DRIVING AT HIGHWAY SPEEDS(OR SLOW SPEEDS) WHEN YOUR STEERING WHEEL WOULD MOVE TO THE LEFT & RIGHT WHILE DRIVING. I DID SOME RESEARCH AND THERE ARE PLENTY MORE PEOPLE WITH THIS PROBLEM, SEEMS LIKE A SAFETY PROBLEM THAT NEEDS TO BE A RECALL AND AUDI KNOWS ABOUT THE PROBLEM BUT WANTS YOU TO PAY FOR A SOFTWARE UPDATE THAT MIGHT COST YOU $150 - $200......PLEASE HELP GET THIS RECALLED BY AUDI!",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021660,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN TENSIONER FAILURE AT 114KM , CAUSED THE TIMING CHAIN TO SKIPS A TOOTH OR TWO, RESULTS IN ENGINE DAMAGED TO THE HEAD VALVES AND ENTIRE ENGINE SHUT DOWN, THIS COULD RESULTS IN FATAL CAR ACCIDENTS DURING DRIVING TO EVERYONE.",
        "vin": "WAUFFCFL5DN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/20/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11016424,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -  REARENDED A STOPPED TRUCK AT APPROXIMATELY 30 MPH.  CAR IS TOTALED.  AIRBAGS DIDN'T GO OFF DESPITE MASSIVE FRONT END DAMAGE.",
        "vin": "WAUEFAFL6DN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11014681,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ENDED A TRUCK AT A SPEED OF APPROXIMATELY 30 MPH ON A HIGHWAY AND AIRBAG DID NOT DEPLOY.",
        "vin": "WAUEFAFL6DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013778,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL WOULD LOCK UP IN CERTAIN SPOTS AND BECOME DIFFICULT TO TURN WHILE DRIVING OR AT REST.  THERE IS A CURRENT TSB FOR THIS ISSUE TSB#-48-14-61 AND IT INVOLVES REPLACING THE INTERMEDIATE STEERING SHAFT.  THIS SHOULD BE CHARACTERIZED AS A SAFETY ISSUE DUE TO THE UNPREDICTABILITY OF OCCURENCES WHILE IN MOTION ESPECIALLY AT HIGH SPEEDS AND WHILE CORNERING.  IF THERE ARE ENOUGH COMPLAINTS TO RELEASE A TSB AND IT INVOLVES STEERING AT HIGH SPEEDS I FEEL THERE SHOULD BE A RECALL ON THIS PART.",
        "vin": "WAUBFAFL7DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR DEVELOPED  A FUEL TANK LEAK SPONTANEOUSLY.  I NOTICED THAT AFTER FILLING MY TANK AND ONLY DRIVING 100MILES BACK AND FORTH FROM WORK OVER 2-3 DAYS THE I HAD TO REFUEL.  AND THEN I NOTICED A HUGE POOL OF GASOLINE AFTER I LEFT MY PARKED AND SAW FUEL DRIPPING FROM THE BOTTOM.  AND THEN MY CAR SMELLED OF GAS WHEN I TURNED ON MY CAR.  I TOOK IT IN FOR SERVICE AND THERE WAS FUEL TANK LEAK...I COULD'VE DIED IN AN EXPLOSION OF FIRE.  THIS IS RIDICULOUS THAT AUDI HAS HAD 241K RECALLS BUT THE INDICATOR LIGHT IN CAR DOESN'T GO OFF TO NOTIFY YOU OF MALFUNCTION THAT IS LIFE THREATENING.",
        "vin": "WAUBFAFL2DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994225,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 65MPH ON HIGHWAY THE STEERING LIGHT WENT OFF AND STEERING WHEEL BECOME STIFF AND NOTCHY.",
        "vin": "WAUAFAFL0DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992193,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING IS NOTCHY OR NON EXISTENT AT TIMES. HAVE HAD THE ENTIRE RACK REPLACED AND RECALIBRATED. IT LASTED ABOUT TWO WEEKS BEFORE THE PROBLEM COMES BACK. NO CHECK ENGINE LIGHT OR WARNING LIGHT. HAS POWER STEERING AT TIMES THEN SENDS THE CAR ALL OVER WITHOUT WARNING. VERY UNSAFE.",
        "vin": "WAUHFAFL9DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979366,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING BECOME INTERMITTENTLY STIFF BOTH WHILE STATIONARY AND IN MOTION. TURNS WERE HARDEST TO MAKE AT SLOW SPEEDS. THE STEERING GOT PROGRESSIVELY HARDER AS TIME WENT ON (SEVERAL WEEKS). I INITIALLLY THOUGHT THE ISSUE WAS THE WINTER TIRES, BUT THOSE WERE CHANGED AND THE PROBLEM WORSENED. NOW IT FEELS AS THOUGH THE POWER STEERING HAS COMPLETELY FAILED. IT TAKES CONSIDERABLE EFFORT TO MAKE ANY TURN AT ANY SPEED.",
        "vin": "WAUBFAFLXDA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2017",
        "dateOfIncident": "04/10/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971778,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT AN 2013 AUDI A4 ON 4/6/17, I DROVE IT FOR A WEEK AND THE CAR STARTED TO GIVE ME TRANSMISSION MALFUNCTION WARNING, THE CAR JERKS AND CLUNKS WHEN GOING FROM 1ST TO 2ND OR EVEN WHEN COMING TO A STOP. THE CAR ONLY HAS 36,000 MILES. I BELIEVE AUDI NEEDS TO STEP UP AND MAKE THIS A MANDATORY RECALL BECAUSE THERE IS ENTIRELY TO MANY PEOPLE HAVING THE SAME ISSUES WITH THE MECHATRONIC UNITS ON SUCH LOW MILEAGE AUDI'S. I HAD THE SAME PROBLEM ON MY OLD 2006 AUDI A4 AND GOT IT FIXED FOR A FEW THOUSAND,  NOW I HAVE TO DO THE SAME WITH MY 2013 AUDI A4. I FEEL THIS IS NOT FAIR AND THE COMPANY IS STEALING MONEY TO REPAIR A PART THEY KNOW IS GOING TO FAIL. PLEASE HELP ME AND HUNDREDS  OR THOUSANDS OF OTHER PEOPLE EXPERIENCING THE SAME ISSUE. THANKS.",
        "vin": "WAUAFAFLXDA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE APPEARED IN COLD WEATHER. WHEN STATIONARY THE ISSUE LOOK LIKE A 'ZONE', LOCATED APPROXIMATELY EVERY 90 DEGREES WHEN YOU TURN WHEEL RIGHT/LEFT, WHERE THE WHEEL IS 'JAMMING' AND DRIVER HAVE TO APPLY AN EXCESSIVE FORCE TO TURN THE STEERING WHEEL FURTHER OR BACK TO NEUTRAL.  IN MOTION THE ISSUE LOOK LIKE 'JAMMED WHEEL': IT'S HARD TO TURN WHEEL MORE THAN 90 DEGREES RIGHT/LEFT AND... IF IT'S ALREADY ROTATED AND 'IN THE ZONE', IT REQUIRE AN EXCESSIVE FORCE TO TURN THE WHEEL BACK TO NEUTRAL. THE WHEEL WILL NOT RETURN TO CENTER POSITION THEMSELVES AS IT DOES WHEN STEERING BEHAVE NORMALLY. OVERALL ISSUE FEELS LIKE FAILING POWER ASSIST.",
        "vin": "WAUFFAFL9DN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/22/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947224,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JAN 22 2017 I WAS DRIVING IN BLIZZARD CONDITIONS FOLLOWING A FEW VEHICLES WHEN MY WIPERS STOPPED WORKING AND STARTED GRINDING. AS A RESULT I LOST COMPLETE VISIBILITY AND NEARLY CAUSE A 3 CAR ACCIDENT AND LOSS OF CONTROL OF THE VEHICLE. I CONTACTED AUDI TO BE INFORMED THAT MY WARRANTY EXPIRED 2 MONTHS AGO  HOWEVER MY VEHICLE WAS WELL WITHIN THE 50,000 MILES EXPIRATION AS MY CAR HAS 47,500 MILES. I FIRST SPOKE WITH A LADY IN AUDI CUSTOMER SERVICE WHO INFORMED ME THERE WAS NOTHING SHE COULD DO AND LATER I GOT A HOLD OF [XXX] WHO INFORMED ME I HAD TO GO TO AN AUDI DEALER AND PAY FOR A DIAGNOSIS FOR THEM TO HELP ME IN ANY WAY. I INFORMED THEM THAT THE DEALER WAS 120 MILES AWAY AND WAS DUE TO THE CONTINUOUSLY SNOWY CONDITIONS I COULD NOT GO TO PHOENIX TO GET THE DIAGNOSIS BECAUSE MY WIPERS WERE SEIZED AND IT IS STILL SNOWING HEAVILY. DUE TO THE NATURE OF THE SAFETY HAZARD I SHOULDN'T HAVE TO PAY FOR A DIAGNOSIS ANYWAYS. I ASKED HIM FOR HIS MANAGERS INFORMATION AND HE REFUSED. I WAS THEN INFORMED THAT I WOULD BE CONTACTED IN A FEW DAYS... THE NATURE OF THE ISSUE IS A SAFETY HAZARD AND CANNOT BE PENDING BASED OFF THE LEISURE OF A HIGHER UP.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUAFAFL3DN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915572,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. WHILE ATTEMPTING TO START THE VEHICLE, IT VIBRATED ABNORMALLY. THE CONTACT STATED THAT THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION COOLANT VALVE FRACTURED, WHICH CAUSED COOLANT TO LEAK INTO THE ELECTRONIC CONTROL MODULE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,500.",
        "vin": "WAUHFAFL2DN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884552,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR FAILS TO START VIA THE KEY IN THE IGNITION. YOU HAVE TO WIGGLE THE KEY TO GET THE IGNITION TO START. BATTERY IN KEY FOB IS OK AS IT OPENS AND LOCKS THE CAR WITH NO ISSUE. SEEMS TO BE A SOFTWARE, OR LOOSE CONNECTION ISSUE.",
        "vin": "WAUAFAFL3DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/05/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872590,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A4 2013. THE CAR WILL NOT STAY CENTERED IN THE LANE ON THE HIGHWAY. IT WANDERS OFF CENTER WITHOUT ANY CHANGE IN THE ROAD OR POSITION OF THE STEERING WHEEL. IT CONSTANTLY FEELS LIKE IT IS BEING BUFFETED IN A HEAVY WIND.. WHEN I TURN TO CORRECT, THE CAR OVERSHOOTS AND I HAVE TO TURN BACK AGAIN TO CENTER IT. SOFTWARE UPGRADE DID NOT FIX THE PROBLEM. THIS IS DANGEROUS, AS THE CAR DRIFTS FROM SIDE TO SIDE WITH THE STEERING WHEEL HELD STEADY. DEALER SAYS THIS IS NORMAL FOR AUDI CARS. NOT TRUE, AS I DROVE A 2017 A4 WITH NO STEERING ISSUES AT ALL. THIS IS A PROBLEM WITH THE ELECTROMECHANICAL STEERING.",
        "vin": "WAUHFAFL9DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/13/2015",
        "dateOfIncident": "06/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725080,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE MANY OTHER COMPLAINTS I HAVE READ ON THIS WEBSITE, MY AUDI HAS A SIGNIFICANT \"NOTCHY\" FEELING IN THE STEERING WHEEL WHICH HAS GROWN CONSIDERABLY WORSE IN THE LAST SEVERAL DAYS. IT STARTED RIGHT WHEN THE CAR WAS NEW.  IT IS LIKE THE WHEEL IS FIGHTING AGAINST MY EFFORTS TO STEER IT, ESPECIALLY TO THE RIGHT.    THE VEHICLE WAS SERVICED ABOUT A YEAR FOR THE SAME COMPLAINT AND WAS BETTER FOR A WHILE, BUT MUCH WORSE NOW",
        "vin": "WAUHFAFL6DN"
    },
    {
        "components": "STEERING,AIR BAGS,TRACTION CONTROL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "03/29/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10722043,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 AUDI A4. WHILE DRIVING APPROXIMATELY 70 MPH, THE STEERING WHEEL FAILED TO CENTER AND THE TRACTION CONTROL WARNING LIGHT ILLUMINATED. AS A RESULT, THE CONTACT LOST CONTROL OF THE VEHICLE AND IT SPUN INTO A CIRCLE. THE CONTACT CRASHED INTO THE GUARDRAIL AND SIDESWIPED ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED A HEAD INJURY THAT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "WAUFFAFL2DN"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "03/27/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705548,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 AUDI A4. THE CONTACT STATED THAT THE STEERING WAS ERRATIC AND NO LONGER CENTERED. THE CONTACT HEARD A CLICKING SOUND COMING FROM THE STEERING WHEEL PRIOR TO THE FAILURE. WHILE TRAVELING 65 MPH, THE CONTACT LOST CONTROL OF THE STEERING WHEEL AND CRASHED INTO A GUARD RAIL. THE VEHICLE WAS DESTROYED. NONE OF THE AIR BAGS DEPLOYED. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE FRONT DRIVER SIDE TIE ROD FRACTURED; HOWEVER, THE CONTACT DID NOT KNOW WHETHER THE FAILURE OCCURRED BEFORE OR AFTER THE CRASH. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "11/07/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663235,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT AN INTERSECTION WAITING TO TURN LEFT ACROSS TRAFFIC, LET OFF BRAKE TO ACCELERATE WHILE TURNING WHEN THE ENGINE HESITATED.  PRESSING THE GAS PEDAL AT THIS MOMENT RESULTED IN MINIMAL CAR MOVEMENT PLACING MY CAR IN THE PATH OF ONCOMING TRAFFIC.  I PRESSED THE GAS PEDAL MORE AND THE CAR FINALLY OVER ACCELERATED RESULTING IN SOME LOSS OF CONTROL IN THE TURN.  THIS IS NOT THE FIRST TIME I HAVE NOTICED ENGINE HESITATION FROM A STOP.  THE SAME HESITATION HAS OCCURRED AT FOUR WAY STOPS AND STOP LIGHTS.  THE ENGINE HESITATION OCCURS MORE OFTEN AT LOWER FUEL TANK LEVELS AND COLDER AMBIENT CONDITIONS.  THE ENGINE HESITATION FEELS LIKE EITHER AN AIR POCKET IN THE FUEL LINE OR DRIVE TRANSMISSION ISSUE.  I TOOK THE CAR TO MY AUDI DEALER TO INVESTIGATE ON 12/5/2014.  THE AUDI DEALER STATED THAT THIS ISSUE IS RELATED TO TURBO LAG AND/OR CVT REV UP.  I HAVE OWNED OTHER VEHICLES WITH A TURBO ENGINE AND CVT TRANSMISSION WITH NO HESITATION ISSUES.   A TRAFFIC ACCIDENT IS A LIKELY OUTCOME WITH THIS INCONSISTENT ENGINE HESITATION.  I HAVE ALSO FILE A COMPLAINT WITH AUDI USA.  *TR",
        "vin": "WAUEFAFL2DN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2014",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639236,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVEWAY IS ON A SLIGHT DOWN-SLOPE. WHEN PARKED THERE WITH MY AUDI A4 2.0T'S FRONT END FACING DOWN WITH MY FOOT ON THE BRAKE, I PUT MY AUDI IN REVERSE, MOVE MY FOOT FROM BRAKE TO THE GAS PEDAL AND ATTEMPT TO BACK UP THE DOWN-SLOPE, BUT MY AUDI AGGRESSIVELY ROLLS FORWARD AS I CONTINUE TRYING TO ACCELERATE TO BACK UP.  I CAN ROLL FORWARD 3' TO 6' BEFORE REVERSE GEAR KICKS IN AND WHEN IT DOES THE LAUNCHES BACKWARD AT A HIGH RATE OF SPEED OUT DRIVEWAY INTO THE PATH PEDESTRIANS WHO I'VE NEARLY HIT AND GOES ON INTO STREET TRAFFIC WHERE I HAVE ALMOST BEEN HIT. ALSO, WHEN PARKED ON THE STREET THE BACK BRAKES LOCK AND WILL NOT RELEASE WITHOUT MORE GAS THEN THEY SUDDENLY RELEASE WITH A NOISE LAUNCHING THE AUDI FORWARD AT A HIGH RATE OF SPEED.  THE AUDI DEAL HAS CONFIRMED THESE CONDITIONS AND SAYS THEY ARE NORMAL.  I DISAGREE AND HAVE FOUND IT DANGEROUS AND SCARY AS I'M BEHIND THE WHEEL BUT NOT IN CONTROL OF MY AUDI.  IT'S ANALOGOUS TO TURNING THE STEERING WHEEL LEFT BUT THE CAR GOES RIGHT FOR SIX FEET THEN SUDDENLY VEERS RIGHT.  I NEED THIS SITUATION CORRECTED AS I CAN NOT USE THE AUDI FULLY AND SAFELY.  *TR",
        "vin": "WAUEFAFL0DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633800,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LOADING MY DOGS INTO THE CAR. THE KEYS WERE SITTING ON DASH BECAUSE MY HANDS WERE FULL. I HAD AN 8 MONTH OLD IN THE CAR IN HER CAR SEAT.  AS I CLOSED THE LAST DOOR, THE CAR LOCKED WITH THE KEYS AND THE BABY INSIDE IT.  I WAS IN A FAIRLY REMOTE PLACE BUT WAS ABLE TO GET THE FIRE DEPARTMENT TO GET THE CAR OPEN AND GET THE BABY OUT BEFORE SOMETHING TRAGIC OCCURRED.  IT HAPPENED TO ME ONCE BEFORE WHEN I WAS LOADING MY CAR AND THE WIND BLEW THE LAST DOOR SHUT.  BOTH TIMES THE CAR LOCKED IMMEDIATELY.  THE AUDI DEALERSHIP SAID THAT THIS KEY IS SUPPOSED TO LOCK THE CAR AFTER A SPECIFIED PERIOD OF TIME, 20 OR 30 SECONDS.  AFTER RESEARCHING THEY FOUND THEY COULD DISABLE THE AUTOMATIC LOCKING SYSTEM WHICH THEY DID FOR ME.  THIS IS VERY DANGEROUS AS IT COULD HAVE BEEN A VERY HOT DAY WITH A CHILD LOCKED IN THE CAR,  PEOPLE NEED TO BE AWARE OF THIS SYSTEM AND THAT THEY CAN LOCK A CHILD OR A NON ABLE BODIED PERSON OR ANIMAL IN A CAR.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2014",
        "dateOfIncident": "07/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616594,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEEDS, STEERING FEEDBACK IS VERY UNPREDICTABLE. THE VEHICLE WILL NOT DRIVE IN A STRAIGHT LINE AT HIGHWAY SPEED, IT CONSTANTLY REQUIRES UNNATURAL ADJUSTMENTS TO MAINTAIN THE VEHICLES POSITION IN INTERSTATE LANE. THE VEHICLE DOES NOT PULL TO ONE SIDE OR THE OTHER INSTEAD THE STEERING IS LOOSE AND UNPREDICTABLE A FEW INCHES ON EITHER SIDE FROM THE 12 O'CLOCK POSITION, NEUTRAL POSITION. THIS HAS CAUSED VERY OFTEN UNINTENTIONAL LANE DEPARTURES AND ALMOST ACCIDENTS.   *TR",
        "vin": "WAUFFAFLXDN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2014",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573003,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING DEVELOPED AN INTERMITTENT NOTCHY FEEL DURING HIGHWAY DRIVING WITHIN THE FIRST 1600 MILES. THE STEERING WHEEL FEELS A BIT LIKE THE VOLUME KNOB ON THE RADIO AND \"CLICKS\" FROM ONE POSITION TO THE NEXT. IT IS VERY DIFFICULT TO HAVE THE STEERING WHEEL BETWEEN THE 2 POSITIONS. I COMPLAINED TO AUDI AND THEY ACKNOWLEDGED THE PROBLEM AND SAID THEY HAD A POWER STEERING UPDATE TO FIX THE PROBLEM. THE UPDATE WAS APPLIED IN DEC 2013. AFTER THE UPDATE THE NOTCHY FEELING STARTED OCCURRING AROUND TOWN (35-55MPH). IT CAN MAKE STAYING IN THE LANE DIFFICULT. SOMETIMES IT FEELS LIKE THE STEERING WHEEL IS FIGHTING AGAINST YOU A LITTLE. ALSO THE CAR DOES NOT GO STRAIGHT ON THE HIGHWAY. IT REQUIRES CONSTANT, SMALL ADJUSTMENTS TO KEEP THE CAR GOING STRAIGHT. DRIVING CAN BE VERY DISCONCERTING. I AM WORKING WITH AUDI TO RESOLVE THE PROBLEM BUT THEY HAVE NOT ACKNOWLEDGED THAT THERE IS A LARGER PROBLEM. SO FAR THEY HAVE BEEN UNABLE TO FIX IT.  *TR",
        "vin": "WAUHFAFLXDA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/16/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572699,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DEVELOPED NOTCHY FEELING WHEN TRYING TO KEEP VEHICLE STRAIGHT ON HIGHWAY ROADS. REQUIRES CONSTANT INPUT IN BOTH RIGHT AND LEFT DIRECTIONS. SIMILAR TO TRYING TO CORRECT FOR CROSS WINDS FROM BOTH SIDES EVEN THOUGH CALM CONDITIONS. CAR HAD UP-GRADE TO STEERING MODULE AT 5K MILES WHICH DEALER SAID I HAD NO CHOICE IN THE MATTER. CAR THEN WENT TO DEALER FOR STEERING COLUMN BUSHINGS AND OTHER PARTS ACCORDING TO THEIR INTERNAL RECALL.  NOW CAR HAS LIGHTER FEEL BUT DOES NOT REBOUND TO NEUTRAL OR 12 O,CLOCK POSITION. DOES NOT PULL IN ANY DIRECTION BUT RATHER REMAINS IN WHATEVER DIRECTION NEEDED TO CORRECT TO TRAVELING IN STRAIGHT LINE. LITTLE INPUT TO GO LEFT, REMAINS TRAVELING SLIGHTLY LEFT. SAME THING CORRECTING TO RIGHT. AUDI AWARE OF PROBLEM BUT HAS NO DEFINITE FIX. VERY PRONOUNCED AT LOWER TEMPS ESPECIALLY BELOW FREEZING WHICH DOES NOT HELP IN THE ADIRONDACKS. AM TOLD THIS SYSTEM SAVES 1 MPG.  NOT WORTH THE SKETCHY AND UNTRUSTWORTHY BEHAVIOR .  *TR",
        "vin": "WAUHFAFL2DA"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548120,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE TWO ISSUES WHICH OCCUR WITHOUT WARNING, USUALLY WHEN THE CAR IS COLD OR WHILE DRIVING ON THE FREEWAY. THE FIRST ISSUE OCCURS WHEN TRAVELING IN A STRAIGHT LINE AND IS A \"SLIP\" IN THE STEERING WHEEL WHEN CROSSING THE 12 O'CLOCK POSITION WHERE IT FEELS LIKE IT'S HOLDING FINE AND THEN SUDDENLY \"SLIPS\" AND THEN GRABS AGAIN WHEN YOU TURN THE WHEEL OFF CENTER. THIS HAPPENS WITH NO CHANGE IN ROAD CONDITIONS, ACCELERATION, OR VEHICLE SPEED. WHEN THIS OCCURS IT IS UNSETTLING AND HAS CAUSED DRIVERS TO INADVERTENTLY DRIFT INTO THE ADJACENT LANE. THE SECOND ISSUE IS A \"NOTCHY\" FEEL WHICH HAPPENS AT ANY SPEED, ANY STEERING MODE AND ANY WHEEL POSITION. LIKE THE FIRST STEERING ISSUE, THIS ALSO FEELS UNSAFE AS THE DRIVER OFTEN OVER OR UNDER CORRECTS STEERING INPUT.  I HAVE TAKEN THE VEHICLE TO AUDI DEALERS NUMEROUS TIMES, THEY EVEN CHANGED THE POWER STEERING SYSTEM IN JAN 2013 HOWEVER THE PROBLEM RETURNED AFTER APPROXIMATELY 45 DAYS. I TOOK THE CAR BACK TO THE AUDI DEALERSHIP IN JUNE AT WHICH POINT THEY ACKNOWLEDGED THAT AUDI IS AWARE OF THE PROBLEM AND THEY ARE WORKING ON A FIX, HOWEVER NEITHER THE DEALER NOR AUDI HAS CALLED WITH A REAL FIX FOR THIS ISSUE YET.  *TR",
        "vin": "WAUHFAFLXDN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543784,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE HAVING A STEERING PROBLEM WITH OUR 2013 ALL ROAD.  IT HAS ABOUT 10K MILES ON IT.  AT VARYING SPEEDS, WE NOTICE \"PLAY\" OR LACK OF CONTROL WHILE STEERING.  IT APPEARS THERE IS A 1-2 INCH LACK OF RESPONSE FROM CENTER WHILE DRIVING FROM TIME TO TIME....NOT CONSISTENT.  IT ALSO APPEARS THAT STEERING TAKES MORE EFFORT WHILE COMPENSATING FOR THIS LACK OF CONTROL....DURING AND AFTER THE EPISODE.  *TR",
        "vin": "WA1UFAFL0DA"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "08/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533816,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "NEW AUDI A4, 10 DAYS OLD 800 KM. DRIVING ABOUT 40MPH ON TWO LANE HIGHWAY, HIT MINOR BUMP. THE FRONT PASSENGER TIRE COLLAPSED, SMOKED AND THERE WAS COMPLETE SEPARATION OF TREAD AND SIDEWALL. INCIDENT OCCURRED ON A DANGEROUS CURVE WHERE THERE WAS NO SHOULDER AND LOTS OF TRAFFIC. FORTUNATELY NO ACCIDENT OR INJURY BUT COULD HAVE BEEN DISASTROUS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/13/2013",
        "dateOfIncident": "07/11/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524655,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ALLROAD WAGON.  NOTCHY STEERING THAT FELT LIKE IT WAS PULLING TO ONE SIDE.  DISCONCERTING!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/25/2013",
        "dateOfIncident": "04/24/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE UNDERGOES CONSISTENT LATERAL MOVEMENT ON THE FREEWAY WHEN OVER SPEEDS OF 60 MILES PER HOUR.  THE DRIVER HAS TO CONTINUALLY CORRECT THE STEERING WHEEL JUST TO STAY IN A DRIVING LANE. THE VEHICLE DRIVES FINE AT SPEEDS BELOW 60 MPH.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2013",
        "dateOfIncident": "10/12/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509028,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELARATION WAS OBSERVED SEVERAL TIMES WHILE DRIVING AUDI A4. HOWEVER, NO ACCIDENTS OCCURED DUE TO THIS. AUDI SHOULD TAKE A LOOK INTO POSSIBLE ELCTROMECHANICAL PROBLEMS IN 2013 AUDI.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2013",
        "dateOfIncident": "03/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507320,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IS NOTCHY/ CLICKY AND UNSTABLE. DIFFICULT TO KEEP THE CAR IN A STRAIGHT LINE. PROBLEM STOPS WHEN RESTARTING THE VEHICLE. HAS HAPPENED MULTIPLE TIMES, BEGINNING TO FEEL UNSAFE IN THE CAR. HAVE READ MULTIPLE REPORTS OF THE EXACT SAME PROBLEM!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/04/2013",
        "dateOfIncident": "03/22/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507134,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST LEASE 2013 AUDI A4 ON MARCH 15, 2013 FROM DEALER IN (NY);   THE STEERING CONTROL/MECHANICALS ARE COMPLETELY OFFLINE,   UNABLE TO KEEP STEERING/WHEELS STRAIGHT.       I CONSTANTLY HAVE TO TURN STEERING TO KEEP THE WHEELS STRAIGHT,   AS IF CAR IS DRIFTING EITHER TO LEFT OR RIGHT, ESPECIALLY AT 20 MILES OR OVER.    ON HIGHWAY THE STEERING WILL NOT HOLD A STRAIGHT LINE.    I AM CONSTANTLY MAKING CORRECTIONS EVERY FEW SECONDS TO MAINTAIN LANE.  IT IS IMPOSSIBLE TO KEEP STEERING AND CAR GO STRAIGHT.  I HOPE AUDI ENGINEERS  ARE CHECKING THE PROBLEM.  I AM UNHAPPY AND DISAPPOINT WITH AUDI A4.  *TR",
        "vin": "WAUDFAFL8DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2013",
        "dateOfIncident": "02/23/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING CONTROL IS NOTCHY AT LOW SPEEDS.  THIS HAPPENS RANDOMLY AND NOT FREQUENTLY ONLY 5 TIMES IN TWO MONTHS.  DURING EACH EPISODE THE STEERING HAD A HIGH AMOUNT OF RESISTANCE THEN JUMPED TO THE NEXT POSITION.      AT HIGHWAY SPEEDS (70 MPH) THE STEERING WILL NOT HOLD A STRAIGHT LINE AND SMALL CORRECTIONS MUST BE MADE EVERY FEW SECONDS TO MAINTAIN YOUR LANE.  THE STEERING IS IMPOSSIBLE TO KEEP ON CENTER MAKING IT VERY DIFFICULT TO MAKE LONG TRIPS.  THIS IS AT ALL TIMES WHILE AT HIGHWAY SPEED.  THE DEALER REPRESENTATIVE TOLD ME THAT MY VIN IS FLAGGED FOR STEERING PROBLEMS BY AUDI BUT NO FIX WAS AVAILABLE AT THIS TIME.  *TR",
        "vin": "WAUHFAFL5DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2013",
        "dateOfIncident": "12/19/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502189,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS FOR MY 2013 AUDI ALLROAD (STATION WAGON, BASED ON AN A4).  OUTSIDE TEMP: ~ 34 DEGREES F.  1550 MILES ON ODOMETER.  I WAS DRIVING ON THE INTERSTATE.  THE PAVEMENT WAS NOT CROWNED, AND IN FACT WAS VERY SMOOTH.  THERE WERE NO RUTS FROM HEAVY TRACTOR/TRAILER USAGE.  THE WEATHER WAS CLEAR AND THERE WAS NO DETECTABLE WIND.  NO OTHER VEHICLES WERE ANYWHERE NEAR ME TO CREATE BUFFETING.  WITH NO WARNING, THE STEERING WHEEL JUMPED APPROXIMATELY TO 2.0 INCHES TO THE RIGHT - - THE CAR QUICKLY STARTED TRAVELING TO THE RIGHT.  WHEN I ATTEMPTED A CORRECTION TO THE LEFT, THERE WAS AN OBVIOUS RESISTANCE IN THE STEERING WHEEL FOR ~ 2 INCHES, AND THEN IT WENT TO ZERO.  THE SAME OCCURRED WHEN I WENT BACK TO THE RIGHT.  IT'S AS IF THERE IS A NOTCH, OR DETENT, TO THE RIGHT AND TO THE LEFT.  IT IS EXTREMELY UNNERVING.  NOW WITH 3350 MILES, IT HAS CONTINUED WITH THE SAME DEGREE OF ERRATIC BEHAVIOR, REGARDLESS OF THE PAVEMENT TYPE OR QUALITY.  THE PROBLEM OCCURS, REGARDLESS OF SPEED, EVERY TIME I DRIVE THE CAR.  IF I DRIVE FOR MORE THAN 30 MINUTES, IT SOMETIMES DISAPPEARS.  THERE IS AN OBVIOUS PROBLEM WITH AUDI'S NEW ELECTRIC OR ELECTRO-MECHANICAL STEERING SYSTEM.  I AM VERY AFRAID THAT THE SYSTEM WILL FAIL AND I WILL BE IN A CRASH. *TR",
        "vin": "WA1UFAFL9DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/21/2013",
        "dateOfIncident": "01/04/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STEERING IS NOTCHY. IT IS HARD TO DRIVE STRAIGHT ON THE HIGHWAY- THE STEERING EITHER CLICKS INTO SLIGHT LEFT OR SLIGHT RIGHT. IT IS UNSAFE BECAUSE IT IS REALLY HARD TO DRIVE THE CAR. PEOPLE HAVE COMPLAINED ON VARIOUS WEBSITES BUT AUDI HAS NOT RECALLED ANYTHING YET AS FAR AS I KNOW. THERE ARE YOUTUBE VIDEO POSTS ALSO- HERE IS ONE:  HTTP://WWW.YOUTUBE.COM/WATCH?V=MW9M2N3CYM4.  *TR.... UPDATED 03/08/13 *BF  THE CONSUMER STATED THE PROBLEM WAS FIXED. UPDATED 03/11/13",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "01/30/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497799,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE STEERING BECAME VERY IRREGULAR AND DIFFICULT TO CONTROL CAUSING THE CONTACT TO SWERVE IN AND OUT OF HIGHWAY LANES. THE VEHICLE WAS STOPPED AND SHUT DOWN. AFTER RESTARTING, THE FAILURE CEASED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT THE STEERING WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED AND STATED THERE WAS NO RECALL AND OFFERED NO OTHER ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 800 AND THE CURRENT MILEAGE 3,600.",
        "vin": "WAUHFAFL4DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/30/2013",
        "dateOfIncident": "12/03/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495251,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ANY SPEED, MOVING THE STEERING WHEEL THROUGH CENTER PRESENTS A \"NOTCHY\" FEEL, WHERE RESISTANCE IS FELT AND THEN THE WHEEL JUMPS TO ANOTHER POSITION. THESE \"NOTCHES\" ARE FELT THROUGH ABOUT 10-20 DEGREES OFF CENTER. AT HIGHWAY SPEEDS, THE CAR IS DIFFICULT TO KEEP IN A STRAIGHT LINE AS THE STEERING FIGHTS THE DRIVER TO REMAIN ON-CENTER.    THE DEALER, WHEN CONTACTED, REPLACED THE \"STEERING RACK\", WHICH MADE THE PROBLEM GO AWAY. I HAVE READ A DOZEN OR MORE REPORTS FROM OTHER 2013 AUDI A4/A5/S4/S5/ALLROAD OWNERS REPORTING THE SAME ISSUE, AND AT LEAST ONE REPORTED THAT THE PROBLEM RETURNED AFTER A STEERING RACK REPLACEMENT. MY CONCERN IS THAT THIS IS JUST A TEMPORARY FIX AND THAT THE PROBLEM WILL RECUR.  *TR",
        "vin": "WA1VFAFL9DA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2013",
        "dateOfIncident": "12/23/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494775,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 3500 MILES THE VEHICLE DEVELOPED A \"NOTCHY\" SENSATION IN THE STEERING FEEL THAT VARIED IN INTENSITY AND WOULD OCCUR AT RANDOM TIMES.  THIS NOTCHY SENSATION WOULD OCCUR ANY SPEED ABOVE 20MPH, AS IF SWITCHED ON.  WHEN SYMPTOMS WOULD OCCUR THERE WOULD BE A HEAVY, NOTCHY FEELING ON EITHER SIDE OF STRAIGHT STEER THAT WOULD TAKE A LOT OF FORCE TO OVERCOME AND THEN ONCE FEELING LIKE THE WHEEL IS OVER THE NOTCH, IT WOULD OVER CORRECT MAKING IT DIFFICULT TO MAINTAIN A LANE.  THE STEERING WHEEL COULD NOT BE PLACED IN THOSE NOTCH POSITIONS, AS IF TRYING TO DRIVE USING A CLICK WHEEL.  THE NOTCHINESS IS ALSO FELT THROUGHOUT ALL WHEEL TRAVEL, NOT JUST ON CENTER, STRAIGHT WHEEL.  THIS MAKES STAYING ON A GIVEN PATH DIFFICULT AND UNSAFE.  AT RANDOM TIMES STEERING FELT SO HEAVY THAT IT FELT LIKE THERE WAS NO POWER STEERING IN MANEUVERS.  DEALER HAS REPLACED THE STEERING RACK BUT THE VERY NEXT DAY THE NOTCHY STEERING SYMPTOMS REAPPEARED RANDOMLY.  THERE IS NO SET OF CONDITIONS TO REPRODUCE THE PROBLEM, HOWEVER TURNING THE CAR OFF AND ON OR TURNING THE WHEEL LOCK TO LOCK ALLEVIATES THE SYMPTOMS.  THE SYMPTOMS HAVE SLOWLY INCREASED IN FREQUENCY SINCE THE REPLACEMENT AND OCCUR AT RANDOM TIMES, ESPECIALLY DURING HIGHWAY DRIVING.    THIS IS THE FIRST YEAR AUDI HAS INTRODUCED ELECTROMECHANICAL STEERING INTO THEIR CARS IN THE UNITED STATES.  THIS IS POTENTIALLY A NEW DESIGN FLAW THAT HAS GOTTEN THROUGH TESTING OR A NEW PRODUCTION DEFECT AND SHOULD BE INVESTIGATED QUICKLY.  MANY OTHER 2013 AUDI (VARYING MODELS) OWNERS HAVE HAD THE SAME ISSUE.  *TR",
        "vin": "WA1UFAFL3DA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/06/2012",
        "dateOfIncident": "11/28/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487569,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI A4. THE CONTACT STATED THAT THERE WAS A REFLECTION OF THE AIR CONDITIONING VENTS ON THE SIDE VIEW MIRROR AND THE WINDSHIELD, WHICH CREATED A GLARE, COMPROMISING HER VISIBILITY. THE VEHICLE WAS TAKEN TO THE DEALER BUT THEY REFUSED TO PROVIDE ANY ASSISTANCE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THAT THEY WOULD CONTACTED HER BACK AT A LATER DATE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 91 AND THE CURRENT MILEAGE WAS 500.",
        "vin": ""
    }
]