[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458774,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I filled tank up with gas and developed a gas leak with strong gas odor and gas dripping onto the roadway.   My safety was put at risk because gasoline was dripping past my hot exhaust piping which has the potential to catch on fire.   My independent service center has confirmed this issue.  The manufacturer has denied that their is a systemic failure that could result in a gasoline fire.   There were no warning lamps or messages indicating a problem.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/14/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457701,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger door lock failed and does not allow the door to be opened in an emergency.  The door is designed to be unlocked by the first pull of the door handle then unlatched with the second pull of the handle, however after the first handle pull the lock immediately locks again preventing the second pull from unlatching the door.  The system would be available for inspection. This problem has been reproduced and confirmed by manufacturer's dealer, but has not been inspected  The electric door lock actuator had failed about a year ago, but still allowed the door lock to be used manually without any disruption to being able to open the door.",
        "vin": "WBA3B3C56DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456966,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I started smelling burning oil from my engine and brought it to the mechanic. He confirmed that my car has a valve cover leak and a electrical issue. The Car dies after being left off for more then 12 hours. The car miss fire and have ruff idle. Warning lights power train came on after I had the miss fire. Had P0171 and 02 sensor code.",
        "vin": "wba3a5g55dn"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/11/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456773,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "the transfer case crack while driving at a 35 mph street thank god it didn't happen in the highway how do I know I herd a grinding noise and stop look under car and oil was driping got home jack it up and  Sure enough I saw a hole in the transfer case",
        "vin": "WBA3B3C52DF"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456692,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I recently had my car serviced and the oil changed over the summer, so there were no warning indicators or service issues prior to this incident. I left for work and had no indications of any problems. I drove for about 10-15 minutes when a warning notification popped up stating engine oil pressure low. A few seconds later, the check engine light came on with a notification there was a \"drivetrain malfunction\". The car started to decrease speed significantly and I pulled over as soon as I could. I turned the car off and waited a couple minutes, then tried to turn it on. The car power/battery was still working properly, but the engine did not start. I had the car towed to the dealership that I use.   I was notified that the drivetrain malfunction is due to \"timing chain components failure\" and the cost is approximately $16,000. I have taken care of any previous recalls and there are no open recalls that exist currently. In 2014, the same situation occurred, in the same car, where I also received a \"drivetrain malfunction\" and check engine light. During this time my vehicle also stopped working while I was driving it. Both of these incidents happened very quickly, and I am EXTREMELY lucky that no one was injured in either situation. This issue is extremely unsafe and clearly has not been fixed by the required recalls so far. I urge you to look into this further.",
        "vin": "WBA3B5C54DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "12/24/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448499,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The thermostat is not closing so the engine stays cold. I checked with my mechanic and he says it is a faulty thermostat. BMW owners retort this issue a lot. Only 75k miles on my car",
        "vin": "WBA3B5C59DF"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448276,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My front axle support has extensively rusted, even though the vehicle is only approximately nine (9) years old.  During installation of my Winter tires, a dealership technician found this component rusted through on the passenger side of the vehicle.  The technician described this as severe damage to the suspension system, that is not repaired, could result in an accident.  I have had the component replaced by my independent BMW specialist.  The cost of this repair to me was approximately $1,900.00.  I have retained the component and it is available for inspection.  I believe that the protective coating applied to the component did not provide adequate protection from road salt and water, allowing it to rust.  Much of this component is covered by underbody cladding, hiding it from view.",
        "vin": "WBA3A5G5XDN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437042,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "i was told by couple shops the my timing chain as a problem. Car will not start.....stalled out on a major intersection while my son was driving.... the car just stop working had to get it towed back to the house another expense...the car has been parked for four months and still paying the car note ..I see a drivetrains malfunction on the display... Please help me and keep my son safe.. BMW the ultimate driving machine plz make the safest driving machine.",
        "vin": "wba3b5c59df"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11433916,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We were in a small fender bender and the air bag in this BMW F30 deployed - with some kind of powder and material coming out and BURNING the driver. Burns all over legs and on sensitive areas, burned all the way through his pants. The driver was lucky to have escaped with their life. These were confirmed to be Takata air bags and we found out today 9/21/21 about a recall on the same air bags.  The vehicle was unsafe during sale and serviced not even a a week before the fender bender - we serviced it AT BMW and they did not recall or fully check the vehicle. These faulty air bags were ignored negligently.  BMW does NOT want to repair the fault air bags because there is no official recall. We ask you add more models or assist us to this recall. A driver was injured and this continues to put drivers at risk.",
        "vin": "WBA3B5C50DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431719,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "930A1B Permanent Front passenger seat occupancy detection malfunction  930A1C Permanent Front passenger seat occupancy detection malfunction  930AC9 Intermittent Front passenger seat occupancy detection malfunction  Theres a recall out for it but my vehicles vin wasn't included. Its been killing people   Yes problem was diagnosed by vehicle tech at an auto repair shop  No it has not but I am trying to make an appointment since I'm not sure what to do.   No, no warnings, just one day a message popped up saying there was an issue with the passenger restraint system  and it started to ding. it did that for about 50000 miles then it stopped dinging, but still dings when seat is empty so you have to plug the seat belt in. Its very expensive to fix and have heard of it breaking again after being fixed. Therefore I haven't fixed it but I recently had a recall on my Toyota and ended up seeing the recall on the model of my car for that exact issue.",
        "vin": "WBA3B3C51DF"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11430593,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's mother owned a 2013 BMW 328i. The contact stated while driving 5 mph and approaching a traffic light when another vehicle impacted the rear driver side door.The air bags did not deploy. The contact stated she sustained a mild concussion, has neck, back, and shoulder pains, and stated she had numbness on the left leg and left arm. The contact was taken by an ambulance to the emergency room to seek medical attention. The contact stated that the other vehicle had a 10 and 4-year-old and were also transported by ambulance to the emergency room to seek medical attention for their unknown inquires. A police report was filed. The vehicle was not drivable. The insurance company deemed the vehicle total loss. The vehicle was towed to towing lot first and then to unknown location chosen by the insurance company. The contact called the local dealer and was made them aware of the failure. The manufacturer had not been informed of the failure. The failure mileage was 63,373.",
        "vin": "WBA3B5C57DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425496,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Car stalled while driving on highway due to drivetrain error code. Once stopped, oil pressure loss light came up. No warning lights prior to issue presenting itself at highway speeds.   Initial technician belief is timing belt guide failure per other similar reports.",
        "vin": "WBA3B3C52DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425061,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving, get this error message on the screen when no passenger is sitting in the passenger seat - Passenger restraint system: Malfunction. Continue wearing safety belt. Seems like a big safety issue.",
        "vin": "WBA3B5G54DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423154,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 BMW 328i. The contact stated while driving 5 mph, the vehicle stalled. The contact also stated that the vehicle would not shift gears correctly. The contact stated that the ignition start malfunction warning light was illuminated. The vehicle was towed to a local dealer but was not yet diagnosed. The vehicle was not repaired. The manufacturer was informed of the failure. The failure mileage was approximately 121,000.",
        "vin": "WBA3C1C53DK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422842,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 BMW 328i. The contact stated that at start-up there was white smoke coming from the exhaust. There was no warning light illuminated. The vehicle was diagnosed but not repaired. The manufacturer was informed of the failure. The contact was informed that the Vin was not under recall. The failure mileage was approximately 101,947. This recalls affected vehicles are all F30 models with N26 engine produced from Feb 2012-May 2013. Contact's car is a F30 with N26 engine produced May 01, 2013.",
        "vin": "WBA3C1C5XDK"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420651,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Always get the message: right break light.   I have changed the lightbulb several times and the break light fails to work.  Sometimes it works and sometimes it stops working.   I believe this is common problem based on you tube videos and postings on the internet.  How can it be fixed?",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419337,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 BMW 328i. The contact stated while driving at various speeds, the vehicle failed to properly accelerate while the accelerator pedal was depressed. The contact stated that the drive train malfunction warning light was illuminated. The vehicle was taken to the local dealer where it was diagnosed with the timing chain needing to be replaced. The vehicle was not repaired. The manufacturer was informed of the failure and informed the contact that the vehicle was no longer under warranty. The failure mileage was approximately 117,500.",
        "vin": "WBA3C1C57DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414644,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN GUIDE FAILURE. COULD'VE BEEN PREVENTED HAD WE BEEN PROPERLY NOTIFIED THAT THERE WAS A CLASS ACTION SETTLEMENT AND THAT THIS PART HAD BEEN RE-ENGINEERED IN 2013 DUE TO KNOWN FAILURE. LIMITED WARRANTY LETTER SENT 12/2017 DID NOT ADEQUATELY INFORM US OF THE NEED TO HAVE THIS PART CHECKED AND REPLACED. IN FACT LETTER STATES \"THIS IS NOT A NOTICE OF A RECALL OR SERVICE ACTION.\"    DRIVING FROM LONG BEACH CA TO PHOENIX AZ ON 3/5/21. 90 MILES OUTSIDE OF PHOENIX, ENGINE WARNING LIGHT CAME ON FOR \"LOW OIL PRESSURE\". PULLED OVER, RAN OIL LEVEL CHECK AND IT READ \"FULL\". SEEMED ODD. DROVE ON FURTHER, 20 MINS LATER, SAME MESSAGE CAME ON, PULLED OFF INTERSTATE AND AGAIN RAN OIL LEVEL CHECK, READ FULL. THOUGHT MAYBE IT'S JUST A FAULTY SENSOR AND COULD HAVE IT FIXED WHEN WE ARRIVE TO PHOENIX. NEXT DAY, BROUGHT THE CAR TO CHAPMAN BMW IN PHOENIX AND THEY DIAGNOSED THE PROBLEM AS A CRACKED OIL FILTER HOUSING. WHEN ASKED, \"HOW MUCH OIL WAS IT LOW, AND WHY DID THE OIL LEVEL COME UP FULL IF THERE WAS A LOW PRESSURE?\" THEY DECIDED TO TAKE A CLOSER LOOK. ONLY THEN DID THEY FIND THE BROKEN PART IN AT THE BOTTOM OF THE TIMING CHAIN. THIS FAILED PART ALSO RESULTED IN HAVING TO HAVE OTHER PARTS REPLACED, INCLUDING THE OIL PUMP, DUE TO WORN PLASTIC SHAVINGS RUN THROUGH THE SYSTEM. THIS/THESE ARE ADDRESSED IN THE GELIS, ET AL. V. BAYERISCHE MOTOREN WERKE AKTIENGESELLSCHAFT AND BMW OF NORTH AMERICA, LLC, CIVIL ACTION NO. 2:17-CV-07386 SETTLEMENT. WE HAD JUST PASSED 100K MILES A FEW DAYS BEFORE LEAVING FOR OUR TRIP. HOWEVER, THIS COULD'VE BEEN AVOIDED HAD WE KNOWN THAT THE VEHICLE NEEDED TO HAVE THESE PARTS PRE-EMPTIVELY REPLACED AT A SPECIFIC MILEAGE.    ADDITIONAL PARTS/REPAIRS NEEDED DUE TO THIS PART FAILURE, WE ALSO INCURRED ADDITIONAL UNNECESSARY HOTEL, AIRFARE, AND TRANSPORTATION EXPENSES. ALL OF THIS COULD'VE BEEN AVOIDED IF BMW PROVIDED PROPER MAINTENANCE SCHEDULE",
        "vin": "WBA3C1G51DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408427,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS A 2013 BMW 328I SEDAN. THE PROBLEM HAPPENED WHILE THE CAR WAS IN PARK. I HAD A PASSENGER GET IN THE CAR AND A WARNING APPEARS SAYING \"PASSENGER RESTRAINT SYSTEM MALFUNCTION\". I TOOK IT TO THE DEALERSHIP AND THEY SAID THE ISSUE WAS THE PASSENGER SEAT OCCUPANCY MAT SENSOR. THERE ARE KNOWN RECALLS FOR THIS EXACT ISSUE FOR MULTIPLE MODELS OF BMW FOR A WIDE RANGE OF YEARS. HOWEVER, THEY SAID MY VIN WASN'T COVERED.",
        "vin": "WBA3A5G50DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396991,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S SISTER OWNS A 2013 BMW 328I. THE CONTACT STATED THAT AT START-UP, THERE WAS A HEAVY WHITE SMOKE COMING FROM THE EXHAUST. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT'S SISTER HAD TAKEN THE VEHICLE TO ARROWHEAD BMW (19250 N, AZ-101 LOOP, GLENDALE, AZ 85308) WHERE SHE WAS INFORMED THAT THE FUEL LINE NEEDED TO BE REPLACED. THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE AND THEY INFORMED HER THAT HER VIN WAS NOT UNDER RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "WBA3C1C58DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383999,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW OIL PRESSURE WARNING CAME ON WHILE DRIVING ON A HIGHWAY ASKING ME TO PULL OVER AND DON'T DRIVE THE CAR ANYMORE.     TOOK CAR TO INDEPENDENT BMW REPAIR SHOP THAT RECENTLY CHANGED MY OIL WHO FOUND OIL PRESSURE FAULTS BUT NO DEFINITE FAILURES BUT SUSPECT AN OIL PUMP TIMING CHAIN ISSUE THAT IS COMMON WITH BMW 4 CYLINDER TURBO ENGINES THAT LEADS TO ENGINE FAILURE. THE MECHANIC TOLD ME HE RECENTLY REPAIRED 4 CARS THAT SUFFERED ENGINE FAILURE DUE TO THIS ISSUE.     I TOOK THE CAR TO THE DEALER NEXT DOOR TO FURTHER DIAGNOSE THE ISSUE. HE MADE FURTHER TESTS AT MY EXPENSE AND VERIFIED THERE IS SLACK IN THE TIMING CHAIN. DEALER SERVICE ADVISOR TOLD ME NOT TO DRIVE THE CAR AS IT MAY LEAD TO ENGINE FAILURE. I WAS QUOTED $871 TO FURTHER DIAGNOSE THE ISSUE AND IF THE TIMING CHAIN NEEDED REPLACEMENT THE REPAIR WOULD COST AN ADDITION $5400 . MY CAR IS WORTH BETWEEN 7.5K AND 9K    THERE'S A CLASS ACTION LAWSUIT ABOUT THIS PROBLEM (SEE WWW.TIMINGCHAINMODULESETTLEMENT.COM)  BMW KNOWS THERE'S AN ISSUE WITH THE TIMING BELT IN THIS MODELS THAT MAY LEAD TO ENGINE FAILURE BUT THE SETTLEMENT LIMITS THE MILEAGE TO 100K. UNFORTUNATELY MY CAR HAS GREATER THAN 100K MILES SO I CANNOT PARTICIPATE ON THIS CLASS ACTION LAWSUIT. BUT WHY SHOULD I BEAR THE COST OF FIXING SOMETHING I HAVE NO CONTROL OF THAT LEADS TO ENGINE FAILURE BECAUSE I AM OUT OF WARRANTY? THIS IS POOR DESIGN ON THE PART OF THE MANUFACTURER THAT LEADS TO ENGINE FAILURE AND NEEDS TO BE PART OF A RECALL.",
        "vin": "WBA3B5C57DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383616,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE HAD BEEN DRIVING FOR ABOUT TWO HOURS I DROVE ONTO A HIGHWAY. AS THE VEHICLE APPROACHED SPEEDS OVER 65 MPH THE STEERING WHEEL BECAME \"NOTCHY\" ALMOST AS IF IT WAS JUMPING FROM 15-20 DEGREES BUT NOT SMOOTH. IT BECAME INCREDIBLY DIFFICULT TO DRIVE AND CHANGE LANES. IT SEEMED ALMOST LIKE AN ELECTRICAL PROBLEM AND NOT MECHANICAL. ONCE I EXITED THE HIGHWAY AND WENT BELOW 40MPH THE STEERING RETURNED BACK TO NORMAL SMOOTH OPERATION.",
        "vin": "WBA3A5G59DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377125,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE CAR THIS MONTH AND ALREADY MAKING TIMING CHAIN NOISE I WENT TO INSPECT IT AND THE CHAIN IS REALLY LOOSE",
        "vin": "WBA3C1G52DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375878,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT STATED THAT WHILE STARTING THE VEHICLE, THERE WAS WHITE SMOKE COMING FROM THE EXHAUST TIP. THE CONTACT STATED THAT OIL HAD ENTERED THE TURBO CHARGER CAUSING THE FAILURE. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE HOWEVER, OFFERED NO ASSISTANCE. THE CONTACT MENTIONED THAT THERE WAS A VOLUNTARY EMISSION CAMPAIGN NUMBER: 166EA05 (ENGINE N26) TO REPLACE THE TURBO CHARGER OIL SUPPLY LINES. THE FAILURE MILEAGE WAS APPROXIMATELY 62,000.*DT",
        "vin": "WBA3C1C5XDF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363605,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHT CARRIER BURNED. I HAD CHANGED TAIL LIGHT BULBS SEVERAL TIMES. BUT THEY KEEP BURNING OUT. I EVEN GOT A TICKET FOR BROKEN TAIL LIGHT. I BELIEVE THIS IS AN ISSUE WITH THE CAR AND SHOULD BE CONSIDERED A DEFECT AND RECALLED/REPAIRED.",
        "vin": "WBA3A5G52DN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361512,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE HIGHWAY IN COLUMBUS, OHIO WHEN AN ERROR APPEARED ON MY SCREEN FOR POWERTRAIN MALFUNCTION, PLEASE CONTINUE TO DRIVE MODERATELY. SMOKE CAME FROM MY EXHAUST WHEN GOING OVER 50 MPH SO I PULLED OVER.  TURNED THE CAR OFF AND BACK ON.  ERROR MESSAGE WENT AWAY.  DROVE 20 MPH HOME ON SIDE ROAD.  NO SMOKE APPEARED.  STARTED MY CAR THIS MORNING AND OVER HUGE SMOKE CLOUDS (NOT EVAPORATING)  APPEARED.  CALLED KELLY BMW TO MAKE AN APPOINTMENT.",
        "vin": "WBA3B5G57DN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360679,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT ISSUE WHERE DRIVER'S SIDE DOOR WON'T UNLOCK FROM THE INTERIOR USING THE DOOR HANDLE.  DOOR WILL NOT OPEN UNTIL IT'S UNLOCKED.  DOOR CAN BE UNLOCKED USING THE ELECTRIC CENTRAL LOCKING, AND THEN OPENED USING THE HANDLE.",
        "vin": "WBA3B3C58DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "07/22/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351232,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE TIMING CHAIN FALIURE, HAD BMW LOOK AT IT AND SAID IT SEEMED FINE AND WOULDN'T BE ABLE TO KNOW UNLESS THEY OPEN THE MOTOR $500 TO CHECK? A FEW WEEKS LATER TIMING CHAIN BROKE AT 82,000 MILES.",
        "vin": "WBA3B5C59DF"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340114,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2013 AND WAS PURCHASED IN 2016; WITH MILAGE AT 78,700. ON A COLD START, A HUGE CLOUD OF WHITE SMOKE COMES OUT OF THE RIGHT EXHAUST PIPE. I TOOK IT TO BMW FOR A DIAGNOSTIC TO DETERMINE THE CAUSE OF THE SMOKE. I WAS TOLD IT IS A TURBO FEED LINE AND IF THAT IS NOT IT THEN IT IS THE TURBO CHARGER ENGINE AS A WHOLE. I WAS QUOTE $5000 FOR THE FULL REPAIR ON A CAR. I FOUND A RECALL FOR THE SAME ISSUE ON THE SAME MODEL OF CAR, AND I SPOKE WITH BMW ABOUT IT. THE RECALL IS FOR THE N26 ENGINE AND NOT THE N20 ENGINE WHICH IS ON MY CAR, EVEN IF IT IS THE SAME MAKE, MODEL AND YEAR EXPERIENCING THE SAME ISSUES WITH THE TURBO CHARGER. THE RECALL NEEDS TO COVER ALL ENGINE STYLES FROM THE SAME MAKE AND MODEL BECAUSE THEY ARE HAVING THE SAME ISSUES. MY VIN WAS NOT ACCEPTED AND I WAS DENIED SERVICE HELP. PLEASE I WOULD LIKE TOO ATTACHED TO THIS VEHICLE VIN TO A RECALL FOR A TURBO CHARGER FAILURE. THE RECALL WAS FOR 8 YEARS/ 80,000 MILES AND MY CAR MEETS THOSE REQUIREMENTS.",
        "vin": "WBA3A5C52DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337491,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 75K MILES, THE ENGINE HAS STARTED TO MAKE A \"WHINING\" NOISE AT AROUND 3-4 THOUSAND RPM.  DIAGNOSED AS A TIMING CHAIN TENSION ISSUE THAT MANY SIMILAR CARS WITH THIS ENGINE (N20) HAVE.  THIS APPARENT DEFECT SEEMS TO BE QUITE COMMON AMONG OWNERS OF CARS WITH THIS ENGINE.    CURRENT COURSE OF ACTION IS TO SPEND $4K IN LABOR AND PARTS TO PROACTIVE REPLACE THE TIMING CHAIN AND PLASTIC GUIDES, OR NOT DO ANYTHING.  THE LATTER WOULD SURELY RESULT IN ENGINE FAILURE AND REQUIRE REPLACEMENT (ROUGHLY $20K).",
        "vin": "WBA3A5C50DF"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329467,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE 2013 BMW 328XI BRAND NEW IN 2012. LAST YEAR, I SPENT $2,000 REPLACING THE HIGH PRESSURE FUEL PUMP AFTER MY CAR STALLED IN THE MIDDLE OF DRIVING.   WHEN I WAS GOING IN FOR A ROUTINE INSPECTION, MY MECHANIC INFORMED ME THAT THE TIMING CHAIN NEEDS TO BE REPLACED AND THE COST IS VERY EXPENSIVE. UPON FURTHER RESEARCH, I FOUND OUT THAT THIS IS A PREVALENT ISSUE WITH BMW OWNERS, ESPECIALLY WITH THE N20/N26 ENGINE. I EVEN FOUND OUT THAT THERE IS A PENDING CLASS ACTION LAWSUIT CLAIMING THAT THE TIMING CHAIN BMW USED WAS KNOWINGLY DEFECTIVE! AS OF NOW, MY CAR IS WORTH ABOUT $10,000 AND THE COST TO FIX THIS ISSUE IS ALMOST HALF THE VALUE OF THE CAR. I HAVE NOT GOTTEN THE TIMING CHAIN REPAIRED YET.  *TR",
        "vin": "WBA3B3C54DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323531,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE AMOUNT OF WATER COMES THROUGH CEILING OF PASSENGER COMPARTMENT WHEN IT RAINS. SEAT BELT WARNING INDICATOR SOUNDS CONTINUOUSLY PROBABLY DUE TO SHORT. ONCE THE CAR DRIES OUT, THE INDICATOR STOPS SOUNDING. THIS OCCURS BOTH STATIONARY AND WHILE DRIVING.  *TR",
        "vin": "WBA3C1G53DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322469,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL ISSUES ,BRAKE LIGHTS , PARKING LIGHT , OIL LIGHTS , AND ETC , PURCHASED SEVERAL LIGHT HAD THEM INSTALLED , CONSTANTLY BLOWING OUT AND OTHER LIGHT CUTTING ON AND OFF . SEEMS TO BE AN ISSUE HAS BEEN HAPPENING OVER A YEAR NOW OFF AND ON . NOW SURE IF THE RECALL IN 2015 WAS TAKING CARE . 2ND COMPLAINT FILED .",
        "vin": "WBA3C1C5XDF"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320209,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT , , FLUID LIGHT , PARKING LIGHT ETC . KEEPS COMING ON , LIGHTS KEEP BLOWING OUT WHEN FIXED . SEEMS TO BE AN ELECTRIC ISSUE FROM THE LAST RECALL",
        "vin": "WBA3C1C5XDF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319805,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MY BMW 328I ON A HIGHWAY WHEN A 'CHECK OIL' LIGHT CAME ON. A FEW MINUTES LATER, A 'DRIVETRAIN FAILURE' LIGHT CAME ON. I TOOK THE NEXT EXIT AND WITHIN 3 MINUTES THE ENGINE FAILED. I WAS ABLE TO COAST OVER TO THE BREAKDOWN LANE. I HAD THE CAR TOWED TO THE NEAREST BMW DEALERSHIP. THEY CHECKED OUT THE VEHICLE AND SAID THERE WERE 'METAL FRAGMENTS' IN THE OIL, BUT COULD NOT EXPLAIN WHAT CAUSED THAT WITHOUT DISASSEMBLING THE ENGINE. THEY SAID THE ONLY WAY TO REPAIR THE CAR WOULD BE TO SPEND $15,000 TO  HAVE THE ENGINE REPLACED. I DID A GOOGLE SEARCH AND DISCOVERED THAT HUNDREDS OF BMW OWNERS HAVE HAD SIMILAR EXPERIENCES, AND THE CAUSE WAS A TIMING CHAIN FAILURE. I HAD MY CAR SERVICED JUST 5 WEEKS EARLIER AT MY LOCAL BMW DEALERSHIP, AND THEY EITHER DIDN'T CHECK THE TIMING CHAIN OR DIDN'T NOTICE IT WAS CLOSE TO FAILURE. I WAS LUCKY THAT I WAS ABLE TO GET OFF THE HIGHWAY BEFORE MY ENGINE STALLED, OR I COULD HAVE BEEN INJURED OR KILLED IN HIGH-SPEED TRAFFIC. SINCE THIS IS A KNOWN PROBLEM, BMW SHOULD REPAIR THE DEFECTIVE TIMING CHAIN IN ALL THE AFFECTED VEHICLES, AND IMMEDIATELY NOTIFY OWNERS ABOUT THE DANGER.",
        "vin": "WBA3B5C54DF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319276,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT DRIVERS SIDE TURN SIGNAL WAS BLINKING AT TWICE THE NORMAL RATE WHILE DRIVING.THE WAS ALSO A WARNING LIGHT THAT CAME ON OCCASIONALLY WHEN STARTING THE CAR.  I TOOK IT IN TO OUR MECHANIC WHO SPECIALIZES IN GERMAN MADE CARS AND HE FOUND THAT THE WIRING TO THE LIGHT BULB SOCKET WAS MELTED. HE SUGGESTED WE LOOK FOR A RECALL BECAUSE HE THOUGHT IT WAS SUCH A SAFETY HAZARD  BUT THERE IS NONE LISTED.",
        "vin": "WBA3A5G56DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318539,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILURE RESULTED IN SUDDEN LOSS OF STEERING CONTROL. THIS ISSUE HAS BEEN ADDRESSED BY BMW BUT MY VIN IS NOT INCLUDED IN ANY RECALL OR SERVICE NOTICE. UPON RESEARCH, THIS IS A COMMON SAFETY ISSUE THAT COULD CAUSE CRASH AND INJURY. BMW HAS ADMITTED ISSUES WITH BOLTS THAT SUPPORT THE POWER STEERING FAILING, WHICH CAN DAMAGE AND BREAK THE POWER STEERING. YET THERE IS NO RECALL. THE VEHICLE WAS STATIONARY WHEN THE PROBLEM FIRST OCCURRED. I HAVE LINKED THE NHTSA SERVICE BULLETIN: HTTPS://STATIC.NHTSA.GOV/ODI/TSBS/2019/MC-10153729-9999.PDF",
        "vin": "WBA3B5C5XDF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317813,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST FEB, MY ENGINE LIGHT CAME ON MID-DRIVE, I LOST POWER, ENGINE BEGAN MAKING A STRANGE NOISE HIGH-PITCHED NOISE, ETC. I GET IT TOWED TO P&W BMW IN N. OAKLAND (PITTSBURGH, PA). ALL THAT WEEK, 2 OR 3 TESTS & INSPECTIONS TO TROUBLESHOOT EACH COSTING ABOUT $160/EA AND I WAS TOLD THERE WAS A RECALLED PART THAT WAS REPLACED FREE OF CHARGE. LATER, I LEARNED THAT THE TOTAL ESTIMATE IS ABOUT $6300. THE TIMING CHAIN GUIDE BROKE INSIDE THE ENGINE WHICH DAMAGED THE TIMING CHAIN, GUIDES, OIL PUMP AND OIL PUMP MODULE. I'M STICKER SHOCKED PRIMARILY BC IT'S A BMW WITH 84K MILES (2013 328I XDRIVE) AND I KEEP THE OIL CHANGES ON POINT. UPON RECEIVING A SUMMARY FROM THE SERVICE TECH VIA TEXT, I SEE THE RECALL IS ON A TURBOCHARGER OIL SUPPLY LINE (CAR HAS A TURBO ENGINE). I GOOGLE IT AND IN ABT 10MINS, I LEARN THAT WHEN IT FAILS, THE TIMING CHAIN GUIDE FAILS INSIDE THE ENGINE WHICH DAMAGES THE .... (SEE ABOVE). IN ADDITION, THERE ARE COMPLAINTS GALORE WITH A CLASS ACTION LAWSUIT IN TOW OVER THIS ISSUE AS HUNDREDS HAVE COME FORWARD OVER HAVING TO FORK TO OUT ANYWHERE FROM $4500-$15000 TO REPLACE ENGINES (OR ENGINE PARTS) WITH LESS THAN 90K MILES ON THEM (IN MOST CASES I'VE READ AND I'VE READ ABOUT 50) SINCE 2012 (SOURCE: HTTPS://TOPCLASSACTIONS.COM/LAWSUIT-SETTLEMENTS/LAWSUIT-NEWS/826357-BMW-CLASS-ACTION-SEEKS-FIX-ENGINE-CHAIN-DEFECT/COMMENT-PAGE-2). A FEDERAL JUDGE MADE A PARTIAL RULING AS EARLY AS OCT 2018 AS I'M SURE YOU ARE AWARE. I SPOKE TO THE MANAGER AND THIS IS ALL NEWS TO HIM.",
        "vin": "WBA3B5C51DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306376,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTED LOUD WHIRLING/WHINY SOUND FROM ENGINE. BROUGHT TO MECHANIC AND WAS TOLD TIMING/OIL MECHANISM IS MALFUNCTIONING. IF DRIVEN FURTHER ENGINE MIGHT SEIZE. VALVE COVER WAS REMOVED AND TIMING CHAIN FOUND WITH UNACCEPTABLE SLACK. UPON INVESTIGATION I DISCOVERED BMW NA SENT LETTERS ON EXTENDED WARRANTY FOR MY CAR. I HAVE NEVER RECEIVED SUCH LETTER. CONTACTED BMWNA AND THEY DENY COVERAGE BECAUSE THE CAR WAS NOT REPAIRED AT A DEALER.   I HAD NO WAY OF KNOWING IT HAS TO BE. ALSO AT 34000 MILES WITH PROVEN MAINTENANCE RECORD WAY AHEAD OF ANY MAINTENANCE SCHEDULE PUBLISHED BY BMW I SHOULD HAVE HAVE TO REPAIR TIMING MECHANISM AT A COST OT $2800. WHAT IS MORE SCARY IS THAT THE ENGINE MIGHT HAVE FAILED ON THE HIGHWAY WITH MY KIDS IN THE CAR. PLEASE LOOK INTO N20/26 ENGINE FAILURE RATES AS BMW IS OBVIOUSLY NOT ACKNOWLEDGING THE DANGER \"BUILT IN\" IN THEIR FXX GENERATION CARS.",
        "vin": "WBA3C1C56DK"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300015,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN BROKE WHILE DRIVING UNDER NORMAL CONDITION. HAD TO REPLACE ENTIRE ENGINE WITH USED ENGINE",
        "vin": "WBA3B5C58DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299266,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLING FUEL WHEN I FILL MY TANK AND ALSO NOTICED FUEL ON THE GROUND IF PARKED FOR AN EXTENDED PERIOD.  TOOK MY CAR IN AND THEY STATED THE FUEL TANK HAS A HAIRLINE CRACK AND BMW HAS SINCE REINFORCED THE PART.  SEEMS LIKE THEY KNOW IT IS PRONE TO CRACKING AND HAVE MADE THE FIX BUT NOT ISSUED A RECALL",
        "vin": "WBA3A5C50DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289926,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR NOW HAS APPROXIMATELY 50,000 MILES ON IT. THE STEERING WHEEL HAS INCREASINGLY DETERIORATED, BECOMING VERY SLOPPY AND EVENTUALLY LED TO A KNOCK IN THE STEERING WHEEL RACK. IT IS WELL DOCUMENTED IN HUNDREDS OF ONLINE CHATS, VIDEOS AND FORUMS, THAT BMW HAS BEEN CHANGING THE ENTIRE RACK. THEY HAVE RECENTLY RELEASED A KIT WITH AND UPGRADED BUSHING TO REPAIR THE RACK, THUS ACKNOWLEDGING A COMMON  ISSUE DUE TO A FAILING THRUST ARM BUSHING. THE ORIGINAL BUSHING IS PLASTIC AND SMOOTH, THE NEW BUSHING IS METAL AND RIGID.",
        "vin": "WBA3B5C52DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289523,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER RESTRAINT SYSTEM SENSOR DINGS REALLY LOUD WHEN A PASSAGE OR OBJECT IS IN THE PASSENGER SEAT. THE SENSORS IN THE SEAT THAT TELL THE AIR BAG TO BE ON OR OFF IS MESSED UP.",
        "vin": "WBA3C1G56DN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288471,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF ELECTRICAL ASSIST POWER STEERING (EPS) WHILE VEHICLE STATIONARY - 2013 BMW 328I, 89,500 MILES  UPON STARTUP, WHILE TURNING STEERING WHELL TOMOVE CAR, STEERING SYSTEM EMITTED WHINING NOISE, BANGS AND THUMPS, THEN HIGH PITCHED WHINE.  ALL POWER STEERING WAS LOST, AND CAR HAD TO BE TOWED TO BMW DEALER. DIAGNOSIS WAS MECHANICAL FAILURE OF BOLTS HOLDING POWER STEERING BOX TO THE STEERING RACK, THUS CAUSING DAMAGE TO BOTH COMPONENTS.  DAMAGE REQUIRED ENTIRE STEERING SYSTEM TO BE REPLACED AT $5K+ COST.    CAUSE, AS DIAGNOSED BY BMW DEALER:  EXTENSIVE CORROSION OF ALUMINUM BOLTS HOLDING COMPONENTS TOGETHER CAUSED BOOT FAILURE AND SUBSEQUENT COMPONENT DAMAGE.  NHTSA ISSUE:  UNSAFE COMPONENT DESIGN, AS BOLT FAILURE AT HIGH SPEED COULD CAUSE CATASTOPHIC ACCIDENT.  REMEDIES:  1) NHTSA REQUIRE GENERAL RECALL OF ALL AFFECTED VEHICLES FOR BOLT CHECKING AND REPLACEMENT IF CORROSION PRESENT. 2) NHTSA REQUIRE BMW TO PROVIDE TYPE 316 STAINLESS STEEL FASTENERS WITH SUITABLE DIS-SIMILAR METALS PROTECTION WHERE SAFETY-CRITICAL COMPONENTS EXPOSED TO ROADWAY SALT EXPOSURE. 3) IF THE ABOVE IS NOT WARRANTED DUE TO SMALL NUMBER OF AFFECTED VEHICLES, NHTSA REQUIRE BMW TO ISSUE SERVICE NOTICE FOR ALL AFFECTED VIN NUMBERS TO CHECK CONDITION OF STEERING BOX MOUNTING BOLTS AS PART OF STANDARD INTERVAL MAINTENANCE PROCEDURE.  ATTACHMENTS: PICTURES OF TWO AFFECTED UNITS:  MY 2013 328I CORODED POWER STEERING UNIT, AND A SIMILAR ON FROM A 2012 328I, DOWNLOADED FROM ENTHUSIAST FORUM ON INTERNET, SUGGESTING A PATTERN.",
        "vin": "WBA3A5G58DN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286932,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT/DRIVER DOOR WILL NOT UNLOCK FROM TIME TO TIME WHEN I PULL THE HANDLE",
        "vin": "WBA3A5C57DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281418,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WHEN THE LOW OIL PRESSURE LIGHT CAME ON DUE TO TIMING CHAIN GUIDES FAILING. IT WAS RECOMMENDED BY THE DEALERSHIP SERVICE DEPARTMENT TO REPLACE THE TIMING CHAIN AND GUIDES. THE TIMING CHAINS HAVE FAILED AND IS CLOGGING THE OIL PUMP PICK UP CAUSING THE LOW OIL PRESSURE LIGHT TO ILLUMINATE. THIS OCCURRED ON 11/14/2019 WITH 92,595 MILES.",
        "vin": "WBA3B5C54DF"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278265,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE VEHICLE WAS TAKEN TO CREVIER BMW (1500 AUTO MALL DR, SANTA ANA, CA 92705, (657) 213-3493) TO HAVE AN EXTENDED WARRANTY REPAIR PERFORMED. THE DEALER DISCOVERED THAT THE TURBO COOLANT LINE WAS LEAKING. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 37,986. *BF  CONSUMER HAD A DEFECTIVE NVDL PRESSURE SWITCH WHICH CAUSED THE CHECK ENGINE LIGHT TO GO ON.*JB",
        "vin": "WBA3A5C51DF"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270915,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVETRAIN MALFUNCTION LIGHT CAME ON STATING TO DRIVE MODERATELY.  MAXIMUM DRIVETRAIN OUTPUT NOT AVAILABLE. CONSULT SERVICE CENTER.  THE CODES WAS CDA904 NO MESSAGE (STATUS TRAILER 0X2E4) RECEIVER ENGINE ECU TRANSMITTER TRAILER.  130F20 EXHAUST CAMSHAFT OFFSET ANGEL TO CRANKSHAFT OUTSIDE TOLERANCE; 120408 BOOST PRESSURE CONTROL, CUT OFF PRESSURE RISE BLOCK     AFTER PAYING $180.00 FOR DIAGNOSTIC I WAS TOLD TODAY THAT I NEED TO  REPLACE THE TIMING CHAIN/ GUILD.  REPLACE OIL PUMP CHAIN MODULE AND REPLACE THE VALVE COVER.  THE TIMING CHAIN GUIDE IS BROKEN.  THIS IS CRAZY MY CAR HAS 88000 MILES AND IS NOT PAID FOR.  THE COST TO GET THIS REPAIRED IS APPROXMIATELY $6,000.  THERE IS A CURRENT CLASS ACTION LAWSUIT. BMW KNOWS THAT THIS IS A PROBLEM BUT REFUSES TO DO A RECALL. THE PLAINTIFFS TAKE ISSUE WITH TWO SPECIFIC DEFECTS IN THE ENGINE'S CHAINS. THE FIRST DEFECT AFFECTS THE PRIMARY CHAIN, ALSO KNOWN AS THE TIMING CHAIN, WHICH COORDINATES THE ACTION OF THE CRANKSHAFT, CAMSHAFTS, AND CYLINDER VALVES.    ACCORDING TO THE PLAINTIFFS, THE PLASTIC GUIDE ASSEMBLY FOR THE PRIMARY CHAIN IS MADE OF A DEFECTIVE POLYCARBONATE MATERIAL THAT BECOMES BRITTLE AND BREAKS APART, CREATING DEBRIS THAT LODGES IN THE CRANKSHAFT DRIVE SPROCKETS. THE DEBRIS CAN CAUSE THE PRIMARY CHAIN TO SKIP, LETTING THE CAMSHAFTS AND CRANKSHAFT FALL OUT OF SYNC AND POSSIBLY DAMAGING OR DESTROYING THE ENGINE.    THE SECOND DEFECT AFFECTS THE SECONDARY CHAIN, WHICH CONNECTS THE OIL PUMP AND BALANCE SHAFT ASSEMBLY TO THE CRANKSHAFT. THE MATERIALS IN THIS ASSEMBLY CAN'T STAND UP TO HIGH-RESISTANCE WEAR, THE PLAINTIFFS SAY. THIS DEFECT CAUSES THE CHAIN TO ELONGATE PREMATURELY, SLIP, AND DAMAGE THE CHAIN SPROCKET.  *JS",
        "vin": "WBA3B5C57DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269519,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED AN ABOUT TO BLOW TIMING SHAFT AND TIMING BELT FOR A N26 F30 BMW 328I. WILL CAUSE CATASTROPHIC FAILURE OF ENGINE IN CASE ITS BLOWS UP. I HAD IT HAPPEN TO ME WHEN I HAD 74K  MILES. BMW EXTENDED WARRANTY UNTIL 70K BUT SINCE MY INCIDENT HAPPENED AT 74K BMW REFUSED TO OFFER ANY HELP. THIS IS A MANUFACTURER DEFECT AS THE COMPOSITE MATERIAL USED TO MAKE THE TIMING CHAIN WAS BRITTLE AND WAS REPLACED IN 2015.",
        "vin": "WBA3C1G55DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266631,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I ACCELERATE FROM A STOP SOMETIMES ON MY SCREEN A CHASSIS MESSAGE AND A SERVICE BREAK MESSAGE WILL POP UP ON MY MAIN SCREEN. AFTER THAT, THE TRACTION CONTROL, BRAKE, AND ABS LIGHT ALL POP UP ON MY DASH AND WILL NOT GO OFF UNTIL I SHUT THE VEHICLE OFF AND START IT BACK AGAIN. ONCE I RESTART THE VEHICLE THE LIGHTS ARE GONE. IT DOESN'T AFFECT HOW THE VEHICLE DRIVES AFTER THEY POP UP. HOWEVER, IT SEEMS TO DELAY SHIFTING WHEN THEY INITIALLY POP UP.",
        "vin": "WBA3B3C57DF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/16/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256148,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WORRIED ABOUT BMW TIMING CHAIN IN THE N20 ENGINE. I'VE HEARD SO MANY STORY OF ENGINES GETTING BLOWN AND NEEDING TO BE REPLACED. MY SON DRIVES TO SCHOOL AND I'M WORRIED HE'S GONNA GET STRANDED. HE'S ONLY 16 I WANT HIM TO BE IN A SAFE VEHICLE. BMW NEEDS TO DO A RECALL ON THIS ISSUE MANY PEOPLE ARE HAVING BLOWN ENGINES WITH THE CAR NOT EVEN BEING CLOSE TO BEING PAID OFF.",
        "vin": "WBA3A5C53DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256162,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING THE OIL PRESSURE LIGHT CAME ON, I STOPPED WITHIN 1/2 MILE. DEALERSHIP HAS TOLD ME THAT IT IS CATASTROPHIC FAILURE DUE TO A BROKEN PUMP CHAIN.",
        "vin": "WBA3C1G54DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252443,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE SMOKE COME OUT FROM TAILPIPE AFTER THE COLD STARTS. AFTER RESEARCH, I FOUND IT IS WILL KNOWN ISSUE FOR THIS YEAR'S MODEL. IT IS DEFECTED TURBOCHARGE OIL SUPPLY LINE.THEY HAVE TO DO EMISSION RECALL",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252354,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELTS ON THE BACK SEATS STOP WORKING AFTER I REACH 6500 MILES",
        "vin": "WBA3C1G52DN"
    },
    {
        "components": "SEAT BELTS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243885,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD. ALSO, THE CONTACT HEARD AN ABNORMAL BUMPING NOISE AND THE VEHICLE HESITATED UPON STARTING. WHEN THE VEHICLE WAS RESTARTED, IT RESUMED NORMAL OPERATION; HOWEVER, THE SEAT BELT WARNING INDICATOR ILLUMINATED. THE CONTACT CALLED BMW OF HENDERSON (261 AUTO MALL DR, HENDERSON, NV 89014, (702) 570-0278) AND BMW OF LAS VEGAS (6900 W SAHARA AVE, LAS VEGAS, NV 89117, (702) 570-0279) AND WAS INFORMED THAT THE VEHICLE WAS NOT COVERED UNDER A WARRANTY. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "WBA3A5C53DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242868,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAM SHAFT AND CRANK SHAFT SENSORS HAVE FAILED CAUSING TIMING CHAIN TO FAIL.  THE ENGINE IS NOT SALVAGEABLE",
        "vin": "WBA3B5C59DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242628,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST STARTED EMITTING WHITE SMOKE DURING A COLD START. TOOK IT IN TO SERVICE AND THE OIL SUPPLY LINE IS BAD AND SENDING OIL THROUGH THE EXHAUST. $1500 REPAIR. MEANWHILE A RECALL WAS ISSUED A FEW YEARS AGO FOR THIS VEHICLE BUT OUR VIN DOESN'T FALL UNDER IT. ???",
        "vin": "WBA3B3C5XDF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233993,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG RESTRAINT MALFUNCTION SENSOR KEEPS POPPING UP. I BELIEVE THIS SHOULD BE APART OF THE RECALL ASSOCIATED WITH THE SENOR IN THE SEAT MALFUNCTIONING",
        "vin": "WBA3A5C50DF"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229501,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION FAULT  WHEN DRIVE FEELS LIKE THE CAR ITS LOWERED AND FEEEL EVERITHYNG WITH NO REASON AND THE STAVILITY ITS WEAR I ALMOST KILL MYSELF  BMW HAVE TO CHECK THIS ERROR ON SUSPENSION   OXNARD CALIFORNIA 93033",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220701,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHINING OF THE ENGINE TIMING CHAIN. VISIBLE MARKS ON CHAIN AND ROUGH IDLE ON CAR AND HARD STARTS. TOOK TO MECHANIC AND CAUSE WAS TIMING CHAIN GUIDES BROKEN. SHINY MARKS CAN BE SEEN ON THE CHAIN. CAN BE HEARD WHILE VEHICLE IS IN MOTION, NAMELY WHEN THERE ISN'T MUCH WIND",
        "vin": "WBA3B3C56DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217636,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHEN THE CONTACT PLACED THE VEHICLE IN PARK, SHE NOTICED SMOKE COMING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE CONTACT CALLED SEWELL BMW OF GRAPEVINE (LOCATED AT 1111 E STATE HWY 114, GRAPEVINE, TX 76051) AND WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V627000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 76,149.",
        "vin": "WBA3A5G53DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217229,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE VEHICLE IN LATE MARCH. WE HAVE ALREADY HAD TO GO TO THE REPAIR SHOP MORE THAN 3 OCCASIONS. I BELIEVE THEY ARE USING FAULTY PIECES IN VEHICLES. WE SPENT 13K AND PUT DOWN 4K. NOW WORKING 2 MONTHS THE REPAIRS ARE COSTING CLOSE TO 5K IN 2 MONTHS. I UNDERSTAND BUYING USED VEHICLES AS MY FIRST CAR WAS USED. HOWEVER I HAVE HAD NO ISSUES IN 2 YEARS. I BELIEVE THIS PIECE WAS BROKEN AND THEY DIDN'T WANT TO REPAIR THE ISSUES WITH THE CAR BASED ON COST.",
        "vin": "WBA3B5C50DF"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202974,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING FROM WORK AND THE CAR JUST INSTANTLY SHUT OFF ON THE HIGHWAY. THE CAR WOULDN'T GO INTO NEUTRAL. AFTER DOING SOME RESEARCH ONLINE I SAW THAT IT'S A PROBLEM WHERE A LOT OF BMW OWNERS HAVE ENCOUNTERED. WHAT IF I GOT MY KIDS IN THE CAR THAT DAY",
        "vin": "WBA3B5C56DF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202735,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LOCKING MECHANISM I STARTING TO FAIL. AT TIMES IT IS IMPOSSIBLE TO OPEN A DOOR FROM THE INSIDE BECAUSE OF THE DOOR LOCK ACTUATOR WHEN THE REST OF THE CAR IS UNLOCKED. CURRENTLY, THE ONLY METHOD TO UNLOCK IT WOULD BE FROM THE KEY OR THE DOOR UNLOCK BUTTON IN THE CENTER OF THE VEHICLE. THIS COULD BE DANGEROUS IN SITUATIONS WHERE ONE WOULD NEED TO EXIT THE VEHICLE BUT THEY CANNOT BECAUSE THE DOOR WILL NOT OPEN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194390,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE BRAKE LIGHT AND SIGNAL LIGHT CONNECTOR MALFUNCTION",
        "vin": "WBA3A5C52DF"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "04/06/2019",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11194490,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR INVOLVED IN REAR END COLLISION AND CAR CAUGHT FIRE AND BURNED UP. AIR BAGS DID NOT DEPLOY. CAR  WAS IN SLOW MOTION APPROACHING A STOP LIGHT WHEN HIT IN REAR . ROAD CONDITIONS SUNNY AND DRY. MY CAR  WAS PUSHED INTO CAR IN FRONT CAUSING MORE DAMAGE. ACCIDENT OCCURRED IN ILLINOIS 159 IN GLEN CARBON,ILL.",
        "vin": "WBA3A5G52DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193014,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AN AIRBAG FAULT APPEARS AS 'PASSENGER RESTRAINING MALFUNCTION. KEEP WEARING SEATBELT AND CONTACT NEAREST DEALER. '  THIS CODE CAME UP OVER A YEAR AGO AND THE DEALER CLEARED THE CODE. NOW IT'S BACK AFTER BEING ON AND OFF FOR OVER 6MONTHS. THIS TIME IT'S CONSTANT AND THE DEALER TODAY SAID THAT THE SENSOR PAD UNDER THE SEAT / SENSOR HAS TO BE REPLACED. THE COAST IS $1400. THIS IS NOT RIGHT AND FAIR. IN CASE OF AN ACCIDENT MY PASSENGER WILL NOT BE PROTECTED. 1000S ONLINE COMPLAIN OF THE SAME ISSUE AND BMW ISN'T DOING ANYTHING ABOUT IT.",
        "vin": "WBA3A5G51DN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191736,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LOCK ACTUATORS HAVE FAILED. THIS MAKES IT SO THAT THE DOORS DO NOT OPEN WHEN YOU ARE INSIDE THE VEHICLE ATTEMPTING TO GET OUT BY PULLING THE DOOR HANDLE. THIS IS A SAFETY ISSUE NOT ALLOWING ME TO GET OUT OF MY VEHICLE. IF THIS ISSUE IS NOT RESOLVED BY PAYING THE $1500 TO FIX THE ISSUE THE DOORS WILL STOP OPENING COMPLETELY MAKING THIS EVEN MORE OF A SAFETY ISSUE OVER TIME. THIS ISSUE ONLY GETS WORSE AND IS DIRECTLY RELATED TO THE FUNCTIONALITY OF THE CAR. THIS DOOR LOCK ACTUATOR SHOULD BE RECALLED ON ALL VEHICLES BMW MAKES THAT ARE HAVING THIS SAME ISSUE. THIS IS A KNOWN LONG-STANDING ISSUE WITH THESE VEHICLES AND HAS YET TO BE RECALLED EVEN THOUGH IT IS ABSOLUTELY A SAFETY ISSUE. BMW SHOULD NOT BE ABLE TO PROFIT OFF OF THEIR POOR SAFETY MANUFACTURING MISTAKES.",
        "vin": "WBADW7C58DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11186678,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TRAVELING FREE FROM OTHER TRAFFIC OR OBSTACLES WHEN, WITHOUT WARNING, THE SUNROOF GLASS SHATTERED CAUSING A LOUD SOUND THAT DISTRACTED THE DRIVER.  RESULTANT GLASS PARTICLES ENTERED THE VEHICLE COMPARTMENT, CAUSING A MINOR INJURY TO THE RIGHT HAND OF THE DRIVER.  AS SEEN IN THE ATTACHED PHOTOS, THE GLASS EXPLODED OUTWARD, INDICATING THAT THIS WAS NOT DUE TO AN EXTERNAL IMPACT.  VEHICLE WAS TRAVELING AT HIGHWAY SPEED ON INTERSTATE 74 EASTBOUND JUST WEST OF INDIANAPOLIS, INDIANA",
        "vin": "WBA3B3G52DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186257,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FWY. THE SYSTEM IN MY CAR ANOUNCED FOR ME TO STOP AS IT WAS DETECTING AN ERROR. I PULLED ASIDE TURN OFF THE ENGINE, WAITED SOME TIME, TURNED ENGINE BACK ON AND CAR WOULD NOT START. CALLED TOWING SERVICES AND TAKEN TO A MECHANIC. PER MECHANIC THE MOTOR ENGINE DIED. HAD NO CAR SINCE 12/20/2018. PLEASE ASSIST  INCIDENT HAPPEN ON 12/20/2019 NEAR CERRITOS CALIFORNIA. 605 S FWY AROUND 6:30AM",
        "vin": "5UXWX9C52D0"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175132,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT STOP LIGHT, WARNING ON THE DASHBOARD \"DRIVE MODERATELY, INCREASED STEERING EFFORT REQUIRED. CONSULT SERVICE CENTER.\" THE STEERING WAS VERY TOUGH TO ROTATE AND IT CREATED PANIC.  AFTER A COUPLE OF HOURS, RESTARTED CAR AND THE STEERING WAS MORE MANAGEABLE.  DEALER CAME BACK SUGGESTING THE CAR NEEDS \"REPROGRAMMING\" AND DESPITE UNDER BMW PLATINUM EXTENDED WARRANTY 236 USD WAS CHARGED . SHOULD HAVE BEEN COVERED OR AN OUTRIGHT RECALL  INSTEAD OF CHARGING AS IF IT IS A FEATURE. I WOULD REQUEST NHTSA TO LOOK INTO THE MATTER AND MAKE BMW RESPONSIBLE FOR SUCH MISTAKES INSTEAD OF CONSUMER PAYING. I COULD HAVE BEEN IN AN ACCIDENT ON THE FREEWAY FOR A SOFTWARE BUG WHICH BMW CREATED. IF THIS IS HOW BMW INTENDS TO MAKE MONEY OF SERVICE, IT IS A SERIOUS CORRUPTION AND SHOULD BE INVESTIGATED. LET ME KNOW IF YOU IF YOU NEED ANY FURTHER INFORMATION TO MAKE A CASE OR TEST THE CAR. FAULT CODES 4823C2 480AB8",
        "vin": "WBA3A5C50DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171980,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A TURBO PROBLEM. MY CAR IS SHAKING WHEN I TURN IT ON. WHEN I REVERSE, THE CAR SHUTS DOWN.",
        "vin": "WBA3B3C51DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "12/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11171734,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS GOING DOWN A HILL (STRAIGHT FORWARD) ON A CA CITY STREET WHEN THE DRIVER SHIFTED FROM AUTO TO MANUAL GEAR. INSTEAD OF WORKING AS EXPECTED, THE CAR UNDERWENT A SUDDEN ACCELERATION AND BRAKING PROVED INEFFECTIVE. THROUGH A COUPLE SECONDS OF ATTEMPTED BRAKING WITH NO RESPONSE, THE CAR KEPT ON ACCELERATING INSTEAD. FINALLY, AFTER MAKING TWO TURNS ON THE HILL, THE CAR SPUN COMPLETELY OUT OF CONTROL AND SWERVED TO THE OTHER SIDE OF THE STREET WHERE IT CRASHED THROUGH FIVE TREES AND EVENTUALLY STOPPED. THE DRIVER LOSS OF CONSCIOUSNESS AND DELIVERED TO ER. THE WEATHER CONDITION WAS GOOD. THE FAILURE MILEAGE WAS 79,541. POLICY REPORT FILED.",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/14/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169906,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AND PASSENGER TRAPPED IN CAR AFTER PARKING AT AS GAS PUMP. DOORS WOULD UNLOCK BUT NOT OPEN RESULTING IN THE POTENTIAL OF KILLING ITS PASSENGERS IN A CRASH. THERE IS A VIDEO ON YOUTUBE OF A SIMILAR INCIDENT.",
        "vin": "WBA3B3G52DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163339,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A BURN SMELL IS COMING THRU THE VENT",
        "vin": "WBA3A5G51DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157273,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WEST ON I-70 FROM INDIANAPOLIS, IN TOWARDS TERRE HAUTE, IN  SUNROOF EXPLODED OUTWARD.  EXTREMELY LOUD NOISE LIKE GUN SHOT.  VERY LITTLE TRAFFIC AND NOTHING HIT MY CAR.  GOING 70 IN 70MPH ZONE.  TEMP APPROX. 38 DEGREES. GLASS FELL IN TO VEHICLE AND ON ME AND IN HAIR.",
        "vin": "WBA383C5XDF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154001,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN PARK OR WITH ENGINE \"OFF\" THE DRIVER AND PASSENGER DOORS FAIL TO OPEN WHEN INTERNAL HANDLE IS PULLED. THE PIN RISES WHEN HANDLED IS PULLED AND RETRACTS BACK WHEN HANDLE IS RELEASED FAILING TO \"UNLOCK\" THE DOOR. VEHICLE CANNOT BE EXITED IN A CASE WHEN FAST EGGRES IS NEEDED OR WHEN THERE IS NO POWER TO USE THE POWER LOCK/UNLOCK. CAN BE DEADLY IN A CAR FIRE OR SIMILAR GRAVE CONDITION.",
        "vin": "WBA3C1C56DK"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150233,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER AND PASSENGER DOORS OCCASIONALLY DO NOT UNLOCK FROM INSIDE THE VEHICLE, TRAPPING ME INSIDE. PRESSING THE UNLOCK BUTTON IN THE DASHBOARD WORKS, BUT PULLING THE PHYSICAL HANDLES DOES NOT.",
        "vin": "WBA3B3C52DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143336,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG RESTRAINT ERROR OCCURS SECONDARY TO A FAULTY BATTERY CABLE.",
        "vin": "WBA3A5G51DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142361,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN OIL LEAK STARTED AROUND 75K. NOTICED IT IN MY GARAGE. I'VE ONLY HAD THIS CAR FOR 2 YEARS.",
        "vin": "WBADW7C54DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141272,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT STATED THAT THE COOLANT WARNING INDICATOR ILLUMINATED. THE CONTACT ADDED COOLANT, BUT THE INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ELECTRICAL SENSOR FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT TO TAKE THE VEHICLE TO A DEALER. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 125,573.",
        "vin": "WBA3C1G51DN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139279,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, THE WARNING CAME ON THAT SAYS DRIVETRAIN MALFUNCTION AND IT WILL BARELY GO.",
        "vin": "WBA3B3C55DF"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133501,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "3 DAYS AFTER RECEIVING AN OIL CHANGE AND BRAKE PAD CHANGE, WHILE DRIVING ON A CITY STREET AT APPROXIMATELY 25MPH MY CAR SPONTANEOUSLY SWITCHED INTO NEUTRAL AND I COULD NO LONGER ACCELERATE. MY DASHBOARD STATED THAT I HAD A DRIVETRAIN MALFUNCTION AND THAT MAXIMUM OUTPUT WAS NOT AVAILABLE.  I PROCEEDED TO TAKE MY CAR INTO BMW IN ORDER TO GET A DIAGNOSIS. WHEN I RECEIVED THE DIAGNOSIS I WAS TOLD THAT MY ENGINE WAS NON OPERABLE AND I WOULD HAVE TO PAY TEN THOUSAND  TO CHANGE ENGINE. THE TECHNICIAN STATED IT WAS BECAUSE  OF AN INTERNAL ENGINE FAILURE, AND THAT THE REASON FOR THE FAILURE WAS UNKNOWN BUT IT WAS MORE THAN LIKELY A BAD OIL FILTER. MY VEHICLE HAS HAD TWO RECALLS CONCERNING OIL AND I AM CONCERNED THAT  IT IS A MANUFACTURING DEFECT. THANK YOU",
        "vin": "WBA3B5C55DF"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119293,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN NOT RESPONDING TO GAS INPUT AND TURBO STARTED GOING OUT. DIAGNOSTIC APPEARED TO REVEAL WASTE GATE OPERATOR MALFUNCTION, BUT FURTHER ANALYSIS SHOWED COMPLETE TURBO REPLACEMENT REQUIRED. VEHICLE BEGAN MAKING HIGH PITCHED NOISE AT VARIOUS POINTS (IDLE AND ACCELERATION). LESS THAN 90K MILES ON VEHICLE.",
        "vin": "WBA3B3C56DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118068,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2013 BMW 328I WITH MELTING INTERIOR DOOR HANDLES.  I SEE THAT THERE IS A KNOW PROBLEM.  WHY ISN'T A RECALL.  THIS BLACK GOO GETS ALL OVER YOUR HANDS",
        "vin": "WBA3A5C53DF"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111123,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GETTING AN INTERMITTENT PASSENGER RESTRAINT SYSTEM MALFUNCTION. IT STATES THE PASSENGER AIRBAG WILL BE DEACTIVATED. THE ERROR IS OCCURRING WHEN A PASSENGER IS IN THE PASSENGER SEAT, AND ALSO NOW WHEN THE SEAT IS EMPTY. AFTER SEARCHING THIS ERROR MESSAGE, THIS APPEARS TO BE A COMMON ISSUE WITH DIFFERENT YEARS AND MODELS OF BMW.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110686,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT 65MPH, THE PLASTIC TIMING CHAIN GUIDES BREAK CAUSING THE ENGINE OIL PRESSURE TO DROP AND TIMING CHAIN SNAPS AND LEAD TO SEVERE ENGINE DAMAGE WHILE CAR IS IN MOTION. THE ENGINE STOPS WORKING AND LOSES POWER WHILE MOVING WHICH IS DANGEROUS. BMW ISSUED A TSB FOR THIS ISSUE AS THE PART WAS DEFECTIVE FROM FACTORY HOWEVER, DID NOT ISSUE A RECALL.",
        "vin": "WBA3B5C55DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11102686,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING 50 MPH, THE OIL PUMP AND DRIVETRAIN WARNING INDICATORS ILLUMINATED. WHILE DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE VIOLENTLY JERKED AND STALLED. AS A RESULT, THE CONTACT SUSTAINED INJURIES TO THE BREAST, BUT DID NOT REQUIRE MEDICAL ATTENTION. THE CONTACT ATTEMPTED TO RESTART THE VEHICLE, BUT WAS UNSUCCESSFUL. THE CONTACT WAS IN HEAVY TRAFFIC AND WAS NOT ABLE TO COAST TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO RALLYE BMW (1 BRUSH HOLLOW RD, WESTBURY, NY 11590, (516) 393-0000) WHERE IT WAS DIAGNOSED THAT THE OIL PUMP AND DRIVETRAIN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE REPAIR FEES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 67,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102346,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2016 I WAS DRIVING ON A VERY BUSY PARKWAY IN THE AFTERNOON AT ABOUT 45 MPH (WHICH IS A LEGAL SPEED LIMIT) WHEN MY CAR STARTED SHUDDERING, SHAKING AND SLOWING DOWN AND A MESSAGE CAME ON SAYING \"DRIVE TRAIN MALFUNCTION.\" I IMMEDIATELY CALLED MY HUSBAND WHO TOLD ME TO PULL OVER AND SHUT OFF THE CAR FOR 5 MINUTES. HE MANAGED TO CALM ME DOWN. WHEN I RESTARTED THE CAR,  THE CAR COULD NOT START I WAS VERY SCARED THE CAR WAS TOW TO BMW AND THEY STATE IT WAS RHE STARTER  THAT WHEN BAD. I  HAD  RETURN THE CARE SEVERAL TIME TO BMW FOR THE SAME NOISE  I WAS TOLD THE HAVE A TECH FROM THE HEAD QUARTER   CAME OUT AND THE CAR IS PERFECTLY FINE .THE SAME HING HAPPEN 2 YEAR LATER  AND I WAS  ON THE HIGHWAY DURING THE INCIDENT. BMW SERVICE TOLD ME THE ENGINE FAIL AND I NEED A NEW ENGINE  WHICH WOULD COST ME $10,000 WE WERE READING ALL THE COMPLAINTS AND PRIMARILY THEY ARE ABOUT THE DRIVE TRAIN MALFUNCTION - IT HAS A FAULTY PLASTIC PART, WHICH SINCE 2015 WAS REPLACED BY A METAL PART. I WAS DRIVING IN THE MIDDLE LANE OF A VERY BUSY HIGHWAY AND I COULD HAVE BEEN KILLED O). WHAT DOES IT TAKE FOR BMW OR NHTSA TO ISSUE A RECALL FOR THIS PROBLEM - A DEATH OR FEW?  THERE IS NO WAY A 5 YEAR OLD CAR  ENGINE SHOULD HAVE FAIL  WITH JUST 70,000 MILES.",
        "vin": "WBA3B5C59DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/08/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101767,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A LEAKING COMING FROM THE ENGINE BAY AREA I REPLACE THE VALVE COVER GASKET   BUT THAT HASN'T STOP THE SMOKE COMING OUT OF THE CAR I'VE SEEN IN SEVERAL BMW FORUMS THAT OWNERS OF 3 SERIES HAVE COMPLAIN ABOUT THESE AND THE TWO MAJOR PROBLEMS THAT CAUSE THIS IS 1. THE VALVE COVER GASKET OR THE TURBO OIL LINES   THE OIL GET INTO THE CATALYST CONVERTER AND START SMOKING AND HEATING AND THIS MIGHT CAUSE A FIRE  WHILE YOU ARE DRIVING OR COMING TO A COMPLETE STOP",
        "vin": "WBA3A5C54DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093496,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LEFT BRAKE LIGHT AND TURN SIGNAL STOPPED WORKING. I HAVE CHECKED AND FOUND OUT THAT THE GROUND WIRE ON THE CONNECTOR HAS OVER HEATED AND BROKEN.",
        "vin": "WBA3C1G50DN"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11090090,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING 40 MPH, THE VEHICLE STALLED WITHOUT WARNING AND FAILED TO SHIFT INTO NEUTRAL. ADDITIONALLY, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. THE DRIVER SUSTAINED INJURIES TO THE NECK AND BACK, A HEAD CONCUSSION, RUPTURED BLOOD VESSELS, AND A FACE CONTUSION THAT REQUIRED MEDICAL ATTENTION. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THERE WAS NO UPDATE ON THE STATUS OF THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS 79,000.",
        "vin": "WBA3C1C51DF"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082077,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUNROOF SHATTERED WHILE DRIVING ON THE INTERSTATE TO WORK WHICH CAUSED A LOUD NOISE AND SHARDS OF GLASS TO ENTER MY CAR.  I DID NOT SEE ANYTHING THAT WOULD HAVE HIT THE SUNROOF TO CAUSE IT TO SHATTER.  I HAVE SEEN OTHER COMPLAINTS ABOUT EXPLODING SUNROOFS AND I WANTED TO SHARE MY STORY AS WELL.  FORTUNATELY MY SON WAS NOT IN MY CAR OR HE WOULD HAVE LIKELY HAD GLASS HIT HIM SINCE MOST OF WHAT ENTERED THE CAR LANDED IN THE BACKSEAT.",
        "vin": "WBA3A5G59DN"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2018",
        "dateOfIncident": "02/23/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074690,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ARRIVED AT HOME, TURNED THE VEHICLE OFF, AND SAW SMOKE COMING FROM HOOD AND SMELL OF SOMETHING BURNING.  OPENED THE HOOD, AND SAW THAT THE SMOKE WAS DUE TO OIL DRIPPING ONTO THE CATALYTIC CONVERTER.  THERE WAS NO FIRE.  THE VEHICLE WAS THEN TOWED TO DEALER DUE TO RISK OF FIRE. VIDEO IS AVAILABLE IF NEEDED; PLEASE CONTACT ME.",
        "vin": "WBA3B5C59DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067288,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A FREEWAY, I GET THIS WARNING ON THE DASHBOARD \"DRIVE MODERATELY, INCREASED STEERING EFFORT REQUIRED. CONSULT SERVICE CENTER.\" THE STEERING WAS VERY TOUGH TO ROTATE AND IT CREATED PANIC. I PULLED TO THE NEAREST PARKING LOT AND STOPPED. AFTER A COUPLE OF HOURS,  THE STEERING WAS MORE MANAGEABLE. I DECIDED TO DRIVE TO BMW DEALER FOR DIAGNOSTIC AND REPAIR OF THE CAR. AFTER A DAY OF TESTING, THE DEALER CAME BACK SUGGESTING THE CAR NEEDS A SOFTWARE UPDATE AND WILL COST 600 USD. I WAS VERY SURPRISED THAT THE SOFTWARE UPDATE SHOULD HAVE BEEN A RECALL INSTEAD OF CHARGING AS IF IT IS A FEATURE. I WOULD REQUEST NHTSA TO LOOK INTO THE MATTER AND MAKE BMW RESPONSIBLE FOR SUCH MISTAKES INSTEAD OF CONSUMER PAYING. I COULD HAVE BEEN IN AN ACCIDENT ON THE FREEWAY FOR A SOFTWARE BUG WHICH BMW CREATED. IF THIS IS HOW BMW INTENDS TO MAKE MONEY OF SERVICE, IT IS A SERIOUS CORRUPTION AND SHOULD BE INVESTIGATED. LET ME KNOW IF YOU IF YOU NEED ANY FURTHER INFORMATION TO MAKE A CASE OR TEST THE CAR.  ## VIN PASSED ## 2013 ##",
        "vin": "WBA3A5C59DF"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062979,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO WHEEL RIMS CRACKED, ONLY 38,000 MILES ON VEHICLE. RIMS WON'T WITHSTAND NORMAL ROAD CONDITIONS. THEY ARE A SAFETY HAZARD NEVER KNOW WHEN THEY WILL CRACK AND CAUSING LOOSING CONTROL WHILE DRIVING.",
        "vin": "WBADX7C57DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061217,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO OPEN THE DRIVERS SIDE DOOR BY PULLING THE HANDLE IT DOES NOT UNLOCK AUTOMATICALLY. THE ONLY WAY TO EXIT THE VEHICLE IS THROUGH ANOTHER DOOR OR BY USING THE CENTRAL LOCK/UNLOCK BUTTON. MY FEAR IS THAT IN THE CASE OF AN EMERGENCY OR ACCIDENT IF THE ELECTRICAL SYSTEM IS COMPROMISED I COULD POSSIBLY BE TRAPPED IN THE VEHICLE. I ATTEMPTED TO HAVE THIS REPAIRED AT THE BMW DEALERSHIP BUT THEY CLAIM THAT THE PROBLEM BEING MECHANICAL IS NOT COVERED BY THE WARRANTY. ON THE BMW INTERNET FORUMS THERE ARE MULTIPLE POSTS ACROSS VEHICLE MODELS COMPLAINING OF THE SAME FAULTY \"DOOR ACTUATOR\" AND BMW'S UNWILLINGNESS TO REPAIR IT FREE OF CHARGE. I WAS QUOTED OVER $950 TO REPLACE THE PART. THIS IS A SERIOUS LIFE SAFETY ISSUE I BELIEVE NEEDS TO BE INVESTIGATED.    THANK YOU VERY MUCH!",
        "vin": "WBA3A9G54DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058401,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - CONTACTED DEALERSHIP A WHILE AGO BUT NO ACTION HAS BEEN TAKEN YET TO REMEDY THE POTENTIALLY FATAL SITUATION.",
        "vin": "WBADW7C59DE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057838,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR OPENING AND CLOSING- DR/SIDE, WHEN EXITING INNER DOOR HANDLE LOSES SPRING TENSION BECOMES LOOSE, AFTER EXITING DOOR WON'T CLOSE OR SOMETIMES WHEN INNER HANDLE BECOMES LOOSE INNER OR OUTER HANDLE WON'T OPEN DR/SIDE DOOR FORCING YOU TOEXIT ON THE PASSANGER SIDE WHILE VEHICLE IS STANDING",
        "vin": "WBADW7C50DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054553,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SUN VISOR/VANITY MIRROR FALLS OUT AT SWING ARM PERIODICALLY WHEN GOING OVER BUMP OR ROUGH ROAD. THIS HAPPENS WHEN IT IS PULLED OUT AT AN ANGLE TO SHIELD FROM SUN COMING IN FROM SIDE. IT FALLS ON YOUR HEAD.  THERE IS A WIRE THAT RETAINS IT SO IT DOESN'T FALL TO THE FLOOR BUT SWINGS IN THE AIR.  DEALER SAYS IT IS NOT A DEFECT, CAN'T FIX IT, HAS TO REPLACE WHOLE ASSEMBLY. I BELIEVE IT IS A DEFECT WITH HOW THE VISOR IS RETAINED AT IT'S PIVOT END. IT GOES INTO A SOCKET IN THE ROOF AND IS RETAINED BY A SPRING CLIP THAT CAN'T BE REPLACED SEPARATELY AND IS PART OF THE WHOLE VISOR ASSEMBLY.",
        "vin": "WBADW7C54DE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052102,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE WITH $7000 DOWN AND THE FIRST WEEK THE \"DRIVETRAIN MALFUNCTION\" WARNING CAME ON AS I WAS ENTERING THE FREEWAY. THEY SAID IT HAD TO DO WITH THE TURBO. IT HAS BEEN LESS THAN 2 YEARS AND MY CAR HAS BEEN IN THE SHOP 7 TIMES FOR A \"DRIVETRAIN MALFUNCTION\". I HAVE HAD TO PULL OVER IN THE MIDDLE OF TRAFFIC MOST OF THE TIME OFF THE FREEWAY. AND, AGAIN TODAY (12/3/2017) I WAS ENTERING THE FREEWAY AND ALSO HIT A SEMI WHEN MY CAR LOST POWER DUE TO THE DRIVETRAIN MALFUNCTION.",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045523,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL ; MY CAR IS ON THE RECALL LIST BUT KNOW ONE AT THE  DEULER KNOW ANYTHING OF A RECALL FOR BMW",
        "vin": "WBA3C1G5XDN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "08/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I HAVE REGISTERED THIS VEHICLE WITH BMW BUT HAVE NOT BEEN ADVISED AS TO WHEN THEY WOULD BE FIXING THE AIRBAG.",
        "vin": "WBADW3C51DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024591,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED BMW OF GWINNETT PLACE (3264 COMMERCE AVE, DULUTH, GA 30096 (678) 608-0800) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBADW3C57DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021700,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELLING AT 60 MPH ON THE HIGHWAY I GOT A MESSAGE \"DRIVETRAIN MALFUNCTION\". BEFORE I WAS ABLE TO STOP, THE CAR SHUT DOWN. IT WAS TOWED TO THE DEALER AND THEY TOLD ME THE PLASTIC TIMING CHAIN COVER BROKE OFF AND PERMANENTLY DAMAGED THE ENGINE. IT WILL COST ME $8300 TO REPAIR. AFTER SOME RESEARCH, I FOUND OTHERS HAVE HAD THIS HAPPEN AND THAT BMW HAS SINCE CHANGED THE DESIGN.",
        "vin": "WBA3B5C55DF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/02/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021165,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO OPEN BOTH THE DRIVER AND PASSENGER SIDE FRONT DOORS, PULLING ON THE HANDLE TWICE WOULD NOT UNLOCK AND OPEN THE DOOR.  THE ONLY WAY TO EXIT THE VEHICLE IS BY PRESSING THE ELECTRICAL UNLOCK BUTTON.      THIS HAPPENS INTERMITTENTLY, THE DATE BELOW IS ONLY ONE OF THE MANY OCCURRENCES.  THE DEALER HAS ATTEMPTED TO FIX IT 4 TIMES.  NONE HAS BEEN SUCCESSFUL.     THIS IS A SAFETY ISSUE.  IF WE NEEDED TO EXIT THE CAR AND THE ELECTRICAL SYSTEM WAS DISABLED, WE WOULD BE UNABLE TO.     I HAVE VIDEOS OF THIS HAPPENING BUT THE FORM WON'T LET ME UPLOAD THEM.",
        "vin": "WBA3C1C55DK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015062,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/5/2017 I WAS DRIVING ON A VERY BUSY GARDEN STATE PARKWAY IN THE AFTERNOON AT ABOUT 65 MPH (WHICH IS A LEGAL SPEED LIMIT) WHEN MY CAR STARTED SHUDDERING,  SHAKING  AND SLOWING DOWN AND A MESSAGE CAME ON SAYING \"DRIVE TRAIN MALFUNCTION.\" I IMMEDIATELY CALLED MY HUSBAND WHO TOLD ME TO PULL OVER AND SHUT OFF THE CAR FOR 5 MINUTES.  HE MANAGED TO CALM ME DOWN.  WHEN I RESTARTED THE CAR, THE MESSAGE WAS GONE AND IT DROVE OK.  I WAS VERY SCARED TO DRIVE IT BUT THE MESSAGE HAS NOT COME BACK.  INSTEAD MY HUSBAND'S BMW X3 2013 HAD THE SAME MESSAGE 2 MONTHS LATER AND HE WAS ALSO ON THE HIGHWAY DURING THE INCIDENT. BMW SERVICE TOLD HIM THAT THE PROBLEM IS THE TIMING BELT.  WE WERE READING ALL THE COMPLAINTS AND PRIMARILY THEY ARE ABOUT THE DRIVE TRAIN MALFUNCTION - IT HAS A FAULTY PLASTIC PART, WHICH SINCE 2015 WAS REPLACED BY A METAL PART.  I WAS DRIVING IN THE MIDDLE LANE OF A VERY BUSY HIGHWAY AND I COULD HAVE BEEN KILLED (AND MY HUSBAND TOO).  WHAT DOES IT TAKE FOR BMW OR NHTSA TO ISSUE A RECALL FOR THIS PROBLEM - A DEATH OR FEW?",
        "vin": "WBA3A5C54DJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004756,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT EXPERIENCED AN ISSUE WITH THE SEAT BELT LATCHING. THE VEHICLE WAS TAKEN TO NALLEY BMW OF DECATUR WHERE IT WAS DIAGNOSED THAT THE SEAT BELT BUCKLE WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004330,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (BRIAN HARRIS BMW LOCATED AT 12336 AIRLINE HWY, BATON ROUGE, LA 70817; (225) 754-1200) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED AT 800-525-7417 AND ADVISED THE CONTACT TO CALL THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBADW3C55DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994243,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS, WHEN MY CAR WAS STOPPED AT A LIGHT OR STOPPED IN BUMPER TO BUMPER TRAFFIC, THE CAR REVED TO 6 OR 7000 RPM AND THEN ACCELERATED ON ITS OWN.  I COULD NOT STOP THE CAR AND I HIT THE CAR IN FRONT OF ME.  THERE WAS VERY LITTLE DAMAGE TO MY CAR, AND LITTLE DAMAGE TO THE OTHEI DO NOT FEEL SAFE IN THIS CAR AS I KNOW THERE IS A PROBLEM AND WILL HAPPEN AGAIN.",
        "vin": "WBA3A5C58DF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991668,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY, IT INDEPENDENTLY ACCELERATED AT A HIGH RATE OF SPEED. AS A RESULT, THE VEHICLE CRASHED INTO THE BACK WALL OF THE GARAGE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE AIR BAGS DID NOT DEPLOY. NO INJURIES WERE SUSTAINED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS INFORMED THAT THEY WOULD SEND AN ENGINEER OUT TO FURTHER INSPECT THE VEHICLE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.  UPDATED 05/31/17 *BF  UPDATED 06/02/2017*JS",
        "vin": "WBA3B3C53DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991176,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN IS MAKING A WHINE AND A RATTLE SOUND WHEN ENGINE IS RUNNING.  THE N20 ENGINE (TWIN TURBO 4 CYLINDER) IN THIS CAR ANY MANY OTHER BMW VEHICLES TIMING CHAINS ARE KNOWN TO STRETCH AND BREAK ALONG WITH THE ORIGINAL BROWN/DARK ORANGE COLOR PLASTIC TIMING CHAIN GUARD RAIL. THE TIMING CHAIN GUARD RAIL WAS MADE OUT OF A DEFECTIVE PLASTIC UNTIL AROUND 1/1/15 WHEN BMW REALIZED THERE WERE OWNERS HAVING CATASTROPHIC ENGINE FAILURE NOT IF THE CHAIN BREAKS, BUT WHEN.  THE ONLY REPAIR IF THE ENGINE FAILS IS TO REPLACE THE ENGINE AT A COST OF APPROX. $12K AND $8K IN LABOR TOTALING ABOUT $20K WHICH EXCEEDS THE VALUE OF MY VEHICLE. VEHICLES WITH THIS ENGINE MANUFACTURED AFTER 1/1/15 HAVE THE REDESIGNED MORE DURABLE WHITE PLASTIC TIMING CHAIN GUARD RAIL ALLOWING THE ENGINE TO RUN SMOOTHER AND WITHOUT THE RISK OF ENGINE CATASTROPHIC FAILURE.  THERE IS A GRAVE SAFETY RISK FOR OWNERS WITH THIS ENGINE WITH THE ORIGINAL PRE-2015 TIMING CHAIN & GUARD RAIL DESIGN BECAUSE IF YOU ARE TRAVELING IN NORMAL TRAFFIC OR ATTEMPTING TO CROSS A TRAIN TRACK OR OTHER DANGEROUS INTERSECTIONS, OCCUPANTS CAN BE KILLED AS A RESULT OF THE VEHICLE STALLING. CONTACTED BMW NORTH AMERICA ON 5/19/17 REGARDING THE ISSUE AND HAD THE VEHICLE INSPECTED BY MY LOCAL BMW DEALERSHIP WHO INDICATED THERE WAS NOTHING WRONG.  THE TOTAL COST TO REPLACE MY ORIGINAL TIMING CHAIN AND TIMING CHAIN GUARD RAIL WITH THE RE-DESIGNED VERSION WOULD COST $4600 WITH PARTS & LABOR.  BMW USA AND THE DEALERSHIP REFUSED TO COVER THE COST AND DENIED THIS IMPORTANT SAFETY DEFECT.  I ALSO PROVIDED THEM A COPY OF A WEB LINK WITH A YOUTUBE VIDEO OF THE ISSUE NARRATED BY AN INDEPENDENT BMW TECHNICIAN EXPLAINING THE DEFECT. SEE THE LINK BELOW WHICH CONTAINS PHOTOS AND THE YOUTUBE VIDEO RELATED TO THIS ISSUE.   HTTPS://BMWTECHNICIAN.COM/2016/08/07/N20-TIMING-CHAIN-ISSUE/",
        "vin": "WBA3B3C53DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991248,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL PUMP FAILURE CAUSED CAR TO CEASE OPERATING.  CAR SHUT DOWN COMPLETELY WHILE IN MOTION. I WAS DRIVING THROUGH A PARKING STRUCTURE AT THE TIME.   ULTIMATELY, THE CAR WAS TOWED TO A DEALER FOR REPAIR.",
        "vin": "WBA3A5C50DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990576,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT OCCUPANCY SENSOR MAT HAS FAILED DISABLING AIR BAGS IN VEHICLE",
        "vin": "WBA3B3C54DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "04/03/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986334,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBAKE3C51DE"
    },
    {
        "components": "WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "02/15/2017",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985416,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING 65 MPH, THE VEHICLE INDEPENDENTLY DRIFTED FROM SIDE TO SIDE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WHEELS NEEDED TO BE ALIGNED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DETERMINED THAT THE VEHICLE WAS FUNCTIONING AS DESIGNED. THE VEHICLE WAS TAKEN BACK TO THE DEALER A THIRD TIME, BUT THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE HAD PREVIOUSLY BEEN SERVICED PER NHTSA CAMPAIGN NUMBER: 13V454000 (SERVICE BRAKES, HYDRAULIC). WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT NOTICED A BURNING OIL ODOR AND NOTICED SMOKE COMING FROM THE VEHICLE. THE CONTACT DROVE HOME AND DISCOVERED THAT THE VEHICLE HAD AN OIL LEAK. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE VACUUM PUMP FAILED, WAS LEAKING, AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 45,000.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "04/03/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981272,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY CAR TO THE DEALERSHIP AND ASKED FOR THIS LOCK ISSUE TO BE REPAIRED AT LEAST 6 TIMES DURING THE PAST FIVE YEARS.  OVER THE PAST TWO YEARS THE ISSUE HAPPENS MORE FREQUENTLY.  AT TIMES I AM IN THE CAR WITHOUT IT RUNNING, THEN I GO TO OPEN THE DOOR AND I AM LOCKED INSIDE.  THE HANDLE ACTS LIKE IT IS GOING TO OPEN BUT THE DOOR DOES NOT OPEN.  THE HANDLE LIFTS BUT DOES NOT MOVE THE LOCK.  I HAVE TO USE A BUTTON ON THE CONSOLE OR THE KEY FOB TO UNLOCK ALL THE DOORS ELECTRONICALLY.  I FIND THIS NOT SAFE BECAUSE IF THE AUTOMOBILE DOES NOT HAVE ELECTRIC SUPPLY THE DRIVERS DOOR NEEDS TO BE ABLE TO OPEN.  THIS CONCERNS ME IF THERE WAS A ACCIDENT OR URGENT NEED.     I HAD SOME OTHER SUSPENSION ISSUES THAT I REPORTED.  YOU COULD HEAR A LOUD SOUND AND I WAS TOLD FOR A OVER YEAR IT WAS NOT A ISSUE.  FINALLY MY HUSBAND WAS GOING TO COME TO THE DEALERSHIP AND THEY SAID THEY FOUND THE PROBLEM DID  OVER $6,000 IN WARRANTY REPAIR ON A FAULTY BOOT PART BEFORE THE WARRANTY EXPIRED.  I HAD THE PROBLEM FOR A LONG TIME!  BMW DIAGNOSTIC AND SERVICE IS NOT WHAT IT USED TO BE.",
        "vin": "WBA3B3C51DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981053,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR COMPLETELY STALLED OUT FOR NO SPECIFIC REASON. THIS OCCURRED ON FREEWAY WITH CARS ALL AROUND I WAS LUCKY TO BE ABLE TO COAST TO SHOULDER.  CHECKED ON BOARD VEHICLE STATUS ALL CHECKED \"OK\".  AFTER A SHORT TIME CAR STARTED RIGHT UP DROVE IT HOME AND NEXT MORNING IT STALLED OUT AGAIN WHILE ON A CITY STREET. THIS TIME UNABLE TO PUT INTO NEUTRAL, ELECTRONICS WORKED, HAD TO FLAT  , HAD TO FLAT BED IT TO THE DEALER.   THIS MAKES THIS CAR DANGEROUS AND UNRELIABLE.  CAR IS CURRENTLY IN FOR REPAIRS.   ATTACHED IS THE RECOMMENDED SERVICES HAVE NOT RECEIVED COMPLETED WORK REPORT.",
        "vin": "WBA3C1G50DN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2017",
        "dateOfIncident": "04/04/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978502,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT SMELLED STRONG FUEL ODORS IN THE VEHICLE. THE ODOR WAS ALSO PRESENT WHILE THE VEHICLE WAS BEING FUELED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENTIRE FUEL SYSTEM FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO STATED THAT THE VEHICLE JERKED AT TIMES. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 44,000.",
        "vin": "WBA3A5C59DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2017",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955060,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT CRACKS, CHIPS, DEFECTS INSIDE OF HEADLIGHT HOUSING. VEHICLES ARE NOT THAT OLD AND THE DEFECT TENDS TO APPEAR ON ALL F30 BMW 3 SERIES MODELS. COULD WORSEN OVER TIME AND CREATE VISIBILITY ISSUES.",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/12/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954323,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS ON STANBY WAITING FOR SOMEBODY TO MOVE OUT OF SPOT SO I CAN PARK AND MY  FOOT ON THE BRAKES THE ENGINE REVED UP ABOVE THE 6000 RPM ON ITS OWN.",
        "vin": "WBA3A5G50DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950107,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT RECEIVED A RECALL REPAIR FROM THE DEALER CONCERNING THE AIR BAGS. THE DEALER INDICATED THAT THE REMEDY WAS AN INTERIM FINAL REPAIR, BUT NOT A PERMANENT REPAIR SOLUTION. THE MANUFACTURER FAILED TO PROVIDE THE PARTS FOR THE AIR BAG RECALL WITHIN A REASONABLE TIME FRAME. THE CONTACT WAS UNABLE TO DETERMINE IF THE MANUFACTURER PROVIDED THE ACTUAL REPLACEMENT PARTS OR THE SAME PART THAT WAS PREVIOUSLY IN THE VEHICLE. PER THE DEALER, THE MANUFACTURER CLEARED THE RECALL INFORMATION OUT OF THE SYSTEM. THE CONTACT RECEIVED NO RESOLUTION FROM THE MANUFACTURER REGARDING THE REPLACEMENT PARTS. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 04/19/17 *LJ    *CN",
        "vin": "WBADW3C50DE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947282,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A LETTER FROM BMW ON  MARCH 2016 ABOUT THE DRIVERS FRONT AIR BAG MODULE NEED TO BE REPLACED WHEN PARTS COME AVAILABLE, AND TODAY JANUARY 23 2017 I WENT TO THE DEALER ASKING ABOUT ANY UPDATES AND THEY TOLD ME THAT PARTS ARE NOT AVAILABLE YET. I ASKED THE ADVISOR IF THIS RECALL ABOUT MY SAFETY BAGS ARE DANGEROUS AND HE TOLD ME NO . SO THANKS FOR THIS WEB I FINALLY FOUND OUT THAT IS DANGEROUS. SO HOW LONG I HAVE TO WAIT?",
        "vin": "WBADW3C58DJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936231,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING APPROXIMATELY 30 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO OPERATE. AS A RESULT, THE VEHICLE CRASHED INTO THE CURB AND THE BRAKES ENGAGED INDEPENDENTLY. THE VEHICLE WAS TOWED TO A DEALER WHERE THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 37,000.",
        "vin": "WBA3B3C57DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926110,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS NOW A REPEAT PROBLEM (3 TIMES).  DRIVING AT SPEED ON LOCAL ROADS THE CAR DROPS TO IDLE SPEED AND THERE IS NO RESPONSE FROM THE GAS PEDAL.    THIS MORNING I HAD JUST GOTTEN THE CAR BACK FROM BMW SERVICE AND WAS DRIVING BACK TO WORK WHEN THE SAME THING HAPPENED.    THIS TIME IT HAPPENED AS I WAS TURNING ACROSS THE ONCOMING TRAFFIC LANE AND I WAS LET BASICALLY STATIONARY IN THE ONCOMING LANE.",
        "vin": "WBA3B5C56DF"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919303,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SEEMS THAT I HAVE DAMAGE TO MY VALVE CAM, WELL JUST LOOKED UP AND THE VEHICLE WAS INVOLVED IN AN ACCIDENT THAT WAS NEVER REPORTED TO ME AT THE TIME OF PURCHASE - I AM LOOKING AT PAYING OVER 1700 FOR A VALVE COVER (LABOR AND MATERIAL).  MY AIR BAG LIGHTS CAME ON IN JULY AND I AM TOLD THAT MY VIN IS NOT UNDER RECALL - WHEN I TOOK TO MECHANIC I WAS TOLD TO TAKE TO BMW TO HAVE ADDED TO RECALL.  *TR",
        "vin": "WBAPH7G50AN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917316,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TWO DRIVE TRAIN MALFUNCTION MESSAGES SINCE BUYING THE CAR FOUR MONTHS AGO. THE FIRST MESSAGE CAUSED MY CAR TO STALL, AND I WAS STUCK IN THE MIDDLE OF THE ROAD, WITH THE ASSISTANCE OF THE POLICE, IN ST.LOUIS. THIS SECOND TIME I HAD TO HAVE THE CAR TOWED INTO THE DEALERSHIP (IN TACOMA WA)  WHERE IT IS CURRENTLY. I AM WORKING WITH THE DEALERSHIP TO RESOLVE THE PROBLEM. MY CAR IS STILL UNDER CPO WARRANTY AND I AM CONCERNED THAT BMW WILL NOT BE WILLING TO RECTIFY THE PROBLEM, OR GIVE ME A VEHICLE OF THE SAME VALUE. I HAVE PAID OVER 26,000 FOR THIS VEHICLE AND AM CONCERNED ABOUT THE VALUE OF MY INVESTMENT. BOTH INCIDENTS OF THE ERROR MESSAGE OCCURRING, I WAS LOCATED ON THE HIGHWAY. THE FIRST INCIDENT OCCURRED IN AUGUST. THE SECOND INCIDENT OCCURRED YESTERDAY, OCTOBER 19TH, 2016.   \"DRIVETRAIN MALFUNCTION, MAXIMUM OUTPUT NOT AVAILABLE, CONSULT SERVICE CENTER\".",
        "vin": "WBA3A5C5XDF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2016",
        "dateOfIncident": "09/25/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909560,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I TOOK MY CAR IN TO BMW FOR RECALL AND WAS TOLD THEY DON'T HAVE THE PART TO REPLACE THE RECALL DUE TO A BACKOERDER. I HAVE CALLED SEVERAL TIMES TO FIND OUT IF THEY HAVE THEM YET AND HAVE BEEN TOLD NO EACH TIME. MY BMW DISPLAYED A \"RESTRAINT SYSTEM MALFUCTION\" LIGHT TODAY. I AM WORRIED THIS MAY HAVE SOMETHNG TO DO WITH THE RECALL. ARE THESE PARTS TRULY ON BACK ORDER?",
        "vin": "WBADW3C57DJ"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10908348,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 04/21/2015 I WAS DRIVING AND MY 2013 328I BMW WAS OUT OF CONTROL MY CAR SPED UP WHICH HAS TO DO WITH SPEED CONTROL AND POWER TERRAIN. I TRIED TO STOP, BRAKE AND WAS UNSUCCESSFUL MY CAR WOULD NOT STOP, MY WHEEL STIFFENED UP, I COULDN'T STEER LEFT OR RIGHT,,, I ENDED IN A CAR ACCIDENT... MY SEATBELT  CAME OFF BY ITS SELF, AND MY AIRBAGS NEVER WENT OFF!!! MY NECK AND BACK/TAILBONE WAS INJURED DO TO YOUR DEFECTIVE  CAR (2013 328I BMW) DEFECTIVE( STEERING WHEEL,BRAKES,SEATBELT, SPEED CONTROL, POWER TRAIN..) AFTER THE ACCIDENT I REQUESTED A CRASH REPORT !!! WAITING TO HERE FROM BMW MANUFACTURER,. SEEKING COMPENSATION FOR PAIN AND SUFFERING... I WAS ADMITTED AT KERN MEDICAL CENTER ON MOUNT VERNON AVE.. IN  BAKERSFIELD CALIFORNIA.... MAKING YOU AWARE OF THEIR DEFECTIVE CAR 2013 318I BMW... HAVEN'T HERD FROM THE MANUFACTURERS.... WORRIED CONSUMER!!! THOUGHT THAT  VOLKSWAGEN WOULD STAND BY THEIR PRODUCT.... MASSIVE RECALL NEEDED ON ALL 2013 328I BMW... HOPE TO HEAR FROM YOU SOON!!!THE VEHICLE WAS IN MOTION .... I JUST COULDN'T STOP THE CAR!!!!! HUGE RISK/DRIVING HAZARD!!!!! ON A CITY STREET!!!! I HAVE ACCIDENT REPORT ON HAND TO PROVE MY STATEMENT OF FACTS!!!",
        "vin": "WBA3C1C55DF"
    },
    {
        "components": "STEERING,AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10908560,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 BMW 328I. WHILE DRIVING 25 MPH, THE VEHICLE ACCELERATED ON ITS OWN TO 40-50 MPH. ALL THE WARNING INDICATOR SENSORS BLINKED ON AND OFF. THE CONTACT DEPRESSED THE BRAKE PEDAL; HOWEVER, THE BRAKES FAILED AND LOCKED UP. IN ADDITION, THE STEERING FAILED. THE VEHICLE DROVE OVER THE SIDEWALK AND THE SEAT BELT RELEASED AUTOMATICALLY. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE STRUCK HER HEAD ON THE STEERING WHEEL AND INJURED HER NECK AND LOWER BACK. MEDICAL ATTENTION WAS RECEIVED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DEEMED DESTROYED. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000....UPDATED 12/14/16 *BF  UPDATED 12/20/16*LJ  *TR",
        "vin": "WBA3C1C55DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906072,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT FILLED THE VEHICLE WITH FUEL AND PARKED THE VEHICLE IN HER GARAGE OVERNIGHT. THE FOLLOWING DAY, THE CONTACT NOTICED AN ABNORMAL ODOR AND A FUEL LEAK ON THE GROUND. THE VEHICLE WAS DRIVEN TO A MECHANIC WHO DIAGNOSED THAT THE SEAL ABOVE THE FUEL TANK FRACTURED AND WOULD RECUR IF THE FUEL TANK SYSTEM WAS NOT UPGRADED. THE FUEL TANK WAS REPLACED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "08/13/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905879,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS SUBJECTED TO THE TAKATA AIRBAG RECALLED ACCORDING TO THE VIN. I TRIED TO CONTACT BMW LOCAL IRVINE DEALER OFFICE AND BMW NORTH AMERICA, I WAS TOLD THE \"PROMOTIONAL OFFER\" FOR ME TO TURN THE LEASED CAR EARLY HAD EXPIRED, AND IT WAS A \"LOW RISK\" THING FOR ME TO KEEP DRIVING THE CAR UNTIL MY LEASE ENDS. THERE IS NO PARTS AVAILABLE FOR ME TO EVEN GET THE AIRBAG REPLACED AND I STILL HAVE 2 MONTHS LEFT ON THE LEASE. I'M DRIVING IN FEAR EVERYDAY HOPING THIS AIRBAG WON'T DEPLOY ON ME DURING HIGH TEMPERATURE DAYS.",
        "vin": "WBAKE3C5XDE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899248,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I RECEIVED A LETTER FROM BMW ON MARCH 2016 NOTIFYING ME OF THE DRIVER'S FRONT AIR BAG MODULE RECALL, CAMPAIGN NO. 16V-071.  BMW DID NOT HAVE ANY PARTS AVAILABLE AT THE TIME OF NOTIFICATION AND INDICATED THEY WOULD NOTIFY ME AS SOON AS THEY ARE ABLE TO PERFORM THE RECALL ON MY VEHICLE.  I AM CONCERNED FOR MY SAFETY AND I THINK WAITING FOR THE AIRBAG TO BE FIXED SINCE MARCH IS A REASONABLE AMOUNT OF TIME, CONSIDERING THE SERIOUSNESS OF THIS MATTER.  IF THERE IS ANYTHING I CAN DO TO SPEED UP THIS PROCESS, PLEASE LET ME KNOW.",
        "vin": "WBAKF5C52DE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "07/03/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10892993,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2013 BMW 3 SERIES SEAT HEATER BURNED MY BACK.  THE SEAT HEATER WOULD COME ON AUTOMATIC WHILE I WERE DRIVING CAUSING A BURN ON MY BACK . HAPPEN IN THE MONTH OF JULY WHICH SEAT HEATER SHOULDN'T BE ON. INFORMATION WERE GIVEN TO  LOCAL DEALERSHIP AND ALSO TO BMW  OF NORTH AMERICA.  I STATED THAT I HAVE PICTURES OF MY BURNED BACK.  THE DEALERSHIP STATED THEY FOUND NO FAULT IN  THE SEATS. WHICH I KNOW IS INCORRECT BECAUSE OF MY INJURIES.  I KNOW THERE'S A MALFUNCTION IN THE SEAT HEATER OR A PIECE OF EQUIPMENT FAIL TO FUNCTION NORMALLY. I PAID FOR A  DIAGNOSTIC TEST  FOR THIS PROBLEM.",
        "vin": "WBA3A5G57DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885651,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CAN'T HANDLE HEAVY RAIN WITH MEDIUM SIZED PUDDLES.  THE OWNER'S MANUAL CLEARLY STATES, \"DRIVE THROUGH CALM WATER ONLY IF NOT DEEPER THAN 9.8 INCHES, NO FASTER THAN WALKING SPEED UP TO 6MPH.\"   THIS PUDDLE WAS UNDER 4 INCHES AS I MEASURED AND TOOK PHOTOS, BUT BMW REFUSES TO WARRANTY THE WORK.  THEY CLAIM THE ENGINE HYDROLOCKED RESULTING IN FULL REPLACEMENT OF THE ENGINE.  A QUICK TRIP TO GOOGLE AND YOU WILL SEE MANY PEOPLE COMPLAINING OF THE SAME ISSUE.  WE WERE THE ONLY CAR DISABLED.   2 DEALERS ADMITTED TO ENGINEERING FLAWS, BUT LAUGHED AT BMW COVERING THE REPAIRS.  BMW USA WAS OF NO HELP EITHER.",
        "vin": "WBA3B5C56DF"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881371,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER RESTRAINT SYSTEM MALFUNCTION KEEPS COMING ON SINCE I PURCHASED VEHICLE AND HENDRICK BMW HAS TRIED TO REPAIR MY CAR MULTIPLE TIMES BUT ISSUE STILL CONTINUES AFTER MULTIPLE PARTS OF SEAT AND WIRING HAS BEEN REPLACED AND AIR BAGS REMOVED AND REINSTALLED.",
        "vin": "WBA3A5C56DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855404,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I HAVE BEEN ATTEMPTING TO WORK WITH BMW CORPORATE AND THE LOCAL DEALERSHIP IN RIDGEFIELD CT WHERE I LEASED THE VEHICLE FOR THE PAST 3 MONTHS AND I HAVE YET TO SUCCESSFULLY RESOLVE THE SITUATION.  I HAVE 4 MONTHS LEFT ON MY LEASE AND I WANT BMW TO TAKE THE VEHICLE BACK EARLY AS IT IS UNSAFE TO DRIVE.  I SURVIVED A TRAIN CRASH IN NY JUST OVER A YEAR AGO WHERE 5 PEOPLE WERE KILLED IN THE FRONT CAR I WAS SEATED IN AND I'M NOT GOING TO RISK GETTING KILLED BY A FAULTY AIRBAG.",
        "vin": "WBADX7C54DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855197,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW 328I 2013 HAS A DRIVETRAIN MALFUNCTION SECOND TIME IN LESS THAN A MONTH. AFTER READING BMW THREADS ON THIS PARTICULAR PROBLEM IT'S A FACT THAT THIS IS A COMMON ISSUE FOR 2013 BMW OWNERS AND A RECALL SHOULD BE SENT OUT IMMEDIATELY TO RESOLVE THIS ISSUE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852014,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAE IN VALUE $5000 LESS DUE TO RECALL AIR BAG",
        "vin": "WBADW3C57DJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839564,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN'T GET THE CAR INTO NEUTRAL. TOW TRUCK DRIVER WAS NOT ABLE TO GET CAR INTO NEUTRAL AS WELL. COULD NOT GET ACCESS ON SIDE OF ROAD TO GET CAR INTO NEUTRAL . THE PROCEDURE IN THE MANUAL DID NOT WORK. THIS SHOULD BE ILLEGAL, THERE SHOULD BE A MANUAL RELEASE FROM WITHIN THE INSIDE OF THE CAR",
        "vin": "WBA3B5C50FF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "08/12/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748506,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING AT APPROXIMATELY 45 MPH, THE BRAKE PEDAL HAD TO BE DEPRESSED WITH FORCE IN ORDER TO SLOW DOWN AND STOP THE VEHICLE. THE FAILURE WAS RECURRING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.",
        "vin": "WBA3A5C57DJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/07/2015",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723832,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN I-5 SOUTH ON JUNE 6 AT ABOUT 6.30 PM WITH 2 OF MY FRIENDS. THERE WAS TRAFFIC ON THE HIGHWAY AND I APPLIED MY BRAKES AFTER SEEING THE VEHICLE IN FRONT OF ME SLOWING DOWN TO A COMPLETE STOP. MY CAR SLOWED DOWN BUT IT WOULD NOT COME TO A COMPLETE STOP. IT KEPT ROLLING. I PRESSED THE BRAKES HARD BUT I COULD FEEL A SQUEALING FEELING IN THE BRAKES AND IT JUST WOULD NOT STOP.IT KEPT ROLLING. I RELEASED PRESSURE ON THE BRAKES FOR A MOMENT AND APPLIED FULL PRESSURE AGAIN BUT STILL  IT WOULD NOT STOP. I FELT LIKE SOMETHING WAS LEAKING AS I PRESSED DOWN ON THE BRAKES AND THE THE COMPLETE HOLD AND STOP THAT HAPPENS AFTER THE BRAKES ARE PUSHED TO THE FLOOR DID NOT HAPPEN THIS TIME. I PULLED THE HAND BRAKES BUT BY THAT TIME IT WAS TOO LATE. MY CAR THEN ROLLED ON BUMPED INTO THE CAR IN FRONT OF ME WHICH MADE IT COME TO A STOP.     I WOULD LIKE TO ADD THAT THIS HAS HAPPENED PREVIOUSLY IN THE PAST. THE FIRST TIME IT HAPPENED I HAD SENT MY CAR TO BMW SEATTLE WHEN MY CAR SHIFTED TO NEUTRAL BY ITSELF BECAUSE OF AN ENGINE FAILURE AND AS IT WAS ROLLING DOWN I PRESSED THE BRAKES BUT COULD NOT PUSH IT DOWN. I HIT A PAVEMENT BY THE RIGHT TO MAKE IT STOP .BMW SEATTLE SAID THAT THEY COULD NOT FIND ANY FAULT EVEN AFTER ME REPEATEDLY TELLING THEM THAT IT DID HAPPEN AND SOMETHING WAS WRONG. THIS ISSUE RESURFACED A FEW WEEKS BACK BUT LUCKILY THERE WAS NO ONE IN FRONT OF ME AND AFTER REPEATEDLY RELEASING THE BRAKES AND PRESSING IT HARD WITH FULL FORCE I MADE IT COME TO A COMPLETE STOP.   UNFORTUNATELY THIS TIME I MET WITH AN ACCIDENT BECAUSE OF THIS ISSUE.  I AM NOW REALLY UNSURE OF DRIVING MY CAR ANYMORE.MOREOVER MY TRUST ON BMW IS COMPROMISED AS THEY TOLD ME THAT THIS ISSUE CANNOT AND DID NOT HAPPEN. IF THE SERVICE TEAM CANNOT FIND A GENUINE FAULT WITH THEIR SYSTEM THAT IS HAPPENING REPEATEDLY I DONT THINK THEY CAN BE TRUSTED WITH THE SAFETY OF THE CAR.",
        "vin": "WBA3A5G56DN"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717822,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SEEPING INTO THE TURBO SYSTEM CAUSING MODERATE TO HEAVY WHITE SMOKE FROM EXHAUST AT COLD START UP ONLY.",
        "vin": "WBA3C1G56DN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "02/22/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701910,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPROACHING A RED LIGHT AND ATTEMPTING TO APPLY BRAKES, THE BRAKE PEDAL BECAME VERY FIRM AND NORMAL BRAKING FUNCTION WAS LOST. THE ONLY WAY TO BRING THE CAR TO A STOP AND AVOID AN ACCIDENT WAS TO DEPLOY THE EMERGENCY BRAKE.     THIS OCCURED ON 2/20/15, AND BMW SERVICE ATTEMPTED TO REPAIR THE ISSUE.    A SECOND, IDENTICAL INCIDENT OCCURED ON 3/10/15.  *TR",
        "vin": "WBA3B5G51DN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691962,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD SOME SNOW HERE IN NEW YORK THIS PAST WINTER. IT SEEMS AS IF THERE MAY BE A DESIGN FLAW WITH THE WINDSHIELD WIPER. FOR WHATEVER REASON THE WINDSHIELD WIPER ON THE RIGHT HAND SIDE POPPED. PER THE DEALER THIS OUTSIDE INFLUENCE VOIDED THE GUARANTEE AS THERE WAS ICE UNDER THE COWL WHERE THE ARM IS CONNECTED TO THE MOTOR. THE PHOTO IN THE ATTACHMENT SHOWS THE AREA IN QUESTION. WHAT GETS ME IS THE \"ICE BUILDUP\" THAT CAUSED THIS TO HAPPEN MOST LIKELY CAME FROM THE DEFROSTER. THE SNOW MELTS AND DRAINS DOWN INTO THE AREA IN QUESTION.     I'M ENCLOSING A COPY OF MY CORRESPONDENCE WITH THE BMW DEALER.    1 ATTACHMENT (1307.1 KB)    CLICK FOR OPTIONS       VIEW SLIDE SHOW (1)    DOWNLOAD AS ZIP    ADD TO ONEDRIVE      HI [XXX],      HERE'S A PICTURE OF MY CAR. I'M LETTING MOTHER NATURE GET RID OF THE ICE. THE DESIGN MIGHT WORK IN FLORIDA. IT'S A DESIGN DEFECT THAT, IF YOU ASK ME, SHOULD BE COVERED!      REGARDS,      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBA3B5C58DF"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10663366,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 BMW 328I. WHILE DRIVING 63 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE FAILED TO RESPOND. IN ADDITION, NO WARNING LIGHTS ILLUMINATED. AS A RESULT, THE CONTACT CRASHED INTO ANOTHER VEHICLE AND THE AIR BAGS EXPLODED, EJECTING METAL FRAGMENTS. THE CONTACT SUSTAINED LEG, RIBS, AND STERNUM INJURIES. THE PASSENGER SUSTAINED BRUISES, A PUNCTURED INTESTINE, NECK, AND RIB INJURIES. BOTH THE DRIVER AND PASSENGER REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,500. ..UPDATED 12/29/14 *BF",
        "vin": "WBAVM1C57DV"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/26/2014",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661090,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 32K MILES I HAD A CRACKED RIM AFTER A TIRE ROTATION.  AT 56K MILES I HAVE ANOTHER CRACKED RIM AFTER TIRE ROTATION.  I HAVE READ UP AND MANY PEOPLE ARE SAYING THEY HAVE CRACKED RIMS EVEN WITH PEOPLE UP TO 10K MILES ARE SEEING THIS.  I DRIVE NORMAL AND HAVE NOT HIT POT HOLES OR CURBS.  THE COST IS 395.00 A RIM AND NOT COVERED UNDER WARRANTY THEY SAY IT MY DRIVING ME HITTING SOMETHING.  I OWNED A 2007 BMW 328I FOR 6 YEARS AND DROVE THE HECK OUT OF THAT CAR HITTING HOLES, CURBS, STUFF IN ROAD AND NEVER HAD THIS PROBLEM I AM HAVING NOW.    *TR",
        "vin": "WBA3A5C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/21/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639921,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE FAILED TO STOP WHEN THE BRAKE PEDAL WAS FULLY APPLIED. AS A RESULT, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE. THERE WAS NO POLICE REPORT OR INJURIES. THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 12,600.    UPDATED 11/20/14*CN    UPDATED 5/5/2015  *JS",
        "vin": "WBA3C1C58DF"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628205,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON  AUGUST 18, 2014, MY 2013 BMW 328I WITH AUTOMATIC TRANSMISSION, SUDDENLY AND  UNINTENTIONALLY ACCELERATED AS I SLOWLY PULLED INTO A PARKING SPOT AT WORK. IT HAPPENED  AS I PREPARED TO STOP. ( MY FOOT WAS ON THE BRAKE.)  IT FAILED TO STOP OR SLOW DOWN IN RESPONSE TO BRAKE PRESSURE.  PUMPING THE BRAKES WAS TOTALLY INEFFECTIVE HOWEVER IT DID EVENTUALLY STOP  APPROX. 6FT OVER THE CURB.  THE CAR MOVED SO QUICKLY AND SO SUDDENLY  THE DRIVER PULLING IN BEHIND ME FOR AN INSTANT DIDN'T KNOW WHERE I HAD GONE.  THAT THIS HAPPENED IN A PARKING SPOT AND NOT ON THE ROAD AT A STOP LIGHT OR A CHILDREN CROSSING IS A MIRACLE.  THIS AUTOMOBILE WAS PURCHASED NEW AND HAS APPROX 8000 MILES.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "05/21/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608683,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN TAKEN BACK 3X IN THE PAST 3 MONTHS FOR THE SAME ISSUE THE CAR TURNS OFF BY ITSELF WHEN STOPPED. BMW DEALERSHIP COULD NOT FIND ANY MECHANICAL PROBLEMS OR REASONS FOR ENGINE SHUTTING OFF.. THEY SHUT OFF THE FEATURE AND THE CAR CONTINUES TO SHUT OFF... ON THE MORNING OF JULY 3, 2014, AS I WAS COMING TO A RED LIGHT THE BRAKE PEDALS GOT VERY HARD AND I HAD TO PUSH THE PEDALS ALL THE WAY TO THE FLOOR FOR THE CAR TO STOP COMPLETELY.  THE CAR IS CURRENTLY IN THE SHOP BEING CHECKED OUT. I CALLED BMW TO FIND OUT WHAT CAN BE DONE, I DONT FEEL SAFE IN THIS CAR ANYMORE.   *JS",
        "vin": "WBA3A5C54DF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598385,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS REFUELING OUR 2013 BMW 335I AND I WAS IN THE PASSENGER SEAT.  DURING THAT PROCESS, A PICKUP TRUCK BACKED UP AND WAS CLOSE TO HITTING OUR CAR.  FROM THE PASSENGER SEAT, I TRIED TO WARN THE OTHER DRIVER WITH OUR CAR'S HORN, BUT IT DID NOT WORK, SO I RESORTED TO SCREAMING AS LOUD AS POSSIBLE SINCE THE WINDOWS WERE ALSO CLOSED.  FORTUNATELY, MY HUSBAND HEARD ME AND REALIZED WHAT WAS HAPPENING AND GOT THE TRUCKS ATTENTION AND PREVENTED A POTENTIALLY CATASTROPHIC COLLISION RIGHT NEXT TO A GAS PUMP.    IT NEVER EVEN CROSSED OUR MINDS AT THE TIME THAT A HORN DID NOT OPERATE WHEN THE CAR'S ELECTRICAL SYSTEM WAS SWITCHED OFF WITH THE IGNITION KEY, WHICH ONE MUST DO FOR FIRE SAFETY REASONS WHEN REFUELING.  NEVERTHELESS, AFTER WE GOT HOME WE TRIED THE BMW'S HORN WHEN THE CAR WAS OFF AND THERE WAS NO RESPONSE.  WE TRIED OUR 2005 SUBARU OUTBACK'S HORN WITH ITS IGNITION SWITCHED OFF, AND ITS HORN WORKED JUST FINE.  I SEARCHED ON '2013 BMW HORN DOES NOT WORK'S' ON THE INTERNET AND THE SYSTEM RETURNED 18,200 RESULTS.  WHILE I DID NOT READ ALL OF THEM, I FOUND NUMEROUS POSTINGS ABOUT BMW HORNS NOT WORKING WHEN THE CAR IS OFF, AS FAR BACK AS 2006.    SOME INTERNET POSTINGS ADVISED HAVING THE KEY IN THE IGNITION. I PLACED THE KEY IN THE IGNITION AND THE DASHBOARD DISPLAY AND I DRIVE SCREEN ACTIVATED, BUT THE HORN DID NOT.  NEXT, I PUSHED THE START BUTTON, WITHOUT ENGAGING THE ENGINE, AND ONLY THEN DID THE HORN WORK. I CONTACTED BMW ASSIST FOR TECHNICAL ASSISTANCE AND SPOKE TO A BMW CUSTOMER SERVICE REPRESENTATIVE IN COLUMBUS, OH.  HE CONFIRMED THAT THE HORN IS OPERATING AS DESIGNED. HE SAID HE WOULD ENTER MY CONCERN INTO THE CUSTOMER FEEDBACK DATABASE.    WE THINK BEING UNABLE TO WARN DISTRACTED DRIVERS ABOUT TO CRASH INTO YOUR OCCUPIED BUT PARKED CAR IS A HAZARD AT LEAST WORTHY OF PROMINENT WARNINGS TO DRIVERS OF BMWS AND ANY OTHER VEHICLE WITH THIS \"FEATURE\".   *JS",
        "vin": "WBADX7C50DJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/01/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585853,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS STOPPED AT A RED LIGHT AND WENT IS TO SLEEP MODE. IT WAS A VERY HEAVY AND STEADY RAIN.   WHEN I TOOK MY FOOT OF THE BRAKE THE CAR STARTED UP AGAIN BUT THE WINDSHIELD WIPERS WERE IN MID STROKE ACROSS THE GLASS.  THEY FROZE.  I ATTEMPTED TO TURN THEM OFF AND ON AGAIN.   I PULLED OVER INTO A PARKING LOT AND TURNED THE CAR OFF, ATTEMPTED TO MANUALLY RESET/MOVE THE WIPERS AND THEY WOULD NOT MOVE.  AFTER SITTING FOR TWO HOURS WAITING FOR A TOW TRUCK THE WIPERS STARTED TO MOVE AGAIN.   *TR",
        "vin": "WBA3B5C55DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569337,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS DISPLAYED \"DRIVETRAIN MALFUNCTION, DRIVE MODERATELY\" TWICE NOW IN LESS THAN ONE YEAR OF OWNERSHIP.  WHEN THIS DISPLAY HAS OCCURRED, THE CAR GOES INTO \"LIMP MODE\" AND CAN ONLY BE DRIVEN AT LOW SPEEDS OR WITH VERY SLUGGISH ACCELERATION.  THIS IS A SAFETY HAZARD, AS IT BECOMES EASY TO BE REAR-ENDED BY ANOTHER DRIVER WHEN IT SLOWS SUBSTANTIALLY.  *TR",
        "vin": "WBA3A5G54DN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "01/23/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569230,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP-AND-GO TRAFFIC ON HIGHWAY, LOST BRAKING POWER, COULDN'T STOP AND REAR-ENDED CAR IN FRONT.  *TR",
        "vin": "WBA3B3C59DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "03/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567982,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND PROBLEM WITH  DRIVETRAIN MALFUNCTION, FIRST PROBLEM BACK IN NOV 2013  BOUGHT THE CAR IN AUGUST 2013.  *TR",
        "vin": "WBA3C1C52DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567979,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED SHAKING VIGOROUSLY, AND A MESSAGE WAS DISPLAYED (DRIVETRAIN MALFUNCTION).  *TR",
        "vin": "WBA3C1C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "02/17/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567484,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 328I. THE CONTACT WAS HAVING PROBLEMS WITH THE BRAKING SYSTEM. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER BUT WAS NOT REPAIRED. THE CONTACT WAS LATER DRIVING APPROXIMATELY 5 MPH WHEN THE VEHICLE FAILED TO STOP AND THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE. A POLICE REPORT WAS NOT FILED AND NO INJURIES WERE REPORTED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 6000.",
        "vin": "WBA3A5G59DN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561210,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WOULD SHAKE AT IDLE AND SLOW SPEEDS. THE DRIVETRAIN MALFUNCTION INDICATOR CAME ON.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560827,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING CAR ACCELERATED - WOULD NOT STOP.  WENT THROUGH PARKING LOT, OVER RAILROAD TIES AND WENT ACROSS STREET - BRAKES WOULD NOT WORK, AIR BAGS DID NOT DEPLOY.  ONLY THING THAT STOPPED THE CAR WAS THE GATE THAT IT CRASHED INTO - 2 DAYS PRIOR TO THIS, CAR SHUT OFF WHILE AT A RED LIGHT - TOTALLY SHUT DOWN, NEXT DAY (DAY BEFORE ACCIDENT) RADIO PANEL FROZE - COULD NOT CHANGE CHANNEL OR ANYTHING - ALMOST LIKE ELECTRIC SYSTEM FROZE.  *TR",
        "vin": "WBA3B3C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "11/27/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560135,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTANT LOSS OF BRAKE ASSIST RESULTING IN REAR END COLLISION.  *TR",
        "vin": "WBA3B3C52DF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/25/2013",
        "dateOfIncident": "12/24/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557205,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A POWERTRAIN MALFUNCTION LIGHT COME UP THE FIRST WEEKEND AFTER I LEASED THE CAR, WITH BARELY 250 MILES ON THE ODOMETER! REPAIRS WERE DONE AT A BMW AUTHORIZED SERVICE CENTER, THE CAR NOW HAS 6000 MILES, AND THE ISSUE IS BACK!     THIS IS THE 2ND TIME WITHIN THE LAST 6 MONTHS THIS CAR HAS HAD POWERTRAIN WARNINGS POP UP. ITS CHRISTMAS DAY, AND I HAVE A BRAND NEW CAR (BARELY 6MONTHS OLD THAT IS), YET I CANNOT DRIVE IT. THERE SHOULD BE NO REASON FOR A BRAND NEW LUXURY CAR TO BREAKDOWN TWICE FOR THE SAME REASONS WITHIN 6 MONTHS.    I GOT LUCKY THE CAR DID NOT SHUTDOWN ON ME AND I WAS CLOSE TO HOME SO I COULD LIMP BACK HOME AND HAVE IT TOWED. I HAVE HEARD OF OTHERS HAVING THE SAME ISSUE AND THEIR CAR SHUTTING DOWN IN THE MIDDLE OF THE FREEWAY. BMW IS SELLING A SUB STANDARD, UNTESTED PRODUCT, THAT IS POTENTIALLY UNSAFE. THIS NEEDS TO BE INVESTIGATED.  *TR",
        "vin": "WBA3C1C51DF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2013",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552529,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD SIMILAR PROBLEM AS PREVIOUSLY REPORTED INCIDENT (09/30/2013), THE LOSS POWER.  THIS WAS THE SECOND TIME FOR ME.  THE FIRST INCIDENT OCCURRED ON OCTOBER 29, 2013.  WHEN I PUT FOOT ON GAS, THE CAR WOULD NOT ACCELERATE.  I TOOK CAR TO DEALER AND TWO DAYS LATER WAS TOLD THE AUXILIARY POWER SUPPLY NEEDED TO BE REPLACED, BUT THE REPLACEMENT PART WAS UNAVAILABLE: THERE WERE NO PARTS IN THE COUNTRY NOR COULD THEY TELL ME WHEN THE PART WOULD BE AVAILABLE.  I WAS TOLD I COULD CONTINUE OPERATE THE CAR AND I SHOULD NOT BE CONCERNED. THE LOSS OF POWER OCCURRED AGAIN NOVEMBER 15. I ALSO NOTICED SIMILAR TO THE PREVIOUSLY REPORTED INCIDENT A CHANGE IN THE  ENGINE TEMPERATURE - THE TEMPERATURE DROPPED FROM ABOUT 250 DEG TO ABOUT 205 DEG.     *TR",
        "vin": "WBA3A9C59DF"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2013",
        "dateOfIncident": "11/08/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551863,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 BMW 328I X-DRIVE, DRIVING @ 40 MPH THE DRIVETRAIN MALFUNCTION LIGHT CAME ON, CAR WENT INTO REDUCED POWER MODE (NO HIGHER THAN 20 MPH) MAKING A VERY DANGEROUS SITUATION IN TRAFFIC. LUCKILY I COULD PULL OVER TO A SAFE AREA. I CALLED  BMW ROADSIDE ASSISTANCE. WHEN TOW TRUCK ARRIVED, NO WARNING LIGHT! DEALER COULD NOT REPLICATE ERROR, BUT NOW HAVE A AIR BAG WARNING COMING ON INTERMITTENTLY... BACK TO DEALER I GUESS. THIS IS A COMMON, POTENTIALLY DANGEROUS  AND FRUSTRATING ISSUE FOR 328 OWNERS.  *TR",
        "vin": "WBA3B3C57DF"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2013",
        "dateOfIncident": "11/02/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550631,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEM RESULTING IN VIOLENT SHUDDERING OF THE VEHICLE BODY AND ABRUPT ENGINE STOPS RESULTING IN DANGEROUS DRIVING CONDITIONS. FLUCTUATIONS IN THE TACHOMETER WHEN THE CAR ATTEMPTED TO STOP AND THE CAR WOULD AUTOMATICALLY CHANGE GEARS TO NEUTRAL OR PARK.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2013",
        "dateOfIncident": "10/21/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549024,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVETRAIN MALFUCTION WARNING LIGHT.  THE CAR IS LESS THEN 2 MONTHS OLD UNDER MOSTLY LOCAL DRIVING CONDITION IN ECO OR COMFORT MODE.  *TR",
        "vin": "WBA3C1C59DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2013",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546468,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY WOULD THIS INFORMATION BE ON THE INTERNET, WHILE NHTSA HAS NOT RELEASED ANY RECALL INFORMATION AT ALL?   THIS IS NOT THE ONLY INFORMATION ABOUT A \"BRAKE\" RECALL, WHILE NHTSA'S ODI HAS INITIATED A BRAKE \"INVESTIGATION.\"      VARIOUS BMW INTERNET FORUMS HAVE INDICATED A \"RECALL\" IN DETAIL...BUT NHTSA'S WEB SITE INDICATES NOTHING.      WHAT'S GOING ON?     RECALL: 176,000 BMWS FOR POWER BRAKING FAILURE  THE 3-SERIES, 5-SERIES, X1, X3 AND Z4 MODELS WITH 4-CYLINDER ENGINES ARE AFFECTED.  BY EXHAUST NOTES 11 HOURS AGO  BMW IS RECALLING 176,000 CARS WORLDWIDE TO FIX POWER BRAKE FAILURES, ACCORDING TO WIRE REPORTS AND FILINGS WITH THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION.    ON 2012-2014 BMW MODELS WITH THE COMPANY'S NEW 2.0-LITER TURBOCHARGED 4-CYLINDER ENGINE -- INCLUDING THE Z4 SDRIVE28I, 320I AND 328I, 528I, X1 SDRIVE28I AND XDRIVE28I, AND THE X3 XDRIVE28I -- THE ENGINE VACUUM PUMP CAN LOSE PRESSURIZED OIL MEANT TO DRIVE THE POWER BRAKE MECHANISM.     DUE TO A POOR FIT OF THE INTAKE CAMSHAFT'S SEAL DISK, OIL MAY BE BLOCKED FROM LEAVING THE ENGINE TO LUBRICATE THE VACUUM PUMP, WHICH COULD THEN CAUSE THE VACUUM PUMP TO FAIL AND THE LOSS OF POWER-ASSIST BRAKING. WHILE THE BRAKES WOULD STILL WORK, STOPPING DISTANCES WOULD INCREASE DUE TO INCREASED DRIVER FORCE NEEDED ON THE BRAKE PEDAL.    A TOTAL OF 76,190 CARS ARE AFFECTED IN THE U.S. THE DIESEL-POWERED 328D IS NOT AFFECTED.   MORE.  *TR",
        "vin": "N/A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "07/19/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546219,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS APPROACHING THE ON RAMP FOR THE HIGHWAY, I SPED UP IN ORDER TO MERGE INTO ONCOMING TRAFFIC. I DEPRESSED THE GAS PEDAL COMPLETELY TO THE FLOOR BUT THE CAR PICKED UP EXTREMELY SLOWLY AS IF IT DID NOT HAVE ANY POWER. I ALSO NOTICED AT THE SAME TIME THAT MY ENGINE TEMPERATURE SEEMED TO BE UNUSUALLY LOW FOR A VEHICLE THAT HAD BEEN RUNNING FOR OVER AN HOUR. THERE HAD ALSO BEEN AN EXTREMELY LOUD FAN NOISE THAT WOULD COME ON EVERY 2 MINUTES OR SO. AS A RESULT OF THE LACK OF POWER, I NEARLY CAUSED A COLLISION BETWEEN MYSELF AND THE VEHICLE BEHIND ME BECAUSE THE ONCOMING VEHICLE DID NOT ANTICIPATE SOMEONE MERGING ONTO THE HIGHWAY AT SUCH A SLOW PACE. I CONTINUED TO DRIVE WITHOUT POWER FOR ABOUT 20 MINUTES AS IF THE CAR WAS A NATURALLY ASPIRATED VEHICLE EVEN THOUGH IT WAS CLEARLY TURBO CHARGED BUT THE TURBO NEVER KICKED IN. WHEN I GOT OFF OF THE HIGHWAY AND WAS ABLE TO PULL OVER TO RESTART MY VEHICLE, THE CAR STARTED TO RUN AS NORMAL.  *TR",
        "vin": "WBA3A9C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2013",
        "dateOfIncident": "09/22/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545746,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOUTHBOUND ON A TWO LANE ROAD, I WENT TO APPLY MY BRAKES AS AN INTERSECTION WAS AHEAD.  WHEN I PUSHED MY BRAKE PEDAL IN, IT RETURNED NO PRESSURE AND FELT LIKE MY BRAKES WERE OUT.  I PUSHED THE BRAKE PEDAL ALL THE WAY TO THE FLOOR, WHILE USING THE E-BRAKE AS BACK-UP AND CAME TO A STOP.  I DID NOT THINK THE VEHICLE WOULD COME TO A STOP BEFORE ENTERING THE INTERSECTION.  I RETURNED THE VEHICLE TO A SAFE LOCATION AND NOTIFIED ROADSIDE ASSISTANCE FOR A TOW THE NEXT MORNING.  THE VEHICLE HAS BEEN AT THE DEALERSHIP SINCE LAST MONDAY.    *TR",
        "vin": "WBA3B5C50DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/13/2013",
        "dateOfIncident": "08/29/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543519,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE NEW BMW 328I 2013 IN MAY, 2013. AFTER ROUGHLY 3 MONTHS HAVING THE CAR, I WAS IN A PARKING LOT, PULLING INTO A SPOT AT A LOW SPEED. FOR NO REASONS, THE BRAKE SUDDENLY AND TOTALLY FAILED ON ME. I COULD NOT STOP THE CAR BEFORE THE CAR RUN OVER THE CURB AND THE FRONT END OF THE CAR COLLIDED WITH THE CONCRETE BLOCK. I WAS LUCK THAT I WAS NOT ON HIGHWAY OR STREET WHEN THIS BRAKE MALFUNCTION OCCURRED.  I CALLED BMW SOS ASSIST AND REQUESTED TOWING THE CAR TO A LOCAL BMW  SERVICE DEPARTMENT. THE BMW SERVICE ADVISOR TOLD ME TO SEND THE CAR TO THE COLLISION CENTER FOR A REGULAR BODY WORK, BUT I SHOWED THEM ALL THE BRAKE MALFUNCTION INCIDENTS REPORTED ONLINE FOR THE SAME MODEL AND YEAR CAR AND INSISTED THEY CONTACT BMW NA AND CHECK THE ENTIRE BRAKE SYSTEM. THE CAR HAS BEEN IN BMW  POSITION NOW FOR TWO WEEKS WAITING FOR BMW NA FIELD ENGINEER. BMW DID NOT PROVIDE A LOANER TO ME.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2013",
        "dateOfIncident": "06/16/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543283,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A NEW BMW XI 328 ON APRIL 30.  ON JUNE 16, WITH 1700 MILES ON CAR BRAKES FAILED.  WHILE SLOWING FOR A TRAFFIC LIGHT THE BRAKES SEEMED TO ENGAGE BUT FAILED TO STOP THE CAR--LIKE THEY WERE WORKING BUT DIDN'T.  CAR WENT THROUGH A LIGHT AND I QUICKLY HIT PARK TO STOP IT IN THE INTERSECTION.  ONCE NO CARS WERE AROUND I PULLED TO THE SIDE AND TESTED THEM.  THEY STOPPED ON A FEW TESTS SO THOUGHT IT WAS ME. AND AS I DROVE, SLOWLY, THE BRAKES STOPPED SEVERAL MORE TIMES, AND THEN THEY FAILED AGAIN AND I AVERTED HITTING ANOTHER CAR BY PRESSING PARK BUTTON AGAIN.  I HAD THE CAR TOWED TO BMW AND THEY DETERMINED IT WAS THE VACUUM PUMP AND OTHER BRAKE ISSUES.  NO WARNING LIGHT WENT ON THE DASH TO ALERT ME.  THEY SAID THERE WAS A SERVICE ALERT ON THIS ISSUE BY BMW.  BMW SAID PARTS NOT AVAILABLE FOR SEVERAL WEEKS AND TWO DAYS LATER OFFERED TO EXCHANGE THE VEHICLE FOR A NEW ONE.  BRAKES SEEMED \"SPONGY\" FROM THE START BUT HAD ALWAYS WORKED UNTIL THEY DIDN'T.  FORTUNATELY NO ONE WAS HURT.  I TOOK THEM UP ON THEIR OFFER AND NEW (EXCHANGED) CAR BRAKES FEEL OK.  I DIDN'T REPORT BECAUSE NHTSA REP TOLD ME NOT NECESSARY BECAUSE BMW WAS DOING THE RIGHT THING.  BUT READ IN LA TIMES THAT THIS IS A BIGGER ISSUE AND WANTED TO GO ON RECORD THAT THERE WAS A PROBLEM.  BMW DID THE RIGHT THING BUT WORRY THAT THIS ISSUE COULD CROP UP WITH OTHERS, AND EVEN IN MY NEW CAR.  *TR",
        "vin": "WBA3B5C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2013",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543302,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCES BRAKING PROBLEMS IN MY BMW 328I SINCE I PURCHASED IT IN AUGUST OF 2012. SPECIFICALLY THE CAR WILL LOSE BRAKING PRESSURE AT LOW SPEEDS AS I AM COMING TO A STOP. THE PROBLEM IS INTERMITTENT AND MY CAR DEALER HAS BEEN UNABLE TO REPLICATE AND DIAGNOSE THE ISSUE.     IN DETAIL: I WILL BE COMING TO A STOP, PERHAPS 2 OR 3 MPH USING CONSTANT BRAKE PRESSURE TO STOP THE CAR. OCCASIONALLY THERE WILL BE A LOSS OF BRAKE PRESSURE AND THE CAR WILL KEEP MOVING FORWARD SEVERAL FEET UNLESS I APPLY HARD PRESSURE TO THE BRAKE PEDDLE. THIS OCCURS WITH SOME REGULARITY AND HAS NOT CAUSED AND ACCIDENT. I NOW COMPENSATE FOR IT, BUT IT SEEMS TO BE A VERY STRANGE ISSUE TO HAVE.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/11/2013",
        "dateOfIncident": "07/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543183,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MOVING VERY SLOWLY, LESS THAN 5MPH, IN A LINE OF CARS WAITING TO PULL INTO A PARKING LOT. ALL OF A SUDDEN, BRAKE PEDAL BECAME ROCK HARD. I COULD NOT STOP THE CAR FROM ROLLING. I HAD TO SHIFT INTO PARK TO AVOID HITTING THE CAR AHEAD OF ME. RESTARTED THE CAR, BRAKES FELT NORMAL. THIS HAS NOT HAPPENED SINCE. I INFORMED THE SERVICE DEPARTMENT AT THE DEALER, BUT THEY SAID THEY CAN'T RE-CREATE THE PROBLEM, THEREFORE THEY CANNOT DO ANYTHING ABOUT IT. I READ NEWS REPORTS THAT THIS IS BEING INVESTIGATED BY YOUR ORGANIZATION AND DECIDED TO REPORT THE INCIDENT WHICH TOOK PLACE ON 7/15/13.  *TR",
        "vin": "WBA3B3C59DF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2013",
        "dateOfIncident": "08/29/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537991,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR AND REVERSED OUT OF MY DRIVEWAY, THEN PROCEEDED TO A VERY BUSY INTERSECTION WITHOUT STOP LIGHT. I ACCELERATED TO MERGE WITHF TRAFFIC AND ALL OF THE SUDDEN MY POWER WAS CUT DRAMATICALLY AND THE CAR DISPLAYED A DRIVE TRAIN MALFUNCTION ERROR. THIS PREVENTED ME FROM ACCELERATING AT THE CORRECT SPEED AND ALMOST CREATED AN ISSUE WITH THE VEHICLES BEHIND ME. I THEN HAD TO PICK MY CHILD UP SCHOOL AND THE CAR CONTINUES TO BEHAVE POORLY.  *TT",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "07/25/2013",
        "dateOfIncident": "04/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531741,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW  328 2013 HAS A TECH DESIGN FLAW WHICH WILL LEAD TO A POSSIBLE FATAL ACCIDENT. THE SCREEN WHICH SHOWS TELEPHONE NUMBERS OR RADIO OR NAVIGATION DIRECTIONS IS PLACED IN SUCH A POSITION THAT THE DRIVER CANNOT READ THE SCRIPT ON THE SECONDARY AND TERTIARY  WORDS WHEN THE VEHICLE IS TRAVELING IN SUNLIGHT  WE LIVE IN FLORIDA AND WHERE THE SUN IS BRIGHT AND IF YOU ARE DRIVING AND WANT TO MAKE A PHONE CALL WITHOUT HOLDING A CELL PHONE YOU CAN HAVE AN ACCIDENT SINCE YOU CANNOT SEE THE WORDS OR ICONS THAT ARE FLASHED ON THE SCREEN.  THE SCREEN WASHES OUT THE SAME AS AN IPHONE WHEN IT IS IN THE SUNLIGHT   THE PLACEMENT OF THE SCREEN IN THE 2013 BMW 328 IS A HAZARD AND IF NOT CHANGED TO A SHADED POSITION ON THE DASH WILL LEAD TO MANY UNFORESEEN ACCIDENTS  THERE SHOULD BE A RECALL ON THIS MODEL TO HAVE THIS CORRECTED.  *TR",
        "vin": "WBA3A5C59DF"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525548,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGHLY TWO MONTHS AFTER TAKING POSSESSION OF MY NEW BMW 328I, I WAS DRIVING ON THE FREEWAY WHEN MY CAR SUDDENLY AND WITHOUT WARNING LOST ALL BRAKING ABILITY.  THE BRAKE PEDAL WAS HARD AS A ROCK.  FORTUNATELY, I AVOIDED AN ACCIDENT BY COASTING OFF OF THE FREEWAY AND INTO A HOTEL PARKING LOT.  MY CAR WAS TAKEN BY TOW TRUCK TO A SERVICE DEPARTMENT AT BMW, WHERE IT REMAINS TO THIS DAY.  MY SERVICE ADVISOR INITIALLY INFORMED ME THAT ONLY THE VACUUM PUMP NEEDED TO BE REPLACED.  A WEEK LATER, HOWEVER, I AM TOLD THAT THE INTAKE CAMSHAFT MUST ALSO BE REPLACED BECAUSE IT IS BADLY DAMAGED.  *TR",
        "vin": "WBA3C1C57DF"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "02/05/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525011,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWLY COMING TO A STOP, THE BRAKE PEDAL BECAME HARD YET THE CAR WOULD NOT STOP AND SEEMED TO GLIDE FOR 10-15 FEET BEFORE FINALLY STOPPING AT WHICH POINT THE ENGINE REVVED TO 6000 RPM, BUT DID NOT ACCELERATE. THE PEDAL BECAME SO HARD THAT I COULD NOT PRESS ANY HARDER, YET WAS STILL SLOWLY MOVING. TURNED THE CAR OFF AND RESTARTED THE CAR AND DROVE TO THE DEALER. THE DEALER COULD NOT FIND ANYTHING WRONG. ON 7/15/2013 THE EXACT SAME THING HAPPENED AGAIN AS I WAS PRESSING THE BRAKE PEDAL I COULD FEEL THE CAR CONTINUING TO MOVE FORWARD AND THE BRAKE PEDAL BECAME VERY HARD YET STILL DID NOT STOP THE CAR. AS SOON AS THE CAR FINALLY STOPPED THE ENGINE REVVED TO 3500 RPM, AT WHICH TIME I SHUT IT OFF. CAR IS BACK AT THE DEALER AND BMWNA HAS BEEN NOTIFIED OF BOTH EPISODES.  *TR",
        "vin": "WBA3B3C52DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521697,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2013 BMW 328I IN LATE MAY.  WITHIN A WEEK OF OWNERSHIP THE BRAKES FAILED.  THE CAR WAS TOWED TO THE DEALERSHIP AND WAS THERE FOR THREE DAYS.  THEN LESS THAN A MONTH LATER, LAST WEEK, THE BRAKES FAILED AGAIN.  I ALMOST GOT IN A BAD ACCIDENT AND IN FACT DID SCRAPE THE CURB.  I WAS TOLD THE ORIGINAL PROBLEM WAS A VACUUM PUMP, SIMILAR TO OTHER REPORTS ON THIS SITE RELATED TO THAT MODEL OF CAR.  *TR",
        "vin": "WBA3C1C55DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514428,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING THIS CAR NEW, THE POWER BRAKES COMPLETELY FAILED ON MAY 23. I HAD THE CAR TOWED TO BMW WHERE THEY REPLACED THE BRAKES VACUUM PUMP. THE CAR WAS RETURNED TO ME WHERE THE PROBLEM HAPPENED AGAIN, THE DAY IT WAS RETURNED, EXACTLY THE SAME WAY AS BEFORE. WHEN YOU PUSH ON THE BRAKE, THE PEDDLE IS REALLY HARD AND BARELY RESPONDS. IT IS VERY DIFFICULT TO STOP THE CAR.  *TR",
        "vin": "WBA3B5G53DN"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/22/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513158,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REARENDED, ON THE FREEWAY, ON THE PASSENGER SIDE, BY AN SUV GOING ABOUT 40MPH, I SLAMMED IN TO ANOTHER SUV IN FRONT OF ME.  MY VEHICLE IS TOTALED.  THE DISPLAY INDICATED THAT THERE WAS AN AIRBAG DEPLOY ERROR.  ALSO, THE REASON MY CAR WAS TOTALED WAS BECAUSE ALL OF THE ELECTRICAL WIRES FOR THE COMPUTER SYSTEM ARE BEHIND THE REAR TAIL LIGHT, AND THEY WERE MELTED AFTER IMPACT.  THIS IS CONCERNING BECAUSE THIS IS ALSO WHERE THE FUEL TANK IS.  LUCKILY, I WALKED AWAY WITH A SORE NECK AND FEW BRUISES, BUT IT IS CONCERNING THAT THE AIRBAGS DID NOT DEPLOY, WHEN THEY WERE CLEARLY SUPPOSE TO.  I HAD THE CAR FOR LESS THAN 2 MONTHS PRIOR TO THE ACCIDENT, AND BOUGHT IT BRAND NEW.    *TR",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2013",
        "dateOfIncident": "04/18/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508639,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO START/STOP FUNCTION HAS MALFUNCTIONED BEFORE WHERE WHEN I TAKE MY FOOT OFF THE BRAKE, THE CAR DOESN'T START AGAIN. NORMALLY I CAN JUST PRESS THE START BUTTON AND PUT IT IN DRIVE. THIS TIME, HOWEVER, I WENT TO START IT AGAIN AFTER IT HAD AN \"AUTO START/STOP MALFUNCTION\", AND IT WOULDN'T TURN BACK ON. AN ERROR POPPED UP SAYING \"IGNITION MALFUNCTION -- DO NOT TURN ENGINE OFF. CAR WILL NOT START AGAIN.\" CURRENTLY WAITING TO HEAR BACK FROM THE DEALERSHIP AFTER I HAD TO FLATBED IT. ALSO THE CAR WOULDN'T GO INTO NEUTRAL SO THEY HAD TO DRAG IT ON THE FLATBED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500706,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD NOISE AND THE CAR STARTING SHAKING AND THEN CAR DIED ON ME AND SERVICE  ON MIDDLE OF NOWHERE   AND I STARTS THE CAR BACK BUT IT GOT STALLED MANY TIMES AND IT WAS SHIFTING THE GEAR TO NEUTRAL IT WAS A BAD EXPERIENCE I COULD HAD AN ACCIDENT BRAND NEW BMW. *TR",
        "vin": "WBA3B3C58DJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2013",
        "dateOfIncident": "01/27/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494881,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUBJECT VEHICLE ACCELERATED UNEXPECTEDLY WHEN THE CAR WAS SLOWLY TURNING INTO A PARKING SPACE IN A PARKING LOT.  THE DRIVER HAD TO SUDDENLY PRESS VERY HARD ON THE BRAKE IN ORDER TO STOP THE CAR.  *TR",
        "vin": "WBA3B3C57DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/25/2012",
        "dateOfIncident": "12/25/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490036,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE OPEN THE DOOR  AND SITS , SHE PULLED THE DOOR TO CLOSE BUT IT WONT LOCK UP TRY SEVERAL TIMES TO DO IT WITH THE REMOTE BUT WONT LOCK UP.  AFRAID TO DRIVE CAR!!!  *TR",
        "vin": "WBA3C1C59DF"
    }
]