[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118873,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR DOWN A SIDE ROAD AND ALL OF A SUDDEN THE WHEEL LOCKED UP AND THE CAR HAD A MESSAGE 'POWER STEERING MALFUNCTION. DO NOT DRIVE VEHICLE'. LUCKILY FOR ME, I WAS NOT GOING VERY FAST OR ON A BUSY ROAD, AND COULD STOP THE CAR SAFELY. THE WHEEL WAS EFFECTIVELY USELESS AND I COULD NOT MANEUVER THE VEHICLE AT ALL. I HAD THE CAR TOWED TO AUDI AND BECAUSE THERE IS NO 'KNOWN' ISSUE WITH THIS HAPPENING AND THE VEHICLE IS OUT OF WARRANTY, THERE WAS NOTHING THEY COULD DO BESIDES QUOTE ME $3200 FOR THE REPLACEMENT OF THE POWER STEERING RACK.  IF SOMEONE WAS DRIVING ON A CURVED ROAD OR ON THE HIGHWAY, I WOULD HATE TO IMAGINE WHAT WOULD HAPPEN. IT WAS NEARLY IMPOSSIBLE TO TURN THE VEHICLE AT ALL.  THERE ARE SEVERAL COMPLAINTS OF STEERING PROBLEMS ON AUDI FORUMS AND A COUPLE OF CASES JUST LIKE MINE BUT NO FORMAL INVESTIGATION OR RECALL YET. I HOPE AUDI ACTS BEFORE ANYONE GETS SERIOUSLY HURT.",
        "vin": "WAUGGAFRXDA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IN MY CAR CAME ON ABOUT 6 MONTHS AGO.  ACCORDINGLY THE CAR FAILED MASSACHUSETTS INSPECTION IN DEC. 2017.  AUDI DIAGNOSED THE PROBLEM AS 'DRIVER'S SIDE AIRBAG INJECTOR'.  I HAVE BEEN TRYING TO GET MY DEALER TO FIX THE PROBLEM, BUT THEY HAVE NOT DONE SO DUE TO UNAVAILABILITY OF A REPLACEMENT AIRBAG AND INJECTOR.  I CANNOT LEGALLY DRIVE MY CAR (NO CURRENT INSPECTION STICKER) AND AM VERY CONCERNED ABOUT SAFETY IN THE EVENT OF AN ACCIDENT.  MY AUDI DEALER AND AUDI USA HAVE NOT OFFERED ANY SOLUTION E.G. A REPLACEMENT VEHICLE UNTIL A REPLACEMENT AIRBAG CAN BE INSTALLED (ESTIMATED AT LONGER THAN 4 MONTHS).  AUDI IS NOT STANDING BY THEIR PRODUCT IN THIS CASE A $70,000 VEHICLE.",
        "vin": "WAUCGAFH1DN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054368,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S5 CABRIOLET",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT ON AUDI'S FAULTY SEATBELT MECHANISM.  THE VEHICLE IS A 2013 AUDI S5 CABRIOLET VEHICLE.  THE PASSENGER SIDE SEATBELT LOCKED AND COULD NOT BE RELEASED.  THE VEHICLE WAS BROUGHT TO AN AUDI DEALERSHIP SERVICE DEPARTMENT AND FOUND THAT THE SEATBELT WAS FAULTY AND HAD TO BE REPLACED.  THIS ISSUE HAS BEEN REPORTED FROM OTHER AUDI OWNERS TO INCLUDE THIS MODEL.  AUDI'S FAULTY SEATBELT MECHANISM IS A SAFETY ISSUE THAT NEEDS TO BE RECALLED.  THE SEATBELT COULDN'T BE USED AND IS LOCKED WITH NO WAY TO BE SECURED.   THE VEHICLE WAS STATIONARY WHEN THE SEATBELT COULDN'T BE ENGAGED AND THE PASSENGER WAS NOT ABLE TO INSTALL/USE THE SEATBELT.   I WAS CHARGED OVER $1,200 TO REPLACE THE SEATBELT MECHANISM FOR A SAFETY ISSUE.  RECOMMEND A RESEARCH IS CONDUCTED TO PERFORM AUDI'S VEHICLES WITH FAULTY SEATBELT ISSUES.",
        "vin": "WAUCGAFHXDN"
    }
]