[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456846,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT PUMP BECAME BLOCKED IN MY 3.0 ENGINE VEHICLE, CAUSING IT TO OVERHEAT. THIS MAY BE A SIMILAR PROBLEM TO THE 2.0 VEHICLE, FOR WHICH THERE HAVE ALREADY BEEN 2 RECALLS. MY AIR CONDITIONER STARTED BLOWING FUSES REPEATEDLY (DAILY TO WEEKLY) LAST YEAR AND THE MECHANIC THINKS IT MAY BE A RELATED ISSUE.",
        "vin": "WA1DGAFP3DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448642,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The sliding sunroof exploded out of nowhere with no impact while on the Interstate. The glass rained down on us as we were traveling around 65 mph.",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445909,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Audi Q5. The contact stated while driving 10 MPH in a parking lot after depressing the brake pedal the vehicle began to accelerate independently. The contact stated no warning light was illuminated. The contact was able to stop the vehicle by shifting into the park. The contact stated that he had experienced the failure multiple times. The contact took the vehicle to the local dealer however, the mechanic was unable to duplicate the failure. The vehicle was not repaired but was pending repairs. The manufacturer had not been informed of the failure. The failure mileage was approximately 47,000.",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438823,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine pistons are defective and consume an excessive amount of oil. This has been confirmed through the manufacturer's own prescribed testing of the vehicle.   As a result, the vehicle is not drivable due to the safety risks include sudden engine breakdown while driving.",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "07/29/2021",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429831,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My daughter drove her car to Hobby Lobby in Opelika, AL.  After being in the store for about 7 minutes they announced over the intercom for the owner of a black audi to come to the front.  They told her that her car was on fire.  She went outside and black smoke and fire was coming from the hood.  A lady had already called 911.  While waiting, flames started coming from the bottom of the car.  The police arrived and started trying to put the fire out, then firefighters arrived and put the fire out.  After the fire was put out, the car kept trying to start itself so they had to locate the battery to disconnect it.  Luckily the firefighters were a few stores down and was able to get to it quick.   The car is available for inspection and we feel that this is some type of malfunction that we shouldn't be responsible for.  A fire is very dangerous and could have hurt or killed my daughter if it had caught fire with her in it and also it catching fire around other cars that put others in danger or if it would have been at night at home under our carport and ended up catching our house on fire!  The car has not been inspected by anyone.  We didn't have full coverage insurance since I had just changed our policy since where I worked closed down so in the meantime of going from full coverage insurance to liability for a month and a half, this happened.  So now we don't really know what to do, as we feel this isn't something we should have to pay for.  We feel that Audi should be responsible for this malfunction/defect.  No warnings and we have our vehicles maintenanced regularly.",
        "vin": "WA1DGAFP5DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423235,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Panoramic sunroof glass panel shattered.  Obviously, if the glass had fallen while I was driving, I (or any passengers) could have been cut and injured. I also could have been distracted and injured myself or someone else in a crash.  Rockville Audi has not inspected it yet; although, they are scheduling the repair. The vehicle was inspected on July 1st at about 9:00pm by two Washington National Cathedral Police Officers (Sergeant Lozano and Officer Reyes or Navarro) shortly after it was discovered.  The phone number to reach Washington National Cathedral Police is (202) 537-5667.  There were no warning lamps or other symptoms that this was going to happen.",
        "vin": "WA1LFAFP2DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "1. ADAPTIVE LIGHT NOT FUNCTIONING.  WARNING LIGHT FLASHING FOR OVER A YEAR NOW. \" ADAPTIVE LIGHT DEFECTIVE\" SYMBOL FLASHING.    2. AC/HEATING FAN \"SQUEALING\" LOUDLY.  BEGAN ABOUT A MONTH AGO.",
        "vin": "WA1WGAFP6DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373577,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CONCERN IS THAT THIS CAR BARELY HAD 115,000 MILES ON IT AND I'M NOW DEALING WITH A MAJOR OIL CONSUMPTION WHERE I\"M AT THE DEALERSHIP ALMOST ONCE A MONTH.  MY CONCERN, IS THAT I'M ON THE OPEN HIGHWAY AND THE CAR TELLS ME TO IMMEDIATELY PARK THE CAR BECAUSE THE OIL IS TOO LOW, RIGHT AFTER GETTING IT TOPPED OFF WEEKS BEFORE. THIS WAS A HAZARD FOR ME BE ALONE ON THE ROAD. I NOTICE OTHER COMPLAINTS ABOUT THIS ISSUE. IS THERE ANYTHING AUDI IS CONSIDERING DOING ABOUT IT? THESE CARS AREN'T CHEAP AND SHOULD NOT BE AN ISSUE, CAUSING OWNERS TO EITHER PAY $9,000+ OR GET A NEW CAR. EVEN NOW, I'M STILL HAVING TO FREQUENT THE DEALERSHIP FOR TOP OFFS DUE TO THE OIL CONSUMPTION CONCERN.",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY WOULD NOT ACCELERATE FROM A STOP ON CITY STREET UNTIL IT REACHES 2500 RPM. CHECK ENGINE LIGHT CAME ON. TOWED TO DEALERSHIP SAID CATASTROPHIC ENGINE FAILURE. I WAS TOKD WILL NEED NEW ENGINE.VEHICLE WAS PROPERLY MAINTAINED. ONLY 45000 MILES.",
        "vin": "WA1LFAFP1DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354980,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION. MY ENGINE BURNS EXCESSIVE OIL. I HAVE TO ADD MORE OIL AFTER DRIVING EVERY FEW 100 MILES.",
        "vin": "WA1LFAFP5DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330273,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE TIMING CHAIN AND TENSIONER. DEALER HAS STATED IT IS CRITICAL TO REPLACE THE TIMING CHAIN AND TENSIONER.  THE VEHICLE HAS 89900 MILES AND HAS ALL SCHEDULED MAINTENANCE PERFORMED BY THE DEALERSHIP.  OTHER YEARS AND MODELS WITH THE SAME PROBLEM HAVE BEEN REPORTED AND ACTION HAS BEEN TAKEN AGAINST AUDI.  *TR",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325394,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENT DATE: 5/9/20  MILEAGE: 70,290 MILES  SUMMARY: I REVERSED OUT OF PARKING SPACE, SHIFTED MY CAR INTO DRIVE, AND MY CAR ABRUPTLY HESITATED, DECELERATED, RESISTED, AND JERKED UPON ENGAGING THE GAS PEDAL; A SERIES OF MULTIPLE WARNING/INDICATOR LIGHTS SIMULTANEOUSLY FLASHED ON THE OBD SCREEN WHILE MY CAR WAS IN MOTION. THE CAR CONTINUED TO DECELERATE, JERK & HESITATE.MESSAGES REFERENCED HYBRID, MALFUNCTION, ELECTRONIC, INOPERABLE, LOSS OF ABILITY TO CONTROL STEERING, STEERING POWER, DANGER, HAZARD, ENGINE, STABILIZATION, DRIVING, POWER. I ATTEMPTED TO ACCELERATE FROM A STOP SIGN TO CROSS A 4 LANE INTERSECTION OF MOVING TRAFFIC. UPON PRESSING THE GAS PEDAL TO CROSS THE TRAFFIC INTERSECTION, MY CAR WOULD HESITATED TO ACCELERATE, AND MORE ABRUPTLY JERKED AND HESITATED - LIKE I WAS DRIVING A MANUAL TRANSMISSION THAT WAS STALLING OUT/STUCK IN THE WRONG GEAR.THE MORE I TRIED TO ACCELERATE ACROSS THE 4 LANES OF MOVING TRAFFIC, THE MORE SEVERELY THE CAR RESISTED, JERKED, HESITATED, AND FLUCTUATED IN POWER. I COULD'VE BEEN T-BONED BY ANOTHER VEHICLE AND SERIOUSLY INJURED, AS THE SPEED LIMIT ON BOTH SIDES OF THIS TRAFFIC INTERSECTION IS 45MPH. I WAS INFORMED BY THE AUDI DEALERSHIP THAT I NEED A BRAND NEW TRANSMISSION DUE TO 'INTERNAL PARTS FAILURE.' I WAS ALSO INFORMED THE 'CONDITION AND LEVEL OF TRANSMISSION FLUID' REQUIRES AN ENTIRELY NEW TRANSMISSION. THE FOLLOWING DIAGNOSTIC CODES WERE PROVIDED BY THE DEALERSHIP: P0AB900,P060A00,P279700,U040200.  ACCORDING TO AUDI, MY CAR NOW NEEDS A WHOLE NEW TRANSMISSION AND HAS 'BURNED' TRANSMISSION FLUID DUE TO AN 'INTERNAL PARTS FAILURE' AT 70,290 MILES.THE TRANSMISSION REPLACEMENT AND LABOR IS APPROX $27K. I RECENTLY LEARNED THE TRANSMISSION MECHATRONICS WAS REPLACED BY ANOTHER AUDI DEALERSHIP IN AUG 16' AND THE MILEAGE WAS APPROXIMATELY 22KMILES. I PURCHASED THE VEHICLE IN JAN 17', WITH APPROX. 26KMILES. MORE DETAIL IN PDF.   *TR",
        "vin": "WA1C8AFP3DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311983,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY CAR AS USED FROM A DEALER, IT HAD 92,000 MILES ON IT. ONCE I DROVE IT FOR 2 DAYS IT SHOWED THAT I NEED TO ADD A QUART OF OIL ALTHOUGH THE DEALER SAID THEY HAD AN OIL CHANGE. THE CHANGED THE OIL AGAIN AND 200 MILES LATER AGAIN I GOT A MESSAGE TO ADD A QUART OF OIL. AND KEPT ADDING QUARTS EVERY 200 MILES. THE AUDI DEALERSHIP SAID THEY RAN THE DIAGNOSTIC FOR THE PREVIOUS OWNER AND FOUND THAT THE PESTONS AND RINGS NEED TO BE CHANGED WHICH COST $7,000. AND SAID IT'S OK TO DRIVE IT AS LONG AS I KEEP TOPPING OFF THE OIL. FEW WEEKS LATER I'M DRIVING THE CAR ON THE HIGHWAY AND IT STARTS SHAKING AND I CAN FEEL THE ENGINE STRUGGLING AND LOSING ACCELERATION. I TOWED IT TO THE AUDI DEALER AND FEW DAYS LATER THEY SAID THE COMPRESSION TEST FAILED AND THAT THE 2ND CYLINDER HAS LOW PRESSURE, AND THAT I NEED TO REPLACE THE ENGINE FOR ALMOST $14,000. THEY DIDN'T SAY ANY REASON FOR IT, THEY SAID 'WE'VE SEEN IT HAPPEN'. AND WHEN I ASKED THAT A $55K CAR IS EXPECTED TO LAST AT LEAST 200,000 MILES AND MINE IS 105,000 ONLY, THEY SAID 'NOT REALLY'!!  SO NOW I HAVE A $55K CAR THAT HAS ONLY 105,000 MILES ON IT AND I NEED TO PAY $14K TO FIX IT! HOW IS THAT POSSIBLE? THERE HAS TO BE A PROBLEM FROM AUDI SIDE THAT CAUSES THE ENGINES TO FAIL THAT EARLY!!",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308495,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BEING DRIVEN ON A STATE HIGHWAY WHEN IT SUDDENLY LOST ALL POWER, JERKED FORWARD, AND THEN THE ENGINE COMPLETELY SHUT DOWN. THIS WAS A VERY BUSY HIGHWAY AND I WAS STALLED IN THE CENTER LANE ALMOST BEING STRUCK ON MULTIPLE TIMES BY SEVERAL VEHICLES.  IT WAS ABLE TO START AND WAS FORCED TO RUN IN THE HIGHEST POWER DURING THE IDLING TO KEEP FROM STALLING. HOBBLED TO SHEEHAN'S AUTOMOTIVE SERVICE, SOUTH LAWRENCE MA. THEY SERMONED AN ASSESSMENT AND DISCOVERED NO COMPRESSION FROM A FAILED ENGINE. PHOTOS AND PAPERWORK FROM REPAIR SHOP TO FOLLOW",
        "vin": "WA1FLAFP2DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302548,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE DO NOT HAVE A GARAGE SO OUR AUDI IS PARKED OUTSIDE. IT WASN'T STARTING RANDOMLY SO WE TOOK IT TO THE DEALER. THE BATTERY WAS SITTING IN A POOL OF WATER BECAUSE THE METAL BOX THE BATTERY IS IN COULDN'T DRAIN. THAT CAUSED A CIRCUIT BOARD TO SHORT CIRCUIT. THEY CLAIM THE ISSUE WAS WITH THE SUNROOF HAVING DEBRIS LIKE LEAVES CLOGGING THE DRAINAGE SYSTEM.",
        "vin": "WA1LFAFP0DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289076,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON REACHING APPROXIMATELY 75,000 MILES, I BEGAN NOTICING A LOUDER THAN NORMAL NOISE WHEN STARTING THE ENGINE.  THE NOISE CONTINUED, AND AROUND 80,000 MILES, I BEGAN RECEIVING A CHECK ENGINE LIGHT FOR CAM POSITION LIMIT.  I DID A LOT OF RESEARCH AND DIAGNOSTICS TO FIND THAT THE TIMING CHAIN HAD STRETCHED, CAUSING THE NOISE AND CHECK ENGINE LIGHTS.  I HAD THE FAULTY TIMING CHAIN REPLACED, LUCKILY BEFORE ANY SEVERE DAMAGE HAD OCCURRED.  THE TIMING CHAIN SHOULD NOT NEED REPLACED THAT EARLY IN THE LIFE OF THE VEHICLE, BUT THIS PROBLEM HAS PLAGUED THE VW/AUDI 2.0 ENGINE, EVEN AFTER THE TIMING CHAIN TENSIONER UPDATE.  THIS COULD HAVE BEEN CATASTROPHIC.  MANY OWNERS HAVE NOT BEEN SO LUCKY AND HAVE REQUIRED ENGINE REPLACEMENT DUE TO VALVE DAMAGE FROM TIMING CHAIN STRETCH AT EVEN LOWER MILEAGE.",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288647,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE DRIVING APPROXIMATELY 40 MPH, THE SUN ROOF EXPLODED AND THE GLASS SHATTERED WITHOUT WARNING OR AN IMPACT OCCURRING. THERE WERE NO INJURIES. THE CONTACT CALLED AUDI BOISE AT 208-377-5400 (LOCATED AT 8400 FRANKLIN RD, BOISE, ID 83709) AND WAS INFORMED THAT THERE WAS NO RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 113,000.",
        "vin": "WA1LFAFP9DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280738,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS CONSUMING A LOT OF OIL.  JUST HAD AN OIL CHANGE 3 WEEKS AGO AND I JUST HAD TO PUT A QUART OF OIL IN MY CAR.  THIS IS THE SECOND TIME THIS HAS HAPPENED IN 4 MONTHS",
        "vin": "WA1LFAFP4DA"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270198,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDIO Q5 2013 AUDI 2.0 TFSI ENGINE HIGH OIL CONSUMPTION. THERE IS A DESIGN FLAW WITH THE ENGINE THAT CAUSES HIGH OIL CONSUMPTION. AS A RESULT, ENGINE OIL LEAKS INTO THE CYLINDERS WHICH CAUSE THE ENGINE TO STALL, DAMAGE THE ENGINE AND IMPEDE ACCELERATION. I HAVE ADDED OIL ON 3 OCCASIONS THIS YEAR - 2019. THE FIRST INDICATION TO ADD OIL CAME BACK IN 2015 - 2 YEARS AFTER BUYING THE CAR BRAND NEW AND AFTER ABOUT 30000 MILES.   THE FIRST BREAKDOWN OCCURRED IN 2017 AFTER I STOPPED AT A TRAFFIC LIGHT THEN ATTEMPTED TO ACCELERATE UP ON A HILL, I WASN'T TOLD WHAT THE ISSUE WAS, BUT AUDI COVERED THE REPAIR CHARGES SINCE THE CAR HAD ABOUT 35000 MILES ON IT AND THE MANUFACTURE'S WARRANTY WAS RECENTLY EXPIRED. AFTER BREAKING DOWN ON THE HIGHWAY AGAIN 2 YEARS LATER, THE CAR WAS TAKEN TO THE DEALER WHICH THEN INFORMED ME THAT A BLOWN CYLINDER WAS THE CAUSE AND IT'S BEST I REPLACE ALL 4 CYLINDERS BECAUSE THEY WERE ALL GOING TO FAIL AT SOMETIME. AFTER THE REPAIRS WERE COMPLETED, I DROVE ABOUT 500 MILES, THEN THE CAR INDICATED TO ADD OIL AGAIN.   I ALSO HAPPEN TO NOTICE THAT WHEN THE OIL IS LOW THERE IS HESITATION WHENEVER I START TO ACCELERATE FROM A DEAD STOP OR GOING UP A HILL. I CONTINUE TO ADD OIL WHENEVER THE CAR INDICATES, BUT THE ISSUE GETS WORSE BY THE MILE.    REFERENCE: HTTP://CASESTUDIES.ATLANTICMOTORCAR.COM/AUDI-ENGINE-OIL-CONSUMPTION-CORRECTION/",
        "vin": "WA1CFAFP3DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257129,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION- I LITERALLY JUST GOT AN OIL CHANGE LESS THAN 90 DAYS AGO AND I NEED MORE OIL. THIS IS A USED VEHICLE PURCHASE FOR US AND HAS HAPPEN TWICE SINCE WE HAVE OWNED THE VEHICLE- LESS THAN A YEAR! EVERY SO MANY MILES I'M ADDING A QUART OF OIL!",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255793,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 AUDI Q5 PREMIUM PLUS. THE PROBLEM IS WITH THE STEERING WHEEL ,  IT ACTS WEIRD AND FEELS DIFFERENT THAN USUAL. IT FEELS SOFTER AND THEN STIFF DURING THE SAME MANEUVER WHEN DRIVING THE CAR AND TURNING ON A DIFFERENT CITY STREET ,  AT SPEEDS LOWER THAN 40 MPH . THE VEHICLE HAS ABOUT 86 K MILES.",
        "vin": "WA1LFAFP5DA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240982,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ISSUE IS THE REPLACEMENT OF A DAYTIME RUNNING LIGHT ON THE 2013 AUDI Q5 WHICH FAILED UNDER NORMAL DRIVING CONDITIONS. MILEAGE AT THE TIME WAS UNDER 60K MILES. AUDI ENGINEERING IMBEDDED THE DAYTIME RUNNING LIGHT INTO THE HEADLIGHT UNIT. WHEN THE DAYTIME RUNNING LIGHT FAILS, THE ENTIRE HEADLIGHT UNIT MUST BE REPLACED -  SERVICE ESTIMATE OF $1,695.00.   MY RESEARCH SHOWS DEALERSHIP SERVICE ESTIMATES FOR THE REPLACEMENT OF A DAYTIME RUNNING LIGHT TO BE $85.00 OR LESS FOR OTHER VEHICLES. I FEEL AUDI'S ACTIONS WERE FISCALLY AND ENVIRONMENTALLY IRRESPONSIBLE AND I RESENT AUDI FORCING CUSTOMERS LIKE MYSELF TO PAY SUCH AN EXORBITANT COST FOR THIS SAFETY REPAIR DUE TO AUDI'S BLUNDER.  AUDI WAS AWARE OF THIS ISSUE WHEN I PURCHASED THE VEHICLE BUT DID NOTHING TO NOTIFY ME OF THIS PENDING EXPENSE.",
        "vin": "WA1LFAFP6DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234924,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THAT AS A CONSUMER PURCHASING A 2013 AUDI Q5 WITH 23,000 MILES SHOULD NOT COME UP WITH A 2,000 SOME DOLLAR REPAIR ON A RECALLED PROBLEM THAT AFFECTS MANY OTHER VEHICLES BUILT BY AUDI. THE TIMING BELT TENSIONERS ARE FAILING. AUDI SHOULD RECALL ALL VEHICLES WITH BAD TENSIONERS. IT CAN LEAD TO CATASTROPHIC ENGINE FAILURE AT HIGHWAY SPEEDS. AND EVEN DEATH. THERE ARE MULTI COMPLAINTS ONLINE.",
        "vin": "WA1DGAFPP7D"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221464,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT PUMP BECAME BLOCKED IN MY 3.0 ENGINE VEHICLE, MEANING AT RISK FOR OVERHEATING. THIS MAY BE A SIMILAR PROBLEM TO THE 2.0 VEHICLE, FOR WHICH THERE HAVE ALREADY BEEN 2 RECALLS.",
        "vin": "WA1DGAFP7DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206804,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES HAVE LOST HYDRAULIC PRESSURE SEVERAL TIMES. THE PEDAL GOES TO THE FLOOR WHEN BRAKING TO A STOP. I SEEN A 2018 RECALL BUT MINE DOES SAME.",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192121,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTCHY STEERING WHEN DRIVING.  NOTICEABLE DURING BOTH CITY AND HIGHWAY DRIVING, HOWEVER IT IS MORE NOTICEABLE DURING SMALL TURNS SUCH AS CHANGING LANES ON THE HIGHWAY.  OCCURS ON BOTH LEFT AND RIGHT TURNS. ISSUE IS ONGOING AND CAN BE DANGEROUS AS NOTCHINESS CAN CAUSE UNEXPECTED OVER STEERING.    NOT SURE IF I SHOULD ADD THIS BUT THIS IS A WIDE ISSUE ACROSS MY SEARCHES.  I INCLUDED JUST ONE OF MY FORUMS FOUND RELATING TO MY ISSUE BELOW:  HTTPS://WWW.AUDIZINE.COM/FORUM/SHOWTHREAD.PHP/690756-NOTCHY-STEERING",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174433,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE VIBRATED VIOLENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AUDI NORWELL (59 POND ST, NORWELL, MA 02061, (781) 261-5000) WHERE IT WAS DIAGNOSED THAT A NEW ENGINE BLOCK WAS NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS  60,100.",
        "vin": "WA1CFAFP8DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161216,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "41 DAYS AFTER PURCHASING WELL CARED FOR, USED Q5, BEGAN EXPERIENCING ROUGH RIDE OVER HIGHWAY STRETCH, WITH INTERMITTENT EPC LIGHT AND CONSTANT CHECK ENGINE LIGHT. ENGINE ALSO REVVED AT STAND STILL AND VIBRATED. UNKNOWING OF CURRENT CLASS ACTION LAWSUIT INVOLVING THE TIMING CHAIN, TOOK THE VEHICLE TO A LOCAL MECHANIC.     MECHANIC INDICATED THE TIMING CHAIN HAD BEEN STRETCHED BEYOND SAFE USE AND THE TIMING CHAIN AND TENSION ADJUSTER NEEDED TO BE REPLACED ($2600). FOLLOWING THOSE REPAIRS, I WAS INFORMED THAT DUE TO THE DAMAGED TIMING CHAIN, THE CAM SHAFT WAS ALSO NOT FUNCTIONING CORRECTLY WHICH REQUIRED REPLACEMENT AS WELL AS THE CAMSHAFT POSITIONING SENSOR. (NEW COST - $4900) FOLLOWING THOSE REPAIRS, THE ISSUE STILL REMAINS.     MECHANIC BELIEVES THE ISSUE IS NOW OIL PRESSURE LEAVING THE CAM SHAFT DUE TO A LIKELY ISSUE WITH THE NON-RETURN VALVE LEAVING THE CAMSHAFT BRIDGE. THIS PRESSURE PREVENTS PROPER FUNCTION OF THE VARIABLE VALVE TIMING, CAUSING A VIBRATION AND ROUGH RIDE. MECHANIC OFFERED TO REPLACE NON-RETURN VALVE (ADDITIONAL $3000) BUT CAN'T BE CONFIDENT THAT IT WILL ALLEVIATE THE PROBLEM.    ADDITIONAL OPTION WAS TO REPLACE ENGINE BEGINNING AT $7000.00.    WORKING WITH AUDI SERVICE TO SCHEDULE TIME TO ADDRESS PREVIOUS RECALL ISSUE (COOLANT PUMP) WHEN THEY WILL TAKE A LOOK AT THE ENGINE ISSUE AND EXPLAIN OPTIONS.    CLASS ACTION LAWSUIT OPT-INS WERE DUE BY 10/13/18, 11 DAYS AFTER I PURCHASED THE VEHICLE, 30 DAYS BEFORE I BEGAN HAVING ISSUES.",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113570,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR ON A CITY STREET AND THE RED LIGHT CAME ON. \" STEERING DEFECTIVE! DO NOT DRIVE VEHICLE!\" AT THAT MOMENT THE STEERING WAS DISABLED. IT WAS VERY HARD TO MOVE THE STEERING WHEEL. THANK GOD I WAS ON A LOW SPEED LIMIT STREET. I GOT VERY SCARED AND SLAMMED ON THE BRAKES TO AVOID THE ACCIDENT.",
        "vin": "WA1LFAFP2DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112389,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY BOUGHT MY 2013 AUDI Q5 IN MAY OF 2017 AND SEVEN DAYS AGO I BEGAN TO HAVE AN ISSUE WITH MY VEHICLE ROUGHLY VIBRATING AND EXPERIENCING LOW ACCELERATION. I WAS BLOCKS AWAY FROM MY HOME,  BUT HAVING IT BE RUSH HOUR AND DEALING WITH THE CURRENT ISSUES OF MY CAR SUDDENLY LOSING POWER  I AM LUCKY TO HAVE MADE IT HOME. SINCE MY CAR WILL NO LONGER START AND NOT HAVING THE FUNDS TO HAVE IT TOWED TO MY NEAREST AUDI DEALER SHIP, I PAID TO HAVE A MECHANIC SERVICE COME AND INSPECT THE VEHICLE. UPON HAVING THE MECHANIC INSPECT MY VEHICLE, I GOT THE UNFORTUNATE NEWS OF WHAT WAS WRONG WITH MY CAR. IT SEEMED TO BE HAVING A KNOWN ISSUE WITH THE VW/ AUDI 2.0 TIMING CHAIN. SO, I WAS LOOKING AT ROUGHLY $2,500 IN REPAIRS ON A TIMING CHAIN REPLACEMENT FOR MY PERFECTLY MAINTAINED AND WELL CARED FOR AUDI.  WITH FURTHER INVESTIGATION MY MECHANIC NOTIFIED ME THAT NOT ONLY MY VEHICLE IS SUFFERING FROM THE WELL KNOW TIMING CHAIN ISSUE BUT BECAUSE OF THAT IT ALSO RESULTED IN CATASTROPHIC ENGINE FAILURE. I AM NOW LOOKING AT A BILL OF OVER $7,000 FOR A NEW ENGINE ON MY FAIRLY NEW AUDI.",
        "vin": "WA1LFAFP9DA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103602,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NO INCIDENT HAS OCCURRED.....YET.  THIS IS A RECALL FOR THE ELECTRICAL COOLANT PUMP.  19N4.  NOTICE RECEIVED 6/22/18.",
        "vin": "WA1CFAFP1DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "11/14/2017",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101630,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 AUDI Q5. WHILE DRIVING AT AN UNKNOWN SPEED, SMOKE WAS SEEN UNDER THE HOOD. THE CONTACT WAS NOT ABLE TO COAST THE VEHICLE TO THE SIDE OF THE ROAD DUE TO HEAVY TRAFFIC ON THE INTERSTATE. THE CONTACT WAS ABLE TO EXIT THE VEHICLE WITHOUT INJURIES. THE VEHICLE BURST INTO FLAMES, WHICH WERE EXTINGUISHED BY THE FIRE DEPARTMENT. A POLICE REPORT WAS FILED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INSURANCE LOT WHERE IT WAS DEEMED DESTROYED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC TO DETERMINE THE CAUSE OF THE FAILURE. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBERS: 17V622000 (ELECTRICAL SYSTEM) AND 18V229000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: [XXX]. THE APPROXIMATE FAILURE MILEAGE WAS 27,000. *TT    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT  *JS",
        "vin": "WA1LFAFP1DA"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099810,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED AND THE MESSAGE \"DO NOT DRIVE\" WAS DISPLAYED. THE VEHICLE WAS TAKEN TO RAY CATENA AUDI OF FREEHOLD (3561 U.S. 9, FREEHOLD, NJ 07728, (732) 810-8000) WHERE IT WAS DIAGNOSED THAT THE VEHICLE HAD WATER DAMAGE AND THE CIRCUIT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THEY WOULD NOT COVER THE EXPENSES OF THE REPAIR BECAUSE THE WARRANTY HAD EXPIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 79,000.",
        "vin": "WA1LFAFP9DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091935,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE OPERATING THE VEHICLE, THE STEERING WHEEL BECAME VERY DIFFICULT TO MANEUVER. PRIOR TO THE FAILURE, THE VEHICLE WOULD VEER TO THE LEFT WHEN DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO PERFORMED A FRONT END ALIGNMENT, BUT THE FAILURE CONTINUED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 127,000.",
        "vin": "WA1LFAFP2DA"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064249,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN STARTING ROUGHLY 1/4/2018. TOOK IT TO THE AUDI DEALERSHIP, WHERE THEY DETERMINED THAT THE TIMING CHAIN AND TENSIONER HAVE FAILED. VEHICLE HAS 50,000 MILES.",
        "vin": "WA1LFAFP1DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062462,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE DRIVING 20 MPH AND EXITING THE FREEWAY, THE STEERING WHEEL FAILED TO MOVE AND SEIZED. THE STEERING SYSTEM MALFUNCTION WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (AUDI VALENCIA, 23923 CREEKSIDE RD, VALENCIA, CA 91355, 661-888-1453) WHERE IT WAS DIAGNOSED THAT THE STEERING RACK MODULE AND THE POWER STEERING MODULE NEEDED TO BE REPLACED. THE PARTS NEEDED TO BE ORDERED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER (SAMANTHA AT 1-800-822-2834, EXT 43358) WAS NOTIFIED AND OPENED CASE NUMBER: 180034706. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061644,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHT CAME ON AND STEERING WHEEL LOCKED",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052796,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE TIMING CHAIN AND TENSIONER FAILURE",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/21/2017",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11036035,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUXILIARY WATER PUMP CAUGHT ON FIRE.   CAR WAS PARKED.  NOTICED SMOKE COMING FROM UNDER HOOD.  OPENED HOOD AND FOUND FLAMES (VERY SMALL).  WAS ABLE TO PUT IT OUT WITHOUT VEHICLE DAMAGE. TOWED TO DEALER AND AM AWAITING RESULTS FROM AUDI",
        "vin": "WA1LFAFP2DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "07/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015735,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 74,000 MILES, OUR VEHICLE QUIT RUNNING.  THE TIMING CHAIN HAD SLIPPED AND NEEDED TO BE REPLACES ALONG WITH A TIMING CHAIN TENSIONER, GUIDE RAILS AND 8 INTAKE VALVES.  JUST PRIOR TO QUITTING, THE MOTOR WAS REVVING WHILE AT STOP LIGHTS.  FORTUNATELY, NO ACCIDENT OCCURRED.  OUR REPAIR SHOP INDICATED THIS IS A VERY COMMON DEFECT WITH THE AUDI Q5 2.0 MOTORS AND THAT SAFETY OF DRIVING IS AT RISK WITH THIS COMMON DEFECT.",
        "vin": "WA1LFAFPXDA"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006362,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 70 MPH ON INTERSTATE 68 THE ENGINE LIGHT WENT ON FOLLOWED BY THE EPC LIGHT. THE CAR LOST SOME POWER AND THE CAR BEGAN TO SPUTTER.  BY REDUCING THE CAR SPEED TO 40 MPH I WAS ABLE TO EXIT THE HIGHWAY AND PULL INTO A CAR REPAIR FACILITY IN HAGERSTOWN, MD.  I HAS THE CAR TOWED BACK TO THE AUDI DEALER IN TYSONS CORNER, VA.  IT WAS DETERMINED THAT ONE OF THE FOUR FUEL INJECTORS HAD FAILED WHICH CAUSED IT TO REMAIN IN THE OPEN POSITION.  THE FUEL INJECTOR WAS REPLACED.  THE SERVICE FACILITY COULD NOT EXPLAIN WHAT MIGHT HAVE CAUSED THE FUEL INJECTOR TO FAIL.  THEY DID TEST THE OTHER THREE FUEL INJECTORS AND INDICATED THEY WERE FINE.  MY CAR HAS APPROXIMATELY 57,000 MILES ON IT AND I AM INTERESTED IN LEARNING WHETHER YOU ARE AWARE OF OTHER FUEL INJECTOR FAILURES IN THIS OR OTHER AUDI VEHICLES.",
        "vin": "WAUDNAF49HN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005955,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE APPROACHING A STOP SIGN, THE VEHICLE EXPERIENCED A LOSS OF POWER STEERING ABILITY. THE FAILURE OCCURRED WITHOUT WARNING. THE CONTACT PULLED THE VEHICLE OVER, TURNED OFF, AND RESTARTED THE VEHICLE. THE VEHICLE WAS TAKEN TO THE BROOKLYN AUDI DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING SENSOR AND STEERING SHAFT WOULD NEED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED NO FURTHER ASSISTANCE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 15V452000 (STEERING); HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 23,000.",
        "vin": "WA1CFAFP5DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "05/03/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995822,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLUE THAT HOLDS THE PANORAMA SUN-SHADE TO THE SIDE RAILS FAILS IN HOT CLIMATES. SEPARATION FROM THE SIDE RAIL GUIDES CAUSES THE SUN-SHADE TO CATCH AND TEAR. THIS PART CANNOT BE REPAIRED AND MUST BE REPLACED AT THE COST OF $1500+. I CONTACTED AUDI AND WAS INFORMED THAT THE FAILURE OF THE GLUE IS NOT A COMMON ISSUE DESPITE FINDING DOZENS OF SIMILAR COMPLAINTS ONLINE AND FINDING LOCAL REPAIR SHOPS THAT REPORT REPLACING DOZENS OF SUNSCREENS PER YEAR FOR EXACTLY THIS REASON. I TRULY BELIEVE THIS IS A MANUFACTURER DEFECT AND SHOULD BE TREATED AS SUCH AND REPLACED BY THE MANUFACTURER.",
        "vin": "WA1DGAFP5DA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991023,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 62000 MILES THERE IS A FAULTY BEARING IN THE TRANSMITION THAT IS CAUSING NOISE TO RESONATE IN THE CABIN. I TOOK THE CAR TO A REPUTABLE INDEPENDENT MECHANIC IN SAN FRANCISCO AND HIS DIAGNOSIS WAS THAT IT WAS A MANUFACTURE DEFECT, AND I SHOULD NOT ACCEPT THIS FROM AUDI SINCE THIS PROBLEM SHOULD NOT HAVE OCCURRED AT SUCH LOW MILEAGE.",
        "vin": "WA1LFAFP0DA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980297,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5 HYBRID",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "- I WAS DRIVING HOME AND THE CHECK ENGINE LIGHT WENT ON SAYING HYBRID SYSTEM FAILURE.   - THEN AS I WAS ALMOST HOME, I WAS DRIVING DOWN A VERY STEEP DRIVEWAY, AND THE BREAKS STARTED SKIPPING (FOOT SLAMMED ON BREAKS AND CAR FINALLY STOPPED AFTER ABOUT 20 FEET).   - THE ENGINE WARNING THEN READ \"HYBRID SYSTEM, POWER STEERING, AND TRANSMISSION SYSTEM FAILURE\" FLASHING IN RED (ALONG WITH OTHER SYSTEMS FAILURES) AND THE CAR WAS UNABLE TO DRIVE.  - SCARED FOR MY LIFE, I PUT CAR IN PARK AND HAD IT TOWED TO AUDI OF BELLEVUE  - THEY SAID \"A COOLANT VALVE IN THE BACK OF THE ENGINE SLOWLY LEAKED COOLANT OVER TIME, LEAKING OVER THE ENTIRE ELECTRICAL HARNESS AND WICKED UP INTO THE CONTROL MODULE.\"  - THE SERVICE TECH SAID \"THIS IS A KNOWN ISSUE\" THAT THEY HAVE SINCE REDESIGNED - THUS INDICATING THEM KNOWING THAT THIS IS AN ISSUE  - AUDI ISSUED A RECALL ON THIS FOR THE A8 MODELS FOR \"COOLANT LEAKING THROUGH COOLANT WIRE CONNECTION, CAUSING COOLANT MIGRATION INTO THE ENGINE CONTROL MODULE. IF THIS HAPPENS IT CAN CAUSE A SHORT CIRCUIT OR POSSIBLY EVEN A STALL WITHOUT WARNING, STALLING CAN LEAD TO A VEHICLE CRASH.\"  - AUDI RECALL CODE: 80B9  - SINCE MY CAR IS A Q5 IT IS NOT COVERED UNDER THIS PARTICULAR RECALL, BUT IT IS THE EXACT SAME ISSUE AND CAUSED MY BREAKS TO MALFUNCTION AND CAR TO STALL.      THE CONSUMER STATED THE VEHICLE MANUFACTURER OFFERED A 25%. UPDATED 06/05/2017*JS",
        "vin": "WA1C8AFP0DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "03/01/2017",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ARRIVED AT WORK. WITHIN 10 MINUTES OF ARRIVING A COWORKER ALERTED MY HUSBAND THAT HIS CAR WAS SMOKING. MY HUSBAND WENT OUT TO THE CAR AND THERE WAS SMOKE BILLOWING FROM UNDER THE HOOD. HE QUICKLY OPENED THE BACK DOOR, GRABBED HIS WORK ISSUED LAPTOP AND BY THEN IT HAD BURST INTO FLAMES. THIS HAPPENED IN MARCH 1, 2017. WE FOUND ONLINE AUDI WAS TO RELEASE NEWS TO OWNERS OF A RECALL INVOLVING THE COOLANT PUMP BECOMING BLOCKED WITH DEBRIS AND CAUSING SMOLDERING AND POSSIBLE FIRE. WELL, THERE WAS DEFINITELY FIRE. THE CAR IS TOTALED- BURNED TO A CRISP. FIRE DEPARTMENT AND POLICE RESPONDED. THE FIRE WAS PUT OUT AND NO ONE AND NO OTHER PROPERTY WAS DAMAGED. PRAISE GOD IT DIDN'T HAPPEN IN OUR GARAGE!",
        "vin": "WA1LFAFP6DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925505,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5 HYBRID",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAK RESULTING IN ECM MODULE FAILURE, WIRE HARNESS DAMAGE AND ENGINE TO STALL WITHOUT WARNING.  I WAS DRIVING ON US HWY 1",
        "vin": "WA1C8AFP3DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/18/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5 HYBRID",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW SHATTERED SPONTANEOUSLY WHEN DOOR CLOSED, NO SLAMMED.  CAR PARKED IN GARAGE ON 80-DEGREE DAY.  REAR WINDOW EXPLODED OUTWARD.",
        "vin": "WA1C8AFPXDA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894105,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BUMPER PAINT PEALING OFF. HAD THE BUMPER REPLACED JUST OVER A YEAR AGO AND PAINT IS ALREADY PEALING OFF THE NEW BUMPER. AUDI REFUSES TO REPLACE BUMPER AGAIN BECAUSE IT'S PAST THE WARRANTY. CAN'T EVEN WASH THE CAR WITHOUT MORE PAINT PEALING OFF.",
        "vin": "WA1LFBFP6DA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894109,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC SUNROOF HAS BEEN MAKING NOISE SINCE I PURCHASED THE VEHICLE. DEALER HAS ATTEMPTED TO REMEDY THE ISSUE 5-6 TIMES WITH NO RESOLUTION. IT'S NOISIER DURING THE WINTER THAN DURING THE SUMMER. NOISE IS HEARD ANYWHERE FROM 20 TO 50 MPH ON SMOOTH OR BUMPY ROAD MAKES NO DIFFERENCE.",
        "vin": "WA1LFBFP6DA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/04/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STOPPED AT THE HIGHWAY AT AROUND 65MPH DUE TO COOLANT LEAK/WATER PUMP LEAK.  EMERGENCY STOP TO THE SIDE OF THE ROAD WAS NECESSARY AS WELL AS VEHICLE TOWING.  ILLUMINATOR LIGHT TO TURN OFF ENGINE WAS ON.  WEATHER CONDITIONS AT 100+ FAHRENHEIT HAD POTENTIAL OF DANGEROUS SITUATION IF I WOULD HAVE HAD MY LITTLE ONES.",
        "vin": "WA1LFAFP0DA"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "01/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876179,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD RESTRAINTS PUSH BOTH THE DRIVE AND THE PASSENGERS HEADS FORWARD AND IT CAUSE NECK PAIN. I CANNOT ADJUST THE HEAD RESTRAINT AND IT IS HIGHLY UNCOMFORTABLE. STOP MAKING THE MANUFACTURERS PRODUCE THESE HEAD RESTRAINTS. LET THEM MAKE ADJUSTABLE ONES AGAIN.",
        "vin": "WA1LFAFP7DA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837491,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE ACCELERATED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS REPAIRED; HOWEVER, THE REPAIRS WERE UNKNOWN. THE FAILURE RECURRED. WHILE IDLING AT A RED LIGHT, THE VEHICLE ACCELERATED INDEPENDENTLY AND NEARLY CAUSED A CRASH. THE CONTACT WAS ABLE TO STOP THE VEHICLE BY SHIFTING INTO NEUTRAL. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 28,834.",
        "vin": "WA1LFAFP3DA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/05/2015",
        "dateOfIncident": "09/30/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808597,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRONIC SUNROOF RATTLING. WHILE DRIVING AT VARIOUS SPEEDS, PANORAMIC SUNROOF RATTLES CONSISTENTLY WHILE CLOSED. DEALERSHIP HAS NOT BEEN ABLE TO FIX AFTER 4 ATTEMPTS. VEHICLE IS UNDER WARRANTY. DEALERSHIP IS AWARE OF ISSUE BUT IS UNAWARE OF A RESOLUTION.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "08/16/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760569,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRE PRESSURE MANAGEMENT SYSTEM FAILED TO ALERT THAT THE LEFT REAR (DRIVER'S) SIDE TIRE DEVELOPED A SLOW LEAK. AS A RESULT, THE TIRE WAS DRIVEN WITH DANGEROUSLY LOW TIRE PRESSURE. THE TIRE WAS RUINED AND HAD TO BE REPLACED. THE TPMS DID REGISTER A TIRE PRESSURE FAULT WHEN A NEW TIRE WAS MOUNTED.",
        "vin": "WA1LFAFP8DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743757,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 10 MPH, THE BRAKES SEIZED AS THE PARKING BRAKE WARNING LIGHT ILLUMINATED CONTINUOUSLY. THE VEHICLE WAS TOWED TO A DEALER, WHERE THE VEHICLE WAS DIAGNOSED THAT THE EMERGENCY BRAKE SWITCH FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.",
        "vin": "WA1DGAFP7DA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681204,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEAKERS IN THE AUDIO SYSTEM RANDOMLY EMIT A VERY LOUD POP!  THIS NOISE HAPPENS EVEN WITH THE VOLUME OF THE ENTERTAINMENT SYSTEM ALL THE WAY DOWN AND ALSO HAPPENS WHEN RADIO OR ANY AUDIO IS PLAYING.  THE NOISE IS VERY STARTLING!  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670379,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE BRAKE SQUEELING WHEN BACKING UP AND MOVING FORWARD AT LOW SPEEDS. PROGRESSIVELY GETTING WORSE. DEALER HAS TRIED SEVERAL FIXES (CLEANING) TO NO AVAIL. MY CONCERN (OTHER THAN THE HURTING THE EARS OF BY STANDERS) IS FURTHER BRAKE PERFORMANCE DEGRADATION.",
        "vin": "WA1DGAFP2DA"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616508,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 AUDI Q5.  CONSUMER WRITES IN REGARDS TO VEHICLE REAR SEAT ENTERTAINMENT SYSTEM MONITOR MOUNT CONFIGURATION.  *SMD  THE CONSUMER STATED HE ASSUMED WHEN HE WAS HAVING THE VEHICLE BUILT, THE REAR SEAT ENTERTAINMENT SYSTEM DVD MONITORS  WOULD BE MOUNTED IN THE BACK OF THE FRONT SEAT HEAD REST, LIKE THEY NORMALLY WERE IN OTHER VEHICLE. WHEN THE VEHICLE WAS SHIPPED FROM GERMANY, BACK TO THE US. HE DISCOVERED THE REAR SEAT ENTERTAINMENT SYSTEM DVD MONITORS WERE MOUNTED ON SOME STURDY BRACKETS THAT WERE PROTRUDING FROM THE BACK OF THE DRIVER AND PASSENGER SEATS APPROXIMATELY FOUR INCHES TO SIX INCHES OUTWARD AND DIRECTLY TOWARD THE FACES OF THE PASSENGERS WHO OCCUPIED THE REAR SEATS. *JB",
        "vin": "WA1LFBFP5DA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A CONTINUING PROBLEM WHEN IT RAINS.  THE INTERMITTENT SETTING ON THE WINDSHIELD WIPERS IS INEFFECTIVE AND I BELIEVE DANGEROUS AS VISIBILITY IS SIGNIFICANTLY IMPAIRED.  DURING MODERATE RAINY PERIODS, THE INTERVAL, WHICH IS SUPPOSED TO BE SENSED BY DEVICES IN THE WINDSHIELD RESPONDS ERRATICALLY, WITH INTERVALS VARYING FROM OVER 30 SECONDS TO ABOUT 2-3 SECONDS AND THEN INTERVALS IN-BETWEEN.  THIS IS PARTICULARLY CHALLENGING WHEN PASSING TRUCKS ON LIMITED ACCESS HIGHWAYS WHERE THE PASSING TIME CAN BE EXTENDED BY TRAFFIC.  REQUESTS FOR REPAIR OF THIS ERRATIC OPERATION HAVE BEEN MADE, BUT WITHOUT RESOLUTION OF THE PROBLEM.  I HAVE BEEN TO THE DEALER TWICE AND NO RESOLUTION.  *TR",
        "vin": "WA1CFAFP2DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/06/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586881,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE INTERSTATE AND HAD TO BRAKE. AS SOON AS I HIT THE BRAKE PEDAL IT FELL TO THE FLOOR AND I FORTUNATELY WAS ABLE TO SWERVE TO THE SHOULDER AND AFTER HITTING THE BRAKES A FEW TIMES THEM CAME BACK. ABOUT A WEEK LATER MY WIFE AND KIDS EXPERIENCED THE SAME ISSUE, AGAIN AVOIDING AN ACCIDENT. THIS SEEMS LIKE A COMMON PROBLEM WITH POSTS ON AUDI FORUM. THEY OFFERED AN EXTENSION ON THE VEHICLE WARRANTY BUT THAT DOESN'T PREVENT SOMEONE GETTING KILLED DUE TO MALFUNCTIONING BRAKES.  *TR",
        "vin": "WA1LFAFP7DA"
    },
    {
        "components": "STEERING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "08/16/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545446,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTCHINESS, FRICTION WHILE ROTATING STEERING WHEEL WITHIN FEW DEGREES FROM 12'O CLOCK POSITION EITHER SIDE. PROBLEM PERSISTED DESPITE THE SOFTWARE UPDATE. ANOTHER ISSUE WAS WHISTLING SOUND FROM SIDE MIRROR. AT TIMES PARTICULARLY WHILE DRIVING AT HIGH SPEED, IT GET SO PRONOUNCED AS IF A \"FLY\" IS BUZZING NEXT TO THE DRIVERS EAR. I COMPLAINED TO DEALERSHIP AND AUDI ON 09/14/2013. SINCE THEN I'M DRIVING LOANER. DEALERSHIP TRIED TO RETURN CAR ON 09/17/13, NONE OF THE ISSUES WERE FIXED. I RETURNED CAR TO DEALERSHIP AGAIN.  I COMPLAINED AGAIN TO AUDI OF USA. NOW, I AM TOLD THAT SIDE MIRRORS ARE REPLACED AND FIXED. HOWEVER, NOTCHINESS/FRICTION IN STEERING WHEEL STILL PERSIST. THERE IS NOTHING AUDI CAN DO TO FIX THIS. DEALERSHIP IS INSISTING ME TO ACCEPT MY CAR. HOWEVER, I AM RELUCTANT TO ACCEPT DUE TO CONCERN OF POTENTIAL SAFETY ISSUE. PLEASE ADVISE.   *JS",
        "vin": "WA1DGAFPXDA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/13/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5 HYBRID. THE CONTACT STATED THAT WHENEVER ACCESSING THE POWER LIFTGATE, THE DOOR WOULD OPEN AND CLOSE ABRUPTLY. THE DEALER WAS CONTACTED AND STATED THAT THE LIFTGATE WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "WA1C8AFP0DA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522431,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTED BRAKING.  I AT ONCE PULLED OFF THE ROAD INTO A DRIVEWAY AND ATTEMPTED TO PLACE THE VEHICLE IN PARK BUT WAS UNABLE TO SHIFT OUT OF DRIVE.  I EVENTUALLY WAS ABLE TO STOP THE ENGINE WITH THE SHIFTER STILL IN DRIVE.  I CONTACTED THE DEALERSHIP AND ROADSIDE ASSISTANCE.  THE VEHICLE WAS TOWED TO THE DEALERSHIP.  AFTER 3 DAYS AT THE DEALERSHIP, I WAS TOLD THAT DIAGNOSTIC TESTS DID NOT REVEAL ANY PROBLEM AND THAT THE DEALERSHIP WAS UNABLE TO RECREATE THE PROBLEM.  THE VEHICLE HAS BEEN RETURNED TO ME AND I AM AWAITING FURTHER COMMUNICATION FROM AUDI AND/OR RECURRENCE OF THE PROBLEM.    THIS HAS BEEN THE SECOND PROBLEM I HAVE HAD WITH THIS VEHICLE.  THE FIRST PROBLEM OCCURRED ON THE WAY HOME AFTER PURCHASE..  WHILE DRIVING, THE CHECK ENGINE WARNING LIGHT CAME ON.  I CONTACTED THE DEALERSHIP AND WAS ASKED TO RETURN THE VEHICLE TO THE DEALERSHIP.  AFTER UNDERGOING DIAGNOSTIC TESTING, IT WAS DETERMINED THAT THE AIR INTAKE MANIFOLD NEEDED TO BE REPLACED.  *TR",
        "vin": "WA1WGAFP1DA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/05/2013",
        "dateOfIncident": "01/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515158,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 AUDI Q5. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, SHE HEARD A LOUD NOISE COMING FROM THE SUN ROOF. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED SEVERAL TIMES AND EVERY TIME THE ROOF WAS CLOSE. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 1,500 AND THE CURRENT MILEAGE WAS 5,500. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/29/2013",
        "dateOfIncident": "03/07/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509971,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FREQUENTLY WHEN TRAVELING AT HIGHWAY SPEED ON STRAIGHT HIGHWAY THE VEHICLE WILL DRIFT TO THE LEFT SUDDENLY WITHOUT ANY INPUT FROM THE STEERING WHEEL. THE VEHICLE MUST BE CONTINUALLY CORRECTED THROUGH THE STEERING WHEEL TO MAINTAIN A LANE. AT TIMES A \"NOTCH\" FEEL APPEARS AT THE 12 O'CLOCK POSITION ON THE WHEEL THAT MAKES IT ALMOST IMPOSSIBLE TO MAINTAIN A STRAIGHT DIRECTION WITHOUT CONSTANTLY ADJUSTING THE WHEEL FROM RIGHT TO LEFT. ON SEVERAL OCCURRENCES THE WHEEL JERKED TO CENTER UNCONTROLLED. TURNING THE CAR OFF AND BACK ON WILL RESET THE ISSUE AND THE OCCURRENCES ARE RANDOM. IT IS VERY ANNOYING BECAUSE THE DRIVER DOES NOT FEEL LIKE YOU HAVE CONTROL OF THE VEHICLE. IN RESEARCHING THIS ISSUE I HAVE FOUND SEVERAL OTHER OWNERS OF THE 2013 AUDI Q5 THAT ARE HAVING THE SAME PROBLEM...AUDI INSTALLED A NEW ELECTROMECHANICAL STEERING SYSTEM IN THE 2013 Q5 AND APPARENTLY THIS IS THE SOURCE OF THE PROBLEM. THIS SHOULD BE INVESTIGATED IMMEDIATELY TO DETERMINE IF THE STEERING IS SAFE !!!!!   *TR",
        "vin": "WA1LFAFP9DA"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/16/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508456,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE KEY LESS ENTRY CAR. MY WIFE PUT MY SON IN CAR SEAT, PUT HER PURSE WITH KEYS AND CLOSED THE BACK DOOR AND WHEN SHE TRIED TO ENTER FROM FRONT DOOR THE CAR WAS LOCK, MY SON GOT LOCKED INSIDE THE CAR, EVEN WHEN THE KEY WERE INSIDE. CALLED THE AUDI CUSTOMER CARE, THEY SAID WHEN THE KEYS ARE INSIDE THE CAR IT, NOT SUPPOSE TO HAPPEN.  *TR",
        "vin": "WA1LFAFP1DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503726,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT VARIOUS SPEEDS BETWEEN 30-70MPH, REGARDLESS OF ROAD CONDITIONS, ANY ATTEMPTS TO DRIVE THE VEHICLE IN A STRAIGHT PATH IS MET WITH A SEVER NOTCH AT THE 12'OCLOCK STEERING POSITION MAKING IT DIFFICULT IF NOT IMPOSSIBLE TO MAINTAIN SAID STRAIGHT PATH...REPORTING THIS TO THE DEALER HAS RESULTED IN THEIR ACKNOWLEDGEMENT OF THE PROBLEM, TAKING MY INFORMATION AND STATING THEY WILL CONTACT ME AS SOON AS AUDI HAS A PERMANENT FIX (AND IF I DO NOT HEAR BACK FROM THEM WITHIN 30 DAYS TO REACH BACK OUT TO THEM).  *TR",
        "vin": "WA1DGAFP7DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2013",
        "dateOfIncident": "03/12/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503217,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A FREQUENT BASIS WHEN TRAVELING AT HIGHWAY SPEED ON STRAIGHT, NON-CROWNED PAVEMENT THE VEHICLE WILL DRIFT TO THE LEFT SUDDENLY WITHOUT ANY INPUT FROM THE STEERING WHEEL.  THE VEHICLE MUST BE CONTINUALLY CORRECTED THROUGH THE STEERING WHEEL TO MAINTAIN A LANE.  AT TIME A \"NOTCH\" FEEL APPEARS AT THE 12 O'CLOCK POSITION ON THE WHEEL THAT MAKES IT ALMOST IMPOSSIBLE TO MAINTAIN A STRAIGHT DIRECTION WITHOUT CONSTANTLY ADJUSTING THE WHEEL FROM RIGHT TO LEFT.  ON TWO OCCURRENCES THE WHEEL JERKED TO CENTER UNCONTROLLED.    TURNING THE CAR OFF AND BACK ON WILL RESET THE ISSUE AND THE OCCURRENCES ARE RANDOM BUT FREQUENT.  IF AT THE TIME OF THE OCCURRENCE A VEHICLE WAS OCCUPYING THE ADJOINING LANE AN ACCIDENT WOULD OCCUR. ON RESEARCHING THIS ISSUE IT APPEAR IN NUMEROUS FORUMS AFFECTING AUDI 2013 MODELS WITH NEW ELECTROMECHANICAL STEERING SYSTEMS.  *TR",
        "vin": "WA1WGAFP4DA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/05/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING STRAIGHT, THERE APPEARS TO BE A NOTICEABLE NOTCH IN THE STEERING. THE WHEEL WILL HAVE A TENDENCY TO WANT TO STRAY FROM THIS NOTCH AS IF ROLLING OFF A BUMP. IT IS NOT ALWAYS AS NOTICEABLE. AT IT'S WORST IT FEELS AWKWARD TO KEEP THE VEHICLE TRAVELING STRAIGHT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/05/2013",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501368,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS A NOTCHINES TO IT. DIFFICULT TO KEEP VEHICLE STRAIGHT. FEELS LIKE A GEAR WOULD WHEN MISSING A TOOTH. IT IS INTERMITTENT AND DOES NOT SEEM SPEED DEPENDANT.OTHERS HAVE REPORTED DEFECTIVE STEERING RACKS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/28/2013",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A NOTCHINESS FEELING IN THE STEERING WHEEL. THIS IS ESPECIALLY SEEN AT HIGHWAY SPEEDS AND MAKES THE CAR HARD TO KEEP STRAIGHT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS VERY IMPRECISE AND HAS A NOTCHINESS EFFECT. WHEN I'M GOING DOWN A HIGHWAY STRAIGHT, I HAVE A DIFFICULT TIME KEEPING IT STRAIGHT. IT FEELS UNSAFE WHEN I'M GOING ON A CURVE AT HIGHWAY SPEEDS SINCE THE STEERING WHEEL MAY SHIFT. CONFIRMED BY DEALERSHIP NOTHING IS WRONG WITH STEERING AND ALIGNMENT, BUT STEERING OF THE VEHICLE SEEMS TO HAVE ISSUES. *TR",
        "vin": "WA1LFAFP1DA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491142,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 AUDI HYBRID.  CONSUMER WRITES IN REGARDS TO BRAKE PEDAL MALFUNCTION.  *SMD  THE CONSUMER STATED WHEN HE APPLIED THE BRAKE, HE FREQUENTLY HIT THE ACCELERATOR PEDAL AS WELL.",
        "vin": ""
    }
]