[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429530,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Seat belt my driver restraint light has come on on my car there is a known safety recall on BMW takeda airbags second issue my horn has suddenly stopped working is this related to my airbag as they are in the same area of components basically I don't know if my airbag will work in a collision and I am no longer able to honk my horn",
        "vin": "WBASN2C58DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425888,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Moonroof glass exploded while on highway at 60mph No other cars in around at time Moonroof blew outwards  Nothing hit roof at all",
        "vin": "Wbafu7c58dd"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404209,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2011-2013 HEADLIGHT ASSEMBLIES ARE SUBJECT TO LEAKING AND THUS SOON FAIL.  THIS IS AN EXTENSIVE FAILURE AS IT IMPACTS THE ENTIRE HEADLIGHT ASSEMBLY (ROUGHLY A $2,000 PART) AND OF COURSE IS A SIGNIFICANT SAFELY PROBLEM. ADDITIONALLY, I HAVE SEEN MANY POSTS ON BMW FORUMS ABOUT THIS SAME PROBLEM AND HEARD IT AT MY REPAIR SHOP AS WELL.  I RECOMMEND A SAFETY RECALL BASED ON THIS VERY SIGNIFICANT AND VERY EXPENSIVE SAFETY HAZARD. THE FAILURE START WITH CONDENSATION IN THE HEADLAMPS AND THEN RESULTS IN AN ELECTRIC CONTROL MODEL FAILURE FOR THE HEADLIGHT ASSEMBLY AND SUBSEQUENT FAILURE OF THE LIGHT TO WORK.",
        "vin": "WBAFR7C53DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348428,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 535I. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE MESSAGE PARKING LIGHT MALFUNCTION AND ADAPTIVE HEAD LIGHT MALFUNCTION WERE DISPLAYED ON THE INSTRUMENT PANEL. ADDITIONALLY, THE LEFT TURN SIGNAL LIGHT MALFUNCTIONED AND WOULD NOT OPERATE. THE CAUSE OF THE FAILURES WERE NOT DETERMINED. THE LOCAL DEALER BMW OF MACON LOCATED AT 4785 RIVERSIDE DR, MACON, GA 31210, WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 55,000.*BF  CONSUMER STATED FOLLOWING HAD MALFUNCTIONS HEAD LAMP VERTICAL AIM CONTROL, BATTERY DISCHARGING WHILE STOPPING, ELECTRICAL DEVICES SWITCHED OFF TEMPORARILY, AND AIR CONDITIONER STOPPED WORKING.*JB",
        "vin": "WBAFR7C5XDC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/13/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320972,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MALFUNCTION OF DRIVER SIDE HEADLIGHT CONDENSATION WAS TOLD THAT THE REASON THE MODULES FOR CONTROLLING DAYTIME BURNING LIGHTS HEADLIGHTS AND TURN SIGNAL WERE CAUSED WATER GETTING ON THE MODULES THIS IS A SAFETY ISSUE BECAUSE THERE'S NO TURN SIGNALS NO WAY FOR OTHER DRIVERS TO SEE MAKING RIGHT OR LEFT TURNS. UPON SEARCHING THE INTERNET HAVE FOUND THAT THIS IS A COMMON PROBLEM WITH OTHER OWNERS OF THIS SERIES OF BMW  CAR HAS BEEN GARAGED SINCE PURCHASE AS CERTIFIED PREOWNED VEHICLE 45 MONTHS AGO",
        "vin": "WBAFR7C57DC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "01/14/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319153,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER AND MOISTURE IS ACCUMULATING IN BOTH HEADLIGHTS WHEN IT RAINS CAUSING THEM NOT TO FUNCTION PROPERLY.  THIS HAS BEEN HAPPENING FOR A COUPLE OF YEARS.   I'VE CONTACTED THE MANUFACTURE AND WAS ADVISED THAT THEY WOULD NOT TAKE ACTION AS THE VEHICLES IS NO LONGER UNDER WARRANTY.   I HAVE TWO OTHER CARS THAT MUCH OLDER AND NEVER HAD SIMILAR PROBLEMS.",
        "vin": "WBAFR7C50DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317434,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE SHAFT IS HITTING THE TRANSMISSION AND THE TIRE SENSORS KEEP POPPING UP AND SWEAT BELT IS MALFUNCTIONING. THE VEHICLE WAS IN MOTION WHEN THESE THINGS OCCURRED.",
        "vin": "WBAFU7C54DD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312285,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BMW HAD RUN FOR ABOUT 20 MINUTES A COLD MORNING WITH THE DRIVER CAR SEAT HEATER ON. IT SUDDENLY BEGAN TO SMOKE UNTIL THE CAR WAS SHUT OFF. THE GREY LEATHER SEAT NOW HAS A BURN MARK, AND WE DO NOT TURN ON THE CAR SEAT HEATER UNTIL THIS IS EVALUATED.",
        "vin": "WBAFU7C58DD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267551,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERMOSTAT & WATER PUMPS FAIL ON THESE VEHICLES PREMATURELY. MANY OWNERS ARE BLOGGING ONLINE THAT THESE VEHICLES HAVE EARLY (AND FREQUENT) FAILURES WITH THERMOSTATS & WATER PUMPS. THESE FAILURES LEAD TO THE VEHICLE FORCING YOU QUICKLY TO SLOW DOWN AND PULL OVER(LIMP MODE) - SOMETIMES NOT IN THE MOST FORGIVING LOCATIONS. IN ADDITION, THE FAILURE OF THESE COMPONENTS MAY BE THE ROOT CAUSE OF OTHER ENGINE COMPONENTS FAILING - AT AN EXTREME, UNNECESSARY EXPENSE TO THE OWNERS. THIS OCCURS WHILE THE VEHICLE IS IN MOTION. THE VEHICLE'S \"SAFETY\" SYSTEM FORCES THE VEHICLE TO DECELERATE UNTIL YOU BRING THE VEHICLE TO A STOP. THIS CAN OCCUR ON THE FREEWAY (EVEN A FREEWAY IN LOS ANGELES WHERE YOU MAY BE IN THE 8TH LANE TO THE LEFT WITH NO EMERGENCY LANE TO YOUR LEFT). THE MANUFACTURER SHOULD BE HELD RESPONSIBLE TO RECALL/UPDATE/REPLACE THESE FAULTY COMPONENTS ON ALL 5 SERIES MODELS FROM 2004 - 2013(AT LEAST 2 DIFFERENT MODELS IN THIS YEAR RANGE).",
        "vin": "WBAFR7C52DC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093385,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR SUSPENSION.  CAR LEANED LEFT AFTER SITTING, BUT THE AIR SPRING PUMPED UP ON VEHICLE START-UP.  CAR WAS TAKEN TO THE DEALER, WHO IDENTIFIED A LEAKING LEFT REAR AIR SUSPENSION SPRING.  IDENTIFIED TECHNICAL BULLETIN (SI B37 01 15) NOTING FAULTY INSTALLATION DURING ASSEMBLY.  THE BULLETING RECOMMENDS REPLACING LEFT AIR SPRING (BMW TO SUPPLY LABOR AND PARTS) ON CARS MANUFACTURED  THROUGH FEB 2, 2013.  MY CAR WAS MANUFACTURED FEB 17, 2013 AND THE BMW CUSTOMER RELATIONS DEPARTMENT REFUSES TO COVER THE COST OF REPLACEMENT SINCE IT IS OUTSIDE THE BULLETIN DATES.  CAR HAS 40,500 MILES AND THE FAILURE WAS EXACTLY AS DESCRIBED IN THE TECHNICAL BULLETIN.  HENCE, THIS IS EVIDENCE THAT THE VEHICLE DEFECT EXCEEDS THE ASSEMBLY DATES AND THE DATE OF MANUFACTURE SHOULD BE EXTENDED.       FURTHER, THE AIR SPRING WAS DEFECTIVE, BUT A WARNING LIGHT WAS NOT ACTIVATED BECAUSE THE AIR BAG WAS INFLATED DURING THE VEHICLE START UP PROCESS.  THIS MAY HAVE LED TO A CATASTROPHIC FAILURE OF A DEFECTIVE AIR SHOCK WHILE THE CAR WAS IN MOTION, AND IS THEREFORE A SAFETY HAZARD.",
        "vin": "WBASP2C53DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/07/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092205,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 535I. WHILE DRIVING 45 MPH, THE CONTACT NOTICED THAT THE AIR BAG WARNING INDICATOR WAS ILLUMINATED, WHICH WAS A SAFETY CONCERN. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TAKEN TO LEITH BMW (5603 CAPITAL BLVD, RALEIGH, NC 27616, (919) 882-2420) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "WBAFR7C55DC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091108,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLIER THIS YEAR, WATER WAS NOTICED IN THE FRONT LEFT HEADLIGHT. DEALER NOTIFIED ME THAT A SEAL WAS BROKEN AND THE UNIT NEEDED TO BE REPLACED ($2500+). 2 WEEKS LATER, THE FRONT RIGHT HEADLIGHT DID THE EXACT SAME THING. VEHICLE IS APPROX. 4.5 YEARS OLD WITH 55K MILES. SHOP FOREMAN TOLD ME THIS PARTICULAR MODEL IS KNOWN FOR THIS PROBLEM AND BMW IS AWARE AS WELL. I KNOW MULTIPLE PEOPLE WITH THIS VEHICLE THAT HAVE THE SAME ISSUE. THE DEFECTIVE SEAL IN THE HEADLIGHT UNITS FOR THIS MODEL PRESENT NUMEROUS SAFETY CONCERNS, THE MOST SERIOUS OF WHICH IS THE INABILITY TO SEE THE ROAD DUE TO THE MOISTURE BUILDUP. FURTHER, THE MOISTURE EVENTUALLY CAUSES THE BULBS TO GO BAD, PARTICULARLY THE TURN SIGNAL BULB WHERE THE MOISTURE FIRST ENTERS. OTHER VEHICLES CANNOT SEE THAT TURN SIGNAL OR HEADLIGHT. A RECALL NEEDS TO BE SERIOUSLY CONSIDERED TO REPLACE THE DEFECTIVE SEALS ON THESE HEADLIGHTS AS THEY NOT ONLY RENDER THE VEHICLE USELESS (UNABLE TO PASS STATE INSPECTIONS) BUT ALSO PRESENTS SERIOUS SAFETY CONCERNS DUE TO A LACK OF VISIBILITY, BOTH TO THE DRIVER AND OTHER DRIVERS.",
        "vin": "WBAFR7C51DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981683,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS- BMW HAS FAILED ON SOLVED THIS RECALL IN A TIMELY MANNER EVEN THOUGH THERE IS A POTENTIALLY SAFETY RISK RESULTING IN SERIOUS INJURY OR DEATH. ITS BEEN A YEAR AND NO FIX HAS BEEN AVAILABLE EVEN THOUGH I LIVE IN ZONE A (PUERTO RIO), ZONE ASSOCIATED WITH THE MOST AT RISK VEHICLE PER NHTSA  WEBSITE.",
        "vin": "5UXZV4C51DO"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967340,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR LATCH WILL NOT UNLOCK FROM INSIDE UNLESS CENTRAL DOOR UNLOCK BUTTON IS PUSHED OR KEYFOB UNLOCK BUTTON IS PUSHED. PLUNGER MOVES UP AND DOWN WITH DOOR HANDLE BUT DOES NOT OPEN DOOR.  BECAUSE THIS CAR DISCONNECTS THE BATTERY IN AN ACCIDENT I AM AFRAID THAT I MAY NOT BE ABLE TO GET OUT OF THE CAR IN AN EMERGENCY. REPAIR IS EXPENSIVE AND NOT COVERED UNDER WARRANTY.",
        "vin": "WBAFR7C58DD"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/03/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786525,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBER SEPARATING AND SIDEWALL BUBBLES AT 15K -30K MILES. VEHICLE IS ADULT DRIVEN ON PAVED ROADS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "11/07/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690684,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS LEAVING THE STOP SIGN AND ENTERING THE  BUSY INTERSECTION, MY ENGINE SUDDENLY DIED. THE SECOND INCIDENT HAPPENED A FEW DAYS LATER. I WAS DRIVING ABOUT 15 MPH, AGAIN THE ENGINE SUDDENLY DIED.WE TOOK THE CAR TO BMW ENCINITAS FOR ITS FIRST MAINTAINANCE CHECK AND WE DID MENTION THESE TWO SCARY INCIDENTS.THEY RE-ASSURED US THAT EVERYTHING WAS FINE.  THE LATEST INCIDENT HAPPENED TWO DAYS AGO, FEB 23 ,2015. MY HUSBAND WAS DRIVING AT ABOUT 15 MPH, AND AGAIN THE ENGINE SUDDENLY DIED AND THE TRANSMISSION WENT INTO NEUTRAL.  *JS",
        "vin": "WBAFR7C55DC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/23/2014",
        "dateOfIncident": "11/22/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660353,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "1994",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR 245-40R-19 TIRES ON  MY 2013 BMW 535XI ARE DEFECTIVE. AT 11K MILES, I HAD TO REPLACE ONE TIRE AND THEN AT 15K I HAD TO REPLACE ANOTHER DUE TO SIDE WALL \"BUBBLING\".  DEALER INFORMED ME THIS HAPPENS FREQUENTLY WITH THESE TIRES AND THERE \"IS NOTHING BMW OR GOODYEAR\" WILL DO FOR THE CONSUMER. GOODYEAR DISCONTINUED THEIR INSURANCE. COST TO REPLACE WITH MOUNTING AND BALANCING/TAX $500 PER TIRE. AT FIRST, DEALER MENTIONED YOU MUST HAVE HIT A POT HOLE. WHEN I MENTIONED TO HIM THAT TWO TIRES \"BUBBLING\" AFTER 15K MILES IS VERY QUESTIONABLE HE THEN INFORMED ME THAT THIS IS A TIRE ISSUE. I SENT IN A COMPLAINT TO GOODYEAR AND BMW TO NO AVAIL. THEY DO NOT WANT TO TAKE RESPONSIBILITY FOR THE TIRE ISSUE YET THE TIRES ARE DEFECTIVE AND BMW CONTINUES TO PLACE THEM ON THEIR VEHICLES. RESEARCHING THE ISSUE IT SEEMS THERE ARE MANY OTHER PEOPLE IN MY SITUATION.  *TR",
        "vin": "WBAFU7C52DD"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/15/2014",
        "dateOfIncident": "10/22/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655229,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW 535I SUNROOF GLASS EXPLODED OUTWARD. BROKEN GLASS (THOUSANDS OF SHARDS) CAUSED MULTIPLE SCRATCHES IN PAINT AND DIFFICULTY WITH TRUNK LID. REPAIRS COST $6000. BMW DID NOT ACKNOWLEDGE RESPONSIBILITY UNDER WARRANTY, ALTHOUGH THEY DID ADMIT THAT THE GLASS SUNROOF WAS A WARRANTABLE ITEM. UNEXPLAINED BMW SUNROOF  EXPLOSIONS ARE NOT UNCOMMON (SEE INTERNET), INDICATING AN OBVIOUS FACTORY DEFECT FOR WHICH BMW IS NOT TAKING RESPONSIBILITY.  *TR",
        "vin": "WBAFR7C54DC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629238,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 535I. THE VEHICLE STALLED AND THE STEERING FAILED WITHOUT WARNING WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL. THE CONTACT COULD NOT STOP THE VEHICLE FROM ROLLING DOWN A HILL. THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "WBAFU7C53DD"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": true,
        "dateComplaintFiled": "04/26/2014",
        "dateOfIncident": "09/29/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10585071,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NEW 2013 535I (HEAVILY EQUIPPED) ABOUT 50 MPH IN 55 MPH ZONE ON A CLEAR EVENING W/LOW TRAFFIC.  SUDDENLY AND WITHOUT WARNING BMW COLLIDED INTO REAR-END OF ILLEGALLY PARKED VEHICLE LACKING ANY WARNING LIGHTS OR FLARES.  BMW RAMMED ADVERSE PARKED VEHICLE APPROX. 16' BEFORE PULL APART.  AIR BAGS DEPLOYED ON STEERING WHEEL AND KNEE. STEERING WHEEL AIRBAG CAUSED SIGNIFICANT DAMAGE TO LEFT ARM ETC..  BOTH LEGS IN SIMILAR TRAUMA POST-CRASH AT KNEE TO FOOT EQUALLY.  FRONT WINDSHIELD CRACKED INWARDS (NOT OUTWARD) ABOVE STEERING WHEEL. FORCE OF IMPACT TO RT. FOOT/HEEL TO PEDAL/FLOOR CAUSED MULTIPLE FRACTURES REQ. 10 SCREWS WITH PLATE AND OTHER INJURIES.  TEMPORARY TOTAL DISABILITY AND PARTIAL PERMANENT DISABILITY.  OUT OF POCKET MEDICAL COSTS, AND OTHER SPECIALS EXCEED $100,000.00 EXCLUDING VALUE OF VEHICLE.  (DAMAGE TO VEHICLE ESTIMATED TO EXCEED $42,000.00) BMW STALLED AND ROLLED TO A REST IN LEFT LANE.  BMW ASSIST COULD NOT SPEAK TO ME, BUT COULD HEAR FROM WITHIN VEHICLE. BMW ADMITTED ITS BMW ASSIST SYSTEM MALFUNCTIONED. AIRBAG DEPLOYED AND MAY NOT HAVE PROPERLY AND/OR TIMELY NOTIFIED 911.  PERSONAL INJURIES FROM AIRBAG DESPITE SEAT AND STEERING WHEEL FULLY RETRACTED.   BMW PROMISED, BUT FAILED TO PROVIDE AUDIOTAPE AND TRANSCRIPT, DESPITE REPEATED ATTEMPTS.  MOREOVER, BMW WON'T PROVIDE COMMON COURTESY OF A RESPONSE TO SAID FAILURE EVEN THOUGH PROOF OF SERVICE EXISTS.  UNUSUAL PARTICULARLY SINCE NO THREAT OF LITIGATION HAS BEEN OR WILL BE MADE.  AIR BAGS DO NOT SHOW AS BEING DISCONNECTED FROM CRASH ON THIS SITE. PERSONAL INJURIES E.G. MEDICAL BILLS, PAIN AND SUFFERING ETC. INTO SIX FIGURES.  BMW HAS ALSO REFUSED TO INSPECT VEHICLE TO REBUT ANY QUERIES AS TO VEHICLES' PERFORMANCE AT MOMENT OF IMPACT.  BMW NOR SELLING DEALER NEVER INFORMED ASSIST PACKAGE FOR ABOUT $1,300 WOULD HAVE PREVENTED OR SIGNIFICANTLY REDUCED THE OUTCOME.   *TR",
        "vin": "WBAFR7C50DC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2014",
        "dateOfIncident": "02/18/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575561,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE TIME OF PURCHASE I WAS TOLD THAT THE FIRST TUNE UP WOULD BE DUE AT 10,000 MILES. THEREFORE I SCHEDULE AN APPOINTMENT FOR SERVICE, HOVER WHEN I BROUGHT IT IN THE FIRST TIME AT 10,000 MILES I WAS TOLD THERE WAS NO NEED FOR TUNE UP THAT THE COMPUTER WOULD DISPLAY A MESSAGE TELLING ME WHEN TO SERVICE IT. ONE WEEK LATER IT WAS DISPLAYING THAT IT NEEDED OIL, SO I BROUGHT IT IN. ONE QUART OF OIL WAS ADDED ON THE SPOT. AFTER 11,000 IT WAS TELLING ME TO SERVICE THE CAR IN 1200 MILES SO AT 12200 I BROUGHT IT IN. ONCE AGING I WAS TOLD IT WAS NOT TIME. NOW IT IS ONCE AGAIN DISPLAYING A MESSAGE THAT OIL LEVEL IS LOW BUT I STILL DON'T HAVE THE MESSAGE FOR SERVICE NEEDED. THE CAR NOW HAS 14000 MILES. I JUST DO NOT WANT THE ENGINE TO BLOW OUT AND THE DEALER BLAME IT ON ME FOR NOT BRINGING IN ON TIME.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532440,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS 2 ROF",
                "productYear": "9999",
                "size": "275/50R20",
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR  EAGLE  LS2 ROF TIRES. ONLY 4700 MILES ON MY 2013 BMW 535 ACTIVEHYBRID.  BUBBLE ON RF TIRE, I AM THE ONLY DRIVER.  NO POTHOLES EVER HIT OR CURBS RUBBED INTO.  I AM IN THE AUTO INDUSTRY. CAREFUL EXAMINATION OF THE TIRE SHOWED NO SIGNS OF IMPACT ON THE OUTSIDE OF THE TIRE OR THE WHEEL. NO DAMAGE TO THE INSIDE EITHER. OBVIOUS DEFECT IN THE TIRE.  LOOKING AT THE NUMEROUS COMPLAINTS ABOUT THIS TIRE ONLINE THERE IS A PROBLEM. IT NEEDS TO BE ADDRESSED BEFORE SOMEONE KILLS THEMSELVES WITH A BLOWOUT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2013",
        "dateOfIncident": "06/07/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525178,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 535I. THE CONTACT STATED THAT WHILE DRIVING 3 MPH THROUGH TWO INCHES OF WATER, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE FAILED TO RESTART AND WAS TOWED TO THE DEALER FOR DIAGNOSIS. THE CONTACT WAS INFORMED THAT THE ENGINE HAD HYDRO-LOCKED AND WOULD NEED TO BE REPLACED. THE REPLACEMENT ENGINE WAS UNAVAILABLE AND THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 3,900.",
        "vin": "WBAFR7C59DC"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "03/16/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503756,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE AGAIN NEARLY A MONTH AFTER MY 2013 535I HAD ITS HIGH PRESSURE FUEL PUMP REPLACED BY BMW. THE CAR DECIDES TO LOSE ALL POWER AND NOT WANT TO ACCELERATE AGAIN WHILE TRAVELING ON THE FREEWAY. THE CHECK ENGINE LIGHT AND DRIVETRAIN MALFUNCTION LIGHTS CAME ON AND THE VEHICLE BEGAN SHAKING AND SPUTTERING. THIS CAR IS NOT SAFE AT ALL. THE SERVICE ADVISOR IMMEDIATELY RECOGNIZED THIS PROBLEM AND KIND OF BLEW IT OFF BY JOKING ABOUT HOW HE THOUGHT BMW CORRECTED THIS PROBLEM FOR ALL OF THEIR 135, 335, AND 535, WHICH IS DISTURBING TO NOW BMW HAS THIS PROBLEM AND IS STILL SELLING THESE VEHICLES. ALL IT TAKES IS FOR ONE TIME TO HAVE THE WRONG PERSON TRAVELING BEHIND YOU AND WHO KNOWS IF I WOULD BE HERE TO EVEN MAKE A COMPLAINT.   *TR",
        "vin": "WBAFR7C56DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499268,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW 535I. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 TO 30 MPH DOWNHILL, THE VEHICLE STALLED AND ALL OF THE WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS LATER TAKEN TO THE DEALER WHERE THE FAILURE COULD NOT BE REPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,800. THE CURRENT MILEAGE WAS APPROXIMATELY 3,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2013",
        "dateOfIncident": "01/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496937,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREE WAY MY BRAND NEW 535I HAD A DRIVETRAIN MALFUNCTION AND THE CHECK ENGINE LIGHT CAME ON WHILE LOSING POWER AND SLOWING DOWN ALL WHILE SHAKING. PUSHING THE ACCELERATOR THE CAR WOULD NOT GAIN SPEED. WHEN I CALLED BMW THEY SAID TO STOP AT THE NEAREST BMW DEALERSHIP WHICH I DID. AFTER EXITING THE CAR WOULD NOT SHIFT OUT OF FIRST GEAR AND REFUSED TO GO FASTER THAN 20 MILES AN HOUR SHAKING THE WHOLE WAY TO THE DEALER. THEY HAD MY CAR FOR A WEEK BEFORE SAYING THEY NEEDED TO REPLACE THE HIGH PRESSURE FUEL PUMP THEN RUN MORE TESTS AND THAT WAS 2 WEEKS AGO. THE FACT THAT THEY WOULD PUT SOMEONE BACK IN THAT CAR IS DISTURBING AS THOUGH THEY DO NOT CARE ABOUT THEIR CUSTOMERS OR FAMILIES OR EVEN THE OTHER DRIVERS AROUND US AS I WAS NEARLY REAR-ENDED ON THE FREEWAY.  *TR",
        "vin": "WBAFR7C56DC"
    }
]