[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191736,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LOCK ACTUATORS HAVE FAILED. THIS MAKES IT SO THAT THE DOORS DO NOT OPEN WHEN YOU ARE INSIDE THE VEHICLE ATTEMPTING TO GET OUT BY PULLING THE DOOR HANDLE. THIS IS A SAFETY ISSUE NOT ALLOWING ME TO GET OUT OF MY VEHICLE. IF THIS ISSUE IS NOT RESOLVED BY PAYING THE $1500 TO FIX THE ISSUE THE DOORS WILL STOP OPENING COMPLETELY MAKING THIS EVEN MORE OF A SAFETY ISSUE OVER TIME. THIS ISSUE ONLY GETS WORSE AND IS DIRECTLY RELATED TO THE FUNCTIONALITY OF THE CAR. THIS DOOR LOCK ACTUATOR SHOULD BE RECALLED ON ALL VEHICLES BMW MAKES THAT ARE HAVING THIS SAME ISSUE. THIS IS A KNOWN LONG-STANDING ISSUE WITH THESE VEHICLES AND HAS YET TO BE RECALLED EVEN THOUGH IT IS ABSOLUTELY A SAFETY ISSUE. BMW SHOULD NOT BE ABLE TO PROFIT OFF OF THEIR POOR SAFETY MANUFACTURING MISTAKES.",
        "vin": "WBADW7C58DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/14/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169906,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AND PASSENGER TRAPPED IN CAR AFTER PARKING AT AS GAS PUMP. DOORS WOULD UNLOCK BUT NOT OPEN RESULTING IN THE POTENTIAL OF KILLING ITS PASSENGERS IN A CRASH. THERE IS A VIDEO ON YOUTUBE OF A SIMILAR INCIDENT.",
        "vin": "WBA3B3G52DN"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062979,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO WHEEL RIMS CRACKED, ONLY 38,000 MILES ON VEHICLE. RIMS WON'T WITHSTAND NORMAL ROAD CONDITIONS. THEY ARE A SAFETY HAZARD NEVER KNOW WHEN THEY WILL CRACK AND CAUSING LOOSING CONTROL WHILE DRIVING.",
        "vin": "WBADX7C57DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061217,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO OPEN THE DRIVERS SIDE DOOR BY PULLING THE HANDLE IT DOES NOT UNLOCK AUTOMATICALLY. THE ONLY WAY TO EXIT THE VEHICLE IS THROUGH ANOTHER DOOR OR BY USING THE CENTRAL LOCK/UNLOCK BUTTON. MY FEAR IS THAT IN THE CASE OF AN EMERGENCY OR ACCIDENT IF THE ELECTRICAL SYSTEM IS COMPROMISED I COULD POSSIBLY BE TRAPPED IN THE VEHICLE. I ATTEMPTED TO HAVE THIS REPAIRED AT THE BMW DEALERSHIP BUT THEY CLAIM THAT THE PROBLEM BEING MECHANICAL IS NOT COVERED BY THE WARRANTY. ON THE BMW INTERNET FORUMS THERE ARE MULTIPLE POSTS ACROSS VEHICLE MODELS COMPLAINING OF THE SAME FAULTY \"DOOR ACTUATOR\" AND BMW'S UNWILLINGNESS TO REPAIR IT FREE OF CHARGE. I WAS QUOTED OVER $950 TO REPLACE THE PART. THIS IS A SERIOUS LIFE SAFETY ISSUE I BELIEVE NEEDS TO BE INVESTIGATED.    THANK YOU VERY MUCH!",
        "vin": "WBA3A9G54DN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "10/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043583,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335IS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL. TOOK BMW TO BMW DEALER ON MALLORY ROAD IN NASHVILLE TN ON NOV.     3 TO HAVE AIRBAG REPLACED AT 10:00, MY APPOINTMENT TIME. VEHICLE WAS RETURNED  TO ME ABOUT ONE HOUR LATER.  BMW REFUSED TO GIVE ME ANY PAPERWORK RELATED TO THE     MY VISIT. THIS SUGGEST THEY DID NOT CHANGE THE BAG.     PLEASE TELL BMW TO PROVIDE ME WITH THE COMPLETED WORK ORDER SO I HAVE PROOF THE BAG WAS REPLACED",
        "vin": "WBAKG1C54DJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2017",
        "dateOfIncident": "06/08/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994262,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335IS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH  PRESSURE  FUEL PUMPS SEEMS TO BE A CONTINUING PROBLEM WITH BMW.  I FEEL LIKE THIS IS A SAFETY ISSUE BECAUSE IT CAN CAUSE LOSE OF ENGINE POWER.",
        "vin": "WBAKG1C58DJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911158,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE TRAIN MALFUNCTION HAS OCCURRED TWICE IN WHICH THE CARS OUTPUT IS MINIMIZED. WE WERE ON ONE HIGHWAY, CONNECTING WITH ANOTHER AND WENT TO ACCELERATED TO MERGE WITH TRAFFIC AND THE CAR WOULD NOT ACCELERATE.  TOP SPEED WAS 40MPH.  THE SECOND TIME WE COULD AT LEAST DO 65MPH. OCCURRED 7/5/16 AND 9/19/16",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899248,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I RECEIVED A LETTER FROM BMW ON MARCH 2016 NOTIFYING ME OF THE DRIVER'S FRONT AIR BAG MODULE RECALL, CAMPAIGN NO. 16V-071.  BMW DID NOT HAVE ANY PARTS AVAILABLE AT THE TIME OF NOTIFICATION AND INDICATED THEY WOULD NOTIFY ME AS SOON AS THEY ARE ABLE TO PERFORM THE RECALL ON MY VEHICLE.  I AM CONCERNED FOR MY SAFETY AND I THINK WAITING FOR THE AIRBAG TO BE FIXED SINCE MARCH IS A REASONABLE AMOUNT OF TIME, CONSIDERING THE SERIOUSNESS OF THIS MATTER.  IF THERE IS ANYTHING I CAN DO TO SPEED UP THIS PROCESS, PLEASE LET ME KNOW.",
        "vin": "WBAKF5C52DE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855404,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I HAVE BEEN ATTEMPTING TO WORK WITH BMW CORPORATE AND THE LOCAL DEALERSHIP IN RIDGEFIELD CT WHERE I LEASED THE VEHICLE FOR THE PAST 3 MONTHS AND I HAVE YET TO SUCCESSFULLY RESOLVE THE SITUATION.  I HAVE 4 MONTHS LEFT ON MY LEASE AND I WANT BMW TO TAKE THE VEHICLE BACK EARLY AS IT IS UNSAFE TO DRIVE.  I SURVIVED A TRAIN CRASH IN NY JUST OVER A YEAR AGO WHERE 5 PEOPLE WERE KILLED IN THE FRONT CAR I WAS SEATED IN AND I'M NOT GOING TO RISK GETTING KILLED BY A FAULTY AIRBAG.",
        "vin": "WBADX7C54DJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/07/2015",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723832,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN I-5 SOUTH ON JUNE 6 AT ABOUT 6.30 PM WITH 2 OF MY FRIENDS. THERE WAS TRAFFIC ON THE HIGHWAY AND I APPLIED MY BRAKES AFTER SEEING THE VEHICLE IN FRONT OF ME SLOWING DOWN TO A COMPLETE STOP. MY CAR SLOWED DOWN BUT IT WOULD NOT COME TO A COMPLETE STOP. IT KEPT ROLLING. I PRESSED THE BRAKES HARD BUT I COULD FEEL A SQUEALING FEELING IN THE BRAKES AND IT JUST WOULD NOT STOP.IT KEPT ROLLING. I RELEASED PRESSURE ON THE BRAKES FOR A MOMENT AND APPLIED FULL PRESSURE AGAIN BUT STILL  IT WOULD NOT STOP. I FELT LIKE SOMETHING WAS LEAKING AS I PRESSED DOWN ON THE BRAKES AND THE THE COMPLETE HOLD AND STOP THAT HAPPENS AFTER THE BRAKES ARE PUSHED TO THE FLOOR DID NOT HAPPEN THIS TIME. I PULLED THE HAND BRAKES BUT BY THAT TIME IT WAS TOO LATE. MY CAR THEN ROLLED ON BUMPED INTO THE CAR IN FRONT OF ME WHICH MADE IT COME TO A STOP.     I WOULD LIKE TO ADD THAT THIS HAS HAPPENED PREVIOUSLY IN THE PAST. THE FIRST TIME IT HAPPENED I HAD SENT MY CAR TO BMW SEATTLE WHEN MY CAR SHIFTED TO NEUTRAL BY ITSELF BECAUSE OF AN ENGINE FAILURE AND AS IT WAS ROLLING DOWN I PRESSED THE BRAKES BUT COULD NOT PUSH IT DOWN. I HIT A PAVEMENT BY THE RIGHT TO MAKE IT STOP .BMW SEATTLE SAID THAT THEY COULD NOT FIND ANY FAULT EVEN AFTER ME REPEATEDLY TELLING THEM THAT IT DID HAPPEN AND SOMETHING WAS WRONG. THIS ISSUE RESURFACED A FEW WEEKS BACK BUT LUCKILY THERE WAS NO ONE IN FRONT OF ME AND AFTER REPEATEDLY RELEASING THE BRAKES AND PRESSING IT HARD WITH FULL FORCE I MADE IT COME TO A COMPLETE STOP.   UNFORTUNATELY THIS TIME I MET WITH AN ACCIDENT BECAUSE OF THIS ISSUE.  I AM NOW REALLY UNSURE OF DRIVING MY CAR ANYMORE.MOREOVER MY TRUST ON BMW IS COMPROMISED AS THEY TOLD ME THAT THIS ISSUE CANNOT AND DID NOT HAPPEN. IF THE SERVICE TEAM CANNOT FIND A GENUINE FAULT WITH THEIR SYSTEM THAT IS HAPPENING REPEATEDLY I DONT THINK THEY CAN BE TRUSTED WITH THE SAFETY OF THE CAR.",
        "vin": "WBA3A5G56DN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691962,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD SOME SNOW HERE IN NEW YORK THIS PAST WINTER. IT SEEMS AS IF THERE MAY BE A DESIGN FLAW WITH THE WINDSHIELD WIPER. FOR WHATEVER REASON THE WINDSHIELD WIPER ON THE RIGHT HAND SIDE POPPED. PER THE DEALER THIS OUTSIDE INFLUENCE VOIDED THE GUARANTEE AS THERE WAS ICE UNDER THE COWL WHERE THE ARM IS CONNECTED TO THE MOTOR. THE PHOTO IN THE ATTACHMENT SHOWS THE AREA IN QUESTION. WHAT GETS ME IS THE \"ICE BUILDUP\" THAT CAUSED THIS TO HAPPEN MOST LIKELY CAME FROM THE DEFROSTER. THE SNOW MELTS AND DRAINS DOWN INTO THE AREA IN QUESTION.     I'M ENCLOSING A COPY OF MY CORRESPONDENCE WITH THE BMW DEALER.    1 ATTACHMENT (1307.1 KB)    CLICK FOR OPTIONS       VIEW SLIDE SHOW (1)    DOWNLOAD AS ZIP    ADD TO ONEDRIVE      HI [XXX],      HERE'S A PICTURE OF MY CAR. I'M LETTING MOTHER NATURE GET RID OF THE ICE. THE DESIGN MIGHT WORK IN FLORIDA. IT'S A DESIGN DEFECT THAT, IF YOU ASK ME, SHOULD BE COVERED!      REGARDS,      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBA3B5C58DF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598385,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS REFUELING OUR 2013 BMW 335I AND I WAS IN THE PASSENGER SEAT.  DURING THAT PROCESS, A PICKUP TRUCK BACKED UP AND WAS CLOSE TO HITTING OUR CAR.  FROM THE PASSENGER SEAT, I TRIED TO WARN THE OTHER DRIVER WITH OUR CAR'S HORN, BUT IT DID NOT WORK, SO I RESORTED TO SCREAMING AS LOUD AS POSSIBLE SINCE THE WINDOWS WERE ALSO CLOSED.  FORTUNATELY, MY HUSBAND HEARD ME AND REALIZED WHAT WAS HAPPENING AND GOT THE TRUCKS ATTENTION AND PREVENTED A POTENTIALLY CATASTROPHIC COLLISION RIGHT NEXT TO A GAS PUMP.    IT NEVER EVEN CROSSED OUR MINDS AT THE TIME THAT A HORN DID NOT OPERATE WHEN THE CAR'S ELECTRICAL SYSTEM WAS SWITCHED OFF WITH THE IGNITION KEY, WHICH ONE MUST DO FOR FIRE SAFETY REASONS WHEN REFUELING.  NEVERTHELESS, AFTER WE GOT HOME WE TRIED THE BMW'S HORN WHEN THE CAR WAS OFF AND THERE WAS NO RESPONSE.  WE TRIED OUR 2005 SUBARU OUTBACK'S HORN WITH ITS IGNITION SWITCHED OFF, AND ITS HORN WORKED JUST FINE.  I SEARCHED ON '2013 BMW HORN DOES NOT WORK'S' ON THE INTERNET AND THE SYSTEM RETURNED 18,200 RESULTS.  WHILE I DID NOT READ ALL OF THEM, I FOUND NUMEROUS POSTINGS ABOUT BMW HORNS NOT WORKING WHEN THE CAR IS OFF, AS FAR BACK AS 2006.    SOME INTERNET POSTINGS ADVISED HAVING THE KEY IN THE IGNITION. I PLACED THE KEY IN THE IGNITION AND THE DASHBOARD DISPLAY AND I DRIVE SCREEN ACTIVATED, BUT THE HORN DID NOT.  NEXT, I PUSHED THE START BUTTON, WITHOUT ENGAGING THE ENGINE, AND ONLY THEN DID THE HORN WORK. I CONTACTED BMW ASSIST FOR TECHNICAL ASSISTANCE AND SPOKE TO A BMW CUSTOMER SERVICE REPRESENTATIVE IN COLUMBUS, OH.  HE CONFIRMED THAT THE HORN IS OPERATING AS DESIGNED. HE SAID HE WOULD ENTER MY CONCERN INTO THE CUSTOMER FEEDBACK DATABASE.    WE THINK BEING UNABLE TO WARN DISTRACTED DRIVERS ABOUT TO CRASH INTO YOUR OCCUPIED BUT PARKED CAR IS A HAZARD AT LEAST WORTHY OF PROMINENT WARNINGS TO DRIVERS OF BMWS AND ANY OTHER VEHICLE WITH THIS \"FEATURE\".   *JS",
        "vin": "WBADX7C50DJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569337,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS DISPLAYED \"DRIVETRAIN MALFUNCTION, DRIVE MODERATELY\" TWICE NOW IN LESS THAN ONE YEAR OF OWNERSHIP.  WHEN THIS DISPLAY HAS OCCURRED, THE CAR GOES INTO \"LIMP MODE\" AND CAN ONLY BE DRIVEN AT LOW SPEEDS OR WITH VERY SLUGGISH ACCELERATION.  THIS IS A SAFETY HAZARD, AS IT BECOMES EASY TO BE REAR-ENDED BY ANOTHER DRIVER WHEN IT SLOWS SUBSTANTIALLY.  *TR",
        "vin": "WBA3A5G54DN"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "03/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567982,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND PROBLEM WITH  DRIVETRAIN MALFUNCTION, FIRST PROBLEM BACK IN NOV 2013  BOUGHT THE CAR IN AUGUST 2013.  *TR",
        "vin": "WBA3C1C52DF"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567979,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED SHAKING VIGOROUSLY, AND A MESSAGE WAS DISPLAYED (DRIVETRAIN MALFUNCTION).  *TR",
        "vin": "WBA3C1C52DF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561210,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WOULD SHAKE AT IDLE AND SLOW SPEEDS. THE DRIVETRAIN MALFUNCTION INDICATOR CAME ON.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2013",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552529,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD SIMILAR PROBLEM AS PREVIOUSLY REPORTED INCIDENT (09/30/2013), THE LOSS POWER.  THIS WAS THE SECOND TIME FOR ME.  THE FIRST INCIDENT OCCURRED ON OCTOBER 29, 2013.  WHEN I PUT FOOT ON GAS, THE CAR WOULD NOT ACCELERATE.  I TOOK CAR TO DEALER AND TWO DAYS LATER WAS TOLD THE AUXILIARY POWER SUPPLY NEEDED TO BE REPLACED, BUT THE REPLACEMENT PART WAS UNAVAILABLE: THERE WERE NO PARTS IN THE COUNTRY NOR COULD THEY TELL ME WHEN THE PART WOULD BE AVAILABLE.  I WAS TOLD I COULD CONTINUE OPERATE THE CAR AND I SHOULD NOT BE CONCERNED. THE LOSS OF POWER OCCURRED AGAIN NOVEMBER 15. I ALSO NOTICED SIMILAR TO THE PREVIOUSLY REPORTED INCIDENT A CHANGE IN THE  ENGINE TEMPERATURE - THE TEMPERATURE DROPPED FROM ABOUT 250 DEG TO ABOUT 205 DEG.     *TR",
        "vin": "WBA3A9C59DF"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2013",
        "dateOfIncident": "11/02/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550631,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEM RESULTING IN VIOLENT SHUDDERING OF THE VEHICLE BODY AND ABRUPT ENGINE STOPS RESULTING IN DANGEROUS DRIVING CONDITIONS. FLUCTUATIONS IN THE TACHOMETER WHEN THE CAR ATTEMPTED TO STOP AND THE CAR WOULD AUTOMATICALLY CHANGE GEARS TO NEUTRAL OR PARK.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "07/19/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546219,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS APPROACHING THE ON RAMP FOR THE HIGHWAY, I SPED UP IN ORDER TO MERGE INTO ONCOMING TRAFFIC. I DEPRESSED THE GAS PEDAL COMPLETELY TO THE FLOOR BUT THE CAR PICKED UP EXTREMELY SLOWLY AS IF IT DID NOT HAVE ANY POWER. I ALSO NOTICED AT THE SAME TIME THAT MY ENGINE TEMPERATURE SEEMED TO BE UNUSUALLY LOW FOR A VEHICLE THAT HAD BEEN RUNNING FOR OVER AN HOUR. THERE HAD ALSO BEEN AN EXTREMELY LOUD FAN NOISE THAT WOULD COME ON EVERY 2 MINUTES OR SO. AS A RESULT OF THE LACK OF POWER, I NEARLY CAUSED A COLLISION BETWEEN MYSELF AND THE VEHICLE BEHIND ME BECAUSE THE ONCOMING VEHICLE DID NOT ANTICIPATE SOMEONE MERGING ONTO THE HIGHWAY AT SUCH A SLOW PACE. I CONTINUED TO DRIVE WITHOUT POWER FOR ABOUT 20 MINUTES AS IF THE CAR WAS A NATURALLY ASPIRATED VEHICLE EVEN THOUGH IT WAS CLEARLY TURBO CHARGED BUT THE TURBO NEVER KICKED IN. WHEN I GOT OFF OF THE HIGHWAY AND WAS ABLE TO PULL OVER TO RESTART MY VEHICLE, THE CAR STARTED TO RUN AS NORMAL.  *TR",
        "vin": "WBA3A9C52DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/22/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513158,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REARENDED, ON THE FREEWAY, ON THE PASSENGER SIDE, BY AN SUV GOING ABOUT 40MPH, I SLAMMED IN TO ANOTHER SUV IN FRONT OF ME.  MY VEHICLE IS TOTALED.  THE DISPLAY INDICATED THAT THERE WAS AN AIRBAG DEPLOY ERROR.  ALSO, THE REASON MY CAR WAS TOTALED WAS BECAUSE ALL OF THE ELECTRICAL WIRES FOR THE COMPUTER SYSTEM ARE BEHIND THE REAR TAIL LIGHT, AND THEY WERE MELTED AFTER IMPACT.  THIS IS CONCERNING BECAUSE THIS IS ALSO WHERE THE FUEL TANK IS.  LUCKILY, I WALKED AWAY WITH A SORE NECK AND FEW BRUISES, BUT IT IS CONCERNING THAT THE AIRBAGS DID NOT DEPLOY, WHEN THEY WERE CLEARLY SUPPOSE TO.  I HAD THE CAR FOR LESS THAN 2 MONTHS PRIOR TO THE ACCIDENT, AND BOUGHT IT BRAND NEW.    *TR",
        "vin": "WBA3C1C54DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2013",
        "dateOfIncident": "04/18/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508639,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO START/STOP FUNCTION HAS MALFUNCTIONED BEFORE WHERE WHEN I TAKE MY FOOT OFF THE BRAKE, THE CAR DOESN'T START AGAIN. NORMALLY I CAN JUST PRESS THE START BUTTON AND PUT IT IN DRIVE. THIS TIME, HOWEVER, I WENT TO START IT AGAIN AFTER IT HAD AN \"AUTO START/STOP MALFUNCTION\", AND IT WOULDN'T TURN BACK ON. AN ERROR POPPED UP SAYING \"IGNITION MALFUNCTION -- DO NOT TURN ENGINE OFF. CAR WILL NOT START AGAIN.\" CURRENTLY WAITING TO HEAR BACK FROM THE DEALERSHIP AFTER I HAD TO FLATBED IT. ALSO THE CAR WOULDN'T GO INTO NEUTRAL SO THEY HAD TO DRAG IT ON THE FLATBED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2013",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508588,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335IS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS PER BMW,    5140 READ FAULT MEMORY, CONNECTED BATTERY CHARGER FAULT CODE   2A9A,31002A9B, RAN TEST PLAN, UPON INSPECTION, NOTED FRONT BOLT HAD   BEEN PULLED FREE AND THREADS STRIPPED, THIS COMMON WITH AN ENGINE OVER REV.(DAMAGING INTERNAL ENGINE COMPONENTS . THIS WAS LATER CONFIRMED THROUGH DIAGNOSTIC READOUTS PERFORMED BY BMWNA TSE VIA  COMPUTER. AS PER BMW TECHNICAL SUPPORT ENGINEER, DISASSEMBLE AND REASSEMBLED COMPLETE ENGINE TO INSPECT DAMAGE, ALL EXHAUST VALVE HIT  THE TOP OF THE PISTONS, CRANKSHAFT TREAD ARE STRIPPED OUT ALONG WITH  THE CENTER BOLT. METAL GOT INTO ENGINE BLOCK WHICH WILL RESULT IN FURTHER ENGINE PROBLEM WITH OIL PASSAGES AND OIL PUMP. RECOMMEND COMPLETE ENGINE. CUS DECIDED TO NOT PROCEED WITH REPAIR. BMW IS MAIL ATTACHMENTS. **CUSTOMER GOODWILL DIAGNOSIS COURTESY OF DCH MIDLAND   DIAGNOSIS APPROVED BY BMW TSE** NO REPAIR PERFORMED AS PER CUSTOMER   NECESSARY REPAIRS NOT COVERED UNDER BMW WARRANTY AS VEHICLE WAS OVER REVVED...  CAR IS BRAND NEW 2013 WITH 5,140 MILES 335IS.    I HAVE BEEN WORKING THIS ONE AROUND IN MY HEAD AND I CAN'T SEEM TO COME UP WITH ANYTHING... CRANK BOLTS JUST DON'T LOOSEN BY THEMSELVES AND EVEN STILL, THE COMPUTER RECORDED AN OVER-REV EVENT WHICH YOU CAN'T JUST \"DO\". YOU HAVE TO MECHANICALLY FORCE AN OVER-REV, AND EVEN TILL, THE DME RECORDS TIME SINCE THE EVENT HAPPENED, SO IF IT HAPPENED MONTHS AGO, IT SHOULD BE RECORDED THAT WAY (IF IT EVEN RECORDS THAT FAR BACK).  *TR",
        "vin": "WBAKG1C54DJ"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500706,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD NOISE AND THE CAR STARTING SHAKING AND THEN CAR DIED ON ME AND SERVICE  ON MIDDLE OF NOWHERE   AND I STARTS THE CAR BACK BUT IT GOT STALLED MANY TIMES AND IT WAS SHIFTING THE GEAR TO NEUTRAL IT WAS A BAD EXPERIENCE I COULD HAD AN ACCIDENT BRAND NEW BMW. *TR",
        "vin": "WBA3B3C58DJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2013",
        "dateOfIncident": "01/27/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494881,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUBJECT VEHICLE ACCELERATED UNEXPECTEDLY WHEN THE CAR WAS SLOWLY TURNING INTO A PARKING SPACE IN A PARKING LOT.  THE DRIVER HAD TO SUDDENLY PRESS VERY HARD ON THE BRAKE IN ORDER TO STOP THE CAR.  *TR",
        "vin": "WBA3B3C57DF"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/25/2012",
        "dateOfIncident": "12/25/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490036,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3-SERIES",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE OPEN THE DOOR  AND SITS , SHE PULLED THE DOOR TO CLOSE BUT IT WONT LOCK UP TRY SEVERAL TIMES TO DO IT WITH THE REMOTE BUT WONT LOCK UP.  AFRAID TO DRIVE CAR!!!  *TR",
        "vin": "WBA3C1C59DF"
    }
]