[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395492,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GUIBO FLEXIBLE DISC FAILED DURING ROUTINE PA INSPECTION. TECHNICIAN SAID IT WAS CRACKED AND FAILED THE INSPECTION. MY VEHICLE ONLY HAS 62000 MILES ON IT AND THE CV JOINT FAILED. I BELIEVE THEIR WAS A RECALL FOR 2011 AND 2012 MODELS FOR THE SAME ISSUE.I WAS CHARGED MORE THAN 1000 DOLLARS FOR THE REPAIR OF THE FLEXIBLE DISK AT THE DEALERSHIP AND HAD NO CHOICE BUT TO FIX IT SO IT WOULD PASS STATE INSPECTION. I DID NOT WANT THE DRIVE AXLE TO FALL OFF THE CAR. THIS IS RIDICULOUS FOR A CAR WITH SUCH LOW MILEAGE.",
        "vin": "WBAFU9C54DD"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327711,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING MY BMW AT THE DEALERSHIP FOR TWO WEEKS I HAD THE LOW BATTERY DISCHARGING MESSAGE COME ON WHEN I TOOK THE CAR HOME.  THE DEALER ALSO PERFORMED AN OIL CHANGE LESS THAN 1K MILES PRIOR TO THIS PROBLEM.  MY BATTERY DIED, LUCKILY AT EXACTLY THE TIME, I DROVE ONTO MY DRIVEWAY.  THE CAR JUST STOPPED.  I'M JUST GLAD I WASN'T ON THE HIGHWAY OR GOING FASTER SPEEDS.  I ATTEMPTED TO JUMP IT AND CHARGE IT BUT IT WOULDN'T START.  I HAD THE CAR TOWED TO THE DEALERSHIP AND WAS TOLD MY ENGINE HAD LOCKED UP AND THERE WERE METAL SHAVINGS IN THE OIL FILTER AND I NEED A NEW ENGINE ($13,000).      I DON'T KNOW HOW THIS HAPPENED AND THE DEALER CAN'T TELL ME WHAT CAUSED THIS.  I DIDN'T GET ANY WARNINGS, CAR DROVE FINE OTHER THAN THE BATTERY DISCHARGING AND YOUR USUAL DRIVETRAIN MALFUNCTION MESSAGE AFTER THE CAR WOULDN'T START.  I'M TRYING TO WORK WITH THE DEALERSHIP BUT I HAVEN'T GOTTEN ANYWHERE YET.    THIS IS A 2013 550I M SPORT WITH 72,343 MILES ON THE CAR.  THE CAR HAS BEEN KEPT UP AND IS UP TO DATE ON MAINTENANCE.  I'VE READ ABOUT ISSUES WITH THE N63 ENGINE BUT I CAN'T BELIEVE A CAR WITH 72K MILES WILL JUST DIE. A CAR STALLING OUT AND STOPPING IS NOT A GOOD THING.  *TR",
        "vin": "WBAFR9C54DD"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270044,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING MADE SEVERAL REPLACEMENTS TO PARTS (E.G. ALL THREE FUEL PUMPS) TO THIS VEHICLE OVER THREE, THE VEHICLE NOW REQUIRES A NEW ENGINE DUE TO THE FAILURE OF A ROD RING.  THE ROOT CAUSE FOR THIS FAILURE REMAINS UNIDENTIFIED, HOWEVER BMW IS REFUSING TO IDENTIFY AND/OR ACCEPT ACCOUNTABILITY TO ADDRESS THIS FAILURE WHICH REQUIRES AN ENGINE REPLACEMENT (>$13000).  ANY VEHICLE OF THIS AGE (~7 YEARS OLD) AND MILEAGE (~80,000 MI.) SHOULD NOT REQUIRE AN ENGINE REPLACEMENT.    FORTUNATELY THIS ISSUE OCCURRED WHILE TRAVELING ON URBAN ROADS AT SPEEDS LESS THAT 50 MPH.  HAD THIS OCCURRED AT HIGHWAY SPEEDS, THIS FAILURE COULD HAVE BEEN CATASTROPHIC FOR ME, MY LOVED ONES AND OTHERS.  ADDITIONALLY EACH FAILURE (E.G. OF FUEL PUMPS AND ROD RING) HAS CAUSED ME TO INCREASINGLY QUESTION THE SAFETY RESULTING FROM BMW'S VEHICLES USING THESE COMPONENTS.  AT THIS POINT IN THE ABSENCE OF A REMEDY FROM BMW I AM LEFT WITH NO CHOICE BY TO FILE THIS COMPLAINT AS I HAVE TRIED EVERYTHING POSSIBLE WITH BMW.",
        "vin": "WBAFR9C54DD"
    },
    {
        "components": "SEATS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "12/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172045,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED A NHTSA REPORT ON THIS VEHICLE AND SAW NOTHING DANGEREOUS ABOUT THIS VEHICLE UNTIL WE GOT IT INSPECTED. WE TOOK THE VEHICLE TO ATHENS BMW IN ATHENS,GEORGIA AND THE SERVICE ADVISOR TOLD US THAT THEY DO NOT KNOW HOW THE VEHICLE MADE IT TO THEIR SHOP. THERE WERE OVER 30 BOLTS AND SCREWS MISSING FROM THE ENGINE AND IN THEIR WORDS, \"THE ENGINE WAS RAISING UP LIKE A HEART BEATING OUT OF ITS CHEST.\" WE GOT A 2ND OPINION FROM, EURO AUTO PRO IN LILBURN, GEORGIA AND THEY CONFIRMED THE VEHICLE NEEDED VALVE SEALS AND THE VEHICLE HAD BEEN WRECKED IN THE FRONT. NEITHER WAS DISCLOSED TO US FROM THE NHTSA NOR THE DEALERSHIP WHERE WE PURCHASED THE VEHICLE. WE WERE TOLD BY ATHENS BMW THAT THIS VEHICLE SHOULD HAVE NEVER BEEN SOLD TO THE GENERAL PUBLIC IN THAT CONDITION. THE VEHICLE IS SITTING IN OUR DRIVEWAY. WE JUST PURCHASED IT ON DECEMBER 13, 2018. THE OWNER OF THE DEALERSHIP IS REFUSING TO TAKE THE VEHICLE BACK.",
        "vin": "WBAFU9C54DD"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163161,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I HAVE A 2013 BMW 550I XDRIVE M SPORT. IT KEEPS ON MISFIRING ON CYLINDER NUMBER TWO AND I HAVE CHANGED ALL 8 SPARK PLUGS AND THE INJECTOR FOR THAT CYLINDER. I ALSO USED OCTANE BOOSTER AND SEA FOAM TO CLEAN THE CARBON OUT THE FUEL SYSTEM. I DON'T KNOW WHAT ELSE IT COULD BE IF IT'S STILL MISFIRING ON THAT CYLINDER. IT STARTS UP GOOD AND SOMETIMES IT STARTS UP KIND OF HESITANT. WHEN I COME TO A COMPLETE STOP AFTER REALLY GOING FAST IT STARTS TO SHAKE AS I AM STOPPED AND WHEN I GO TO TAKE OFF IT LURCHES SOMETIMES. I HAVE ONLY HAD MECHANICS WORK ON MY CAR AND CAN'T FIND ANY OTHER EXPLANATION AS TO WHY IT'S NOT FUNCTIONING RIGHT.",
        "vin": "WBAFU9C55DD"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119363,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVE BELOW 30 MPH, THE FRONT DRIVESHAFT BROKE AND RUPTURED A HOLE IN THE ENGINE'S UPPER OIL PAN.   THE FLEXIBLE JOINT OR UNIVERSAL JOINT SEIZED AND BROKE THE FRONT PART OF THE FRONT DRIVESHAFT.  THEN THE VEHICLE HAD METAL IN THE ENGINE OIL AND THAT HAS DAMAGED THE ENGINE AND THE TURBOCHARGERS.   THE VEHICLE IS GOING TO NEED A NEW ENGINE, NEW TURBOCHARGERS, AND A NEW FRONT DRIVESHAFT.   THE REPAIR ESTIMATES ARE:   NEW ENGINE - $3800.00   TURBO CHARGERS - $1100.00  FRONT DRIVESHAFT - $1500.00  AUXILIARIES PARTS - $1200.00  LABOR/REPAIR COST - $7000.00  TOTAL COST - $14,600.00",
        "vin": "WBAFU9C52DD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11080253,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR AND TURNED ON THE HEATED SEATS AND WENT INSIDE.  I CAME BACK OUT A FEW MINUTES LATER AND SAT DOWN. I SMELLED BURNING PLASTIC AND COULDN'T FIGURE IT OUT UNTIL MY BACKSIDE WAS BURNED BY THE HEATING ELEMENT.  I HAD SECOND DEGREE BURNS FROM THE SEAT.",
        "vin": "WBAFU9C58DD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "03/18/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003179,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT RISE DUE TO AIRBAG MALFUNCTION.  CAR IS A CPO STILL UNDER WARRANTY. BMW HAS NOT AGREED TO REPLACE THE AIRBAG COMPONENT OF THE SUSPENSION ALTHOUGH IT'S NOT LISTED UNDER THE ITEMS THAT ARE NOT COVERED. THE CAR IS INOPERABLE WITH THIS PART MALFUNCTIONING.",
        "vin": "WBASN0C57DD"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "01/28/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692426,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMPLAINT IS NOT A SAFETY ISSUE.  IT'S A QUALITY ISSUE.  BMW'S N63 ENGINE IS EVIDENTLY NOT WELL ENGINEERED.  THEY HAVE A \"CUSTOMER CARE PACKAGE\"' IN PLACE FOR THOSE CUSTOMERS THAT COMPLAIN TO THE SERVICE DEPT ABOUT THEIR ENGINES NOT RUNNING RIGHT.  BMW IS VERY CAREFUL TO MAKE SURE CUSTOMERS DO NOT VIEW THE REPAIR AS A RECALL.  THAT SAID THE AMOUNT  OF WORK REQUIRED IS EXTENSIVE (TAKES MORE THAN 1 WEEK TO COMPLETE).  FROM WHAT I'VE READ ONLINE THE FIX THEY HAVE IN PLACE DOES NOT ALWAYS WORK.  I ASKED TO BE LET OUT OF MY LEASE AND PUT INTO A DIFFERENT VEHICLE WITH NO PENALTY AND WAS REFUSED ANY ACCOMMODATIONS.      I'M WRITING BECAUSE  YOU SHOULD BE AWARE OF THIS ENGINE ISSUE (GOOGLE N63 ISSUES) ENCOURAGE BMW TO RECALL THE CARS AND ALLOW THEIR CUSTOMERS TO SWAP OUT VEHICLES IF THEY CHOOSE TO DO SO.  *TR",
        "vin": "WBAFR9C58DD"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/15/2013",
        "dateOfIncident": "10/05/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552499,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE GOODYEAR 245/40R19 RUN FLATS ON MY VEHICLE.  A HUGE BUBBLE CAME UP AND I TOOK IT TO THE DEALERSHIP.  THEY SAID IT WAS DUE TO IMPACT AND NOT COVERED ON MY WARRANTY.  I KNOW, THERE HAS BEEN NO IMPACT.  SINCE THEN ANOTHER BUBBLE ON ANOTHER TIRE HAS MANIFESTED.  IT IS A COST OF OVER $1000 TO REPLACE THE TWO TIRES.  VERY FRUSTRATING WHEN READING ALL THE COMPLAINTS ONLINE; CLEARLY THERE IS AN ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2013",
        "dateOfIncident": "01/23/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534669,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "550I",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CONTINUES TO BURN THROUGH OIL APPROXIMATELY EVERY 1,500 MILES, WHICH COULD LEAVE THE VEHICLE STRANDED AND INOPERABLE.  IT'S UNACCEPTABLE IN A BRAND NEW VEHICLE.  *TR",
        "vin": "WBAFR9C5XDD"
    }
]