[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439839,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The component that fails is called the Fuel Strip (BMW part number 16147697815) and is used for measuring the amount of fuel in the fuel tank.  This component is historically known to fail often and this problem is well known by BMW motorcycle dealers and motorcyclists that use this fuel strip.  The failure of these Fuel Strips is a safety issue because it can cause loss of power, by running out of fuel, in traffic and/or at speed.  Additionally it is a safety issue because it can leave the driver stranded in an unsafe location.  The failure can occur at any time including shortly after installation of a new fuel strip.  The Fuel Strip has a design flaw that causes these chronic failures.",
        "vin": "WB1049009DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426772,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a faulty fuel pump, but the dealership cancelled my service because their location is being consolidated and the next-closest dealership is over an hour away. Can another shop not do this fuel pump replacement?",
        "vin": "WB1049001DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280282,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW R1200 R. WHILE THE VEHICLE WAS STATIONARY, A STRONG ODOR OF FUEL WAS DETECTED. THE VEHICLE WAS PULLED OVER AND THE CONTACT NOTICED A PUDDLE OF FUEL UNDERNEATH THE VEHICLE. THE VEHICLE WAS TOWED TO EURO CYCLES OF TAMPA BAY (8509 GUNN HWY, ODESSA, FL 33556, (813) 926-9937) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP WAS LEAKING. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TOWED TO HAP'S CYCLE SALES, INC. (2530 17TH ST, SARASOTA, FL 34234, (941) 365-3443) FOR A SECOND OPINION AND THE CONTACT WAS INFORMED THAT THE FUEL PUMP NEEDED TO BE REPLACED. A METAL RING WAS PLACED ON THE FUEL PUMP, WHICH DID NOT REPAIR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 11,000.*DT",
        "vin": "WB1049007DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915013,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE STOPPED RESPONDING, LEADING TO RUNNING OUT OF FUEL WHILE MOVING. THIS IS A COMMON FAILURE ON MANY BIKE MODELS FROM BMW FROM 2005-2013. I HAVE HAD THIS HAPPEN 5 TIMES SO FAR, AND EACH TIME THE FUEL LEVEL MEASURING STRIP IN THE FUEL TANK WAS REPLACED. THIS IS AN UNSAFE CONDITION SINCE LOSS OF ENGINE POWER FROM RUNNING OUT OF FUEL CAN BE QUITE DANGEROUS ON A MOTORCYCLE. THE DATE LISTED BELOW IS THE FIRST INSTANCE OF WHEN IT HAPPENED.",
        "vin": "WB1049001DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676355,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE SHOWED LOW LEVEL AND THE RESERVE VISUAL ALARM STAYED ON WHILE THERE WAS PLENTY OF FUEL IN THE TANK. REPORTED TO DEALER, OFFICIAL BMW DEALER BROWARD MOTORSPORT OF PALM BEACH, THEIR REPORT CLAIMED THEY HAVE FIXED THE ISSUE, THE MOTORCYCLE HAD 1166 MILES AT TIME OF SERVICE.  TODAY, AT 1540 MILES THE SAME ISSUE OCCURRED AGAIN, THERE IS PLENTY OF FUEL IN THE TANK BUT THE GAUGE SHOW THE LOWEST BAR ONLY AND THE VISUAL ALARM LIGHT STAYS ON AT ALL TIMES.  I WILL NOW HAVE TO TAKE THE MOTORCYCLE TO THE DEALERSHIP TO INSTALL THE 3RD FUEL GAUGE IN 1500 MILES.    IT'S A 17,500 $, 2013 NEW MOTORCYCLE, STILL UNDER WARRANTY, BUT I WOULD LIKE TO KNOW WHAT WILL HAPPEN ONCE THE WARRANTY WILL BE EXPIRED, BY READING ONLINE FORUMS IT SEEMS LIKE THIS IS A VERY COMMON AND REPETITIVE ISSUE WITH APPARENTLY NO SOLUTION APART FROM KEEP ON REPLACING WHILE IT WILL KEEP ON REPEATING.    PLEASE INFORM IF THERE IS ANY SOLUTION.    THANKS  *TR",
        "vin": "WB1049001DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "10/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649177,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW FUEL LIGHT ILLUMINATED AND REPORTED 42 MILES TO EMPTY ON THE INSTRUMENT CLUSTER. APPROXIMATELY 7 MILES LATER THE MOTORCYCLE LOST POWER WHILE ON THE ROADWAY. FUEL GAUGE STILL SHOWED ONE BAR AND 42 MILES TO GO AT THE TIME POWER WAS LOST. BMW APPARENTLY KNOWS ALL ABOUT THIS PROBLEM BUT HAS NOT FIXED THE DEFECTIVE FUEL STRIP DESIGN TO PREVENT FUTURE OCCURRENCES.  *TR",
        "vin": "WB1049003DZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/20/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593623,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING, I RECEIVED A DASH WARNING LIGHT THAT WAS I (UNEXPECTEDLY) COMPLETELY OUT OF FUEL. AT THAT POINT I DID NOT KNOW HOW MANY MILES WERE ON MY TANK, IF I HAD A FUEL LEAK, ETC AND IMMEDIATELY MANEUVERED TO A SAFE LOCATION TO VERIFY MY FUEL STATUS. THANKFULLY I WAS IN A PLACE I COULD DO THAT. TURNS OUT I HAD AMPLE FUEL AND NO VISIBLE LEAKS, HOWEVER THE GAUGE AND WARNING SYSTEMS WERE INFORMING ME OTHERWISE.     I ENDED UP RIDING TO THE NEAREST GAS STATION AND CONFIRMED I STILL HAD 3/4 TANK REMAINING, BASED ON HOW MUCH FUEL THE BIKE TOOK TO \"TOP OFF\".    AFTER CALLING THE DEALERSHIP TO CONFIRM THE BIKE'S COMPUTER WILL ALLOW ME TO RIDE (DESPITE NOT REGISTERING ANY FUEL IN THE SYSTEM), I WAS INFORMED THAT THIS IS A VERY COMMON PROBLEM ON MY MODEL AND THEY CAN'T KEEP THE PARTS IN INVENTORY THEY ARE FIXING IT SO FREQUENTLY.     BASED ON WEB SEARCHES, OTHERS ARE REPORTING THAT THEY DON'T GET A WARNING THEY ARE RUNNING OUT!     BMW MOTORAD STATES THAT THIS PART (THE FUEL STRIP) FAILS DUE TO CORN ETHANOL IN OUR US GAS, AND THIS PART DOES NOT FAIL IN OTHER MARKETS THAT DON'T USE ETHANOL. MY QUESTION IS, HOW CAN THEY SELL A PRODUCT THAT ISN'T ENGINEERED TO WORK WITH THE GAS THAT'S AVAILABLE?    WHILE THIS ISSUE HAS A SIMPLE WORKAROUND - KEEP TRACK OF YOUR MILES AS YOU'RE RIDING - THERE ARE TIMES WHEN YOU COUNT ON THAT GAUGE BECAUSE YOU SIMPLY FORGET TO RESET THE TRIP ODOMETER AT A FILLUP. IF I WAS ON THE INTERSTATE AND RAN OUT DUE TO THE GAUGE NOT INDICATING I WAS LOW, THIS COULD HAVE BEEN A COMPLETELY DIFFERENT SCENARIO.  *TR",
        "vin": "WB1049004DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "10/13/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547878,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE INDICATED A FULL TANK, BUT WASN'T CORRECT. WHEN THE TANK RAN DRY, I LOST ALL POWER ON THE EXPRESSWAY GOING 75MPH IN CROWDED TRAFFIC.  *TR",
        "vin": "WB104900XDZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2013",
        "dateOfIncident": "09/06/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544780,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE MONTHS AND 400+ MILES INTO MY OWNERSHIP OF A NEW BMW R1200R MOTORCYCLE, THE FUEL STRIP FAILED COMPLETELY.  UPON ENGINE START WITH 3/4 FULL GAS TANK, THE GUAGE READ EMPTY.  IT CONTINUES TO READ EMPTY REGARDLESS OF THE AMOUNT OF FUEL IN THE TANK.  THIS ISSUE HAS PLAGUED A VERY HIGH PERCENTAGE OF NEW BMW MOTORCYCLES AND THE COMPANY HAS YET TO OFFER A FIX.  IN THE MEANTIME, THIS PROBLEM REQUIRES A TRIP TO AN AUTHORIZED BMW MOTORCYCLE DEALER FOR A WARANTEE REPLACEMENT, MANY OF WHICH HAVE ALSO FAILED AGAIN AND AGAIN.  THIS CONDUCT ON THE PART OF BMW IS TOTALLY UNACCEPTABLE.",
        "vin": "WB1049006DZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "08/08/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534398,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE CEASED WORKING AND REGISTERS EMPTY ALL THE TIME.  THE \"LOW FUEL\" LIGHT IS ILLUMINATED DESPITE HAVING GONE ONLY 50 MILES SINCE FILLING THE TANK.  VISUAL EXAMINATION CONFIRMS THE TANK IS APPROX. 3/4 FULL.  FROM A VERY BRIEF INVESTIGATION, I DISCOVERED THIS HAS BEEN A COMMON ISSUE WITH THE R1200R FOR SEVERAL YEARS.  I AM REPORTING IN HOPES THAT PRESSURE CAN BE BROUGHT FOR REAL FIX BY BMW INSTEAD OF SIMPLY REPLACING FAULTY FUEL STRIPS WITH MORE FAULTY FUEL STRIPS.  SOME OWNERS REPORT HAVING THE STRIPS REPLACED 4-5 TIMES WITHIN A 3 YEAR PERIOD.  THE MODE OF FAILURE CAN BE INTERMITTENT OPERATION, CONSTANT \"FULL\" READING, OR A CONSTANT \"EMPTY\" READING.  SINCE I LIVE IN THE ARIZONA DESERT, I FREQUENTLY CAN BE MANY MILES FROM ANY ASSISTANCE, AND NOT HAVING ACCURATE KNOWLEDGE OF MY FUEL SITUATION COULD BE EXTREMELY DANGEROUS.  *TR",
        "vin": "WB1049002DZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498348,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 R",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A BRAND NEW 2013 BMW R1200R MOTORCYCLE AND WITHIN 10 MILES OF RIDING AWAY FROM DEALER LOW FUEL WARNING COMES ON AND FUEL GAUGES NO LONGER WORKING. STOPPED AT NEAREST GAS STATION AND CHECKED GAS TANK TO FIND FULL TANK OF GAS AS DEALER STATED. CALLED DEALER AND WAS TOLD TO CONTINUE TO RIDE MOTORCYCLE FOR 50 MILES AND COMPUTER SHOULD RE-SET. CONTINUED TO RIDE FOR 50 MILES AND NO RESOLUTION. CONTACTED DEALER AGAIN AND I WAS TOLD I NEED TO COME IN FOR SERVICE TO REPLACE FUEL SENSOR STRIP. ON A BRAND NEW MOTORCYCLE I FEEL THIS IS UNACCEPTABLE. UPON RESEARCHING THE PROBLEM I LEARNED AND THE DEALER CONFIRMED THIS HAS BEEN AN ON GOING ISSUE WITH BMW MOTORCYCLES FOR YEARS. VERY DISAPPOINTING TO LEARN AFTER SPENDING $17,000 ON A BRAND NEW MOTORCYCLE. BMW HAS NOT RESOLVED THE ISSUE OTHER THAN INCONVENIENCING PEOPLE TO RETURN FOR SERVICE. IF THE BIKE IS NO LONGER UNDER WARRANTY ITS A COSTLY FIX.  MORE THAN JUST INCONVENIENCE, THIS IS ALSO A SAFETY ISSUE BECAUSE THE RIDER CAN UNKNOWINGLY RUN OUT OF GAS IF THE GAUGES AREN'T WORKING PROPERLY WHICH CAN PUT A RIDER IN HARMS WAY. I'VE ALSO LEARNED THAT BMW HAD THE SAME ISSUE WITH THE 2010-2011 5-SERIES CARS AND HAD A SAFETY RECALL PUT INTO EFFECT TO RESOLVE ISSUE. WHY ARE THE MOTORCYCLES NOT BEING HANDLED IN THE SAME FASHION? IT'S JUST AS MUCH OF A SAFETY ISSUE IF NOT MORE CONSIDERING THE PHYSICAL EXPOSURE ON A MOTORCYCLE. IT'S UNACCEPTABLE TO PURCHASE A BRAND NEW BMW MOTORCYCLE AND BE FACED WITH A MALFUNCTION ISSUE THAT HAS BEEN GOING ON FOR YEARS. BMW SHOULD NOT BE ALLOWED TO SELL EQUIPMENT THAT THEY ARE WELL AWARE OF IS FAULTY. SOMETHING NEEDS TO BE DONE, THERE ARE LITERALLY THOUSANDS OF MOTORCYCLE OWNERS WITH THE SAME PROBLEM.   THIS NEEDS TO BE INVESTIGATED IMMEDIATELY.  *TR",
        "vin": ""
    }
]