[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416316,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A BURNING SMELL WHEN I RUN MY A/C. I TOOK IT TO MECHANIC AND THEY STATED IT'S AN ISSUE WITH THE BLOWER MOTOR WIRING, WHICH IS COVERED UNDER RECALL.  BUT I CHECKED THE RECALL NOTICE AND IT ONLY COVERS MY VEHICLE UP TO 2011, BUT MINE IS A 2013.  HOWEVER, THE BLOWER MOTOR PARTS IN MY CAR ARE EXACTLY THE SAME AS THE 2011, SO I FEEL IT SHOULD BE A PART OF THE RECALL.  I AM AFRAID TO DRIVE MY CAR WITH A/C BECAUSE SOMETHING IS GOING TO CATCH FIRE AND I HAVE NO IDEA WHAT HAS ALREADY BURNED SO FAR.",
        "vin": "WBSKG9C56DJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330176,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I INITIALLY EXPERIENCED ABRUPT CATASTROPHIC CLUTCH FAILURE THIS PAST DECEMBER 2019 WHEN WITHOUT ANY PRIOR WARNING.  I DEPRESSED THE CLUTCH AND IT FAILED TO RELEASE LEAVING THE VEHICLE IN GEAR.  FORTUNATELY I WAS ON A SECONDARY ROAD IN 2ND GEAR AND WAS ABLE TO BRING THE CAR A STOP AND THEN PUSHED IT TO THE SIDE OF THE ROAD.  THE CAR WAS TOWED TO MORRISTOWN BMW IN MORRISTOWN NJ.  BMW NA AGREED TO PROVIDE THE PARTS AND THE CLUTCH WAS REPAIRED.  UNFORTUNATELY, LAST WEEK I AGAIN EXPERIENCED THE EXACT SAME ISSUE WITHOUT WARNING.  I AM NOW TOLD THAT THE MASTER CYLINDER NEEDS TO BE REPLACED. MY CONCERN IS THAT IF THIS FAILURE HAD OCCURRED ON A MAJOR HIGHWAY AT SPEED.  I WOULD HAVE LOST CONTROL OF THE VEHICLE WHICH WOULD HAVE BEEN LIFE THREATENING.  AS THE CAR ONLY HAS 55,000 MILES, THERE ARE UNDOUBTEDLY OTHER 2013 M3 ON THE ROAD WHO'S DRIVERS ARE AT RISK FOR SIMILAR ABRUPT CATASTROPHIC FAILURE WITHOUT WARNING.  I BELIEVE THAT THIS SHOULD BE INVESTIGATED AND BMW SHOULD BE CONTACTED TO COMMENT.  *TR",
        "vin": "WBSDX9C56DE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11161348,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 BMW M3. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). WHILE DRIVING 40 MPH, THE CONTACT REAR ENDED ANOTHER VEHICLE. THE AIR BAGS DEPLOYED. THE CONTACT'S LEFT ARM WAS STRUCK BY THE AIR BAGS AND WAS INJURED BY METAL FRAGMENTS. MEDICAL ATTENTION WAS NOT RECEIVED. A POLICE REPORT WAS FILED. THE DEALER (MOTORWERKS BMW, 1300 AMERICAN BLVD W, BLOOMINGTON, MN 55420, (952)-888-2700) WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. USAA INSURANCE COMPANY TOWED THE VEHICLE TO A SALVAGE YARD AND DEEMED THE VEHICLE A TOTAL LOSS. THE FAILURE MILEAGE WAS 18,000. *DT*JB",
        "vin": "WBSDX9C59DE"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031578,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 BMW M3. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) WAS RECEIVED IN FEBRUARY OF 2016. AFTER CONTACTING THE DEALER (JACKY COOPER IN EDMOND, OK) AND THE MANUFACTURER, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBSKG9C51DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2017",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020265,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA  RECALL. I'VE HAVE BEEN TRYING TO GET MY AIRBAG REPLACED FOR OVER A YEAR. THE LAST TIME I CALLED THE DEALER, THEY TOLD ME MY CAR WASN'T PART OF THE RECALL. MY VIN SHOWS ON THE RECALL  LIST AND I RECEIVED NOTICE FROM BMV TO CONTACT THEM. KEELER MOTOR CAR IN LATHAM NY IS THE DEALER.",
        "vin": "WBSDX9C59DE"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000637,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON SURFACE STREET AT APPROX 35MPH I WAS FORCED TO SWERVE DUE TO BEING CUT OFF BY AN ADJACENT WRECKLESS VEHICLE.  MY 2013 BMW E93, WITH JUST OVER 43,000 MILES, AND WHICH I HAD PURCHASED LESS THAN 30 DAYS PRIOR,  IMMEDIATELY SHUT DOWN ENTIRELY WITHOUT WARNING. I WAS LITERALLY LEFT IN THE MIDDLE OF A BUSY STREET WITH ZERO FUNCTIONALITY. FROM ELECTRICAL TO EVERY ASPECT OF MECHANICAL, THERE WAS NO WARNING, NO FUNCTION OF ANY KIND. MY VEHICLES COMPLETELY UNEXPECTED FAILURE WAS SO SEVERE THAT IT REQUIRED MULTIPLE TOW TRUCKS IN ORDER TO LIFT THE REAR, AS IT HAD LOCKED UP ENTIRELY AND THE MOTOR SEIZED.  UPON ARRIVING AT CENTER BMW (SHERMAN OAKS, CA), THEY CONFIRMED THE OBVIOUS COMPLETE FAILURE OF THE ENTIRE VEHICLE. THEIR MASTER MECHANIC,  SHAUN, VERIFIED THE OIL WAS FULL AND CLEAN, AND NOTED THEY TOO RECEIVED NO ERROR CODES OR IDICATORS OF ANY KIND UPON IN DEPTH INSPECTION. THIS BMW DEALERSHIP & SERVICE CENTER IS AS BEWILDERED AS I AM.  BECAUSE I HAD LITERALLY JUST PURCHASED THE VEHICLE, WITH A FULL WARRANTY, I NOTIFIED MY WARRANTY COMPANY  RED AUTO WHOM SENT A 3RD PARTY INSPECTOR. WITHOUT ACTUALLY INSPECTING THE MOTOR, THE WARRANTY CO HAS DENIED MY CLAIM AND REFUSES TO DO ANYTHING FURTHER, CLAIMING IT IS A \"PRE-EXISTING CONDITION\" BASED ON ONLY REMOVING THE OIL PAN. HOWEVER, FINDINGS OF CENTER BMW'S MASTER MECHANIC DISPUTE THIS ENTIRELY. THIS REPORT, AS WELL AS THE DEALERSHIP INSPECTION REPORT AT THE TIME OF MY PURCHASE (LESS THAN 30 DAYS PRIOR) BOTH REFLECT THE VEHICLE AS WELL MAINTAINED PRIOR TO THIS CATASTROPHIC ENGINE SEIZE.   I AM APPALLED TO HAVE A BASICALLY BRAND NEW BMW ENGINE IN COMPLETE FAILURE FOR NO ADVISABLE REASON. I AM WITHOUT VEHICLE AND WITH A $30,000 REPAIR ESTIMATE.",
        "vin": "WBSDX9C50DE"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "01/30/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000438,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. REASONABLE TIME HAS PASSED SINCE THE AIRBAG RECALL. BUT I HAVE NOT HEARD AS TO WHEN THIS SAFETY ISSUE WILL BE RESOLVED.EVERY TIME I DRIVE THE CAR I FEEL I AM RISKING MY LIFE OR CHANCE FOR SERIOUS INJURY. BMW HAS BEEN COMPLETELY NEGLIGENT WITH REGARDS TO RESOLVING THIS ISSUE. BMW SHOULD TEMPORARILY REMEDY THE SITUATION BY REPLACING THE CAR WITH A SIMILAR VEHICLE. I NEED THIS TO BE RESOLVED NOW!!!.  ALSO THE DRIVE TRAIN HAS A CLUNKING NOISE OF WHICH I HAVE BEEN COMPLAINING SINCE NEW. THEY HAVE MADE TEMPORARY ADJUSTMENT BUT THE PROBLEM STILL SURFACES. THIS HAPPENS WHEN I SHIFT GEARS EVEN AT SLOW SPEEDS (6 SPD MANUAL TRANSMISSION).",
        "vin": "WBSKG9C54DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947706,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ROD BEARINGS.  THERE IS CLICKING NOISE THAT I AM HEARING MORE AND MORE OFTEN. SINCE SUMMER OF LAST YEAR, I HAD HEARD SUBTLE CLICKING NOISES OCCASIONALLY WHICH I WASN'T ABLE TO LOCATE AT THE TIME AND HAD SCHEDULED AN APPOINTMENT WITH THE SERVICE DEPARTMENT AT PARK AVE BMW SERVICE ON OCTOBER 2016 TO GET MY CAR CHECKED FOR FEW REASONS. ONE OF THE REASONS INCLUDED THIS CLICKING NOISE WHICH I HAD MENTIONED TO THE SERVICE AGENT AND THAT HE WOULD GET THIS CHECKED OUT ALONG WITH THE OTHER SERVICE MAINTENANCE. AT THE END OF THE SERVICE, HE STATED THAT EVERYTHING IS FINE AND THERE ISN'T ANY ISSUES.  RECENTLY, I HAVE STARTED TO HEAR THE SAME CLICKING NOISE BUT LOUDER WHICH ALLOWED ME TO LOCATE THE SOUND COMING SOMEWHERE NEAR THE FRONT OF THE VEHICLE NEAR THE ENGINE BAY.  I HAVE A BMW SERVICE APPOINTMENT THIS SATURDAY TO GET IT CHECKED AGAIN TO SEE IF THERE IS ANY ISSUES. AFTER DOING SOME RESEARCH AND GETTING POSSIBLE SUGGESTIONS OF THIS ISSUE, MY BIGGEST CONCERN IS THAT IT COULD BE THE  ROD BEARINGS OF THIS VEHICLE. CURRENTLY, THE VEHICLE IS SITTING IN MY GARAGE UNTIL THE SERVICE APPOINTMENT AND UNABLE TO USE THE VEHICLE UNTIL IT GETS CHECKED DUE TO THIS PROBLEM. IF THERE IS ANYTHING YOU CAN DO TO ASSIST ME ON THIS MATTER, I WOULD GREATLY APPRECIATE IT AS I WOULD LIKE TO GET THIS FIXED.  *TR",
        "vin": "WBSDX9C51DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "01/06/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910460,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I ACCELERATE QUICKLY AT AN INTERSECTION WHEN I GET A GREEN LIGHT, THE ENGINE LOOSES ALL POWER BUT KEEPS RUNNING.  BMW HAS NO IDEA AS NO CODES ARE BEING SAVED WHEN THIS HAPPENS.  THE GENERAL MANAGER SAID IT PROBABLY COMPUTER PART BUT WE MAY NEVER KNOW.",
        "vin": "WBSKG9C5XD1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906897,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 BMW M3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE CONTACT STATED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873743,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AIRBAG BMW TOLD ME NOT TO DRIVE CAR TO PARK IT AND THEY WANT TO GIVE ME RENTAL. UNKNOW HOW LONG FOR REPAIR I LEASE CAR AT $1245 PER MONTH WAY SHOULD I GET A LESSER CAR AND CONTINUE MY PAYMENTS .I HAVE 2 YEARS LEFT I WANT TO TRADE IT IN FOR THE SAME VALUE ON A M4 SHOULDNT THEY GIVE ME THE SAME DEAL TO GET ME OUT OF MY LEASE.. FLORIDA HAS A HIGHER RISK BECAUSEOF THE HEAT FOR THE AIR BAG TO EXPLODE. IM 5FT 1 AND IM AFRAID TO DRIVE MY CAR... I HAVENT DRIVEN IT SINCE THEY TOLD ME ABOUT RECALL ..I HAPPEN TO BRING CAR FOR SERVICE OR I WOULD OF NEVER BEEN TOLD.. I SPOKE TO SALES PERSON AND HE SAID I NEED TO GET OUT OF MY LEASE.. THEY SAID THEY WOULD WITH A MUCH HIGHER PAYMENT WHICH IS TOTALY UNFAIR... WHAT CAN I DO.... I WANT OUT I WANT A M4 TO REPLACE MY M3 . PLEASE LEAVE A MESSAGE IF YOU TRY TO CALL",
        "vin": "WBSDX9C53DE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2016",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821362,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS 3,100 MILES ON IT. I STOPPED TO GET FUEL AND ON THE WAY BACK HOME THE ENGINE STARTED TO MISFIRE HEAVILY, THEN STALL OUT IN HEAVY TRAFFIC ALMOST CAUSING ME TO GET REAR ENDED. LUCKILY THE CAR STARTED BUT FELT LIKE IT HAD ONLY 10% OF THE POWER, BMW TOLD ME TO DRIVE IT TO THE NEAREST SERVICE CENTER TO HAVE IT LOOKED AT. THEY CALLED ME THE NEXT DAY TO TELL MY MY ENGINE HAS FAILED. IM NOT SURE HOW IN 3,100 WELL CARED FOR MILES THE ENGINE WOULD FAIL, ALMOST CAUSING ME TO GET REAR-ENDED IN TRAFFIC. I AM DISAPPOINTED THAT  BMW COULD RELEASE A CAR THAT COSTS $77,000 DOLLARS THAT HAS TOTAL ENGINE FAILURE IN SUCH LITTLE TIME AND MILES. BMW CUSTOMER CARE HAS BEEN THE WORST EXPERIENCE AS WELL. THEY NEVER RETURN PHONE CALLS, AND BASICALLY TELLS ME EVERY TIME THERE IS NO NEED TO WORRY ABOUT THE ENGINE FAILING AGAIN IN 3,100 MILES.",
        "vin": "WBSKG9C52DJ"
    }
]