[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452970,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We were notified in March 2021 that our a fuel pump could start a fuel leak. This could catch on fire causing damage to the motorcycle not to mention my wife and I could be severely burned. They continue to say that they do not have the part and as of September 2021 still do not have the part and as of today they still do not have the part to put in. This is very inconvenient and that I cannot ride my motorcycle for fear of injury. There are no warning lamps if it is leaking and the dealer keeps telling me he does not have the part. They can’t get a fuel pump but they continue to make new motorcycles all the time.  That does not make sense. They sold the motorcycle and they should be able to make all parts available. March 1 it will be one year since I have been notified.",
        "vin": "WB1061102DZ"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432887,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 BMW K 1600 GT. The contact received notification of NHTSA Campaign Number: 21V060000 (Fuel System, Gasoline) however, the part to do the recall repair was unavailable. The contact took the motorcycle to the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect. Consumer stated 2nd letter was issued from manufacturer on Sept 2021 acknowledging delay.",
        "vin": "WB1061102DZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406355,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS NOISY. THE GEARS ARE WORN PREMATURELY. I HAVE 40K MILES ON ME 2013 K1600GT. I SAW A RECALL FOR 2017+ TRANSMISSIONS BUT I BELIEVE IT SHOULD BE EXTENDED TO PRIOR YEARS. OBVIOUSLY IT WAS IN MOTION FROM 10MPH OR FASTER. IT SEEMS TO BE WORSE FROM 3RD GEAR AND HIGHER.",
        "vin": "WB1061107DZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312113,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A RIDE WITH MY 2013 BMW K1600 GT THAT TOOK PLACE ON 12/15/19, I NOTED PROBLEMS WITH THE MANUAL TRANSMISSION, WITH DIFFICULTY IN SHIFTING GEARS. THE BIKE HAS APPROXIMATELY 25, 400 MILES. I WAS ABLE TO DRIVE BACK HOME WITH DIFFICULTY. I  TOOK THE MOTORCYCLE TO THE SAN DIEGO BMW DEALERSHIP TO ASSESS THE PROBLEM. THE ATTACHED REPORT DOCUMENTS 'DAMAGE ON GEAR DOGS FOR 6TH AND 4TH GEAR. CORNERS OF DOGS SHOW ROUNDING AND ARE WORN TO A POLISHED FINISH'. THE DEALER CONTACTED BMW TO ORDER THE DAMAGED PARTS, BUT THE REPLY WAS THAT THESE PARTS ARE NO LONGER AVAILABLE BECAUSE BMW HAS SINCE MODIFIED THE TRANSMISSION. THE ONLY OPTION WAS TO REPLACE THE ENTIRE TRANSMISSION AT THE COST OF $ 5407.07. THE EXTENT OF THE DAMAGE, CONSIDERING THE RELATIVELY LOW MILEAGE, WAS SURPRISING. I SUBSEQUENTLY BECAME AWARE THAT BMW IS RECALLING THOUSANDS OF 2017-2020 K1600 GT, GTL AND B MODELS  FOR  TRANSMISSION PROBLEMS RELATED TO PRODUCTION OF  PARTS  LACKING THE APPROPRIATE HARDNESS LEVEL. IT APPEARS THAT MY 2013 BIKE EXPERIENCED  SIMILAR PROBLEMS. POSSIBLY, THE TRANSMISSION HAS BEEN FROM THE INCEPTION A WEAK SPOT AS ATTESTED BY BMW EFFORTS TO MODIFY IT OVER THE YEARS, WHICH CULMINATED IN THE ABOVE NOTED RECALL OF 2017-2020 RECALL. IT SEEMS THAT OTHER YEARS SHOULD BE RECALLED AS WELL.",
        "vin": "WB1061101DZ"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287926,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BMW K 1600 GT. THE CONTACT DISCOVERED FUEL LEAKING FROM THE LOWER FUEL PUMP AND OIL LEAKING FROM THE OIL PAN GASKET OF THE MOTORCYCLE. THE MOTORCYCLE WAS TAKEN TO BMW MOTORCYCLES OF LAS VEGAS (617 5B WEST SAHARA AVE, LAS VEGAS, NV) WHERE THE EXHAUST MANIFOLD GASKET, OIL PAN GASKET, AND FUEL PUMP UNIT WERE REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 13,048.",
        "vin": "WB1061102DZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074453,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PISTONS ARE CRACKING AND MAY BREAK CAUSING ENGINE TO LOCK UP....BMW HAS IGNORED THIS PROBLEM AND CONTINUES TO PRODUCE THIS ENGINE AND HAS NO SPARE PARTS TO FIX IT....SOMETHING NEED TO BE DONE ABOUT THIS!!!",
        "vin": "WB1061100DZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577902,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "K 1600 GT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BIKE REQUIRES CONSTANT COUNTER STEERING PRESSURE ON THE HANDLEBARS TO KEEP IT FROM VEERING SHARPLY LEFT INTO INCOMING TRAFFIC. IT HAS BEEN IN FOR SERVICE NUMEROUS TIMES. THE DEALER'S SERVICE DEPARTMENT VERIFIES THAT THE BIKE DOES IN FACT PULL TO THE LEFT, HOWEVER BMW'S FIELD REPRESENTATIVE STATES THAT THE BIKE IS OPERATING \"AS DESIGNED.\"  *TR",
        "vin": "WB1061103DZ"
    }
]