[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436949,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The car runs fine right up until it doesn't. You can be driving down the highway and all of a sudden lights start flashing on and off and it dies completely and slams on the breaks all at once! It's dangerous especially in the dark! You have no flashers or breaklights to warn other cars you are even there! Sometimes it won't even start setting in the driveway. You just have to wait a little bit and then the car will start up like nothing ever happened. I've seen recalls on other Buicks for the same thing but mine isn't on the recall list. This car is gonna get someone killed!  We are afraid to sell it because we don't want someone else to get hurt!  We have taken it to two different mechanics and they couldn't find anything wrong with it except the first mechanic cleared out 23 control module codes.",
        "vin": "2g4gs5ev3d9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ATTACHED A DOCUMENT TO THIS INCIDENT REPORT EXPLAINING THE ISSUES WE ARE FACING WITH OUR BUICK REGAL!!  THE 2013 BUICK REGAL ALL MODELS NEED TO BE IMMEDIATELY RECALLED BECORE MORE PEOPLE BECOME SERIOUSLY INJURED BY THE CARELESSNESS OF GENERAL MOTORS",
        "vin": "2G4GS5EV4D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION IN DRIVER SIDE HEADLIGHT NOW HEADLIGHT WILL NOT WORK  BOUGHT A NEW 112.00 BULD AND STILL DOESNT WORK. LOOKED ISSUE UP ON INTERNET AND FOUND HUNDREDS OF COMPLAINTS",
        "vin": "2G4GT5GVXD9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420808,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Buick Regal. The contact stated that on several occasions the vehicle would not immediately start. Additionally, while driving the check engine warning light remained illuminated. Also, while driving at various speeds, the vehicle would not properly accelerate while depressing the accelerator pedal. The vehicle was taken to an independent mechanic and was diagnosed with a sensor failure. No further information was available. The battery was replaced however, the failure persisted. The manufacturer was notified of the failure and informed the contact that the Vin was not included in NHTSA campaign number: 13V173000 (Electrical System). The contact indicated that the vehicle had experienced the same failure listed in the recall. The local dealer was not contacted. The failure mileage was 80,000.",
        "vin": "2G4GS5EVXD9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER USING THE BRAKE PEDAL, IT DOES NOT COME ALL THE WAY IN THE UP POSITION WHEN THE INTERIOR OF THE CAR IS HOT.  I HAVE TO LIFT THE BRAKE PEDAL WITH MY OTHER FOOT, OR BRAKE WILL BE PARTIALLY ENGAGED AND BRAKE LIGHTS WILL BE ON.  BRAKE PEDAL WORKS FINE WHEN THE INTERIOR OF THE CAR IS A NORMAL TEMPERATURE.",
        "vin": "2G4GS5EV1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER'S SIDE HEADLIGHT IS OUT, CONDENSATION INSIDE THE HEADLIGHT AS WELL. BOUGHT $106.00 HALOGEN REPLACEMENT BULB AND LIGHT STILL ISN'T WORKING. AFTER LOOKING FOR OTHERS WITH THE SAME ISSUE I SEE THIS THERE IS COMPLAINTS AND RECALL FOR \"SOME\" MODELS OF THE 2013 BUICK REGAL (TURBO PREMIUM 3) SPECIFICALLY BY CHECKING MY VIN FOR THE RECALL. OBVIOUSLY HAVING THE EXACT SAME ISSUE OTHER REGAL MODELS OF SAME YEAR WERE RECALLED FOR.",
        "vin": "2G4GU5GV3D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402657,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ADDENDUM TO REPORT 11400295 - HERE'S A PICTURE OF THE AMOUNT OF WATER ACCUMULATED IN THE HEADLIGHT LENSE IN LESS THAN A WEEK. I'M REPLACING THE BULB AND BALLAST FOR THE THIRD TIM IN LESS THAN 8 MONTHS - HELP",
        "vin": "2G4GT5GV4D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADLIGHT ASSEMBLY AMASSES OUNCES OF WATER / CONDENSATION CAUSING BULB AND BALLAST FAILURES - I'VE REMOVED THE ASSEMBLY TWICE TO REPLACE THE BALLAST AND BULBS COSTING $100.00 PER ATTEMPT ONLY TO HAVE TO REPLACE THEM AGAIN WITHIN A WEEK. PASSENGER SIDE IS DRY AND CRYSTAL CLEAR - ABSOLUTELY A DEFECTIVE PART AND IT COSTS OVER A $1,400.00 A SIDE. DRIVING WITH A SINGLE HEADLIGHT IS ILLEGAL AND DANGEROUS. GM IS WELL AWARE OF THE PROBLEM AND REFUSES TO ADDRESS IT.",
        "vin": "2G4GT5GV4D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 BUICK REGAL VIN:[XXX] IS HAVING ONE OF THE 3 RECALL ISSUES THAT YOU HAVE LISTED. ISSUE #13V173, MY CAR WILL NOT START AND THE BATTERY IS LOSING POWER. I REPLACE THE BATTERY AND WAS INFORMED THAT THE BATTERY IS GOOD AS WELL AS THE ALTERNATOR BUT WHEN I TOOK MY CAR TO BUICK, I WAS TOLD IT WAS THE GENERAL CONTROL MODULE. UNFORTUNATELY, THE NHTSA DOES NOT HAVE MY VIN LISTED AS ONE OF THE AFFECTED 2013 REGAL MODELS BUT IN MY OPINION, IT SHOULD BE LISTED. I AM ATTACHING A SCREENSHOT OF THE PART AND REPAIR LISTED FOR MY VEHICLE. THE PART IS $929 TO REPLACE.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2G4GR5ER6D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE ENGINE OIL CONSUMPTION",
        "vin": "2G4GS5ER7D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVERS SIDE HID HEADLIGHT ASSEMBLY DEVELOPED CONDENSATION INSIDE THE ASSEMBLY CAUSING A HEADLIGHT FAILURE. THOUGH THE CAR IS A 2013, IT HAD ONLY 64000 MILES ON IT WHEN THE CONDITION OCCURRED. THIS IS OBVIOUSLY A MANUFACTURING DEFECT SINCE THERE HAS  BEEN NO IMPACT TO THE HEADLIGHT ASSEMBLY AND NO VISIBLE BREAK IN THE SEAL.",
        "vin": "2G4GV5GV2D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COLLECTED CONDENSATION INSIDE THE DRIVER HEADLIGHT ASSEMBLY CAUSING A SHORTAGE/BURN OUT OF THE PROJECTOR FOR THE HID SYSTEM.  $1244 WAS THE COST OF REPLACEMENT LIGHT ASSEMBLY, WHICH DIDN'T LAST LONG BEFORE THE PROJECTOR BURNT OUT AGAIN. THIS MANUFACTURER DEFECT NEEDS TO BE RECALLED, ESPECIALLY WITH THE REPLACEMENT COST BETWEEN $1000-$1600!   THIS VEHICLE WILL NOT ILLUMINATE A CHECK ENGINE LIGHT FOR SAFETY WARNINGS, NOR WILL IT STORE CODES THAT HAVE ALREADY BEEN PRESENTLY PRINTED OUT AT OCCURRING TIMES.",
        "vin": "2G4GV5GV9D9"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "12/18/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE VEHICLE LOSS ACCELERATION, STEERING WHEEL BECAME DIFFICULT TO TURN. IN ANOTHER WHEN TURN OFF THE ENGINE, THE VEHICLE FAILED TO START. A WARNING LIGHT ILLUMINATED ROLL DRIVER SIDE WINDOW UP, THE TRUNK OPEN AND THE WINDSHIELD WIPER INDEPENDENTLY START TO FUNCTION. THE VEHICLE WAS TOWED TO ED MARTIN BUICK GMC, 9896 N MICHIGAN RD, CARMEL, IN 46032, AND WAS DIAGNOSED THAT THE TIMING CHAIN DETACHED. THE VEHICLE WAS NOT REPAIR DUE TO THE REPAIR FEES. FIVE CODE ALSO CAME UP, P0131, P0016, P0017, P0014 AND P0171. AND LEAVING THE DEALER, THE VEHICLE FAILED TO START AND WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE TIMING CHAIN, BALANCE CHAFF, CHAIN KIT, TIMING COVER GASKET SET, CAM COVER GASKET SET AND TWO CAMSHAFT SENSORS, WERE REPLACED. THE WHILE LEAVING THE INDEPENDENT MECHANIC, THE VEHICLE LOSS ACCELERATION, HEAT BLOWING AT THE FLOW BOARD AN UNKNOWN ODOR ENTERED THE VEHICLE CABIN COMING FROM THE ENGINE. THE VEHICLE WAS TAKEN BACK TO THE INDEPENDENT MECHANIC AND WAS INFORMED TO TAKE THE VEHICLE TO A BUICK DEALER. WHILE ON THE WAY TO THE DEALER, THE PARK TO DRIVE GEAR WAS CLUNKING AND JERKING FROM 3RD TO 2ND AND 4TH TO 3RD. THE VEHICLE WAS TAKEN SEVEN TIMES TO THE SAME DEALER. THE CONTACT MENTIONED THAT SHE TAKEN THE VEHICLE TO A TRANSMISSION SHOP BUT WAS UNABLE TO DETERMINE A FAILURE. ON ANOTHER OCCASION, THE VEHICLE LOSS ACCELERATION AND JERKING IN GEARS, HEAT ENTERING THE VEHICLE CABIN AND SQUEALING. NO CHECK ENGINE LIGHT ILLUMINATED AND THE BATTERY COVER WAS MELTED ON ONE SIDE. NO INDICATION ON THE OVERHEAT THAT LEVEL THE TEMPERATURE GAGE. THE FAILURE MILEAGE WAS APPROXIMATELY 81,290.",
        "vin": "2G4GV5GV9D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING A PROBLEM WHERE MY CAR WON'T START AT TIME I HAVE PURCHASED A NEW BATTERY AND HAD THE ALTERNATOR CHECK ALL GOOD SOMETIMES I SMELL SOMETHING BURNING AND I NOTICE THERE'S A RECALL ON 2013 BUICK REGAL GS",
        "vin": "2G4GS5ER1D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "05/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338991,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT HIS HEADLAMP HOUSINGS CONSTANTLY FILLED UP WITH CONDENSATION CAUSING THE BULBS TO FAIL PREMATURELY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE BALLASTS AND BULBS WERE REPLACED AND THE HEADLAMP HOUSINGS RESEALED. MCGUIRE BUICK GMC (1625 US-46, LITTLE FALLS, NJ 07424 (973)200-6699) WAS CONTACTED AND THE CONTACT WAS INFORMED THAT THE WARRANTY WAS EXPIRED. THE CONTACT WAS PROVIDED AN ESTIMATE OF $3,000 TO REPLACE THE HEADLAMPS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "2G4GU5GV3D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329679,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD FOR THE LAST FEW YEARS HAD ISSUES WITH MY 2013 BUICK REGAL TURNING OFF WHILE DRIVING CAUSING A FEW ACCIDENTS THAT HAS NEARLY CAUSE ME MY LIFE. THE CAR HAS HAD MULTIPLE ELECTRICAL ISSUES I'VE TRIED GETTING FIXED AND I'VE DEALT WITH DAMAGE TO MY VEHICLE DUE TO THIS. CAR HAS TURNED OFF ON ME WHILE IN MOTION. I'VE REPLACED THE BATTERY AND I'VE SPENT SEVERAL 1,000S OF DOLLARS TRYING TO GET IT REPLACED.  *TR",
        "vin": "2G4GS5ER6D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE HEADLIGHT HAS AN ISSUE WITH THE SEAL (NO VISIBLE CRACKS OR DAMAGE TO THE LIGHT) WHICH ALLOWS WATER/CONDENSATION TO ACCUMULATE IN THE HEADLIGHT. THIS ENDS UP BLOWING THE BULBS AND FUSE. EVEN AFTER REPLACING THE BULB AND THE FUSE, THE LIGHT STILL WILL NOT WORK. AFTER REPLACING THE FUSE, THE DAYTIME RUNNING LIGHTS NO LONGER WORK AND THERE IS APPARENTLY AN ELECTRICAL ISSUE WITH THE WIRING HARNESS THAT CAUSES A SHORT IN THE LIGHTING (SEE ATTACHED VIDEO). I WAS DRIVING AT NIGHT WHEN MY DRIVER'S SIDE HEADLIGHT COMPLETELY STOPPED WORKING. THERE IS NO INDICATION TO ALERT THE DRIVER WHEN THIS HAPPENS. I ONLY KNEW BECAUSE IT HAPPENED AT NIGHT AND DRASTICALLY DECREASED MY VISIBILITY (RURAL AREA WITH NO STREET LIGHTS). THIS IS OBVIOUSLY A HUGE SAFETY ISSUE. I'VE CONTACTED BUICK AND WAS TOLD THAT THERE IS NO RECALL AND THAT IT'S NOT COVERED DUE TO MY VEHICLE BEING OUTSIDE OF THE WARRANTY. THE ENTIRE HEADLIGHT ASSEMBLY NEEDS TO BE REPLACED AND IS APPROXIMATELY $1,500 TO REPLACE (NOT TO MENTION THE $100 BULB THAT I HAD JUST REPLACED THAT BLEW OUT). AFTER RESEARCHING THIS MATTER, IT APPEARS THAT THERE ARE MULTIPLE COMPLAINTS FOR THE 2013 YEAR MODEL WITH HID LIGHTS. THIS SEEMS TO BE A COMMON PROBLEM AND THERE SHOULD BE A RECALL FOR THIS. THIS VEHICLE FAILS TO COMPLY WITH THE REQUIREMENTS OF FEDERAL MOTOR VEHICLE SAFETY STANDARD NO. 108, \"LAMPS, REFLECTIVE DEVICES, AND ASSOCIATED EQUIPMENT.\" SOMETHING NEEDS TO BE DONE ABOUT THIS!!! THE MANUFACTURER WILL NOT CORRECT THIS ISSUE IF YOU ARE OUTSIDE OF THE WARRANTY UNLESS THEY ARE FORCED TO BY A RECALL.  *TR",
        "vin": "2G4GV5GV9D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "05/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2013 BUICK REGAL GS THE MASS AIR FLOW SENSOR HAS CONTINUED TO SHUT DOWN 3 TIMES AND HAS BEEN REPLACED 3 TIMES, THE CAR CONTINUES TO SHUT DOWN WITH NO GM CODES. PLEASE CONTACT ME ASAP OR I'LL HAVE NO CHOICE BUT TO CONTACT MY  COUNSEL  TO FILE A LEGAL COMPLAINT AGAINST GM FOR DANGEROUS CAR.  *TR",
        "vin": "2G4GV5GV0D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL ISSUES, MASS AIRFLOW SENSOR REPLACED 3 TIMES HAS CONTINUED TO GO OUT, VEHICLE SHUTS DOWN WITH NO CODES AVAILABLE, VERY HAZARDOUS, VEHICLE WILL NOT START UNLESS YOU DISCONNECT THE NEGATIVE BATTERY TERMINAL AND RESET THE COMPUTER, AFTER THAT THE VEHICLE WILL RUN FOR A SHORT PERIOD OF TIME ADD WILL SHUT DOWN AGAIN.  *TR",
        "vin": "2G4GV5GV0D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317581,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HID LIGHTING BURNED THROUGH THE PLASTIC CASE ALLOWING THE STRATEGICALLY PLACED BALLAST ON THE BOTTOM TO FILL WITH WATER AND THE LIGHT BULB FAILED TO IGNITE. A MAJOR SAFETY ISSUE WHILE DRIVING",
        "vin": "2G4GT5GV4D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT THE DRIVER SIDE HEAD LIGHT FAILED TO OPERATE WITHOUT WARNING. THE CONTACT NOTICE THAT MOISTURE HAD ACCUMULATED INSIDE OF THE DRIVER'S SIDE HEADLAMP ASSEMBLY. THE CONTACT ALSO NOTICED THAT THE HEADLAMP CIRCUIT BOARD WAS CORRODED DUE TO THE CONDENSATION. THE MANUFACTURER WAS CONTACTED AND A CLAIM NUMBER WAS PROVIDED. THE VEHICLE WAS TAKEN TO PENSKE BUICK GMC OF CERRITOS LOCATED AT (18400 STUDEBAKER RD, CERRITOS, CA 90703). THE CONTACT WAS THEN NOTIFIED BY THE DEALER THAT THE REPAIR WAS NOT FREE AND WOULD HAVE TO BE PAID FOR OUT OF POCKET. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "2G4GT5GV2D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S HEADLIGHT QUIT WORKING. TOOK IT TO DEALER, THEY SAID IT WAS THE HEADLIGHT. WASN  'T THE HEADLIGHT. SAID IT WAS THE BALLAST. WORKED FOR 2 MINUTES. THEY SAID THAT TICKET WAS CLOSED AND CHARGED ME $650. THEY SAID NEXT STEP WAS A HEADLIGHT ASSEMBLY. HAVE BEEN TRYING TO ORDER ONE AND IT IS NO LONGER AVAILABLE. $1600 FROM DEALER. LIGHT HAD ACCUMULATED CONSIDERABLE MOISTURE PRIOR TO THE HID ASSEMBLY FAILING. WHEN THE BALLAST WAS REPLACED THE LIGHT FAILED AGAIN BEFORE I ARRIVED HOME 3 MILES AWAY.",
        "vin": "2G4GT5GV0D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT SHE TRIED TO START THE VEHICLE AFTER LEAVING WORK AND THE VEHICLE WOULD NOT START AFTER THE LOCKING SYSTEM MALFUNCTIONED. IT TOOK THE CONTACT OVER 10 MINUTES TO FINALLY BE ABLE TO START THE VEHICLE. THE EALER SHEEHAN BUICK (2800 N FEDERAL HWY LIGHTHOUSE POINT FL 33064-6849 (866) 586-9080) TRIED TO SET AN APPOINTMENT AND WANTED TO CHARGE A DIAGNOSTIC FEE OF $180. THE MANUFACTURER STATED THAT THERE WERE NO RECALLS. THE FAILURE MILEAGE WAS 54,200.",
        "vin": "2G4GR5ERXD9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION, WATER ACCUMULATION IN DRIVER-SIDE HEADLIGHT ASSEMBLY. NO DAMAGE OR CRACKS IN HEADLIGHT. DIAGNOSTIC AT GM DEALERSHIP STATED THAT WATER ACCUMULATION IS DUE TO BAD SEAL; ENTIRE HEADLIGHT ASSEMBLY MUST BE REPLACED. CONSUMER CONTACTED GENERAL MOTORS TO REQUEST ASSISTANCE THROUGH A CUSTOMER SATISFACTION PROGRAM. GM STATED  AND THAT SEAL/CONDENSATION IS NOT THEIR CONCERN UNTIL THERE IS A SAFETY ISSUE AND NOTED THAT THE BUMPER TO BUMPER WARRANTY EXPIRED.",
        "vin": "2G4GS5EV1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO THIS EVENT THE RADIO AND INTERIOR AND EXTERIOR LIGHT WOULD FLICKER AND THE RADIO WOULD TURN OFF COMPLETELY. THE BATTERY WAS THE ORIGINAL BATTERY SO WE REPLACED IT. BUT IT WASN'T COMPLETELY SHOT AT THAT POINT. DURING THE SAME TIME OF THIS HAPPENING THE BATTERY IN THE KEY FOB WENT BAD ALSO. SO I THOUGHT THAT MAY HAVE HAD SOMETHING TO DO WITH IT. HAD TO DISCONNECT THE BATTERY COMPLETELY TO RESET THE COMPUTER BECAUSE THERE WAS ANY POWER TO THE CAR AT ALL. WAITED A FEW MINUTES HOOKED IT BACK UP AND IT ALLOWED US TO JUMP THE CAR OFF.. THE RADIO AND LIGHTS HAVE ON A FEW OCCASIONS DID THE SAME AS BEFORE BUT NEVER THE ISSUE OF STARTING. SO NOW IT DID THE SAME THING AS BEFORE SO ONCE IT WAS JUMPED AGAIN I TOOK IT TO MY LOCAL AUTOZONE AND HAD THE BATTERY AND ALTERNATOR CHECKED AND GOT AN ALL GOOD REPORT. IN ADDITION THIS TIME THE ABS AND THE STAILITRAK AND TRACTION CONTROL LIGHT CANE ON AND WOULD GO OUT UNTIL THE COMPUTER WAS RESET BY DISCONNECTING THE BATTERY. I'VE READ A COUPLE OF FORUMS AND THE SEEMS TO BE MORE OF THE SAME ISSUE WITH OTHER OWNERS. SOME EVEN STATED THEIR VEHICLE EVEN SHUTOFF IN MOTION. AS I SIT FILLING THIS FORM OUT THE RADIO AND THE LIGHT IN THE GLOVE BOX CONTINUE TO COME ON AND OFF.",
        "vin": "2G4GS5EV7D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT WIRING SYSTEM DOES NOT CONTINUE TO FUNCTION,  FOR SOME REASON IT DOES NOT GIVE POWER TO THE HID HEADLIGHTS.",
        "vin": "2G4GV5GV0D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION, WATER ACCUMULATION IN HEADLIGHT ASSEMBLY. NO DAMAGE OR CRACKS IN HEADLIGHT. BULB WENT OUT. PURCHASED NEW BULB  TO REPLACE AND REPLACEMENT DID NOT WORK.",
        "vin": "2G4GV5GV2D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268381,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MOISTURE IN DRIVERS SIDE HID HEADLIGHT CAUSED DAMAGE TO BALLAST BLOWING HEADLIGHT .  REPLACED BALLAST AND BULB,BUT DAYTIME RUNNING LIGHT DOES NOT ILLUMINATE. HEADLIGHT SHORTED OUT WHEN CAR WAS STARTED IN MORNING.",
        "vin": "2G4GT5GV9D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADLIGHT BEGAN DEVELOPING MOISTURE INSIDE AND THE HEADLAMP ULTIMATELY FAILED.",
        "vin": "2G4GT5GV4D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. UPON STARTING THE VEHICLE, THE PASSENGER SIDE HEADLIGHT BEGAN BLINKING AND WENT COMPLETELY OUT. UPON INSPECTING THE VEHICLE, THE CONTACT FOUND MOISTURE BUILD UP IN THE HEADLIGHT, WHICH HE BELIEVED CAUSED THE FAILURE. AFTER SOME TIME, THE DRIVER'S SIDE HEADLIGHT ALSO FAILED TO OPERATE. THE CONTACT DROVE TO AUTOCENTERS NISSAN (1825 E EDWARDSVILLE RD, WOOD RIVER, IL 62095, 618-251-3000) WHERE HE PURCHASED THE VEHICLE FROM AND WAS INFORMED THAT DESPITE HAVING AN EXTENDED WARRANTY, HEADLIGHTS WERE NOT COVERED UNDER THE WARRANTY. THE CONTACT THEN DROVE THE VEHICLE TO AN UNKNOWN BUICK DEALER (THAT HAS SINCE CLOSED) AND WAS ALSO INFORMED THAT THE HEADLIGHTS WERE NOT UNDER WARRANTY AND WAS GIVEN A COST ESTIMATE FOR THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 82,000.",
        "vin": "2G4GV5GV7D9"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LESS THAN 90K MILES MY POWER STEERING ABRUPTLY WITHOUT WARNING STOPPED WORKING WHILE I WAS DRIVING THE CAR. MY AUTOMATIC TRANSMISSION WILL ABRUPTLY WITHOUT WARNING STAY STUCK IN A LOW GEAR WHILE I AM DRIVING.  I TURN OFF THE CAR AND START IT AGAIN AND IT'S FINE.  MY COMPUTER SCREEN WILL GO BLACK AND STAY THAT WAY, WHICH CONTROLS THE RADIO, NAVIGATION, ETC., THEN IT WILL BEGIN WORKING AGAIN AFTER A FEW MINUTES, HOURS, DAYS, JUST WHENEVER IT DECIDES TO START WORKING.  THE SCREEN HAS ALSO HAD RAPID MOVING LINES OF BLACK AND WHITE.  MY LEFT TURN SIGNAL WORKS, BUT YET IT CONSTANTLY HAS A RAPID TURN SIGNAL SOUND LIKE IT IS GOING OUT OR IS OUT, YET EVEN WHEN I CHANGE THE BULB IT STILL MAKES THE SOUND.  THE POWER STEERING I JUST FIXED A MONTH AGO, ALL OTHER ISSUES ARE ON GOING.",
        "vin": "2G4GV5GV8D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL DOES NOT RAISE AFTER APPLY, BRAKES REMAIN APPLIED OR BRAKE LIGHTS ON. DISCOVERED WHILE DRIVING. VEHICLE FELT SLUGGISH. I AM ABLE TO PULL THE BRAKE PEDAL UP BY HAND WHEN VEHICLE IS PARKED.",
        "vin": "2G4GS5EV4D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242245,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADLAMP HAS CONDENSATION IN IT CAUSING IT TO QUIT WORKING. THE CAR WAS TAKEN TO THE GARAGE AND WAS TOLD THAT THIS IS A VERY COMMON PROBLEM WITH THE BUICK REGAL. I WAS GIVEN A REPAIR COST OF OVER $1600. I WAS ALSO TOLD THAT THIS WILL PROBABLY OCCUR AGAIN. THERE WAS NO INDICATION THAT MY HEADLIGHT WAS NOT WORKING UNTIL I WAS DRIVING DOWN THE ROAD AT NIGHT AND ANOTHER VEHICLE FLASHED THEIR HIGH BEAMS AT ME.",
        "vin": "2G4GU5GV6D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVERS HEADLIGHT FILLS WITH WATER. CAUSES LIGHT BULB TO EXPLODE. CONDENSATION IS I. THE HEADLIGHT. THE AMOUNT OF WATER THAT CAME OUT OF THE HEADLIGHT WAS ABOUT 10 OUNCES. NO VISIBLE CRACKS OR DAMAGE TO HEADLIGHT.",
        "vin": "2G4GS5EV9D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE IT STOPS OUT OF NOWHERE AND CUTS BACK ON. THERE IS A BURNING/MELTING SMELL COMING FROM THE BACK OF THE VEHICLE. ONCE THE CAR IS OFF SOMETIMES THE BATTERY IS DRAINED. THE DRIVER SIDE HEAD LIGHT KEEPS GETTING MOISTURE INSIDE AND CAUSES THE BULB TO GO OUT.",
        "vin": "2G4GR5ER2D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217371,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE FRONT HEAD LAMP ENCLOSURES LEFT & RIGHT ONES CRACKING LETTING MOISTURE IN CAUSING LOW BEAM HALOGEN HEAD LAMP BULBS TO EXPLODE DUE TO CONTACT WITH MOISTURE.   DEFECTIVE DESIGN ON HEAD LAMP ENCLOSURE ASSEMBLY'S",
        "vin": "2G4GS5EV5D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "08/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE HEADLAMP FILLS WITH WATER CAUSING BULB TO BURN OUT.",
        "vin": "2G4GV5GV5D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE HEADLAMP FILLS UP WITH WATER CAUSING BULB TO BURN OUT.",
        "vin": "2G4GV5GV5D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195612,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.....THE ECM IS STILL NOT FUNCTIONING PROPERLY AFTER THE RECALL IT NEEDS TO BE RECALLED AGAIN. IT IS VERY DANGEROUS CAR WILL CUT OFF IN THE MIDDLE OF TRAFFIC.SOMETHING NEEDS TO BE DONE!!!!!",
        "vin": "2G4GS5ER8D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEAD LIGHTS CONTINUOUSLY FILL UP WITH MOISTURE AND CAUSE THE HEAD LIGHTS TO NOT FUNCTION WHICH BECOMES VERY DANGEROUS AT NIGHT WHEN I DO NOT EXPECT IT TO HAPPEN. THIS SEEMS TO BE A COMMON PROBLEM WITH THESE VEHICLE AS MANY PEOPLE COMPLAIN ON AUTO FORUMS ABOUT IT. THE LIGHTS DON'T WORK WHILE VEHICLE IS STATIONARY OR MOVING.",
        "vin": "2G4GT5GV0D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT THE HEADLIGHT ASSEMBLIES KEPT FILLING UP WITH WATER, WHICH CAUSED THE BULBS TO SHORT OUT. STOOPS BUICK GMC (1251 QUAKER BLVD, PLAINFIELD, IN 46168, (317) 839-7771) REPLACED THE HEADLIGHT ASSEMBLIES THREE TIMES. THE MOST RECENT REPLACEMENT WAS LAST WEEK. THE DEALER HAD NOT REVEALED HOW THE WATER WAS ENTERING INTO THE HEADLIGHT ASSEMBLIES. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "2G4GS5EV9D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": ",A MONTH AGO MY DRIVER HEADLIGHT WENT OUT TRIED REPLACING BULBS TWICE STILL NO LIGHT TRIED A RELAY SWITCH STILL NOT LIGHT, LIGHT WENT OUT WHILE DRIVING TO WORK.",
        "vin": "2G4GV5GV5D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAVE AN ELECTRICAL PROBLEM IS GAS/ELECTRICAL , AND DON'T CHARGE, REPLACE BATTERY AND PROBLEM CONTINUE; CALL TO BUICK CONCESSIONARY FOR RECALL BECAUSE FIND THAT THESE MODEL AND YEAR MAKE A VEHICLES HAVE ELECTRICAL PROBLEMS, BUT THE PERSON TELL ME IF DON T HAVE RECALLS FOR MY SPECIFIC CAR VIN NUMBER; I DON'T KNOW WHAT HAPPENED BUT MY CAR HAVE VERY ELECTRICAL PROBLEM, REPLACE TWO BATTERIES AND CONTINUE WITH THE PROBLEM, AND ALTERNATOR NOBODY FIXED BECAUSE IS VERY RARE, AND THE PRICE FOR REPLACE ALTERNATOR IS VERY HIGH EXPENSIVE, MY CAR HAVE THESE PROBLEM AND THE BUICK AGENCYS OR CONCESIONARIES ARE THE RESPOSIBLES FOR DEFECTUOS OR MISTAKES ON YOURS VEHICLES MANUFACTURED.",
        "vin": "2G4GS5ER1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT ON DRIVER SIDE CONTINUE TO BLOW LIGHT OR BULB",
        "vin": "2G4GV5GV5D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MOISTURE BUILT UP IN THE DRIVERS SIDE HEADLIGHT CAUSE THE WHOLE HEADLIGHT ASSEMBLY TO FAIL. I PAID TO HAVE IT REPLACED LAST YEAR AND NOW THE PASSENGERS SIDE HAS DONE THE EXACT SAME THING. IT IS A CONDENSATION PROBLEM CAUSING THE UNITS TO FAIL AND SHOULD BE CONSIDERED A SAFETY ISSUE! WHEN YOUR HEADLIGHT GOES OUT WITHOUT WARNING ON A STORMY NIGHT IT IS DANGEROUS NOT ONLY FOR YOU BUT ANYONE IN THE AREA AROUND YOU SINCE YOU HAVE SUCH LOW VISIBILITY. I STILL HAVE THE OLD HEADLIGHT ASSEMBLY IF ANY ONE WOULD LIKE TO REVIEW IT OR CHECK FOR DAMAGE.",
        "vin": "2G4GU5GV6D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY GOT PULLED OVER BY THE LOCAL POLICE DEPARTMENT THAT NOTICED THAT MY DRIVER SIDE HEADLIGHT WAS OUT AS I WAS PULLING OUT OF MY DRIVE WAY FIRST THING IN THE MORNING .AFTER CHANGING THE HEADLIGHT BULB ($100.00)THE HEADLIGHT DID NOT TURN ON.UNDER RECOMMENDATION OF  THE PART CLERK OF MY LOCAL PARTS STORE WE LOOKED AT THE HEADLIGHT BALLAST ($300.00).THIS VEHICLE HEADLIGHT DESIGN SOMEHOW ACCUMULATES CONDENSATION WITHIN THE HEADLIGHT HOUSING. THE CONDENSATION SOME HOW GAINS ACCESS AND ACCUMULATES INTO THE BALLAST OF THE HIGH INTENSITY DISCHARGE  LIGHTS  WHICH  ARE  MOUNTED UNDERNEATH THE HEADLAMP ASSEMBLY. LEAVING THE VEHICLE WITH NO HEADLIGHTS TO OPERATE THE VEHICLE SAFELY AT NIGHT OR UNDER LOW VISIBILITY CONDITIONS.AFTER REPLACING THE LIGHT BULB AND  BALLAST THE HEAD LIGHTS STILL WOULD NOT TURN ON. SOMEHOW THE ENTIRE HEADLIGHT ASSEMBLY NEEDS TO BE REPLACED AT AN OUTRAGEOUS COST OF OVER ($1,500) PER HEADLIGHT ASSEMBLY. DUE  OF THE CONDENSATION AND WATER DAMAGE THE  INTERNAL  ELECTRONICS OF THE HEADLIGHT  ARE NOT FUNCTIONAL LEAVING THE OPERATOR AND PASSENGERS OF THE 2013 BUICK REGAL GS EQUIPT WITH FACTORY HIGH INTENSITY LIGHTING IN THE DARK.",
        "vin": "2G4GV5GV7D9"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128252,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO A PARKING SPACE AND STOPPED. I TOOK MY FOOT OFF THE BREAK AND THE CAR LURCHED FORWARD, RUNNING INTO A WOODEN RAIL FENCE. THE FENCE WHICH WAS OLD, WAS KNOCKED DOWN.  IT ALL HAPPENED SO QUICKLY, I WASN'T SURE IF I HAD HIT THE ACCELERATOR.  TWO DAYS LATER I MADE A NORMAL STOP IN TRAFFIC. AFTER BREAKING, THE CAR LURCHED FORWARD.  I PUSHED ON THE BREAK PEDAL TO STOP THE CAR, BEFORE IT COULD HIT THE CAR IN FRONT OF ME.  THIS TIME I WAS SURE MY FOOT HAD NOT HIT THE GAS PEDAL.  I AM NOW GIVING THE CAR EXTRA BREAKING DISTANCE. IN EITHER CASE, I DIDN'T NOTICE IF THE TACHOMETER INCREASED RPM OR NOT, THOUGH WITH THE SUDDEN ACCELERATION RPM MUST HAVE INCREASED.",
        "vin": "2G4GV5GV8D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHT WENT OUT ON THE DRIVER INFORMATION CENTER.  CAN'T SEE THE MILEAGE, GAS, SPEED LIMIT, OR TIRE WEIGHT.  WITH NO WARNING, THE LIGHT WENT OUT.  TOOK THE VEHICLE TO BUICK AND THEY CAN REPAIR BUT WILL HAVE TO OPEN THE ENTIRE CLUSTER TO FIX THE PROBLEM (EST. $800 TO FIX).",
        "vin": "2G4GS5EV3D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS CHILD WHO OWNS A 2013 BUICK REGAL. WHILE DRIVING, THE CONTACT'S DAUGHTER NOTICED DEBRIS ON THE ROADWAY. SHE STOPPED THE VEHICLE AND THE E-ASSIST FUNCTION ACTIVATED. AFTER THE DEBRIS WAS REMOVED FROM THE ROAD, THE ACCELERATOR PEDAL WAS DEPRESSED, BUT THE VEHICLE FAILED TO RESPOND. THE VEHICLE WAS TAKEN TO VYLETEL VOLKSWAGEN BUICK GMC (40555 VAN DYKE AVE, STERLING HEIGHTS, MI 48313, (586) 977-2800) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 165,000.",
        "vin": "2G4GS5ER8D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GM DEALERSHIP MISDIAGNOSED THE TRANSMISSION AS NEEDING REPLACEMENT, AND QUOTE A $4500 REPAIR PRICE.  AFTER GETTING 3 ALTERNATIVE EXPERT OPINIONS, THE PROBLEM WAS THE THROTTLE BODY; REPAIRED FOR $420.  NOW THE FORMERLY RECALLED GENERATOR ALTERNATOR HAS FAILED. CAR WILL NOT RESTART WHEN STOPPED, WHILE DRIVING. GM HAS TOLD ME THEY WILL NOT REPLACE THE FORMERLY RECALLED PART UNDER WARRANTY, OR BUT NOT IF FOR MISDIAGNOSING THE TRANSMISSION AND THE PART FAILING WHEN GARNERING 2ND OPINIONS.    GM ALSO TOLD ME THAT IT IS NOT THE DEALERSHIP'S JOB TO ALERT A CUSTOMER OF A RECALL.  IF THAT IS THEIR PROCESS FOR RECALLS, I AM AFRAID FOR THE LIVES OF OTHERS.  I AM ALSO AFRAID THAT THEY POSSIBLY DON'T EVEN UNDERSTAND HOW TO DIAGNOSE A VEHICLE PROBLEM IN THE FIRST PLACE.  THEY CONFIRMED THE PART NOW IN QUESTION WAS FUNCTIONING PROPERLY AT THEIR DEALERSHIP, BUT RECOMMENDED A NEW TRANSMISSION DUE TO HIGH MILES ON THE VEHICLE.  THIS IS A GENUINE GM DEALERSHIP.  I'D LIKE THE GM/ALTERNATOR, CONTROL MODULE, AND OTHER ASSOCIATE PARTS INVESTIGATED FOR VOLTAGE FAILURES RELATED TO THROTTLE BODY FAILURE.  IT IS MY UNDERSTANDING THAT IF GM IS REPLACING TRANSMISSIONS, WHEN NOT NEEDED, AND THE OTHER PARTS EVENTUALLY FULLY FAIL, CONSUMERS ARE AT EXTREME RISK.  MY 19 YEAR OLD DAUGHTER WAS STUCK AT A COMPLETE STOP, FOR NEARLY 30 SECONDS SEVERAL TIMES, ON A 70 MPH FREEWAY, WHEN TRAFFIC CAME TO A HALT, THEN RESTARTED; REACHING FULL SPEED AND HAVING TO VEER AND SLAM ON BRAKES TO AVOID HER CAR; IN THE CENTER LANE.  PLEASE INVESTIGATE.  [XXX].  I WILL ALSO BE FILING A COMPLAINT WITH THE SECRETARY OF STATE OF MICHIGAN FOR VEHICLE REPAIR SHOP REGULATION.  DEALERSHIPS WHO ARE READING CODES, AND NOT VERIFYING THE CODES, SHOULD BE SHUT DOWN FOR GOOD. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *PM  *TR",
        "vin": "2G4GS5ER8D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111053,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS DRIVEN TO A COMMITMENT (NO RAIN) WHICH STARTED BEFORE SUNDOWN AND ENDED AT NIGHT, RAINING. UPON LEAVING THE DRIVERS HEADLIGHT DID NOT ILLUMINATE, WHEN CHECKED IT LOOKED TO BE SHORTED OUT DUE TO WATER ENTERING THE LENS ASSEMBLY. CONSIDERING THE CAR WAS NOT DRIVEN HOW DID THIS HAPPEN? THE CAR HAD NO DAMAGES TO THE LIGHT ASSEMBLY AND NONE TO THE FRONT OF THE VEHICLE, BUT WATER/VAPOR ENTERED INTO THE HEADLIGHT CAUSING NO ILLUMINATION TO UPPER OR LOWER BEAMS. THIS CAUSED LIMITED VISION & HAZARDOUS DRIVING CONDITIONS ON MY DRIVE HOME AT NIGHT FROM THE COMMITMENT. I WAS TOLD BY BUICK THIS SHOULD NOT HAVE OCCURRED BUT THEY DID HAVE REPORTED CLAIMS ABOUT THIS ISSUE. THE COST OF THE TOTAL LENS REPLACEMENT BY BUICK FOR THE DRIVER'S SIDE LENS ASSEMBLY WAS $1,143.00 + LABOR. DO I EXPECT THE OTHER SIDE",
        "vin": "2G4GT5GV1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. WHILE DRIVING VARIOUS SPEEDS, THE BATTERY AND BATTERY CHARGING SYSTEM WARNING INDICATORS ILLUMINATED AND THE VEHICLE STALLED. THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME SYMPTOMS AS LISTED IN NHTSA CAMPAIGN NUMBER: 13V173000 (ELECTRICAL SYSTEM); HOWEVER, HIS VEHICLE WAS NOT A HYBRID. THE VEHICLE WAS TAKEN TO CHUCK NASH SAN MARCOS (3209 INTERSTATE 35 FRONTAGE RD, SAN MARCOS, TX 78666) WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE PART WAS UNDER WARRANTY, BUT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER OPENED CASE NUMBER: 8-4380703853. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "2G4GR5ER3D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAME IS [XXX] , I OWN A 2013 BUICK REGAL TURBO, ABOUT 4 MONTHS AGO I STARTED HAVING ELECTRICAL ISSUES WITH MY CAR ( STEREO SHUTS ON AND OFF WHILE DRIVING, DASH LIGHTS FLICKER ). THINKING MY CAR NEEDED A NEW BATTERY I HAD THE BATTERY REPLACED. NO PROBLEMS FOR ABOUT A MONTH. NOT LONG AFTER, THE PROBLEM CAME BACK, EXCEPT THIS TIME THE CAR SHUT OFF WHILE DRIVING, CAUSING ALL ELECTRONICS TO STOP WORKING, INCLUDING THE HEADLIGHTS, POWER STEERING, AND BRAKES. I DROVE IT TO A GM DEALER RIGHT AWAY. 1 WEEK GOES BY AND I GET A CALL BACK SAYING THEY COULDN'T RE-CREATE THE PROBLEM. I PICK THE CAR UP AND WITHIN ONE DAY IT STALLS AGAIN, THIS TIME DRIVING AT NIGHT ON THE HIGHWAY. AGAIN I BRING IT RIGHT TO THE GM DEALER. ANOTHER WEEK GOES BY AND I GET A CALL SAYING THEY REPLACED THE BCM ( BODY CONTROL MODULE ). AS I WAS DRIVING TO WORK THIS MORNING, ABOUT A MONTH AFTER THE REPAIR, THE STEREO SHUTS OFF, SOON AFTER THE DASH LIGHTS FLICKER, AND ALMOST RIGHT AFTER THE DASH LIGHTS STARTED FLICKERING THE CAR SHUT OFF, THE DOORS UNLOCKED, AND I LOSE THE POWER STEERING AND POWER BRAKE ASSIST CAUSING ME TO LOSE CONTROL OF THE VEHICLE AROUND A SHARP TURN AND NEARLY CRASH. I'M HONESTLY AFRAID TO DRIVE THIS CAR NOW, AND I'M NOT THE ONLY ONE WHO HAS HAD THIS HAPPEN TO THEM. I SPENT A GOOD 2 HOURS READING PEOPLES STORIES ONLINE ABOUT HOW THEY HAD THE SAME EXACT EXPERIENCE AND HOW THEY ARE ALSO AFRAID TO DRIVE THIS CAR. THE DEALERSHIP IS UNABLE TO FIX MY CAR AND NOW I'M STUCK WITH A CAR THAT IS WORTH LESS THAN WHAT I OWE ON IT, A CAR I HAVE TO WORRY ABOUT DRIVING, A CAR I'M AFRAID TO HAVE PASSENGERS IN DUE TO THIS MAJOR SAFETY ISSUE. IF AN ACCIDENT OCCURRED AS A RESULT OF THIS MALFUNCTION I WOULD IMAGINE THE MALFUNCTION WOULD PREVENT THE AIRBAGS FROM DEPLOYING. BEFORE I BOUGHT THIS 2013 BUICK REGAL I WAS DRIVING A 1992 FORD F-150, AND ITS SAD TO SAY I FELT A LOT SAFER IN AN ANTIQUE TRUCK.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2G4GS5EV2D9"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "01/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GENERATOR CONTROL MODULE POWERTRAIN CONTROL MODULE",
        "vin": "2G4GS5ER2D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSOLE WONT TURN ON IN THE HEAT. IT DISCONNECTS. PARKING LIGHT SAYS NOT IN PARK WHEN PARKED AND WONT TURN OFF. LIGHTS BURN OUT VERY FAST. HAS HAPPENED SINCE I BOUGHT THIS VEHICLE , NEW! IT IS VERY SLUGGISH WHEN TAKING OFF FROM STOP.",
        "vin": "2G4GS5EV3D9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. WHILE THE DRIVER ATTEMPTED TO PARALLEL PARK, THE VEHICLE ACCELERATED WITHOUT WARNING AND CRASHED INTO TWO PARKED VEHICLES. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS DAMAGED AND WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS LATER TAKEN TO THE DEALER (DALESSIO CHEVROLET BUICK IN BOONTON, NJ, 973-334-2000) WHERE THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT IT WAS AN UNKNOWN ISSUE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "2G4GS5EV5D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "12/01/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT THE DRIVER'S SIDE HEAD LIGHT FAILED WHILE DRIVING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WIRING HAD MELTED AND THE CONNECTOR WAS REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE PERSISTED AND THE SAME FAILURE OCCURRED WITH THE PASSENGER'S SIDE HEAD LIGHT. THE MANUFACTURE WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "W04GS5EC1B1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "10/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10926266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A RURAL ROAD (ABOUT 40-45 MPH) AND MISSED A STOP SIGN AT A T INTERSECTION, WENT STRAIGHT AHEAD AND  STRUCK A GUIDE WIRE, A LARGE BUSH, THEN A BLOCK WALL, AND CAME TO A STOP AFTER PASSING THROUGH THE WALL AND ENTERING THE BUILDING.  THE CAR NEVER VEERED BUT WENT STRAIGHT AS IT STRUCK THESE STRUCTURES. AIR BAG DID NOT DEPLOY AND I SUSTAINED A BROKEN RIB AND INJURY TO THE CHEST WALL.  EMERGENCY PERSONNEL COULD NOT EXPLAIN WHY THE AIRBAG DID NOT DEPLOY.  THE CAR WAS INSPECTED AND FOUND TO BE A TOTAL LOSS.",
        "vin": "2G4GR5ER5D9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2016",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A BUICK POWER ADD ON SYSTEM THAT IS 50 STATE CARB LEGAL CALLED THE STAGE ONE KIT OFFERED BY GM THE KIT CONSISTS OF AN AIR INTAKE AND A SOFTWARE CALIBRATION. AMONG ALL THE ISSUES I HAVE BEEN HAVING WITH THE CAR THEIR FINAL SOLUTION WAS TO INSTALL THE OEM CALIBRATION AND FUEL TABLES BUT LEAVE THE THE STAGE ONE KIT INSTALLED. I BELIEVE THIS MAKES MY CAR NON-50 STATE EMISSIONS COMPLIANT.    PART NUMBER FOR STAGE KIT IS   12653664. THE ISNTALLATION MANUAL SPECIFICALLY MENTIONS NOT DRIVING WITHOUT THE CALIBRATION UPDATE FROM THE DEALER. I HAVE NO WAY OF PUTTING IT BACK IN.",
        "vin": "2G4GV5GV7D9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2016",
        "dateOfIncident": "10/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CODES PRESENT IN COMPUTER ARE P1101 AIR INTAKE PERFORMANCE, P0101 MASS AIR FLOW CIRCUIT A FAILURE. THE CAR HAS REDUCED POWER AND SURGING DURING ACCELERATION. STUMBLING AT START UP. THE VEHICLE'S TURBO WASTEGATE FAILS TO CLOSE BEFORE 3,500 RPM THEREFORE CAUSING A SEVERE SPOOL TIME ON TURBOCHARGER     THE MANUFACTURE IS UNABLE TO REPAIR AS PER THE 4 MONTHS THE CAR HAS BEEN BEING DIAGNOSED AND FINALLY THE SERVICE MANAGER HAS ADMITTED THEY ARE UNABLE TO REPAIR THE VEHICLE. CORPORATE GM IN INVOLVED ALONG WITH FIELD TECHNICIANS.    SINCE THE VEHICLE HAS BEEN RETURNED TO ME STILL FAILING NOW HAS ACTIVE CODES FOR U0100 LOST COMMUNICATION WITH ECM, U0140 LOST COMMUNICATION WITH BODY CONTROL MODULE, U0128 LOST COMMUNICATION WITH PARKING BRAKE MODULE, U0073 COMMUNICATION BUS A OFF,  U0101 LOST COMMUNICATION WITH TRANSMISSION CONTROL MODULE     SINCE THE CAN-BUS IS FAILING THE CAR IS NOW TRYING TO STALL INTERMITTENTLY WHILE DRIVING ANY SPEED.",
        "vin": "2G4GV5GV7D9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING APPROXIMATELY 40 MPH WHEN THE VEHICLE BECAME RESISTANT TO ACCELERATION ATTEMPTS. THE VEHICLE STARTED TO DOWNSHIFT INDEPENDENTLY DESPITE THE BRAKE PEDAL NOT BEING DEPRESSED. THEN I LOST THE POWER STEERING, THE INSTRUMENT PANEL STARTED FLICKERING. IT THEN LOST ALL POWER AND LEFT ME STRANDED ON THE INTERSTATE, NARROWLY MISSING OTHER CARS. WITHIN FIVE MINUTES, THE FLASHERS AND LIGHTS ALSO WENT TOTALLY DEAD. TRIED TO RESTART THE CAR AGAIN, BUT WOULD NOT. HAD TO HAVE IT TOWED. THE FAILURE MILEAGE WAS AT 60,000 MILES.  SEARCHING ON THE INTERNET, DISCOVER A RELATED PROBLEM OF GM'S RECALL CAMPAIGN NUMBER IS 13136 OR NHTSA CAMPAIGN NUMBER: 13V173000",
        "vin": "2G4GR5ER5D9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "12/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10820961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. WHILE DRIVING IN A PARKING AREA TO APPROACH AND ENTER A PARKING SPACE AT 5 MPH, THE CONTACT'S VEHICLE INDEPENDENTLY SURGED WITH A HIGH RATE OF SPEED ABOVE 60 MPH AND CRASHED INTO ANOTHER VEHICLE. THE CONTACT APPLIED EXTREME FORCE TO THE BRAKE PEDAL FOR AN EXTENDED PERIOD OF TIME TO TRY TO STOP THE VEHICLE. THE DRIVER AND FRONT PASSENGER SUSTAINED WHIPLASH AND MINOR BRUISING, BUT DID NOT RECEIVE MEDICAL TREATMENT. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A DEALER WHO WAS UNABLE TO REPLICATE AND DIAGNOSE THE CONDITION OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A REPAIR SHOP AND THE EXTENSIVE BODY DAMAGES WERE REPAIRED. THE CAUSE OF THE FAILURE WAS UNABLE TO BE DETERMINED. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 16,738. ....UPDATED 03-31-16 *BF  UPDATED 05/21/18*JB    *CN",
        "vin": "2G4GS5EV2D9"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/14/2015",
        "dateOfIncident": "11/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "ENERGY SAVER A/S",
                "productYear": "9999",
                "size": "205/65/16",
                "type": "Tire"
            }
        ],
        "summary": "BOUGHT 2013 REGAL BUICK OCTOBER OF 2013.  I HAD 2 TIRES TO BLOW OUT LAST YEAR AND 1 YESTERDAY.  THIS IS 3 TIRES I HAD TO REPLACE.  THIS CAN'T BE NORMAL.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/13/2015",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE PURCHASE OF OUR 2013 BUICK REGAL IN THE SPRING OF 2014 (VEHICLE WAS A NEW LEFTOVER), WE EXPERIENCED CONDENSATION BUILDING ON THE OUTSIDE (BOTTOM PORTION) OF THE WINDSHIELD.  WE WOULD USE THE DEFROSTER BUT THAT DID NOT CLEAR THE BUILD UP.  WE TURNED OFF THE RECIRCULATION AND TRIED ALL SETTINGS TO NO SATISFACTION.  NORMALLY ON CLEAR AND LESS HUMID DAYS THERE WAS NO CONDENSATION BUILD UP.  HOWEVER WHEN THE DAY WAS HUMID AND A HIGHER DEW POINT, THE BUILD UP WOULD PRESENT ITSELF.  WE NORMALLY USED THE WINDSHIELD WIPERS TO CLEAR THE WINDOW FOR VISIBILITY, BUT AT TIMES THE ENTIRE WINDSHIELD WILL FOG UP QUICKLY AND ALMOST COMPLETELY.  THIS PRESENTS A VERY DANGEROUS SITUATION IN TRAFFIC BEING THAT WE HAVE FOUND IT DIFFICULT TO DEAL WITH THE PROBLEM WHILE DRIVING (BEING THAT AT TIMES IT COVERS THE WINDSHIELD QUICKLY).  THROUGHOUT THE WINTER MONTHS OF 2014 THROUGH 2015, WE SELDOM DROVE THIS VEHICLE AND USED OUR TRAILBLAZER FOR DRIVING.  THUS WE DID NOT EXPERIENCE TOO MUCH OF A PROBLEM DURING THAT TIME.  HOWEVER THIS YEAR WE WILL BE RELYING ON THE 2013 BUICK REGAL THROUGHOUT THE WINTER AND ARE VERY CONCERNED WITH THE CONDENSATION BUILDUP PROBLEM.  AS STATED THERE ARE TIMES WHEN THE WINDSHIELD QUICKLY FOGS UP.",
        "vin": "2G4GT5GV6D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714265,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE INDICATOR LIGHTS ARE COMING ON WHEN NOTHING IS WRONG WITH THE VEHICLE, GRADUAL LOSS OF BATTERY CHARGE. THEN MY VEHICLE WILL NOT START AT ALL. NOTHING WRONG WITH THE STARTER, BATTERY IS STILL GOOD, THE ALTERNATOR IS FINE. MY INDICATOR CONSOLE WILL NOT COME BACK ON WHEN I TRY TO TURN THE CAR BACK ON, CAR WILL NOT START WITHOUT A JUMP, BUT ALL THE LIGHTS INSIDE AND OUTSIDE OF THE VEHICLE ARE ON. I HAVE FOUND THAT THIS MODEL YEAR HAS A RECALL ALREADY ON IT FOR THIS SAME ISSUE ID # 13V173000 - ELECTRICAL SYSTEM. NOTHING ELSE SEEMS TO BE WRONG WITH THE VEHICLE. NOT SURE AT THIS POINT IF IT IS SAFE TO DRIVE.  *TR",
        "vin": "2G4GS5ER1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703946,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 BUICK REGAL. THE CONTACT STATED THAT THE PUSH TO START BUTTON WAS TOO CLOSE TO THE STEERING WHEEL, WHICH CAUSED THE VEHICLE TO ACCIDENTLY BE TURNED OFF WHEN DRIVING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 400. ..UPDATED 05-26-15 *BF   UPDATED 10/4/2017*CN",
        "vin": "2G4GS5EV6D9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2015",
        "dateOfIncident": "03/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3-7-15, UPON LEAVING MCDONALD'S ON 14 MILE RD., IN ROYAL OAK, MI.  I APPROACHED THE END OF THE DRIVEWAY, STOPPED, WAITING FOR TRAFFIC TO CLEAR.  STARTING TO TURN OUT OF THE DRIVEWAY, I WENT TO ACCELERATE, THE CAR DID START TO GO, BUT SUDDENLY, WITH NO WARNING, THE CAR WOULD NOT ACCELERATE. THIS OCCURRED WHILE I WAS NOW ON THE MAIN ROAD, WITH CARS APPROACHING, NO ACCELERATION.   I GLIDED INTO THE DRIVEWAY RIGHT NEXT DOOR, HARDLY MADE IT SAFELY.     I TESTED THE  CAR IN DRIVE AND REVERSE, AND THE CAR RESPONDED.  I DROVE TO THE DEALERSHIP, RIGHT LANE, FLASHERS ON.          THEY TESTED THE CAR BY COMPUTER CODING \"RUNNING LEAN\".  THEY DETERMINED THIS WAS THE PROBLEM.  I WAS  CALLED AND TOLD  A LOOSE CABLE AND SCREW TO THE BATTERY CAUSED THE PROBLEM.  I ASKED AND WAS TOLD \"RUNNING LEAN\" HAD NOTHING TO DO WITH IT.   THEY SAID IT CODED PREVIOUSLY \"RUNNING LEAN\".   I NEVER HAD WARNINGS, OR  HAD NO GAS  TO THE ACCELERATOR BEFORE.        I HAVE COMPLAINED OF A HESITANCY WHEN I GO TO ACCELERATE FROM A STOP.  TEST DRIVING THE CAR, NOBODY AGREED WITH ME, AT SOMERSET BUICK OR AT SELLERS BUICK.      TOLD TO ME BY SOMERSET BUICK, A PROBLEM HAS TO OCCUR 3 TIMES BEFORE WARNING THE DRIVER.  I SAID THAT COULD BE \"TOO LATE\", AND THEY COULD HAVE A FATALITY ON THEIR HANDS.    IMAGINE MAKING A LEFT TURN IN AN INTERSECTION, STARTING TO ACCELERATE, AND SUDDENLY NO GAS TO DRIVE THE CAR, IN THE MIDDLE OF AN INTERSECTION WITH CARS COMING?   I PONDERED: THE \"3 TIME OCCURRENCE\" BEFORE A WARNING?  WHAT REASON NOT TO WARN A DRIVER? HOW COULD THERE NOT BE A WARNING TO LET A DRIVER KNOW THAT THERE IS A CABLE AND A SCREW LOOSE CAUSING NO GAS TO THE ACCELERATOR?   I AM HAUNTED BY WHAT HAPPENED TO ALL THOSE PEOPLE DRIVING THE GM CARS THAT HAD THE PROBLEMS WITH THE IGNITION.   WILL HISTORY REPEAT ITSELF?         I REALLY BELIEVE THIS NEEDS TO BE A RECALL SITUATION TO SAVE LIVES.    *TR",
        "vin": "2G4GS5EV1D9"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/10/2015",
        "dateOfIncident": "06/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682492,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DAMAGE ON DRIVE SIDE OF REAR BUMPER AND TRUNK LIGHT, INCLUDING TRUNK DAMAGE TO THE VEHICLE.  *TR",
        "vin": "2G4GS5ER6D9"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY AND THE MOON ROOF EXPLODED ALL OVER MY KIDS IN THE BACK SEAT AS WELL AS MY SELF, I HAD GLASS STUCK IN MY SCALP.  *TR",
        "vin": "2G4GV5GV7D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 BUICK REGAL GS  FWD   18,240 MILES BRAKE NOICE IT IS SO BAD THAT THE FRONT BRAKE PADS AND ROTORS HAVE TO BE REPLACED @18240 MILES  THE CAR AT THE DEALER WAS DOING THE SQUEELING NOICE I WAS TOLD IT WAS NORMAL BECAUSE IT HAD  BREMBOL BRAKES ROTORS AND PADS  THE COST TO REPLACE ALL 4 PADS ROTORS IS $2201.00   THERE IS SO MUCH WEAR AND TEAR AWFUL.  *TR",
        "vin": "2G4GV5GV6D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SEAT HEAD RESTRAINTS ARE HEAD \"CONSTRAINTS.\" BOTH THE ANGLE OF THE BRACES SUPPORTING THE HEAD RESTRAINTS AND THE THICKNESS OF THE PADDING OF THE HEAD RESTRAINTS ARE EXCESSIVE. WHEN THE SEAT IS UPRIGHT, A POSITION OF GOOD POSTURE, THE HEAD RESTRAINT FORCES THE HEAD DOWN TO LOOK AT THE LAP. RAISING THE HEAD RESTRAINT INCREASES THE DOWNWARD ANGLE. MOVING THE SEAT-BACK AWAY FROM VERTICAL MAKES THE HEAD COMFORTABLE BUT THEN THE BACK DOESN'T TOUCH THE SEAT-BACK AND THAT POSITION IS RATHER TIRING. MUCH OF THE TIME, THE SOLUTION IS TO LEAN FORWARD OR TO THE RIGHT OR TO THE LEFT AWAY FROM THE HEAD RESTRAINT TO AVOID DISCOMFORT AND BLOCKED VISION. THE 2013 BUICK REGAL HAS TAKEN THE HEAD RESTRAINT CRITERIA TO EXCESS AND IT WOULD BE HELPFUL IF MODIFICATIONS CAN BE CONSIDERED SO THAT FUTURE HEAD RESTRAINTS ARE NO LONGER A HINDRANCE TO DRIVERS.",
        "vin": "2G4GS5EVXD9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2014",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575636,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2013 BUICK REGAL E-ASSIST VEHICLE FROM THE GM DEALERSHIP IN ST. CATHARINES. WHEN I ATTEMPTED TO START MY NEW CAR AND DRIVE IT FOR THE FIRST TIME, TO MY SURPRISE AND DISMAY, THE EMERGENCY LIGHTS WENT OFF, WINDSHIELD WIPERS STARTED WIPING, AUDIBLE WARNING SOUNDS WENT OFF, AND THE CAR STARTED MAKING LOUD SCREECHING NOISES! THE VEHICLE SOUNDED AS IF IT WAS CRYING AND DYING! I WAS FRIGHTENED THAT THE VEHICLE WAS GOING TO EXPLODE IN MY GARAGE! I IMMEDIATELY EXITED THE CAR. WHEN I RETURNED TO THE VEHICLE A FEW MOMENTS LATER, ALL POWER WAS OFF IN THE VEHICLE. IT APPEARED AS IF THE VEHICLE HAD A POWER FAILURE.      UPON DOING SOME RESEARCH ONLINE I FOUND THAT APPARENTLY, TO MY SURPRISE, THERE WAS A RECALL ON THE VEHICLE (RECALL # 13146) DUE TO A POTENTIAL MALFUNCTION ISSUE WITH THE GENERATOR CONTROL MODULE. APPEARS THAT MY VEHICLE WAS ONE OF THE VEHICLES AFFECTED BY THE DEFECTIVE GCM, HOWEVER THE VEHICLE WAS SOLD TO ME PRIOR TO HAVING THE GCM REPLACED! I AM EXTREMELY DISPLEASED THAT THE RECALL WAS NOT DEALT WITH BY THE DEALERSHIP! WHILE MY VEHICLE WAS TOWED TO THE GM DEALERSHIP AND SUCCESSFULLY REPAIRED, THIS SITUATION HAS CAUSED ME AN UNACCEPTABLE AMOUNT OF STRESS, EMOTIONAL TRAUMA, AND PHYSICAL SYMPTOMS SUCH AS HEART PALPITATIONS AND INSOMNIA! FOR THE PAST MONTH, I HAVE HAD PERPETUAL NIGHTMARES RELATED TO THIS E-ASSIST VEHICLE! I AM EVEN FRIGHTENED TO APPROACH THE VEHICLE AND START IT, FOR FEAR OF WHAT MIGHT HAPPEN AGAIN! I AM CONSTANTLY WORRIED THAT THE VEHICLE IS GOING TO EXPLODE OR CATCH FIRE!     FURTHERMORE, I HAVE TRIED DRIVING THE CAR FOR SHORT DISTANCES DAILY, BUT I HAVE BEEN EXPERIENCING HEADACHES, ANXIETY, DIZZINESS, AND NUMBNESS WHILE DRIVING.    DUE TO THE TRAUMA AND NEGATIVE HEALTH PROBLEMS (HEART PROBLEMS, INSOMNIA, ETC.) THAT I HAVE EXPERIENCED AS A RESULT OF THIS E-ASSIST VEHICLE, I AM IN THE PROCESS OF TRADING IN FOR A NON HYBRID.  *TR",
        "vin": "2G4GR5ER6D9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2014",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRIM PANEL NEAR THE DRIVER'S LEFT FOOT IS NOT TIGHTLY SECURED AND THERE IS A SPACE BETWEEN TRIM PANEL AND CARPET.  DRIVER'S SHOE SOLE GETS CAUGHT UNDER EDGE OF PANEL AND DRIVER IS UNABLE TO LIFT FOOT I ORDER TO APPLY CLUTCH AND THEREFORE UNABLE TO CONTROL VEHICLE.  THREE VERY CLOSE CALLS ACCIDENTS TO DATE.  *TR",
        "vin": "2G4GV5GV6D9"
    }
]