[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving and the car lost complete power and a message appeared that indicated Service Power Steering. This has happened twice once at approximately 45 to 50 miles per hour and the second time turning at about 10 miles per hour. The car started shaking right before the failure with the power steering.",
        "vin": "2G1FK1EJ6D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The radio turns off automatically. First the radio would randomly go off. Then the signal light sounds stopped working. Now the radio has no display and does not play. Although you are able to see the signal light the sound is gone.  Since April 2019",
        "vin": "2G1FA1E36D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Chevrolet Camaro. The contact stated that while driving at various speeds, the radio, air conditioning unit, and other electrical features became inoperable without warning. Due to the failure, the contact stated that she was unable to use the defroster causing her vision to be obstructed while driving. She also mentioned that the noise from the turn signals failed to sound while in operation. The manufacturer was notified of the failure and referred her to a dealer for a diagnostic test. The manufacturer stated that the failure might be an electrical failure and that a wire might need to be cut. The vehicle was not repaired. The failure mileage was approximately 68,000.",
        "vin": "2g1fa1e36d9"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Chevrolet Camaro. The contact stated that the radio module would intermittently shut off without warning while driving at various speeds. Due to the failure, the contact was unable to actuate the defroster or hear the turn signals. The dealer was notified of the failure and was given a diagnostic fee to inspect the vehicle. The manufacturer was also notified of the failure and informed him that there were no recalls on the vehicle. The vehicle had yet to be repaired. The failure mileage was approximately 100,000.",
        "vin": "2g1fa1e32d9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Radio has been popping on and off for 4 years. Now it only Works randomly. The heat and air will not work without the radio working and you can not hear blinkers going. There are thousands of exact same complaints for this vehicle… why is this not being recalled?",
        "vin": "2g1fe1e3xd9"
    },
    {
        "components": "VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello,  My name is Sharris Bridges, I’m the owner of a 2013 Chevrolet Camaro. I currently can’t defrost my car and can’t see the road because I have no heat. The Chevrolet Camaro has a issue with the blend door (temperature control door). It’s a piece of plastic that breaks which causes you not to have any heat. I was told by the dealership I would’ve to get the dash and windshield taken out just to get the blend door fixed. The bill they showed me was $20+ (majority in labor) for a issue that plenty people are having with the Camaro. This should be a recall! I’ve no heat, I can’t defrost my car, and more.   https://m.youtube.com/watch?v=K0jajaoc-ro  https://m.youtube.com/watch?v=s0gakV_mGiY  https://m.youtube.com/watch?v=Py-2ukNVAGs   https://m.youtube.com/watch?v=tL3CaKzVKm4  Consumer stated they’ll need to take out the windshield and dash to get to the area which needs fixing.",
        "vin": "2G1FB1E39D9"
    },
    {
        "components": "VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433831,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I’ve two pictures that I didn’t upload to the complaint about the Chevrolet Camaro blend door issue that I just submitted.",
        "vin": "2G1FB1E39D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO STOPS WORKING INTERMITANTLY AND TURN SIGNAL IS INAUDIBLE WHEN THIS HAPPENS . AN INADVERTANT TURN SIGNAL COULD CAUSE SOMEONE TO PULL OUT IN FRONT OF YOU THIS IS AN INTERRMITANT PROBLEM , BUT HAPPENS EVERYTIME I DRIVE THIS CAR",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Chevrolet Camaro. The contact stated that while operating the vehicle, the radio entertainment display malfunctioned and flickered off and on. During the failure, the turn signal alert, seat belt, and door chimes were all inaudible. The cause of the failure was not determined. The manufacturer and the local dealer were not notified of the failure. The failure mileage was 19,000.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11416290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED WHEN THE DRIVER DROVE ON A ROAD THAT WAS UNDERGOING CONSTRUCTION WORK, THE DRIVER HAD TO MOVE INTO THE LEFT LANE, SWERVE TO AVOID THE CONES ON THE ROAD, THE DRIVER CROSSED OVER FOUR LANES OVER THE SIDEWALK, WENT THROUGH A DITCH, AND CRASHED INTO A TREE. THE DRIVER WAS PRONOUNCE DEAD AT SCENE. THE VEHICLES AIR BAGS FAILED TO DEPLOY.  THE POLICE DEPARTMENT WAS PRESENT AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW YARD. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "2G1FA1E36D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413874,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITANTLY THE CAR WILL NOT SHIFT INTO GEAR.  YOU HAVE TO FORCE THE SHIFT INTO 1ST GEAR THEN INTO SECOND, AND I AM TALKING REALLY FORCING SHIFTER INTO GEAR....  AT TIMES THE SHIFTER WILL NOT SHIFT INTO ANY GEAR... THEN OTHER TIMES IT RUNS JUST PERFECTLY... IT IS HAPPENING MUCH MORE FREQUENTLY AND IS DANGEROUS.  BELOW IT IS ASKING WHEN DID THIS HAPPEN - THIS A FREQUENTLY OCCURING PROBLEM, AND I SEE ONLINE MAY OWNERS ARE HAVING THE SAME PROBLEMS WITH DEALERS OFFERING NO HELP.  OR PAYING FOR A REPAIR AND PROBLEM PERSISTS.",
        "vin": "2G1FE1E36D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD UNIT: AC KICKS ON AND OFF, RADIO WON'T PLAY, BLACK SCREEN ON STOCK HEAD UNIT, TRIPS OFF AND ON, BLINKER SOUNDS WON'T WORK, MAKES ELECTRICAL TRIP OUT.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE HELP ME.  I AM HAVING DIFFICULTY WITH ROTOLO CHEVROLET IN FONTANA, CALIFORNIA PROVIDING ME WITH A NEW REPLACEMENT KEY IN EXCHANGE FOR THE CAMARO KNEE-KEY RECALL NO. 14V346KEY WITHOUT CHARGE.  I DO NOT FEEL SAFE DRIVING MY CAR WITH THE ORIGINAL KEY THAT CAME WITH THE CAMARO, MY SAFETY IS AT RISK, AND ROTOLO CHEVROLET IS WRONGFULLY CHARGING $506.00 FOR THE RECALL REPLACEMENT    I AM THE ORIGINAL OWNER OF MY 2013 CHEVROLET CAMARO (VIN: [XXX]) AND I ONLY HAVE THE ORIGINAL KEY THAT CAME WITH THE CAR WHEN PURCHASED IN 2013 (SEE PICTURES).    ON SATURDAY, APRIL 3, 2021, I HAD AN 11:30 A.M. APPOINTMENT WITH ROTOLO CHEVROLET IN FONTANA, CALIFORNIA TO REPLACE MY ORIGINAL KEY DUE IT BEING RECALLED.  ROTOLO CHEVROLET ADVISOR [XXX] SAID I HAD TO PAY $506.00.    [XXX] SAID THAT EVEN THOUGH I HAVE THE ORIGINAL KEY (HE HELD MY KEY PERSONALLY AND CONFIRMED IT WAS THE ORIGINAL; NOT A RECALL REPLACEMENT TWO-PART KEY) HE CANNOT REPLACE THE KEY UNLESS I PAY FOR IT AS HIS PAPERWORK SAYS THE RECALL WAS COMPLETED.  I EXPLAINED HIS RECORD IS INCORRECT AS THE ONLY KEY I HAVE IS THE ORIGINAL.  WHILE AT ROTOLO CHEVROLET, I PLACED AN ORDER FOR A NEW KEY EVEN THOUGH I DID NOT AGREE WITH BEING CHARGED $506.00 FOR A RECALL REPLACEMENT KEY.  I HAD TO CONTINUE WITH THE PROCESS TO ORDER A NEW KEY BECAUSE OF MY SAFETY.   DUE TO THE RECEIPT STATING DECLINED REPAIRS, I CALLED ROTOLO CHEVROLET ON MONDAY, APRIL 5, 2021.  I SPOKE WITH  ALMA AND SHE SAID SHE WAS GOING TO EXPLAIN MY RECALL KEY MATTER WITH A MANAGER ([XXX]), AND TRANSFERRED ME TO [XXX].  REGARDING THE ERROR ON THE RECEIPT STATING I DECLINED THE REPLACEMENT KEY.  I ONLY DECLINED THE CHARGE OF $1,492.00, DUE TO A SHORT IN THE CONNECTION TO MY ONSTAR AND RADIO. THIS WAS TOO EXPENSIVE.  THEY ALSO CHARGED ME $180.00 FOR NO WORK DONE.       [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398200,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO STOPPED WORKING. SOON AFTER THE HEAT/AIR BLOWING WAS KICKING ON AND OFF. EVEN WHEN BLOWING YOU CANNOT CONTROL THE TEMPERATURE. THEN THE GAUGES STARTED BLINKING AND HAVE NOT CAME BACK ON FOR A WHILE. YOU CANNOT HEAR YOUR TURN SIGNALS OR SEE ANYTHING ON THE CONTROL SCREEN.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO TURNING OFF AND NOT WORKING",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIO TURNS ON AND OFF-VERY DISTRACTING TO MY DRIVING AND MAKES A LOUD POPPING SOUND FROM SPEAKERS-WHICH IS STARTLING.  ALONG WITH THIS MY DEFROST TURNS ON AND OFF WHICH SOMETIMES LIMITS MY VISIBILITY.  THIS HAPPENS WHILE THE CAR IS PARKED AND WHILE DRIVING INTERMITTENTLY.  IT HAPPENS ABOUT 20 TIMES WHILE DRIVING A SHORT DISTANCE OF ABOUT 10 MILES. IT ALSO HAPPENED WHILE I WAS DRIVING ON THE INTERSTATE.",
        "vin": "2G1FA1E3XD9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388158,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING PROBLEMS WITH MY RADIO FOR ABOUT 10 MONTHS NOW. THE PROBLEM STARTED WHEN I PRESSED ON MY BRAKES IN A CITY STREET AND THE RADIO TURNED OFF AND TURNED BACK ON AFTER A FEW SECONDS. I FOUND IT ODD, BUT IGNORED IT INITIALLY. THIS PROBLEM STARTED TO HAPPEN MORE REGULARLY, WITH A STRONG ASSOCIATION BETWEEN THE RADIO TURNING OFF AND BACK ON TO USING THE BRAKES ON MY CAR. OVER THE COURSE OF SEVERAL MONTHS, THE PROBLEM BECAME MORE SIGNIFICANT, HAPPENING MORE FREQUENTLY DURING MY DRIVES, AND NO LONGER ASSOCIATED WITH BRAKING, IT WOULD JUST HAPPEN RANDOMLY NOW. THE RADIO WOULD TURN ON AND OFF REPEATEDLY DURING MY DRIVES, WHETHER I WAS ON A CITY STREET OR HIGHWAY. AT THIS POINT, MY AIR WOULD ALSO TURN ON AND OFF WHEN THE RADIO WOULD START GLITCHING. THERE WERE TIMES WHEN I WOULD TURN ON MY CAR AND THE RADIO JUST WOULDN'T TURN ON AT ALL. THERE WAS ONE TIME THAT IT TOOK 20 MINUTES INTO MY DRIVE FOR THE RADIO TO FINALLY TURN ON, ONLY FOR IT TO START TURNING ON AND OFF AGAIN. THIS PROBLEM CAN BE VERY DISTRACTING WHILE DRIVING, AND MAY CAUSE AN ACCIDENT. AS A RESULT, I HAD TO REMOVE THE RADIO FROM MY CAR AND I JUST DRIVE IN SILENCE.  THE AIR NO LONGER TURNS ON AND OFF AND I CAN DRIVE PEACEFULLY, EVEN THOUGH I WOULD LOVE TO LISTEN TO THE RADIO WHILE I DRIVE.",
        "vin": "2G1FA1E36D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ON",
        "vin": "2G1FE1E33D9"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT RANDOMLY STOPPED WORKING AND SPRINGS UP AND DOWN. CANNOT BE ADJUSTED TO A SAFE DRIVING HEIGHT.",
        "vin": "2G1FK3DJXD9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SO MY AC AND STEREO WAS WORKING GOOD BUT SUDDENLY IT STARTED TURNING OFF ITSELF. THEN WHENEVER I TURN ON MY CAR IT STARTS WORKING. BUT AFTER 1-2 MONTHS IT STOPPED WORKING AT ALL. THIS IS SAME ISSUE AS OTHER PEOPLE WHO OWNS CAMARO HAVE IT. I TRIED TO TOOK TO MECHANIC NOBODY UNDERSTANDS WHAT'S GOING ON. NOW IT'S NOT WORKING AT ALL. STEREO IS NOT COMING UP AT ALL. AC AND HEATER DOESN'T WORK.",
        "vin": "2G1FA1E37D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ZL1 CAMARO HAS HAD A ELECTRONIC STEERING (EPS) FAILURE WHILE I WAS DRIVING ON THE ROAD. APPARENTLY, FAILURE OF EPS IS COMMON WITH THE CAMARO AND GM/CHEVROLET HAS A TSB ISSUED TO HELP DEAL WITH THIS ISSUE.    TSB DOCUMENT IS PIC5643E. I HAVE ATTACHED IT HERE.    THIS CAN HAS 40,070 MILES ON IT AND IS IN IMMACULATE CONDITION.    THE CHEVROLET DEALER JUST DIAGNOSED THIS ISSUE, AND TRIED TO CHARGE ME $2600 FOR REPLACING THIS PART.    THIS IS A SAFETY ITEM, AND IT IS NOT POSSIBLE TO DRIVE THIS CAR WITHOUT THIS STEERING WORKING. THIS IS ALSO A $60,000 CAR.    NO ONE AT CHEVROLET IS DOING ANYTHING TO HELP WITH THIS ISSUE. I HOPE THIS COMPLAINT WILL BE HELPFUL TO SOMEONE IN THE FUTURE.",
        "vin": "2G1FL1EP2D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MY RADIO WILL POP AND SHUT OFF, WHICH ALSO CAUSES MY AC TO NOT WORK. RECENTLY IT HAS ALSO EFFECTED MY TURN SIGNALS AND OTHER DASH BOARD AREAS AND IT DOES IT NO MATTER IF I'M LEGIT DRIVING OR SITTING STILL.   THERE ARE LITERALLY HUNDRED OF PEOPLE HAVING THIS ISSUE AND NOTHING HAS FIXED IT YET!  *TR",
        "vin": "2G1FA1E34D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2020",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326699,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS FROM 2013, IT HAS BARELY 68 THOUSAND MILES, IT DOES NOT HAVE MUCH MILEAGE WHICH I ONLY USE TO TRANSPORT MYSELF TO WORK AND HOME, I HAVE BEEN AND ASKING IN THE TRAILER ABOUT THIS PROBLEM THAT I HAVE, I EVEN TOOK IT TO THE TRAILER BEFORE  THE FACTORY WARRANTY WILL BE TERMINATED AND THEY NEVER WANTED TO HELP ME, THE CAR IS MANUAL TRANSMISSION AND HAS PROBLEMS MAKING THE CHANGE FROM FIRST SPEED TO SECOND SPEED, THE SECOND DOES NOT ENTER, IT IS ONLY THE PROBLEM WHEN CHANGING TO THE SECOND SPEED IN  THE REST I HAVE NO PROBLEM SO IF I NEED TO CHECK THAT PROBLEM BECAUSE FOR THE MILES THAT THE CAR HAS, IT IS NOT REASONABLE FOR ME TO HAVE THAT PROBLEM AND TO BE A NOT VERY CHEAP CAR I THINK THAT IS VERY BAD THAT",
        "vin": "2G1FE1E39D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE HEADLAMPS BECAME INOPERABLE. AN ABNORMAL POPPING SOUND WAS HEARD COMING FROM THE RADIO. SEVERAL MINUTES AFTER THE FAILURE, THE HEADLAMPS RESUMED NORMAL OPERATION INDEPENDENT OF DRIVER INPUT. ADDITIONALLY, THE POPPING SOUND WAS ALSO HEARD WHILE THE TURN SIGNALS WERE ACTIVATED. A DEALER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A COMPLAINT WAS FILED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000.",
        "vin": "2G1FE1E35D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "01/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323788,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO IS FLICKERING AND IS ON AND OFF ALL THE TIME. THE SCREEN IS AFFECTING THE A/C AND HEATHER. THIS IS A MANUFACTURER'S ISSUES.  *TR",
        "vin": "2G1FA1E3XD9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE INSTRUMENT PANEL LIGHTS FLICKERED ON AND OFF WHILE THE VEHICLE STOPPED OR BEING DRIVEN. ADDITIONALLY, THE BLOWER MOTOR ACTIVATED INDEPENDENTLY. THE VEHICLE WAS DIAGNOSED. BLUE RIBBON CHEVROLET BUICK GMC, INC (1701 S KERR BLVD, SALLISAW, OK 74955, (918) 791-3974, WAS CONTACTED AND INFORMED OF THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 104,000.",
        "vin": "2G1FE1E38D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FLUID RESERVOIR LEAKING AND DRIPPING OVER ENGINE INTERNALS. THIS IS A KNOWN ISSUE WITH GM: SEE SERVICE BULLETIN: 09-05-22-005C. HOWEVER, GM IS STATING THIS WILL NOT BE REPAIRED UNLESS THE VEHICLE IS STILL UNDER WARRANTY.   UPON ENCOUNTERING SOME BRAKING ISSUES WITH THE VEHICLE, I INSPECTED THE RESERVOIR AND DISCOVERED THE LEAKING FLUID, WHICH HAS STARTED TO EAT AWAY AT THE PAINT IN THE ENGINE BAY.  I'M VERY CONCERNED THE FLUID WILL LEAK OUT AND CAUSE A FIRE, OR CAUSE MY BREAKS TO STOP WORKING COMPLETELY. AS AN ATTORNEY, I WOULD THINK THAT GM WOULD WANT TO LIMIT ITS LIABILITY AND REPAIR THIS ISSUE TO, REGARDLESS OF WARRANTY COVERAGE. SHOULDN'T THIS BE A FORMAL RECALL?",
        "vin": "2G1FL3DP3D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE INSTRUMENT PANEL BECAME INOPERABLE. THE VEHICLE WAS RESTARTED AND OPERATED AS INTENDED. THE BRAKE PEDAL WAS DEPRESSED AND THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO VIC CANEVER CHEVROLET, INC. (3000 OWEN RD, FENTON, MI 48430, (810)637-1769 HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/18/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING ELECTRICAL ISSUES CAUSING MY RADIO, AC, AND TURN SIGNALS TO MALFUNCTION. IN ADDITION IT'S MAKING LOUD AND DISTRACTING POPPING AND SQUEALING NOISES, AND SOUNDS THAT MAY BE ELECTRICAL SPARKING NOISES. GM TOLD ME IT'S OUT OF WARRANTY SO THEY DON'T CARE. IT HAPPENS WHENEVER THE IGNITION IS ON (ALL TYPES OF STREETS & FREEWAY), BUT NOT IN ACCESSORY.  *TR",
        "vin": "2G1FE1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER I START MY CAR AND TURN ON THE RADIO A LOAD POPPING SOUND WILL COME THROUGH THE SPEAKERS AND THE SOUND FROM THE RADIO WILL GO OFF. THE RADIO PANEL WILL STAY LIT, BUT NO SOUND WILL COME OUT AND THE BUTTONS ON THE RADIO WILL NOT WORK. IT ALSO WILL NOT ACCEPT A CD. IT WILL STAY LIKE THIS FOR AWHILE. THE NEXT TIME I START CAR IT WILL DO THE SAME THING. IT USED TO DO THIS RANDOMLY AT FIRST WITH NO RHYME OR REASON FOR IT. IT STARTED MORE THAN 6 MONTHS AGO AND HAS GOTTEN WORSE. IT USED TO PLAY A LITTLE WHILE BEFORE POPPING SOUND AND NO SOUND. NOW IT ONLY STAYS ON SECONDS, POPS AND GOES OFF. SOMETIMES IT WON'T WORK AGAIN FOR HOURS OR DAYS. AT FIRST I HEARD LOUD STATIC IN MY SPEAKERS WHEN I USED THE TURN SIGNALS, BUT NOT ANYMORE. THERE DOESN'T SEEM TO BE AN SPECIFIC PATTERN. I DO SEE THAT MANY PEOPLE ARE HAVING THIS SAME OR VERY SIMILAR PROBLEMS WITH THEIR CAMAROS. WHY HASN'T THERE BEEN A RECALL. IT'S OBVIOUSLY A BIG PROBLEM THAT A LOT OF CAMARO OWNERS ARE HAVING. IT HAPPENS WHEN IT'S STATIONARY AND/OR IN MOTION.",
        "vin": "2G1FA1E3XD9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC BLEND DOOR FAILS DUE TO FAULTY DESIGN. THIS CAUSES THE AC TO PERFORM INCORRECTLY AND ONLY BLOW HOT AIR IN THE WARM/HOT SEASON. USING THE HEATER IN THE WINTER MELTS THE BLEND DOOR HINGE CAUSING THIS MALFUNCTION.",
        "vin": "2G1FB3D33D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19E064000 (ELECTRICAL SYSTEM). THE CONTACT CALLED JIM ELLIS CHEVROLET LOCATED IN ATLANTA, GA AND WAS TOLD TO BRING THE VEHICLE INTO THE DEALER.  THE CONTACT STATED THAT WHEN THE VEHICLE WAS STARTED, THE VEHICLE FAILED TO SHIFT INTO REVERSE. THE SERVICE AIR BAG WARNING LIGHT ILLUMINATED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND REFERRED THE CONTACT TO THE DEALER. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 53,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G1FC1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, THE RADIO FLICKERED ON AND OFF CAUSING THE BATTERY TO DISCHARGE. THE CONTACT STATED THAT THE ELECTRONIC STABILITY CONTROL WARNING LIGHT ILLUMINATED WHILE THERE WAS A WINDOW ERROR LIGHT ILLUMINATED. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 107,146.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315729,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INBOARD WHEEL FATIGUE (CRITICAL CRACK) ON 20-IN. MANUFACTURER'S WHEEL FOR 2013 CHEVROLET CAMARO RS DUE TO MANUFACTURE'S DEFECT' NO IMPACT DAMAGE DISCOVERED AFTER NOTICING QUICK LOSS OF TIRE AIR PRESSURE.",
        "vin": "2G1FC1E32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START MY VEHICLE MY RADIO DOESN'T TURN ON RIGHT AWAY. THE AC CONTROL LIGHTS FLICKER ON AND OFF. IT CAN VARY AT TIMES BUT CAN BE UP TO 5 MINUTES ON SOME DAYS. THE RADIO WILL FINALLY WORK. BUT AFTER 20 MINUTES OF DRIVING THE RADIO CUTS OUT AND ISN'T AS LOUD ANYMORE. I'M ALSO BEGINNING TO NOTICE MY TURN SIGNAL IS CUTTING OUT AS WELL. IT'S SLOWING DOWN. AS IF THE BATTERY IS BEING DRAINED. I NOTICE WHEN U TURN OFF THE CAR ALMOST EVERY TIME THE RADIO WILL TURN OFF COMPLETELY BEFORE I OPEN THE DOOR. I CAME ACROSS SOME OTHER PEOPLE ONLINE WHO HAD THE SAME ISSUES. MOST WHO BELIEVE THAT THE UNIT BEHIND THE RADIO DISPLAY NEEDS TO BE REPLACED AND REPROGRAMMED. WHICH IN MY CASE SEEMS TO BE THE ANSWER. WHICH IS TO MUCH PROBLEMS HAPPENING RIGHT NOW. AS FAR AS WHERE IT'S AT NOW. IT COULD GET WORSE DOWN THE ROAD.",
        "vin": "2G1FA1E30D9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO    THE VEHICLE  DASHBOARD BLACKED OUT AND STARTED TO LOOSE POWER.     THE VEHICLE WAS NOT YET  DIAGNOSED BY A CERTIFIED DEALER     THERE WERE NO CONSEQUENSES, BUT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, THAT RECOMENDED A NEW BATTERY.    WHILE WATING A RED LIGHT, THE CAAELERATOR WAS DEPRESSED AND THE SMELL OF BURNING WIRES STARTED  AND STARTED TO LOOSE POWER.  THE FAILURE STARTED THREE YEARS AGO AND IT WORSEN. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 57,000.",
        "vin": "2G1FE1E32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO CUTS OFF WITH LOUD CRACKING NOISE AND NO LONGER WORKS. AC IS NOW AFFECTED. RECENTLY CAR CUT OFF RANDOMLY IN THE MIDDLE OF TURNING. RADIO HAS ALREADY BEEN REPLACED ONCE BY DEALERSHIP.",
        "vin": "2G1FA1E37D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING, A POPPING NOISE WAS HEARD COMING FROM THE SPEAKERS, WHICH CAUSED THE ELECTRICAL SYSTEM TO FAIL. THE CONTACT STATED THAT THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 63,000.",
        "vin": "2G1FE1E36D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE WINDSHIELD WAS FOGGY INSIDE THE VEHICLE. WHEN THE CONTACT ACTIVATED THE DEFROSTER TO CLEAR THE WINDSHIELD, THE DEFROSTER INDICATION LIGHT DARKENED AND THE TURN SIGNAL CHIME BECAME MUTE. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269012,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 30 MPH AND ATTEMPTING TO MAKE A RIGHT TURN, THE TURN SIGNAL INDICATOR DID NOT WORK AND THE RADIO STOPPED OPERATING. THE VEHICLE WAS TAKEN TO VICTORY LAYNE CHEVROLET (3980 FOWLER ST, FORT MYERS, FL 33901) AND WAS REPAIRED WITHOUT A DIAGNOSTIC TEST. THE REPAIR SPECIFICS WERE UNKNOWN; HOWEVER, THE FAILURE RECURRED ON OCTOBER 16, 2019. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 59,000.",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268424,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELTS IN MY VEHICLE WILL NOT STAY CLICKED. AT FIRST I THOUGH THIS WAS SOMETHING THAT WAS WRONG WITH MY VEHICLE HOWEVER AFTER SPEAKING WITH OTHER CHEVROLET CAMARO OWNERS, THIS IS SOMETHING THAT A LOT OF DRIVERS ARE EXPERIENCING.",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/28/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE AND THE POWER STEERING WENT OUT MAKING THE VEHICLE DIFFICULT  TO CONTROL. I WAS DRIVING 45MPH IN AN ACCELERATING MANNER",
        "vin": "2G1FK3DJ4D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE TURN SIGNALS, RADIO, AND AIR CONDITIONER FAILED. THE VEHICLE WAS TAKEN TO RICK HENDRICK CHEVROLET (5665 AIRPORT PULLING RD N, NAPLES, FL 34109) WHERE IT WAS DIAGNOSED THAT THE MODULE THAT CONTROLLED ALL THREE COMPONENTS NEEDED TO BE REPLACED. THE CONTACT STATED THAT THIS WAS THE SECOND TIME THE MODULE HAD TO BE REPLACED IN TWO YEARS. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED BY THE DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 9-5534150034. THE APPROXIMATE FAILURE MILEAGE WAS 62,800.",
        "vin": "2G1FA1E35D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE THE VEHICLE'S GEAR WAS IN THE PARK POSITION WITH THE ENGINE RUNNING, THE DRIVER AND PASSENGER SIDE AIR BAGS SUDDENLY DEPLOYED WITHOUT WARNING OR AN IMPACT OCCURRING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 39,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHEN THE VEHICLE WAS STARTED, ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. WHILE THE CLUTCH PEDAL WAS DEPRESSED, THE INSTRUMENT PANEL LOST POWER. THE VEHICLE WAS TAKEN TO FOLSOM CHEVROLET (12655 AUTO MALL CIR, FOLSOM, CA 95630, (916) 985-5600) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED; HOWEVER, THE KEY FOB WAS UPDATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS APPROXIMATELY 43,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING AN ISSUE WITH MY RADIO. IT'S ACTING ON, TRYING TO CHANGE THE MODE. FOR EXAMPLE, LISTENING TO XM THEN WANTS TO CHANGE TO AUX. TRYING TO TURN OFF THE AIR CONTROL ON ITS OWN. I CAN HEAR A STATIC SOUND IN THE BACKGROUND AT TIMES. T  THIS HAPPENS MAINLY WHEN THE VEHICLE IS MOVING. I'VE ONLY OWNED THE VEHICLE FOR A YEAR AND IT HAS JUST RECENTLY STARTED A FEW MONTHS AGO.",
        "vin": "2G1FE1E34D9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253693,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE OPERATING THE VEHICLE, THE TURN SIGNALS FAILED TO OPERATE INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. DENECKER CHEVROLET(510 US-7, MIDDLEBURY, VT) WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 36,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING AT ANY SPEED, THE RADIO FLICKERED ON AND OFF. AS A RESULT, THE COMPUTER SYSTEM SHUT OFF THE HAZARD LIGHTS, AIR CONDITIONER, AND OTHER ELECTRICAL COMPONENTS WITHOUT WARNING. THE VEHICLE WAS TAKEN TO STERLING MCCALL CHEVROLET (281-397-8600, LOCATED AT 17800 NORTH FWY, HOUSTON, TX 77090) WHERE THE RADIO WAS REPLACED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHO STATED THAT THE RADIO HAD A SHORT AND NEEDED TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE WARRANTY WAS EXPIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT CALL THE CONTACT BACK. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BOW ON CONVERTIBLE TOP BENDS CAUSING ROOF NOT TO PROPERLY CLOSE WHILE IN OPERATION. GAPPING IN ROOF WILL CAUSE WATER TO ENTER VEHICLE AND STOP CARS OPERATION, LOSING ELECTRICAL FUNCTIONS SUCH AS POWER STEERING, BRAKING OR CAR MAY COMPLETING STALL OUT.",
        "vin": "2G1FB3D32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11233777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, HER KNEE UNINTENTIONALLY KNOCKED THE KEY OUT OF THE RUN POSITION, TURNING OFF THE ENGINE. THE VEHICLE CRASHED INTO A LIGHT POLE. THE AIR BAGS DEPLOYED AND THE CONTACT SUSTAINED MINOR INJURIES TO THE FACE. MEDICAL ATTENTION WAS SOUGHT. THERE WAS NO POLICE REPORT FILED.  THE VEHICLE WAS TOWED TO THE TOW FACILITY. RON MONTGOMERY MOTORS LOCATED AT 3325 S SHILOH RD, GARLAND, TX 75041, (972) 278-5700, WAS CONTACTED BY PHONE AND INFORMED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V346000 ( ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT CONTACTED OR MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 130,000. PIIR-Y. AH",
        "vin": "2G1FC1E39D9"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11229684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING COLUMN CAME COMPLETELY OUT AND PINNED ME BACK TO THE SEAT AND ALMOST WENT THROUGH THE ROOF OF THE CAR. I WAS STOPPED AT A RED LIGHT THEN ALL OF A SUDDEN I WAS HIT AT AN ESTIMATED SPEED OF 60-65 MPH. THE GUY NEVER HIT HIS BRAKES BUT HIT ME AND PUSHED ME THROUGH THE LIGHT. PICTURES ARE POSTED. THE SCRATCH MARK IS OF THE ROOF, WHERE STEERING COLUMN ALMOST WENT THROUGH IT.  GM DID SEND AN ENGINEER DOWN TO MY HOUSE TO INVESTIGATE,  HE WAS THERE 5 HRS AND WHEN HE LEFT HE WAS STILL SHOCKED THAT A REAR END AND IT DID THIS. HE DID SAY THAT IF I HAD OF BEEN HIT IN THE HEAD AREA I WOULD BE DEAD. I DID HAVE SURGERY ON MY LEFT THUMB AND WRIST I HAD A RUPTURE OF THE ULNAR COLLATERAL LIGAMENT WITH AVULSION TO MY LEFT THUMB. SURGEON STATES I WILL NEVER BE 100% AGAIN..",
        "vin": "2G1FS1EW1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHETHER STATIONARY OR IN MOTION, THE RADIO POPS, THE A C BLOWER IS INTERMITTENT AND THE DIRECTION SIGNALS STOP MAKING NOISE. THE FACEPLATE SCREEN GOES BLACK AND ALL ACTIVITY STOPS. THEN IT COMES ON AND OFF AT INCONSISTENT TIMES.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH MOUNT LED BRAKE LIGHT IS MOUNTED ON THE REAR WINDSHIELD AT AN ANGLE THAT RECEIVES DIRECT HEAT FROM THE SUN CAUSING A SLIM CRACK ON THE BRAKE LED BOARD. THE CRACK WILL SHIFT BACK AND FORTH SOMETIMES ILLUMINATING WHEN BRAKING BUT AT TIMES THE SLIM CRACK ON THE LED BOARD WILL PREVENT THE LAMP FROM ILLUMINATING CAUSING AN IMMEDIATE SAFETY HAZARD TO PASSENGERS OF INSUFFICIENT BRAKE NOTIFICATION TO TRAFFIC FOLLOWING BEHIND. A REPLACEMENT LED LAMP WILL SUFFER THE SAME FATE BASED ON THE ANGLE OF THE LAMP POSITIONED FACING THE DIRECT HEAT OF THE SUN. I WAS IN MOTION AND PULLED OVER BY LE BECAUSE THE LAMP WAS OUT BUT WORKED INTERMITTENTLY WHILE THE OFFICER AND I TESTED IT. MECHANICS INSPECTED THE LAMP AND FOUND THE SLIM CRACK ON THE LED BOARD THAT ALLOWED SHIFTING OF CONTACTS. DEALERSHIPS HAVE REPORTED THIS SLIM CRACK ON THE LED BOARD AS A COMMON PROBLEM DUE TO THE INTENSE HEAT OF THE SUN BEARING DOWN ON THE LED LAMP WHICH IS ANGLED OUT WITH NO VISOR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FACTORY RADIO TURNS OFF AND ON WITH BLINKING LIGHTS ON THE RADIO ITSELF ALONG WITH THE A/C UNIT SHUTTING DOWN AND BACK UP. THE TURN SIGNAL ALSO DO NOT MAKE ANY SOUND. SOMETIMES, IF I TURN-OFF THE CAR AND PULL THE KEY OUT AND BACK IN AND CRACK EVERTHING RETURNS AS NORMAL. ALL THE RESEARCH I'VE DONE POINTS TO THE RADIO. THEY JUST REPLACE IT WITH A AFTERMARKET. THEY DO NOT MAKE MY RADIO ANY MORE. SHOULD BE A RECALL ON THIS DEVICE.",
        "vin": "2G1FE1E30D9"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11207701,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, I WAS DRIVING DOWN MY CITY STREET WHEN ALL OF A SUDDEN I BELIEVE IT WAS A POT HOLE OR JUST UNEVEN GRAVEL LEADING MY KNEE HIT THE KEY IN THE IGNITION  AND IN THAT SECOND I HAD NO CONTROL OR CONTROL OF WHAT HAPPENED NEXT.  I COULD NOT BRAKE, MY SEAT BELT LOCKED ON ME HURTING MY COLLAR BONE, THEN MY WHEEL WAS SO HARD TO TURN I WAS USING BOTH HANDS AGGRESSIVELY TO TURN AS HARD AS I CAN JUST SO I WOULDN'T HIT A BUILDING OR CAUSE DAMAGE TO OTHERS AND AS I WAS STERLING I WOULD KEEP PRESSING THE BRAKES AND THEY WERE JUST LOCKED. I HAD TO HIT A BARRIER OF WOOD TO STOP MY CAR. THE AIRBAGS DID NOT DEPLOY AS WELL WHICH WAS VERY SCARY. I HAD NO CONTROL OF MY CAR FOR THE FIRST TIME AND IT WAS NOT MY FAULT, THIS HAS NEVER HAPPENED AND I KNOW IT'S BECAUSE OF THE KEY BEING BUMPED. MY RECALL # 14V346000 ACCIDENTAL BUMPING OF KEY IGNITION. I HAD NO IDEA THIS CAR HAD A RECALL. THE DEALERSHIP DID NOT INFORM ME EITHER. I AM NOW CAR -LESS AND HOPING TO GET SOMEWHAT TAKEN CARE OF BECAUSE IT WAS UNSAFE AND I DON'T WISH THIS ON ANYONE. VERY SCARY EXPERIENCE.",
        "vin": "2G1FC1E32D9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205012,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NUMEROUS OCCASIONS I HAVE BEEN BLINDED BY THE SUN BECAUSE OF THE USELESSNESS OF THE SMALL SUNVISOR. THIS HAS OCCURRED BOTH WITH FRONT VISIBILITY OR TRYING TO SHIELD EYES FROM THE SIDE WINDOW. MY PASSENGERS HAVE ALSO BEEN EFFECTED THE SAME WAY.  THE VISORS ARE NOT DEEP OR LONG ENOUGH RESPECTIVELY TO BE OF ANY VALUE. THIS CONCERN IS MORE SEVERE WHEN EXPRESS WAY DRIVING OR IN HEAVY TRAFFIC, WHICH I HAVE RECENTLY ENCOUNTERED AND PROMPTED THIS REPORTING.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO CUTS ON AND OFF. RADIO WON'T TURN ON ATA ALL AND WHEN RADIO IS OFF BLINKER CLICK NOISE WON'T SOUND, DOOR OPEN WON'T SOUND, AND SOUND SIGNALING YOU LEFT KEYS IN IGNITION WON'T SOUND. SOUND INDICATING REVERSE IS ENGAGED ALSO WON'T SOUND. THIS HAPPENS WHEN BECHILE IS STATIONARY AND MOVING. IT WILL RANDOMLY TURN OFF IN CITY AND HIGHWAY. A/C WILL ALSO TURN OFF WITH RADIO.",
        "vin": "2G1FE1E31D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195828,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE VEHICLE FAILED TO CHIME WHEN BOTH FRONT SEAT BELTS WERE NOT FASTENED. ALSO, THE TURN SIGNAL CHIME AND DEFROSTER WERE NOT OPERABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "2G1FE1E32D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY TWO MONTHS AGO, I NOTICED MY REAR PASSENGER FLOORBOARD SATURATED WITH WATER AFTER A RAINSTORM.  IT HAD BEEN PARKED IN THE YARD.  SINCE DISCOVERING THIS, I KEEP MY FLOOR MATS IN THE TRUNK.  SO THAT THE FLOORBOARDS ARE ALLOWED TO DRY OUT PROPERLY.  HOWEVER, THIS HAS BECOME A NUISANCE,AS I DON'T WANT TO POTENTIALLY CAUSE RUST AND/OR CORROSION TO MY FLOORBOARD.",
        "vin": "2G1FA1E36D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190545,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THERE WAS A SOFTWARE FAILURE THAT CAUSED THE SEAT BELT AND AIR BAG WARNING INDICATORS TO FLASH. MILLER CHEVROLET (21150 JOHN MILLESS DR, ROGERS, MN 55374, (763) 515-4511) STATED THAT THE ENTIRE PANEL NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 39,800.",
        "vin": "2G1FE1E3XD9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THERE WAS AN INTERMITTENT ELECTRICAL SHORT THAT CAUSED THE TURN SIGNALS NOT TO FUNCTION. IN ADDITION, THERE WAS HEAT COMING FROM THE VENTS AND THE VEHICLE STALLED MORE THAN ONCE WITHOUT WARNING. LUKE FRUIA MOTORS (2645 BARNARD RD, BROWNSVILLE, TX 78520, (956) 465-4434) WAS NOTIFIED OF THE FAILURE SEVERAL TIMES, BUT WAS UNABLE TO PROVIDE A SPECIFIC DIAGNOSIS TO PROVIDE A PERMANENT REMEDY. IN ADDITION, GILLMAN CHEVROLET BUICK GMC (1801 INDUSTRIAL WAY #1C, SAN BENITO, TX 78586, (956) 399-2491) WAS NOTIFIED OF THE FAILURE AND INDICATED THAT A DIAGNOSTIC APPOINTMENT NEEDED TO BE SCHEDULED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V346000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 27,000.",
        "vin": "2G1FA1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK IS MADE IN A FAULTY MANNER AND GETS JAMMED. IF YOU LOOK ONLINE A LOT OF PEOPLE HAVE EXPERIENCED THIS ISSUE. THE TRUNK SLAMS ON TO THE FOLDING REAR COMPARTMENT FUSE BLOCK WIRING. THIS DISCONNETS THE FUSE BLOCK WIRING AND THEN THE REMOTE TRUNK BUTTON AND DOOR TRUCK BUTTON IS RENDERED USELESS AND THE TRUNK WILL NOT OPEN UNLESS YOU CRAWL THROUGH THE BACK SEAT AND FORCE YOURSELF INTO THE TRUNK AND PULL ON THE EMERGENCY TRUNK LEVER. THIS IS NOT SAFE TO DO EVERY SINGLE TIME YOU NEED ACCESS TO THE TRUNK AND IS A FAULTY DESIGN BY CHEVROLET IF A MULTITUDE OF CHEVY CAMAROS ARE EXPERIENCING THIS ISSUE. BEFORE THIS, THE TRUNK FUNCTIONED FINE AND NOTHING WAS DONE DIFFERENTLY. THIS FAULTINESS STARTED ON ITS OWN.",
        "vin": "2G1FA1E31D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING 35 MPH, THE CONTACT STATED THAT THE AUDIO WARNING SYSTEM BECAME INOPERABLE. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT INITIALLY. THE VEHICLE WAS TAKEN TO PROGRESSIVE CHEVROLET (8000 HILLS AND DALES RD NW, MASSILLON, OH 44646, (330) 879-3697) WHERE IT WAS DIAGNOSED THAT THE AUDIO SYSTEM HEAD UNIT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 29,000.",
        "vin": "2G1FA1E31D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS LESS THAN 50,000 MILES. I RECENTLY PURCHASED IT FROM A LARGE LOCAL CHEVROLET DEALERSHIP. THE HEAT STOPPED WORKING ONE WEEK AFTER I BOUGHT IT. ONE DAY I WENT TO START THE CAR AND THE  HEATER BLEW COLD AIR. IHAD IT CHECKED AND WAS TOLD IT'S A BAD HEATER CORE. THE DEALERSHIP WILL NOT COVER IT AND THE REPAIR WILL COST OVER $1000 ON A VEHICLE THAT I'VE HAD JUST OVER A MONTH. AFTER DOING SOME RESEARCH, THIS IS A WIDESPREAD ISSUE WITH THESE CARS AND NOTHING HAS BEEN DONE TO ADDRESS IT.",
        "vin": "2G1FT1EW5D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SUDDENLY DIED WITHOUT WARNING NO SERVICE OR CHECK ENGINE LIGHTS CAR WOULD NOT RESTART I WAS BARELY MOVING AS I WAS LEAVING WORK STILL IN PARKING LOT GETTING READY TO GO THROUGH THE SECURITY GATE PEOPLE I ASK WHAT'S WRONG WITH IT SAY IT SEEMS CAR LOST COMPRESSION ONLY HAD 12599 MILES STILL WAITING FOR MECHANIC TO LOOK AT MAJORITY OF PEOPLE THINK THE TIMING BROKE",
        "vin": "2G1FS1EW1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174498,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 30 MPH, THE TURN SIGNAL FLASHER SPED UP AND THEN RETURNED TO NORMAL. ALSO, THE RADIO DID NOT TURN ON AND THE AIR CONDITIONING DID NOT WORK. THE CONTACT EXPERIENCED THE FAILURES FOR AT LEAST SIX MONTHS, WHICH BEGAN OCCURRING EVERY DAY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.",
        "vin": "2G1FE1E3XD9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER CORE LEAK- AT STARTUP AND DURING DRIVING, KEEP SMELLING ANTIFREEZE. ANTIFREEZE WAS LOW SO ADDED TO FULL MARK.  PASSENGER FLOOR BOARD WOULD BE SOAKED AFTER SOME DAYS OF DRIVING. HAD TESTS DONE TO FIND LEAK. IT IS BEING DIAGNOSED AT LEAKING HEATER CORE. FOUND OUT THE RADIATOR AND RESERVOIR WAS EMPTY OR EXTREMELY LOW.",
        "vin": "2G1FT1EW6D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST 6 MONTHS WHEN THE CAR IS ON AND DRIVING THE RADIO AND AC UNIT STARTED BLINKING ON AND OFF CONTINUOUSLY MAKING LOUD POPPING SOUNDS UNTIL THE RADIO SCREEN WENT COMPLETELY BLANK. THIS CAUSES THE TURN SIGNALS TO NOT MAKE ANY NOISES WHEN ON. THE TURN SIGNALS FLASH BUT HAVE NO SOUND, SEAT BELT CHIME DOES NOT WORK, PASSENGER AIR BAG LIGHT COMES ON AND OFF RANDOMLY.",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES AC IS NOT WORKING PROPERLY ANYMORE. IT SEEMS THE VENTS ARE STUCK AND IT WILL BLOW COLD AIR THEN SWITCH TO HOT ON ITS OWN. I AM NOT ABLE TO CONTROL THE TEMPERATURE.",
        "vin": "2G1FB1E36D9"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M CONSIDERING PURCHASING THIS VEHICLE FROM A DEALERSHIP IN LOGAN, OH. WHEN I CHECKED TO SEE IF THERE WERE REPORTED PROBLEMS WITH THE MODEL, I SEE THAT THERE ARE THOUSANDS OF COMPLAINTS CONCERNING THE AC/RADIO, CLIMATE CONTROL, TURN SIGNALS AND OTHER ASSOCIATED ELECTRICAL PROBLEMS THAT ARE COMMON TO ALL OF THESE RELATED CONSUMER COMPLAINTS THAT AS TO DATE HAS NOT BEEN ADDRESSED BY EITHER THE GM CORP. OR THE NHTSA. THE 2ND THING THAT I FOUND THERE IS INDEED A RECALL CONCERNING THE IGNITION SWITCH WITH MANY OWNERS HAVING NOT BEEN ABLE TO GET GM DEALERS TO REPAIR. ANOTHER CONCERN TO ME ABOUT THIS PARTICULAR VEHICLE, IS THAT WHEN I ENTERED THE VIN THE RESULTS ON THIS SITE STATES THAT THERE IS ZERO RECALLS ON THIS MAKE, MODEL AND YEAR. JUST WONDERING WHAT'S UP WITH THAT?",
        "vin": "2G1FE1E39D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE AIR CONDITIONER AND HEATER FUNCTIONED INTERMITTENTLY. IN ADDITION, THE INSTRUMENT PANEL LIGHTING INTERMITTENTLY ILLUMINATED WHILE DRIVING. THE CONTACT CALLED CAMPBELL CHEVROLET AT (270) 495-0711 (LOCATED AT 2151 SCOTTSVILLE RD, BOWLING GREEN, KY 42104) AND WAS INFORMED TO SCHEDULE AN APPOINTMENT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V346000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 8-4874699505. THE CONTACT WAS REFERRED TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151378,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MAIN ISSUE WHEN I SHUT THE CAR OFF, I HEARD A LOUD POP COMING FROM MY SPEAKERS..MY BOYFRIEND WAS IN THE PASSENGER SEAT AND THE AIR BAG LIGHT KEPT CHANGING FROM ON TO OFF WHEN THE CAR IS STARTED, I GET NO SEAT BELT CHIME AND THE STEREO FLASHES RAPIDLY AND GOES BLACK AND THE HEATER FAN COMES ON AND OFF I TURNED ON MY TURN SIGNAL AND NOTICED A LOUD STATIC NOISE EVERY TIME, I TURNED THE TURN SIGNAL ON.   STILL NO SAFETY BELT CHIME, STEREO AND NOW THE TURN SIGNALS MAKE NO SOUND WHEN ON. (11/05/2018) AS I STARTED MY CAR THIS MORNING THE STEREO WAS FLASHING ALONG WITH THE LIGHTS AROUND THE HEATER CONTROLS AND THE FAN WORKING INTERMITTENTLY FOR ABOUT 10 SECONDS AND THE SCREEN ON THE RADIO WENT BLACK AND HASN'T COME BACK ON. THE HEATER FAN COMES ON FOR 2 TO 3 SECONDS AND SHUTS OFF FOR 2 TO 3 SECONDS. THIS OCCURS CONTINUOUSLY UNTIL I SHUT THE CAR OFF. EVERY TIME I START IT THE SAME THINGS ARE HAPPENING. WHEN I SHUT THE CAR OFF, I CAN HEAR A BUZZING COMING FROM SOMEWHERE IN THE DASH THAT LASTS ABOUT 5 TO 7 SECONDS AND THEN STOPS FOR 5 TO 7 SECONDS. THIS WILL CONTINUE FOR APPROXIMATELY 5 MINUTES. IT DOESN'T DO IT EVERY TIME.  (11/07/2018) WHILE DRIVING HOME FROM WORK TODAY THE TRUNK OPEN LIGHT CAME ON, SO I PULLED OVER AND WENT TO THE REAR OF MY CAR AND IT WAS NOT OPEN. I PUSHED THE TRUNK OPEN BUTTON ON THE DOOR PANEL AND THE FOB SEVERAL TIMES AND IT WOULDN'T OPEN THE TRUNK. I GOT BACK IN TO THE CAR AND CONTINUED HOME AND THE LIGHT WENT OFF AND I WAS ABLE TO OPEN THE TRUNK WHEN I GOT HOME. SO AS OF TODAY, 11/13/2018 THE INFOTAINMENT SYSTEM WON'T COME ON, THE FAN FOR THE HEATER/AIR CONDITIONING COMES ON AND OFF CONTINUOUSLY. THE TURN SIGNALS FLASH BUT HAVE NO SOUND, SEAT BELT CHIME DOES NOT WORK, PASSENGER AIR BAG LIGHT COMES ON AND OFF RANDOMLY, THE TRUNK LID OPEN LIGHT RANDOMLY COMES ON",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO GOES ON AND OFF RAPIDLY . A/C GOES ON AND OFF SAME TIME AS RADIO, LOUD POPPING FROM SPEAKERS WHEN THIS HAPPENS. CAN HAPPEN WHILE DRIVING OR STOPPED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 CHEVY CAMARO 2LS COUPE. I HAVE HAD NO PROBLEMS WITH MY CAR UNTIL TWO DAYS AGO WHEN THE TEMP OUTSIDE DROPPED TO 30 DEGREES. WHEN I CRANK MY CAR THE RADIO FLICKERS AND STOPS WORKING RANDOMLY WITH LOUD POPS FROM THE SPEAKERS, THE BLINKERS STOP MAKING THE CLICKING SOUND, AND THE CLIMATE CONTROLS FLICKER AND STOP WORKING WITH THE RADIO. AS OF NOW THIS ONLY HAPPENS WHEN THE CAR IS COLD, AFTER I DRIVE IT FOR A FEW MILES IT WORKS FINE. THERE ARE THOUSANDS OF COMPLAINTS ABOUT THIS ONLINE. MILEAGE IS APPROXIMATELY 63,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO FLICKERS ON AND OFF DISRUPTING MUSIC AND HEATING/COOLLING SYSTEM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL DEVICE AIRBAG LIGHT IS ON INDICATING AN ISSUE WITH THE AIR BAG NO FORMAL RECALL WAS DONE ON THESE CAMAROS FOR AIRBAG DEFECTS THERE WAS A LAWSUIT AGAINST GM BEFORE FOR THIS ISSUE EXPENSIVE TO FIX AND SCARY. HAD MY CAR SINCE JANUARY AND YESTERDAY I TURNED ON MY CAR TO DRIVE AND THE 'SERVICE AIRBAG' LIGHT CAME ON",
        "vin": "2G1FA1E38D9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVY CAMARO LS 3.6L V6 SIDI    MY PROBLEM STARTED IN FEBRUARY 2018 THESE ARE THE FOLLOWING ISSUES BELOW:    1.MY GEAR SHIFT WILL COME OUT OF SECOND GEAR WHILE I AM SHIFTING DURING TAKEOFF ON MY DRIVE. THIS HAS BEEN TAKING PLACE SINCE LAST JULY AFTER THE WARRANTY RAN OUT AT AROUND 28,000 MILES.  2.COME FEBRUARY 2ND THIS YEAR MY RADIO STARTED CONTINUOUSLY POWERS OFF AND ON AND PROGRESSIVELY GOTTEN WORSE. NOW AT THIS POINT THIS IS CAUSING INTERMITTENT PROBLEMS WITH MY A/C, BLINKERS, SEAT BELT ALARM AND LIGHTS.  3.NOW THE RADIO CONSTANTLY POWERING OFF AND ON EVEN WHEN I AM FINISHED DRIVING AND THE CAR IS PARKED AND LOCKED UP WITH THE FACTORY ALARM ACTIVATED THIS HAS BEEN HAPPENING FOR THE LAST MONTH AND A HALF. (TODAY IS MAY 30, 2018).  4.NOW I AM HAVING ISSUES WITH THE BATTERY MAINTAINING ENOUGH CRANKING AMPS TO START MY CAR AFTER SITTING FOR TWO DAYS.   5.LASTLY THIS IS A SERIOUS ISSUE WITH ALL THE ISSUES THAT ARE LINKED TO THIS ONGOING ISSUE FOR MULTIPLE OWNERS. I HAVE BEEN RESEARCHING THIS ISSUE FOR MONTHS NOW BUT AS IT KEEPS PROGRESSING IT IS BECOMING A SAFETY ISSUE FOR THE OWNERS OF THESE VEHICLES.  6.FINAL NOTE IF YOU HAVE AN EPILEPTIC DRIVER AND THEY MIGHT HAVE TO DRIVE AT NIGHT ON A DARK HIGHWAY LET'S HOPE THAT THE BRIGHT FLASHING DISPLAY FROM THE RADIO CONSTANTLY TURNING OFF AND ON DOES NOT CAUSE THEM TO HAVE A SEIZURE. I KNOW THAT IT IS VERY DIFFICULT FOR ME TO DRIVE WHEN MY DISPLAY IS CONSTANTLY GOING OFF AND I AM UNABLE TO MAKE IT STOP SO MY EYES ARE HAVING TO CONSTANTLY ADJUST TO INTERIOR LIGHTS THAT MAKE YOU FEEL AS IF YOU ARE AT A DISCO.",
        "vin": "ZG1FE1E37D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "04/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONVERTIBLE LEAKS INTO THE REAR FLOOR PAN (DRIVER/PASSENGER)    LEAK OCCURS WHEN VEHICLE STATIONARY.    HTTPS://WWW.YOUTUBE.COM/WATCH?V=OA9CMPHABAS    HTTPS://WWW.FACEBOOK.COM/GROUPS/226942550693692/PERMALINK/1110083875712884/    HTTPS://GM.OEMDTC.COM/6165/WATER-LEAK-IN-REAR-FLOOR-AREA-2011-2015-CHEVROLET-CAMARO-CONVERTIBLE/2",
        "vin": "2G1FB3D32D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091986,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO SYSTEM- MYLINK  HAD TO BE REBOOTED TWICE SINCE PURCHASING THE VEHICLE. FIRST TIME UNDER WARRANTY, SECOND TIME OUT OF WARRANTY AND HAD TO PAY $125 DIAGNOSTIC FEE FOR DEALER TO SIMPLY UPLOAD AN UPDATE THAT TOOK 10 MINUTES.    VEHICLE WAS STATIONARY IN BOTH INSTANCES.",
        "vin": "2G1FB3D32D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091252,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIO, DASH LIGHTS, AND CLIMATE CONTROL PANEL FLASHES ON AND OFF THEN MAKES A POP SOUND. THE RADIO DOES NOT WORK, AND THE HEAT & AC WORKS INTERMITTENTLY. THIS HAPPENS WHEN THE VEHICLE IS SITTING STILL OR MOVING.",
        "vin": "2G1FA1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I HEARD A LOUD POP FROM MY SPEAKERS. MY RADIO WENT BLACK, MY LEFT BLINKER STOPPED WORKING, AND MY HEATER AND AC UNIT WENT OUT AT THE SAME TIME AS MY RADIO. NOT ONLY AM I DISAPPOINTED, BUT FRUSTRATED BECAUSE I BELIEVE THERE IS NOTHING THAT CAN BE DONE ABOUT THIS ISSUE FROM THE DEALER. NOW MY RADIO GOES IN AND OUT WHENEVER IT WANTS, ALONG WITH MY AC/HEATER AND MY BLINKER BLINKS EXTREMELY SLOWER THAN USUAL. I AM A HUGE FAN OF CHEVY'S AND NEVER EXPERIENCED A PROBLEM LIKE THIS ONE ON ANY VEHICLE I'VE OWNED. I WAS TOLD THAT ALL OF THESE ISSUES ARE RELATED BECAUSE THE AC/HEATER UNIT IS CONNECTED TO THE RADIO AND THE ONLY WAY IT CAN BE FIXED IS THROUGH THE DEALER. HOWEVER, AS I CONTINUE TO READ OTHER CONSUMERS COMPLAINTS, THE DEALERSHIPS DO NOT HAVE AN ACCURATE FIX. I HAVE BEEN REALLY GOOD WITH KEEPING UP THE MAINTENANCE ON MY VEHICLE, BUT THIS EXPENSE IS SOMETHING I CANNOT AFFORD RIGHT NOW, AS A SINGLE PARENT WITH A CHILD IN COLLEGE! I ALSO SEE THAT I'M NOT THE ONLY OWNER WITH THIS ISSUE. I AM SURPRISED THAT THERE HASN'T BEEN A RECALL AS ONE IS DEFINITELY NEEDED OR CHEVY NEEDS TO TAKE MORE PRIDE IN THEIR VEHICLES AND CREATE MORE QUALITY ONES. I WOULD NOT RECOMMEND THAT ANYONE PURCHASE A CHEVY CAMARO ESPECIALLY WITH THESE HORRIFYING ISSUES. I WILL CONTACT THE CEO OF GM AND VOICE MY COMPLAINT AS WELL. IF ANYONE KNOWS OF A SIMPLE FIX, PLEASE HELP! A LOYAL, YET DISSATISFIED CAMARO OWNER!",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO, A/C, TURN SIGNALS TURN ON AND OFF INTERMITTENTLY, WHEN CAR IS TURNED ON.",
        "vin": "2G1FA1E36D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED WHILE STARTING THE VEHICLE, THE RADIO WAS TURNED ON BUT FAILED TO PLAY MUSIC, THE HEAT WAS TURNED ON BUT BLEW OUT COLD AIR, THE AIR CONDITIONER WAS TURNED ON BUT BLEW OUT HOT AIR. ADDITIONALLY, THE LEFT AND RIGHT TURN SIGNALS WERE NOT MAKING THE CLICKING NOISE WHILE IN THE ON POSITION. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND OPENED CASE 8-4029973651 AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 57,500.",
        "vin": "2G1FE1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080773,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "6 MONTHS AGO MY INFOTAINMENT SCREEN STARTED FLASHING AND THE CD WOULD OCCASIONALLY POP OUT OF THE PLAYER ON ITS OWN. THE MUSIC WOULD TURN ITSELF OFF THEN COME BACK ON, STARTLING ME AS IT WOULD BE ACCOMPANIED BY A LOUD STATIC OR POPPING SOUND. IT STARTED OFF INTERMITTENTLY, THEN THE SCREEN WENT COMPLETELY BLACK AND THE MUSIC STOPPED WORKING COMPLETELY EXCEPT FOR THE CONSTANT BUZZING/STATIC SOUND ACCOMPANIED BY CLICKING AS THOUGH SOMETHING IS TRYING TO TURN ON. THE SCREEN AND THE MUSIC OCCASIONALLY MAKE A SURPRISING APPEARANCE, USUALLY AFTER I'VE COME TO A STOP, ROLLED MY WINDOW DOWN OR USED THE TURN SIGNAL. WHICH BRINGS ME TO THE NEXT THING, THE AIR CONDITIONING SYSTEM. TO THIS DAY IT COMES ON AND OFF AT ITS LEISURE, INCLUDING THE FRONT AND REAR WINDOW DEFROST. MY BLINKERS NO LONGER MAKE THE SOUND TO ALERT ME THAT THEY ARE ON. ON A FEW OCCASIONS MY DRIVERS SIDE WINDOW HAS FAILED TO OPERATE. I ASSUME ONE DAY THAT WILL BE ALSO BE INOPERATIVE BASED ON PREVIOUS TRENDS. I CANCELLED MY SUBSCRIPTION TO ONSTAR SINCE I HAVE NO ACCESS TO THE FEATURES ANY LONGER. THIS MEANS I NO LONGER HAVE NAVIGATION, ACCESS TO EMERGENCY SERVICES, HANDS FREE CALLING OR EVEN ROADSIDE ASSISTANCE. I NO LONGER HAVE THE ABILITY TO REMOTE ACCESS MY VEHICLE WHICH WAS ONE OF THE MAIN SELLING POINTS. NOW PLEASE IMAGINE TAKING  AN UNCOMFORTABLY SILENT RIDE WITH ME AND THEN ALL OF THE SUDDEN A CD THAT WASN'T PLAYING POPS OUT AND THE AIR CONDITIONER KEEPS GOING ON AND OFF, ALL WHILE THE CAR SOUNDS LIKE ITS ABOUT TO EXPLODE. I'VE RESEARCHED ONLINE AND FOUND COUNTLESS SITES WITH NUMEROUS OWNERS STATING THAT THEY ARE EXPERIENCING THE SAME PROBLEMS. ADD ANOTHER 5000 OR SO CHARACTERS TO THIS COMPLAINT BOX AND I WILL GLADLY COPY AND PASTE THOSE OWNERS' STORIES FOR YOU TO CONSIDER AS WELL. CHEVROLET/GM SAY THAT THIS IS MY ISSUE ALONE. I BELIEVE THIS SHOULD HAVE BEEN A RECALL YEARS BEFORE I PURCHASED MY VEHICLE",
        "vin": "2GIFA1E37D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057240,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE, POWER STEERING QUIT WORKING. VEHICLE WAS VERY HARD TO STEER AND PULLED INTO ANOTHER LANE. LUCKILY, NO CARS WERE NEAR.  WE MANAGED TO GET HOME AND TOOK TO LOCAL CHEVROLET DEALER. THEY RESET IT AND POWER STEERING WORKED FOR A WHILE. DROVE THE CAR FOR APPOXIMATELY  60 MILES AND IT HAPPENED AGAIN ON A 2 LANE ROAD IN MIDDLE OF TURN. ALMOST WRECKED. VEHICLE ONLY HAS 8700 MILES ON IT, BUT BECAUSE OF YEARS, WARRANTY IS OUT. 8700 MILES!!!  WHEN I CONTACTED GM OVER ABOUT A MONTH SEVERAL TIMES, THEY FINALLY TOLD ME THEY WOULD NOT FIX IT. I ALSO HAVE A 2014 SILVERADO THAT HAD A RECALL FOR THE SAME PROBLEM. MY DAUGHTER HAS A 2017 COLORADO THAT THE POWER STEERING WENT OUT ON TODAY. IT IS STILL UNDER WARRANTY. PLEASE INVESTIGATE THIS PROBLEM. WHEN I CHECKED OUT PROBLEMS ONLINE, I FOUND SEVERAL OTHER PEOPLE HAVE HAD THE SAME PROBLEM.",
        "vin": "2G1FS3DW1D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052649,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 CHEVROLET ZL1 CAMARO WITH 76500 MILES.  IN THE PROCESS OF MAKING A RIGHT TURN, THE ELECTRIC POWER STEERING ASSIST FAILED, CAUSING LOSS OF STEERING CONTROL. THE VEHICLE WAS TOWED  TO MY LOCAL DEALERSHIP.  CHEVROLET SAID THIS WAS NOT A WARRANTY ITEM AND THE REPAIR WOULD BE AN OUT OF POCKET EXPENSE.  CHEVROLET WANTED $2,791.00 TO REPAIR THIS PROBLEM.",
        "vin": "2G1FZ1EP6D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035960,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SHARK FIN ANTENNA HAS VERY POOR RECEPTION, CAUSES ONSTAR TO LOSE CONNECTION OFTEN IN PLACES IT SHOULDN'T AS WELL AS NAVIGATION THROUGH RADIO TO NOT WORK WHEN IT SHOULD AND RADIO,XM,ETC. DEALER SAID IT WAS A COMMON THING IN THE CAMARO SHARK FIN. HAPPENS VERY OFTEN FROM THE DAY I PURCHASED THE CAR TO PRESENT",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SLOWED DOWN WHILE DEPRESSING THE ACCELERATOR PEDAL, THE INSTRUMENT PANEL LOST POWER, AND THE RADIO AND AIR CONDITIONER STOPPED WORKING. THE CONTACT TOOK THE VEHICLE TO CAPITOL CHEVROLET OF COLUMBIA (111 NEWLAND RD, COLUMBIA, SC 29229 (855) 935-0359) WHERE IT WAS DIAGNOSED WITH INTERNAL FAILURE AND THE CABLE WIRES NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE FAILURE WAS A KNOWN ISSUE; HOWEVER, THE VIN WAS NOT INCLUDED IN A RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 58,000.",
        "vin": "2G1FA1E37D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "08/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING EVENT(S), VEHICLE WAS IN MOTION AND STOPPED. WHEN A PASSENGER IS SITTING IN THE PASSENGER FRONT SEAT, THE AIR BAG DOES NOT TURN ON. AT LEAST THE LIGHT FOR THE AIR BAG STAYS IN THE OFF POSITION. THIS HAPPENS NO MATTER WHAT. THIS COULD HAVE BEEN HAPPENING FOR A VERY LONG TIME, I JUST NOW NOTICED IT.",
        "vin": "2G1FE1E30D9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE ATTEMPTING TO SECURE THE FRONT DRIVER SIDE SEAT BELT, THE BUCKLE MALFUNCTIONED AND WOULD NOT PROPERLY LOCK. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 102,000.",
        "vin": "2G1F81E3X09"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "08/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TPMS SYSTEM. MULTIPLE OCCASIONS. MOVING. SERVICE TIRE PRESSURE SYSTEM IS DISPLAYED WHEN TIRE PRESSURE FALLS BELOW 32 PSI OR GETS INTO A CERTAIN RANGE AS SOMETIMES WILL REAPPEAR BELOW 30 PSI AND SOMETIMES WILL NOT.  THE TIRE PRESSURE DISPLAY WILL ONLY SHOW DASHES AND NOT A PRESSURE.  I HAVE BEEN TOLD ON MORE THAN ONE OCCASION THAT IT IS NORMAL OPERATION BY DEALERS.  IT SHOULD NOT BE THAT WAY, AS YOU DON'T KNOW IF THERE IS A LEAK OR IF THE SYSTEM  TRULY NEEDS SERVICED.",
        "vin": "2G1FZ1EP1D9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING INTO A PARKING LOT, MY POWER STEERING WENT OUT AND THE SERVICE POWER STEERING MESSAGE APPEARED. IT HAS HAPPENED MULTIPLE TIMES SINCE THEN. IT ONLY HAPPENS AT LOW SPEED MANEUVERING (<12MPH).  THE FOLLOWING HAPPENS ONCE THE PROBLEM IS CREATED:  POWER FLICKERS ON THE CAR; THE AC RESETS, RADIO RESETS, POWER STEERING GOES OUT, AND THE FOLLOWING MESSAGES DISPLAY: \"SERVICE POWER STEERING\" \"SERVICE STABILITY CONTROL\" AND \"OPEN AND CLOSE PASSENGER WINDOW\".    I TOOK THE VEHICLE TO THE CHEVROLET DEALER, AND THEY TOLD ME THE ELECTRIC STEERING ASSEMBLY NEEDS TO BE REPLACED. I'VE RESEARCHED THIS PROBLEM ONLINE AND IT IS FAIRLY COMMON BETWEEN 2012-15 CAMAROS'.       LUCKILY, I HAVE THE ABILITY TO REMAIN CALM AND CONTROL THE CAR WHEN THIS HAPPENS. I AM NOT SO SURE OTHERS WILL HAVE THE SAME FATE AS I DID.     HERE IS A FORUM POST WITH MOST OF THE COMPLAINTS CONSOLIDATED:  [XXX]    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2G1FZ1EP0D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, I NOTICED THE CAR STARTED PULLING IN ONE DIRECTION AND THEN THE A COMPLETE LOSS OF THE ELECTRIC POWER STEERING. THE VEHICLE DISPLAYED \"SERVICE POWER STEERING\"  THIS IS COMPLETLY UNSAFE TO HAVE THE CAR PULL IN ONE DIRECTION AND NOT TO MENTION THERE IS ONLY 19,000 MILES ON THE CAR. THERE ARE NUMEROUS COMPLAINTS ON THIS ISSUE BUT GM STILL REFUESES TO TAKE ACTION. ONLY IN THE EVENT OF A DEATH WILL THE ACT.",
        "vin": "2G1FZ1EP1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "07/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DELAY TO THE RADIO WHEN I START MY CAR. THE RADIO IS CONSTANTLY TURNING OFF AND ON. THE LIGHTS ON THE RADIO KEEP FLICKERING. DUE TO WHATEVER ELECTRICAL ISSUES ARE HAPPENING WITHIN THE RADIO THE TIME IS NOT STAYING CURRENT. THIS IS HAPPENING WHEN I AM STARTING AND TURNING MY VEHICLE OFF. MY CONCERN IS WHETHER OR NOT THE ELECTRICAL ISSUES ARE CONTAINED WITHIN THE RADIO OR IF THEY ARE SPREAD THROUGHOUT THE VEHICLE, AND I FEAR THAT MY CAR WILL LOSE POWER WHILE I AM DRIVING.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO NOT WORKING SCREEN BLACK. UNABLE TO HEAR TURN SIGNALS WHEN ON. AIR CONDITIONER COMING ON AND OFF INTERMITTENTLY AS THOUGHT THERE IS AN ELECTRICAL SHORT.",
        "vin": "2G1FA1E33D9"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "06/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010371,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING STALLING AND VEHICLE SHUT OFF ON MY 2013 CHEVY CAMARO I HAVE TAKEN IT TO THE DEALER 3 TIMES NOW AND THEY ARE UNABLE TO FIND THE PROBLEM. IT SEEMS TO HAPPEN DURING EXTREME HEAT TEMPERATURES DURING THE SUMMER MONTHS PARTICULARLY. I HAVE NOTICED THAT NISSAN IS HAVING SIMILAR PROBLEMS WITH THEIR NISSAN VERSA'S AND NISSAN SENTRAS AS IT WAS AIRED ON CHANNEL 13 ACTION NEWS. I HAVE REACHED OUT TO GM TWICE ABOUT THIS PROBLEM WITH NO HELP ALTHOUGH THEY ARE AWARE THAT MANY PEOPLE ARE HAVING THE SAME PROBLEM WITH THEIR VEHICLES. I NEED TO START A CLASS ACTION SUIT. CAN YOU HELP ME?",
        "vin": "2G1FB1E38D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING 70 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND HEARD A RATTLING NOISE. THE CONTACT INSPECTED THE VEHICLE AND FOUND THAT THE BRAKE CYLINDER BOLT BECAME LOOSE. THE CONTACT SPOKE WITH THE DEALER (SUBURBAN CHEVROLET 12475 PLAZA EDEN PRAIRIE, MINNESOTA 12475 877-350-6609). THE DEALER WANTED TO CHARGE THE CONTACT FOR DIAGNOSTIC TESTING. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V069000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 32,000.",
        "vin": "2G1FE1E34D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE EPS WARNING INDICATOR KEPT ILLUMINATING AND THE STEERING WHEEL SEIZED. THE VEHICLE WAS TAKEN TO THE FIRST DEALER (MYRTLE BEACH CHEVROLET 1785 US-501, MYRTLE BEACH, SC 29577 (843) 407-0656) WHERE THE RACK AND PINION WERE REPLACED TWICE, BUT THE FAILURE CONTINUED. A SECOND DEALER (BIG COUNTRY CHEVROLET 109 S MAIN ST, HEMINGWAY, SC 29554 (843) 558-2571) REPLACED THE RACK AND PINION, REPLACED THE BATTERY, AND CHECKED THE WIRING. NEITHER OF THE TWO DEALERS WERE ABLE TO REPAIR THE VEHICLE. THE VEHICLE HAD BEEN TAKEN BACK AND FORTH TO THE TWO DEALERS MORE THAN EIGHT TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND PROVIDED NO SOLUTION OTHER THAN REPLACING THE SAME OEM PARTS, WHICH FAILED MORE THAN TWICE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 54,665.",
        "vin": "2G1FJ1EJ0D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954180,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DELAY TO THE RADIO WHEN I START MY CAR.  THE RADIO IS CONSTANTLY TURNING OFF AND ON.  THE LIGHTS ON THE RADIO KEEP FLICKERING.  DUE TO WHATEVER ELECTRICAL ISSUES ARE HAPPENING WITHIN THE RADIO THE TIME IS NOT STAYING CURRENT.  THIS IS HAPPENING WHEN I AM STARTING AND TURNING MY VEHICLE OFF.  MY CONCERN IS WHETHER OR NOT THE ELECTRICAL ISSUES ARE CONTAINED WITHIN THE RADIO OR IF THEY ARE SPREAD THROUGHOUT THE VEHICLE, AND I FEAR THAT MY CAR WILL LOSE POWER WHILE I AM DRIVING.",
        "vin": "2G1FE1E3XD9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10930035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 CHEVROLET CAMARO. WHILE DRIVING 40 MPH IN THE RAIN, THE VEHICLE HYDROPLANED AND CRASHED INTO A WALL. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THERE WERE MINOR INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A DEALER WHERE GM ENGINEERS DIAGNOSED THAT, DUE TO THE SLOW CRASH, THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "2G1FB1E37D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED A FEW WEEKS AGO THE HEAT WOULDN'T HEAT AND THE HEAT AND RADIO WOULD TURN OFF AND ON THIS HAPPENS EVERYTIME YOU GET IN THE CAR. WINTER IS HERE AND WITHOUT A HEATER THAT IS NOT SAFE!! THIS HAPPENS IF THE CAR IS IN MOTION, STATIONARY CITY STREETS AND ON HIGHWAY PLEASE HELP!!!!",
        "vin": "2G1FA1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING VARIOUS SPEEDS WITH EITHER TURN SIGNAL ACTIVATED, THE SPEAKERS ACTIVATED LOUDLY WITHOUT WARNING. ALSO THE CONTACT OBSERVED THAT THE RADIO MALFUNCTIONED AND THE AIR CONDITIONER UNIT ACTIVATED ON ITS OWN AND WOULD NOT TURN OFF. THE VEHICLE WAS NOT TAKEN TO A DEALER OR DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 53,000.",
        "vin": "2G1FA1E30D9"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN A LOCAL ROADWAY MAKING A LEFT TURN THE TILT STEERING WHEEL LOCKING LEVER FELL OUT OF POSITION AND HIT MY LEG WHILE I WAS ATTEMPTING TO SHIFT GEARS. THE SURPRISE OF AN UNEXPECTED OBJECT STRIKING MY LEG RESULTED IN MISSING THE SHIFT AND GRAZING A CURB WHICH RESULTED IN DAMAGE TO MY RIGHT FRONT TIRE AND WHEEL. UPON STOPPING, THE LEVER WAS UNABLE TO BE PUSHED BACK INTO PLACE AND WAS EASILY REMOVED FROM THE STEERING COLUMN WITHOUT THE USAGE OF TOOLS. VEHICLE WAS TAKEN TO CHEVROLET DEALER WHERE I WAS TOLD THAT THE ONLY WAY TO FIX THIS WAS TO REPLACE THE ENTIRE STEERING COLUMN, SERVICE DEPARTMENT AGREED THAT THIS WAS NOT A WEAR & TEAR ISSUE ON THE MECHANISM, BUT THAT THEY HAVE NO INFORMATION ON A PROBLEM WITH THIS ITEM. CAMARO AND OTHER CHEVY FORUMS SHOW THIS IS NOT AN ISOLATED INCIDENT.",
        "vin": "2G1FG1E37D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882193,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2013 CAMARO, MAKING A RIGHT TURN ON MY CAR MY KEYS WERE BUMPED BY MY KNEE AND THE CAR JUST STALLED. THANKFULLY ONLY I WAS INVOLVED AND NO ONE COMING FROM THE OPPOSING WAS HURT AS I ENDED UP IN A TRAIN TRACK MEDIAN WITH SOME DAMAGE ONLY TO MY CAR. I DRIVE WITH THE FEAR THAT THIS COULD HAPPEN AGAIN AND THE SIMPLE FACT THAT THEY REMOVED THE KEY FROM THE FLIPKEY/CONTROL DOES NOT SOLVE THE ISSUE. I HAVE EXPERIMENTED WITH DIFFERENT CARS BY PURPOSEDLY BUMP MY KEYS AND NONE STALLED WITH AS LITTLE FORCE AS THE ONE ASSERTED ONTO THE CAMARO. THIS IS A TERRIBLE DESIGN AND ENGINEERING FLAW THAT NEEDS A BETTER SOLUTION THAN THEIR FIX.",
        "vin": "2G1FB3D34D9"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873153,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BROUGHT THIS VEHICLE TO THE GM REPAIR FACILITIES ON MULTIPLE OCCASIONS FOR AN ISSUE THAT I FIND UNSAFE AND UNSETTLING. AS THE VEHICLE IS TRAVELLING ABOVE 50 MILES PER HOUR OR GREATER IT WILL MAKE AN UNCOMMANDED RIGHT OR LEFT TURN SOMETIMES ACCOMPANIED WITH A FLASHING TRACTION CONTROL LIGHT.     THE LATEST EXCUSE I RECEIVED FROM A DEALER IN FLORIDA WAS THAT \"GENERAL MOTORS\" STATES THIS IS ACCEPTABLE AND IS TROUGHING. THE EXPLANATION WOULD BE REASONABLE IF THE TENDENCY TO TURN WAS MINOR. THIS TENDENCY TO TURN IS HARD AND 90 DEGREES. I HAVE PAID TO HAVE EVALUATIONS COMPLETED ON THE ALIGNMENT AND THE TIRES HAVE WORN UNEVENLY / ON THE OUTER EDGES, BUT THE REPORTS INDICATE THE ALIGNMENT HAS BEEN GOOD. THE ROAD WAYS ARE TYPICALLY STRAIGHT AND LEVEL AND MOISTURE HAS NOT BEEN A FACTOR. MY WIFE AND I ARE BOTH DRIVERS OF THE VEHICLE AND HAVE BOTH EXPERIENCED THE ISSUE AND THE TECHNICIANS AT THE DEALERS HAVE REPORTEDLY EXPERIENCED THE ISSUE AS WELL BUT DID NOT LOCATE A CAUSE OF FAILURE. ONCE THE DEALER CONTACTED GM THE ISSUE WAS CONSIDERED ACCEPTABLE BY SOMEONE ON THEIR END.",
        "vin": "2G1FB1E37D9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS BEEN AN ONGOING ISSUE SINCE 41,000 MILES. (FEB 2015) AFTER DRIVING A FEW MILES IN A DAY, YOU CAN FEEL A CHANGE IN THE VEHICLE DRIVE AND THE RPMS REDUCE TO UNDER \"2\" AND THEN DOWN TO \"1\", THE CAR THEN DISPLAYS THE \"!\" \"REDUCED ENGINE POWER\" WARNING.  3 EMERGENCY LIGHTS COME ON AND THE CHECK ENGINE LIGHT COMES ON. WHEN SAFE, I PULL OVER AND TURN THE EMERGENCY LIGHTS ON, TURN THE CAR OFF, WAIT A FEW MINUTES AND THEN RESTART THE CAR.  FOR A FEW SECONDS THE \"STABILTRAK\" WARNING LIGHT COMES ON.  THE CAR THEN DRIVES SLUGGISH AND WILL NOT GO OVER A 40 TO 60 MILES SPEED.  THIS CONTINUES TO GO ON EVERY 3 TO 5 MILES.  WE HAVE BEEN TAKING THE CAR TO DEALER AND THEY HAVE REPLACED A CONNECTOR, WIRING HARNESS AND A ECM MODULE. AFTER A FEW MILES OF DRIVING THE SAME SITUATION OCCURS.  THIS LAST TIME WHEN I SAFELY PULLED OVER TO A SIDE STREET AND TURNED ON THE EMERGENCY FLASHERS IN THE EARLY MORNING HOURS A CAR ALMOST REAR-ENDED MY VEHICLE.  THE REDUCED SPEED WHILE DRIVING ON THE FREEWAY IS CAUSING A FRIGHTENING DRIVING EXPERIENCE BECAUSE OTHER DRIVERS DO NOT REALIZE THAT MY CAR IS EXPERIENCING ENGINE REDUCED SPEEDS THAT I HAVE NO CONTROL OF AND I CANNOT EXIT THE FREEWAY UNTIL AN EXIT RAMP IS AVAILABLE.  I DO NOT FEEL SAFE PULLING OFF TO THE SIDE OF THE FREEWAY DUE TO THE RE-ENTERING ONTO THE FREEWAY WITH DISRESPECTFUL DRIVERS WHO CAUSE LIFE THREATENING ISSUES. RESEARCHING THE ISSUE ON LINE IT SEEMS THERE ARE TOO MANY WITH THE SAME ISSUES.  I DID READ THAT THE ONSTAR SYSTEM MAY BE CAUSING THE CONFLICT??? THIS ISSUE HAS BECOME VERY TIME CONSUMING AND EXPENSIVE WITH THE MISSING OF WORK. HOW DO WE GET THIS CORRECTED.  IT STARTED AT 41,000 MILES AND WE NOW HAVE 91,000 MILES.  WE DO HAVE A PREMIUM EXTENDED WARRANTY TO 125,000 MILES.  THE WARRANTY COMPANY SAID THAT GENERAL MOTORS SHOULD / MUST CORRECT THIS ISSUE AND IT IS A KNOWN ISSUE.",
        "vin": "2G1FA1E37D9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL STREET DRIVING, METAL ON METAL NOISE FROM FRONT WHEELS.  APPLY BRAKE, NOISE STOPS.  RELEASE BRAKES, NOISE BEGINS AGAIN.   DEALERSHIP STATES BRAKE PADS HAVE ABOUT 8-10MM LEFT ON THEM.   THREE TIMES AT HIGHWAY SPEEDS (65-75 MPH) SERVICE STABILITRAK WARNING LIGHT COMES ON AND TRACTION CONTROL LIGHT, LIMITED SLIP LIGHT COMES ON.  NO METAL ON METAL NOISE WHEN STABILITRAK FAILING.  PARK OVERNIGHT, CAR START IN MORNING, STABILITRAK IS WORKING AGAIN.  METAL ON METAL NOISE IS HEARD AT ALL SPEEDS FROM FIRST START TILL SHUT DOWN FOR NIGHT.",
        "vin": "2G1FK1EJ8D9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE PARKED, HE NOTICED THE WARNING LABELS ON THE VISORS WERE PEELING OFF. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 2,700.",
        "vin": "2G1FZ1EP2D9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "11/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS LESS THAN A WEEK APART THE VEHICLE ENGINE, WHILE IN MOTION AT HIGHWAY SPEED (70 MPH) AFTER APPROXIMATELY TEN HOURS OF OPERATION, STOPPED RUNNING. THE VEHICLE SERVICE ENGINE SOON LIGHT CAME ON AND THE CARS AUTOMATIC TRANSMISSION DOWNSHIFTED. THE CAR WAS GUIDED TO THE SHOULDER OF THE HIGHWAY ON BOTH OCCASIONS. A RESTART WAS ATTEMPTED WHILE ON THE SHOULDER. THE ENGINE WOULD TURN OVER BUT WOULD NOT RUN. ROADSIDE ASSISTANCE WAS REQUESTED AND A TOW WAS PERFORMED TO THE NEAREST DEALER.     THE DEALER IN THE FIRST INSTANCE STATED THAT THE ERROR CODE WAS FOR THE FUEL PUMP. THE PUMP WAS ORDERED BUT BEFORE ARRIVING, THE DEALER DISCOVERED FRAYED WIRE AND MADE UNSPECIFIED REPAIRS.     IN THE SECOND INSTANCE, THE CODE WAS GONE WHEN THE DEALER SCANNED THE SYSTEM. NO REPAIRS WERE MADE.",
        "vin": "2G1FK1EJ8D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET CAMARO.  CONSUMER WRITES IN REGARDS TO VEHICLE CLUTCH PEDAL BULLETIN ISSUES.  *SMD  THE CONSUMER TOOK THE VEHICLE TO THE DEALER TO CORRECT A CLUTCH PROBLEM THAT HAD NOT EXISTED THE PREVIOUS THREE YEARS. THE PROBLEM INVOLVED THE CLUTCH PEDAL NOT RECOVERING DURING GEAR SHIFTS. INSTEAD, THE PEDAL REMAINED VIRTUALLY STATIONARY HALFWAY THROUGH WHAT SHOULD HAVE BEEN A TOTAL RECOVERY.  THIS PROHIBITED THE CONSUMER FROM SHIFTING GEARS.  *JB",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2015",
        "dateOfIncident": "07/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR WHEEL VALVE STEMS STARTED LEAKING AT THE BASE. ONE REPLACEMENT HAS LEAKED SINCE. A TOTAL OF FIVE 2013 CAMARO STEEL WHEEL RUBBER VALVE STEMS.",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "01/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT OUT TO MY GARAGE & STARTED MY CAMARO SS TO GO TO WORK.  THE DRIVER INFORMATION CENTER DISPLAYED A MESSAGE ADVISING THE POWER STEERING REQUIRED SERVICE.  THE CAR WAS NEARLY IMPOSSIBLE TO TURN AND I DIDN'T FEEL SAFE DRIVING IT 30+ MILES TO THE DEALER.   I HAD THE CAR TOWED (NO COST TO ME) TO ROGERS-DABBS CHEVROLET, BRANDON MS, FOR SERVICE.  I WAS TOLD SINCE THEY COULD NOT GET THE CAR TO  HAVE THIS ISSUE THEY COULDN'T IDENTIFY THE SOURCE OF THE PROBLEM SO THEY COULDN'T FIX IT.  I HAD THE SAME PROBLEM 15 MONTHS LATER AND THE DEALER STILL HAS NOT IDENTIFIED THE PROBLEM, NOR WILL THEY TRY.  I WAS TOLD THEY \"ARE NOT MAGICIANS\" SO THEY CAN'T FIX WHAT'S NOT SHOWING UP AS AN ISSUE WHEN THE CAR IS WITH THEM.",
        "vin": "2G1FJ1EJ7D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT'S KNEE STRUCK THE SHIFT PANEL WHILE DRIVING. AS A RESULT, THE VEHICLE DOWNSHIFTED, THE ENGINE REVVED, AND THE ENGINE RPMS INCREASED. THE FAILURE OCCURRED WHEN GOING OVER A BUMP OR WHEN THE CONTACT'S KNEE ENCOUNTERED THE SHIFT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN TWICE WHERE THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/15/2015",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10694357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 35 MPH AND CHANGING FROM RIGHT LANE TO LEFT LANE POWER STEERING FAILED CAUSED CAR TO CROSS MEDIAN INTO LANES ON THE OTHER SIDE OF THE STREET STRIKING FIRE HYDRANT AND CURB.    *TR",
        "vin": "2G1FC1E39D9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/27/2015",
        "dateOfIncident": "10/26/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "10/26/2012 - PULLING INTO PARKING SPACE AT LOW SPEED. CAR SUDDENLY ACCELERATED.  I ASSUMED THAT SOMEHOW IT WAS MY FAULT.  IMPACTED A SECOND VEHICLE.  02/23/2015 - EXACT SAME THING.  PULLING INTO PARKING SPACE AT LOW SPEED.  CAR SUDDENLY ACCELERATED.  I WAS ABLE TO SLAM ON THE BRAKES AND PREVENT A COLLISION.     I GOOGLED \"CAMARO UNINTENDED ACCELERATION\" AND FOUND A VIDEO CLIP OF ANOTHER PERSON APPEARING TO HAVE THE SAME PROBLEM.  HTTP://WWW.TUNDRAHEADQUARTERS.COM/BLOG/CHEVY-CAMARO-UNINTENDED-ACCELERATION-VIDEO/.  *TR",
        "vin": "2G1FK1EJ4D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2015",
        "dateOfIncident": "02/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682852,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEB,03.2015 MY MANUAL TRANSMISSION WENT OUT WHILE I WAS TRAVELING AND WAS REAR ENDED AS A RESULT. SINCE THE END OF LAST YEAR I HAVE TOOK MY CAR  TO THE DEALERSHIP (JIM ELLIS CHEV) COMPLAINING ABOUT SMELLING THE CLUTCH BURNING. THE DEALERSHIP WOULD ONLY REPLY SAYING THAT THE TRANSMISSION WAS JUST BREAKING IN. NOW THAT THE TRANSMISSION HAS WENT OUT THE DEALERSHIP IS SAYING THAT I RODE THE CLUTCH AND WANTS ME TO PAY $1700.00. THE CAMARO ONLY HAS 23,000 MILES AND SHOULD NOT HAVE WENT OUT.  *TR",
        "vin": "2G1FE1E30D9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/07/2015",
        "dateOfIncident": "02/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AND CHECK ENGINE LIGHT, TRACTION LIGHT AND THE CAR ON A WET ROAD LIGHT CAME ON INFORMATION SAID REDUCE SPEED! *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "01/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681734,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BEING DRIVEN THE CAR CUT OFF. CAR TOWED TO JACK WINEGARDNER\"S DEALERSHIP.  IT WAS DISCOVERED THAT THE SAME CYLINDER #2 BROKEN THAT WAS REPLACED IN 2/24/2014, LESS THAN 1 YEAR AGO.  *JS",
        "vin": "2G1FA1E39D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "02/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE CUT OFF AND WILL NOT RESTART.  CAR TOWED TO CHEVROLET DEALERSHIP NEAREST MY HOME,  JACK WINEGARDNER- FT., WASHINGTON, MD.  ENGINE WOULD NOT TURN UP. REMOVED CYLINDER #2 SPARK PLUG,   SPARK PLUG DAMAGED, 3 BROKEN VALVES, 1 BENT VALVE.  REPLACED LEFT CYLINDER #2 PISTON AND CONNECTING  ROD, REPLACE LEFT CYLINDER HEAT AND OTHER WORKS.    *JS",
        "vin": "2G1FA1E39D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V346000 (ELECTRICAL SYSTEM) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2G1FC1E34D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2014",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT AFTER PURCHASING VEHICLE, MY HUSBAND DROVE IT, AND I SAT IN PASSENGER SEAT AND NOTICED THAT MY AIRBAG HAD NOT TURNED ON.  THE INDICATOR SAID OFF SO I LIFTED MY REAR FROM THE SEAT AND SAT DOWN HARD THEN THE LIGHT SAID IT WAS ON.  AS WE DROVE DOWN THE ROAD ABOUT 15 MILES AT 55MPH, THE LIGHT WENT BACK TO SAYING AIRBAG OFF.  I WOULD LIFT MY REAR AGAIN AND FORCEFULLY SIT IN SEAT AND IT WOULD TURN OR ON AGAIN. SINCE THEN I HAVE HAD MY CAR IN TO 2 DIFFERENT DEALERS, HAD THE PASSENGER SEAT SENSORS CHANGED, THE THE AIR-BAG MODULATOR CHANGED, AND THE SENSORS ADJUSTED.  WHEN THE AUTO TECH SAW WHAT WOULD HAPPEN WITH ME IN THE PASSENGER SEAT, HE HOOKED UP THE COMPUTER TO THE CAR AND IT SAID I WAS NOT HEAVY OR TALL ENOUGH FOR THE AIRBAG.  I AM 5'8\" AND 165#, SO IT WAS NOT READING ME AT ALL.  SINCE THEN EVERY TIME I AM A PASSENGER IN MY VEHICLE, I NEED TO KEEP AN EYE ON THE INDICATOR LIGHT AND WHEN IT IS OFF, I NEED TO PULL MY REAR OFF THE SEAT AND SIT DOWN FORCEFULLY UNTIL THE ON LIGHT ACTIVATES.  THE DEALERSHIP SAID THEY DIDN'T KNOW WHERE TO GO FROM HERE AND WERE AT A LOSS.  SO I AM HOPING NHTSA CAN HELP ME.  I DID SOME RESEARCH ONLINE AND FOUND THAT I AM NOT THE ONLY CAMARO OWNER WITH THIS PROBLEM.  I ENJOY DRIVING MY CAR BUT THE PASSENGER AIR-BAG ISSUE IS A HUGE PROBLEM.  *TR",
        "vin": "2G1FC1E35D9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND COMPLAINT ABOUT THE HILL ASSIST FEATURE ON THIS MANUAL TRANSMISSION VEHICLE. THE FEATURE IS DESIGNED TO AUTOMATICALLY HOLD THE BRAKES ON AN INCLINE AND IS SUPPOSED TO RELEASE ON APPLICATION OF THE THROTTLE. IT DOES NOT WORK AS IT SHOULD! IT ENGAGES RANDOMLY EVEN WHEN NOT ON AN INCLINE AND DOES NOT RELEASE QUICKLY ENOUGH TO PREVENT ENGINE STALLING OR EXCESSIVE WEAR TO THE CLUTCH BY OVER REVVING THE ENGINE TO PREVENT IT FROM STALLING! THIS CAUSE A BURNING SMELL AND EXCESSIVE WEAR TO THE CLUTCH! IT IS VERY DANGEROUS IN THAT I HAVE TO PULL OUT ONTO A BUSY HIGHWAY FROM AN INCLINE EVERY DAY WHERE I LIVE AND HAVE TO TRY TO OVER COMPENSATE FOR THE DELAY IN GETTING THIS HILL ASSIST TO RELEASE SO I CAN PULL OUT INTO TRAFFIC MOVING AT 55 MPH! I HAVE HAD IT TO THE SELLING DEALER (CARL BLACK CHEVROLET) MULTIPLE TIMES AND SPOKEN WITH CHEVROLET CUSTOMER SERVICE! THEY ALL ACKNOWLEDGE THAT THERE IS AN ISSUE! IT HAS BEEN WRITTEN ABOUT EXTENSIVELY IN THE CAMARO :FORUMS ONLINE! THE REFUSE TO FIX THE ISSUE! THEY TELL ME TO BUY AFTERMARKET PARTS TO SOLVE THE PROBLEM WHEN THERE ARE GENERAL MOTORS PARTS AVAILABLE TO FIX IT! I FINALLY GAVE IN AND ORDERED THE GM PART TO HAVE INSTALLED AND FIX MYSELF! I AM AN ASE MASTER AND L-1 CERTIFIED AUTO REPAIR TECHNICIAN WITH EXTENSIVE GM TRAINING! THEY NEED TO FIX THIS BEFORE ME OR SOMEONE ELSE IS KILLED!",
        "vin": "2G1FS1EW9D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "11/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663769,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 20 MPH, THE STEERING WHEEL DRIFTED TO THE LEFT AND IT BECAME DIFFICULT TO GAIN CONTROL OF THE STEERING WHEEL. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V346000 (ELECTRICAL SYSTEM); HOWEVER, THE PART WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,000.",
        "vin": "2G1FC1E31D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CONTACTED THE DEALER AT 1575 86TH STREET IN BROOKLYN, NY IN REGARDS TO THE LETTER I RECEIVED FOR THE RECALL OF CHEVROLET CAMARO VEHICLES, 2013 MODEL YEARS. THE RECALL IS FOR THE IGNITION KEY THAT CAN CAUSE SERIOUS INJURY OR FATALITY. I HAVE CONTACTED THEM NUMEROUS TIMES AND WE ARE YET TO EVEN HEAR BACK FROM THEM. THIS IS A HUGE LIABILITY TO ANYONE DRIVING THIS CAR. THE GM SAFETY RECALL NUMBER IS 14294. WHEN I CALLED IN OCTOBER THEY SAID ONLY 2 WEEKS TO ORDER THE REPLACEMENT AND SCHEDULE THE APPOINTMENT. I CALLED AGAIN IN NOVEMBER AND THEY STILL DID NOT HAVE THE REPLACEMENT PART AND PLACED ANOTHER ORDER. NOW IT IS MORE THAN A MONTH LATER AND I STILL DO NOT HEAD BACK FROM THEM. I CALLED TODAY AND THEY ARE GIVING ME THE RUN AROUND AND SUGGESTED THEY WILL CALL ME BACK. I PURCHASED MY CAR AT THIS DEALERSHIP AND I FEEL THIS WAS A HUGE MISTAKE. PLEASE ASSIST IN THIS MATTER.  I AM TALL AND BIG, MY LEGS COME CLOSE TO THE IGNITION. I DO NOT FEEL SAFE. IT IS UNACCEPTABLE TO WAIT OVER A MONTH TO HEAR BACK FROM THE DEALER IN A MATTER SO SERIOUS.  *TR",
        "vin": "2G1FC1E31D9"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "12/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE A NEW 2013 CAMARO FOR SON EARLIER THIS YEAR. THIS CAR HAS FEWER THAN 15K MILES AND EARLIER THIS MONTH MY SON WAS MAKING A LEFT TURN IN A NEIGHBORHOOD AND ON THE STEERING WHEEL RETURNING BACK TO CENTER, THE STEERING WHEEL LOCKED THEN HE HEARD A SNAP WHICH RESULTED IN HIM HITTING THE CURB.  THE SNAPPING SOUND WAS PROBABLY THE SOUND OF THE RIGHT CONTROL ARM SNAPPING IN HALF AND THE BENDING OF THE TIE ROD.   I FILED A CLAIM WITH GM AND THEY DECLINED ALL CLAIMS EVEN WITH THE MANY RECALLS ON GM CARS INCLUDING THE CAMARO HAVING STEERING WHEEL LOCKING ISSUES.   I COULD HAVE LOST MY SON AND I'M SIMPLY ASKING THAT GM COVER THE REPAIRS.  THIS HAS BEEN VERY DISAPPOINTING AND STRESSFULLY ON MY FAMILY.   *JS",
        "vin": "2G1FC1E39D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/28/2014",
        "dateOfIncident": "06/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET CAMARO ZL1. PASSENGER AIRBAG INDICATOR SHOWS \"OFF\" WHEN PASSENGER IS IN SEAT. OCCURS RANDOMLY SINCE PURCHASE. CURRENT VEHICLE MILEAGE OVER 25K. DEALER SERVICE HAS REPLACED SENSOR AND RECALIBRATED SYSTEM ON MORE THAN ONE OCCASION. PROBLEM HAS NOT BEEN CORRECTED, STILL SHOWS \"OFF\" RANDOMLY.   *TR",
        "vin": "2G1FZ1EP1D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER. HOWEVER, THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER:  14V346000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 57,402.",
        "vin": "2G1FB1E35D9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAGS IN THE PASSENGER SIDE OF MY CAR ARE FAULTY. THEY ONLY SAY THEY ARE ON SPORADICALLY. THE PROBLEM HAS BEEN ONGOING AND PROVEN TO BE AN ISSUE WHILE AT THE DEALERSHIP. GM IS NOT FOLLOWING PROTOCOL WITH THIS ISSUE AND MANY OTHER ONES. THE DEALERSHIP WILL NO LONGER WORK ON THE CAR SO NOW I AM DRIVING A CAR WHERE THE AIRBAGS MAY OR MAY NOT BE WORKING.  *TR",
        "vin": "2G1FC1E33D9"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "02/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10650971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH ON AN INCLINE DURING RAIN WEATHER, THE REAR END OF VEHICLE VEERED TO THE RIGHT CAUSING THE VEHICLE TO CRASH INTO A CURB. ON ANOTHER OCCASION, THE CONTACT CRASHED INTO A LIGHT POST DUE TO THE FAILURE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A BURN ON THE LEFT WRIST FROM THE AIR BAG DEPLOYMENT, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,600.",
        "vin": "2G1FZ3DP8D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648119,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET IMPALA. CONSUMER WRITES IN REGARDS TO GM RECALL #14294. * LD  THE CONSUMER STATED THE VEHICLE CONTINUOUSLY STALLED. HE TOOK THE VEHICLE TO THE DEALER SEVERAL TIMES, ONLY TO BE TOLD, THEY COULDN'T FIND A PROBLEM. *JB",
        "vin": "2G1FA1E3XD9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TIRE TREAD SEPARATED DOWN THE CENTER AT 55 MILES AN HOUR.  *TR",
        "vin": "2G1FT1EW3D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED THE LETTER THAT THERE WAS A RECALL ON OUR ZL1 CAMARO. AS IT IS STATED IN THE LETTER \"...YOUR GM DEALER WILL REMOVE THE KEY FROM THE FLIP KEY TRANSMITTER...YOU WILL BE PROVIDED WITH 2 NEW KEYS...\" THIS DOES NOT MAKE IT CLEAR THAT WE WOULD NO LONGER HAVE A FLIP KEY NOR THAT WERE GOING TO SAW OFF OUR OLD KEY. IF WE HAD KNOWN THIS WE WOULDN'T HAVE DONE IT. THE DEALER'S SERVICE DEPARTMENT DID NOT MAKE CLEAR WHAT WAS BEING DONE EITHER. WE DO NOT LIKE THAT WE NO LONGER HAVE OUR FLIP KEY. WE REALIZE THAT IT WAS UNSAFE IN SOME CASE SOMEWHERE BUT WE HAVE NEVER BUMPED IT WITH OUR KNEE. WE TRIED TO GET THE DEALER TO PUT IT BACK THE WAY IT WAS BUT THEY TOLD US THEY HAD ALREADY DESTROYED THE OLD KEY. I'M WRITING THIS IN HOPES THAT YOU WILL BE ABLE TO COME UP WITH A BETTER SOLUTION. HAVING THE FLIP KEY WAS ONE OF THE PERKS OF HAVING A CAMARO.  *TR",
        "vin": "2G1FL1EP1D9"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10637021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE STEERING WHEEL SEIZED AND BECAME VERY HARD TO TURN. THE POWER BRAKES BECAME INOPERABLE AND THE VEHICLE VEERED TO THE RIGHT. AS A RESULT, THE DRIVER CRASHED INTO A DITCH. THE DRIVER SUSTAINED A MINOR INJURY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2G1FK3DJ4D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION KEYS RECALL.   *TR",
        "vin": "2G1FB1E32D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2014",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT SHIFT INTO 1ST GEAR. CAR IS 6 SPEED MANUAL V-6 MODEL. REPEATEDLY TRIED SHIFTING INTO 1ST GEAR AT STOPLIGHT. TURNED CAR OFF AND STARTED AGAIN. TRIED SHIFTING INTO 3RD AND REVERSE, STILL WOULD NOT SHIFT INTO 1ST. THIS CAUSED A SAFETY CONCERN AS CARS STARTED COMING UP TO REAR OF CAR SINCE LIGHT TURNED GREEN WHILE TRYING TO SHIFT THE CAR INTO 1ST. HAD TO START TAKE-OFF IN 2ND GEAR, STALLING CAR. THIS HAS OCCURRED MANY MORE TIMES. AFTER EVERY INCIDENT AND REPORTING OF PROBLEM TO DEALER, DEALER STATED THAT WAS NORMAL OPERATION FOR THE CAR. THEY INSPECTED CAR 4 TIMES AND THEY ALWAYS STATE \"NORMAL OPERATION\". CAR ALSO INTERMITTENTLY GRINDS GEARS BETWEEN 1ST AND SECOND GEAR. CAR IS NOW AT DEALER AWAITING INSPECTION BY FACTORY REPRESENTATIVE. CAR IS A DANGER TO MYSELF, MY FAMILY AND THE DRIVING AND PASSENGER PUBLIC. GM IS WELL AWARE OF THIS DESIGN FLAW AND THERE ARE HUNDREDS OF ONLINE POSTS DESCRIBING THE SAME EXACT ISSUE THAT MY CAR HAS. PLEASE HELP!  *TR",
        "vin": "2G1FE1E31D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "09/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL NOTICE REGARDING MY CAR'S IGNITION KEY SWITCH ON TUESDAY SEPTEMBER 2.  I TRIED CONTACTING THE HENNA DEALERSHIP IN AUSTIN, TEXAS THE NEXT DAY TO SCHEDULE AN APPOINTMENT TO HAVE THIS ISSUE TAKEN CARE OF.  THE SERVICE DEPARTMENT PUT ME OFF.  I THEN CALLED AGAIN AND LEFT A MESSAGE FOR A SCHEDULING PERSON.  I DID NOT HEAR BACK.  I CALLED THE INDIVIDUAL AGAIN THE NEXT DAY.  SHE TOLD ME THE DEALERSHIP WAS DEALING WITH 80 RECALLS SO SHE COULD NOT FIGURE OUT WHAT MY RECALL WAS ABOUT.  SHE WAS ARGUMENTATIVE AND NOT HELPFUL AT ALL.  I ENDED UP CALLING THE CHEVROLET CUSTOMER ASSISTANCE CENTER.  I SPOKE WITH A WOMAN WHO CONTACTED THE DEALERSHIP FOR ME.  SHE ARRANGED FOR ME TO TAKE MY CAR INTO THE DEALERSHIP ON SATURDAY, SEPTEMBER 6 AT NOON.  I RECEIVED A CONFIRMATION BY EMAIL THE SAME DAY AND THE FOLLOWING DAY, FRIDAY SEPTEMBER 5.  I ARRIVED AT THE DEALERSHIP, WHICH IS AN HOUR FROM MY HOME, FOR MY APPOINTMENT.  I WAS THEN TOLD THAT THE DEALERSHIP WAS OUT OF KEYS AND THAT NOTHING COULD BE DONE FOR ME.  I WAS NEVER CALLED OR EMAILED ABOUT THIS.  THE SERVICE DIRECTOR TOLD ME THAT HE HAD NO IDEA WHAT THEY WOULD BE RECEIVING MORE KEYS.  I EXPLAINED TO THE MAN THAT THIS WAS UNACCEPTABLE.  HE SAID THERE WAS NOTHING THEY COULD DO AND I WOULD JUST HAVE TO WAIT.  I HAVE RECEIVED NO FURTHER INFORMATION ON THIS MATTER.  *TR",
        "vin": "2G1FC1E35D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE VEHICLE REMAINED ON ALTHOUGH THE KEY HAD BEEN REMOVED FROM THE IGNITION SWITCH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE TECHNICIAN WAS UNABLE TO REPLICATE OR DIAGNOSE THE FAILURE. THE TECHNICIAN ADVISED THE CONTACT TO DISCONNECT THE SPEAKER AMP AS A TEMPORARY FIX. THE REMEDY FAILED TO REPAIR THE FAILURE. IN ADDITION, THE CONTACT INDICATED WHILE TRAVELING 60 MPH ON A MAJOR HIGHWAY, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS MERGED TO THE SIDE OF THE ROAD AND AFTER SEVERAL ATTEMPTS THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS TO BE FURTHER INSPECTED, DIAGNOSED AND REPAIRED BY AN AUTHORIZED DEALER. THE CONTACT WAS NOTIFIED OF RECALL NHTSA CAMPAIGN ID NUMBER: 14V346000 (ELECTRICAL SYSTEM). HOWEVER, THE PARTS NEEDED TO PERFORM THE REPAIR WERE NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 28,000.",
        "vin": "2G1FA1E34D9"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. WHILE DRIVING 55 MPH, THE ENGINE WARNING INDICATOR ILLUMINATED INTERMITTENTLY. THE SPEED DECREASED AND FAILED TO ACCELERATE OVER 40 MPH. AFTER THE DECELERATION, THE VEHICLE ACCELERATED UP TO 70 MPH. THE CONTACT MENTIONED THAT A CRASH WAS AVOIDED DUE TO THE FAILURE. THE DEALER STATED THAT THE MAIN BOARD FAILED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,300.   UPDATED 10/10/14*CN    THE CONSUMER STATED THE BACK BUMPER POPPED OUT ON THE DRIVER'S SIDE TWICE AFTER 50 MILES. IT WAS REPLACED BUT, THE COLOR WASN'T ABLE TO BE MATCHED.  GAS COULD BE HEARD SWISHING AROUND IN THE TANK BY THE BACK SEAT. THE VEHICLE HAS UNEXPECTEDLY DIED TWICE.   UPDATED 05/20/2015  *JS",
        "vin": "2G1FA1E31D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT MENTIONED THAT THE FAILURE WOULD RECUR INTERMITTENTLY. THE VEHICLE WAS TAKEN TO A DEALER FOR A DIAGNOSTIC WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 800 AND THE CURRENT MILEAGE WAS 10,000.",
        "vin": "2G1FL1EP1D9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY CAR THROUGH MY GUARD GATE AND PROCEEDED TO TURN THE CORNER AT APPROXIMATELY 25MPH WHEN I LOST COMPLETE STEERING OF MY CAR AND THE CAR SHUT OFF.  LUCKILY I WAS NOT AT A HIGH SPEED WHEN THIS OCCURRED AND WAS ABLE TO STOP THE CAR ON THE GRASSY EMBANKMENT OF OUR LAKE, AFTER MY CAR RIM WAS SNAGGED BY A 2 FT THIN METAL POST ATTACHED TO A TREE.  I HAD THE CAR TOWED TO THE CHEVY DEALER WHO IMMEDIATELY HAD ME FILE A CLAIM WITH GM AFTER NOTICING THAT A PART ON THE STEERING OF THE CAR WAS FAULTY AND CAUSED A COLLAPSE OF THE STEERING RACK.  AT THE TIME OF THE INCIDENT THE AIR BAG DEPLOYMENT LIGHT CAME ON EVEN THOUGH THERE WAS NO COLLISION NOR DEPLOYMENT.  BY THE WAY, GM DECLINED THE CLAIM EVEN THOUGH IT WAS DUE TO A FAULTY PART AND I AM CAUGHT IN THE MIDDLE OF THE INSURANCE COMPANY, CHEVY DEALER AND GM TRYING TO DECIDE WHO IS PAYING FOR THE REPAIR OF MY VEHICLE 6 WEEKS LATER.  THE CAR HAS NEVER BEEN IN AN ACCIDENT AND ALL PARTS ARE ORIGINAL TO THE CAR WITH NO AFTER MARKET INSTALLATIONS AT ALL.   *TR",
        "vin": "2G1FC1E32D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AGO I TOOK MY 2013 CHEVROLET CAMARO 2LS TO PREMIER CHEVROLET OF BUENA PARK FOR AN OIL CHANGE. ON THE WAY HOME AFTER DRIVING THE CAR FOR ABOUT 60 MILES THE CHECK ENGINE LIGHT CAME ON FOR A FEW MINUTES THEN IT WENT OFF. ON MAY THE 22ND ON MY WAY BACK HOME FROM WORK THE CHECK ENGINE LIGHT CAME BACK ON WHILE SITTING IN TRAFFIC. ONCE TRAFFIC STARTED MOVING I NOTICED THAT THE CAR WOULD NOT SHIFT GEARS IT WAS STUCK ON 2ND GEAR. DROVE THE CAR THROUGH THE STREETS TO THE NEAREST DEALERSHIP IN LA PUENTE CA THE WHOLE WAY THE CAR WOULD NOT SHIFT. I AM WAITING FOR A RESPONSE FROM THE DEALER TO SEE IF THE WARRANTY IS GOING TO COVER THE ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN I 75 IN OCALA FLORIDA CAR STALLED IN MIDDLE OF HIGHWAY . I PULLED OVER TO SHOULDER AND HAD TO RESTART CAR. I TOOK IT IN TO A DEALER  AND THEY SAID THEY COULD NOT FIND ANY THING WRONG. THEY SAID TAKE THE CAR.   *JS",
        "vin": "2G1FA1E32D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CAMARO WAS TOTALLY DEAD BUT BATTERY SHOWED FULLY CHARGED ON A BATTERY CHARGER. PREVIOUSLY, THE CAR HAD ACTED ODD WITH THE WIPERS, LIGHTS, ETC,. GOING ON AND OFF WITH NO HUMAN INTERACTION. FOUND OUT THE NEGATIVE BATTERY CONNECTION, IN THE TRUNK UNDER THE SPACE TIRE, WAS SO LOOSE IT COULD BE REMOVED BY HAND WITHOUT ANY TOOLS. SPARE TIRE HAD NOT BEEN REMOVED SINCE THE CAMARO WAS PURCHASED IN JUNE 2013 SO IT EITHER CAME FROM THE FACTORY THAT LOOSE OR THE UNUSUAL 10MM SCREW THAT TIGHTENS THE CONNECTION WORKED ITSELF LOOSE.    *JS",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "04/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON WEST VIRGINIA HIGHWAY 75 SOUTH BOUND ON A SUNDAY MORNING, I WAS RETURNING FROM THE NAVAL STATION GREAT LAKES, (MY SON GRADUATED FROM RECRUIT TRAINING) THEN UNEXPECTED HAPPENS, THE RIGHT TIRE AND THE ENTIRE ASSEMBLY SYSTEM BROKE OFF THE CAR, I SAW THE ENTIRE SYSTEM, ABANDON MY CAR AND CARRY ON MOVING FORWARD. WITHOUT ANY EXAGGERATION, I SAW MY LIFE FLASH IN FRONT OF MY EYES, I THOUGHT I WAS A GONER. SEEING YOUR TIRE MOVING FORWARD, WHILE SIMULTANEOUSLY TRYING TO CONTROL THE VEHICLE FROM COLLIDING WITH THE CEMENTED MEDIAN, WAS THE WORSE EXPERIENCE YET, WHAT A NIGHTMARE.  THIS WHOLE INCIDENT FELT LIKE I WAS HIT BY AND IED IN IRAQ, WHAT A SCARE.  MY QUESTION TO ANYONE IS, HOW IS THIS POSSIBLE? PLEASE CAN SOMEONE HELP EXPLAIN WHAT THE HECK HAPPENING HERE, I DIDN'T HIT ANYTHING, AND HOWEVER I WAS DRIVING A LITTLE OVER 70 MILES PER HOUR.  *TR",
        "vin": "2G1FB1E31D9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A MANUAL V8 MODEL.  WHENEVER STOPPED ON AN INCLINE, THE HILL START ASSIST (HSA) ENGAGES.  THE FIRST TIME I GAVE IT PLENTY OF THROTTLE AND THE BRAKES WOULD NOT DISENGAGE AND CAUSED ME TO STALL.  THE 2ND TIME, I HAD THE RPM VERY HIGH AND AGAIN THE BRAKES WOULD NOT DISENGAGE.  MY CAR WAS JUMPING UP AND DOWN UNDER THE STRAIN.  WHEN IT FINALLY RELEASED THE CAR, I WAS GREETED WITH THE SMELL OF BURNING CLUTCH.  THIS CANNOT BE NORMAL.  I DON'T THINK HITTING 2000 RPM AND DROPPING THE CLUTCH SHOULD BE A NORMAL METHOD TO OVERCOME TEH HSA SYSTEM.  I HAVE AUTO HILL BRAKING ON OTHER VEHICLES THAT ARE NEARLY INVISIBLE TO ME AND WORK FLAWLESSLY.  I BEEN DRIVING MANUAL CARS FOR 20+ YEARS AND HAVE NO ISSUES ON HILL STARTS.  ONE OF THE BIGGEST ISSUES IS THERE IS NO WAY TO TURN OFF THE HSA FEATURE.  I THINK YOU NEED TO FORCE GM TO RECALIBRATE THE SYSTEM AND/OR ALLOW THE DRIVER TO TURN THE HSA FEATURE OFF.  *TR",
        "vin": "2G1FT1EW2D9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2014",
        "dateOfIncident": "03/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF ELECTRIC POWER STEERING ASSIST MAKING TURNS. FROM A STOP MAKING A LEFT OR A RIGHT TURN, THE CAR LOSES IT POWER STEERING RANDOMLY. NO CODES OR LIGHTS ON DASH.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2014",
        "dateOfIncident": "12/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS EQUIPPED WITH A \"HILL ASSIST\" FEATURE FOR MANUAL TRANSMISSION CARS. IT DOES NOT RELEASE PROPERLY OR ACTIVATES IMPROPERLY. THE VEHICLE HOLDS EXCESSIVELY LONG ON INCLINES, WILL NOT RELEASE WHEN TRYING TO PULL INTO TRAFFIC OR EVEN ACTIVATES ON LEVEL GROUND WITH NO INCLINE! I HAVE COMPLAINED MULTIPLE TIMES TO THE GENERAL MOTORS SERVICE DEPARTMENT WHEN I TAKE IT IN FOR SERVICE AND IT HAS BEEN CHECKED REPEATEDLY. IT IS ALWAYS \"OPERATING AS DESIGNED!\" I HAVE HAD MULTIPLE CONVERSATIONS WITH THE SERVICE PERSONNEL INCLUDING THE SHOP SUPERVISOR AND THEY ALL KNOW IT IS AN ONGOING ISSUE WITH THESE VEHICLES! IT SEEMS TO BE A JOKE THAT THE SYSTEM OPERATES SO POORLY EXCEPT THAT I BELIEVE IT IS INEVITABLE THAT IT WILL CAUSE AN ACCIDENT. EITHER TO MYSELF OR TO SOMEONE ELSE. THE MESSAGE BOARDS ARE FULL OF COMPLAINTS ABOUT THIS FEATURE AND IT IS UNIVERSALLY DESPISED BY EVERYONE ON EVERY VEHICLE IT IS INSTALLED ON! I HAVE ASKED FOR IT TO BE REPAIRED OR REMOVED BY THE DEALER YET THEY TELL ME THEY ARE UNABLE TO DO SO. THE MESSAGE  BOARDS HAVE FOUND A WORK AROUND SOLUTION TO THE PROBLEM BY INSTALLING A YAW SENSOR WITHOUT THE LATERAL ACCELEROMETER THAT THE VEHICLE USES! I AM WILLING FOR THE DEALER TO DO THIS AT THEIR EXPENSE NOT MINE, BUT THEY REFUSE. IT IS A GM PART INSTALLED ON A GENERAL MOTORS VEHICLE AND DOES NOT DISABLE THE STABILITY SYSTEM. ONLY THE HILL ASSIST PORTION. THIS HAS ALSO CAUSED EXCESSIVE WEAR ON THE CLUTCH AND BRAKES AS I HAVE LEARNED TO OVER REV THE ENGINE TO DRAG IT OUT OF THIS LOCK POSITION TO SMOOTHLY MERGE INTO TRAFFIC. I AM COMPLETELY AWARE OF THE TECHNOLOGY AS I AM AN ASE MASTER AND L-1 CERTIFIED TECHNICIAN WITH OVER 40 YEARS OF EXPERIENCE AND TRAINING INCLUDING GENERAL MOTORS DEALERSHIPS!  *TR",
        "vin": "2G1FS1EW9D9"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT WAS TRAVELING 35 MPH AND IN AN ATTEMPT TO AVOID STRIKING A ROAD OBJECT, CRASHED AGAINST THE SIDE OF A CURB. AN ABNORMAL GRINDING NOISE WAS HEARD FROM THE FRONT END AS THE CONTACT EXPERIENCED A SLIGHT LOSS IN STEERING CONTROL.  THE VEHICLE LATER TOWED TO AN AUTHORIZED DEALER WHERE THE TECHNICIAN STATED THAT THE UPPER AND LOWER CONTROL ARMS WERE FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "2G1FC1E39D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE LIGHT ON IN NIGHT.  *TR",
        "vin": "2G1F91E39D9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE ATTEMPTING TO MERGE ONTO THE HIGHWAY, THE VEHICLE INDEPENDENTLY DECELERATED TO 10 MPH WITHOUT WARNING. THE FAILURE WAS RECURRING.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN PERFORMED A DIAGNOSTIC. THE DIAGNOSTIC TEST RETURNED INCONCLUSIVE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,000 AND THE CURRENT 18,000.",
        "vin": "2G1FC1E31D9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "02/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING DAY 1 AFTER PURCHASING THE VEHICLE IN FEBRUARY 2013, THE VEHICLES BACK UP CAM BEGAN TO FREEZE WHEN THE VEHICLE IS IN REVERSE UNTIL I PUT THE CAR BACK IN PARK AND TURN THE VEHICLE OFF AND OPEN THE DOOR TO COMPLETELY SHUT THE VEHICLE DOWN.  A FEW MONTHS LATER ON TOP OF THE RADIO AND BACK UP CAMERA ISSUES THE VEHICLE  HAS STARTED TO CREATE A CHAIN DRAGGING SOUND WHEN ACCELERATING, IT THEN BEGINS TO PULSATE WHILE MY FOOT IS ON THE ACCELERATION PEDDLE AND THE SOUND CONTINUES, THE VEHICLES RADIO THEN FREEZES AND RESETS ITSELF STARTING IN OCTOBER OF 2013. I HAVE TAKEN THE CAR TO CERTIFIED CHEVROLET SERVICE DEPARTMENTS WITHIN MULTIPLE DEALERSHIPS ON MULTIPLE OCCASIONS TO GET THE VEHICLE FIXED. THE DEALER HAS STATED AND BEEN UNABLE TO CORRECT THE PROBLEMS COMPLETELY AND HAS RAN OUT OF ALTERNATIVE SOLUTIONS TO THE FIX THE PROBLEMS AFTER PUTTING OVER 800 ADDITIONAL ROAD MILES ON MY VEHICLE IN ORDER TO TRY TO DIAGNOSE THE ISSUE.  *TR",
        "vin": "2G1FC1E34D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549820,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MY CAMARO STALLED AND I REPORTED IT I CALLED ONSTAR AND THEY TOLD ME THAT I HAD 43,000+ MILES ON THE CAR THE  VIN WAS REGISTERING.  I CALLED THE DEALERSHIP AND MADE THEM AWARE  THAT GM NOTED THAT THE CAR WAS READING THIS HIGH MILEAGE. I WANTED TO RETURN THE CAR, THEY WOULD NOT DO IT. I WANTED TO EXCHANGE THE CAR, THEY WOULD NOT DO IT. ONSTAR, GM, ROADSIDE ASSISTANCE, NOR THE DEALERSHIP KNOWS WHERE THE MILEAGE CAME FROM. I NEED ANSWERS.  *TR",
        "vin": "2G1FC1E30D9"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/24/2013",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FLAT TIRE IN THE MIDDLE OF NM DESERT. NO SPARE OR JACK IN CAR. FILL AND PUMP DIDN'T WORK. 60 MILES FROM NEAREST REPAIR. NO CELL SERVICE. WALKED ABOUT 5 MILES TO CELL SERVICE. IF IT WAS THE MIDDLE OF THE SUMMER I'D OF DIED OF HEAT STROKE OR IF I WAS IN THE MOUNTAINS OF COLORADO IN WINTER I'D OF FROZEN TO DEATH.  A SPARE TIRE HAS BEEN SUPPLIED FOR 90 YEARS FOR SAFETY NOW NOTHING.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548465,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT THE VEHICLE WOULD NOT RESPOND WHILE ATTEMPTING TO ACCELERATE FROM A STOP. THE CLUTCH HAD TO BE DEPRESSED IN ORDER FOR THE VEHICLE TO ENGAGE INTO FIRST GEAR AND ACCELERATE. THE CONTACT STATED THAT THERE WAS ALSO AN ABNORMAL NOISE FROM THE VEHICLE WHEN DEPRESSING THE CLUTCH. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 700.",
        "vin": "2G1FE1E34D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE MAKING A U-TURN, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSIS OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 830.",
        "vin": "2G1FC1E30D9"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "09/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT TIRE JUST BLEW-OUT TWO BLOCKS AWAY FROM HOUSE. IT'S MY SONS CAR AND THANK GOD HE DIDN'T MAKE THE HIGHWAY BEFORE IT BLEW! TIRES ARE BF GOODRICH RADIALS TA P245/55R18.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "07/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHEN THE AIR CONDITIONER WAS ACTIVATED IN EXTREMELY HUMID WEATHER, THE ENTIRE FRONT EXTERIOR WINDSHIELD BECAME FOGGY DUE TO THE COLD AIR BLOWING FROM THE TOP DASHBOARD AIR VENT. THE AIR FLOW EMITTED FROM THE VENT WITHOUT THE DEFROSTER CONTROL SETTING ENGAGED. THE DEALER INFORMED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 700.  .... UPDATED 10-17-13 *BF  THE CONSUMER STATED THE ISSUE APPEARED TO BE A DEFECT IN THE DESIGNED AIR CONTROL SYSTEM. UNDER THE CURRENT OPERATION OF THE SYSTEM, WHEN IN THE AIR CONDITIONING MODE WITH BI-LEVEL, OR FOOT LEVEL SELECTED, WHETHER USING RE-CIRCULATING AIR OR FRESH AIR, THE SYSTEM DELIVERED COLD AIR TO THE WINDSHIELD THROUGH THE WINDSHIELD VENTS. THE AIR CONDITIONED AIR COMING OUT OF THE WINDSHIELD VENTS CAUSED THE WINDSHIELD TO GET COLD. IN HIGH HUMIDITY , THIS CAUSED THE WINDSHIELD TO FOG UP ON THE OUTSIDE OF THE VEHICLE.",
        "vin": "2G1FB1E31D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "07/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED WHILE DRIVING 70 MPH, THE ENGINE WENT INTO LIMP MODE. THE CONTACT COASTED TO THE SIDE OF THE ROAD.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION BUT THEY COULD NOT DIAGNOSE THE CAUSE OF FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 4,100.    UPDATED 9/3/13 *CN ....UPDATED 09-26-13 *BF     THE CONSUMER SIMILAR COMPLAINTS INDICATED IT WAS A FUEL INJECTOR PROBLEM, BUT GM WOULD NOT FIX THE PROBLEM UNTIL THE COMPUTER SENT THE CODE.",
        "vin": "2G1FA1E3XD9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "04/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT MENTIONED THAT THE FAILURE WOULD RECUR INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO A DEALER FOR A DIAGNOSTIC WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,460 AND THE CURRENT MILEAGE WAS 1,800.  *TR",
        "vin": "2G1FF1E3XD9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "04/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN IN THIS BRAND NEW VEHICLE IS NOT STRAIGHT. IT WAS LIKE THIS BRAND NEW.  I WAS TOLD THAT ALL OF THE 2013 CAMAROS ARE LIKE THIS. THIS IS CRAZY. I HAVE SPENT A LOT OF MONEY ON THIS CAR.  PLEASE HELP? *TR",
        "vin": "2G1FT1EW3D9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/06/2013",
        "dateOfIncident": "11/06/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT BELT CLIP IS DEFECTIVE.  BELT CLIP KEEPS COMING UNDONE CONSTANTLY THEREFORE WILL NOT RETAIN SEAT BELT PROPERLY.  ONCE THE SEATBELT COMES OUT OF THE CLIP IT CROSSES OVER THE PASSENGERS' NECK CREATING A SAFETY ISSUE AND IT CAUSES UNDUE DISCOMFORT.  GM HAS REPLACED THE SEAT SKIN ONCE, AND THE PROBLEM CONTINUES TO EXIST AND THEY REFUSE TO DO ANYTHING ELSE  TO CORRECT THE PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "04/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AISIN AY6 TRANSMISSION IN MY BRAND NEW 2013 CHEVROLET CAMARO LS IS DEFECTIVE TO THE POINT OF BEING A SAFETY ISSUE AND GM WILL NOT RECOGNIZE THIS AS AN ISSUE EVEN THOUGH IT IS A WIDESPREAD PROBLEM THAT A LOT OF PEOPLE ARE HAVING. THE TRANSMISSION, FROM THE DAY I BOUGHT THE CAR, HAS NEVER SHIFTED SMOOTHLY WITHOUT GRINDING OR CAUSING MISSED SHIFTS. THIS CAN BE, AND IS A SAFETY HAZARD. THE BOTTOM LINE IS THAT IT IS A POORLY DESIGNED TRANSMISSION THAT GM IS PUTTING IN THESE CARS AND ENOUGH ISSUES HAVE BEEN RAISED THAT THEY SHOULD BE FIXING THE PROBLEMS OR REPLACING THE TRANSMISSIONS IN THESE CARS. I WANT THIS ISSUE RESOLVED AND ANY HELP YOU CAN OFFER IS GREATLY APPRECIATED.  *TR",
        "vin": "2G1FE1E30D9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CAMARO LS FUEL INJECTORS POSE A CHANCE AT BEING DEFECTIVE, AFTER BUYING THE CAR AND NOTICING TWO OF THE INJECTORS HAVING ALREADY BEEN REPLACED, I AM NOW LESS THEN A MONTH OF OWNING THE CAR. THE CAR IS CURRENTLY HAVING ITS FOURTH FUEL INJECTOR REPLACED, THIS MAY CAUSE HARM TO THE VEHICLE IF IT DOES NOT DO WHAT IT IS DESIGNED TO DO. THE CAR IS SUPPOSE TO PUT ITS SELF IN \"LIMP\" MODE REDUCING POWER AND THE CHANCE OF HARMING THE ENGINE, IT WILL ALSO DISPLAY A SERVICE STABILITRAK MESSAGE. SERVICE DEPARTMENTS ARE REQUIRED TO ONLY REPLACE THE BAD INJECTORS HOWEVER IF YOU CONTACT CORPORATE GM THEY WILL WORK WITH YOU TO REPLACE THE REMAINING INJECTORS IF THE PROBLEM CONSISTS AS DID MINE. THERE ARE NO PREEMPTIVE SIGNS OF THE INJECTORS GOING BAD. OVERALL SATISFIED WITH THE SERVICE PROVIDED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2012",
        "dateOfIncident": "11/19/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ACCELERATING FROM A STOP LIGHT WHEN I GOT TO ROUGHLY 2000 RPMS ( ROUGHLY 17 MPH) PUSHED THE CLUTCH FULLY IN AND ATTEMPTED TO GO INTO 2ND GEAR. HOWEVER, THE SHIFTER PHYSICALLY WOULD NOT ALLOW THIS SHIFTER TO GO INTO 2ND GEAR WITH UP TO, I WOULD SAY 20LBS OF FORCE. AS A RESULT OF TRYING TO GET THE CAR TO GO INTO 2ND GEAR THE DRIVER BEHIND ME HAD TO SWERVE OUT OF HIS LANE TO AVOID FROM RE-ENDING ME. I QUICKLY HAD TO MOVE THE GEAR SHIFTER TO 3RD GEAR TO GET MY SPEED BACK. THIS HAS HAPPENED A TOTAL OF OVER 3 TIMES NOW! THIS IS A BRAND NEW CAR AND SHOULD NOT HAVE THESE KINDS OF TRANSMISSION ISSUES. I HAVE AN APT. WITH THE DEALER 11/28/12.  *TR",
        "vin": "2G1FS1EWXD9"
    }
]