[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955300,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE POLICE PURSUIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD AN APPARENT POWER FAILURE WHILE DRIVING AND THE LIGHTS WERE FLASHING ON AND OFF, THE LOCKS WERE GOING UP & DOWN AND THE ENGINE WAS DYING AND LURCHING PRETTY VIOLENTLY. VERY DANGEROUS SITUATION ON THE HIGHWAY. I GOT OFF THE ROAD AND SHUT IT OFF. THEN IT WAS COMPLETELY DEAD (EXCEPT FOR A CLICKING IN THE DRIVERS SIDE DOOR). COULDN'T GET ANYTHING TO COME ON. THEN (FOR SOME UNKNOWN REASON) I MOVED THE POWER SEAT SWITCH, AND EVERYTHING CAME ON. THEN IT STARTED FINE AND RAN ALL THE WAY HOME. I TOOK IT TO THE SHOP THE NEXT DAY AND THEY COULDN'T FIND ANYTHING WRONG WITH IT (OF COURSE). THEY SAID IF THEY CAN'T RECREATE THE PROBLEM THEY CAN'T FIX IT. I CHECKED CABLES AND PULLED ON THINGS, I COULDN'T GET IT TO HAPPEN AGAIN EITHER. A COUPLE WEEKS LATER, I TRIED TO LOCK IT WITH MY REMOTE ONE DAY AND IT WOULDN'T DO ANYTHING (DEAD AGAIN) EXCEPT FOR THE CLICKING SOUND IN THE DOOR AGAIN. I MOVED THE SEAT BUTTON AND IT CAME BACK TO LIFE... WHAT IS GOING ON? I'VE SEEN POSTINGS ABOUT THIS AS FAR BACK AS 2007, BUT NO-ONE HAS DEFINITE FIX.THIS IS SCARY! NOW THIS IS THE INTERESTING PART.. I DID A CARFAX ON IT, AND I SAW WHERE THIS VEHICLE HAD BEEN TAKEN IN TO THE DEALERSHIP SEVERAL TIMES (IN A SHORT PERIOD OF TIME) AND THE SERVICE WAS LISTED AS A \"DRIVABILITY TEST\". I CALLED THE DEALERSHIP MAINTENANCE DEPARTMENT, AND THE GUY SAID \"YEAH I REMEMBER THAT VEHICLE\". AND HE TOLD ME THEY HAD REPLACED SEVERAL MODULES, THE BATTERY, BATTERY CABLES ETC, BUT APPARENTLY IT KEPT ON DOING IT, SO THEY JUST SOLD IT. SO IF THIS PROBLEM WAS PRESENT WHILE THE VEHICLE WAS STILL IN WARRANTY, SHOULDN'T THEY STILL BE RESPONSIBLE FOR FIXING IT?",
        "vin": "1GNSK2E04DR"
    }
]