[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My car is a lemon , brought from Arizona and they sold me a car that has a rusted chassis so if repairs are needed I will have to spend more money to get fixed because things are very fragile because everything is rusted and then I’m lease the car for a price a car isn’t worth for .",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Chevrolet Sonic. The contact stated that the button on the gear shifter would not release while shifting between gears. Due to the failure, the key would remain stuck in the ignition due to the defective gear shifter button. The dealer was notified of the failure and the contact was given a diagnostic fee; the contact declined to pay for the diagnostic. The manufacturer was also notified of the failure and informed her that the matter would be escalated to a senior manager. The contact had not heard back from the manufacturer. The vehicle had yet to be repaired. The failure mileage was unknown.",
        "vin": "1g1ja5sh0d4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434745,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "On Tuesday, September 27 at 10:25 AM, I was driving to pickup medication for my dog. I was less than 5 miles away from my home. As I pulled up to park, I slowed down and turned into the nearest parking stall. As I set the automatic shifter to Park, the car came out of park and shifted gears into Drive; mounting the curb. I hit the brake but the car continued to move forward. When I went to pull on my Emergency brake, the car hit the side of the building. As soon as I hit the building, I was able to regain control of the car and turn the ignition off. Gratefully, no one was hurt.",
        "vin": "1G1JC5SG9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "At around 45,600 miles the Odometer and Trip Meter on my 2013 Sonic stopped displaying numbers and instead shows just 3 dashes. Disconnecting the car's battery for 30 mins, reconnecting, and starting the car displays the mileage for a few seconds and then returns to the ---. Same happens when pulling the fuse for the gauge cluster; the mileage is displayed for a few seconds and then returns to the ---. Attempting to reset the Trip Meter results in the normal 'beep' but numbers are not displayed.  Brought the car to the dealership and since the vehicle is out of warranty they want a nonrefundable deposit of $700 just to diagnose, parts and labor would be an additional bill on top of that. Ridiculous. Since this is likely a computer issue it's beyond the scope of work that can be performed by my trusted local garage and as a result I have not had the issued corrected. This should be a GM recall.",
        "vin": "1G1JC6SHXD4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON IN THE SHIFT STICK GET STUCK AND DOESN'T COME BACK, KEY GETS STUCK AND I STRUGGLE TO GET THEM OUT OF THE IGNITION. THIS IS HAPPENING SINCE OCTOBER 2020 FROM NOW. ONE DAY THE BUTTON GOT STUCK AND WAS HARD TO MAKE IT COME BACK THAT I CONSIDERED LEAVING MY CAR WITH THE KEYS IN THE IGNITION, BUT I WORKED SO HARD TO GET IT UNSTUCK FOR A GOOD TIME AND I SUCCEEDED. THE BAD THING IT THAT I DOESN'T LOOK TO IMPROVE. IT HAPPES EVERY TIME THE VEHICLE IS PARKED AND I'M ABOUT TO LEAVE IT.",
        "vin": "1G1JC6SHXD4"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384224,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 CHEVY SONIC DEVELOPED TICKING SOUND SHORTLY AFTER I BOUGHT IT AT 60000 MILES. THE TICKING GOT WORSE OVER TIME AND THEN CHECK ENGINE LIGHT CAME ON. I SCANNED THE CODES AND MULTIPLE FOUR CODES WERE FOUND. P0171, P0496, P1101, AND P2270. AFTER DOING SOME RESEARCH IT SEEMED TO BE THAT MOST CRUZE, SONIC, AND TRAX VEHICLES ALL HAD THE SAME ISSUES. I TOOK IT TO THE DEALER FOR DIAGNOSTICS AND WAS INFORMED THE VEHICLE NEEDED A NEW INTAKE MANIFOLD, PURGE VALVE, PCV HOSE, AND VALVE COVER. THEY CALLED THE DEALERSHIP TO SEE IF THERE WERE ANY RECALLS AND THE ONLY ONE WAS THE VALVE COVER BUT WOULD HAVE TO PAY FOR DIAGNOSTICS TO SEE IF THEY WOULD COVER IT OR NOT. THE BREATHER DIAPHRAGM IN THE VALVE COVER GOES BAD DUE TO A FAULT INTAKE MANIFOLD ON THESE VEHICLE MODELS. THERE IS A LITTLE ORANGE GASKET IN THE MANIFOLD THAT GOES BAD AND CAUSES THE DIAPHRAGM TO GO OUT RESULTING IN HAVING TO REPLACE THE ENTIRE SYSTEM. THE INTAKE MANIFOLD NOT ONLY CAUSES GHAT ISSUE BUT CAUSES THE CAR TO GET JUMPY AT STOPS AND STALLING OUT. HAVE ALMOST HAD A FEW PEOPLE REAR END ME DUE TO THIS. THE PURGE VALVE GOES OUT AS WELL AND WHEN AT THE FUEL PUMP THE CAR WILL HESITATE TO CRANK OR RUN AT VERY LOW IDLE SHUTTING OFF MULTIPLE TIMES BEFORE IT STARTS UP AND THEN RUNS ROUGH UNTIL A DECENT AMOUNT OF FUEL HAS RAN THROUGH THE ENGINE. THE CAR WOULD NOT GET ENOUGH FUEL WHEN AT STOPS OR ON HIGHWAYS AND WOULD ALSO JUST LOSE FUEL AND CUT THE ENGINE OFF. THOSE COMPONENTS HAVE SINCE BEEN REPLACED BY MYSELF AND NO MORE ISSUES. CHEVY WILL NOT RECALL THE PARTS THAT ARE CAUSING THE ISSUES AND THEREFORE THERE IS A SAFETY ISSUE WHEN OUT ON THE HIGHWAYS.",
        "vin": "1G1JC5SB0D4"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377989,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL SYSTEM IS RUNNING WEAK, FOR A CAR WITH ONLY 30000 MILES, ONE OWNER AND FULL MAINTENANCE, THE ENGINE LIGHT CAME AND GO ALL THE TIME AND EVERYTHING WAS CHECKING",
        "vin": "1G1JC5SG2D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PCV PRESSURE REG VALVE FAILS AND CAUSES DAMAGE TO THE ENGINE.  GM SENT A LETTER TO CUSTOMERS BUT ONLY COVERS THE WORK UP TO 120K MILES.  MINE FAILED AT 125K MILES AND COST OVER $1000 TO FIX. GM IS REFUSING TO PAY FOR THE REPAIRS.10/15/2020",
        "vin": "1G1JC6SB9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375467,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER STEERING KEEPS GOING OUT, I HAVE TO TAP ON THE BATTERY POST CONNECTORS AND THE POWER STEERING STARTS WORKING AGAIN. SOMETIMES A WARNING LIGHT COMES ON, SOMETIMES NOT. MY DAUGHTER WAS DRIVING GOING AROUND A BEND IN THE ROAD WHEN THE POWER STEERING WENT OUT, ALMOST LOST CONTROL.  MY ODOMETER QUIT WORKING, I TOOK IT TO A SHOP AND WAS TOLD IT'S A COMMON PROBLEM. WHY IS THIS NOT ON RECALL IF A CHEVROLET MECHANIC IS TELLING ME IT'S A COMMON PROBLEM...VERY EXPENSIVE AND UNNECESSARY AND SHOULD BE ON RECALL IF IT'S THAT COMMON.",
        "vin": "1G1JC5SG8D4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SONIC HAD THE SAME ISSUE AS NHTSA RECALL NO. : 19E-064, MANUFACTURER RECALL NO. : N192223230. EXCEPT, IT HAPPENED WHEN I REACHED TO USE THE WIPERS RATHER THAN HITTING THE KEY FOB WITH MY LEG. I REACHED TO USE THE WIPERS AND MY ARM HIT THE KEY FOB, KNOCKING IT INTO THE NEXT POSITION, TURNING OFF THE ENGINE. IT COULD HAVE JUST AS EASILY MOVED OVER ONE MORE AND LOCKED THE STEERING. THE RECALL WAS DONE ON THE CAMARO'S, SO WHY WASN'T IT DONE ON ANY OTHER VEHICLE USING THE SAME KEY FOB AND IGNITION REPLACEMENT? WAS IT BECAUSE THE CAMARO'S PRICE IS 4 TIMES THE PRICE OF A SONIC? ARE CAMARO DRIVERS MORE VALUABLE THAN SONIC DRIVERS? THERE IS A CLASS ACTION LAWSUIT INCLUDING THE CAMARO RECALL, BUT NOT THE SONIC. HTTPS://WWW.GMIGNITIONSWITCHECONOMICSETTLEMENT.COM/  I REPORTED THIS BACK IN 2014, AND NEVER HEARD A WORD ABOUT IT.",
        "vin": "1G1JC6SB8D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 CHEVY SONIC. THE KEY FOB IS HUGE. IN FACT, THERE HAVE BEEN TIMES WHEN I ATTEMPT TO USE MY WIPER CONTROLS AND I HAVE ACCIDENTALLY HIT THAT KEY FOB AND TURNED THE CAR OFF. LUCKILY, I WAS NOT MOVING AT THE TIME, BUT BECAUSE OF THIS PROBLEM IT'S EXTREMELY POSSIBLE AND LIKELY THAT THE SAME COULD HAPPEN WHILE DRIVING AND POSSIBLY BE KNOCKED ALL THE WAY OVER WHERE IT WOULD NOT ONLY TURN THE CAR OFF, BUT ALSO LOCK THE STEERING.    I WENT TO A DEALER AND HEARD A RUMOR THE SAME PROBLEM EXISTS FOR THE CAMARO'S AND GM CREATED KEYS WITH THE ELECTRONICS IN THEM TO USE IN PLACE OF THE KEY FOB'S.  THEY ARE ABOUT 2 INCHES SHORTER.    WHY THIS WAS NOT DONE FOR ANY VEHICLE BY GM THAT USES THE SAME KEY FOB'S AND IGNITIONS, I DON'T UNDERSTAND.    I PERSONALLY GOT THE DEALER TO MAKE ME A SET OF THESE KEYS TO SEE IF THEY WOULD WORK IN MY SONIC. IT COST ME $80.00, BUT FOR THE SAFETY VALUE I PAID FOR THEM.    I THINK THIS SHOULD BE A RECALL/REPAIR OR A CLASS ACTION SUIT BECAUSE IT SCARED ME WHEN IT HAPPENED, AND I WORRY IT WILL HAPPEN TO OTHERS WHO HAVEN'T HAD IF HAPPEN, BUT ARE UNAWARE OF THE POSSIBILITY.",
        "vin": "1G1JC6SB8D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350653,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE 3 YEARS AGO PREOWNED FROM THE DEALER AND WITHIN THESE 3 YEARS I HAVE ALREADY HAD A CATALYTIC CONVERTER RECALL, THE ISSUE RECENTLY IS MY AC SYSTEM IN MY CAR IS OUT AND AS A DID RESEARCH ON THE SPECIFIC YEAR THERE'S PEOPLE WHO HAVE ALREADY REPLACED THE AC SYSTEM UP TO 5 TIMES FOR 2013 SONICS. THIS IS A MANUFACTURING ISSUE THAT NEEDS TO BE FIXED ON CHEVROLET'S BEHALF.",
        "vin": "1G1JC6SG7D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STATIONARY. THE KEY LOCKS IN THE IGNITION BECAUSE THE GEAR SHIFT  BUTTON  ON THE FRONT OF THE SHIFT DOES NOT RELEASE. YOU HAVE TO RELEASE THE BUTTON BY PRESSING YOUR FINGER OR AN OBJECT TO RELEASE THE BUTTON TO RELEASE THE KEY FOB. THIS IS FRUSTRATING, ANNOYING AND A HAZARD. . THE MANUFACTURER  SHOULD BE ACCOUNTABLE FOR THIS MALFUNCTION. ONE DOES NOT BUY A CAR NEW OR USED  AND EXPECT TO DEAL WITH THIS  FAULTY MECHANISM. ACCORDING TO A GM/CHEVROLET DEALER, THE ENTIRE GEAR SHIFT MUST BE REPLACED. I BELIEVE GM WAS AND IS FULLY  AWARE OF THIS MALFUNCTION AND NEGLECTED TO RESOLVE THE PROBLEM.",
        "vin": "1G1JA5SH0D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338561,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN HAVING A LOT OF PROBLEMS WITH THE AIR CONDITIONER FOR THE LAST COUPLE WEEKS I BOUGHT IT USED. I JUST SPENT $900 ON A NEW COMPRESSOR FOR THE AIR CONDITIONING AIR SWITCH AND NOW THEY'RE SAYING THAT IT'S ALL ELECTRICAL ISSUES. I WAS WONDERING IF THERE WAS A RECALL ON THE AIR CONDITIONER UNIT FOR A 2013",
        "vin": "1G1JA5SG8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE 84 WHILE DRIVING ON REGULAR ROAD AT NORMAL SPEED. CAR GOES INTO POWER REDUCTION MODE. IT'S DIFFICULT TO ACCELERATE AND THE \"SEE MECHANIC\" SYMBOL ON THE DASH. TOOK IT TO MIDAS, HAD THE PEDAL ASSEMBLY REPLACED AND ELECTRICAL WIRES GREASED. NEXT WEEK SAME THING, REPLACED PEDAL ASSEMBLY AGAIN. SAME THING HAPPENED AGAIN TODAY. DRIVING IN NICE WEATHER GOING UNDER 45MPH. STABILITRACK LIGHT COMES ON AND POWER REDUCTION TURNS ON. TURN CAR OFF, SIT A MINUTE, TURN BACK ON, CHECK ENGINE LIGHT AND POWER REDUCTION OFF. WILL HAPPEN AGAIN. EVERY DAY FOR THE LAST 3 WEEKS AFTER ABOUT A YEAR AGO HAVING PEDAL ASSEMBLY REPLACED. CODE 84 CAME ON AGAIN TODAY, TOOK TO THE MECHANIC, THEY SAY EVERYTHING IS RUNNING FINE WITH THE DIAGNOSTIC READING. NOT SURE WHY THE POWER REDUCTION COMES ON. I HAVE TRIED DRIVING WITH TRACTION CONTROL OFF, TC OFF AND STABILITRACK OFF. NEW TIRES, NEW BRAKES, NEW WINDSHIELD (REPLACED WHEN I BOUGHT THE CAR IN CASE THERE WAS AN INTERNAL LEAK. NO WATER INTRUSION WAS FOUND BY THE MECHANICS. I CANNOT DRIVE THE CAR SAFELY ON THE BUSY ROAD I WORK ON. CAR WILL GO INTO POWER REDUCTION AT RANDOM EVEN WHEN ON THE HIGHWAY, CAUSING THE CAR TO LOSE ABILITY TO ACCELERATE FAST ENOUGH TO NOT GET HIT. ALWAYS WHILE DRIVING. SOMETIMES THE CHECK ENGINE LIGHT STAYS ON AND SOMETIMES IT'S NOT ON AT ALL. INTERMITTENT POWER REDUCTION. MECHANICS SAY COULD BE AN ELECTRICAL ISSUE BUT COULDN'T FIND THE SOURCE OF THE PROBLEM. THIS HAS BEEN HAPPENING ON AND OFF FOR OVER A YEAR AND NO SOLUTION HAS BEEN FOUND. ALL REGULAR MAINTENANCE IS SCHEDULED IN A TIMELY FASHION.  UNKNOWN CAUSE OF SAFETY ISSUE",
        "vin": "1G1JC6SH9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS UNABLE TO GET KEY OUT OF IGNITION DUE TO THE GEAR SHIFT BUTTON BEING STUCK IN.",
        "vin": "1G1JC6SG6D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING WATER PUMP",
        "vin": "1G1JH6SB5D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "04/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED WITH THE RADIO GOING DARK SOMETIMES NOT WORKING THEN THE WINDOWS WONT\" GO DOWN THEN MY CAR WOULD NOT TURN ON TOOK IT TO MANY MECHANICS NO ONE COULD FIGURE OUT WHAT'S WRONG FINALLY ONE TOLD ME THAT SOME SONICS HAD A RECALL AND IT WAS DOING THE SAME THING AS MINE.THIS IS MORE OFTEN IT WAS ONCE IN A WHILE BUT NOW IS VERY OFTEN MY RADIO DOESN'T COME ON AND MY HEAD LIGHTS KEEPS GOING OFF TOO.  *TR",
        "vin": "1G1JC5SH2DD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MYLINK STEREO SYSTEM ALL THE SUDDEN BEGAN CHANGING STATIONS ON ITS OWN CONSTANTLY.  IT REPROGRAMMED ALL STATIONS TO THE SAME CHANNEL, THE TOUCH SCREEN WILL NOT RESPOND TO TOUCH.  BLUETOOTH HANDS FREE HAD TO BE DISCONNECTED BECAUSE IT ALSO RANDOMLY CALLS PEOPLE IN MY RECENTLY CALLED LIST, OFTEN CLIENTS.  I HAVE A PREPAID XM SUBSCRIPTION BUT CANNOT USE MY RADIO AT ALL.  THERE ARE A NUMBER OF US WITH THE SAME ISSUE AND WE HAVE IDENTIFIED EACHOTHER IN A FACEBOOK GROUP.  THERE ARE AT LEAST 10-15 PEOPLE WHO ARE CURRENTLY EXPERIENCING THE SAME ISSUE. THE STEREO ACTUALLY CALLED 911 ONE DAY BECAUSE I HAD RECENTLY DIALED THE NUMBER TO REPORT AN ACCIDENT OUTSIDE MY HOME.  THIS COULD CAUSE SAFETY ISSUES. THIS HAPPENS WHETHER THE VEHICLE IS IN MOTION OR PARKED, ANY TIME OF DAY.  IT'S LIKE THE STEREO HAS JUST GONE HAYWIRE.  *TR",
        "vin": "1G1JC5SHXD4"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE IS NOT RUNNING RIGHT I HAD TO PUT STUFF IN TO CLEAN IT OUT THEN IT STILL DRINK THE GAS SO MUCH NO LEEK OR HOLES BUT THE CAR DRINKS SO MUCH GAS I HAVE TO FILL IT UP AT LEAST 2 TO 3 TIME IN 2 WEEKS     SO THE STEERING IS BAD ON IT AS WELL WHEN U TAKE YOUR HAND OFF THE WHEEL IT WANTS TO THE RIGHT ON IT'S OWN IT DOSE NOT DRIVE STRAIGHT WHEN U TAKE YOUR HANDS OFF THE STEERING WHEEL IT SUCKS     U GUYS NEED TO LOOK AT THIS BEFORE SOMEONE GET KILLED FROM THE STEERING WHEEL AND THE GAS LINE ASAP",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THE CAR USED AND EVER SINCE THEN IT HAD A WEIRD DOUBLE LOCKING MECHANISM, SUCH AS WHEN I PUT IT IN PARK IT WOULD UNLOCK BUT WHEN I WENT TO OPEN THE DRIVERS SIDE DOOR IT WOULD LOCK ITSELF AS I WAS IN THE PROCESS OF OPENING IT. SO IT WOULD BE SLIGHTLY OPENED AND I'D HAVE TO PRESS THE BUTTON TO UNLOCK IT TO OPEN THE DOOR. IT DID THIS OFTEN ONLY ON THE DRIVERS SIDE. THEN ONE DAY AFTER I HAD DROVE IT SOMEWHERE WE CLOSED THE DOOR FOR 2 MINS MAX WHEN WE WENT TO USE THE KEY FOB TO OPEN THE DOOR WHILE THE DOOR WAS PARKED IN A DRIVEWAY THE CAR DOOR LOCK WOULD GO UP THEN   IMMEDIATELY BACK DOWN. THE ONLY WAY WE COULD OPEN THE PASSENGER SIDE DOOR WAS TO TRY AND OPEN IT AS THE DOOR LOCK WENT UP BEFORE IT CAME BACK DOWN, WHICH WAS POSSIBLE BUT AFTER GETTING IN THERE WAS NO WAY TO OPEN THE DRIVERS SIDE DOOR AT ALL. IT WAS AS IF THE CAR DOOR LOCK STICK DIDN'T GO UP ALL THE WAY TO ACTUALLY UNLOCK THE DOOR. THERE'S ALSO NO WAY TO GET THE DOOR PANEL OFF WITH THE CAR DOOR BEING CLOSED. WE'VE TAKEN IT TO DIFFERENT PLACES THAT HAVE ACTUALLY NO IDEA WHAT'S WRONG WITH IT. THIS IS SUCH A HUGE SAFETY PROBLEM WITH THE CAR DOOR NOT BEING ABLE TO OPEN AT ALL IF THERE WAS A CAR CRASH OR ANYTHING.",
        "vin": "1G1JC5SH2D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS LEAKED OUT ITS ENTIRE COOLANT TWICE NOW WITHIN A SIX MONTH PERIOD. THIS TIME IT HAS LEAKED FLUID ONTO THE COMPUTER CAUSING FURTHER ISSUES THAN AFTER THE FIRST FIX. THE LACK OF A TEMPERATURE GAUGE TO PREVENT THE CAR FROM OVERHEATING IS A HUGE ISSUE. I CONSTANTLY MAKE SURE THERE IS COOLANT BEFORE DRIVING THE VEHICLE AND ALL IN THE SAME DAY IT HAS EMPTIED WITHOUT MY KNOWLEDGE CAUSING A CHECK ENGINE LIGHT AND BREAKDOWN INSTANTLY. IT HAS HAPPENED TWICE NOW WITH MY TODDLER IN THE VEHICLE, THIS SHOULD BE A RECALL BECAUSE FORTUNATELY IT HAS HAPPENED WHILE ON STREET ROADS, WHERE I COULD IMMEDIATELY AND SAFELY MOVE INTO A PARKING LOT, AND NOT THE HIGHWAY BUT THIS SITUATION PUTS MY CHILD'S HEALTH AT RISK AND THAT I AM NOT OKAY WITH.",
        "vin": "1G1JC5SGXD4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE STOPPED, THE VEHICLE STARTED SHAKING ABNORMALLY AND STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO BOB GRIMM CHEVROLET LOCATED AT (2271 S MAIN ST, MORTON, IL 61550, (309) 263-2241) WHERE AN APPOINTMENT WAS SCHEDULED TO HAVE THE VEHICLE DIAGNOSED AND TEST DRIVEN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY VAN CHRYSLER PACIFICA BACK ON JULY 30 2018 AFTER COUPLE MONTHS AFTER I STATER NOTICING SLIDING DOOR DRIVER SIDE WHEN TRYING TO CLOSE IT EITHER BY KEY FOB INSIDE BUTTON NOR DOOR WAS NOT CLOSING ANY ONCE NEED IT TO TRY 3 OR 4 TIMES TO CLOSE ALL THE WAY THEN RADIO TURNING OFF I CALLED A WEB CALLED PACIFICA CARES THEN I WAS REACH BY THEM I WAS TOLD TO PROVIDE A EMAIL PHONE NUMBER TIME AND DATE OF APPOINTMENT  NAME AND ADDRESS OF THE DEALERSHIP THEN Y WAS REACH BY ONE CASE MANAGER I SHARE WITH HER THE ISSUES WE AGREED ON THE APPOINTMENT AT THE DATE AND TIME WHICH WAS YESTERDAY 2/26/2020 8 AM SHE SAID SHE CALLED THEM EXPLAINED TO THEM WHAT WAS GOING TO HAPPEN AT THE DATE AND TIME SO I GOT TO THE DEALERSHIP AND NONE HAD A CLUE ABOUT MY REASON SO I EXPLAINED TO SERVICE PERSON HE SAID YOU CAN'T GENERALIZED AND SAID THE ISN'T NO ISSUES WHATSOEVER WHICH  PACIFICAS I CALLED CASE MANAGER BUT SHE WASN'T REACHABLE BECAUSE SHE'S IN OTHER STATE SO  I WAS TOLD BY ADVISOR AT THE SERVICE THAT SHE NEVER TALK TO HIM  AFTER TWO HRS I WAS REACH BY MY CASE MANAGER AND THEN EXPLAINED TO ME THAT I NEED IT TO PAY THE DIAGNOSTIC TO BE ABLE TO MOVE FORWARD IN THE CASE WHICH IT COST 140$ I TOLD HER THAT I WAS NEVER TOLD THAT I NEED IT TO COVER THAT OUT OF MY PACKET BEFORE THEY CAN MAKE ANY DECISION AT THIS POINT I'M VERY DISAPPOINTED AND UPSET BECAUSE I WAS NEVER TOLD THAT I NEED IT TO PAY FOR THIS DIAGNOSIS IF I CAN GET ANY HELP WILL APPRECIATE",
        "vin": "1G1JC5SG4D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307686,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BUTTON ON GEAR SHIFT GETS STUCK IN THE PUSHED IN POSITION CAUSING THE GEAR SHIFT TO MOVE EVEN IF BUMPED. IF DRIVING THIS COULD CAUSE A CRASH RESULTING IN INJURY, OR DEATH. WHEN GEAR SHIFT BUTTON IS PUSHED IN IT PREVENTS THE CAR FROM COMPLETELY TURNING OFF AND  KEY FROM COMING OUT. THIS POSES A RISK OF THEFT.",
        "vin": "1G1JC5SB8D4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307120,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR GAVE ME A CODE OF U0101 AND TOOK IT TO CHEVY DEALERSHIP AND TOLD ME IT HAS SOMETHING TO DO WITH LOST COMMUNICATION. THEY TRIED FIXING ISSUE BUT COULDN'T.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN OVER HEATING AT SHORT DISTANCES. A/C WENT COOL RAN HOT AIR TRIED TO SEE IF FREON JUST NEEDED REFILLING BUT EVEN USING ALOMST A FULL CAN STILL NOTHING. HAVING FUEL ISSUES BIG DIFFERENCE WEEKS APART FUEL ISSUES.THEN OVER HEATING, NEXT UNABLE TO HOLD COOLANT, CAR WAS RETURNED TO DEALER FOR REPAIR. STILL UNABLE TO KEEP COOLANT FROM LEAKING, WHILE DRIVING ON INTERSTATE I 95 OUT OF NO WHERE I LOOSE THE ABILITY OF SPEED THEN SHUTTERING RUNNING HOT AGAIN BLEW HEAD GASKET LOST POWER HARD TO GAIN CONTROL AND WAS ALMOST HIT 2 TIMES BY CAR BEHIND AND ON SIDE.CAR HAD TO BE PUSHED TO SHOULDER AND PICKED UP WITH WRECKER SERVICE. MECHANIC HAD TO COME TO CAR BC IT WOULDN'T STSRT. HE SAID THE GASKET IS GONE. CAR WILL NOT DO ANYTHING NOW. WILL GET RECEIPTS FROM DEALER SERVICING, WRECKER, AUTO ZONE MULT COOLANT PURCHASES, MECHANIC",
        "vin": "1G1JE5SB3D4"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AND WAS COMING UP TO AN INTERSECTION I HAD TO TURN AT. I PUSHED THE BREAK PEDAL, BUT IT WAS REALLY STIFF AND DIDN'T DO MUCH. MY CAR SLID ACROSS THE ROAD INTO A WOODEN ELECTRIC POLE BECAUSE IT WOULD NOT STOP. MY CAR IS TOTALED AND NOW I HAVE TO FIGURE OUT SOME WAY TO GET A DIFFERENT VEHICLE.",
        "vin": "1G1JC5SH5D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM UNABLE TO REMOVE THE IGNITION KEY. WHEN THE CAR IS IN PARK WITH THE IGNITION TURNED OFF, THE KEY WILL NOT RELEASE. IT USE TO HAPPEN OCCASIONALLY BUT NOW FOR THE PAST 2 WEEKS, IT HAS HAPPENED EVERY TIME I HAVE PUT THE CAR IN PARK AND TRIED TO TAKE THE KEY OUT.",
        "vin": "1G1JA5SH5D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON ON THE SHIFTER STICKS IN.  SO YOU CAN'T RELEASE THE KEY FROM THE IGNITION AFTER TURNING THE VEHICLE OFF.  IT ALSO STICKS IN WHILE IN GEAR (DRIVE)  MAKING THE SHIFTER UNABLE TO ' LOCK' IN GEAR AND EASILY BUMPED OUT OF GEAR WHILE DRIVING.",
        "vin": "1G1JC5SB0D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BUTTON ON SHIFTER STICKING  CAN'T TAKE KEYS OUT OF IGNITION WHEN IN PARK AND BUTTON STAYS IN WHILE DRIVING SO IF THE SHIFTER IS BUMPED IT WILL SHIFT OUT OF GEAR.. CAUSING A MAJOR SAFETY ISSUE!  I LOOKED ONLINE AND THIS SEEMS TO BE A REGULAR PROBLEM WITH CHEV SONIC OWNERS",
        "vin": "1G1JC5SB0D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243204,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P0171 AND P0420. I HAVE REPLACED EVERYTHING IN THE CAR THAT THESE CODES STATE. NEW THERMOSTAT, CATALYTIC CONVERTER, BOTH 02 SENSORS, EXHAUST HOSE. FIXES FOR A FEW DAYS TO A WEEK AND THE SAME CODES KEEP COMING BACK.    NOW THE BUTTON ON MY GEAR SHIFT STICKS KEEPING THE GEAR SHIFT FROM LOCKING INTO PLACE. THIS STOPS ME FROM BEING ABLE TO TURN MY CAR COMPLETELY OFF AND REMOVING KEY FROM IGNITION.",
        "vin": "1G1JC5SGXD4"
    },
    {
        "components": "SUSPENSION,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SONIC NOW RUNS VERY SPOTTY, POOR ACCELERATION, AND SLOW BUMPY IDLE.  PRIOR BALL JOINT WAS REPLACED AND THE CV AXIL , ENTIRE ENGINE REPLACED. BELIEVE IT OR NOT, WATER PUMP REPLACED. THESE REPAIRS, WITH RECEIPTS, CONSTITUTE A LEMON LAW BREACH. I SHOULD BE ENTITLED TO A NEW CAR OR COMPENSATED. YES, THE SUSPENSION ISSUE DID HAPPEN WHILE I WAS DRIVING, AS WELL AS THE ENGINE. WILL UPLOAD DOCUMENTS SOON.OH, ONE LAST THING, VERY DIFFICULT REMOVING KEY FROM IGNITION, BEEN GOING ON 4 MONTHS.",
        "vin": "1G1JC6SH4D4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 SONIC LS -FROM THE START, THE AIR CONDITIONER DOESN'T WORK, THE CAR WAS DRIVING ON FREEWAY  SWAYS UNCONTROLLABLY BUT SEEMS LIKE WIND AT FIRST BUT THERE'S  NO WIND. IT STARTED JERKING AND HESITATING, LIGHTS AND RADIO FLICKERING, WHEN IN MOTION IN FREEWAY, CAR STARTED GETTING HOT BUT NOT ALL THE WAY OVER HEATING PULLED OVER THEN THE STEERING COLUMN LOCKED IN THE TURN TO PULL OVER, WHEN STOPPED, THE CAR RPM STARTED REVVING BUT CAR WASN'T GOING NOWHERE, THEN TURNED THE CAR OFF AFTER PUTTING IN PARK AND AND THE KEY WON'T COME OUT OF THE IGNITION...AFTER WIGGLING THE KEY FOR A FEW MINUTES IT RELEASED. TOWED THE CAR TO FRIENDLIES AUTO REPAIR SHOP AND TOLD THEM EVERYTHING THAT WAS HAPPENING THEY SAID THEY NEEDED TO REPLACE THE RATIATOR FOR $1400.00 AND WE PAID IT.  HOWEVER THE CAR IS STILL DOING THE SAME THING AND THE RADIATIR DIDNT FIX ANYTHING WE SEEN AS BEING WRONG. NOW THEY SAID IT'S THE COMPRESSOR BUT WE DON'T HAVE ADDITIONAL MONEY TO CONTINUE FIXING. I READ ONLINE OTHERS WITH THIS CAR ARE HAVING SIMILAR ISSUES.",
        "vin": "1G1JA5SH4D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON GOT STUCK AND I COULDN'T PUSH IT IN TO SWITCH GEARS. THE VEHICLE WOULD NOT GET OUT OF PARK. IT STARTED WHEN I STOPPED AT MY MAILBOX, AND PUT IT IN PARK SO MY DAUGHTER COULD GET OUT AND CHECK THE MAIL. WHEN I WENT TO PUT IT IN DRIVE IT WOULDN'T SHIFT. FINALLY AFTER SITTING THERE ABOUT 5 MIN IT MOVED. AFTER THAT IT WOULD ONLY DO IT OCCASSIONALLY. NOW ITS GETTING STUCK (PUSHED IN) MORE AND YOU CAN SWITCH GEARS WITHOUT PUSHING ANYTHING. IF SOMEONE HITS IT THEN WE ARE WRECKING. THIS HAS BEEN GOING ON WITH THESE CARS BECAUSE I HAVE RESEARCHED THIS AND THIS IS THEIR PRODUCT OF CHEAP!! LUCKILY NOTHING HAS HAPPENED YET WHILE DRIVING",
        "vin": "1G1JC5SH2D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHIME IS NOT WORKING IN MY CAR. I CALLED GM ABOUT THIS AND THEY SAID THE RECALL 17130 HAS ALREADY BEEN CLOSED ON MY CAR BUT THE CHIME IS NOT WORKING. IT SEEMS TO BE A PROBLEM WITH MYLINK AS OTHER THINGS ARENT WORKING EITHER.    SUMMARY  GENERAL MOTORS LLC (GM) IS RECALLING CERTAIN MODEL YEAR 2013-2016 CHEVROLET SONIC AND TRAX VEHICLES AND 2013-2015 CHEVROLET SPARK VEHICLES EQUIPPED WITH A BRING YOUR OWN MEDIA RADIO. THE AFFECTED RADIOS MAY FAIL TO PROVIDE AN AUDIBLE WARNING CHIME WHEN THE DRIVER, AFTER TURNING OFF THE IGNITION AND LEAVING THE KEY IN THE CYLINDER, WAITS 10 MINUTES OR LONGER TO OPEN THE DOOR. AS SUCH, THESE VEHICLES FAIL TO COMPLY WITH THE REQUIREMENTS OF FEDERAL MOTOR VEHICLE SAFETY STANDARD (FMVSS) NUMBER 114 \"THEFT PROTECTION.\"  WITHOUT AUDIBLE INDICATORS, THE DRIVER MAY LEAVE THE KEY IN THE IGNITION, INCREASING THE RISK OF THEFT.  GM'S NUMBER FOR THIS RECALL IS 17130.",
        "vin": "1G1J5SH1D41"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CONTROL MODULE FAILED. WHEN I WAS BACKING UP, I FELT A JERK AND WHEN I PUT IT BACK IN \"DRIVE\", THE \"D\" INDICATOR LIGHT WAS BLINKING. I TOOK IT TO THE SHOP AND THEY SAID THE TCM HAD TO BE REPLACED.",
        "vin": "1G1JC5SB7D4"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SOMEONE IS SITTING IN THE PASSENGER SEAT, IT DOES NOT ALWAYS SHOW \"ON\" ON THE DISPLAY FOR THE AIRBAG. AT LEAST ONCE IT HAS DISPLAYED BOTH \"ON\" AND \"OFF\" AT THE SAME TIME AND DID NOT RECOGNIZE IF THE SEATBELTS WAS LATCHED OR NOT.",
        "vin": "1G1JD5SH2D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223048,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE KEY IS IN THE IGNITION IT DOES NOT CHIME WHEN THE DOOR IS OPEN. IT WILL ONLY CHIME WITH THE DOOR OPEN IF IT IS TURNED TO ACCESSORY.",
        "vin": "1G1JD5SH2D4"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS FIRST STARTED AND TURNED OFF, THE HORN GOES OFF EACH TIME. IF PARKED BUT STILL RUNNING, THE HORN GOES OFF EVERY 2-3 MINUTES. WHEN LOCKING THE CAR, IT DOESN'T MAKE ANY NOISE INDICATING IT HAS BEEN LOCKED. WHEN PHONE IS PLUGGED IN, THE MUSIC DOESN'T ALWAYS WORK PROPERLY. THERE IS A PIECE TO ONE OF THE HOSES THAT BROKE AND IS NOW MAKING CAR RUN LEAN. WHEN IDLING (AT A RED LIGHT OR STOP SIGN) THE ENGINE SHAKES VIGOROUSLY AND IS HARDER TO GET BACK SPEED. WHEN CAR IS RUNNING AND THE HOOD IS OPEN, THERE IS A HISSING SOUND.",
        "vin": "1G1JC5SH1D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206126,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET SONIC TURBO HAS ISSUE WITH COOLANT SYSTEM. CAR IS CONSTANTLY TRIGGERING THE 'CHECK ENGINE' LIGHT AND MAY CAUSE DAMAGE TO CAR DUE TO OVERHEATING AND COOLANT LEAK. COOLANT LEAKS AFTER CALL IS NOT IN MOTION AND TRYING TO COOL. FAN CONTINUES TO RUN AFTER VEHICLE HAS BEEN SHUT DOWN.",
        "vin": "1G1JE5SB6D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TRAIN - TRANSMISSION FAILURE - I WAS TRAVELING ON THE INTERSTATE AT 70 MPH AND ALL OF A SUDDEN MY CAR LOST POWER AND WENT TO 5 MPH; THE RPM'S REVVED AT 3500 YET NO POWER WENT TO THE WHEELS. IT WAS AN EXTREMELY PRECARIOUS SITUATION IN WHICH I WAS NEARLY RAMMED BY SEVERAL VEHICLES BEFORE I LIMPED OFF THE EXIT AT 5 MPH; STILL VERY MUCH IN DANGER. I WAS ABLE TO PULL INTO A SAFE SPACE AND CALLED AAA FOR A TOW. IT WAS A SATURDAY NIGHT SO NO SERVICES WERE AVAILABLE. THIS CAR ONLY HAS 37,000+ MILES ON IT, HAS BEEN REGULARLY SERVICED BY THE DEALER AND IS OUT OF WARRANTY ON THE POWER TRAIN. NO CAR SHOULD HAVE ITS TRANSMISSION GO OUT WITH SUCH LOW MILEAGE AND REGULAR SERVICE. THIS IS A SERIOUS SITUATION AND A FLAW IN THE TRANSMISSION SYSTEM OF THIS CAR. COST TO REPAIR FOR A NEW TRANSMISSION BY THE DEALER IS SET AT $4100, VERY UNREASONABLE FOR A CAR WHO'S WARRANTY JUST WENT OUT THREE MONTHS AGO. THE DANGER OF A CAR GOING FROM 70 MPH TO 5 MPH WITH NO WARNING WAS FRIGHTFUL AND I AM GRATEFUL TO BE HERE AND THAT NO ONE CRASHED INTO ME. I HAVE ESCALATED THIS UP TO GM FOR INVESTIGATION.",
        "vin": "1G1JC6SG5D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203779,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT JUST PURCHASED THE VEHICLE AND NOTICED THAT THE CHIME FAILED TO SOUND WHEN THE KEY WAS PLACED IN THE IGNITION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INFORMED THE CONTACT TO TAKE THE VEHICLE TO A CHEVROLET DEALER. THE VEHICLE WAS TAKEN TO GOLD RUSH CHEVROLET (LOCATED AT 570 GRASS VALLEY HWY, AUBURN, CA 95603, (530) 392-4672), BUT WAS NOT DIAGNOSED OR REPAIRED DUE TO THE DIAGNOSTIC AND REPAIR FEES. THE CONTACT ALSO STATED THAT ALL THE DOORS FAILED TO REMAIN UNLOCKED WHEN EXITING THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND PROVIDED CASE NUMBER: 9-5199799138. THE CONTACT WAS REFERRED TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 94,000.",
        "vin": "1G1JC6SH6D4"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHEN THE VEHICLE WAS STARTED, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO JACK SCHMITT CHEVROLET OF O'FALLON (LOCATED AT 127 REGENCY PARK, O'FALLON, IL 62269, (618) 509-9727) WHERE IT WAS DIAGNOSED THAT THE CATALYTIC CONVERTER NEEDED TO BE REPLACED; HOWEVER, THE PART WAS NO LONGER MANUFACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 9-5195608729. THE APPROXIMATE FAILURE MILEAGE WAS 96,540.",
        "vin": "1G1JC5SB2D4"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197182,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - THE ENGINE HAS BEEN MISFIRING THIS HAS ALSO HAPPEN TO SOMEONE ELSE I KNOW WHO HAS HAD THE SAME VEHICLE. THIS IS VERY UNSAFE AND THEY DON'T HAVE IT AS A RECALL YET BUT ALL OF THE DEALERSHIP ARE AWARE OF IT. THE VEHICLE JERKS WHEN YOUR DRIVING OR WHEN ITS PARKED. THIS IS NOT THE ALTERNATOR OR ANYTHING ELSE I HAD THAT REPLACED AND NOTHING WAS WRONG WITH IT AND THE SAME ISSUE IS STILL OCCURRING. IT A BAD PART THEY PUT IN THE ENGINE AND IT NEEEDS TO BE RECALLED. IT IS UNFAIR AND NOT SAFE FOR CUSTOMERS WITH THIS ISSUE. THE VEHICLE JERKS AND WHEN IS DOES IT IT FEELS LIKE IT HESITATES TO DRIVE WHILE IN DRIVE MODE. THIS HAS BEEN HAPPENING FOR A COUPLE OF MONTHS IT HAS JUST GOTTEN WORSE AND I AM TRULY SCARED.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11191644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INDICATIOR LIGHT FOR LOW TIRE PRESSURE COMES ON BUT NO WARNING CHIME IS HEARED. THIS CAN BE VERY BAD WHEN DRIVING ON THE INTERSTATE. THE TIRE WAS LOOSING PRESSURE WITHOUT ME KNOWING AND I HAD NO CLUE UNTIL THE VEHICLE RAN OFF THE ROAD DUE TO NOT BEING ABLE TO CONTROL IT. THE CHIME NEVER WENT OFF. SAME WITH AN OVER HEATING ISSUE THE LIGHT CAME ON BUT I DID NOT KNOW IT WAS OVER HEATING UNTIL IT STATED SHAVING AND STEAMING AND I LOOKED AT THE DASH TO SEE THE LIGHT ON.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEED LIMIT GOES IN AND OUT TO DIFFERENT NUMBER SO I WON'T KNOW WHAT'S THE ACTUAL LIMIT. THE RADIO GOES IN AND OUT SO SOMETIMES WHEN IT COMES BACK IN IT SCARES ME. DIFFERENT SIGNALS ARE POPPING IN AND OUT ON THE DASHBOARD SO I'M NOT SURE ABOUT THAT. THIS HAS BEEN HAPPENING SINCE I'VE HAD THE CAR SO THE DATE IS WHEN I RECEIVED THE CAR. THE CAR'S DEALER SAID THEY TRIED EVERYTHING AND THERE IS NOTHING ELSE THEY COULD COULD DO.",
        "vin": "1G1JA5SH4D4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT AIRBAG SENSOR GOES OUT. IF SOMEONE IS IN THE SEAT, AIR BAG WILL NOT DEPLOY WHEN  NECESSARY",
        "vin": "1G1JA5SH9D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FOUND ONE NEW LEAK AND ONE LEAK THAT HAS BEEN THERE FOR AT LEAST A YEAR. THE NEW LEAK IS THE RADIATOR. IT IS LEAKING AT THE TOP ON THE DRIVER SIDE RIGHT WHERE THE PLASTIC AND ALUMINUM MEET. THE OTHER LEAK IS THE PLASTIC THERMOSTAT HOUSING.  CURRENT MILES: 69,500",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING OUT OF MY DRIVEWAY, PLACED CAR I PARK FOR A BRIEF SECOND TO MOVE TRASH CAN OUT OF DRIVEWAY WHEN I CAME BACK TO THE CAR MY PUMPSHIFT BUTTON WAS STUCK INSIDE THE CLUTCH IF THAT'S WHAT YOU CALL THE THINGY THAT CHANGES GEAR AND I WAS STUCK IN THE MIDDLE OF THE STREET, DURING SCHOOL HOURS EXTREMELY FRUSTRATING! I HAD TO USE A NEEDLE LIKE CLIP TO PUSH THE BUTTON THINGY OUT AND MOVE MY CAR IT TOOK ME A GOOD TEN MINUTES MAYBE! MADE ME LATE FOR WORK!",
        "vin": "1G1JC5SH9D4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR ALL BLACK 2013 CHEVROLET SONIC'S HAVE A BAD PAINT JOB.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "12/01/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE OPERATING THE VEHICLE, A BURNING ODOR WAS PRESENT. UPON INSPECTION, IT WAS DISCOVERED THAT FLUID/WATER WAS LEAKING FROM THE ENGINE COMPARTMENT. THE VEHICLE WAS TAKEN TO 5 STAR CHEVROLET (495 WATSON BLVD, WARNER ROBIN, GA) WHERE IT WAS DIAGNOSED THAT THE  WATER PUMP WAS FAULTY. THE CONTACT INDICATED THAT THE WATER PUMP WAS PREVIOUSLY REPLACED, BUT THE FAILURE RECURRED ONE YEAR LATER. THERE WERE NO WARNING INDICATORS ILLUMINATED WHEN THE ENGINE OVERHEATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G1JB5SH6D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED FOUR COOLING SYSTEM (RADIATOR, WATER PUMP, ENGINE BLOCK COOLANT INTAKE, COOLANT EXPANSION TANK, ENGINE/TURBO COOLANT PIPING) RELATED PROBLEMS WITH THIS VEHICLE AMOUNTING TO OVER THREE THOUSAND DOLLARS IN REPAIR COSTS.  FOUR MAJOR REPAIR EXPENSES ON THE SAME SYSTEM IS QUESTIONABLE IN MY OPINION, THE TWO MOST MAJOR OCCURRING WITHIN THE SAME MONTH.  THESE ALL WERE NOTED DURING NORMAL OPERATION OF THE VEHICLE.",
        "vin": "1G1JG6SB9D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164285,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR INTAKE SYSTEM. NOT LONG AFTER WE BOUGHT THE CAR THE CHECK ENGINE LIGHT CAME ON READING A CODE PH171. WE WERE TOLD IT WAS A KNOCK SENSOR WHICH WE REPLACED AND IT DIDN'T FIX THE PROBLEM, AFTER WE WERE TOLD IT WAS THE AIR INTAKE HOSE, CHECKED IT AND IT LOOKS LIKE IT'S A NEW HOSE NO ISSUES WITH IT.  NOW WE ARE TRYING EVERYTHING WE CAN TO FIGURE OUT THE PROBLEM. WE CHECK ONLINE FORUMS AND FOUND OUT THAT THIS IS A HUGE PROBLEM WITH THIS CAR AND ALMOST NO ONE KNOWS EXACTLY WHAT IT IS TO FIX IT.  WHEN THE CAR IS DRIVING IT SEEMS FINE BUT AS SOON AS YOU STOP AND IT IDLES IT SEEMS LIKE IT WANTS TO DIE AND ALMOST HAS A FEW TIMES. WAS JUST CURIOUS IF THIS IS SUCH A HUGE PROBLEM THAT SO MANY PEOPLE ARE HAVING WHY THERE HAS NOT BEEN A RECALL?",
        "vin": "1G1JC5SH2D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT GETS STUCK AND WON'T MOVE OUT OF PARK. THE BUTTON IS STICKING OUT AND YOU CAN'T PUSH IT IN. I STOPPED TO CHECK THE MAIL AND PUT IT IN OARK GOT OUT CANE BACK AND TRIED TO PUT IN DRIVE AND IT WAS STUCK. I WAS AT WALMART PARKED CAR TURNED OFF AND WENT INSIDE CAME BACK FOR IN STARTED VEH WENT TO PUT IN REVERSE AND AGAIN IT WAS STUCK. AFTER AWHILE OF MESSING WITH IT, IT FINALLY MOVED",
        "vin": "1G1JC5SH2D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSH BUTTON ON THE GEAR SHIFT STICKS PREVENTING THE SELECTION (PARK, NEUTRAL, DRIVE ETC) TO LOCK IN PLACE. IN THEORY IF DRIVING THE GEAR SHIFT COULD BE BUMPED INTO NEUTRAL. IT ALSO MAKES REMOVING THE KEYS FROM THE IGNITION EXTREMELY DIFFICULT. IT HAPPENS EITHER STATIONARY OR IN MOTION. A TEMPORARY REMEDY IS STICKING A DIME ON TOP OF THE PUSH BUTTON SELECTOR.",
        "vin": "1G1JC6SH9D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11143110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET SONIC. CONSUMER WRITES IN REGARD TO AN ACCIDENT THAT CAUSED DEPLOYMENT OF AIRBAGS WHICH CAUSED THE CONSUMER TO OBTAIN BRAIN DAMAGE.  *AS *JS    *JS *TT    VIN INVALID *JB",
        "vin": "1G1JC5SB5D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A SHIFT FLARE WHEN SWITCHING FROM GEAR 2 TO GEAR 3. THIS WOULD HAPPEN WHEN THE CAR WAS WARMED UP. WHEN IT WAS COLD, IT WOULD NOT HAPPEN. THERE WAS NO FLUID LEAK.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WATER PUMP WAS LEAKING.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE HESITATED AND CEASED TO MOVE. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 76,788.",
        "vin": "1G1JC6SG4D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE THE VEHICLE WAS STATIONARY AND WHILE DRIVING VARIOUS SPEEDS, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO SARRA CHEVROLET (1170 CENTERPOINT PARKWAY, BIRMINGHAM, ALABAMA 35215, (205) 853-2906) WHERE THE THERMOSTAT WAS REPLACED AT APPROXIMATELY 24,000 MILES. THE CONTACT STATED THAT FAILURE RECURRED. THE DEALER DIAGNOSIS REVEALED DIAGNOSTIC TROUBLE CODE: P0597 (THERMOSTAT HEATER FAULT, REPLACE THERMOSTAT HOUSING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 24,397.",
        "vin": "1G1JC5SH3D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO MALFUNCTION CAUSING NO AUDIBLE NOISE FOR TURN SIGNALS, SEAT BELT INDICATOR OR KEY LEFT IN IGNITION INDICATOR.",
        "vin": "1G1JC6SB6D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/10/2018",
        "dateOfIncident": "05/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11128474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 CHEVROLET SONIC. WHILE DRIVING 55 MPH, THE CONTACT'S VEHICLE WAS RUN OFF THE ROAD BY ANOTHER VEHICLE. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO A POLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE NECK AND A FRACTURED RIGHT RIB, WHICH NEEDED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED AND TOWED TO A JUNKYARD. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "01/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC RECALL  SINCE 2016, I HAVE HAD A CONTINUOUS PROBLEM WITH MY CARS ELECTRIC FEATURES. IT STARTED WITH THE RADIO RANDOMLY SHUTTING OFF, THEN I NOTICED THAT WHEN I WOULD PARK MY CAR, I WAS UNABLE TO TAKE MY KEY OUT OF THE IGNITION AS IF IT WAS STUCK. THIS HAS CAUSED MULTIPLE SITUATIONS WHERE I WOULD HAVE TO LEAVE MY KEY IN THE IGNITION BECAUSE I COULDN'T TURN OFF MY CAR. EVENTUALLY MY CAR WAS STOLEN DUE TO THIS ISSUE. LUCKILY, I WAS ABLE TO GET MY CAR BACK, HOWEVER, THE PROBLEM STILL PERSISTS. ANYTIME I STOP MY VEHICLE AND PUT IT IN PARK, THE KEY STILL STICKS AND I CANNOT GET IT OUT.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURBOCHARGER FAILED. IT SEEMS LIKE A COMMON ISSUE BECAUSE THE REPLACEMENT PART IS ON NATIONAL BACKORDER. DRIVING WITHOUT REPLACEMENT POSES SAFETY CONCERNS. IT IS ALSO A LARGE EXPENSE WHEN NOT COVERED AFTER THE 5 YEAR POWERTRAIN WARRANTY EXPIRES.",
        "vin": "1G1JD5SB8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE THE VEHICLE WAS STATIONARY, THE KEY WAS REMOVED FROM THE IGNITION, BUT THE ENGINE FAILED TO TURN OFF. IN ADDITION, THE VEHICLE WOULD NOT ACCELERATE BEYOND 5 MPH. FURTHERMORE, ALL OF THE POWER WINDOWS BECAME INOPERATIVE. THE DEALER (POWER CHEVROLET, 500 SW SUBLIMITY BLVD, SUBLIMITY, OREGON 97385, (866) 928-5319) WAS MADE AWARE OF THE FAILURES AND REPAIRED THE WIRING IN THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND PROVIDED THE CONTACT WITH CASE NUMBERS: 8-4486719908 AND 8-4102065156. THE FAILURE MILEAGE WAS APPROXIMATELY 69,896.",
        "vin": "1G1JE6SB0D4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING DOWN  THE ROAD. THE WHOLE AIRBAG COMPARTMENT ON THE STEERING WITH THE HORN BECAME UNATTACHED AND FELL INTO MY LAP CAUSING ME TO ALMOST WRECK.",
        "vin": "1G1JC6SH9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\". MY AIR CONDITIONER WENT OUT ON MAY 28,2018 WHILE I WAS SITTING IN MY YARD WAITING TO COOK OFF MY CAR. SO I HAVE REPLACED THE AIR COMPRESSOR FUSE AND RELAYS AND IT STILL DOES NOT WORK. IT CAME ON ONCE SINCE THEY HAVE BEEN EXCHANGED AND THE COMPRESSOR STILL WILL NOT COME BACK ON AFTER I HAVE HAD IT UNPLUGGED AND PLUGGED BACK IN.",
        "vin": "1G1JC5SH0D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT WAS UNABLE TO UNLOCK THE VEHICLE'S DOORS AND BECAME LOCKED OUT OF THE VEHICLE FOR HOURS. THE CONTACT STATED THAT THE DOORS WERE FINALLY ABLE TO OPEN AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND WAS INFORMED THAT THERE WAS A SHORTAGE DUE TO A FAILING DOOR SENSOR. THE CONTACT CALLED JENNINGS CHEVROLET BUICK GMC AT (717) 496-4158 (LOCATED AT 916 NORLAND AVE, CHAMBERSBURG, PA 17201) WHERE AN APPOINTMENT WAS SCHEDULED FOR DIAGNOSTIC TESTING AND REPAIRS. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 44,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2018",
        "dateOfIncident": "06/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED OVER HEATING AS I WAS DRIVING IN THE CITY AS SOON AS I TURNED THE AIR CONDITIONING ON IT STARTED THROWING HOT AIR FROM VENTS THEN THE OVER HEATING SYMBOL CAME ON AND THEN IT STARTED TO FLASH A CHECK ENGINE LIGHT AND ENGINE STARTED TO SLOW DOWN I HAD TO STOP AND OPEN THE HOOD AND LET THE ENGINE COOL DOWN THEN IT FLASHED CODE 84 AND THEN IT STARTED TO OVER HEAT AGAIN",
        "vin": "1G1JA5SH9D4"
    },
    {
        "components": "POWER TRAIN,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2018",
        "dateOfIncident": "04/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "-ENGINE VALVE OIL LEAK  -ENGINE VALVE COVER HAD TO BE REPLACED DUE TO A CRACK  -OIL PAN LEAK  -HOSES FELL APART WHILE ON HIGHWAY (495) CAUSING ALL REFRIGERANT TO LEAK OUT AND CAUSE A/C TO  BLOW WARM AIR  -ALL COOLANT LEAKED OUT DUE TO FAULTY THERMOMETER HOUSING & GASKET CAUSING THE HEAT TO BLOW OUT COLD AIR. NO CHECK ENGINE LIGHT OR ENGINE TEMPERATURE LIGHT WAS DISPLAYED DESPITE THE FACT THAT THERE WAS NO COOLANT IN THE RESOVOIRE  -SIDE MIRRORS STOPPED ADJUSTING DUE TO FAULTY SWITCH  -DRIVER SIDE HEATED SEAT HAD A SHORTAGE DUE TO FAULTY SEAT CUSHION    THIS VEHICLE ONLY HAS 65,000 MILES ON IT AND HAS HAD TO BE PRACTICALLY REBUILT DUE TO CHEAP/FAULTY PARTS. LEAKING COOLANT CAN CAUSE THE ENGINE TO OVERHEAT.",
        "vin": "1G1JE5SB6D4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEVERAL MANUFACTURAL REPAIRS MY CAR CONTINUES TO RUN HOT. I HAVE HAD OVER $2000 WORTH OF REPAIRS AND MY CAR CONTINUES TO RUN HOT. ALSO THE ELECTRICAL SYSTEM APPEARS TO BE GOING KNOW IF YOU CLOSE THE DOOR WITH THE KEYS IN THE IGNITION THE CAR LOCKS.",
        "vin": "1G1JC6SB9D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "03/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080053,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TO BEGIN, I HAVE BEEN HAVING A SHIFT FLARE PROBLEM WITH MY AUTOMATIC TRANSMISSION. THERE ARE NO TROUBLE CODES IN THE SYSTEM. THIS WOULD HAPPEN WHEN I WOULD GET OFF THE HIGHWAY WHEN THERE WAS A LOT OF TRAFFIC OR WHEN THE CAR WAS RUNNING FOR A LONG TIME. THE PROBLEM WENT AWAY WHEN THE CAR WAS COOLED AND WAS PARKED FOR SEVERAL HOURS. THE RPM WOULD SPIKE ABOUT 200RMP WHEN ACCELERATING. THIS WOULD HAPPEN FROM 2ND TO 3RD GEAR. I HAVE CHANGED THE FLUID AND I HAD TO PUT A LITTLE MORE THAN HALF A QUART OF FLUID INTO IT. THE TRANSMISSION IS LEAKING FLUID. ONE THING THAT I NOTICED WAS THAT THE DRAIN PLUG BACKED OUT. I DON'T KNOW WHY THIS HAPPENED BUT IT LEAKED AROUND IT. THERE IS ANOTHER SMALL LEAK WHERE THE ENGINE AND TRANSMISSION MEET. THIS IS A VERY SMALL LEAK AND IT ONLY LEAKS IN FREEZING TEMPERATURES. THE LEAK THAT HAS BEEN HAPPENING WHERE THE ENGINE AND TRANSMISSION MEET HAS BEEN HAPPENING FOR ABOUT 2 YEARS NOW. I HAVE BROUGHT THE VEHICLE IN TO HAVE SOMEONE TAKE A LOOK AT IT AND THEY SAID THAT THERE WAS NO LEAK.  AT 60-65K MILES, THE FLUID IS A SOLID GLOSSY BLACK COLOR.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "02/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND HEARD A LOUD SOUND ( LIKE A GUN SHOT)LOOKED AROUND AND MY REAR (BACK) WINDOW HAD SHATTERED.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073447,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER SIDE WINDOW HAS WENT DOWN 3 TIMES ONLY THE DRIVER SIDE WINDOW SWITCH QUITS THEY CAN ROLL IT UP AT THE SHOP WITH A COMPUTER BUT I CANT",
        "vin": "1G1JC6SH2D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "02/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SAME ISSUES WITH THE COOLANT LEAK IN THE WATER PUMP FOR THE 1.4L ENGINE IS HAPPENING TO MY 1.8L CHEVROLET SONIC",
        "vin": "1G1JC5SH3D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "11/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE THE THERMOSTAT 3 TIMES AND IT HAS GONE OUT AGAIN.",
        "vin": "1G1JA6SH0D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS AND TURNS OFF ON ITS OWN WHILE DRIVING. NO WARNING.  NO CODES APPEAR ON DASH. AFTER APPRX 5-10 MINUTES OF THE CAR BEING DEAD (NOT ABLE TO START) IT SEEMS TO \"REBOOT\" AND START BACK UP AGAIN WITHOUT A JUMP TO THE BATTERY. THE CAR HAS STALLED ON BOTH THE FREEWAY (1ST TIME) AND CITY STREETS. I'VE TAKEN THE CAR TO TWO DIFFERENT DEALERS AND BOTH ARE UNABLE TO DUPLICATE THE PROBLEM AFTER HAVING THE CAR FOR 3 WEEKS COMBINED. A CLAIM HAS BEEN SUBMITTED TO GM BUT WITH NO RESOLUTION. THE CAR JUST TURNED OFF ON ME THIS MORNING WHILE DRIVING MY DAUGHTER TO SCHOOL LOCATED APPRX 1 MILE AWAY FROM MY HOME.  BOTH OF MY DAUGHTERS HAVE WITNESSED THE PROBLEMS NOW 3-4X.",
        "vin": "1G1JC5SG1D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THINGS STARTED AFTER MY VEHICLE WAS REPAIRED AFTER A CAR HIT ME AND TOOK OFF. I NOTICED THE CHECK ENGINE LIGHT CAME AND STAYED ON, AT CERTAIN TIMES THE CAR EITHER WHILE DRIVING OR WHILE STOPPED THE CAR WILL EITHER SHAKE FOR 2-3 MINUTES OR ALSO WHILE STATIONARY THE TRACTION SYSTEM LIGHT WILL COME ON THEN TURN OFF. I'VE ALSO EXPERIENCED ISSUES WITH SLOW OR NOT AS RESPONSIVE ACCELERATION OR UNPROMPTED  RPG GAUGE REVVING AND SOMETIMES THATS COUPLED WITH THE SHAKING TO THE POINT THAT MY HAS SHUT OFF WHILE DRIVING DOWN A CITY STREET. I WAS NEVER AWARE OF ANY RECALLS SO IM NOT SURE IF IT HAS ANYTHING TO DO WITH A POSSIBLE RECALL THAT HASNT BEEN DIAGNOSED BUT THERES GREAT CAUSE FOR CONCERN.  - SN: I WASNT ABLE TO CHOOSE EVERY AFFECTED PART.",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "01/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 38,000 MILES THE ODOMETER AND TRIP METER ON MY 2013 SONIC STOPPED DISPLAYING NUMBERS AND INSTEAD SHOWS JUST 3 DASHES. DISCONNECTING THE CAR'S BATTERY FOR 30 MINS, RECONNECTING, AND STARTING THE CAR DISPLAYS THE MILEAGE FOR A FEW SECONDS AND THEN RETURNS TO THE ---. SAME HAPPENS WHEN PULLING THE FUSE FOR THE GAUGE CLUSTER; THE MILEAGE IS DISPLAYED FOR A FEW SECONDS AND THEN RETURNS TO THE ---. ATTEMPTING TO RESET THE TRIP METER RESULTS IN THE NORMAL 'BEEP' BUT NUMBERS ARE NOT DISPLAYED.    BROUGHT THE CAR TO THE DEALERSHIP AND SINCE THE VEHICLE IS OUT OF WARRANTY THEY WANT A NONREFUNDABLE DEPOSIT OF $700 JUST TO DIAGNOSE, PARTS AND LABOR WOULD BE AN ADDITIONAL BILL ON TOP OF THAT. RIDICULOUS. SINCE THIS IS LIKELY A COMPUTER ISSUE IT'S BEYOND THE SCOPE OF WORK THAT CAN BE PERFORMED BY MY TRUSTED LOCAL GARAGE AND AS A RESULT I HAVE NOT HAD THE ISSUED CORRECTED. THIS SHOULD BE A GM RECALL.    KNOWING MY VEHICLE'S MILEAGE IS CRITICAL SAFETY INFORMATION AS IT IS A BENCHMARK FOR ROUTINE MAINTENANCE, AS WELL AS FOR ACCURATELY REPORTING INSURANCE INFORMATION.",
        "vin": "1G1JC6SG8D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/27/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2013 CHEVROLET SONIC DOES NOT HAVE THE ABILITY TO REPORT INDIVIDUAL TIRE PRESSURE ON THE DASH PANEL. GM PROVIDED THIS VEHICLE INFORMATION VIA A FREE APP FOR THE PHONE. GM N LONGER PROVIDES THAT INFORMATION FOR FREE ON THE APP. I BELIEVE THAT MAKES FOR AN UNSAFE SITUATION AS A LOW TIRE IS NO LONGER ALERTED UNTIL IT IS VERY LOW. THESE SMALL TIRES EXPERIENCE LARGE PRESSURE VARIANCES DUE TO TEMPERATURE CHANGE. I BELIEVE THAT GM SHOULD EITHER PROVIDE THIS FEATURE IN THE APP AT NO CHARGE OR UPDATE THE FIRMWARE ON THE INFORMATION PANEL ON THE DASH.   THANK YOU.",
        "vin": "1G1JH6SB0D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023379,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE 52 HAS APPEARED TWO WEEKS AFTER I BOUGHT MY CHEVY SONIC 2013 IN JUNE 2017 MILEAGE 1034??  NOW 105254.  WHAT DOES IT MEAN?",
        "vin": "1G1JA5SG1D4"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTROL ARM BENT FOR YEARS. I HIT NOTHING. I WAS GOING TO TIRES PLUS FOR 2 YEARS. THEY SAID OUT OF THE BLUE,- THEY WON'T DO WHEEL ALIGNMENT DUE TO CONTROL ARM BENT . IS IT POSSIBLE THAT THE CONTROL ARM WAS BENT BY THEM?",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021228,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN HAVING INTERMITTENT REDUCED ENGINE POWER SINCE SEPTEMBER 2016.  THE CAR WAS TAKEN TO THE DEALER, THE CHECK ENGINE LIGHT NEVER ILLUMINATED AND NO PROBLEM WAS DIAGNOSED.  DURING A RECENT TRIP THE CAR BEGAN TO HAVE REDUCED ENGINE POWER AND SURGING.  THE CHECK ENGINE LIGHT ILLUMINATED.  TROUBLE CODE P0171.  THE CAR WAS TAKEN TO THE DEALER WHO SET AN APPOINTMENT.  CHECK ENGINE LIGHT TURNED OFF AFTER A COUPLE OF DAYS.  ON THE WAY TO THE DEALER THE CAR ALMOST DIED AT A STOP LIGHT.  THE PROBLEM WAS DIAGNOSED AS EVAP PURGE CONTROL SOLENOID.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2017",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A RECALL NOTIFICATION IN FALL 2016 REGARDING KEYMINDER MALFUNCTION.  TOOK VEHICLE TO DEALER TO FIX AND THEY REPROGRAMMED THE MYLINK SYSTEM PER THEIR SERVICE BULLETIN INSTRUCTIONS.  THIS DID NOT FIX THE PROBLEM.  WHEN THE KEY IS LEFT IN THE IGNITION THE CAR FAILS TO SIGNAL WHEN THE DRIVER DOOR IS OPENED MAKING IT EASY TO LOCK THE KEY IN THE IGNITION.  THIS HAPPENED ONCE AFTER THE SUPPOSED REPAIR AND LOCKOUT ASSISTANCE WAS REQUIRED.  HAVE TAKEN THE CAR BACK TWICE SINCE THE INITIAL \"FIX\" SINCE IT STILL ISN'T WORKING.  THEY FINALLY ATTRIBUTED THE PROBLEM TO A FAULTY IGNITION SWITCH THE LAST VISIT.  THEY WILL NOT FIX UNDER WARRANTY/RECALL.  HOPEFULLY THIS ISN'T ANOTHER POTENTIALLY DEADLY GM IGNITION SWITCH ISSUE!",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015939,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR CAME TO A COMPLETE STOP AT A STOP LIGHT THE ENGINE WAS SURGING WITHOUT APPLICATION OF THE ACCELERATOR PEDAL.  THE CHECK ENGINE LIGHT CAME ILLUMINATED.  WE CONTINUED DRIVING UNTIL ABOUT AN HOUR LATER WHEN THE CAR WAS PUT IN PARK IN THE DRIVEWAY THE ENGINE SURGED UNTIL I SHUT IT OFF.  THE CHECK ENGINE LIGHT REMAINED ILLUMINATED AND WAS TAKEN TO THE LOCAL DEALER THE NEXT DAY.  THE SERVICE ADVISOR REQUESTED WE BRING IT BACK THE FOLLOWING MONDAY.  THE CHECK ENGINE LIGHT TURNED OFF WHILE DRIVING SATURDAY.  DURING THE DRIVE BACK TO THE DEALER FOR THE MONDAY APPOINTMENT AND STOPPED AT A STOP LIGHT THE ENGINE RPM'S DROPPED IN HALF AND RAN ROUGH FOR A FEW SECONDS.  THE RPM DECREASE AND ROUGH RUNNING HAS BEEN A LONGER TERM ISSUE THAT HAS BEEN PREVIOUSLY DIAGNOSED WITH NO RESOLUTION.  I WAS ADVISED BASED ON CURRENT DIAGNOSIS THAT THE EVAP PURGE CONTROL SOLENOID NEEDS TO BE REPLACED.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "04/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST YEAR ON APRIL 12TH 2016 I WAS IN A CAR ACCIDENT WITH A CSX DUMP TRUCK HER MERGED ONTO MY SIDE AND HIT ME MY DOOR CAVED IN AND EVERYTHING BUT MY AIRBAG DID NOT DEPLOY IM OKAY AND SO IS MY CAR BUT I HAD TO GET MY WHOLE DRIVER SIDE FIXED AND NOW MY CHILD DONT WORK AT ALL AND I HAVE A 3YR OLD THAT IS FIGURING OUT HOW TO OPEN THE DOOR AND IM LOSEING SPEED AND POWER AND MY THING THAT TELLS ME HOW MANY MILES TILL THE NEXT GAS STOP IS ALL MESSED UP IT JUST TELLS ME OFF THE WALL NUMBERS AND I NEED ALL OF THIS FIXED.",
        "vin": "1G1JC5SH0D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER PUMP WON'T SPRAY. WHEN LEAVE KEYS IN IGNITION DOESN'T BEEP TO TELL ME STILL IN IGNITION WHEN LOCK DOORS",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "SUSPENSION,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "03/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PUT CAR IN REVERSE HEARD A LOUD NOISE. CONTROL ARM WAS BENT. HAS WORN OUT MY NEW TIRES DUE TO ALIGNMENT DENIED BY DEALER DUE TO THIS",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006138,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION IS BAD, AND INCONSISTEN. ALSO, WHEN SHIFTING GEARS THE SHIFTER BUTTON GETS STUCK EVERYTIME NEVER FAILS. THAT'S A REAL SAFETY ISSUE CONSIDERING I ACCIDENTLY BUMP IT, AND THE CAR WENT INTO MANUAL, WHILE DRIVING. I BARELY TOUCHED IT AND IT MOVED. THIS IS THE LAST GM CAR THAT I WILL EVER BUY ALWAYS SOMETHING WITH THEIR CARS. THE ACCELERATION FOR THIS CAR ON THE INTERSTATE IS BAD PEOPLE GO AROUND ME BECAUSE IT TAKES SO LONG TO ACCELERATE, IT ALSO HESITATES WHEN ACCELERATING. I'VE ONLY HAD THIS CAR FOR ABOUT A MONTH.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON ON THE GEAR SHIFT THAT ACTIVATES THE SHIFTER AND ALLOWS IT TO MOVE REGULARLY GETS STUCK ALLOWING THE CAR TO BE PUT INTO GEAR WITHOUT HOLDING THE BUTTON. THIS POSES A SERIOUS SAFETY HAZARD DUE TO THE FACT THAT THERE IS NO SAFETY MECHANISM PREVENTING THE CAR FROM ACCIDENTALLY BEING PUT INTO GEAR AND ALLOWING THE CAR TO ROLL WHILE UNATTENDED. THIS ISSUE ALSO PREVENTS THE KEY FROM BEING REMOVED WHILE THE BUTTON IS STUCK EVEN WHILE IN PARK WHICH POSES AN ADDITIONAL SAFETY HAZARD. THIS ISSUE IS VERY COMMON WITH THIS CAR AND NEEDS TO BE ADDRESSED IMMEDIATELY",
        "vin": "1G1JA6SG6D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992952,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I AM HAVING TROUBLE REMOVING THE KEY FROM THE IGNITION.  IT GETS STUCK AND WON'T COME OUT, ALSO WHEN I WANT TO PUT THE CAR ON REVERSE IT ALSO GETS STUCK, IT WON'T CHANGE GEAR. I REALLY NEED HELP WITH THIS PROBLEM.",
        "vin": "1G1JC6SH6D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/17/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING UNKNOWN SPEEDS, THE CONTACT SMELLED BURNING OIL AND SMOKE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE OIL CAP SEAL WAS TORN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER STATED THAT THE FAILURE WAS NOT COVERED UNDER THE POWER TRAIN WARRANTY. THE FAILURE MILEAGE WAS 31,000.",
        "vin": "1G1JB6SH2D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985919,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON TO SHIFT GEARS SNAPPED PFF WITH NO MISUSE. COULDN'T PUT MY CAR IN PARK BECAUSE OF IT IT HAPPENED AS SOON AS IT WAS PUT IN DRIVE. VERY DANGEROUS. DID NOT REALIZE HOW CHEAP THE PLASTIC WAS FOR SOMETHING SO IMPORTANT.",
        "vin": "1G1JE6SH3D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE THE VEHICLE WAS UNDERGOING AN INSPECTION, THE CONTACT WAS INFORMED THAT THERE WAS A MANUFACTURER RECALL REGARDING THE CATALYTIC CONVERTER THAT NEEDED TO BE ADDRESSED. IN ADDITION, THE CONTACT STATED THAT THE VEHICLE STALLED SEVERAL TIMES WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE, BUT THE FAILURE RECURRED INTERMITTENTLY. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE RECALL DETAILS WERE NOT PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "1G1JC6SG0D4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2016",
        "dateOfIncident": "12/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STICKS IN THE IGNITION, UNABLE TO REMOVE WHEN IN PARK POSITION. I WORK A DANGEROUS JOB IN BAD AREAS AND CANNOT DEPEND ON THE KEY BEING RELEASED FROM THE SWITCH AFTER PARKING. WHATCH PUTS ME IN A AWKWARD SITUATION IN REGARDS TO SAFETY.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10928588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY CAR HAS BEEN HIT IN THE FRONT END 3 TIMES AND THE LAST TIME WAS A HARD HIT, NONE OF THE TIMES HAVE I HAD AN AIRBAG COME OUT.",
        "vin": "1G1JC6SB0D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLE AT STOP AND SLUGGISH PROPULSION WHILE DRIVING TO WHERE IT CAN BECOME DANGEROUS WHILE MERGING ONTO FREEWAY TRAFFIC AND BUSY CITY STREETS. UPON FURTHER INVESTIGATION ON ONLINE FORUMS, THERE IS A MASS ISSUE WITH THE AIR INTAKE TUBE/HOSE FROM AIR BOX TO THROTTLE BODY. THE ISSUE BEING MAJOR CRACKING OR HOLES IN THE TUBE/HOSE CAUSING TOO MUCH AIRFLOW. THIS CRACKING HAPPENS SOMETIMES BEFORE OR AFTER THE O2 SENSOR. THE CRACKING I FOUND HAPPENED TO BE AFTER MY O2 SENSOR, THEREFORE NOT EVEN TRIGGERING THE CHECK ENGINE SYSTEM TO ACTIVATE.",
        "vin": "1G1JC6SG2D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "11/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING OFF ENGINE AND GETTING OUT OF THE CAR...IT \"CRANKED\" OVER ONCE TRYING TO START ON ITS OWN. I JIGGLED THE KEY AND IT DID IT AGAIN. REMOVED THE KEY SEVERAL TIMES AND STARTED/STOPPED THE ENGINE. COULD NOT GET IT TO DUPLICATE THE SYMPTOMS.",
        "vin": "1G1JC5SB7D4"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "12/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HESATATES, THE RADIO SOME TIMES DOES'T COME ON, THE SEAT BELTS DO NOT TIEN UP WHEN YOU BUCKLE UP, AND THE SEATS ARE VERY LOW TO THE GROUND FOR A HANDICAP PERSON",
        "vin": "1G1JC6SB2D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 10914440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE PULLING OUT OF A PARKING LOT ONTO THE ROAD TO GET IN A TURNING LANE, ANOTHER VEHICLE CRASHED INTO THE FRONT DRIVER'S SIDE OF THE CONTACT'S VEHICLE.  THE FRONT DRIVER'S SIDE WHEEL FRACTURED AND THE KEY WAS UNABLE TO BE REMOVED FROM THE IGNITION. THE DRIVER SUSTAINED WHIPLASH AND MINOR BRUISING. THE FRONT PASSENGER FLEW INTO THE FRONT WINDSHIELD. THE GEAR SHIFTER FRACTURED WHEN THE FRONT PASSENGER WAS IMPACTED BY THE FORCE OF THE CRASH. AN ADULT PASSENGER IN THE REAR OF THE VEHICLE AND TWO CHILDREN PASSENGERS SUSTAINED WHIPLASH. MEDICAL ATTENTION WAS RECEIVED. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A YARD. THE MANUFACTURER INVESTIGATED THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 57,700.   THE VEHICLE WAS TOTALED. UPDATED 11/16/16.*JB",
        "vin": "1G1JC5SH4D4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. AFTER THE VEHICLE WAS FUELED, IT FAILED TO START. THE DEALER STATED THAT THE VEHICLE WAS OUT OF WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REPLACED THE FUEL TOP, BUT THE ISSUE STILL PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "1G1JC5SH1D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "09/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905760,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC SHIFTER BUTTON REMAINS IN DEPRESSED POSITION, EVEN WHEN VEHICLE IS IN PARK, 1) PREVENTING REMOVAL OF KEY AND 2) ALLOWING FREE MOVEMENT FROM PARK TO REVERSE, DRIVE, NEUTRAL OR VICE VERSA. STATIONARY, WHENEVER I PARK. AFTER SOME MINUTES THE BUTTON MAY POP OUT, BUT PROBLEM IS GETTING WORSE.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THE REAR FAILED TWICE. THE DEALER DIAGNOSED THAT THE REAR BRAKES NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 17,889. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "07/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD THIS CAR FOR ONLY 2 YEARS AND THERE IS ALWAYS SOMETHING WRONG. FIRST I WAS DRIVING AND IT JUST SHUT OFF ALL THE LIGHT ON DASH BOARD WENT OFF AND FROM THAT POINT ON NOTHING ON THE STEERING WHEEL WORKS. NO HORN AND NONE OF THE CONTROLS OF IT ARE WORKING. MY PASSENGER AIR BAG LIGHT STAYS ON. BEEN IN THE SHOP 3 TIMES STILL NOT WORKING. NOW THE WARNING LIGHT OF OVER HEATING COME ON EVERYTIME I HAVE TO STILL IN TRAFFIC ON MY WAY HOME OR DRIVING FOR A OVER AN HOUR, HAVE TO TURN THE HEATER ON, ON HIGH TO GET THE LIGHT AND WARNING BEEPING TO STOP. IT'S ALREADY 90, BUT IF I DON'T THE CAR START SHAKING. THE REASON I BOUGHT A NEWER CAR WAS TO NOT HAVE TO PUT IT ON THE SHOP EVERY 4 MONTHS.  SO NO HORN, CRUISE CONTROL, NOT SURE IF AIR BAG WORK ON PASSENGER SIDE AND TO TOP IT OFF HAVE TO RIDE WITH THE HEAT ON WHILE IT'S 90OUTSIDE TO MAKE IT HOME SAFE, ,(I THINK,,).. I CALL GM CUSTOMER SERVICES OVER AND OVER AGAIN, AND THEY TELL ME THERE IS NOT OTHER PROBLEMS WITH OTHER CARS. MY WARRANTY IS EXPIRED. SO IT'S ON ME.",
        "vin": "135675"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THE RADIO AND THE AUDIBLE TURN INDICATOR FAILED TO OPERATE WHEN ACTIVATED. DUE TO THE FAILURES, THE BATTERY BECAME INOPERABLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 12V454000 (ELECTRICAL SYSTEM, EXTERIOR LIGHTING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 67,000.",
        "vin": "1G1JC5SH2D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFT BUTTON STICKING.  KEY STUCK IN THE IGNITION UNABLE TO REMOVE .   CAR CAN NOT BE PUT ON FULL PARK WHICH IS CAUSING ENGINE AND BATTERY TO FAIL. ELECTRONIC KEY RELEASE NOT WORKING.  THIS IS A HUGE SAFETY ISSUE AS THE PARK CAN EASILY MOVE BECUASE IT'S NOT FULLY PARKED DUE TO IGNITION KEY FAILIURE.    THIS IS A MANUFACTURER DEFECT BUT THERE HASN'T BEEN A RECALLED SO WE HAD TO PAY OUT OF POCKET TO FIX.",
        "vin": "1G1JC6SH2D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING GEARS, THE BUTTON MECHANISM WILL NOT RELEASE ONCE THE LEVER IS IN THE DESIRED GEAR, MAKING THE SHIFT ITSELF PRONE TO SLIDING BETWEEN THE DIFFERENT GEARS AND PUTTING THE DRIVER AT RISK FOR ACCIDENTS. THERE IS ALSO A SPECIFIC ISSUE WITH THE SHIFT WHEN THE LEVER IS PLACED IN \"PARK\" POSITION; THE KEY CANNOT BE RELEASED BY THE IGNITION.",
        "vin": "1G1JC6SH5D4"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR FOR THE PAST YEAR NOW I HAVE NOTICED MY RPM GAUGE STICKING AND REVVING ON ITS OWN. IT IS STARTING TO HAPPEN MORE CONSISTENTLY. WHEN I'M DRIVING DOWNHILL THE RPM GAUGE WILL REV HIGH AND STAY STUCK HIGH. THEN WHEN I PUT THE CAR IN PARK IT WILL REV HIGH ON ITS OWN AND STAY STUCK AND EVENTUALLY COME BACK DOWN. SOMETHING NEW I HAVE STARTED TO EXPERIENCE IS WHEN I'M AT A COMPLETE STOP THE RPM GAUGE WILL START REVVING UP AND DOWN ON IT'S OWN WHILE MY CAR LIGHTS BRIGHTEN AND DIM AND MY WARNING LIGHT COMES ON THAT I'M SLIDING WHICH IS IMPOSSIBLE SINCE I'M AT A COMPLETE STOP. I HAVE ALSO NOTICED THE TRANSMISSION HAS STARTED TO FEEL JERKY LATELY WITH EVERYTHING ELSE. I JUST PURCHASED THIS VEHICLE ALMOST 2 YEARS AGO AND I ONLY HAVE 58,000 MILES ON IT.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889356,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHAKES VERY BAD WHEN DRIVING AND APPROACHING A STOP.",
        "vin": "1G1JC5SG1D4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE THE VEHICLE WAS STATIONARY, THE BUTTON ON THE SHIFTING LEVER BECAME STUCK AND WOULD NOT RELEASE WHEN THE VEHICLE WAS SHIFTED INTO PARK. AS A RESULT, THE IGNITION KEY BECAME STUCK IN THE VEHICLE. THE VEHICLE WAS TAKEN TO BE REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 29,300.",
        "vin": "1G1JC5SG7D4"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GM PART NUMBER 95027313 OUTLET DUCT CONNECTING THE AIR BOX TO THE THROTTLE BODY HAS SHREDDED IN 30,000 MILES OF USE. THIS PROBLEM CAUSES THE ENGINE TO RUN LEAN (ODB2 ERROR CODE P0171) RESULTING IN SIGNIFICANTLY REDUCED FUEL ECONOMY, POOR ACCELERATION, ROUGH IDLE, AND POTENTIAL FAILURES TO A NUMBER OF COSTLY SENSORS AND COMPONENTS, AS WELL AS ALLOWING DIRTY, UN-FILTERED DIRECTLY INTO THE ENGINE. A QUICK GOOGLE SEARCH REVEALS 26,000 SEARCH RESULTS INCLUDING FORUMS AND MESSAGE BOARDS WHERE COUNTLESS SONIC OWNERS REPORT THE SAME ISSUE. THIS IS A WIDESPREAD PRODUCT DEFECT AND GM NEEDS TO PROVIDE A REPAIR SOLUTION FOR OWNERS OF THIS MODEL VEHICLE. THE PART HAD DETERIORATED TO THE POINT, WHERE THE CHECK ENGINE LIGHT ILLUMINATED. THE CONSUMER NOTICED THE FUEL ECONOMY OF THE VEHICLE DROPPING STEADILY FROM THE ADVERTISED 29/CITY/40 HIGHWAY TO AN AVERAGE OF ABOUT 25 MPG HIGHWAY.",
        "vin": "1G1JC6SG8D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING AT APPROXIMATELY 40 MPH, A DEER JUMPED IN FRONT OF THE VEHICLE. THE BRAKE PEDAL WAS DEPRESSED; HOWEVER, THE VEHICLE CRASHED INTO THE DEER. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE HOOD AND BUMPER NEEDED TO BE REPLACED. THE TECHNICIAN WAS UNAWARE WHY THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 62,000.",
        "vin": "1G1JC6SH4D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2016",
        "dateOfIncident": "07/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFT KNOB BUTTON IS STICKING. ALLOWS THE CAR TO BE SHIFTED WITH LITTLE FORCE AND CAUSED THE KEY TO LOCK IN THE IGNITION.",
        "vin": "1G1JC5SG0D4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY COMPUTER/RECALLS  I PURCHASED THE USED VEHICLE 2 YEARS AGO AND A MONTH AFTER THE CHECK ENGINE LIGHT CAME ON. I HAVE BROUGHT THIS BACK TO THE DEALER MULTIPLE TIMES TO FIX, BUT IT KEEPS HAPPENING. IT IS NOT AN ISSUE WITH MY ENGINE, BUT RATHER THE COMPUTER.  BECAUSE OF THE FAULTY COMPUTER ISSUE, IT HAS CAUSED OTHER ISSUES IN MY CAR, INCLUDING FAULTY READING AND MY INABILITY TO KNOW IF SOMETHING DANGEROUS ACTUALLY WAS OCCURRING IN MY VEHICLE. I AM VERY FRUSTRATED, BECAUSE THIS KEEPS HAPPENING AND EACH YEAR I HAVE TO DEAL WITH THIS ISSUE TO GET MY CAR INSPECTED.",
        "vin": "1G1JE5SG1D4"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR FROM A DEALER, WHO SET ME UP FOR AN UPSIDE LOAN.  PUTTING ME INTO ANOTHER CHEVY WITH NOW 2 CAR LOANS TO PAY OFF.  THE CAR HAS STALLED ON ME AT DIFFERENT TIMES WHILE OWNING IT.  THERE HAVE BEEN ISSUES SINCE SHORTLY AFTER PURCHASING IT WITH ACCELERATION.  IT JOLTS AND JUMPS WHEN TRYING TO ACCELERATE.  THE CHECK ENGINE LIGHT IS ONE, SOMETIMES IT GOES OFF, THEN WILL COME BACK ON.  I HAVE NOT TAKEN IT TO THE SHOP YET ASSUMING IT WOULD BE A HUGE EXPENSE FOR THEM TO FIX AND FIND IT.  TOOK IT TO A PRIVATE GARAGE  AND THEY COULD NOT FIND THE ISSUE EITHER.  THIS CAR IS CRAP, I OWE TWICE AS MUCH AS ITS WORTH AND I DO NOT KNOW WHAT TO DO WITH IT.  I DRIVE AN HOUR TO WORK EVERY DAY ON THE HIGHWAY AND I AM TERRIFIED I AM GOING TO CRASH EVERY SINGLE DAY.  IT HAPPENS ON THE HIGHWAY, ON THE STREET.  IN THE MORNING WHEN IT START UP IT JOLTS AND SPUTTERS.  IF YOU USE THE HEAT, IT SMELLS LIKE ITS BURNING AND THERE IS A HIGH SQUEALING NOISE COMING FROM THE PASSENGER SIDE.",
        "vin": "1G1JC5SGXD4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON STICKS WHEN IN GEAR OR PARK.",
        "vin": "1G1JC6SH9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS IN MOTION, STRAIGHT-LINE, AT 60 MPH.    THIS MORNING ON MY WAY TO WORK, MY GAUGE PANEL WENT HAYWIRE.  THIS ISN'T THE FIRST TIME IT'S HAPPENED.  IT'S HAPPENED MANY TIMES.  I'VE TAKEN VIDEO OF THIS CONDITION AND UPLOADED IT TO YOUTUBE.    HTTPS://WWW.YOUTUBE.COM/WATCH?V=IVSDEO8LCR8    WHEN IT HAPPENS, NOT ONLY DOES THE SPEED AND RPM'S FLUCTUATE RAPIDLY AND INACCURATELY, BUT THE TURN SIGNALS QUIT WORKING (SAFETY ISSUE!), AND SINCE THE TRACTION CONTROL LIGHT IS COMING ON, I ASSUME IT HAS QUIT WORKING AS WELL (SAFETY ISSUE).  THE VEHICLE IS UNDER WARRANTY, AND I'VE HAD IT IN TO A LOCAL CHEVROLET DEALERSHIP (RK CHEVROLET, VIRGINIA BEACH, VA) FOR REPAIR.  THEY WERE TOLD OF THE YOUTUBE VIDEO AND THEY WATCHED IT.  THEY THEN TRIED TO REPRODUCE THE PROBLEM AND COULDN'T.  SO THE VEHICLE WAS RETURNED WITHOUT A REPAIR BEING DONE.  THE PROBLEM IS INTERMITTENT.  I'VE TRIED CONTACT CHEVROLET IN ANOTHER WAY BUT THEY WERE UNRESPONSIVE.  TIME TO TRY SOMETHING DIFFERENT.   THAT'S WHY I AM CONTACTING YOU ALL.",
        "vin": "1G1JG6SBXD4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHEN THE VEHICLE WAS PLACED IN THE PARK POSITION, THE ENGINE TURNED OFF AND IT WAS DIFFICULT TO REMOVE THE KEY FROM THE IGNITION. THE CONTACT STATED THAT THE BUTTON ON THE SHIFT LEVER SEIZED. THE CONTACT STATED THAT THE SHIFT LEVER HAD TO BE TAPPED TO DISENGAGE THE BUTTON AND REMOVE THE KEY FROM THE IGNITION. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 56,000.",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHEVY SONIC HAS HAD A CLICKING NOISE SINCE I PURCHASED IT. IT GOES DEAD WHEN GAS CAP IS REMOVED AND WILL NOT CRANK BACK. I HAD IT WORKED ON AT A DEALERSHIP $306 LATER IT IS STILL DOING THE EXACT SAME THINGS. I PURCHASED VEHICLE WITH 21 MILES ON IT. I AM ON THE ROAD FOR MY JOB. THIS VEHICLE HAS BEEN A HEADACHE SINCE PURCHASE. I CANNOT AFFORD ANOTHER PAYMENT. SURE CANT AFFORD THE BILL FROM THE SHOP WHEN IT DOESN'T FIX ANY OF THE PROBLEMS. THE VEHICLE HAS HAD TO BE JUMPED OFF TO START. I PURCHASED NEW BATTERY EVEN WHEN AUTO PARTS STORE TESTED OLD BATTERY AND STATED IT WAS GOOD AND ALTERNATOR WAS CHARGING. I AM FURIOUS. WHAT IS A HONEST PERSON TO DO?????WHEN DEALERSHIP DOESN'T HOLD UP TO CORRECTING THE PROBLEM. NOTHING TO THEM IT RUINS YOUR CREDIT, NOT THEIR NAME. I HAVE HAD TO BE TOWED DUE TO VEHICLE NOT CRANKING EVEN WHEN BEING JUMPED OFF. HELP!!! DEALERSHIP/GM SHOULD BE HONEST AND FIX THE PROBLEMS. APPARENTLY THEY DON'T VALUE REPEAT CUSTOMERS!!!",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE YOU START THE CAR, IT HOPS, JERKS ROUGHLY, AND IT TAKES LONGER THAN WHAT IT SHOULD TO START EVEN IN FAIR WEATHER. HESITATES TO SHIFT, JERKS INTO GEAR, VERY SLOW (UNSAFE ON HIGHWAY), A GUTLESS WONDER, AND ACTS AS IF THE TRANSMISSION IS SLIPPING WHEN THE REAL ISSUE IS UNKNOWN. IT SHAKES AND SHUTTERS, THIS WAS A CONTINUATION OFF OF THE CHEVY AVEO PLATFORM. THE CHEVY AVEO DID NOT HAVE THESE TYPE OF ISSUES. I'M AFRAID THAT IF THIS VEHICLE IS CONTINUED TO BE DRIVEN, YOU WOULDN'T BE ABLE TO GET OUT AN EMERGENCY SCENARIO DUE TO THE SLUGGISHNESS, IT'S AN ABSOLUTE GUTLESS WONDER. AND AGAIN, IT'S UNSAFE TO DRIVE ON THE HIGHWAY. DOESN'T WANT TO GO INTO 2ND GEAR TOO WELL, WHICH IS WHY I SAID IT'S UNSAFE ON THE HIGHWAY ESPECIALLY. ALL AROUND A SLOW AND UNRELIABLE CAR, IT IS DEVASTATING",
        "vin": "1G1JC5SH0D4"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SENOR CODES KEEP COMING ON. HAD IT 3MONTHS IN SHOP TO RESET 3TIMES. NOW THERMOSTAT OR SENOR BAD. WIPERS DIDN'T WORK ONE DAY AFTER I BROUGHT IT. THE HOSES DISCONNECTED FROM HOOD AREA. HAD TO DRIVE HOME IN RAIN WITH HEAD OUT WINDOW. THE RPM KEEPS STICKING WHILE I'M DRIVING IT. I LIVE ON S.S. SO I DON'T HAVE A LOT OF BUCKS TO KEEP PUTTING IN THIS CAR. I TRADED A GOOD CAR IN CHEV AVERO WITH NOTHING WRONG WITH IT.THE DEALER CHARGED ME TO MUCH FOR THIS CAR AND WONT TAKE IT BACK.YOU ASK FOR DATE IT BEEN GOING ON SINCE DEC 2015 TO APRIL 2016",
        "vin": "1G1JC5SHXD4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY CAR INTO THE DEALER 3 TIMES NOW WITHIN 5 MONTHS AND THEY HAVE YET TO FIX MY PASSENGER AIRBAG ISSUE. I TOOK IT IN ON 11/27/2015, 02/26/2016 AND AGAIN ON 03/28/2016. THE FIRST 2 TIMES I WAS TOLD THAT THEY WOULD HAVE TO ORDER THE SENSOR FOR IT AND THE LAST TIME THEY TOLD ME THAT THEY HAD THE SENSOR BUT WHEN THEY CALLED ME THEY TOLD ME THAT THE SENSOR THEY ORDERED WAS WRONG AND THAT THE SENSOR I NEEDED WAS MARKED AS DISCONTINUED FROM GM. THE AIRBAG LIGHT WOULD STAY OFF EVEN WITH MY FIANCE SITTING IN THE SEAT WHOM WEIGHTS A LITTLE OVER 200LBS AND THEN IT WOULD DESIDE TO COME ON AND OFF AS IT WANTED. NOW THAT I HAVE TAKEN IT TO THE SHOP AND FOUND OUT THAT THE PART IS DISCONTINUED MY MAIN AIRBAG LIGHT IS ON AND I HAVE LESS THAN 100,000 MILES ON THE CAR AND I HAVE THE GMPPP PLAN AND THE DEALERSHIP HASN'T OFFERED ME TO CALL AND GET A RENTAL, THEY HAVE ACTED LIKE THIS IS NOT A BIG DEAL. I HAVE A 13 YR AND MY FIANCE AND MYSELF WHOM IS PREGNANT THAT RIDE IN THIS CAR AND IT'S NOT SAFE. NOT HAPPY AT ALL!!!",
        "vin": "1G1JC5SHXD4"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/06/2016",
        "dateOfIncident": "03/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "BIG O",
                "productModel": "BIG O ASPEN",
                "productYear": "9999",
                "size": "P195/65R15",
                "type": "Tire"
            }
        ],
        "summary": "4 ASPEN TOURING TIRES PURCHASED IN 8/2015. IN DEC 2015, 1 OF THE TIRES BLEW OUT. BIG O SAID IT WAS SOMETHING OWNER RAN OVER BUT OWNER SAYS SHE DID NOT RUN OVER ANYTHING AND THE BLOW OUT WAS ON THE SIDE NOT ON THE TREAD.  OWNER REPLACED WITH NEW ASPEN TOURING TIRE ON 1/14/2016.  ON 3/6/2016, OWNER NOTICED A BLISTER ON THE SIDEWALL OF ONE OF THE TIRES.  SHE WILL NEED TO REPLACE ANOTHER ONE OF THE TIRES BEFORE IT BLOWS OUT.  2 TIRES IN 6 MONTHS.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10837641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS MOVING AND I HAD A STRONG FRONTAL CLASH AGAINST A RETAINING WALL, THE IMPACT DAMAGED ALL ACROSS THE FRONT OF THE CAR AND THE AIR BAGS DID NOT WORK. THE INSURANCE COMPANY DECLARED IT A TOTAL LOSS AND THE AGENCY WHERE WE BOUGHT THE VEHICLE IS NOT CLAIMED RESPONSIBILITY FOR THIS SERIOUS LACK IN THE SAFETY EQUIPMENT WHICH IS WORRYING FOR THE CAR LOT WHERE IT CAME FROM MY CAR AND THE SAFEGUARD OF THE DRIVERS OF THIS TYPE OF BRAND OF DEFECTIVE VEHICLES.",
        "vin": "3G1J85CC2DS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE DROPS AROUND 0-15 THE WINDWASHER FLUID WILL NOT SPRAY OUT OF THE NOZZLES BECAUSE THE NOZZLES FREEZE UP ON THE CAR.. SO WHEN YOU'RE GOING DOWN THE HIGHWAY YOU CANNOT USE YOUR WINDOW WASHER FLUID IT WILL NOT SPRAY OUT OF THE CAR AND YOU CAN'T SEE ANYTHING BECAUSE THE WINDOW DOESN'T BECOME CLEAN FROM ROAD SALT.. I HAVE CALL GM ON THIS ISSUE AND THERE IS NO RECALL AND THEY WON'T DO ANYTHING ABOUT IT",
        "vin": "1G1JC6SG0D4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY WIFE RIDES FRONT PASSENGER SEAT AIR BAG INDICATOR SHOWS AIR BAG OFF. RETURNED VEHICLE TO DEALER. WAS INFORMED AFTERMARKET SEAT COVERS WILL EFFECT SENSOR AND GIVER GM BULLETIN #06-08-50-009H.  SUBSEQUENTLY REMOVED SEAT COVERS BUT SENSOR STILL NOT WORKING. RETURNED TO DEALERSHIP. WAS INFORMED SENSOR WAS WORKING AS DESIGNED AND PROBLEM WAS MY WIFE'S WEIGHT (85 LBS). THAT THE SENSOR WAS SET AT INDUSTRY STANDARD OF 95LBS. CONTACTED GM CONSUMER RELATIONS AND SUBSEQUENTLY INFORMED TO RETURN TO DEALERSHIP FOR REPAIR. RETURNED TO DEALERSHIP AND AGAIN INFORMED THAT THE SENSOR WAS WORKING AS DESIGNED AND GIVEN GM BULLETIN #12-09-41-002B PASSENGER PRESENCE SYSTEM. AGAIN ADVISED IT AS A WEIGHT ISSUE EVEN THOUGH THE BULLETIN STATED \"THE SYSTEM WORKS BY DETECTING THE CAPACITANCE OF THE OBJECT ON THE SEAT, NOT THE WEIGHT\". CONTACTED GM CONSUMER RELATIONS AGAIN AND WAS ADVISED THAT THEY COULD NOT FORCE THE DEALERSHIP TO FIX THE ISSUE. NEVER ADVISING IF THERE WAS EVEN A REPAIR AVAILABLE OR ACKNOWLEDGING THAT THE SENSOR IS SET AT 95 LBS. MY WIFE RIDES IN MY KIA AND DAUGHTER'S CHEVY TRAVERSE WITH NO ISSUES. JUST WOULD LIKE A STRAIGHT ANSWER AND WISH WOULD HAVE KNOWN THE WEIGHT EFFECT ON FRONT PASSENGER SEAT. I KNOW WHAT MY WIFE'S WEIGHT WAS AND I WOULD NEVER HAVE PURCHASED THIS VEHICLE.",
        "vin": "1G1JC5SH7D4"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "01/27/2016",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10822556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHEN THE IGNITION WAS TURNED TO THE ON POSITION, THE ENGINE REVVED CONTINUOUSLY. THE FOLLOWING DAY, THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 25 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT THE VEHICLE FAILED TO STOP. THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED INJURIES TO HER HEAD AND NECK THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN UNKNOWN LOCATION. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 48,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2016",
        "dateOfIncident": "01/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDOW IN THE REAR WILL NOT GO UP AND DOWN FROM THE FRONT CONTROL PANEL,AND MY KEY IS STICKING THEY HAVE FIX MY KEY ONCE AND MY WINDOWS WAS WANDERING WHAT WAS GOING ON.",
        "vin": "1G1JC6SB4D4"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I HAVE A PASSENGER IN MY CAR THE LIGHT WILL STAY OFF FOR THE AIRBAG AND SO WILL THE SAT BELT LIGHT     WHEN I AM SEATING STILL ANYWHERE FROM A PARKING SPOT TO A STOP LIGHT ANYWHERE MY CAR WILL IDEL UP TO 2500-3000 RPMS AND MY FEET RE ON THE BREAK AND CLUTCH IF I DONT WATCH CLOSELY AND LET THE BREAK OFF ANY MY CAR WILL TAKE OFF",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/26/2015",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A PASSENGER IS PRESENT, THE AIR BAG AND SEATBELT INDICATOR DOES NOT INDICATE THAT THEY ARE ACTIVE LIKE THEY ARE SUPPOSED TO.",
        "vin": "1G1JC5SG0D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING 70 MPH AND ATTEMPTING TO ACTIVATE THE TURN SIGNALS, THE VEHICLE STALLED WITHOUT WARNING. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE ENTIRE ELECTRICAL SYSTEM NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "1G1JD6SH2D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON GETS STUCK IN DEPRESSED POSITION, PREVENTING REMOVAL OF THE KEY FROM IGNITION WHEN IN PARK POSITION AND ALLOWS THE SHIFTER TO SHIFT BETWEEN GEARS AND PARK POSITIONS WITH LITTLE-TO-NO INTERVENTION. INABILITY DISENGAGE BUTTON AND TO REMOVE THE KEY FROM THE IGNITION ALSO CREATES INABILITY TO SECURELY PARK THE VEHICLE AND TURN THE VEHICLE OFF. THIS APPEARS TO BE A COMMON PROBLEM ARE THERE ARE PLENTY OF FORUMS ONLINE ABOUT THE TOPIC. HERE IS A VIDEO OF SOMEONE ELSE HAVING THE SAME PROBLEM I'M HAVING: HTTPS://WWW.YOUTUBE.COM/WATCH?V=TMUXP0BXTVI  THIS IS EXTREMELY DANGEROUS AND I DON'T UNDERTAND HOW GM HASN'T RECALLED IT. THE CAR BECOMES LITERALLY IMPOSSIBLE TO PARK. IT HAPPENED TO ME WHEN I GOT HOME ONE NIGHT AND I ALMOST TO LEAVE THE KEY IN THE IGNITION OVERNIGHT BECAUSE IT WOULDN'T COME OUT, WHICH WOULD HAD PROBALY KILLED THE BATTERY. THANKFULLY AFTER MINUTES OF TURNING THE CAR ON AND OFF AND SHIFTTING GEARS IT FINALLY CAME OUT.",
        "vin": "1G1JA5SH5D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING 20 MPH, THE WINDOW WIPER/WASHER SWITCH FAILED AND THE ANTI THEFT WARNING INDICATOR ILLUMINATED. THE FAILURE RECCURED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE WINDOW WIPER/WASHER SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 38,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, HER FOOT SLIPPED OFF THE ACCELERATOR AND BRAKE PEDAL WHEN DEPRESSED. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED DUE TO THE ACCELERATOR AND BRAKE PEDAL BEING MADE OUT OF METAL INSTEAD OF RUBBER. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS INFORMED THAT THERE WAS NO REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "1G1JG6SB3D4"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/11/2015",
        "dateOfIncident": "12/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE GO DOWN THE ROAD AND HIT A SMALL BUMP WE HERE A BANG FROM THE PASSENGER SIDE FRONT . THE DEALER SAID IT WAS THE STABILIZER BAR  AND THE BAR BUSHING BUT IT IS NOT THAT IT IS THE STERILIZER BAR LINKS THEY ARE MADE OUT OF HARD PLASTIC THEY SHOULD BE RECALL ON THEM SOME ONE CAN GET HURT OR KILL BECAUSE OF THEM. I ASK GM TO PAY ME BACK BUT THEY SILL WELL NOT CALL ME BACK ON IT. IF SOME ONE IS LOOKING FOR THEM  THEY ARE 523-040 BY DORMAN",
        "vin": "1G1JC6SB1D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "10/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIRING HARNESSES HAVE BEEN CHEWED BY RODENTS TWICE IN LESS THAN 10 DAYS BECAUSE GM USES SOY BASED PLASTICS TO COAT THE WIRING HARNESSES. SOY PRODUCTS ARE USED IN THE MAKING OF RODENT FOODS. MY CAR STOPPED DEAD IN TRAFFIC BECAUSE THE WIRES BROKE DUE TO THE DAMAGE (FOUND LATER AT DEALERSHIP). IT WAS FORTUNATE THAT I WAS JUST PULLING AWAY FROM A STOP IN MY NEIGHBORHOOD WHEN IT OCCURRED AND NOT ONCE I HAD REACHED INTERSTATE SPEEDS WHERE I NORMALLY DRIVE TO WORK. THERE ARE THOUSANDS OF COMPLAINTS ONLINE CONCERNING THIS SAME PROBLEM.",
        "vin": "1G1JC6SH8D4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "10/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY, APPLYING THE BRAKES HARD IS UNRESPONSIVE - LIKE PRESSING ON A BOARD. I NEARLY STRUCK 2 KIDS ON BIKES THE OTHER DAY. SCARY. THE DEALER STATED, \"TECHNICIAN TEST DROVE VEHICLE AND VERIFIED CUSTOMER'S CONCERN. INSPECTED BRAKE SYSTEM, FOUND CHECK VALVE FOR BRAKE BOOSTER STUCK OPEN AND BRAKE BOOSTER VACUUM PUMP SEIZED.\" I CONTEND THAT THIS IS NOT A WEAR AND TEAR TYPE OF ISSUE, BUT RATHER A MANUFACTURER'S DEFECT. IN RESEARCHING THIS MATTER, I FOUND MESSAGE BOARDS AND FORUMS THAT DESCRIBE THE SAME ISSUE. HERE IS ONE SUCH DISCUSSION:     HTTP://WWW.SONICOWNERSFORUM.COM/FORUM/HANDLING-BRAKING-SUSPENSION-DISCUSSION/18313-BRAKE-PEDAL-GETS-ROCK-HARD-IMMEDIATELY-OFF-BOOST-VAC-PUMP-GOING.HTML    CHEVROLET WILL NOT REMEDY THIS PROBLEM UNDER THE POWER TRAIN WARRANTY AND THE DEALER WANTS $700 TO FIX THE PROBLEM. THIS SHOULD BE FIXED FREE OF CHARGE BECAUSE IT IS APPARENTLY A COMMON AND VERY DANGEROUS DEFECT IN THIS VEHICLE.",
        "vin": "1G1JE6SB1D4"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY DURING A RAIN SHOWER AT ABOUT 60 MPH, WHILE USING THE WIPERS, THE DRIVER'S SIDE WIPER MADE A LOUD CRACK SOUND AND FELL OFF!  I WAS UNABLE TO SEE AND NEARLY HIT THE VEHICLE IN FRONT OF MYSELF.  SINCE IT WAS LATE SATURDAY NIGHT, I STOPPED AT A LOCAL PARTS STORE (ADVANCED AUTO) AND PURCHASED A NEW WIPER.  WHEN THE CLERK INSPECTED THE BLADE, HE FOUND THAT THE WIPER ARM DOES SECURELY ATTACH WITH THE WIPER ITSELF.  WHEN I CONTACTED THE DEALERSHIP, THE MAN I SPOKE WITH SAID HE COULD REPLACE THE WIPER ARM, HOWEVER THIS MAY NOT RESOLVE THE ISSUE WITH IT \"FALLING OFF\".",
        "vin": "1G1JD6SB4D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10762295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING UP HILL APPROACHING A PARKING SPACE IN THE GARAGE WHERE I WORK.  I WENT TO TURN INTO THE PARKING SPACE AND MY TURBO ENGINE SPED UP AND SLAMMED ME INTO THE GARAGE WALL.  THE AIR BAGS WERE DEPLOYED.  THERE WAS A MALFUNCTION ON THIS CHEVY SONIC.  IF I HAD PARKED  ON THE TOP FLOOR, I WOULD PROBABLY HAVE BEEN KILLED SINCE IT WOULD HAVE CRASHED DOWN INTO THE STREET.  I MY ARMS AND MY ONE LEG WAS BURNED BY THE AIR BAGS.",
        "vin": "1G1JE6SB2D4"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD THAT MY DRIVER'S SIDE FRONT TURN/HAZARD LIGHT WAS VERY DIM.  I PURCHASED THE BULB AND SOUGHT HELP TO CHANGE IT.  IT WAS AT ONCE CLEAR THAT THE BULB HAD COME LOOSE FROM THE HOUSING AND HAD MOVED BACK ONTO THE PLASTIC PART OF THE HOUSING, MELTING IT ONTO THE BULB.  I WENT THE NEXT DAY TO THE DEALER'S SERVICE DEPT. ONLY TO BE TOLD THAT THE ENTIRE PIECE WHICH HOUSES THE 2 HEADLIGHTS AND THE TURN SIGNAL BULB WOULD HAVE TO BE REPLACED, THAT THE PART WAS ON NATIONAL BACK-ORDER SO THERE WAS NO EXPECTED DELIVERY DATE AND THAT THERE WAS NO TEMPORARY REPAIR THAT COULD BE DONE.  THIS BULB IS PART OF THE NIGHTTIME OPERATING SYSTEM AND COMES ON AUTOMATICALLY.  LEFT UNREPAIRED IN SOME WAY, IT OBVIOUSLY WILL CONTINUE TO BURN THE PLASTIC, FALL THROUGH ONTO EITHER IT'S OWN WIRES OR THE HEADLIGHT WIRES, SETTING A FIRE. ONLY THEN WILL THE WARNING SYSTEM, FOR WHICH THERE IS A RECALL, BE ACTIVATED!  IMMEDIATELY NOTIFYING ALL SONIC OWNERS TO LOOK THROUGH THE YELLOW GLASS AT AND AROUND THE BULB WHEN IT IS NOT LIT AND TO COMPARE EACH SIDE TO THE OTHER, MIGHT SAVE SOME LIVES.  SO WILL INSISTING THAT CHEVY'S ENGINEERS DEVISE A TEMPORARY REPAIR UNTIL THE PART CAN BE OBTAINED, AND ADDING THIS ISSUE TO THE EXISTING LIGHTING RECALL AS A PRIORITY.",
        "vin": "1G1JC5SG8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT ALL THE SAFETY FEATURES ON THE INSTRUMENT PANEL BECAME INOPERABLE. IN ADDITION, THE CONTACT MENTIONED THAT BOTH TURN SIGNALS FAILED TO OPERATE. THE VEHICLE WAS TAKEN TO A DEALER. HOWEVER, THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1G1JC5SB7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MESSAGE IS DESCRIBING 2 DIFFERENT ISSUES:  THIS VEHICLE WAS PURCHASED BRAND NEW IN THE LATE SUMMER OF 2012 AND HAS EXPERIENCED CONSISTENT ELECTRICAL ISSUES STARTING IN THE WINTER OF 2012. THE ENTIRE MIDDLE CONSOLE WILL COMPLETE POWER OFF, AND THE DIRECTIONAL LIGHTS DO NOT ACTIVATE. THE ONLY STRATEGY FOR \"TURNING IT BACK ON\" IS WHEN THE REAR WINDOW DEFROST BUTTON IS PUSHED REPEATEDLY. THIS HAS OCCURRED EVERY WINTER SINCE. I HAVE HAD THE DIRECTIONAL WAND REPLACED, AND HAVE ADDRESSED 2 RECALLS SENT FROM THE MANUFACTUER. THE PROBLEMS STILL PERSIST.    SECOND AND MOST RECENT ISSUE (BEGAN IN APRIL 2015)- THE CAR STEREO SYSTEM HAS TURNED ITSELF ON AT LEAST 3 TIMES WHILE THE CAR IS PARKED, TURNED OFF- INCLUDING THE RADIO BEING POWERED OFF BEFORE THE CAR IS. ON THREE OCCASSIONS, I HAVE CAME OUT THE NEXT MORNING AND COULD HEAR MY CAR STEREO PLAYING. ON THE THIRD TIME, IT KILLED THE BATTERY.",
        "vin": "1G1JA5SHXD4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "06/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK THE CAR IN FOR AN OIL CHANGE WHERE A TRANSAXLE LEAK WAS NOTICED.  I THEN MADE AN APPOINTMENT TO BRING TO DEALER AS PER TRANSMISSION WARRANTY.  THEY REPLACED THE SEAL, 3 WEEKS LATER WHEN THEY GOT IT IN, I LEFT ONLY TO FIND MY ENGINE LIGHT STILL ON, I THEN BROUGHT IT TO A PARTS STORE FOR A READ AND IT CAME BACK OXYGEN SENSOR.  I LATER WAS LOOKING UNDER HOOD AND FOUND THAT THE AIR INTAKE HOSE IS CRACKED AS I PULLED IT OFF I FOUND IT TO BE CRACKED WITH HOLE IN MORE THAN ONE PLACE, I WILL NOW REPLACE THAT AND HOPE THE ENGINE LIGHT GOES OFF.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON STICKS WHEN IN GEAR OR PARK.",
        "vin": "1G1JC5SB3D4"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2015",
        "dateOfIncident": "01/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS COMPLETELY UNSAFE AT HIGHWAY SPEED THE STEERING IS WAY TO TOUCHY ANY SLIGHT MOVEMENT AND THE CAR IS ALL OVER THE PLACE. THE CAR DOESN'T STAY IN A STRAIGHT LINE IT EITHER GOES RIGHT OR LEFT. ALIGNMENT CHECK DONE EVERYTHING IS GREAT AND GOT NEW TIRES. I'M PART OF THE SONIC OWNERS FORUM AND THIS ISSUE ISN'T EVERY SONIC IT DOES SEEM TO BE VERY WIDESPREAD THOUGH AS YOU CAN JUST CHECK THE LEMON LAW WEBSITE. SOMETHING IS WRONG WITH THIS ELECTRIC POWER STEERING DON'T KNOW WHY THEY SWITCHED FROM HYDRAULIC. THESE SYSTEMS ARE UNSAFE AND FAILURE PRONE. I CAN'T KEEP THE CAR IN A STRAIGHT LINE AT HIGHWAY SPEEDS BUT AT NORMAL SPEEDS IT'S A LOT EASIER TO KEEP IT STRAIGHT BUT SOMETIMES IT DOES WANDER A TINY BIT. PEOPLE PROBABLY THINK I'M INTOXICATED BECAUSE I'M WANDERING AND TRYING TO KEEP THE CAR IN A STRAIGHT LINE.",
        "vin": "1G1JA5SH9D4"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2013 CHEVROLET SONIC. WHILE DRIVING 10 MPH, THE VEHICLE EXPERIENCED AN ISSUE WITH THE AIR DUCT. THE CONTACT STATED THAT THE VEHICLE'S ENGINE RAN HOT DUE TO THE PRESSURE RATIO. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DIAGNOSED THERE WAS A TEAR IN THE AIR DUCT THAT NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE TEAR IN THE AIR DUCT WAS BETWEEN THE MAP SENSOR AND THE THROTTLE BODY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 35,000.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2014 WHEN THE CAR WAS STILL UNDER WARRANTY...THE CAR WAS TAKEN TO DEALER MULTIPLE TIMES AND THE ISSUE WAS CAR APPLIED BRAKES AUTOMATICALLY WHEN TURNING CERTAIN CORNERS...THE ISSUE WAS NEVER FIXED AND COMPLAINTS WERE FILED WITH GM FOR RECORD PURPOSES IN CASE OF AN INCIDENT AND AS AN ATTEMPT TO GET CAR FIXED....WHILE THIS IS NOT THE EXACT PROBLEM OCCURRING AT THE PRESENT TIME...IT IS A STEERING TYPE PROBLEM...NOW THE POWER STEERING GOES OUT AND MOMENTARILY COMES BACK ON.",
        "vin": "1G1JE5SB2D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2015",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO WORK NOTICED THE CAR LACKING SOME POWER WHEN ACCELERATING TO GET ON HIGHWAY. OVER THE NEXT 2 WEEKS CAR STARTED SOUNDING DIFFERENT. (LIKE DRIVING WITH AIR BREATHER OFF) WHILE CHANGING OIL TODAY NOTICED AIR INTAKE TUBE IS CRACKED. WHICH COULD ALLOW DIRT AND MOISTURE TO BYPASS FILTER AND GO INTO ENGINE CAUSING DAMAGE. NOW THE CAR HAS 52130 MILES ON IT  2013 SONIC LS. AIR INTAKE TUBE SHOULD LAST LONGER THEN 2 YEARS.  *TR",
        "vin": "1G1JA5SH0D4"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKES A KNOCKING NOISE FROM THE PASSENGER FRONT AND REAR, WHEN THE VEHICLE GOES OVER BUMPS AND WHEN THE VEHICLE MAKES TURNS. THE KNOCKING SOUND CAN BE HEARD, WHEN THE CAR IS PARKED PUSHING DOWN ON EITHER THE FRONT FENDER BACK PASSENGER SIDE. VEHICLE ALSO SWAYS AT HIGHWAY SPEED.  *TR",
        "vin": "1G1JC6SB5D4"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/10/2015",
        "dateOfIncident": "04/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "OPTIMO H426",
                "productYear": "9999",
                "size": "P215/45R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC EQUIPPED WITH HANKOOK OPTIMO H428 (NA) TIRES, SIZE P195/65R15 (NA). THE CONTACT STATED THAT ALL FOUR FACTORY TIRE SIDEWALLS WERE SEVERELY CRACKED AND THE FRONT PASSENGER TIRE THREAD HAD BEGUN TO SEPARATE. THE CONTACT NOTIFIED GM AND HANKOOK OF THE FAILURE. ONLY THE FRONT PASSENGER SIDE TIRE WAS REPLACED. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 11,000.",
        "vin": "1G1JC5SBXD4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2015",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THE AIR BAG SENSOR FAILED TO RECOGNIZE THAT THE FRONT PASSENGER SEAT WAS OCCUPIED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN STATED THAT THE VEHICLE WAS OPERATING AS DESIGNED AND STATED THAT THE PASSENGER COULD BE UNDER WEIGHT. THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 25.",
        "vin": "1G1JA5SHXD4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2015",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A DETECTION SYSTEM IN THE PASSENGER SEAT. THIS SHOULD DETECT IF ANYONE IS IN THAT SEAT. WHEN PASSENGER IS DETECTED, THE PASSENGER AIRBAGS SHOULD BE ACTIVATED. FOR SMALL CHILDREN (UNDER A CERTAIN, NOT SPECIFIED WEIGHT LIMIT), THE AIRBAGS ON PASSENGER SIDE ARE NOT ACTIVATED.  PROBLEM IS THAT THE PASSENGER AIRBAGS ARE NOT EVEN ACTIVATED WHEN MY WIFE IS IN THAT SEAT. SHE IS BORN 06/13/1971 AND WEIGHS ABOUT 130 LB.   OBVIOUSLY, THE PASSENGER AIRBAGS SHOULD BE ACTIVATED WHEN AN ADULT IS IN THAT SEAT THAT WEIGHS ~ 130 LB.  SINCE THIS IS A SERIOUS SAFETY ISSUE, WE TOOK THE CAR TO CHEVROLET DEALER (AUTONATION CHEVROLET NORTHPOINT, 2175 MANSELL ROAD, ALPHARETTA, GA, 30004, PHONE 855-478-9750, CONTACT [XXX]). ENGINEER AND SERVICE MANAGER DID ALL CHECKS AND CONCLUDED THE CAR IS OPERATING AS DESIGNED. WE CALLED CHEVROLET OWNER CENTER (SR. MANAGER CALLED [XXX], CASE FILE NR. [XXX]). THEY LOOKED INTO THE CASE AND SPOKE TO CHEVROLET DEALER NORTHPOINT. CONCLUSION IS THE SAME; CAR IS WORKING AS DESIGNED. WE SPOKE TO HIGHER MANAGER OF SR. MANAGER [XXX]  AT CHEVROLET'S OWNER CENTER. SHE ALSO CONCLUDED THE SAME.  IN OUR OPINION, THERE IS A SERIOUS SAFETY HAZARD WITH THE CHEVROLET SONIC 2013 AS AIRBAGS ARE NOT ACTIVATED, EVEN FOR SOME ADULTS. OUR CAR WILL NOT BE FIXED BY CHEVROLET USA OR CHEVROLET DEALER SO WE ARE HOPING YOU CAN ADDRESS THIS PROBLEM.  FOR FURTHER QUESTIONS, PLEASE CONTACT ME AT BELOW CONTACT DETAILS.  THANKS IN ADVANCE,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G1JC6SGXD4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/17/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10683816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING 40 MPH, ANOTHER VEHICLE CRASHED INTO THE FRONT DRIVER SIDE OF THE CONTACT'S VEHICLE. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A TELEPHONE POLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A BRUISED COLLAR BONE AND SOFT TISSUE BRUISING, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING, BUT THE RESULTS WERE UNKNOWN. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "1G1JC5SH5D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN LOSING COOLANT FOR LAST SIX MONTHS. THERE IS A STRONG ODOR OF COOLANT INSIDE AND OUTSIDE OF THE VEHICLE AND THERE IS WATER INSIDE CABIN AIR FILTER BOX. DEALER ACKNOWLEDGED THE ISSUE AND INSPECTED VEHICLE WITH A GM ENGINEER, BUT COULD NOT FIND THE CAUSE OF EITHER ISSUE.",
        "vin": "1G1JC6SB5D4"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681356,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LOOSING COOLANT AND A SMALL PUDDLE OF COOLANT DEVELOPED UNDER THE PASSENGER SIDE OF VEHICLE. COOLANT TEMPERATURE LIGHT CAME ON INDICATING OVERHEATING WHILE TAKING VEHICLE IN FOR SERVICE. DEALER DETERMINED THAT A FAULTY SEAL WAS CAUSING THE WATER PUMP TO LEAK COOLANT.  *TR",
        "vin": "1G1JC6SB5D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "02/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPED THE VEHICLE WOULD LUNGE FORWARD WITHOUT WARNING. VEHICLE WAS TAKEN TO DEALER FOR SERVICE AND THEY REPLACED THE 1-2-3-4 CLUTCH. THE PROBLEM FIRST APPEARED IN 2013, VEHICLE CURRENTLY HAS 31460 MILES AND IS STARTING TO EXHIBIT THE SAME SYMPTOMS OF THE ORIGINAL PROBLEM TWO YEARS LATER.  *TR",
        "vin": "1G1JC6SB5D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "01/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHIFTER BUTTON WOULD GET STUCK WHEN SHIFTING AND CAN CHANGE INTO PARK OR DRIVE OR REVERSE WITH OUT HOLDING THE BUTTON IN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "01/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678535,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2013 CHEVROLET SONIC IS AN AUTOMATIC AND WHEN WE WERE DRIVING IN IT THE BUTTON TO SHIFT IT FELL OFF. IT HAD TO BE PUT BACK, WHICH WAS DIFFICULT, WHILE STEPPING ON THE BRAKE. IT STICKS AND I AM AFRAID IT WILL STICK AND SHIFT AND CAUSE A SERIOUS ACCIDENT.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "01/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AT APPROXIMATELY 50 MPH.  I SHIFTED FROM 4TH TO 5TH AND SOMETHING DIDN'T FEEL RIGHT, LIKE THE TRANSMISSION DIDN'T ENGAGE.  I THEN REALIZED I COULD NOT MOVE THE SHIFT LEVER ON THE TRANSMISSION OUT OF GEAR.  I ATTEMPTED TO TAKE THE NEXT EXIT BUT THE RAMP WAS ONLY SUITABLE FOR AROUND 30MPH.  I TRIED TO KEEP THE ENGINE FROM STALLING AS BEST AS I COULD.  AS I GOT AROUND THE RAMP I PULLED TO THE SHOULDER AND NEARLY HIT A GUARD RAIL BECAUSE THE SHOULDER ENDED AND I BARELY STOPPED IN TIME.    I CALLED CHEVY ROADSIDE ASSISTANCE FOR A TOW VEHICLE AND THEY DISPATCHED ONE.  WHILE I WAS WAITING I GOOGLE'D MY PROBLEM (\"CHEVY SONIC STUCK IN GEAR\").  ALAS, ANOTHER PERSON HAD THE SAME EXACT ISSUE WITH THE SAME EXACT VEHICLE.  ACCORDING TO THIS MESSAGE BOARD POSTER A SMALL PLASTIC CLAMP SLID OUT OF PLACE CAUSING THE SHIFT CABLE TO BE REMOVED FROM IT'S HOUSING, ESSENTIALLY RENDERING IT USELESS.  I TOOK APART MY CONSOLE AND FOUND I HAD THE SAME PROBLEM.  WHEN I REINSTALLED THE PLASTIC CLAMP THAT HOLDS THE CABLE IN PLACE EVERYTHING WORKED NORMALLY, I WAS ABLE TO SHIFT IN AND OUT OF GEAR.  I BELIEVE A RECALL SHOULD BE ISSUED AS THIS IS A VERY DANGEROUS SITUATION TO BE IN WHEN TRAVELING AT HIGHWAY SPEEDS.  *TR",
        "vin": "1G1JD5SB7D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/14/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST THING I NOTICED WAS WHEN I TURNED THE CAR ON AND PUT IT IN DRIVE THE RADIO TURNED OFF AND WOULD NOT COME BACK ON. AS I WAS DRIVING I THEN NOTICED THE CARS SIGNAL LIGHTS WERE NOT WORKING EITHER. I HAD TO TURN THE CAR ON AND OFF SEVERAL TIMES BEFORE THE SIGNAL LIGHTS WOULD BEGIN TO WORK AGAIN.  *TR",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC:I1480205A. 2013 CHEVY SONIC. CONSUMER STATED THAT HE IS HAVING PROBLEMS WITH THE KEY FOB FOR IS CAR. *LN  THE CONSUMER STATED HE HIT THE KEY FOB FAIRLY HARD WHICH CAUSED THE KEY TO  TURN, AND THE VEHICLE SHUT OFF. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2014",
        "dateOfIncident": "09/12/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT BETWEEN 55 AND 65 MPH. THE SIDE I WAS ON HAD A LONG, STEADY INCLINE UPWARD. I HAD SET MY CRUISE CONTROL TO ABOUT 63 MPH.  AS I WAS GOING UPHILL THE CRUISE CONTROL WAS SUPPLYING FUEL TO GET TO AND MAINTAIN MY SPEED AT 63 MPH.  I WAS APPROACHING ANOTHER CAR IN MY LANE AND DECIDED RATHER THAN PASS, I WOULD SLOW DOWN.  THEY WERE GOING QUITE A BIT SLOWER THAN ME SO CAME UP UPON THEM QUICKLY. I PRESSED THE BRAKE TO SLOW DOWN BUT THE BRAKE WAS HARD AS A ROCK. IT WOULD NOT BUDGE SO IT DID NOT DISCONNECT THE CRUISE CONTROL AND MY CAR KEPT ACCELERATING.  I PANICKED AND TRIED TO USE BOTH FEET ON THE BRAKE. IT STILL WOULD NOT BUDGE.  I WAS WITHIN 2 CAR LENGTHS OF THE CAR IN FRONT OF ME WHEN FINALLY THE CAR REACHED THE SPEED I HAD SET THE CRUISE CONTROL FOR AND THE BRAKES FINALLY DEPRESSED.      IN HINDSIGHT, I HAD OPTIONS I.E. PUTTING THE CAR IN NEUTRAL, TURNING KEY OFF, TURNING TO AVOID A COLLISION, SHUTTING OFF CRUISE CONTROL, BUT THIS CAR WAS NEW TO ME, AND IN THAT MOMENT I FULLY EXPECTED THE BRAKES TO WORK.     ONCE I WAS IN CONTROL, I TRIED TO RECREATE THE PROBLEM WITH NO ONE AROUND, KNOWING MY OPTIONS NOW. IT HAPPENED REPEATEDLY. A SERVICE TECH ALSO HAD IT HAPPEN TO THEM. FIRST ATTEMPT AT REPAIR DID NOT FIX IT. SECOND ATTEMPT DID. IT WAS A BAD CHECK VALVE. APPARENTLY THE CHECK VALVE LET AIR OUT OF A BOOSTER, SO I LOST MY BRAKES? THE CHECK VALVE ALSO LET FLUID FILL THE BOOSTER. THE MASTER CYLINDER AND VACUUM WERE REPLACED AS WELL.     LOOKING BACK, THERE WERE SIGNS, BUT NO OBVIOUS ONES. A RANDOM HI-PITCHED NOISE (AIR SQUEAKING OUT THE CHECK VALVE). LOSS OF BRAKE FLUID. DEALER HAD TO FILL IT WHEN I BOUGHT IT AND I ADDED SOME AT 6 MONTHS.    THIS WAS A DANGEROUS AND SCARY EXPERIENCE. I QUESTION THE DESIGN TO DIS-ENGAGE CRUISE CONTROL AND THE QUALITY OF THE CHECK VALVES THEMSELVES.  *TR",
        "vin": "1G1JC6SB8D4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2014",
        "dateOfIncident": "08/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY IS AWARE OF THIS PROBLEM, BUT THEY DON'T HAVE A WORKING SOLUTION.  THEIR RELATED BULLETIN IS PI0826.     I PARK MY CAR ON AN INCLINE WITH THE RIGHT SIDE OF THE CAR SLIGHTLY HIGHER THAN THE LEFT BY APPROXIMATELY 10 DEGREES     WHEN IT RAINS, WATER COMES IN THROUGH THE LOWER WINDSHIELD AREA, DOWN AN AIR VENT, THROUGH AND AROUND AN AIR FILTER, THROUGH AND AROUND A FAN ASSEMBLY AND DRIPS ONTO THE PASSENGER SIDE FLOOR.     1ST TIME IT HAPPENED, I THOUGH IT WAS ME, LEAVING THE WINDOW AJAR, OR A  WATER BOTTLE LEAKING, OR ACCIDENTLY LEAVING DOOR UNLOCKED AND SOMEONE DOING SOMETHING. I DRIVE MAYBE ONCE A WEEK, SO BY THE TIME I FOUND THE PROBLEM, THE CAR SMELLED REALLY BAD. IT WAS A FISHY TYPE SMELL. I HAD CHECKED WINDOWS, THEY WERE UP. I HAD TO UNLOCK, SO IT WAS NO ONE GETTING IN.     LUCKILY, THE MAT HAD A PLASTIC BOTTOM AND IT HELD  MOST OF THE WATER, BUT THE CARPET BELOW DID GET WET AS WELL.     I HADN'T USED THE CAR FOR ABOUT 5 DAYS, AND THE FLOOR MAT WAS STILL SOAKED 3-4 DAYS AFTER THE ACTUAL RAIN. IT TOOK 3 DAYS TO REMOVE THE SMELL FROM THE MAT ALONE. LAUNDRY DETERGENT DIDN'T WORK. I FINALLY GOT IT BETTER WITH WHITE VINEGAR. I HAD TO SPRAY IT AFTER THAT WITH LYSOL AND COLOGNE. SO MUCH FOR THE \"NEW CAR SMELL\".    2ND TIME IT HAPPENED I KNEW IT WASN'T ANYTHING I DID. LUCKILY, I WENT OUT TO CHECK IT THE DAY AFTER A STORM. IT WAS SOAKED AGAIN, AND AGAIN I HAD TO CLEAN IT AND DRY IT UP.      THIS IS WHEN I SEARCHED AND FOUND OUT ABOUT THE BULLETIN. IT WAS APPLIED BY A DEALER, BUT IT DID NOT WORK. 2ND ATTEMPT TO REPAIR WAS TO REPLACE THE LOWER TRIM ON WINDSHIELD. THERE IS LESS WATER, BUT IT'S STILL COMING IN. I SHOULDN'T HAVE TO WORRY HOW I PARK.     I AM CONCERNED ABOUT MOLD FROM THE WET FILTER & FLOOR PADDING, PREMATURE RUSTING WHEN THE FLOOR GETS WET AND PREMATURE FAILURE IF THE FAN GETS WET. I HEARD SAME ISSUE ON ANOTHER MODEL HAS A SPECIFIC PART FOR THE FIX.  *TR",
        "vin": "1G1JC6SB8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "10/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME, THE VEHICLE STARTED TO SMOKE. THE WINDOWS WERE ROLLED DOWN, THE AIR CONDITIONER WAS OFF AND IT IS ABOUT 86 DEGREES OUTSIDE. THIS ISN'T THE FIRST QUIRKY INCIDENT TO HAPPEN IN THIS VEHICLE. I JUST BOUGHT IT ABOUT 7 MONTHS AGO. ALL THE STANDARD MAINTENANCE HAS BEEN DONE TO THIS VEHICLE. NOT SURE WHY IT IS SMOKING. AFTER IT BEING IN OUR CARE FOR 4 MONTHS, THE CHECK ENGINE LIGHT WILL ALSO NOT GO OFF, AND THE REMOTE START DOESN'T WORK ANYMORE. THE DRIVER SIDE DOOR HAS BECOME LOOSE AS WELL. NO ONE HAS BEEN HANGING ON IT, JUST SIMPLY OPENING AND CLOSING THE DOOR. ALSO THE PLASTIC CAP ON THE SHIFT HAS POPPED OFF. I WILL BE GETTING IT CHECKED TOMORROW AND POSSIBLY GETTING RID OF IT SOONER THAN LATER. THIS IS A VERY POOR GM MODEL CAR.   *TR",
        "vin": "1G1JE5SH3D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK DOING 55 MPH THE CAR JUST SUDDENLY TURNED ITSELF OFF WITH NO WARNING.  THE DASHBOARD WENT BLANK.  WAS ABLE TO PULL OVER OFF THE ROAD.  THE KEY WAS STILL IN THE ON POSITION.  THE CAR RESTARTED WITH NO PROBLEM BUT MY GAS GAUGE SHOWED ONLY 1 BAR AND THE MILES PER TANK SHOWED 40.  BEFORE THE INCIDENT I HAD 1/2 A TANK OF GAS.  AS I STARTED DRIVING AGAIN THE GAS GAUGE LITTLE BY LITTLE STARTED TO MOVE BACK UP TO WHERE IT WAS.  VERY SCARY.  *TR",
        "vin": "1G1JA5SH2D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10638739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE WAS INVOLVED IN A HEAD ON COLLISION. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THERE WAS ONE INJURY REPORTED THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "1G1JA5SH1D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THERE WAS AN INTERMITTENT LEAK IN THE TRANSMISSION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE TECHNICIAN DIAGNOSED THAT THE SEALS AND GASKETS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT INQUIRED IF THE ENGINE NEEDED TO BE REPAIRED AND NEITHER THE AUTHORIZED DEALER NOR THE MANUFACTURER WAS ABLE TO CONFIRM IF THE COMPONENT NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10627194,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE ATTEMPTING TO PARK, THE VEHICLE ACCELERATED AND CRASHED INTO A POLE. THE CONTACT STATED THAT THE FRONT DRIVER SIDE AIR BAG FAILED TO DEPLOY.  THE CONTACT SUSTAINED INJURIES TO THE BACK AND BRUISES ON HER BODY.  THE VEHICLE WAS DESTROYED. THE VIN WAS NOT AVAILABLE.  THE FAILURE MILEAGE WAS 22,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED A 2013 CHEVY SONIC FOR ABOUT 6 MONTHS NOW. THE OTHER DAY I WENT OUT TO DRIVE, SO I  STARTED MY CAR WITH MY KEY FOB. AS I WAS ABOUT TO DRIVE AWAY I REACHED UP WITH MY RIGHT HAND TO  TURN ON THE WIPERS. I HIT THE FOB FAIRLY HARD AND IT CAUSED THE KEY TO TURN, WHICH IN TURN SHUT OFF  THE CAR. LUCKILY I WAS NOT DRIVING WHEN I WENT TO PUT THE WIPERS ON. EVEN MORE LUCKY WAS THAT I  WASN'T DRIVING AND HIT IT HARD ENOUGH TO LOCK THE STEERING.    I'VE HEARD THAT THIS WAS AN ISSUE IN OTHER VEHICLES AND IT WAS RESOLVED BY SEPARATING THE KEY AWAY  FROM THE FOB SO THAT THE FOB DANGLED INSTEAD OF CREATING A LONG, SOLID KEY THAT COULD CAUSE THE  ISSUE WHICH HAPPENED TO ME.    YOU WOULD THINK WITH ALL THE IGNITION ISSUES GM HAS HAD, THEY WOULD HAVE COVERED ALL POSSIBLE PROBLEMS, BUT OBVIOUSLY NOT.    I FEEL THE ONLY SOLUTION WOULD BE TO SEPARATE THE FOB FROM THE KEY SO THAT IT DOES NOT LOCK AND  EXTEND SO MUCH THAT IT BECOMES AN OBSTACLE WHEN USING THE CONTROLS AROUND IT. THE KEY SHOULD  BE SEPARATE FROM THE FOB. WHETHER PUT ON THE SAME KEY CHAIN OR NOT, THAT WOULD BE UP TO THE  CONSUMER.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES TREMBLE, WHEN STOPPING..  I HAD THEM CHECK OUT. 07/24.2013.... THE MECHANIC STATED:  THE BRAKES ARE NEW.  IT MIGHT BE ROTORS.  WHAT IS THE PROBLEM?  IS THERE A RECALL?  IF NOT THERE SHOULD BE!!  *TR",
        "vin": "1G1JC5SG1D4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE STARTED HEARING A RATTLING COMING FROM THE RIGHT TRUNK AREA TOOK IT TO BE DIAGNOSED AND THIS ISSUE CANNOT BE FIXED TRUNK LID IS RUBBING SIDE OF CAR CHIPPING PAINT IT IS UNABLE TO BE ALIGNED BECAUSE BODY IS BENT MOST OF THE BODY LINES ON THE VEHICLE ARE NOT LINED UP",
        "vin": "1G1JC5SHXD4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS SMOKING FROM ENGINE AND EXHAUST AND CREATING EXTREME HEAT.  *TR",
        "vin": "1G1JC5SB4D4"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611397,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "YOU CANT PUT ANYTHING IN THE TRUNK OR HAVE PASSENGERS ON BACK SEAT WITHOUT CAR BOTTOMING OUT. IF YOU EXCEED 300 POUNDS IN TRUNK THE BACK WHEELS GO ALL THE WAY UP IN CAR, RIDE IS TERRIBLE.  *TR",
        "vin": "1G1JE5SB0D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "01/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10607727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING DOWN THE ROAD IN OHIO WHEN A F-150COME OUT OF ANOTHER ROAD AND T BONED ME THEY HAD O CUT ME OUT OF THE CAR MY NECK WAS INJURED AND MY BACK STILL HURTS AND I HAVE BAD HEADACHES NOW THE AIR BAGS DID NOT DEPLOY BUT GM SAYS I WAS NOT HIT HARD ENOUGH BUT I HAD SEVERAL AIRBAGS IN THE CAR AND NONE OF THEM DEPLOYED AND CAR WAS A TOTAL LOSS .I THINK IT IS PRETTY SAD WHEN U BUY A VEHICLE FOR SAFETY THEN YOU CRASH AND THE COMPANY HAS NO CARE ABOUT YOU THEY JUST CARE ABOUT TRYING TO SAY THAT NOTHING WAS FAULTY ON THERE PART BUT AS WE ALL KNOW THEY HAVE HAD SEVERAL RECALLS ON THESE CARS SINCE FOR FAULTY AIRBAGS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "06/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST NOTICED THERE WAS AN AIRBAG RECALL ON MY VEHICLE, I DID NOT GET NOTICE OF THIS RECALL. I WAS IN A RECENT ACCIDENT AND EVERYONE SEEM SHOCKED THAT MY AIRBAGS DID NOT DEPLOY DUE TO THE DAMAGES TO MY CAR. ADDITIONALLY, I AM HAVING TO ADD AIR TO MY TIRES WEEKLY AS SOON AS I ADD AIR THEN I GET ANOTHER WARNING THAT MY TIRES NEED MORE AIR.  THE SENSOR DID NOT RESPOND AS MY ONSTAR SERVICES DID NOT GET IT TO RESPOND AS THE SERVICE IS SET UP TO DO.  I HAVE CHANGED CLIMATE FROM A COLD(PA) TO A WARMER (GA) AND STILL HAVE THE SAME PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED MORE THAN ONCE SINCE I BOUGHT THE CAR IN OCTOBER 2013, BUT IT IS HAPPENING DAILY NOW. I PUT THE KEY IN THE IGNITION AND IT WILL NOT TURN AT ALL. IT IS STUCK. I TAKE THE KEY OUT AND PUT IT BACK IN AND TRY TO TURN WITH NO LUCK. TODAY IT TOOK 15 TIMES OF TRYING TO TURN THE KEY AND TAKING IT OUT AND PUTTING IT BACK IN BEFORE IT WOULD START. I HAVE EVEN VIDEOED MYSELF TRYING TO START MY CAR SO I CAN SHOW THE DEALERSHIP. I AM SUPPOSED TO TAKE IT IN TOMORROW.  *TR",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HASELWOOD CHEVROLET BUICK GMC DEALERSHIP FIXED THE TRANSMISSION SEALS I NOTICED THAT THE ENGINE IS IDLING ROUGH WHEN AT A STOP LIGHT I NOTICE THIS EVERY ONCE IN A WHILE.   *JS",
        "vin": "1G1JC5SB1D4"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/07/2014",
        "dateOfIncident": "06/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER MAKES A HORRIBLE SQUEALING NOISE. IT DOES THIS LIKE CLOCKWORK EVERY 30 SECONDS WHILE RUNNING THE AC ON 2 OR ABOVE. IT IS SO LOUD EVEN WITH THE RADIO ON YOU HEAR IT GOING DOWN THE ROAD. IT STARTED RIGHT AFTER I HIT 2000 MILES ON THE CAR AND ABOUT A MONTH AFTER BUYING IT. IT CONTINUES TO DO IT A YEAR LATER AND I HAVE TAKEN IT TO THE DEALER 8 TIMES, THE SAY IT IS NORMAL.  *TR",
        "vin": "1G1JD5SH0D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594446,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN PARK, THE ENGINE IDLES VERY ROUGHLY.  AS A RESULT OF THE ROUGH IDLE, THE FUEL ECONOMY IS NOT AS GOOD AS IT IS SUPPOSED TO BE.  TWICE, THE CAR HAS STOPPED RUNNING WHEN AT A STOP SIGN/TRAFFIC LIGHT.  WHEN I REPORTED TO MY DEALER, THE DEALER INFORMED ME THERE WAS A TSB ON THE ISSUE AND THE SOLUTION WAS TO RUN TIER 1 GASOLINE IN THE VEHICLE.  THE DEALER INDICATED THAT GM DOES NOT HAVE A \"FIX\" FOR THE PROBLEM.    THE CAR HAS THE 1.8 L GASOLINE ENGINE WITH SIX SPEED AUTOMATIC TRANSMISSION.  *TR",
        "vin": "1G1JC6SH9D4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "01/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THE IGNITION KEY WOULD NOT RELEASE FROM THE SWITCH UNTIL AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE GEAR SHIFT CONSOLE HOUSING WAS CLEANED INTERNALLY. THE SHIFTER CABLE WAS ALSO CLEANED WITH A DEGREASER SOLUTION. THE VEHICLE WAS REPAIRED HOWEVER, ONE WEEK LATER THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35,000. DR",
        "vin": "1G1JC5SH6D4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION SEALS HAD TO BE REPLACED BECAUSE THEY WERE NOT PROPERLY SEALED AT TIME OF MANUFACTURE.  *TR",
        "vin": "1G1JC5SB1D4"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586253,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF MY DRIVE WAY MY STEERING WHEEL LOCKED.  THE POWER TO THE CAR WAS ON BUT THE POWER STEERING WOULD NOT WORK. I CALLED A TOW TRUCK AND IT WAS TAKEN TO THE DEALERSHIP FOR SERVICE.  THE DEALERSHIP HAS HAD MY CAR FOR 3 MONTHS AND WILL NOT RELEASE IT BECAUSE IT HAS BEEN DECLARED UNSAFE TO DRIVE.  THE DEALERSHIP PUT ME IN A RENTAL CAR AND I HAVEN'T HEARD FROM THEM SINCE.  NO ONE WILL RETURN MY CALLS OR ANSWER MY QUESTIONS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "01/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE CONTACT MENTIONED THAT AFTER NUMEROUS ATTEMPTS, THE VEHICLE WAS ABLE TO START AND FUNCTION PROPERLY. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 115,000 AND THE CURRENT MILEAGE WAS 120,000.",
        "vin": "1G1JG6SB5D4"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "03/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 12, 2014 AROUND 8:00 P.M I HAD AN ACCIDENT WITH MY VEHICLE AT MY HOME. MY CAR IS A MANUAL TRANSMISSION SO WHEN I WENT TO TURN IT ON, ONLY HALF OF MY BODY WAS IN THE VEHICLE TO TURN IT ON. BEFORE TURNING IT ON I DID NOTICE THE E-BRAKE ENGAGED AND THE CAR WAS IN FIRST GEAR. I PROCEEDED TO TURN IT ON KNOWING THAT I COULD STILL TAKE IT OUT OF GEAR BEFORE ENGAGING THE CLUTCH AGAIN. AT THE MOMENT OF IGNITION THOUGH, THE CAR TOOK OFF FORWARD AND TOOK ME WITH IT. FROM THE PANIC THAT I HAD, I HELD ONTO THE STEERING WHEEL AND PULLED IT TO THE LEFT AND THE VEHICLE RAN INTO ANOTHER PARKED VEHICLE TO THE LEFT FRONT OF ME. THE IMPACT OF THE VEHICLE LED TO THE DOOR OF THE CHEVY SONIC TO CLOSE ON MY RIGHT LEG AND THE DOOR STAYED SHUT ON MY LEG SINCE THE CAR HAD RAN ONTO THE RIGHT SIDE OF THE OTHER VEHICLE. UPON IMPACT ONTO THE OTHER VEHICLE, I NOTICED AN ODD SMELL THAT SEEMED LIKE BRAKES. THE CAR HAD STOPPED DUE TRASH CANS THAT WERE AT THE FRONT OF IT. WHEN THE CAR IMPACTED THE TRASH CANS , THE VEHICLE STOPPED MOVING YET THE CAR WAS STILL WANTING TO GO ON AHEAD AS IF SOMEONE WAS ACCELERATING THE VEHICLE. DURING THIS TIME WHILE THIS HAPPENED AND I WAS STILL PINNED BETWEEN THE DOOR OF THE CHEVY SONIC AND HAVING THE DOOR KEPT SHUT ON ME DUE TO THE SIDE IMPACT WITH THE OTHER VEHICLE, I SMELLED SOMETHING THAT SEEMED LIKE BRAKES TO ME. AFTER SEVERAL ATTEMPTS TO SHUT OFF THE VEHICLE, I FINALLY MANAGED TO TURN IT OFF. I THEN PUT IT TO NEUTRAL AND DISENGAGED THE E-BRAKE AND HAD FAMILY MEMBERS ROLL THE CAR BACK. UPON BEING UNPINNED FROM THE OTHER VEHICLE AND HAVING MY LEG FREED FROM THE CHEVY SONIC, MY FIRST THOUGHT WAS TO TRY OUT THE E-BRAKE TO MAKE SURE IT WAS WORKING PROPERLY. THE E-BRAKE DID NOT FAIL TO ENGAGE OR DISENGAGE. I HAVE REPEATED THIS SAME SITUATION OVER AND OVER. THE ONLY RESULT HAS BEEN THE CAR JERKING FORWARD ABOUT 2 FEET THEN STALLING DUE TO THE E-BRAKE BEING ENGAGED.  *TR",
        "vin": "1G1JB6SG4D4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "02/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS STOPPED, IT BEGINS TO MAKE A RATTLING NOISE, AT TIMES IT CAN BE QUITE LOUD, IT ALSO STARTS TO VIBRATE AND ALMOST CUT OFF. THE NOISE SOUNDS AS IF IT IS COMING FROM THE ENGINE. THE NOISE HAS BEEN SPORADIC. I TOOK THE CAR INTO THE DEALER AND THEY COULD NOT FIND ANYTHING WRONG. THIS IS QUITE CONCERNING.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN.7/2013 HEARD SUTTLE/SCRAPING/RATTLE SOUNDS, THOUGHT I ROLLED OVER SOMETHING ON DARK ROAD IN CONSTRUCTION ZONE. MOVED MY CAR TO LEFT THEN REALLY SCRAPED ON SOMETHING. BY NEXT MORNING SOME OIL LEAKED OUT. HAD CAR TOWED TO G.M. DEALER. THEY HAD MAIN ENGINEERS TRYING TO FIGURE OUT WHAT WAS CAUSING OIL TO SPREAD IN ENGINE &SONIC WAS INSANELY SMOKING BLACK SMOKE IN, AROUND.LIKE IN BLACK CLOUD WITH SPARKS COMING OUT BACK OF CAR. I GOT TERRIFIED, AS I HAD JUST PICKED IT UP,WAS TOLD THEY HAD FIXED THE OIL LEAKS. DEALER STILL HAS CAR. 3/3/13 THEY TOLD ME IT WAS FIXED, BUT IT REEKED WITH TOXIC FUMES, I BECAME NAUSEOUS, THROAT WAS SCRATCHING LIKE BEFORE. TOLD GM THAT SONIC WAS NOT FIXED. REQUESTED NEW CAR FROM THEM. THEY ARE OFFERING ME A REPURCHASE. I DON'T KNOW WHAT THAT MEANS. THEY HAVE REFUSED TO EXTEND MY RENTAL TO TRANSPORT MY FAMILY OF 5 SAFELY.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/21/2014",
        "dateOfIncident": "12/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE TRAVELING VARIOUS SPEEDS, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO A FENCE, A HELIPAD, ANDTHEN  A PARKED VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE AND VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2013",
        "dateOfIncident": "11/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 32 MPH AND ATTEMPTING TO APPLY THE BRAKES, A GRINDING NOISE WAS HEARD AS THE BRAKES MALFUNCTIONED. THE DEALER WAS NOTIFIED OF THE DEFECT BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 8000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2013",
        "dateOfIncident": "11/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE BRAKE PEDAL ABNORMALLY TRAVELED TO THE FLOORBOARD WITHOUT WARNING.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE MASTER BRAKE CYLINDER WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 327.",
        "vin": "1G1JC5SH9D4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THIS CAR AS A RENTAL. WHILE DOING SOMETHING WITH THE RADIO, I SOMEHOW HIT THE KEY IN THE IGNITION. THE KEY THEN TURNED TO THE LEFT CAUSING THE ENGINE TO TURN OFF. IN THE SPAN OF A DAY. I DID THIS 3 TIMES. ONCE WAS WHILE MAKING A WIDE TURN ONTO A FREEWAY. LUCKILY, NO ONE WAS BEHIND ME WHEN I HAD TO SUDDENLY STOP TO RESTART THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2013",
        "dateOfIncident": "09/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C DOES NOT WORK GOOD WHILE THE CAR IS AT IDLE. WHEN DRIVING THE CAR THE A/C WILL BEGIN TO COOL. WHEN DRIVING ON THE HIGHWAY AND I HAVE TO BREAK IT STARTS TO BLOW WARMER AIR. WHEN STOPPED AT A RED LIGHT, STOP SIGN, THE A/C WILL STOP COOLING AND BLOWS WARM AIR OUT OF THE VENTS.     I WENT TO THE DEALERSHIP AND DO NOT KNOW HOW TO FIX THE PROBLEM. TOLD ME THAT THE MECHANIC/TECHNICIAN COULD NOT FIND ANYTHING WRONG.  THE DEALERSHIP IS NO HELP AND I JUST WANT MY 17000 CAR AC TO WORK NORMAL/ RIGHT. 2013 CHEVY SONIC 2LT MODEL WITH A 6 SPEED AUTO TRANSMISSION.    PLEASE HELP THANKS! *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVY SONIC LOUD VIBRATION NOISE FROM ENGINE BAY AREA WHEN VEHICLE IS PARKED OR IN THE DRIVE POSITION WHEN STOPPED, IT ALSO OCCURS WITH OR WITHOUT A HEAVY LOAD (MEANING RADIO ON/OFF, AC ON/OFF). AS A CONSUMER I WAS TOLD THIS IS NORMAL OPERATION, NORMAL OPERATION WOULD MEAN EITHER AT THE TIME OF PURCHASE OR SOMETHING THAT ARISES AFTER HIGH MILEAGE ON THE AUTO. PER TECH NOTES \"CASE [XXX], ADVISED A NORMAL OPERATING CHARACTERISTIC OF 4 CYLINDER ENGINE. COMPARED TO SIMILAR VEHICLE MADE THE SAME SOUND. WAS ABLE TO DEADEN NOISE BY APPLYING PRESSURE TO FRONT BUMPER.*** - TECH COMMENTS: NORMAL OPERATING CHARACTERISTIC - INTERNAL\"     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).   *TR",
        "vin": "1G1JC5SH4D4"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2013",
        "dateOfIncident": "05/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE COOLANT TEMPERATURE WARNING LIGHT TURN ON  MY 2013 CHEVROLET SONIC HATCHBACK AS I WAS PULLING UP MY DRIVE WAY. THE AC STOP BLOWING COLD AIR. LIQUID WAS DRIPPING FROM THE FRONT PORTION OF THE CAR. THE FAN KEPT GOING EVEN WHEN AFTER I TURN OFF THE VEHICLE. TURNS OUT RADIATOR HAS TO BE REPLACE.   RIDICULOUS SINCE ITS A BRAND NEW CAR.  *TR",
        "vin": "1G1JE6SB0D4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/08/2013",
        "dateOfIncident": "05/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, A TRACTOR TRAILER CRASHED INTO THE CONTACT'S VEHICLE FROM THE FRONT DRIVER'S SIDE DOOR.  THE FRONT DRIVER, ROOF AND SIDE AIR BAGS FAILED TO DEPLOY.  THE VEHICLE WAS DESTROYED. THERE WERE NO INJURIES. A POLICE REPORT WAS NOT FILED OF THE INCIDENT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 2,000.",
        "vin": "1G1JC5SH8D4"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/11/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FOUND THE  SWITCH BLADE KEY USED BY MANY CHEVROLET PRODUCTS HAS A TENDENCY TO OPERATE WHEN THE KEY IS PUT IN YOUR PANTS POCKET. ON MANY OCCASIONS I HAVE LOCKED OR UNLOCKED THE DOORS OR RELEASED THE TRUNK LATCH SIMPLY BY SITTING DOWN OR WALKING DOWN THE STEPS.THIS IS A MINOR PROBLEM UNTIL YOU REALIZE THERE IS AN AUTO START FEATURE ON THIS KEY AND I WORRY THAT I COULD ACCIDENTALLY START THE CAR BY SITTING IN MY LAZYBOY WITH THE KEY IN MY POCKET.  THE RESULTS COULD BE DEATH DUE TO CARBON MONOXIDE WITH THE GARAGE BEING UNDER THE BEDROOMS.THE BUTTONS ARE NOT RECESSED AND ARE EASILY ACTIVATED BY RUBBING ON YOUR LEG. I HAVE HAD A SIMILAR  KEY FOB FROM FORD FOR MANY YEARS AND HAVE NEVER HAD ANY PROBLEM LIKE THIS.  *TR",
        "vin": "1G1JE5SB1D4"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CONDITION HAPPENS DURING FIRST DRIVE OF THE DAY OR AFTER THE VEHICLE SITS FOR A WHILE. WHILE ACCELERATING THROUGH THE AUTOMATIC TRANSMISSION THE CAR SURGES/JOLTS AT OR NEAR THE SHIFT POINTS. IT ALMOST FEELS AS IF I STARTED MOVING THE VEHICLE IN THE WRONG GEAR, IF IT WERE A MANUAL TRANSMISSION. THIS CONDITION ALSO EXISTS IF YOU START MOVING THE VEHICLE FORWARD AND THEN REMOVE YOUR FOOT FROM THE ACCELERATOR PEDAL AND COAST.  THIS VEHICLE IS THE RS MODEL EQUIPED WITH THE 1.4 LITER TURBO.   *TR",
        "vin": "1G1JG6SB1D4"
    }
]