[
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 65 to 70 mph on the freeway, vehicle suddenly shudders and dash state \"engine reduce speed\" and \"service stabilitrak\" and \"service traction control\". It has happen about twice a month 6 months back. Took it to the dealership, no code so they couldn't find the issue even though I should them multiple videos.  Today the vehicle shut off while driving 65 mph this morning in the fast lane. Luckily my wife put the Emergency lights on and we wasn't hit from behind but cats did brake fast and almost hit us.  So far vehicle has left me on the side on the road 3 times today.  Errors codes that are coming up is P1682 and c042-00. It also states replace ignition relay switch which I had done 3 times already.  Once this happens I have to wait 10 minutes, then restart, then shut off, then reatart, then shut off then restart until to vehicle starts up how it should start up with no hesitation or shaking. Then I can make it home   My fear is my wife will be driving and car shuts off while driving on the freeway with the kids. I know this issues was recalled with the traverse 2009 and 2010 and some other vehicle gm made.",
        "vin": "1gnkrlkd5dj"
    },
    {
        "components": "AIR BAGS,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "General Motors is not notifying GM vehicle owners of electrical defect malfunctions that has been on-going for a number of years; leaving vehicle owners with alarming operational occurrences and unexpected repair expenses. While driving our 2013 Chevrolet Traverse fall 2021, we experienced the passenger airbag light coming on and staying on, along with the blind spot detection system lights coming on and staying on for both side mirrors. Also, the key fob wouldn’t work—manually lock and unlock the vehicle. We disconnected the negative battery terminal to reset the computers, resulting in the key fob to work and the passenger airbag light to go out. The blind spot detection system continued to malfunction so we scheduled a repair appointment with our Chevrolet dealership. Prior to the appointment, we endured a frightening experience while driving our Traverse; the entire instrument panel went out along with the radio. This electrical malfunction occurred on two separate occasions. In addition, the engine light came on and the engine temperature gage did not work properly. The dealership performed two diagnostic tests 11/5/2021 determining the engine coolant sensor malfunction and blind spot detection system modules/hardness malfunction. The dealership service manager explained other electrical malfunctions such as steering wheel movement and passenger seat movement that could occur while driving our vehicle should we continue to operate our vehicle without repairing the blind spot detection system and the need to replace both modules and the electrical harness. The video showed both modules were severely corroded. He also explained there is nothing a vehicle owner can do to prevent the corrosion because the modules are placed in the rear bumper—susceptible to moisture penetration and system malfunction. The repair costs was $1664. 11/30/2021 Customer Assistance Center stated by phone call, no action or reimbursement unless a recall is issued.",
        "vin": "1GNKRLKD0DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering gave out my mechanic  put on new pump took it out for a test drive and it still didn’t correct it . Put another pump on same thing . He doesn’t know what to do it is a programming problem the 2013 traverse is having from all the research I have done . From what I read very dangerous problem",
        "vin": "1gnkvgkd8dj"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET TRAVERSE. CONSUMER WRITES IN REGARDS TO DRIVERS SIDE SEAT BELT SAFETY RECALL.   THE CONSUMER REQUESTED THAT THE AIRBAGS AND SAFETY BELT BE REPAIRED UNDER WARRANTY.",
        "vin": "1GNKVLKD1DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2021",
        "dateOfIncident": "07/07/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427385,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2013 Chevy Traverse LT began Very ruff Idling, Battery Charging system, Traction control, Stabilitytrak, and Check engine lights would come on. Smoke coming from engine area.  Had Vehicle towed to dealer. The same day I got it back had the same problem. The truck cuts off while driving down the street almost creating multiple accidents. The first time this happened, I was on the expressway driving about 60 MPH when the traction control light came on, the truck reduced power and completely cut off while driving. An 18 wheeler truck that had slam on breaks to keep from rear ending me. This most recent time this issue came about, While driving on a city street, suddenly the truck did the ruff idol and cut off while driving. I was almost hit by an 18 wheeler again. Thank god these 18 wheeler truck drivers had the skills to make it around me. I am so scared to drive the truck. At this point i want to get rid of it but I'm scared someone else may get my truck and have an even worse outcome.  I have had this issue so many times that I fear this will happen in a even more dangerous spot and this truck will get me killed in a really bad accident. I am Highly recommending that GM or someone look into removing this truck from the roadways of America as this is hazardous to all drivers driving safely down the road. My truck is currently being looked at by the dealer and GM. I am not looking to drive this vehicle ever again.   Some of the issues has been: Code P0107  map sensor Alternator began smoking  Stability Trak dashboard lights come on and engine looses power Traction control light comes on and truck cuts off  battery charging system light comes ruff idol and truck cuts off Under hood Fuse box will short out and cause multiple electrical issues Purge Valve broken Power steering hose went bad Coolant hose connector broke 2 times in the same spot  Please look into this issue with this model, this is very unsafe and dangerous for the road.",
        "vin": "1GNKRGKD2DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving down the road and the seat belt warning came on even though the seat belts were buckled and the car suddenly lost power the traction control light blinked I tried to give the car gas and it acted like it did not want to go I pulled over and cut it off and let it sit for a minute and then cut it back on and it's drove fine",
        "vin": "1GNKRJKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD INTERMITTENTLY HAVE REDUCED ENGINE POWER, TRACTION CONTROL OFF, SERVICE STABILITRAK WARNING. THE CAR WOULD GO INTO LIMP MODE BUT DRIVABLE ENOUGH TO GET SAFELY  OFF THE ROAD. THE LAST TIME IT HAPPENED  ALL THE SAME WARNING LIGHTS CAME ON BUT THE ENGINE COMPLETELY DIED.  THE CAR DRIFTED TO A STOP RIGHT OUT OF A CONSTRUCTION ZONE BUT WE WERE STILL UNABLE TO GET COMPLETELY OFF THE ROAD. WOULD NOT RESTART. COPS CAME BECAUSE WE WERE BLOCKING TRAFFIC UNTIL A TOW TRUCK COULD ARRIVE. THANKFULLY OTHER CARS WERE ALREADY SLOWED DOWN BECAUSE OF THE CONSTRUCTION ZONE. IF THIS HAPPENS IN THE WRONG LOCATION WERE YOU CAN'T GET OFF THE ROAD IT COULD EASILY CAUSE AN ACCIDENT.  THE DEALERSHIP TOLD ME THE FUSE BLOCK AND TERMINAL 51 HAD CORROSION AND NEEDED TO BE REPLACED. HOWEVER, THEY CAN'T GUARANTEE THAT  WAS DEFINITELY THE PROBLEM AND I NO LONGER TRUST THIS VEHICLE SINCE IT WAS AN INTERMITTENT PROBLEM TO BEGIN WITH.",
        "vin": "1GNKVGKD4DJ"
    },
    {
        "components": "AIR BAGS,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE NOTICED AN ALERT ON OUR DASH DISPLAY SAYING SERVICE SIDE DETECTION SYSTEM AND WE ASKED A MECHANIC HE SAID THE BLIND SPOT WARNING AND SIDE AIRBAGS ARE NOT FUNCTIONING BECAUSE OF THIS ALERT AND WE JUST ONLY BOUGHT THIS CAR LESS THAN 5 MONTHS AGO AND STUFF LIKE THIS IS FAILING",
        "vin": "1GNKVLKDXDJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND MY STABILI TRAK LIGHT COMES ON I'M IN THE LEFT LANE GOING 60 MPH MY SPEED DROPS TO 15 MPH I CUT MY FLASHERS ON QUICKLY. LUCKILY THE CAR BEHIND ME SAW SOMETHING WAS HAPPENING AND MOVED OVER AND THE OTHER CARS COULD SEE MY CAR WAS IN DISTRESS. I CUT THE CAR OFF TURNED IT BACK ON AFTER ABOUT 15MINUTES AND IT WAS FINE. DRIVE FOR ABOUT 30 MINUTES AND IT HAPPENED AGAIN DID EVERYTHING AS BEFORE DROVE TO DEALER THEY COULDN'T FIND ANYTHING WRONG WITH THE CAR SO I PAID FOR A SERVICE DIAGNOSTIC FOR NOTHING. THEY DROVE THE CAR SAID IT WAS FINE. I DID A INTERNET SEARCH AND FOUND VIDEOS ON THERE THAT SHOWS HOW YOU CAN TURN OFF OR FIX THE STABILITRAK . ALL I KNOW IS GM NEED TO FIND A SOLUTION BEFORE SOMEONE LOSE THEIR LIFE BEHIND THIS. IT'S HAPPENED TO ME TO MANY TIMES TO COUNT UNTIL I'M AFRAID TO DRIVE MY CAR ON A LONG DISTANCE TRIP, I RENT A CAR AND MAKE SURE IT DOESN'T HAVE STABILITRAK. PLEASE GET HELP FOR THIS SITUATION.",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT HIGH SPEED WHEN \"TRACTION CONTROL LIGHT OFF\" INDICATOR CAME ON, THEN VEHICLE STARTED TO REDUCE SPEED, \"ENGINE LIGHT INDICATOR POWER OFF\". VEHICLE SHUT OFF AND WOULD NOT START.",
        "vin": "1GNKRFED1DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "04/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406249,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REDUCE ENGINE WARNING KEEPS COMING UP. WITH THE ENGINE LIGHT. BUT WHEN SCAN NO CODES SHOW UP ON THE SCAN. IT KEEPS GLITCHING.",
        "vin": "1GNKRFKD0DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED WHILE DRIVING 60 MPH, THE TRACTION CONTROL WARNING LIGHT ILLUMINATED WITH ENGINE POWER REDUCED MESSAGE DISPLAYED ON THE INSTRUMENT PANEL. THE VEHICLE LOSS POWER STEERING ASSIST AND BRAKING FUNCTIONALITY. THE VEHICLE ALSO LOSS ENGINE POWER. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FUSE BOX NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 101,000.",
        "vin": "1GNKRGKD4DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND THE CAR JERKED A FEW TIMES. ALL OF A SUDDEN THE DINGING STARTED AND THE CAR STATED TRACTION CONTROL OFF, STABILITRAK OFF THEN SAID SERVICE TRACTION CONTROL, SERVICE STABILITRAK, LOW ENGINE POWER. THE CHECK ENGINE LIGHT THEN TURNED ON. THE CAR WOULD NOT DRIVE OVER SO MANY MPH IN THE MIDDLE OF TRAFFIC BUT WAS ORIGINALLY DRIVING GOING 55 MPH ON A MAIN ROAD.",
        "vin": "1GNKRFED9DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "07/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11384753,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRACTION CONTROL LIGHT TURNED ON AND CAR SPEED DECREASED FROM 55 TO 20 ON WET FREEWAY, CAR SKID INTO SIDE RAIL. TURNED CAR OFF THEN BACK ON TRACTION CONTROL LIGHT OFF AND ABLE TO DRIVE AWAY. CHEVROLET REPAIR SHOP WAS NOT ABLE TO DETECT PROBLEM SINCE TRACTION CONTROL LIGHT WAS OFF (ACTUAL DATE UNSURE BUT THIS IS 2ND TIME I'M POSTING THIS ON THIS SITE)",
        "vin": "1GNKRFKD8DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH HAS FAILED AND MY VEHICLE DIED WHILE DRIVING.",
        "vin": "1GNKVGKD7DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG WARNING LIGHT SAY \"SERVICE AIRBAG\" AND IT HAS BEEN CHECKED OUT BY THE DEALER, THEY SAY IT MAYBE A SHORT IN A WIRE BUT THEIR COMPUTER IS NOT PICKING IT UP. IT HAS BEEN COMING ON AND OFF SINCE I PURCHASED IT IN DECEMBER 2019 BUT IT USUALLY GO OUT BUT THIS TIME IT HAS STAYED ON AD WILL NOT GO OUT. I AM NOT SURE IF THIS IS SAFE IF I'M INVOLVED IN AN ACCIDENT. EACH TIME I START MY VEHICLE, WHILE I'M DRIVING, PARKED, ETC., THIS WARNING LIGHT NEVER GO OFF",
        "vin": "1GNKRGKD9DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE, 2013 CHEVY TRAVERSE LS ON 5/6/2030, A COUPLE WEEKS AFTER PURCHASING THE VEHICLE I NOTICED THE TRANSMISSION SLIPPING, I BROUGHT IT BACK THREE TIMES TO SUN USED CARS, ALL WITHIN MY WARRANTY PERIOD AND THEY COULD NOT DUPLICATE THE ISSUE, SO NOW THEY WILL NO LONGER FIX THE VEHICLE, AND I AM STILL HAVING ISSUES WITH IT SLIPPING. I THINK IT MAY BE ELECTRICAL BECAUSE WHEN IT WON'T SHIFT AND YOU TURN IT OFF AND BACK ON AGAIN IT WILL SHIFT GEARS. THERE IS ALSO 4 AIR BAG SENSORS THAT ARE SHOWING UP AS AN ISSUE THAT STARTED AFTER THE RELAY SWITCH FOR THE LOCKS WERE FIXED.",
        "vin": "1GNKVFED9DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375476,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURN MY TRUCK ON TO GO TO WORK COME OUT OF WORK TRUCK IS COMPLETELY DEAD THEN WHEN I TRY A FEW TIMES TO START SERVICE AIR BAG POPS UP AND SERVICE CHARGING SYSTEM AS WELL I HAVE PICTURES AND NEED CHEVROLET TO FIX THESE ISSUES CAUSE I HAVE TO BUY BATTERIES EVERY 3 MONTHS IT'S COSTING TO MUCH MONEY",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING PROBLEMS WITH MY 2013 CHEVY TRAVERSE THE TRACTION CONTROL LIGHT/STABILITRAX COMES ON, WHICH MAKES MY CHECK ENGINE LIGHT COME ON, WHICH THEN CAUSES MY ENGINE TO POWER DOWN, I WILL THEN HAVE TO WAIT 2-3 MINUTES AND IT WILL EITHER CRANK UP OR IT WON'T (HAS TO BE TOWED), IT ALSO CAUSES IT TO STALL OUT WHEN TAKING OFF OR COMING TO A STOP. STALLED OUT ON ME WHILE PULLING OUT INTO ONCOMING TRAFFIC THANKFULLY I WASN'T ALL THE WAY OUT IN THE ROAD OR I WOULD HAVE BEEN T-BONED. I HAVE TAKEN THE VEHICLE TO A TWO DIFFERENT CHEVY DEALERS WHICH IT HAD TO BE TOWED TO BOTH WITHIN A MONTH THE FIRST ONE TOLD ME IT WAS JUST THE BATTERY $400 AND 4 DAYS LATER I WAS STRANDED ON THE SIDE OF THE ROAD WITH MY 3 KIDS AGAIN. I HAD TO TOWED TO ANOTHER CHEVY DEALER WHICH THEY REPLACED THE ECM, REPAIRED WIRING THAT HAD BURNT, REPLACED WIRING HARNESS AND FPCM THAT HAD ALSO BURNT AND PERFORMED A MULTIPOINT INSPECTION. I WAS CHARGED $1540.06 ON AUGUST 5, 2020 AND HEAR I AM OCTOBER 26, 2020 AND I AM ONCE AGAIN STRANDED ON THE SIDE OF THE ROAD WITH MY 3 KIDS DEALING WITH THE SAME ISSUES AS BEFORE",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362513,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE RANDOMLY TURNS OFF AND ON THE TRACTION CONTROL SYSTEM.  AT TIMES, THE VEHICLE ALSO GOES INTO \"REDUCED POWER MODE\" WHILE TRAVELING AT HIGHWAY SPEEDS.  WHEN THE REDUCED POWER MODE OCCURS, LOSS OF POWER STEERING AND POWER BRAKES ALSO OCCUR MAKING THE VEHICLE DIFFICULT TO CONTROL UNTIL IT IS STOPPED.  AFTER RESTARTING THE VEHICLE, THE REDUCED POWER MODE AND TRACTION CONTROL/STABILITRAC CONDITIONS GO AWAY UNTIL IT RANDOMLY TRIGGERS AGAIN.  THE REDUCED POWER MODE AND TRACTION CONTROL/STABILITRAC ERRORS MAY OCCUR EITHER WHILE MOVING OR WHILE STATIONARY.  THE EVENTS TRIGGER RANDOM ENGINE CODES, OF WHICH I HAVE SEVERAL ON RECORD, AND THOSE ENGINE CODES TYPICALLY HAVE NOTHING TO DO WITH THE TRACTION CONTROL SYSTEM.  ADDITIONALLY, ON OCCASION, THE FRONT PASSENGER SEAT BELT AND AIRBAG LIGHTS ALERT TO BUCKLE THE BELT ALTHOUGHT THERE IS NO ONE OR NOTHING IN THAT SEAT.  THIS VEHICLE IS EQUIPPED WITH THE SAME IGINITION SWITCH THAT WAS RECALLED IN OTHER GM VEHICLES EXPERIENCING SIMILAR PROBLEMS, HOWEVER, THIS VEHICLE WAS NOT INCLUDED IN RECALL.THE MOST RECENT INCIDENT WAS 10/02/2020, WHEN THE VEHICLE SUDDENLY WENT INTO REDUCE POWER MODE, AND NEARLY CAUSING ME TO MISS A NEGOTIATING A CURVE IN THE ROAD.",
        "vin": "1GNKVJKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON WHILE DRIVING. DROVE FINE. P1682 CODE IGNITION 1 SWITCH RELAY 2. RELAYS IN FUSE BOX LOOKED FINE. CODE WENT AWAY. FOLLOWING MORNING THE LIGHT COMES ON ALONG WITH OTHER WARNINGS INCLUDING TEST ICE TRACTION CONTROL, ABS ETC. AND VEHICLE DRAMATICALLY GOES INTO LIMP MODE REDUCED ENGINE POWER. LUCKILY MY WIFE HAD JUST GOTTEN OFF THE HIGHWAY ONTO A CITY STREET AND COULD SAFELY PULL INTO A PARKING LOT WITH OUR KIDS.TOWED VEHICLE TO SHOP AND SHOP SAYS SHORT/BURNT WIRE LEADING TO FUSE BOX. NEED TO REPLACE ENTIRE FUSE BOX. $1273. BOUGHT VEHICLE BRAND NEW, ONLY 69XXX MILES. STILL WAITING FOR REPAIR TO COMPLETE. SEVERAL DAYS FOR PART TO DELIVER.",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR ON THE FREEWAY WITH MY KIDS DRIVING NORMAL WHEN THE STABILITRAK HAPPENED, AND THE CAR WENT FROM 60 MILES PER HOUR TO 20 MILE PER HOUR ON THE FREEWAY ALMOST CAUSING A BAD ACCIDENT. WE GOT VERY SCARED. I BEEN LOOKING UP ONLINE ON THIS ISSUE AND IT SEEMS THIS IS A ISSUE WITH THE GM CARS.",
        "vin": "1GNKVFED6DJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS A 2013 CHEVY TRAVERSE LS WITH 98,804 MILES ON IT. WHEN DRIVING AT HIGHWAY SPEED THE VEHICLE SERVICE ENGINE LIGHT STARTED FLASHING AND A WARNING ON THE DASH CAME UP OF SERVICE TRACTION CONTROL,  TRACTION CONTROL SYSTEM OFF, REDUCED ENGINE POWER . THE VEHICLE REDUCED SPEED FROM 60 MPH TO 25 MPH. THE VEHICLE STARTED SHAKING AND SOUNDED LIKE IT WAS MISFIRING.  WHEN I BROUGHT THE VEHICLE TO A PARKING LOT IT WOULD LURCH FORWARD WHEN I LET OFF THE BRAKE PEDAL. THERE WERE NO WARNING SIGNS OF ANY MECHANICAL ISSUES OR TRANSMISSION ISSUES PRIOR TO THIS. I SHUT OFF THE VEHICLE LET IT SIT FOR A MOMENT AND RESTARTED IT. VEHICLE STARTED FINE NO MISFIRING OR LURCHING WHEN I LET OFF THE BRAKE. AFTER RESETTING THE FAULTS THE VEHICLE DROVE LIKE NORMAL. APPEARS TO BE AN ELECTRONIC ISSUE. POSSIBLY THE FUSE BLOCK. I HAVE BEEN A MECHANIC FOR 25 YEARS THIS WAS MY FIRST TIME EVER SEEING THIS ISSUE.",
        "vin": "1GNKRFED9DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353694,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE ENGINE FAILED, WHILE DRIVING AT VARIOUS SPEEDS WITH THE ENGINE POWER REDUCED WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING. ADDITIONALLY, THE ENGINE FAILURE ALSO OCCURRED WHILE THE VEHICLE WAS AT A COMPLETE STOP. THE CONTACT PULLED OVER TO THE SHOULDER AFTER THE FAILURE AND RESTARTED THE VEHICLE. THE VEHICLE WAS TAKEN TO RED WING CHEVROLET BUICK CADILLAC (2500 US 6, RED WING, MN 55066, (651) 388-4777) TO BE TO DIAGNOSED. THE CAUSE OF THE FAILURE WAS LOCATED AT THE ENGINE'S FUSE BOX WIRING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED.  THE APPROXIMATE FAILURE MILEAGE WAS 72,000. INVALID VIN.",
        "vin": "1GNKRGKB1DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STREERING HARD AT LOW RMP. HARD TO STEER",
        "vin": "1GNKRLKD9DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AND THE TRANSMISSION OVERHEATS ON LONG CAR RIDES EVEN THOUGH THE FLUIDS ARE ALL FINE  THE TRACTION CONTROL CODE COMES ON AND I LOSE POWER TO THE VEHICLE AFTER ABOUT 20 MINUTES",
        "vin": "1GNKVGKD1DJ"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN HAVING SERIOUS ISSUES WITH THE POWER ON TURNING MY SUV ON SOUNDS LIKE IT'S SPARKING HARD UNDER HOOD AND ALSO WHEN THE TRUCK RUNS IT JERKS AND WHEN I GO TO START IT UP IT TELLS ME SOMETHING ABOUT THE AIR BAGS THE ALTERNATOR READS 14.0 VOLTS THEN DROPS TO 12.5 VOLTS SOMETIMES IT STAYS THERE NEW BATTERY HAS BEEN PUT IN A GOLD TOP AND STILL PROBLEMS ARE NOT GOING AWAY THIS SHOULD BE A RECALL CAUSE I DON'T WANT TO HAVE TO WORRY ABOUT IF IT COULD CATCH ON FIRE OR WORST",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STARTER ON THIS TRUCK IS FAULTY AND SERVICE FOR AIR BAG KEEPS COMING UP AT BEGINNING OF START IT'S HARD TO START SOUNDS LIKE IT NEEDS JUMP AFTER WHILE IT WILL KILL MY BATTERY DEAD FEW MINUTES LATER IT WILL START",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11332004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING DOWN THE INTERSTATE  AT NIGHT, AND ALL OF SUDDEN MY LIGHTS AND RADIO WENT COMPLETELY OUT AND THEN BACK ON.  THE ALTERNATOR DROP PAST THE 14 V.  WE HAVE HAD THE BATTERY AND THE ALTERNATOR CHECK AND THEY ARE SHOWING WORKING IN GOOD CONDITION.  SOMETIMES THE ALTERNATOR WILL DROP DOWN BELOW THE 14 V, AND SOMETIMES IS STAYS ABOVE THE 14 V.",
        "vin": "1GNKRFKD8DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE WILL GO INTO REDUCED POWER, TURN OFF TRACTION CONTROL, TURN OFF STABILITY CONTROL. IT HAS ALSO TURNED OFF WHILE DRIVING. I LOOKED ONLINE AND SEE THIS HAS BEEN AN ISSUE FOR VEHICLES FROM 2009-2015, WITH NO KNOWN FOR SURE FIXES. THIS IS OBVIOUSLY A DANGEROUS SITUATION TO BE IN IF YOUR VEHICLE STALLS ON THE HIGHWAY AT HIGH SPEEDS. I DONT HAVE MONEY TO KEEP FIXING THINGS THAT MAY OR MAY NOT BE THE PROBLEM.",
        "vin": "1GNKRGKD0DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST FEW MONTHS MY 2013 CHEV TRAVERSE HAS HAD THE REDUCED ENGINE POWER PROBLEM EXPERIENCED BY THOUSANDS OF OTHER OWNERS. IT HAS HAPPENED GOING 70 MPH ON THE HIGHWAY AND 30 MPH ON CITY STREETS. USUALLY I PULL OVER TO THE SIDE OF THE ROAD. TURN OFF THE ENGINE FOR A MINUTE THEN THE CAR WILL START AND OPERATE AS NORMAL FOR A FEW DAYS OR A FEW WEEKS. IN THE PAST MONTH I HAVE BEEN IN FEAR FOR MY LIFE. I WAS DRIVING 70 MPH ON THE HIGHWAY AND MY ENGINE TOTALLY SHUT DOWN. I HAD TO AVOID A TRACTOR TRAILER IN THE RIGHT LANE AND COAST OVER TO THE SIDE OF THE ROAD WITH NO POWER STEERING. THE CAR WOULD NOT RESTART. I HAD THE CAR TOWED TO MY MECHANIC. AFTER THE CAR SAT IDLE FOR A DAY IT STARTED UP. CODES WERE CLEARED AND IT RAN NORMALLY AGAIN FOR WEEKS. LAST WEEK WHILE TRAVELING AT 35 MPH ON A CITY STREET THE ENGINE SHUT OFF. I WAS ABLE TO GET THE CAR TO THE SIDE OF THE ROAD WITH NO POWER STEERING, BUT STILL IMPACTING THE FLOW OF TRAFFIC. A LOCAL POLICE OFFICER HELPED ME PUSH THE CAR FURTHER OFF THE ROAD ONTO THE SIDEWALK. IT WOULD NOT RESTART. I HAD IT TOWED TO MY MECHANIC. 24 HOURS LATER THE CAR STARTED OK. CODES WERE CLEARED AND IT ONCE AGAIN COULD OPERATE NORMALLY. MY MECHANIC CONSULTED TO A GM MECHANIC AND THEY AGREED THE PROBLEM IS THE IGNITION SWITCH. MY TRAVERSE HAS NOT HAD A RECALL FOR IGNITION SWITCH REPLACEMENT.  I AM AWARE THAT GM IGNITION SWITCH PROBLEMS HAVE KILLED OVER (100) GM VEHICLE OWNERS. MILLIONS OF GM CARS HAVE BEEN RECALLED AND THIS PROBLEM HAS BEEN FIXED BY REPLACING THE IGNITION SWITCH, IGNITION LOCK CYLINDER AND IGNITION KEY. MANY MORE GM VEHICLES LIKE MY 2013 CHEV TRAVERSE SHOULD BE RECALLED AND FIXED OR MORE PEOPLE WILL DIE. IN FACT MY GUESS IS HUNDREDS OF ADDITIONAL DRIVERS AND PASSENGERS HAVE DIED AND THE PROBLEM IGNITION SWITCH WAS NOT BLAMED FOR THESE ADDITIONAL DEATHS.",
        "vin": "1GNKVFKD4DJ"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE CHECK ENGINE WARNING LIGHT AND TRACTION CONTROL WARNING LIGHT ILLUMINATED AND THE VEHICLE SPEED WAS REDUCED FROM 40 TO 20 MPH. AFTER TURNING THE ENGINE OFF AND BACK ON THE VEHICLE OPERATE AS INTENDED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER, APPLE CHEVROLET LOCATED AT (8585 WEST 159TH ST, TENLEY PARK, IL.) WHERE THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE AND NO REPAIRS WERE PERFORMED. THE  FAILURES RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 89,000.*DT",
        "vin": "1GNKRGKD6DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 TRAVERSE WITH THIS SAME PROBLEM IT HAS DONE THIS A FEW TIMES NOW WITHOUT ANY WARNING AT ALL, THE LATEST WAS TODAY WHEN I WAS PULLING OUT OF MY LOCAL GAS STATION IN TO ON COMING TRAFFIC THE STEERING JUST QUIT HAD A HELL OF A TIME TRYING TO KEEP MY CAR INTO MY LANE. MY SUV IS IN PERFECT CONDITION I TAKE GOOD CARE OF IT. HAS ANYONE HEARD OF ANY POSSIBLE RECALL ON THIS PROBLEM? I HOPE CHEVY DOES SOMETHING SOON BEFORE SOMEONE GETS HURT. THIS SUV IS NOT SAFE TO DRIVE WITH THIS TOTALLY UNEXPECTED STEERING PROBLEM WITH NO WARNING AT ALL.    JIM",
        "vin": "1GNKVLKD9DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307702,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MY CHECK ENGINE LIGHT CAME ON. ALSO TRACTION LIGHT CAME ON, LOSS OF POWER CAME ON, AND STABILITY TRACTION TURNED OFF. MY SPEED REDUCED FROM 40 TO 25. I SHUT THE CAR OFF AND NOW ONLY THE CHECK ENGINE LIGHT IS ON.",
        "vin": "1GNKRFKDXDJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I EXPERIENCED  'TRACTION CONTROL OFF'; 'SERVICE STABILITRAC'; 'SERVICE TRACTION CONTROL' AND THEN THE CAR WENT INTO 'REDUCED ENGINE POWER. I WAS IN TRAFFIC AND HAD TO QUICKLY MAKE AN UNSAFE TURN TO AVOID BEING REAR-ENDED BY THE VEHICLE BEHIND ME. THIS HAS HAPPENED TWICE NOW.",
        "vin": "1GNKVJKD1DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE INTERSTATE GOING 75 MPH WHEN THE TRACTION CONTROL WARNING CAME ON AND ENGINE SHUT DOWN",
        "vin": "1GNKRFKDXDJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS A 2ND AND 3RD SHIFT SLIP EVERYONE AND THE BUT SOMETIMES IT DOES IT SO BAD PULLING IN TO TRAFFIC CAN BE DANGEROUS YOU THINK ITS GOING AND GETTING UP TO SPEED BUT THEN IT TRY'S TO SHIFT AND NOPE HAVE TO LET ALL THE WAY OUT OF THE GAS TO GO IN TO GEAR THEN YOUR GOOD IF YOU DONT GET HIT FIRST.",
        "vin": "1GNKVFKD4DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE TURNPIKE DURING RUSH HOUR NEAR PHILADELPHIA  I GOT A VEHICLE ALARM FOR REDUCED POWER. THE VEHICLE THEN QUICKLY SLOWED DOWN FROM 50MPH TO 10MPH NEARLY CAUSING AN ACCIDENT. THEN A ALARM FOR STABILITY TRAC CONTROL. PULLED CODES P089 AND P228C. THIS IS VERY DANGEROUS AND NEEDS TO BE ADDRESSED ASAP.",
        "vin": "1GNKVLKDXDJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279096,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE FREEWAY IN CA IN TRAFFIC AND EXPERIENCED THIS FRIGHTENED REDUCED SPEED ERROR, 75 MPH TO LESS THAN 25 MPH AND HAD TO PULL OVER. I HAVE LOOKED AND SEEN THAT THIS IS A COMMON PROBLEM AND THERE IS NO RECALL. AFTER LEAVING THE CAR OFF FOR A DAY, THE CHECK ENGINE LIGHT IS NOW OFF FOR A DIAGNOSTIC. I AM AFRAID FOR MY LIFE AND CHILDREN LIVES TO TRAVEL AND NOT KNOW WHAT'S GOING TO HAPPEN WHEN I TAKE THEM TO SCHOOL.    THIS FIRST HAPPENED IN 2018. I TOOK THE VEHICLE TO THE DEALERSHIP AND THEY STATED THAT IT WAS THE IGNITION SWITCH AND REPLACED IT BUT STATED THEY COULDN'T DUPLICATE THE ISSUE I EXPLAINED TO THEM. I LEASED A NEW VEHICLE DUE TO SAFETY CONCERN AND TRIED TO GET THEM TO FIX THE ISSUE BY CONTACTING GM CUSTOMER SERVICE AFTER SEEING THIS IS A KNOWN ISSUE WITH THE LAW VEHICLES. THEY DID AN EXTENDED WARRANTY FOR THE YEARS 2010-2012 VEHICLES. MINE IS A 2013 SO IT IS NOT UNDER THE WARRANTY. WHEN I TURNED IN MY YEAR LEASE VEHICLE I BEGAN DRIVING THIS VEHICLE AGAIN AND HAVE EXPERIENCED THE SAME ISSUE BUT NOW THE WARRANTY HAS EXPIRED ON MY VEHICLE FOR IT BEING 5 YEARS BUT IT WAS NOT EXPIRED WHEN I FIRST TOOK IT TO BE FIXED FOR THE ISSUE.",
        "vin": "1GNKRFED3DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE AIR CONDITIONING WAS NOT OPERATING PROPERLY. THE VEHICLE WAS TAKEN TO BEATY CHEVROLET (9615 PARKSIDE DR, KNOXVILLE, TN 37922, (865) 233-9063) WHERE IT WAS DIAGNOSED THAT THE MOTOR MOUNTS FRACTURED DUE TO EXCESSIVE CORROSION. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 108,511. *PM  CONSUMER STATED HIGH AND LOW SIDELINES AND EXCHANGER/CONDENSOR REPLACED DUE TO CORROSION.*JB",
        "vin": "1GNKRGKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND ALL OF MY DASH GAUGES STARTED TO FLUCTUATE, MY TRACTION CONTROL LIGHT CAME ON, I STARTED TO LOOSE SPEED WHEN I PRESSED ON THE ACCELERATOR, WHEN I FINALLY MADE IT HOME MY BACK UP CAMERA WOULD NOT COME ON AND I HEARD CLICKING COMING FROM THE FUSE BOX.",
        "vin": "1GNKRGKD0DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "01/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT COMES ON WHEN THE DRIVERS SEAT IS MOVED BACK AND FORTH.  TO GET THE LIGHT TO GO BACK OFF I HAVE TO WIGGLE THE WIRING HARNESS AND CONNECTOR UNDER THE DRIVERS SEAT.",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE WOULD SUDDENLY STALL WHILE CHANGING GEARS. THE VEHICLE WAS TAKEN TO GRAFE CHEVROLET GMC (407 FAIRWINDS ST, HALLETTSVILLE, TX) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE DEALER FLUSHED THE TRANSMISSION AND REPLACED THE TRANSMISSION FILTER, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1GNKRJKD7DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING USING THE A/C DURING RAIN (LIGHT TO MEDIUM DOWNFALL) WHEN VEHICLE WAS IN PARK AND THE KEY WOULD NOT MOVE TO TURN THE VEHICLE GINSENG OFF. TURNING THE KEY WAS WAS REPEATED MULTIPLE TIMES WITH NO SUCCESS. TO TURN OFF ENGINE THE POSITIVE CABLE HAD TO BE REMOVED FROM THE VEHICLE. ONCE THIS WAS DONE ALL FUSES WHERE CHECKED TO ENSURE NONE WHERE DAMAGED OR SHORTING. THIS IS WHEN IT WAS REALIZED THAT THE A/C VENTS WHERE LOCATED JUST ABOVE THE MAIN FUSE BOX AND THE CONDENSATION FLOODED THE BOX WITH WATER CAUSING THE IGNITION SAFETY CIRCUITS TO SHORT AND NOT ALLOW THE VEHICLE TO TURN OFF.THIS WAS ALSO MADE CLEAR ONLINE WHEN DOING A SEARCH TO TRY TO SHUT THE VEHICLE DOWN WITH OUT DAMAGING IT. THIS OCCURRED THREE TIMES AND THE MANUFACTURER DOES NOT HAVE A SOLUTION BUT STATED THEY ARE AWARE OF THE ISSUE.  THIS IS A CONCERN DUE TO THE TURNING OFF OF THE KEY BUT THE ENGINE IS STILL ON AND THE DRIVE SELECTOR CAN STILL BE MOVED INTO GEAR. THIS COULD ALSO CAUSE SHORTS TO ANY OF THE COMPONENTS IN THE MAIN FUSE PANEL OR ELECTRICAL SYSTEMS.",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TOLD WE HAD A FRONT COVER LEAK.  FOUND OUT THE SEALANT USED TO SEAL THE FRONT COVER TO THE ENGINE BLOCK BREAKS DOWN PREMATURELY AND CAUSES AN OIL LEAK.  WITHOUT REMOVING THE ENGINE AND REDOING THE SEAL, THE ENGINE COULD FAIL.  IT SEEMS TO BE A VERY COMMON AND KNOWN ISSUE CAUSED BY A POOR DESIGN.  WE ARE NOW PAYING $2,700.00 TO HAVE OUR ENGINE COVER \"RE-CAULKED\" TO AVOID AN ENGINE FAILURE.",
        "vin": "1GNKVLKD8DJ"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  2013 CHEVY TRAVERSE LTZ, 109K MILES, I'M ON MY 3RD POWER STEERING PUMP. BOUGHT USED IN JULY 2018, REPLACED THE PUMP BACK IN MAY 2019, I PROVIDED THE PUMP AND TOOK IT TO THE DEALERSHIP WHERE I BOUGHT IT, THEY REPLACED IT AND CHARGED ME $600 FOR LABOR AND THE NEXT DAY IT OUT OUT AGAIN (TURNS OUT IT WAS ACTUALLY A BAD PUMP, BRAND NEW BUT BAD ) SO THE DEALERSHIP SAID THEY'D SWAP IT OUT FOR THE COST OF LABOR, I DIDN'T HAVE ANOTHER $600 TO THROW AWAY SO I REPLACED IT WITH SOME HELP AND IT WORKED PERFECTLY, WE USED THE DEXT. IV FLUID AS SUGGESTED AND IT'S BEEN RUNNING GREAT, NO MORE WHINE AND STEERS LIKE A DREAM. WELL IT'S NOW JULY 2019 AND THE PUMP IS OUT AGAIN. NO VISIBLE LEAKS AND THE FLUID LEVEL IS GOOD AND FLUID STILL RED. IF I GET RID OF THIS I'M GOING BACK TO FORD FOR A VEHICLE, THIS IS MY FIRST CHEVROLET AND ALSO MY LAST. IF THE PUMP WENT OUT ON THE HIGHWAY THAT WOULD BE INCREDIBLY DANGEROUS. I DRIVE ALL HIGHWAY AND IT'S MY DAILY DRIVER. I CAN STILL DRIVE THE VEHICLE, BUT WHEN THE RPMS ARE LOW IT'S LIKE MANUAL STEERING, FORGET GOING THROUGH A DRIVE THROUGH OR PARKING UP FRONT ANYWHERE!",
        "vin": "1GNKVLKD9DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS AILLING UP AND DOWN. ITS USE EXCESSIVE GAS AND WHEN IT AIL UP AND DOWN THE LIGHTS GET DEM AND BACK TO NORMAL. IT STALLS IF I STAY IN PARK A PERIOD OF TIME AND EVEN WHEN IM WAITING IN THE DRIVE THROUGH FOR FOOD. THE AMPLIFIER JUST COMPLETELY STOP WORKING FOR SOME REASON. I THINK IT'S AN ELECTRICAL REASON OR THE ECM FUEL GAGE NEED TO BE RESET. I KNOW THIS HAS BEEN ON RECALL WITH OTHER VIHICLES LIKE MINE.",
        "vin": "1GNKRLKD8DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRAVERSE HAS HAD THIS PROBLEM MAINLY ON THE HIGHWAY BUT IT HAS ALSO HAPPENED ON OUR GRAVEL ROAD GOING 30 MPH. THE TRAVERSE WILL ALL OF A SUDDEN DISPLAY \"ENGINE POWER IS REDUCED, IT WILL SAY SERVICE TRACTION CONTROL, SERVICE STABILITRAK, TRACTION CONTROL OFF.\" DURING ONE OF THE TIMES, IT HAPPENED THE STEERING COLUMN ALSO LOCKED UP. THE ENGINE SHAKES ENOUGH THAT IT MAKES THE MUFFLER SHAKE WHEN THIS HAPPENS. THE DEALERSHIP CLAIMED THEY FOUND A MEMO FROM GM ON HOW TO SOLVE THE PROBLEM. WE JUST SPENT $690 TO GET A NEW FUSE BLOCK AND TERMINAL INSTALLED. SUPPOSEDLY THERE HAD BEEN WATER DAMAGE/CORROSION. OUR TRAVERSE HAS NEVER BEEN SUBMERGED IN WATER. THIS PROBLEM IS VERY DANGEROUS AND CHEVROLET NEEDS TO BE HELD RESPONSIBLE. HAVING OUR VEHICLE ALL OF A SUDDEN REDUCE POWER HAS LEAD TO SEVERAL ALMOST ACCIDENTS, ESPECIALLY WHEN THE STEERING ALSO LOCKED.     THIS PROBLEM IS VERY SIMILAR TO A PROBLEM DESCRIBED IN RECALL 14515 WHICH DID INCLUDE 2009-2014 TRAVERSES. ACCORDING TO CHEVROLET MY VIN IS NOT PART OF THAT RECALL. I THINK THIS ISSUE IS SIMILAR TO THE RECALL BUT DIFFERENT.",
        "vin": "1GNKVLKD6DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE BUYING THIS CAR IN 2017 IT'S BEEN NOTHING BUT ISSUES. I HAVE A 2013 CHEVY TRAVERSE. WHILE DRIVING OFTEN AT HIGHWAY SPEEDS THE CAR WILL LOSE ENGINE POWER AND THE TRACTION CONTROL SHUTS OFF AND THE CAR STARTS SHAKING. I THEN PULL OVER AND WAIT A FEW MINS AND IT STARTS BACK UP. BEEN TAKEN TO DEALERSHIP SEVERAL TIMES TO BE TOLD IT MIGHT BE THE FUSE BOX BUT IT'S NOT COVERED UNDER WARRANTY SO ITS GONNA COST $600. ALL OVER THE CAR SITES ONLINE PEOPLE REPORTING THIS SAME PROBLEM WITH FUSE BOXES FROM 2009-2014 TRAVERSE.  WHY HAS THIS NOT BEEN RECALLED????? I HAVE 3 SMALL KIDS AND I AM TERRIFIED TO PUT THEM IN THE CAR AND IT'S NOT WORTH IT FINANCIALLY TO TRADE IT NOR AN OPTION AT THIS POINT. THIS HAPPENS AT RANDOM.  TODAY IT WOULDN'T START BACK UP AND HAD TO BE TOWED. WAS DOING 70MPH ON MY WAY TO WORK IN RUSH HOUR TRAFFIC!!!!",
        "vin": "1GNKVJKD4DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218418,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP GETTING ON FREEWAY WITH HEAVY TRAFFIC WENT TO PUSH GAS PEDAL VEHICLE IMMEDIATELY STARTED SHAKING AND CHECK ENGINE LIGHT WENT ON AND WARNINGS SAYING \"SERVICE STABILITRAK\" \"ENGINE POWER DECREASED\" \" TRACTION CONTROL OFF\" IT ONLY LET ME GO UP TO 20 MILES AS HOUR AS IT WAS STILL SHAKING I PULLED OVER AND TURNED IT OFF. THE WARNINGS WEREN'T COMING UP NO MORE AND VEHICLE DRIVED NORMAL BUT CHECK ENGINE LIGHT  STAYED ON.",
        "vin": "1GNKRGKD0DJ"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING THE TRAVERSE ON THE FREEWAY AND IT CUTS OUT, THE STEERING WHEEL LOCKS, MAKING IT HARD TO STEER. ENDANGERING EVERYONE IN THE VEHICLE. OTHER CARS ARE COMING AT HIGH SPEED AND THIS ONE DOES WITH NO WARNING. OTHER TIMES IT PROTECTS A REACTION CONTROL CHECK STABILISE MESSAGE AND REDUCES ENGINE POWER, GREATLY REDUCING SPEED YOU ARE GOING.",
        "vin": "1GNKRGKDXDJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A BUSY HIGHWAY AND WITHOUT WARNING MY 2013  TRAVERSE STARTED TO LOOSE POWER. THIS WAS VERY DANGEROUS AND QUITE SCARY AS I ALMOST GOT REAR ENDED BY CARS BEHIND ME AS MY VEHICLE ALMOST SLOWED DOWN TO A COMPLETE STOP ON THE HIGHWAY.  THE 'TRACTION CONTROL IS OFF' LLIGHT CAME ON - FOLLOWED BY THE 'STABILITRAK', 'LOSS OF ENGINE POWER' AND 'SERVICE TRACTION CONTROL'.  I MADE IT TO AN HWY EXIT  AT ABOUT 5 MPH. THANKFULLY, I WAS ABLE TO FIND A SAFE PLACE ON THE SIDE OF THE ROAD BEFORE MY CAR ENGINE STARTED TO SHAKE AND THEN CUT OFF. I HAD TO GET A TOW TO THE CHEVY DEALERSHIP SERVICE. THIS SUVHAS HAD A NUMBER OF ISSUES FROM THE TIME I PURCHASED THE VEHICLE. THE FIRST ISSUE IS LOSS OF POWER DURING ACCELERATION, WHICH THE DEALERSHIP HAS CONTINUED TO DISMISS. I HAVE ALSO HAD ISSUES WITH THE AIR BAGS, TRANSMISSION, SEATBELTS AND POWER STEERING. THE POWER STEERING AND TRANSMISSION WERE RECENTLY 'REPAIRED' THIS PAST YEAR, BUT I HAVE CONTINUED TO HAVE ISSUES WITH BOTH OF THOSE SYSTEMS.",
        "vin": "1GNKVFKD1DJ"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2019",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BEEN DOING THIS SINCE IT WAS PURCHASED. THE ACCELERATION AND DECELERATION ARE JERKY SOMETIMES. IT FEELS OCCASIONALLY LIKE I HAVE BEEN REAR-ENDED. I FEEL LIKE IT TRIES TO ACCELERATE WHILE I AM APPLYING THE BREAKS. WHEN I AM TRYING TO APPLY THE GAS SOMETIMES IT HAS NO POWER AND I HAVE TO PUSH THE PEDAL DOWN HARDER WHICH LEADS IT TO JERK FORWARD.  HARD GEAR SHIFTING LOTS OF SHAKING AND LURCHING. IT IS EXACTLY LIKE WHAT THE CLASS ACTION LAWSUIT AGAINST GM DESCRIBES BUT MY VEHICLE ISN'T ONE INVOLVED IN THAT YET, BUT I BELIEVE IT SHOULD BE.",
        "vin": "1GNKRJKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SERVICE AIRBAG WARNING COMES UP ON DISPLAY.  SOMETIMES IT STAYS ON, SOMETIMES IT GOES OFF AND ON LIKE WHEN I HIT A BUMP.  I HAVE HAD IT SERVICED AND FIXED AND THEY SAY THE CLIP UNDER THE PASSENGER SEAT WAS DISCONNECTED.  A FEW MONTHS LATER I WAS VACUUMING MY CAR OUT AND AS SOON AS I WAS DONE, THE LIGHT CAME ON AGAIN.  I HAD IT FIXED AGAIN.  LIKE LITERALLY TOOK 2 SECONDS FOR THEM TO CLIP IT TOGETHER AND IT COST OVER $70.  IT CAME DISCONNECTED AGAIN, HAD IT FIXED, NOW THE WARNING LIGHT IS ON AGAIN, AND I AM ANNOYED!  CAN WE GET A RECALL??  I'M SICK OF THIS!  IT HAS HAPPENED WHEN THE CAR IS STATIONARY AND MOVING.  I SHOULD BE ABLE TO VACUUM MY VEHICLE OR GRAB A PIECE OF MAIL THAT HAS SLID UNDER THE SEAT WITHOUT HAVING THE CLIP COMING DISCONNECTED!",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS ACCELLERATED FROM A STILL POSITION, AND ACCELERATED TO GET UP TO SPEED,  VEHICLE ENGINE HAS A CONSTANT JERKING THAT VIBRATES THE ENTIRE VEHICLE AND ONCE UP TO ROAD OR HIGHWAY SPEED, AND MAINTAINS A CONSTANT MPH, THE SHAKING STOPS.  WHEN ACCELERATING AGAIN,VEHICLE DOES THE SAME THING; JERKING / SHAKING UNTIL LETTING OFF THE ACCELERATOR AND LEVELING OUT AT A CERTAIN MPH..    AIR CONDITIONER IS CONSTANTLY 'GOING OUT' DURING THE SUMMER, BLOWING ONLY HOT AIR, THEN AFTER VEHICLE IS TURNED OFF, AND SOME TIME GOES BY, SOMETHING IN THE ELECTRICAL/COMPUTER  SYSTEM MUST RESET ITSELF BECAUSE THE A/C WILL START WORKING FINE ONCE VEHICLE IS TURNED BACK IN.",
        "vin": "1GNKRJKD9DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY \"CHECK AIR BAG\" LIGHT HAS GONE ON INTERMITTENTLY WHILE DRIVING FOR OVER A YEAR. IT IS NOW PERMANENTLY ILLUMINATED, AND HAS BEEN FOR THE PAST 4-5 MONTHS.  MY VEHICLE IS NOT COVERED BY THE RECALL ON THIS ISSUE. I AM NERVOUS THAT THE AIRBAG WILL NOT WORK IF I AM IN AN ACCIDENT.",
        "vin": "1GNKRGKD2DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVY TRAVERSE W/ 126K MILES: WHILE DRIVING 65MPH ON THE FREEWAY THE ENTIRE CAR SHUT OFF. EVERYTHING WENT BLACK, AND I COULDN'T DEPRESS BRAKES, OR TURN THE STEERING WHEEL TO MOVE TO THE SHOULDER. WITHIN 20 SEC THE CAR STARTED BACK UP AND WENT INTO LIMP MODE AND I WAS ABLE TO MAKE IT TO A GAS STATION. CHECK ENGINE LIGHT, TRACTION CONTROL OFF, PARK ASSIST OFF, ENGINE POWER REDUCED AND SERVICE STABILITRAK ALL CAME ON. WHEN I DISCONNECTED THE BATTERY, OR PULLED FUSES TO RESET ECM, THE CAR WOULD START JUST FINE. THOUGH IT WOULD HAPPEN AGAIN WITHIN ANOTHER 20 MILE OR SOMETIMES IT WOULD BE A DAY OR TWO, BUT WOULD REPLICATE THE PROBLEM. I WAS TOLD BY TWO CHEVY DEALERSHIPS THAT THERE WAS NOTHING WRONG, BUT APPARENTLY THER IS SOMETHING WRONG AND IT NEEDS TO BE RECALLED AND ADDRESS BEFORE DEATHS OCCUR BECAUSE OF THE ISSUE. THERE ARE MANY POSTS AND FORUMS ABOUT THIS SITUATION FROM OTHER TRAVERSE OWNERS OF THE SAME YEAR.",
        "vin": "1GNKVGKD9DJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/10/2019",
        "dateOfIncident": "12/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- ON THE PASSENGER SIDE OF MY SUV THE SEAT BELT DOES NOT STAY IN SOMETIMES AFTER IT CLICKS. SOME TIMES IT DOES NOT WORK AT ALL.",
        "vin": "1GNKRFKD1DJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE INTERSTATE GOING 70MPH AND IT FELT LIKE MY CHEVY TRAVERSE LOST POWER WITH NO OTHER SYMPTOMS OR SOUNDS PRIOR TO THIS HAPPENING. ALL MAINTENANCE WAS UP TO DATE. THE CAR WAS OFFICIALLY IN \"LIMP MODE\" WITH ONLY BEING ABLE TO TRAVEL AT 20-30 MPH ON A BUSY INTERSTATE. REDUCED POWER, SERVICE STABILITRAK, SERVICE TRACTION CONTROL AND CHECK ENGINE LIGHTS ALL CAME ON FOR THE FIRST TIME. AT THE SERVICE DEPARTMENT IN THE DEALERSHIP, IT WAS DIAGNOSED AS A FAULTY HIGH PRESSURE FUEL PUMP. HIGH PRESSURE FUEL PUMP, FUEL RAIL, FRONT TIMING COVER AND ENGINE OIL PAN GASKET WERE ALL THE RECOMMENDED PARTS FOR REPLACEMENT. ALL OF WHICH WAS RELATED TO THE FAULTY FUEL PUMP.",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING APPROXIMATELY 45 MPH, THE ENGINE SUDDENLY STALLED. THE VEHICLE WAS TOWED TO JIM BROWNE CHEVROLET BUICK GMC DADE CITY (10741 US 301, DADE CITY, FL), BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 123,000.",
        "vin": "1GNKRJKD4DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "#1 = TRAVELING ON HIGHWAY APPROX. 65 CAR SHUT DOWN NO POWER , COASTED TO SIDE OF HIGHWAY , RESTARTED 10 MIN. LATER. #2 = SHUT OFF CAR IN DRIVEWAY IT KEPT RUNNING. #3 = ALL WARNING LIGHT CAME ON AND RADIO WOULDN'T WORK. AFRAID TO PUT GRAND KIDS IN CAR.",
        "vin": "1GNKRFKD9DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN A VERY BUSY 4 LANE ROAD AND CAR STARTED SINGING THAT SOMETHING WAS WRONG WITH TRACTION CONTROL. CAR WOULDN'T GO AND COULD BARELY MOVE WHEEL TO GET TO TURN LANE. NO PRIOR WARNINGS OR ISSUES WITH MOTOR. WAS TOLD BY DEALERSHIP THAT TIMING CHAIN WENT BAD AND WOULD HAVE TO HAVE WHOLE MOTOR REPLACED. A QUICK GOOGLE SEARCH SHOW MANY OTHERS WITH THIS ISSUE, AND INCLUDING TRANSMISSION AT 100,000 MILES.",
        "vin": "1GNKVGKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LOSES POWER AS YOU DRIVE A NORMAL SPEED IT JUST STOPS IT FLASHES ENGINE POWER IS REDUCED , SERVICE TRACTION CONTROL, SERVICE STABILTRAK.  I DON'T KNOW WHAT IT MEAN BUT WHEN YOU GET IT TO THE DEALER THESE CODES DON'T COME UP THEY CAN'T FIND THESE THINGS WRONG. IN THE MEAN TIME I'VE BEEN NEARLY REAR ENDED ON THE HIGHWAY CAUSES MY CAR JUST STOPS AND I HAVE TO BE TOWED CAUSE SOMETIMES SHE STARTS AGAIN SOMETIMES SHE DON'T. I'M AFRAID TO DRIVE IT BECAUSE I DON'T KNOW WHAT TO EXPECT THAT'S MY TRANSPORTATION TO AND FROM THE DOCTOR BEING DISABLED. PLEASE LOOK INTO THIS I'M SURE I'M NOT THE FIRST COMPLAINT. CHEVY NEEDS TO RECALL BEFORE SOMEONE DIES BECAUSE YOU'RE TRAVELING AT A SPEED OF 50-55 MILES PER HOUR AND YOUR CAR JUST STOP THE CARS BEHIND YOU WILL REAR END YOU AND END UP IN YOUR BACK SEAT GAS TANK EXPLODES. YOUR FAMILY IN THE CAR. I HOPE YOU ALL SEE THE PICTURE. THIS HAPPENED 4 TIMES ON THE HIGHWAY  AND A FEW TIMES ON THE LOCAL STREETS.",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVY TRAVERSE W/ 120K MILES: WHILE DRIVING 75MPH ON THE FREEWAY THE ENTIRE CAR SHUT OFF. EVERYTHING WENT BLACK, AND I COULDN'T DEPRESS BRAKES, OR TURN THE STEERING WHEEL TO MOVE TO THE SHOULDER. I PANICKED AS I WAS IN THE MIDDLE OF THE DESERT WITH MY 5 YEAR OLD. UNACCEPTABLE!  WITHIN MINUTES THE CAR CAME BACK AND WENT INTO LIMP MODE AND I WAS ABLE TO MAKE IT TO A GAS STATION. CHECK ENGINE LIGHT, TRACTION CONTROL SERVICE, PARK ASSIST OFF, AND STABILITY CONTROL SERVICE ALL CAME ON. PULLED CODES AND THEY WERE ALL TRANSMISSION CONTROL MODULE CODES. WHEN I DISCONNECTED THE BATTERY, THE CAR WOULD START JUST FINE BUT WOULD REPLICATE THE PROBLEM IF I DRIVE IT BEYOND A MILE. WAS TOLD THE TRANNY NEEDED  TO BE REPLACED ($3000). I HAD MY UNCLE, A 25+YEAR EXPERIENCED MECHANIC, LOOK AT IT AND SAID THE TRANNY WAS FINE AND BELIEVES IT IS ELECTRICAL AND ONE OF THE CONTROL MODULES MUST NOT BE COMMUNICATING PROPERLY. HIS EXACT WORDS WERE 'THIS CAR IS POSSESSED, IT IS DOING THE WEIRDEST STUFF'. IT CAN'T BE THE TRANNY BECAUSE IF IT WERE IT WOULDN'T JUST COME BACK TO LIFE ON ITS OWN WITHOUT REPAIR. THERE ARE A PLETHORA OF COMPLAINTS ONLINE CONCERNING THIS EXACT SAME ISSUE, YET NO RECALL OR INVESTIGATION WHATSOEVER. WE REPLACED THE ALTERNATOR TWICE IN 4 MONTHS AS WELL DUE TO FAILURE. VOLTAGE GAUGE IS CONSTANTLY JUMPING FROM 12V TO 16V. THE REAR CONTROLS TO THE A/C DIALS ARE EXTREMELY HOT TO THE TOUCH AS WELL. IT'S VERY STRANGE. EVERY MECHANIC FRIEND THAT HAS WORKED ON IT SAYS 'GET RID OF IT BECAUSE THEY'RE THE WORST CARS' AND THEY SEE NOTHING BUT PROBLEMS. CONVENIENTLY, IT HAPPENS JUST OUTSIDE OF THE WARRANTY PERIOD. UNFORTUNATELY WE STILL OWE 15K ON IT. SHAME ON GM FOR IGNORING THESE MAJOR ISSUES FOR THE SAKE OF DOING MAJOR REPAIRS ON SO MANY AFFECTED VEHICLES.",
        "vin": "1GNKRGKDXDJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING ISSUES:  VERY HARD TO TURN WHEEL WHEN PARKING AND AT SLOW SPEED.  IT IS LIKE MANUAL STEERING!!  I HAVE A SMALL FLUID LEAK AT POWER STEERING PUMP AND RACK PINION BOOT.  I RESEARCHED THIS ISSUE AND ITS COMMON.  I THEN CONTACTED CHEVY WHO ADMITS THIS A COMMON ISSUE BUT YET AN RECALL HAS BEEN ISSUE !!  WHAT IS TAKING SO LONG?  HELP !!",
        "vin": "1GNKVLKD8DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING 70 MPH, THE STABILITY CONTROL AND CHECK ENGINE WARNING INDICATORS ILLUMINATED. THE VEHICLE STALLED AND WAS ABLE TO COAST TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO JACK SCHMITT CHEVROLET OF O'FALLON (127 REGENCY PARK, O'FALLON, IL 62269, (618) 509-9727) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE REPAIR FEES. THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: [XXX]. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.     PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GNKRLKD2DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "01/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WHILE DRIVING AT HIGHWAY SPEEDS. CHECK ENGINE LIGHT COMES ON AND STEERING WHEEL LOCKS AND SOMETIMES KEY GETS STUCK IN THE IGNITION. DEALERSHIP SAYS THERE'S NOTHING WRONG WITH THE CAR AND REPLACED THE BATTERY. WHILE DRIVING HOME FROM DEALERSHIP MY VEHICLE STALLED AGAIN.",
        "vin": "1GNKRFED9DJ"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "08/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY AIRBAG LIGHT COMES ON AND GOES OFF WHENEVER IT WANTS. SOMETIMES IT WITH COME ON AND STAY ON FOR DAYS TO MONTHS AT A TIME, I TOOK IT BACK TO THE CHEVY DEALERSHIP WHERE I PURCHASED IT FROM. I PAID FOR THE  DIAGNOSTIC AND FOR THEM TO FIX IT AND IT STOOD OFF FOR A FEW WEEKS AND CAME BACK ON AND WHEN I CALLED AND TOLD THEM THAT MY AIRBAG LIGHT CAME BACK ON THEY TO ME TO MAKE AN APPOINTMENT TO GET A 3RD DIAGNOSTIC AND FOR ME TO PAID AGAIN I REFUSED AND I AM JUST DEALING WITH THE LIGHT COMING AND GOING OFF ON ITS OWN.  I HAVE TO HOLD MY KEY IN THE IGNITION IN THE FORWARD POSITION BEING CRANKED FOR ABOUT 4-5SEC JUST FOR MY SUV TO TURN ON AND ASKED THE DEALERSHIP WHY AND THEY COULDN'T GIVE ME AN ANSWER AND JUST SHRUGGED THERE SHOULDERS WITH NO ANSWERS.  AND WHEN I PUT MY GIVE MY SUV A LITTLE BIT OF THROTTLE IT HESITATES A BIT AND WHEN I HAPPEN TO FLOOR IT BEING STUCK IN THE SNOW IT STUDDER AND HESITATED FOR ABOUT A SEC OR TWO BEFORE IT REACTED",
        "vin": "1GNKVGKD5DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL,   WHEN I GIVE IT SOME THROTTLE I HEARD THE FRONT DRIVER SIDE MAKING A FUNNY NOISE LIKE A GRINDING/JUMPING/POPPING NOISE AND MY TRACTION CONTROL SYMBOL COMES ON MY DASH ITS LOUD ENOUGH THAT EVERYBODY INSIDE AND OUTSIDE MY SUV CAN HEAR IT ESPECIALLY WHEN I'M TURNING WHEN ITS WET OR SNOWY OUT.  MY HEAT AND AC TAKE HALF HOUR TO START WORKING ABOUT 70% AND I HAD IT CHECKED, IT'S NOT MY THERMOSTAT OR IT ALSO DOESN'T NEED TO BE FLUSH OR RECHARGED BECAUSE I ALREADY HAD IT CHECKED THIS IS HOW IT WAS SINCE I'VE PURCHASED IT.  AND MY DRIVERS DOOR LOCK, LOCKS AND UNLOCKS WHENEVER IT WANTS TO I ABOUT 95% OF THE TIME HAVE TO DO IT MANUALLY. I HAD IT CHECKED BY THE DEALERSHIP AND BY A DIFFERENT MECHANIC AND NOBODY KNEW WHAT WAS WRONG WITH IT.  ALL FOUR DOORS ALWAYS SQUEAKING AND I'VE BEEN PUTTING GREASE EVERY FEW WEEKS TO MONTH PLUS I SEE THAT THERE BEARINGS LOOKED LIKE THEY BECOMING SHOT AND NOW MY DOORS SEEMED TO LOOK LIKE THEY STARTING SAG. I'M JUST TIRED OF PAYING MECHANICS TO TAKE A LOOK AND CAN'T FIX MY ISSUES.1",
        "vin": "1GNKVGKD5DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, IT CUTS OFF WHILE I WAS DRIVING TWICE , IT SHUTS OFF WITH OUT ANY NOTICE.",
        "vin": "1GNKRGKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165826,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE WENT INTO A LOWER POWER MODE AND DECELERATED TO A VERY SLOW SPEED. SONS CHEVROLET (3615 MANCHESTER EXPY, COLUMBUS, GA 31909, (706) 322-8888) DIAGNOSED THAT THE CHASSIS ELECTRONIC MODULE MAY BE FAULTY AND REPLACED THE FUSE BLOCK. THE MANUFACTURER STATED THAT THERE WERE NO RECALLS AND SUGGESTED THE CONTACT FILE A COMPLAINT WITH NHTSA. THE VEHICLE EXPERIENCED SYMPTOMS SIMILAR TO THOSE LISTED IN NHTSA CAMPAIGN NUMBER: 14V614000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 94,548.",
        "vin": "1GNKRLKD8DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE WITHOUT WARNING WENT INTO REDUCED POWER MODE AND WOULD NOT LET ME GO PAST 30 MILES AN HOUR. IT THEN FLASHED REDUCED POWER, STABLE TRACK, AND TRACTION CONTROL. VERY UNSAFE ON A BUSY HIGHWAY WHEN DRIVING AND ON A BUSY STREET TO JUST LOSE POWER.",
        "vin": "1GNKVJKD2DJ"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDOW ON THE FRONT PASSENGER SIDE AND THE REAR BACK WILL NOT WORK WHEN OPERATED FROM DRIVER WINDOW PANEL. I ALSO HAVE A WARNING ON MY DASHBOARD THAT READS \"SERVICE AIR BAG.\" I WAS PULLING OUT OF MY GARAGE ON DAY IN THE SUMMER WHEN I NOTICED IT AND IT HASN'T WENT AWAY SINCE.",
        "vin": "1GNKRFKD1DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT WAS RECALLED AND WAS SUPPOSED TO BE FIXED. HOWEVER, IT BEGAN GOING ON AND OFF AGAIN AND WAS FIXED IN JUNE OF 2017 AT CHEVY DEALERSHIP. HOWEVER, IT IS AGAIN TURNING OFF AND ON AGAIN. NO ACCIDENTS HAVE OCCURRED BUT I AM AFRAID IF THERE IS ONE THAT THE AIR BAGS WILL NOT DEPLOY.",
        "vin": "1GNKVGKD9DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY TRAVERSE TO THE DEALERSHIP AS I NEEDED NEW TIRES DUE TO DRY ROT. THIS WAS DISCOVERED WHEN I TOOK IT IN FOR AN OIL CHANGE. IT STATED TO THEM THAT I COULD HEAR A GROWLING NOISE COMING FROM THE STEERING COLUMN WHEN TURNING THE WHEEL TO THE RIGHT. I WAS TOLD THAT THE POWER STEERING GEAR WAS LEAKING AT THE RIGHT FRONT BOOT.  THE TOTAL COST TO REPAIR $1700.00. NO RECALL ON THIS IMPORTANT PART OF THE TRAVERSE OR ANY ALERTS OR BULLETINS ON THIS MATTER SO THE COST NEEDS TO BE FOOTED BY THE CUSTOMER. AS THE NOISE HAS INCREASED AND NOW HAPPENS WHETHER TURNING LEFT OR RIGHT AND I HAVE BECOME VERY CONCERN WITH MY WELLBEING AND THE PASSENGERS IN MY CAR, I HAVE ORDERED THE REPAIRS TO BE PERFORMED AS SOON AS POSSIBLE. I HAD TO PAY UPFRONT FOR THE PART AS IT IS NOT A STOCK ITEM.  CONSUMER SAFETY SHOULD BE A TOP PRIORITY FOR GM. WE SHOULD NOT HAVE TO BECOME A STRATEGIC TO GET THERE ATTENTION. I HAVE OWN MANY CHEVROLET CARS AND SO HAVE MANY OF MY FAMILY MEMBERS GOING BACK 3 GENERATIONS.  TOO MANY FOREIGN MADE CARS ON THE ROADS TODAY. GM WAKE UP!",
        "vin": "1GNKVGKD1DJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155285,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 2018 I TOOK MY TRAVERSE FOR REGULAR OIL CHANGE AND WAS TOLD I NEEDED BRAKES. SI WASN'T EXPERIENCING A PROBLEM WITH THEM BUT I AGREED TO HAVE THEM REPLACED AS THEY ARE IMPORTANT PART OF THE DRIVING EXPERIENCE. APPROXIMATELY 4 WEEKS AFTER THE NEW BRAKES WERE REPLACED A GRINDING NOISE BEGAN WHEN I APPLIED THE BRAKES COMING TO A STOP. I HAD NO NOISES COMING FROM MY BRAKES EVER BEFORE THEY WERE REPLACED? I  TOOK IT BACK TO THE DEALERSHIP THEY COULDN'T HEAR ANYTHING AND BRAKES WERE 100%. THE GRINDING NOISE CONTINUED SO I TOOK IT BACK AND TEST DROVE IT WITH THE SERVICE MANAGER WHO FINALLY HEARD IT AND A BRAKE BOOSTER WAS ORDERED AND BRAKES WERE REPAIRED. MY TRAVERSE HAS NOW BEEN BACK FOR THIS BRAKE PROBLEM 3 TIMES. THE GRINDING NOISE IS STILL THERE AND THE LAST TIME I TOOK IT BACK WAS TOLD THAT THERE IS AN ALERT ON THIS PROBLEM BUT NOT A RECALL BY GM. THE FRONT LOWER CONTROL ARM BUSHINGS SUCH CORRECT THIS PROBLEM, PER BULLETIN PIT5563 AT THE COST OF $700.00. SINCE IT'S NOT A RECALL BUT A PROBLEM THEY ARE AWARE OF AND SINCE IT ONLY OCCURRED AFTER MY BRAKES WERE REPLACED I HAVE TO FOOT THE COST.  WHAT'S IT GOING TO TAKE A FEW LIVES TO GET GM TO OWN UP TO THIS KNOWN PROBLEM?",
        "vin": "1GNKVGKD1DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/23/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIRBAG CAME ON WHILE DRIVING - HAD IT SERVICED A DEALER WHICH RESULTED IN PASSENGER SIDE AIRBAG WARNING ALONG WITH THE PASSENGER SENSOR BELL TO CONSTANTLY RING EVEN WITH NO ONE IN THE SEAT. I TOOK IT BACK TO THE DEALER AGAIN AND AFTER THEM LOOKING AT THE PASSENGER SIDE, THE DRIVER'S SIDE AIRBAG IS BACK ON AGAIN. THIS LIGHT IS ON ALL THE TIME WHEN THE KEYS ARE IN THE IGNITION. THERE ARE 75584 MILES ON THE CAR.",
        "vin": "1GNKRLKD6DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING TO WORK LIKE ANY OTHER DAY. ALL OF A SUDDEN SERVICE TRACTION CONTROL STABILITRACK AND REDUCED ENGINE POWER COMES ON.  LUCKILY NOT HEAVY TRAFFIC. BOYFRIEND CAME TO TAKE IT TO THE SHOP AND IT WOULDN'T EVEN CRANK UP. SEEING ALL THESE COMPLAINTS I REALLY HOPE THIS ISN'T A COSTLY ISSUE BECAUSE A LAWYER WILL BE CONTACTED TO GET TO THE BOTTOM OF THESE ISSUES WITH THIS AND ALL PARTIES WILL BE REIMBURSED FOR THIS! I HAD TO LEAVE WORK EARLY TO TAKE CARE OF JUST GETTING MY CAR SOMEWHERE FOR IT TO BE LOOKED AT AND  NOT A HAPPY PERSON!",
        "vin": "1GNKRGKD1DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RANDOMLY INDICATES SERVICE TRACTION CONTROL, ENGINE POWERING DOWN, SERVICE STABILITRACK.  VEHICLE THEN SHUTS DOWN.  IT HAS HAPPENED SEVERAL TIMES WITHOUT ANY WARNING.  THE CHECK ENGINE LIGHT WILL COME ON AND THEN IT WILL GO BACK OFF.",
        "vin": "1GNKVLKD7DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK LIKE ANY OTHER DAY. AS I WAS ABOUT TEN MINUTES AWAY FROM MY WORK. MY TRAVERSE SUDDENLY STARTED TO SHAKE. AND THEN THE CHECK ENGINE LIGHT CAME ON AND ENGINE POWER REDUCE, SERVICE STABILITRAK, TRACTION CONTROL OFF POPPED UP ON MY DASH BOARD. I WENT FROM 70 MPH TO UNDER 20 MPH WITH IN SECONDS. THANK GOD IT WAS NOT SO MUCH TRAFFIC BECAUSE I PROBABLY WOULD NOT BE HERE TYPING UP MY COMPLAINT ABOUT MY CAR. THERE IS EVEN A CHEVY FORUM THAT I FOUND, WHERE MULTIPLE PEOPLE HAVE HAD THE SAME EXACT ISSUE. WWW.TRAVERSEFORUM.COM HERE IS THE WEBSITE WHERE I HAVE FOUND MULTIPLE COMPLAINTS OF THE CHEVY TRAVERSE AND OTHER CHEVY MODELS. HOPE SOMEONE CAN DO SOMETHIG BEFORE SOMEONE GETS IN A HORRIFIC TRAFFIC ACCIDENT OR EVEN CAUSES DEATH TO SOMEONE.",
        "vin": "1GNKVGKD9DJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "04/16/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY. THE HEADLIGHT BULB BURNT WHILE DRIVING ON THE HIGHWAY. THIS COULD HAVE BEEN MORE SERIOUS THEN IT WAS IF I WOULD NOT HAVE BEEN WARNED BY A PASSING MOTORIST.",
        "vin": "1GNKRLKD3DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING 70 MPH, THE VEHICLE DECELERATED TO 20 MPH, AND THE TRACTION CONTROL, STABILITRAK, AND ENGINE POWER REDUCED WARNING INDICATORS ILLUMINATED. IN ADDITION, THE VEHICLE WOULD VIBRATE VIOLENTLY AND FAILED TO ACCELERATE FROM A STOP SIGN OR TRAFFIC LIGHT. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING AND FAILURE CODE: P1682 (IGNITION 1, SWITCH CIRCUIT 2) WAS FOUND. THE ENGINE CONTROL MODULE WAS REPLACED, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: [XXX]. THE APPROXIMATE FAILURE MILEAGE WAS 44,000.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *AN",
        "vin": "1GNKRFED9DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON ALL OCCASIONS, MY CAR WAS IN MOTION ON MAJOR CITY STREETS AND SIDE ROADS AND MY DRIVING SPEEDS RANGED FROM 25MPH TO 55MPH. THE FOLLOWING MESSAGES FLASH ACROSS THE DASHBOARD: TRACTION CONTROL OFF, ENGINE POWER IS REDUCED, SERVICE TRACTION CONTROL, SERVICE STABILITRAK. THE CHECK ENGINE LIGHT COMES ON WITH THE STABILITRAK ICON. MY SPEED WAS THROWN DOWN TO THE RANGE OF 10MPH TO 40MPH. THE ENTIRE CAR BEGAN SHAKING AND THE EXHAUST PIPE WAS GIVING LOUD \"PUFFING\" SOUNDS. THIS HAPPENED SEVERAL TIMES, BUT THE THIRD TIME, I WAS NOT ABLE TO RESTART MY CAR. I HAD IT TOWED TO THE DEALERSHIP I BOUGHT IT FROM. AFTER HAVING IT FOR A MONTH, THEY WERE UNABLE TO FIND THE ISSUE, THEREFORE NOTHING WAS FIXED, AND I WAS TOLD \"LET US KNOW IF IT HAPPENS AGAIN.\" WOW! ...AND IT HAPPENED AGAIN MONTHS LATER - AGAIN THREE SEPARATE TIMES! AGAIN, THE DEALERSHIP SAID THEY RECEIVED NO \"ERROR MESSAGES\" FOR THAT ISSUE, ONLY FOR MY CAR ALARM BEING FAULTY. GOOD GRIEF! HAD I BEEN ON A FREEWAY DURING ONE OF THESE OCCURRENCES, I WOULD HAVE BEEN REAR-ENDED AND INTO A BAD ACCIDENT; BUT \"WE'LL JUST SEE IF IT HAPPENS AGAIN!\" I OFFERED THE DEALERSHIP VIDEO AND PICTURES AS PROOF OF THE ISSUE, BUT NOTHING HAS YET BEEN DONE. I HAVE A VIDEO THAT LASTS 1MIN AND 11 SECONDS, BUT ITS TOO LARGE FOR ME TO UPLOAD (EVEN WHEN I SHORTEN IT DOWN TO A MINIMUM 25SECONDS TO GET THE GIST OF THE ISSUE).",
        "vin": "1GNKRFED7DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "09/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD MY VEHICLE IN DEALER TO FIX AIR BAG LIGHT SEVERAL TIMES AND IT IS STILL ON. MY WIFE WAS INVOLVED IN AN ACCIDENT WHERE AIRBAGS SHOULD OF DEPLOYED AND DIDN'T. LUCKILY SHE WAS NOT INJURED.",
        "vin": "1GNKRFKD7DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. UPON STARTING THE VEHICLE, A RATTLING NOISE WAS HEARD EMERGING FROM THE ENGINE COMPARTMENT AND THE \"BATTERY CHARGING SYSTEM NEEDS SERVICE\" MESSAGE APPEARED. THE CONTACT NOTICED A PULLEY LYING ON THE GROUND UNDER THE FRONT OF THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER (JACK WILSON CHEVROLET IN SAINT AUGUSTINE, FLORIDA, 904-797-4567) WHERE IT WAS DETERMINED THAT THE BOLT THAT HELD THE PULLEY FOUND ON THE GROUND HAD FRACTURED AND NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 88,000.",
        "vin": "1GNKVFEDXDJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WIPERS DON'T WORK WE HAVE CHANGED FUSES THAT DIDN'T WORK THIS WAS FOUND OUT AS WE WERE GOING TO DRIVE AND HAVE TRIED EVERYTHING TO NO GOOD",
        "vin": "1GNKVGKD1DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT RANDOMLY TURNS ON AND OFF.  MORE FREQUENTLY NOW.  MY VIN NUMBER DOESN NOT FALL UNDER THE RECALL THAT WAS SENT OUT.",
        "vin": "1GNKRGKD5DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED STALLING WHILE BEING OPERATED AT VARIOUS SPEEDS. THE FAILURE OCCURRED WITHOUT WARNING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS PROVIDED WITH CASE NUMBER: 8-3794078576 AND AN APPOINTMENT WAS SCHEDULED WITH JBA CHEVROLET (7327 RITCHIE HWY, GLEN BURNIE, MD) TO GET THE FAILURE DIAGNOSED. A DEALER WAS NOT CONTACTED PRIOR TO THE MANUFACTURER COMMUNICATION. IN ADDITION, THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 14V614000 (ELECTRICAL SYSTEM); HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 57,000.",
        "vin": "1GNKRFED7DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR STARTS ALARMING AND I GET A MESSAGE THAT SAYS SERVICE STABILITRAK, ENGINE POWER REDUCED, TRACTION CONTROL OFF. THIS CAUSES MY VEHICLE TO SLOW DOWN AND I HAVE VERY LITTLE CONTROL WHILE DRIVING IN SNOW. I USE THIS AS A FAMILY CAR, HAVE HAD IT CHECKED OUT AT A CHEVY DEALER AND WAS TOLD IT IS A SENSOR IN THE GAS PEDAL. I HAVE SEEN A LOT OF PEOPLE HAVING THIS SAME ISSUE, HAS THERE BEEN A RECALL YET? CHEVY SHOULD BE FIXING THIS, MY FAMILY AND I COULD BE IN DANGER, I AM GOING TO REPLACE THE GAS PEDAL AND SEE IF THE ISSUE PERSISTS, HOWEVER IF IT DOES NOT FIX THE ISSUE I WILL NEVER BUY ANOTHER GM CAR AGAIN.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057459,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR IT WAS MAKING NOISES, I TOO IT TO AUTOZONE TO GET A FREE DIAGNOSTIC CHECK. IT WAS READING THAT MY TIMING WAS OFF. I WENT BACK HOME PARKED THE CAR 2 DAYS LATER CALLED THE DEALERSHIP IN WHICH IT WAS PURCHASED TO HAVE THEM PICK IT UP AND RUN A DIAGNOSTIC ON IT, I STILL HAVE TIME UNDER WARRANTY. I WAS TOLD TIMING CHAIN IS OFF, BY THE DEALERSHIP THEY ARE FAILING TO GET IT COVERED UNDER WARRANTY STATING THAT I HAVE NO BEEN MAINTAINING THE VEHICLE.   CALLED A LOCAL MECHANIC TO GET NEW ENGINE PRICING, HE TOLD ME THAT THE ENGINE BY THE MANUFACTURER HAD TO BE UPDATED BECAUSE OF PROBLEMS WITH THE TIMING CHAIN. WHICH IS THE CURRENT ISSUE I AM HAVING NOW.",
        "vin": "1GNKRGKD4DJ"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "10/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11055507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCT 25 OF LAST YEAR WE WERE INVOLVED IN A ACCIDENT WHERE WE HIT A CAR BROADSIDED DOING ABOUT 30 MPH CAUSING CONSIDERABLE DAMAGE TO OUR CAR, BOTH MY WIFE AND MYSELF HAD TERRIBLE WHIPLASHES. AND I BELIEVE THAT SOME OF OUR PAIN COULD HAVE BEEN PREVENTED IF THE AIR BAGS WOULD HAVE DEPLOYED WHICH THEY DID NOT DO. WE WERE ON 4 LANE DIVIDED ROAD GOING THROUGH THE TOWN OF CHIEFLAND FL. WE WERE PASSING A SEMI TRUCK WHICH WAS SLOWING DOWN TO MAKE A TURN WHEN A VEHICLE CAME ACROSS THE FRONT OF THE TRUCK AND  CONTINUED TO COME INTO OUR LANE WITH NO REGARDS TO STOPPING AND WE HAD NO CHOICE OR TIME TO STOP.",
        "vin": "1GNKRJKD9DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROET TRAVERSE. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND THE TRACTION, ENGINE, AND SERVICE STABILITRAK WARNING INDICATORS ILLUMINATED. IN ADDITION, THE STEERING WHEEL SEIZED. THE VEHICLE WAS ABLE TO RESTART. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO GEORGE MORRE CHEVROLET (10979 ATLANTIC BLVD, JACKSONVILLE, FL 32225) WHERE IT WAS DIAGNOSED THAT THE MOTHERBOARD NEEDED TO BE REPAIRED. THE VEHICLE WAS REPAIRED; HOWEVER, MONTHS LATER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO GEORGE MORRE CHEVROLET, BUT THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.",
        "vin": "1GNKRGKD7DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "11/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DRAINING. BATTERY WILL CHARGE AND THEN WHEN THE CAR SITS, SOMETHING IS DRAWING POWER OUT. THE CD PLAYER AND NAVIGATION CYCLE CONSTANTLY.",
        "vin": "1GNKRLKD2DJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN I HEARD WHAT SOUNDED LIKE AN EXPLOSION AND IT TURNS OUT MY SUNROOF EXPLODED. IT SHATTERED INTO HUNDREDS OF LITTLE PIECES BUT LUCKILY IT DID NOT FALL THROUGH.",
        "vin": "1GNKRLKD7DJ"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2017",
        "dateOfIncident": "07/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE/DRIVETRAIN > ENGINE POWER REDUCED AT 70 MPH  MILTSTIPEK 01:12 PM 09-05-2017  I WANT TO REPORT A VERY DANGEROUS AND SAFETY HAZARD THAT WE RECENTLY EXPERIENCED WITH OUR 2013 LTZ TRAVERSE. ON JULY 23,2017 MY WIFE AND I WERE DRIVING ON INTERSTATE 80. DRIVING IN THE MIDDLE LANE GOING 70 MPH. ALL OF THE SUDDEN BELLS WERE RINGING AND DASHBOARD ALERTS LIT UP. (TRACTION CONTROL OFF, SERVICE STABILITRAK,ENGINE POWER REDUCED) OUR SPEED WENT FROM 70 MPH TO 10 MPH IN SECONDS. THE TRAFFIC BEHIND US WERE SWERVING ALL AROUND US TO AVOID A SERIOUS ACCIDENT. WE WERE LUCKY NO ONE WAS KILLED. WE WERE FINALLY ABLE TO GET OFF THE ROAD INTO A TRUCK WEIGH STATION. OUR TRAVERSE WAS TOWED TO THE NEAREST CHEVY DEALER IN FRANKFORT,IL. LOW AND BEHOLD THERE WASN'T ANYTHING WRONG WITH THE TRACTION CONTROL OR THE STABILITRAK. WE WERE TOLD THAT THE CODES WERE FOR THE HIGH PRESSURE FUEL PUMP AND SENSOR. THE ECM SHOULD NOT HAVE THESE THREE PROBLEMS ROUTED TOGETHER. THERE SHOULD BE SOME SORT OF ALERT FOR THE HIGH PRESSURE FUEL PUMP BEFORE IT IT A PROBLEM AND THE ENGINE SPEED DROPPED. THE ECM SHOULD BE REPROGRAMMED SO THAT IT DOES NOT DROP THE SPEED DOWN THAT FAST. PLEASE GET THIS FIXED BEFORE THERE ARE MAJOR FATALITIES! GM YOU HAVE BEEN WARNED!    (THIS IS ANOTHER PERSON WITH COUNTLESS OTHERS WITH THIS EXPERIENCE - FIX IT OR YOU WILL HAVE THEIR BLOOD ON YOUR HANDS) DO THE HONORABLE THING PLEASE!",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/30/2017",
        "dateOfIncident": "09/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11030629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON FREEWAY TRACTION CONTROL OFF LIGHT CAME ON THE ENGINE SPEED REDUCED CAME ON AND CAR IMMEDIATELY WENT FROM 60 MPH TO 15-20 CAUSING ME TO SPIN OUT AND LOSE CONTROL ON FREEWAY AND EVENTUALLY SLAMMED INTO SIDE OF ROAD, (MANAGED TO DRIVE HOME GOING ABOUT 15 MPH AT 1:00 IN THE MORNING)BENDING MY AXLE AND THE NEXT DAY ON THE NEWS IT WAS REPORTED CARS WITH ONSTAR WERE HACKED. NEXT MORNING NO LIGHT WAS ON IN THE CAR AND ABLE TO DRIVE WITH BENT AXLE. REPAIRS COMPLETED AND MY INSURANCE RATES WERE INCREASED.   ONE YEAR LATER LIGHT CAME ON AGAIN TRACTION CONTROL OFF THEN ENGINE SPEED REDUCED AND CAR WENT FROM 40 TO 15 (LUCKILY I JUST GOT OFF FREEWAY GOING TO WORK) ON SURFACE STREET AND MANAGED TO MAKE IT TO WORK. CALLED CHEVROLET DEALER AND WAS TOLD MANY DIFFERENT THINGS. WAS TOLD THAT PARTICULAR LIGHT COMES ON WHEN ANYTHING GOES WRONG WITH THE CAR TO PREVENT FURTHER DAMAGE TO \"THE CAR\" BUT PUT LIVES AT RISK. CHECKED THE CHEVROLET FORUM AND THIS HAPPENS QUITE OFTEN AND PEOPLE SAY GET RID OF IT AS SOON AS POSSIBLE AND DON'T USE IT AS A FAMILY CAR BECAUSE IT CAN STALL ON THE HIGHWAY. THIS FEATURE SHOULD BE REMOVED FROM ALL VEHICLES. I WAS TOLD THERE WAS A PRIVATE RECALL ON THE 2011 EQUINOX THROTTLE BODY, SHAME ON CHEVROLET, SHAME ON ONSTAR!",
        "vin": "1GNKRFKD8DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAG LIGHT ILLUMINATED ABOUT 9 MONTHS AGO. THE ISSUE WAS REPORTED BY DEALER AS WIRE HARNESS UNDER THE DRIVER SIDE THAT WAS REPLACED AND WELDED. NOW SAME ISSUE AFTER 9 MONTHS AGAIN (SEPTEMBER 2017) SERVICE LIGHT COME ON AGAIN AND DEALER TOLD ME IS THE SAME ISSUE BUT NOW IS UNDER THE PASSENGER SIDE. MY VEHICLE IS CURRENTLY UNDER 71K MILES. REALLY CONCERN I HAD THESE TWO EVENTS. SOMETHING IS WRONG WITH THE SEAT WIRE HARNESS CREATING THE SAME FAILURE MODE. WHAT IS WRONG WITH THE WIRE HARNESS? BOTH ISSUES WERE NOT COVERED BY GM. THEY STATED THAT ONLY IS COVERED UNDER BUMPER TO BUMPER LIMITED TO 36K MILES. I ISSUED A CONCERN WITH GM AND GAVE ME THIS NUMBER TO RECORD THIS CONCERN 8-3308753301 HOWEVER THE SOLUTION IS THAT I NEED TO TAKE CARE SINCE IS OUT OF WARRANTY.",
        "vin": "1GNKRGKDXDJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STABILITRAC, TRACTION CONTROL OFF, ENGINE POWER IS REDUCED, SERVICE TRACTION CONTROL. THE VEHICLE WILL NOT DRIVER MORE THAN 30 MILES PER HOUR. DEALER AND OTHER SERVICE SHOPS HAVE NOT BEEN ABLE TO FIND ANY CODES. IF YOU TURN THE VEHICLE OFF AND BACK ON IT WILL WORK FINE AND IT CAN BE WEEKS OR EVEN MONTHS BEFORE IT HAPPENS AGAIN. IN SEARCHING THE INTERNET THERE ARE MANY REPORTS OF THE SAME ISSUE IN DIFFERENT BLOGS, THIS IS A SAFETY CONCERN AS YOU CAN LOSE POWER WHEN DRIVING IN A HIGHWAY AT 70 MPH. SEE THIS YOUTUBE VIDEO WHICH SHOWS THE ISSUE. [XXX]    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GNKRFED7DJ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/19/2017",
        "dateOfIncident": "12/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT CONTROL PANEL IS GOOD; HOWEVER, THE LIGHT WEIGHT PLASTIC FRAMING IT SNAPS INTO IS BROKEN IN A COUPLE OF PLACES. I HAVE TRIED TO GLUE THE BROKEN PLASTIC PIECES SO THAT THE CONTROL PANEL WILL SNAP BACK INTO IT. WE ARE SENIOR CITIZENS AND ARE NOT OVER WEIGHT AND CAN NOT IMAGINE WHAT COULD HAVE CAUSED IT. NOT THAT IT MATTERS, WEE HAVE 55,651 MILES ON THE VEHICLE AND WE PURCHASED IT NEW FROM A DEALER. WE PAID CASH FOR THE TRAVERSE AS WE ARE LIFE LONG GM CUSTOMERS AND BELIEVE IN THE PRODUCT. WE ARE NOT LESS A BELIEVER NOW BUT I AM CONCERNED AS THIS IS A SAFETY ISSUE IN THAT WHEN THE PANEL HANGS OUTSIDE OF THE SEAT, PANT LEGS, PURSE STRAPS, ETC. DO CATCH ON IT AND AT OUR AGE THIS NEEDS TO BE FIXED BEFORE ONE OF US GETS HURT, NOT TO MENTION THE BAD APPEARANCE OF THIS BEAUTIFUL PRODUCT. PLEASE LET US KNOW THE ALTERNATIVES AND HAVE A GREAT DAY. THE PROBLEM WAS FIRST NOTICED ABOUT EIGHT MONTHS AGO BUT WE HAVE TRIED TO SUPER GLUE THE FRAME BACK IN PLACE SINCE THAT TIME.",
        "vin": "1GNKRLKD3DJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "07/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO REPORT A VERY DANGEROUS AND SAFETY HAZARD THAT WE RECENTLY EXPERIENCED WITH OUR 2013 LTZ TRAVERSE.  ON JULY 23,2017 MY WIFE AND I WERE DRIVING ON INTERSTATE 80.  DRIVING IN THE MIDDLE LANE GOING 70 MPH.  ALL OF THE SUDDEN BELLS WERE RINGING AND DASHBOARD ALERTS LIT UP. (TRACTION CONTROL OFF, SERVICE STABILITRAK AND ENGINE POWER REDUCED)  OUR SPEED WENT FROM 70 MPH TO 10 MPH IN SECONDS.  THE TRAFFIC BEHIND US WERE SERVING ALL AROUND US TO AVOID A SERIOUS ACCIDENT.  WE WERE LUCKY NO ONE WAS KILLED.  WE WERE FINALLY ABLE TO GET OFF THE ROAD INTO A TRUCK WEIGH STATION.  OUR TRAVERSE WAS TOWED TO THE NEAREST CHEVY DEALER IN FRANKFORT, IL.  LOW AND BEHOLD THERE WASN'T ANYTHING WRONG WITH THE TRACTION CONTROL OR THE STABILITRAK.  WE WERE TOLD THAT THE CODES WERE FOR THE HIGH PRESSURE FUEL PUMP AND SENSOR.  THE ECM SHOULD NOT HAVE THESE THREE PROBLEMS ROUTED TOGETHER.  THERE SHOULD BE SOME SORT OF ALERT FOR THE HIGH PRESSURE FUEL PUMP BEFORE IT IS A PROBLEM AND THE ENGINE POWER REDUCED SHOULD NEVER BE USED.   PLEASE GET THIS FIXED BEFORE THERE ARE MAJOR FATALITIES!",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG IS ENABLED WHEN A MINOR WEIGHT (SUCH AS A SMALL BACKPACK, OR LAPTOP) IS PLACED IN THE PASSENGER SEAT. I FIRST REPORTED THIS WHEN THE VEHICLE WAS UNDER WARRANTY AND THE DEALER REFUSED TO ADDRESS IT, SAYING THAT THERE IS NO WEIGH UNDER WHICH THE AIRBAG SHOULD BE DEACTIVATED. I BELIEVE THAT THIS IS NOT THE CASE, AND THAT A LIGHT WEIGHT ACTIVATING THE AIRBAG IS A SIGNIFICANT SAFETY ISSUE.",
        "vin": "1GNKVFED0DJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002341,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOMLY WITHOUT WARNING MY TRAVERSE WILL COMPLETELY LOOSE POWER. IT DOES THIS WHILE DRIVING AT ANY SPEED, AND ALSO WHILE IDLING IN PARK.",
        "vin": "1GNKRFED9DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2017",
        "dateOfIncident": "05/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LOSS.  DRIVING ON HIGHWAY,  IN SLOW LANE GOING TO EXIT, WHEN WE LOST STABILITY, TRACTION, ENGINE POWER REDUCED, TILL THERE WAS NO POWER. GOT IN A PARKING LOT, BY SLOWLY ROLLING DOWN HILL, THANK GOODNESS.  WOULDN'T START BACK UP.  WE WENT AND ATE, WHEN WE CAME BACK IT STARTED AGAIN LIKE NOTHING HAPPENED.  GOING TO WORK LAST WEEK, SAME THING. AT LEAST I HAD GOTTEN OFF THE HIGHWAY.  THERE IS NO WARNING YOU LOOSE POWER.  GOING TO GET SOMEONE KILLED.",
        "vin": "1GNKRGKD1DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "04/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE EXITING A STORE PARKING LOT ONTO A CITY STREET, AT NIGHT, GOING APPROX. 40MPH ,  I HAD MY 3 YOUNG CHILDREN IN THE VEHICLE AND MY SUV SUDDENLY LOSS POWER.  IT SHUT DOWN COMPLETELY, IN THE MIDDLE OF TRAFFIC, WITH OUT WARNING.  LUCKILY THE CAR BEHIND ME SEEN  WHAT WAS GOING ON AND DID NOT REAR END ME.  I TRIED TO  START THE VEHICLE UP AND IT WANTED TO TURN OVER BUT COULDN'T.  THE ENGINE LIGHT CAME ON AND IT STARTED TO SMELL OF GASOLINE.  THE PEOPLE IN THE CAR BEHIND ME, HELPED ME BY PUSHING MY CAR OUT OF THE WAY OF TRAFFIC INTO A  PARKING LOT.  I CALLED ROADSIDE ASSISTANCE AND HAD THEM TOW MY TRUCK TO MY HOUSE SINCE THE DEALSHIP WAS ALREADY CLOSED.  THE NEXT MORNING, THEY TOWED IT TO THE NEAREST CHEVY DEALERSHIP. THE FOLLOWING DAY THE DEALER DIAGNOSED IT WITH A FUEL PUMP FLOW CONTROL FAILURE, AND TOLD ME IT WOULD BE $ 965.00 TO REPAIR.  I HAVE ONLY OWNED THIS VEHICLE FOR 6 MONTHS, AND IT ONLY HAS, 70,000 MILES, WITH A MANUFACTURE POWERTRAIN WARRANTY STILL.  SO I CALLED GM, AND COME TO FIND OUT THERE WAS A  RECALL ON THE SAME YEAR MAKE AND MODEL AS MY SUV, FOR THE SAME PROBLEM/PART, BUT BECAUSE THE RECALL IS VIN SPECIFIC, GM WILL NOT PAY FOR THE REPAIR.  I PUT IN A SERVICE REQUEST AND HAVE SPOKEN TO 7 DIFFERENT PEOPLE, WITH 1 SUPERVISOR ADVISING ME THAT THEY WERE GOING TO CONTACT THE DEALERSHIP AND SEE WHAT THEY COULD DO TO HELP GET IT FIXED.  THAT WAS 4 DAYS AGO, NEVER HEARD BACK FROM ANYONE.  I CALLED TODAY AND THE LADY I SPOKE WITH, SAID THERE WAS NO NOTES INDICATING THAT ANYONE WAS WORKING ON A SOLUTION, OR OF ANYTHING THEY PROMISED TO DO.  THE ONLY THING SHE SAID WAS MY VEHICLE WASNT COVERED UNDER THE WARRANTY AND THERE WAS NOTHING THEY COULD DO.  SO NOW I AM VERY UPSET, I HAVEN'T BEEN ABLE TO GET TO WORK BECAUSE THIS WAS MY ONLY SOURCE OF TRANSPORTATION AND I WASN'T PROVIDED A LOANER, I DO NOT HAVE THE MONEY TO FIX IT.  CAN SOMEONE PLEASE HELP??",
        "vin": "1GNKRLKD8DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "01/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I COUNTINUE TO HAVE ISSUES WITH THE VEHICLE WITH THE CHECK ENGINE LIGHT COMING ON AND SERVICE STABILITRAK AND THEN REDUCED ENGINE POWER.  THIS ERROR COME UP MULTIPLES TIME A WEEK IT IS VERY DANGEROUS AS THE VEHICLE LOSES ENGINE POWER AS A RESULT OF THIS ISSUE RESULTING IN REDUCED SPEEDS ETC.  THE VEHICLE HAS BEEN TO THE DEALER AND THEY HAVE YET TO DIAGNOSE THE ISSUE.  THIS IS A KNOWN ISSUE WITH THESE VEHICLES A SIMPLE SEARCH OF THE INTERNET WILL REVIEWS FORUM UPON FORUM ABOUT THIS KNOWN ISSUE",
        "vin": "1GNKVGKD9DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING ISSUES WITH THE POWER STEERING PUMP ON MY VEHICLE. I HAVE HAD IT REPLACED 6 TIMES NOW IN A TOTAL 6 MONTHS, I HAVE A NEW ON E PUT IN IT AND IT GOES OUT IN A FEW DAYS. THE RACK N PINION HAS BEEN REPLACED AS WELL. I NEVER LOOSE ANY FLUID THE PUMP STARTS MAKING A SQUEALING NOISE AND THEN GOES OUT. I BELIEVE THERE IS A ISSUE WITH THIS PUMP, THE DEALER NEEDS TO LOOK TO THIS. THEY WILL NOT COVER THIS AT ALL, EVEN I HAVE THE BURDEN OF PROOF THAT IS NOT MY FAULT AND IT KEEPS GOING OUT.",
        "vin": "1GNKVJKD1DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HOSE LEAKED AT CONNECTIONS AT JUST A FEW YEARS OF AGE AND AT LOW MILES (40K). CHEVY PROCEEDS TO TELL ME IT'S A VERY COMMON ISSUE AND HOPE FOR ME THAT IT'LL BE A RECALL SO I CAN GET MY HUNDREDS BACK IN REPAIRS FOR A SMALL SIMPLE JOB, RIDICULOUS, SINCE IT LEAKED QUITE A BIT ON THE FLOORS, AND DOWN A HOT MOTOR, WHICH COULD POTENTIALLY DISRUPT POWER STEERING AS WELL AS A POTENTIAL FIRE HAZARD. JUST LOVE THAT MY PREGNANT WIFE DRIVES THIS DEATH TRAP EVERYDAY. GM WONT HELP SINCE I AM A SECOND OWNER, AS THEY PRETTY MUCH TELL ME THEY TREAT CUSTOMERS WHO PURCHASE THEM NEW AND/OR CERTIFIED WITH BETTER CUSTOMER SERVICE. IF THE DEALER TELLS ME IT'S SUCH A COMMON ISSUE THAT THESE POWER STEERING HOSES ARE BACKORDERED, THERE IS A DESIGN FLAW WITH THE CONNECTIONS AND GM NEEDS TO STAND UP TO KEEPING THEIR CUSTOMERS SAFE RATHER THAN WORRYING ABOUT THEIR POCKETS!",
        "vin": "1GNKRGKD6DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THERE WERE VARIOUS ELECTRICAL SHORTS PERTAINING TO THE LOW BEAM LIGHTS, THE INTERIOR LIGHTING, AND THE GAUGES ON THE INSTRUMENT PANEL. THE DEALER WAS NOTIFIED OF THE FAILURES SEVERAL TIMES, BUT WAS UNABLE TO PROVIDE A SOLUTION. THE MANUFACTURER WAS NOTIFIED. THE CONTACT WAS WAITING FOR A REMEDY FROM THE MANUFACTURER TO PROVIDE A SOLUTION TO THE DEALER. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GNKRGKD4DJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "07/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL",
                "productYear": "9999",
                "size": "P255/65R18 109S",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE EQUIPPED WITH GOODYEAR FORTERA HL TIRES, SIZE: P255/R265/18 (NA). WHILE DRIVING APPROXIMATELY 70 MPH, THE FRONT DRIVER SIDE TIRE EXPLODED WITHOUT WARNING. ONCE THE VEHICLE WAS STOPPED, THE CONTACT NOTICED THAT THE TREAD WAS DETACHED FROM THE TIRE. THE TIRE WAS REPLACED WITH ANOTHER TIRE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE TIRE WAS THE ORIGINAL EQUIPMENT. THE DOT NUMBER WAS UNKNOWN. THE APPROXIMATE VEHICLE AND TIRE FAILURE MILEAGE WAS 32,000.",
        "vin": "1GNKRJKD4DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING TO WORK AND ALL OF A SUDDEN THE LIGHT PANEL TELLS ME ENGINE POWER REDUCED TRACTION CONTROL OFF AND SERVICE TRACTION. I DIDN'T HAVE THE TRACTION ON. TURNED AROUND WENT HOME. CAR SOUNDS HORRIBLE. TURNED IT OFF LET IT SIT. LIGHTS GONE BUT SCARED TO DRIVE IT. WILL HAVE IT LOOKED AT BUT DOESN'T SOUND GOOD. SINGLE MOM AND LIVE PAYCHECK TO PAYCHECK WHO WORKS EVERYDAY. WHAT AM I GOING TO DO.",
        "vin": "1GNKRFED2CJ"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "06/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS WHILE IDLING. THE RPM'S AND THE BATTERY GAUGE GO UP AND DOWN WHILE DRIVING ON CITY STREETS AND HIGHWAY. IT HAS ALSO BEEN WARM AND COLD WEATHER. THE CAR WILL REDUCE SPEED ON IT'S OWN WHILE THIS IS HAPPENING. THE VEHICLE DRIVES ROUGH AND THE ENGINE SOUNDS HARSH. ORIGINALLY ENGINE LIGHT CODES OF P0174 AND P0171 CAME ON AND DEALERSHIP CLEANED AIR FLOW. NOW NO CODES AND DEALER ISN'T ABLE TO ALWAYS RECREATE. I HAVE BROUGHT TO DEALER MULTIPLE TIMES FOR SAME ISSUE. OWNED VEHICLE LESS THAN 90 DAYS.",
        "vin": "1GNKRGKD7DJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE AT A COMPLETE STOP, THE VEHICLE STALLED WITHOUT WARNING AND FAILED TO RESTART. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING, BUT THE DETAILS COULD NOT BE PROVIDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 28,500.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/21/2016",
        "dateOfIncident": "01/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 2013 CHEVY TRAVERSE ON THE HIGHWAY 65MPH STABILITY TRAC LIGHT COMES ON REDUCED ENGINE POWER MESSAGE SERVICE STABILITY TRAC MESSAGE VEHICLE SLOWED DOWN TO 20MPH IN ABOUT 20 SECONDS COULD HAVE CAUSED A SERIOUS ACCIDENT RESULTING IN SEVER INJURY OR DEATH TO MYSELF AND YOUNG CHILDREN IN THE VEHICLE WITH ME",
        "vin": ""
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "12/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 65 MPH ON US-59 IN MY 2013 CHEVROLET TRAVERSE LTZ , THE INSTRUMENT PANEL LIT UP LIKE A CHRISTMAS TREE, FOLLOWED BY A RAPID, UN-CONTROLLED DECELERATION, LOSS OF POWER, AND LOSS OF STEERING. THIS WAS WHILE DRIVING ON A STRAIGHT ROAD, AND NO SURFACE IMPEDIMENTS SUCH AS RAIN, SNOW, SLEET, ECT..    THE ISSUE WAS \"STABILITRAK! AS A 30 YEAR, CAREER LAW ENFORCEMENT OFFICER WHO INVESTIGATED THOUSANDS OF ACCIDENTS, THIS WAS A VERY DANGEROUS SITUATION AND MY FAMILY AND I ARE VERY LUCKY TO BE ALIVE. I ALSO FOUND THERE IS A LONG HISTORY OF THIS GOING BACK TO AT LEAST 2010.   THIS SAME VEHICLE HAS HAD THE REAR A/C FIXED 4 TIMES AND MYLINK SYSTEM FIXED 2X.",
        "vin": "1GNKRLKD6DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WHEN MY CHECK ENGINE LIGHT CAME ON. I GOT AN ERROR MESSAGE FOR LOSS OF TRACTION CONTROL AND SERVICE STABILITRACK. ADDITIONAL MESSAGE, ENGINE POWER REDUCED BUT WAS STILL ABLE TO DRIVE BUT AT A DECREASED SPEED.  I WAS ABLE TO INCREASE SPEED BY USING RPM GAUGE AND SHIFTING TRANSMISSION BY PRESSING AND RELEASING ACCELARATOR TO SIMULATE MANUAL SHIFTING. I EVENTUALLY PULLED OVER OFF THE ROAD, TURNED OFF THE ENGINE AND RESTARTED. EVERYTHING APPEARED TO RETURN TO NORMAL UNTIL IT HAPPENED AGAIN THE FOLLOWING DAY WHILE DRIVING OUT OF MY DRIVEWAY. GOT AN OBD SCAN AND CODES WERE P2122 AND P2138.  ADVISED THIS WAS A RECALL IN THE 2010 MODEL- HOW IS IT STILL HAPPENING IN MODELS THREE YEARS LATER? DOESN'T APPEAR IT WAS SUCCESSFULLY RESOLVED AND NOT A COVERED REPAIR THAT IS SEVERAL HUNDRED DOLLARS. THIS IS A POTENTIALLY DANGEROUS EVENT AND CAN CAUSE AN ACCIDENT OR DEATH.",
        "vin": "1GNKVGKD7DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "11/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE STARTING THE VEHICLE, THE AIR BAG WARNING LIGHT ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 14V118000 (AIR BAGS). THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 37,000.",
        "vin": "1GNKRJKD0DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR TURNED ITSELF OFF WHILE DRIVING 55 MPH ON HIGHWAY WITH MY CHILDREN IN THE CAR.  TRAVERSE RANDOMLY SWITCHES BETWEEN CD AND RADIO BY ITSELF. TRACTION CONTROL WARNING SOUNDS RANDOMLY.  SOMETIMES WHEN KEY IS TURNED OFF ALL GOES BLACK ON DASH WITHOUT OPENING THE DOOR. THERE IS NO PATTERN TO ANY OF THIS.  ALWAYS TOTALLY RANDOM.  I HAVE STARTED PRESSING RECORD ON MY PHONE BEFORE EVERY TIME I START MY CAR FOR THE POSSIBILITY THAT I WILL CATCH ONE OF THE RANDOM INSTANCES ON CAMERA.  DEALERSHIP HAS REPLACED MY RADIO FOCUSING ON IT AND IGNORING MY TRACTION CONTROL ISSUE AND POWER LOSS.  SINCE THESE ISSUES CANNOT BE TRIGGERED AND ARE COMPLETELY RANDOM I HAD TO CATCH MY RADIO FREEZING UP ON VIDEO TO GET DEALER TO BELIEVE MY ACCUSATIONS.  MY CAR HAS BEEN \"REPROGRAMMED\" TWICE, NEW RADIO INSTALLED, REPAIRED INFORMATION BUTTONS ONCE, THEN INFORMATION BUTTONS REPLACED AND EACH TIME TELLING ME THAT ITS ALL FIXED NOW.  WELL, I NOW HAVE VIDEO THAT PROVES DIFFERENTLY.  SO WHEN IS THE NEXT TIME MY CAR IS GOING TO SHUT OFF?  WILL MY CHILDREN BE WITH ME OR WILL IT ONLY BE A RISK OF THEM LOSING THEIR MOTHER??",
        "vin": "1GNKVJKDXDJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2015",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE STARTED FLUCTUATING AT FIRST AFTER GOING FROM DRIVE TO PARK.  THE FUEL GAUGE READING WOULD BE OFF ANYWHERE FROM 1/8 TO 1/4 OF A TANK.  THE FIRST PROBLEMS WERE THE GAUGE UNDERCOMPENSATING FOR THE ACTUAL FUEL IN THE TANK, THEN OVERCOMPENSATING, NOW IT GOES BACK AND FORTH. NOW THE PROBLEM IS NO LONGER LIMITED TO WHEN THE CAR IS IN PARK, I NEVER KNOW HOW MUCH FUEL I HAVE WHILE I AM DRIVING.  THIS IS A VERY SERIOUS AND POTENTIALLY DANGEROUS SITUATION.  IT IS AN ONGOING DAILY PROBLEM",
        "vin": "1GNKRJKD7DJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/31/2015",
        "dateOfIncident": "10/22/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IDLING AT A STOP LIGHT WHEN MY CHECK ENGINE LIGHT CAME ON. I GOT AN ERROR MESSAGE FOR LOSS OF TRACTION CONTROL AND STABILITRACK. MY ENGINE THEN COMPLETELY LOST POWER. I TURNED OFF THE ENGINE AND RESTARTED. MY CAR GOT ME THROUGH THE INTERSECTION WHEN IT IMMEDIATELY HAPPENED AGAIN. THIS WAS A RECALL IN THE 2010 MODEL- HOW IS IT STILL HAPPENING IN MODELS THREE YEARS LATER?",
        "vin": "1GNKVJKD1DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE, POWER TO THE ENGINE DIMINISHED, TRACTION CONTROL AND STABILITY CONTROL WARNING INDICATORS ILLUMINATED. THE VEHICLE RESTARTED AFTER THE VEHICLE WAS PARKED FOR APPROXIMATELY TEN MINUTES AND THE CHECK ENGINE WARNING INDICATOR WAS STILL ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED ON THREE OTHER OCCASIONS AND WAS TAKEN TO THE DEALER EACH TIME. THE VEHICLE WAS DIAGNOSED ON THE THIRD VISIT WITH AN UNKNOWN DIAGNOSIS AND WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "09/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10775485,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WENT TO PARK CAR IN DRIVEWAY BETWEEN GARAGE & STREET AND WHEN EXITING THE CAR, THE CAR BEGAN TO ROLL BACKWARDS. SHE TRIED TO GET BACK INTO CAR AS 2 GRAND KIDS WERE IN THE BACK SEAT. AFTER SEVERAL ATTEMPTS TO GET IN, THE CAR DOOR KNOCKED HER DOWN & THE CAR CONTINUED TO ROLL INTO STREET UP ON NEIGHBORS FRONT LAWN ACROSS THE STREET. SHE WAS KNOCKED UNCONSCIOUS AND SUFFERED BRUISES UP & DOWN HER RIGHT SIDE  WHEN I RETRIEVED THE CAR, FOUND IT IN \"PARK\" & ENGINE WAS TURNED OFF. KEYS WERE STILL IN IGNITION BUT IN OFF POSITION. DRIVEWAY HAS A SLIGHT DOWNGRADE BUT NOT WHAT I CONSIDER SIGNIFICANT.    NEIGHBOR HAD OUTSIDE CAMERA WITH AUDIO BUT DID NOT HAVE VEHICLE IN PICTURE. IT DID HAVE AUDIO OF CAR GOING CLICK, CLICK, CLICK, CLICK, CLICK, ETC. AS IT ROLLED BACKWARDS TILL IT CAME TO A STOP.    VERY FORTUNATE IT DID NOT COLLIDE WITH ANYTHING BEHIND IT OR ANY TRAFFIC CROSSING STREET AS WOULD HAVE BEEN DISASTROUS. WIFE WAS TAKEN TO HOSPITAL AND REQUIRED FOLLOW-UP VISITS WITH SPECIALIST & ALSO HAD A RETURN VISIT TO HOSPITAL WITH COMPLICATIONS FROM HER CONCUSSION.    DEALER FOUND INTERMITTENT BINDING IN PARK PAWL LINKAGE AND ADJUSTED SHIFTER CABLE FIRST. COULD NOT DUPLICATE PROBLEM. FURTHER DISCUSSION WITH GM WERE INSTRUCTED TO REPLACE PARK PAWL AND COMPARTS INCLUDING LINK ARM W/SPRING.    DID FIND RECALL ON 2014 CHEVROLET TRAVERSE MATCHING DESCRIPTION OF MY EXPERIENCE WITH TRANSMISSION NOT ENGAGING IN \"PARK\" & ROLLING. INTERESTING THAT THE 2013 WAS THE YEAR THE TRAVERSE WAS REDESIGNED.",
        "vin": "1GNKRFKD7DJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "07/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND COMPLAINT I AM FILING, I HAVE A 2013 CHEVY TRAVERSE WITH FORTERA HL P255/65R18 109 TIRES, THE FIRST SET HAD MAJOR CRACKING THAT RAN ALONG THE INSIDE FIRST RIB AND LAST OUTSIDE RIB ALONG THE TREAD, WITH CRACKS THAT RAN HORIZONTAL TO THE WEAR INDICATORS, THE LAST TIME I CHECK THE CRACKS WAS ABOUT 4 MM LONG, THIS AFFECTED ALL FOUR TIRES. I CONTACTED THE DEALERSHIP, TOOK THE VEHICLE TO THE DEALERSHIP AND GOODYEAR MADE IT CLEAR AFTER TWO WEEKS  THE ISSUE WE HAD WAS FROM \"OZONE CRACKING\" EVEN THOUGH THE TIRES ONLY HAD 22,000 PLUS MILES ON THEM AND REFUSED TO REPLACE UNDER THE RECALL, INSTEAD CHARGING ME A $389.00 PRORATED FEE FOR NEW TIRES OF THE EXACT SIZE, NAME AND QUALITY.   ON 02 JULY, WHILE OUT MAKING PAYMENTS AND BUYING FOOD I NOTICED A VERY STRONG RUBBER SMELL, I CAME HOME AND THE SMELL HAD INCREASED TO THAT OF A RUBBER BURNING SMELL, I TOUCHED THE TIRES AND THEY WAS SO HOT I COULD NOT LEAVE MY HAND ON THE TREAD. I NOTICED THAT ONE TIRE HAD/HAS A BLUE GREEN COLOR TO IT FROM THE RIM TO THE MIDDLE JUST BELOW THE WORDS GOODYEAR, I ALSO NOTICED THAT THERE APPEARS TO BE WHAT LOOKS LIKE WEAR FROM THE TREAD LINE DOWN TO JUST BELOW THE WORDS GOODYEAR WHERE IT LOOKS LIKE THE TIRE IS RIDING ON THE ROAD ON THE SIDE WALL, OR AS I DESCRIBED IT TO BOTH GOODYEAR AND THE DEALERSHIP IT LOOKS LIKE THEY ARE RAN AGAINST A CURB, OF WHICH WE HAVE NO CURBS IN OUR BLOCK. THESE TIRES ALSO DO NOT MAINTAIN AIR PRESSURE,",
        "vin": "1GNKVGKD7DJ"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 CHEVY TRAVERSE THAT HAS MASSIVE CRACKING AROUND THE WHOLE TIRE BOTH ON THE INSIDE 1ST RIB AND THE OUTSIDE RIB, I FOUND CRACKS RUNNING ACROSS THE WEAR INDICATORS, I NOTIFIED THE DEALERSHIP WHO AFTER FINDING A RECALL  (THE RECALL WAS FOR YEARS NOV 14 TO JAN 15)  AGREED THE DESCRIPTION GIVEN BY GOODYEAR FOR THESE TIRES (P255/65R18 1095 FORTERA HL) ASKED FOR THE CAR SO THEY COULD REPLACE THE TIRES. AS OF YESTERDAY GOODYEAR CLAIMS ALL THE ISSUES ARE FROM OZONE CRACKING AND THEY ARE NOT LIABLE FOR THIS, EVEN THOUGH BY DEFINITATION THIS OCCURS ON THE OUTSIDE SIDEWALL NOT THE INSIDE OF THE TREAD OR ACROSS THE WEAR INDICATORS, I HAVE REPEADEDLY ASKED ABOUT THE 6 YEAR WARRENTY THAT IS SUPPOSE TO BE ON THESE AND STILL HAVE NO REPLY, I DO KNOW THERE ARE MULTIPLE COMPLAINTS FILED AGAINST THIS SPECIFIC TIRE FROM 2012 FORWARD FOR THE SAME ISSUE AND EXTREME TREAD WEAR. WITH THE CRACKS RUNNING THE FULL LENTH OF THE TREAD ON THE INSIDE AND THE CRACKS ACROSS THE WEAR INDICATORS THIS CREATES A MASSIVE DANGER IN TIRE SEPERATION OR BLOW OUTS AT HIGH SPEEDS ESPECIALLY IN THE SUMMER.",
        "vin": "1GNKVGKD7DJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/01/2015",
        "dateOfIncident": "04/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT ROUGHLY 55MPH THE VEHICLE STARTED BEEPING. THE CAR CONTROLS BEGAN TO BECOME HARD TO STEER AND WITHOUT WARNING THE SPEED IN SECONDS SLOWED TO 15-20 MPH.   THE DASH STARTS REPORTING THE FOLLOWING INFORMATION:ENGINE POWER REDUCES  SERVICE STABILITRAK   TRACTION CONTROL OFF  I PULL OVER SHUT OFF THE CAR AND EVENTUALLY THE DEALER SAYS IT WILL GO AWAY. ITS A NON ISSUE. THEN IT HAPPENS AGAIN AND AGAIN OVER AND OVER AGAIN. THE CODE EVERY TIME IS P2138. THE SERVICE DEPARTMENT EVEN THINKS AN EXISTING TSB IS THE ISSUE 11273 BUT SINCE MY CAR ISNT LISTED ON IT.  *TR",
        "vin": "1GNKRJKDXDJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "02/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR FOR SERVICE ON 2/20/2015 AND THE NEXT DAY THE SERVICE AIRBAG LIGHTS CAME ON STAYED ON EVEN AFTER I TURNED THE CAR OFF AND BACK ON. THE NEXT DAY IT DIDN'T COME BACK ON  THE FOLLOWING DAY WHICH WAS 2/22/2015 IT CAME ON AND AGAIN AND STAYED ALL DAY. ON 2/23/2015 DIDN'T COME ON AT ALL THEN CAME BACK ON AGAIN ON 02/24/2015 AND REMAINED ON UNTIL I WROTE THIS COMPLAINT. I CALLED MY DEALER AND THEY GAVE ME AN APPOINTMENT FOR 2 WEEKS ON 3/12/2015 IF SOMETHING IS WRONG WITH THE AIRBAG I'M NOT SAFE AND MY WARRANTY MAY NO LONGER COVER IT AT THAT TIME BEING THIS IS MY ONLY MEANS OF TRANSPORTATION.   *JS",
        "vin": "1GNKVJKD5DJ"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "02/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681699,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THIS 2013 TRAVERSE, IT LOST ALL POWER WITH THE STABILINK AND TRACTION CONTROL WARNING LIGHTS BEING ACTIVATED IN THE MESSAGE CENTER. THEN THE 2013 TRAVERSE LOST POWER WITH THE CHECK ENGINE LIGHT ILLUMINATING, WHEN THIS OCCURRED THE TRAVERSE IMMEDIATELY SLOWED FROM 55 MPH TO 15 MPH CAUSING A REAR END COLLISION. ALL MY ONLINE RESEARCH IN DIFFERENT FORUMS DISPLAYS NUMEROUS OTHERS INCIDENTS OF THIS SAME STABILINK/TRACTION CONTROL ISSUE. IT DOES NOT APPEAR TO BE A SAFE DESIGN AND A RECALL SHOULD BE ANNOUNCED BEFORE SOMEONE IS SERIOUSLY INJURED.    *JS",
        "vin": "1GNKVFKD6DJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2014",
        "dateOfIncident": "12/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAG SIGNS CAME ON WHEN VEHICLE IS STARTED FROM COLD FOR THE FIRST TIME IN THE MORNING.  IT ALSO HAPPENED ON 12/06/2014 AND 12/11/2014. I TOOK IT TO DEALERSHIP AND THEY REPLACED N-TENSIONER KIT ON 12/12/2014. THIS MORNING \"SERVICE AIR BAG\" SIGN CAME ON AGAIN AS SOON AS I STARTED THE CAR. THE SIGN STAYED ON TILL AT LEAST 30 MINUTES.  *TR",
        "vin": "1GNKVGKD5DJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654379,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CHEVROLET TRAVERSE. CONSUMER IS DISSATISFIED WITH THE APPEARANCE OF THE COMPLETED RECALL WORK. *SS  THE CONSUMER STATED THERE IS A FOUR TO SIX INCHE OF BLACK CABLE WITH SHRINK WRAP EXPOSED IN THE AREA OF THE SEAT ON BOTH SIDES OF THE VEHICLE. *JB",
        "vin": "1GNKRLKD6DJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE SHOWS 3/8 OF A TANK AND COMPUTER SHOWS 175 MILES TO EMPTY AND IT RUNS OUT OF GAS.  *TR",
        "vin": "1GNKRFED7DJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654492,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HI THERE;    I AM TALL - ABOUT 6' 5\".  THE DRIVER AND PASSENGER SEAT BELTS, DO NOT FULLY CROSS MY SHOULDER, RATHER THEY ARE CROSSING MY \"OUTER\" SHOULDER/UPPER ARM.  THE \"B\" PILLAR IS ALMOST FORWARD OF ME.  THE SEAT-BELT HEIGHT ADJUSTMENT IS FULLY RAISED.  I FEEL QUITE UNCOMFORTABLE AND WONDER IF THIS SHOULD BE A CONCERN TO ME (I THINK IT IS!) IN THE EVENT OF A COLLISION; I FEEL THAT IN A SUDDEN STOP, LET ALONE A SIDE-IMPACT, I MAY AS WELL HAVE A LAP BELT ONLY!!    PLEASE TELL ME I AM IMAGINING THIS AND THAT NHTSA HAS APPROVED THIS CONFIGURATION!!    THANKS.  *TR",
        "vin": "1GNKRLKD1DJ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/07/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10653500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE STALLED SEVERAL TIMES. THE VEHICLE WAS NOT ABLE TO BE RESTARTED. ALSO, THE CONTACT MENTIONED THAT THE RADIO FAILED SEVERAL TIMES AND THE SENSORS AND GAUGES INTERMITTENTLY FLICKERED. IN ADDITION, THE CONTACT STATED THAT WHILE TRAVELING 25 MPH ATTEMPTING TO AVOID DOG, THE CONTACT SWERVED TO THE RIGHT AND CRASHED INTO ANOTHER VEHICLE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE BACK AND LEGS. THE CONTACT DID NOT SEEK MEDICAL ATTENTION. THE CONTACT INDICATED THAT THE STEERING WHEEL LOCKED AND THE IGNITION SWITCH WOULD NOT TURN OVER. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GNKRFED2DJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE REGISTERED FUEL BUT VEHICLE STALLED OUT DUE TO LACK OF FUEL.  *TR",
        "vin": "1GNKRJKD2DJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. WHILE DRIVING 25 MPH, THE LOW FUEL INDICATOR ILLUMINATED AND THE VEHICLE STALLED. THE FUEL GAUGE DISPLAYED THE INCORRECT AMOUNT OF FUEL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "1GNKRJKD2DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2014",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY FAILED TO RECHARGE, THE VEHICLE COMPLETELY SHUT DOWN (ELECTRICALLY SPEAKING). MY WIFE AND 2 KIDS WERE STUCK IN A CAR WITH NO AC, NO ABILITY TO RECHARGE HER CELL PHONE TO CALL FOR HELP, ON A HOT 100F DAY. THANKFULLY, SHE WAS ABLE TO CALL A TOW TRUCK. AFTER 2 DAYS IN THE SHOP AT RON BAKER CHEVY IN SAN DIEGO, IT WAS DISCOVERED THAT THE ALTERNATOR WAS FAULTY. BOTH THE ALTERNATOR AND THE BATTERY WERE REPLACED.  *TR",
        "vin": "1GNKRGKD3DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT AIR CONDITIONING/HEATING MODULE CONTROLS GET EXTREMELY HOT WHENEVER THE HEADLIGHTS ARE ON OR WHENEVER THE REAR UNIT IS IN USE.  THE CONTROLS FOR THE AIR CONDITIONING/HEATING UNIT ON THE DASH NEVER GET HOT.  I TOOK THE VEHICLE INTO THE DEALER TODAY TO HAVE THEM CHECK THE PROBLEM.  I WAS TOLD THEY CHECKED ALL THE WIRING AND EVERYTHING WAS AS IT'S SUPPOSE TO BE.  SO, THEY CHECKED THE SAME UNIT IN ANOTHER TRAVERSE AND FOUND THE CONTROLS IN THAT VEHICLE GOT HOT AS WELL.  I WAS TOLD THAT IS JUST THE WAY THE VEHICLES ARE.  THE FACT THAT THE CONTROLS GET HOT AT ALL, WOULD INDICATE EITHER IMPROPER GAUGE OF WIRING OR SWITCHES THAT CAN'T HANDLE THE ELECTRICAL CURRENT.  IF WHAT I SUSPECT IS TRUE, THERE IS A POSSIBILITY OF DAMAGE TO THE UNIT, FIRE OR INJURY TO OCCUPANTS OF THE VEHICLE.    *TR",
        "vin": "1GNKRGKD7DJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS NOW OCCURRED TWICE WITHIN THE PAST 30 DAYS. WHILE IN MOTION, THE VEHICLE TRANSMISSIONS JERKS, AND SPEED IS IMMEDIATELY REDUCED TO 5MPH. THE STABILITY CONTROL LIGHT COMES ON AS DOES THE CHECK ENGINE LIGHT. A REMOTE DIAGNOSTICS SCAN FROM ON-STAR IDENTIFIED 3 ERROR CODES: C0561, P0700, P182E. THE FIRST TIME IT OCCURRED WHILE EXITING A HIGHWAY OFF-RAMP. THIS VEHICLE WAS TAKEN TO THE DEALERSHIP. THE DEALERSHIP INFORMED ME THAT THERE WERE NO KNOW ISSUES RELATED TO THIS, NO RECALLS, AND NO SERVICE BULLETINS EXISTED DESCRIBING THIS BEHAVIOR FOR THE 2013 MODEL YEAR. THEY WERE UNABLE TO RECREATE THE PROBLEM AND RETURNED THE VEHICLE TO ME. THIS HAPPENED AGAIN YESTERDAY WHILE APPROACHING AN INTERSECTION AND SLOWING FROM ~35MPH WITH TRAFFIC CLOSE BEHIND. THIS IS AN EXTREMELY DANGEROUS SYSTEM BEHAVIOR WHICH COULD HAVE EASILY RESULTED IN A SEVERE INCIDENT IN A DANGEROUS INTERSECTION. WHILE THE VEHICLE IS IN THE STATE WHERE THE STABILITY CONTROL LIGHT IS ON WE OBSERVED HARD TRANSMISSION SHIFTING/JERKING INTO AND OUT OF PARK, REVERSE, NEUTRAL, AND DRIVE. WE TURNED THE VEHICLE OFF FOR 15 MINUTES. UPON RESTARTING, NORMAL OPERATIONS WERE RESTORED WITH THE EXCEPTION OF THE CHECK ENGINE LIGHT. THE CHECK ENGINE LIGHT TURNED OFF AFTER ~25-30 MILES OF DRIVING.  *TR",
        "vin": "1GNKRGKD6DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE SERVICE DEPARTMENT OF EAST HILLS CHEVROLET TO RESPOND TO THE 2 RECALLS THEY HAD ON MY CAR.  THEY FOUND SOMETHING ELSE WITH THE CAR AND PROCEEDED TO FIX THAT.  AFTER GETTING THE CAR BACK, IT HAS A NEW ISSUE....IT PERIODICALLY SHORTS OUT WHILE I AM DRIVING IT.  I SEEMS LIKE IT STALLS, ALL THE LIGHTS ON THE DASHBOARD COME ON, BUT THEN IT RECOVERS AND CONTINUES DRIVING.  I HAVE THREE CHILDREN AND AM NERVOUS ABOUT DRIVING THIS CAR.  IN ADDITION, THE RADIO WILL TURN OFF AND ON FOR NO REASON AND THE DOORS WILL LOCK AND UNLOCK BY THEMSELVES.  MY CAR DID NOT HAVE THIS ISSUE BEFORE SERVICE.    I RESPONDED TO THE DEALER SURVEY AND EMAILED THEM ABOUT THIS NEW PROBLEM -- NO RESPONSE.  *TR",
        "vin": "1GNKVFKDXDJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/07/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL WAS PERFORMED, BUT THE PART WAS REPLACED WITH A NON COLOR MATCHING INTERIOR  BLACK HOSE OVER THE CABLE. THIS HOSE, WHICH IS NOT PROTECTED, WILL GET BRITTLE AND CRACK OVER TIME TO EXPOSE THE CABLES, WHICH WILL CAUSE THE CABLE TO RUST. ALSO, CHILDREN WILL BE ABLE TO PLAY WITH IT CAUSING DAMAGE. PETS WILL BE ABLE TO CHEW, SCRATCH OR TEAR IT. I CAN FORESEE ANOTHER RECALL ON THIS ISSUE.  *TR",
        "vin": "1GNKRJKD5DJ"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON A HIGHWAY I STEPPED ON THE ACCELERATOR AND THE CAR DID NOT RESPOND AND CAME TO A SUDDEN STOP IN THE MIDDLE OF THE HIGHWAY.  I HAD NO WARNING AND NO ABILITY TO PULL OFF TO THE SIDE OF THE ROAD.  I COULD NOT RESTART THE CAR AND I HAD NO POWER STEERING OR BRAKES.  I HAD MY CAR TOWED TO THE LOCAL GM DEALERSHIP AND THEY FOUND THAT A PIECE IN THE ENGINE HAD FALLEN OR BROKEN AND DAMAGED THE PISTON, THE CYLINDER AND THE HEAD OF THE ENGINE.  AS THE MECHANIC SAID, IT WAS A \"CATASTROPHIC ENGINE FAILURE.\"   THEY REPLACED THE ENGINE IN THE CAR AND THEN ONE DAY LATER, AFTER HAVING THE CAR AT THE DEALERSHIP FOR 32 DAYS, THE CHECK ENGINE LIGHT WENT ON.  I TOOK THE CAR BACK TO THE DEALERSHIP AND THEY FOUND THAT THE OXYGEN SENSOR WAS NOT WORKING AND THEY REPLACED IT.  GM TOLD ME THAT THE PIECE THAT FELL HAD NOT BEEN TIGHTENED PROPERLY AND THIS WAS MISSED ON THE FINAL INSPECTION.  NOT ONLY AM I CONCERNED BY HAVING HAD THIS FRIGHTENING EXPERIENCE HAPPEN ON THE HIGHWAY, MOREOVER IN A NEW CAR, BUT THE SUDDEN STOPPING OF THE CAR WHILE DRIVING IS THE SAME THING THAT HAS HAPPENED TO THE CARS THAT HAVE RECENTLY BEEN RECALLED BY GM.   I GOT THIS CAR BECAUSE OF ITS GOOD SAFETY PROFILE HOWEVER NOW I DO NOT FEEL SAFE AND SECURE DRIVING THIS CAR.  *TR",
        "vin": "1GNKVGKD4DJ"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2014",
        "dateOfIncident": "02/06/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SNOW OF ALMOST ANY DEPTH, THE VEHICLE WILL SHAKE VIOLENTLY ON ACCELERATION FROM 35 MPH UP. THE TRANSMISSION WILL NOT ACCELERATE AND FEELS LIKE ITS BOGGING DOWN. IT WILL STAY LIKE THIS FOR SOMETIME HOURS THEN IT WILL CEASE. FENDER WELLS ARE CLEAR OF DEBRIS. THE PROBLEM IS IT WILL DO THIS SOMETIMES AT WILL ON THE ROADWAY WHERE I HAVE BEEN ALMOST REAR ENDED TRYING TO GET UP TO SPEED, THERE ARE MULTIPLE COMPLAINTS ON THE CHEVY TRAVERSE FORUM WEBSITE. SOMEONE IS GOING TO GET SERIOUSLY HURT OR DIE.   *TR",
        "vin": "1GNKRGED8CJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "07/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WAS SURGING AND ABRUPTLY SHIFTING FROM SECOND TO THIRD GEAR AND AGAIN FROM FIFTH TO SIXTH GEAR. THE MORE IT WAS DRIVEN THE WORSE IT WAS GETTING. BROUGHT IT TO THE DEALER AND THE TRANSMISSION NEEDED TO BE REPAIRED. WAVE PLATE AND PISTONS AND SEALS GEARS 3, 5 AND REVERSE WERE ALL REPLACED.  THE TRANSMISSION TECH AT THE DEALERSHIP SAID WHEN HE OPENED IT UP THERE WAS METAL PARTS FALLING OUT. AFTER RESEARCHING THIS PROBLEM I FOUND 5 OTHERS THAT HAD THE SAME PROBLEM. THE WAVE PLATE IS BREAKING APART INSIDE THE TRANSMISSION. I EXPECT TO SEE A RECALL ON THIS TRANSMISSION AS MORE PEOPLE HAVE THIS PROBLEM.   *TR",
        "vin": "1GNKVGKD1DJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/06/2013",
        "dateOfIncident": "03/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510789,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE GLOBAL POSITIONING NAVIGATIONAL SYSTEM WAS DIFFICULT TO READ BECAUSE THE FONT WAS ENTIRELY TOO SMALL.  THE NAVIGATIONAL SYSTEM ALSO EXHIBITED WHITE LETTERING ON A LIGHT GREEN BACKGROUND, WHICH DID NOT PROVIDE ENOUGH CONTRAST.  THE LOCATION OF THE SCREEN WAS ABNORMALLY LOW ON THE DASHBOARD AND CAUSED THE CONTACT TO REMOVE SIGHT FROM THE ROADWAY FOR A LONGER PERIOD OF TIME. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM, HOWEVER THEY STATED THAT THE NAVIGATIONAL SYSTEM WAS OPERATING AS DESIGNED. THE FAILURE MILEAGE WAS 500. THE CURRENT MILEAGE WAS 1500.   UPDATED 06/07/13*LJ",
        "vin": "1GNKRLKD2DJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING, NO LEAKS, NO NOISES.... AT 55 MPH WHEN I STARTED TO DECREASE MY SPEED TO TAKE A CURVE I LOST MY POWER STEERING. THIS COMES AND GOES WITHOUT WARNING AND IS VERY DANGEROUS FOR ANYONE DRIVING A TRAVERSE!! I JUST BOUGHT THIS USED VEHICLE ON MAR 6, 2013 AND NO SIGNS OF ANY PROBLEMS AND THEN THE POWER STEERING FAILS. WHEN YOU TRY TO TURN INTO PARKING LOTS OR ONTO A SIDE STREET IT JUST HITS AND YOU LOSE ALL POWER STEERING MAKING IT VERY DANGEROUS FOR ALL PERSON(S) IN OR NEAR THE VEHICLE.    WE WERE TOLD BY VARIOUS MECHANICS IN THE SURROUNDING AREA THAT THIS IS A \"KNOWN\" DESIGN FLAW AND PROBLEM IN THESE VEHICLES AND YET GM HAS YET TO DO ANYTHING ABOUT THIS!! THERE IS A MULTITUDE OF COMPLAINTS REGARDING THIS EXACT SAME ISSUE THE IS SCATTERED ALL OVER THE INTERNET WITH POWER STEERING ISSUES!! GM SHOULD BE REQUIRED TO ISSUE A RECALL IMMEDIATELY BEFORE ITS TOO LATE AND SOMEONE GETS KILLED AND CLASS ACTION LAWSUITS ARE FILED!!  *TR",
        "vin": "1GNLVFED9AS"
    }
]