[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "02/19/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956223,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "MIRADA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SWAY ARM MOUNTS: WHILE PERFORMING A PRE-FLIGHT OF THE VEHICLE BEFORE A FAMILY TRIP, A METAL COMPONENT WAS NOTICED HANGING UNDERNEATH THE REAR OF THE VEHICLE. UPON FURTHER INSPECTION IT WAS NOTED THAT THE DRIVERS SIDE REAR CLAMP THAT HOLDS THE REAR SWAY BAR URETHANE BUSHING IN PLACE TO THE AXLE WAS FRACTURED AND HANGING LOOSE FROM THE LOWER MOUNT. THE UPPER AND LOWER BOLTS WERE STILL IN PLACE, BUT THE ASSEMBLY/METAL HAD FRACTURED 3/4 OF THE WAY UP THE CLAMP. THIS PLACED THE SWAY BAR / STABILIZER BAR IN AN UNSECURED SITUATION ON THE DRIVERS SIDE OF THE VEHICLE. THE VEHICLE WAS PARKED IN A RESIDENTIAL DRIVE WAY BEING LOADED IN PREPARATION FOR A FAMILY CAMPING TRIP. THE FRACTURE SURFACE HAD DISCOLORATION AND A LARGE RUST SPOT WHICH PERMEATED THE WIDTH OF THE FRACTURE. THE LOWER RESTRAINING BOLT WAS FOUND TO BE SEVERAL THREADS LOOSENED AND THE FIRST SEVERAL THREADS BELOW THE HEAD WERE ROUNDED. THE URETHANE BUSHING APPEARS TO BE DAMAGED FROM THE METAL COMPONENT UNSECURED MOVEMENT, AND IT IS UNKNOWN WHAT ADDITIONAL STRESSES THIS PLACED ON THE DOWN COMERS. THE LOCAL FORD DEALER IS BEING CONTACTED FOR REPLACEMENT/REPAIR AND THE VEHICLE WAS RETURNED TO STORAGE UNTIL REPAIRS CAN BE COMPLETED. THIS IS A FORD F53 CHASSIS WITH FACTORY FRAME EXTENSIONS TO SUPPORT THE RECREATIONAL VEHICLE STRUCTURE.",
        "vin": "1F66F5DY2D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "01/06/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839804,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "MIRADA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COACHMEN RECALL  RECEIVED A LETTER ON JANUARY 6, 2016 FOR A RECALL ON STRUCTURAL FAILURE OF THE CENTER BOLT ON GEAR ASSEMBLY TO DISENGAGE FROM STEPS. LETTER LISTED 11 PARTS. CALLED THE DEALER AND THEY DO NOT HAVE ANY UPDATES HOWEVER I AM FIRST ON THEIR LIST WHEN REPAIRS ARE READY. STILL HAVE NOT HEARD FROM THE MANUFACTURE. CALLED THE NHTSA REFERENCE #930694.",
        "vin": "1F66F5DY6D0"
    }
]