[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2017",
        "dateOfIncident": "09/26/2017",
        "fire": false,
        "manufacturer": "DS Corp - DBA Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031793,
        "products": [
            {
                "manufacturer": "DS Corp - DBA Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "SUNSET TRAIL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC STABILIZING JACKS EXTEND ON THEIR OWN.  THEY EXTEND WHILE SITTING STILL AS WELL AS DRIVING.  THE MANUAL ELECTRIC SWITCH WILL NOT ENGAGE TO RETRACT THEM UNTIL THEY HAVE FULLY EXTENDED.  WHILE WE WERE DRIVING THIS HAPPENED SEVERAL TIMES AND ONE TIME ALMOST CAUSED US TO HAVE AN ACCIDENT.  I SAW THEM IN THE TRUCK MIRROR AND ALERTED MY HUSBAND WE HAD TO PULL OVER IMMEDIATELY AS THEY WOULD NOT STOP EXTENDING.  BY THE TIME WE PULLED OVER, THEY WERE FULLY EXTENDED AND EVEN JACKED UP THE BACK OF OUR TRUCK.  IT DUG THE FOOT OF THE JACK INTO THE ASPHALT TO WHERE WE HAD TO USE A LARGE 3 TON JACK TO \"JACK' UP THE TRAILER ENOUGH TO DISLODGE THE FOOT FROM THE ASPHALT.  WE THEN MANUALLY RETRACED THE JACKS AND HAD TO \"C-CLAMP\" THEM IN ORDER TO ENSURE THEY WOULD NOT EXTENDED AGAIN WHILE DRIVING SO THAT WE COULD RUN IT TO THE SHOP.  THE SHOP THOUGHT THEY HAD FIXED THEM BY REPLACING THE SWITCHES, BUT AS WE WERE DRIVING HOME, REMIND YOU-WE WERE DRIVING...THEY EXTENDED AGAIN CAUSING A SAFETY ISSUE. WE HAD TO REMOVE THE ELECTRIC WIRE SO THAT NO ELECTRICITY COULD GO THROUGH THEM IN ORDER TO GET BACK TO THE SHOP.  I HAVE READ THIS TO BE AN ISSUE WITH MANY PEOPLE WHO OWN THE CROSSROADS SUNSET TRAIL.  THERE SHOULD BE A RECALL ON THESE TRAVEL TRAILERS THAT HAVE THE ELECTRIC STABILIZING JACKS.  ALSO, WHILE THE TRAILER WAS PARKED IN OUR DRIVEWAY....TWO TIMES IN A WEEK THEY EXTENDED ON THEIR OWN LEAVING THE FRONT OF OUR TRAILER FULLY OFF THE GROUND.  IF WE DID NOT HAVE TIRE BRAKES BETWEEN OUR TIRES, IT WOULD HAVE ROLLED INTO OUR HOME DUE TO THE GRADE OF THE DRIVE.",
        "vin": "4VOTC302DB0"
    }
]