[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451119,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Chrysler 300C. The contact stated that the plastic handle on the oil dipstick fractured.  Additionally, part of the dipstick was stuck in the tube. The contact was unable to check the oil level. The contact was concerned about a possible fire. The vehicle was taken to the local dealer but, the vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure however, no further assistance was provided. The approximate failure mileage was 28,412.",
        "vin": "2C3CCAET0DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "04/02/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR CAUGHT ON FIRE WHILE DRIVING HOME. PRIOR TO THIS INCIDENT, THREE DAYS BEFORE FIRE HAPPENED MY CAR KEPT OVERHEATING, BUT IF I WAS ON THE FREEWAY CAR WOULDN'T OVERHEAT. GOT HOME AND CAR WOULD NOT SHUT OFF. MY SON RAN OVER TO THE CAR AND TOLD ME TO DISCONNECT BATTERY CABLES CUZ CAR WAS ON FIRE AND WOULDN'T SHUT OFF. SON OPENED THE HOOD AND SAW THE FIRE. HE COULDN'T PUT IT OUT. THEN IT JUST WENT OUT BY ITSELF. AFTER EXAMINING THE ENGINE COMPARTMENT FOUND THAT THE TIPM WAS ON FIRE. OPENED TIPM FUSE BOX AND SEVERAL RELAYS WERE MELTED. CALLED DEALERSHIP AND THEY ADVISED CALLING CORPORATE. I CALLED CORPORATE AND IT TOOK OVER A MONTH FOR THEM TO RESPOND. FIRST THEY SAID THEY WERE SENDING OUT AN INVESTIGATOR THAT NEVER SHOWED UP. AFTER 4 PHONE CALLS THEY CALLED ME BACK AND STATED THEY WOULDN'T FIX MY CAR. IT WOULD COST ME TO REPAIR THE CAR. MY CAR WAS ON FIRE WHILE I WAS DRIVING IT. CHRYSLER SAYS THEY TAKE ANY CAR FIRES VERY SERIOUSLY BUT I GUESS MINE WASN'T SERIOUS ENOUGH FOR THEM. I HAVE BEEN WALKING FOR MONTHS. MY NEXT STEP WILL HAVE TO BE SUING CHRYSLER CORPORATION.",
        "vin": "2C3CCAET9DH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218349,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT THE VEHICLE WOULD MOVE FORWARD EVEN AFTER IT WAS SHIFTED INTO THE PARK POSITION. IN ADDITION, THE VEHICLE WOULD NOT SHUT OFF WHEN THE PUSH BUTTON IGNITION WAS PRESSED. THE CONTACT HAD TO SHIFT BACK INTO DRIVE SEVERAL TIMES AND THEN PARK TO FINALLY GET THE ENGINE TO SHUT OFF. JEEP CHRYSLER DODGE RAM FIAT OF ONTARIO (1202 AUTO CENTER DR, ONTARIO, CA 91761, (909) 906-7097) STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE CONTACT WAS REFERRED TO NHTSA. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2C3CCAET5DH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195611,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE DRIVING 55 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS ABLE TO COAST TO THE SIDE OF THE ROAD AND THE CONTACT POWERED OFF THE ENGINE. THE VEHICLE FAILED TO RESTART AND WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS LATER TAKEN TO GRIFFIN MOTORS INC (LOCATED AT 1012 HOLLAND AVE, PHILADELPHIA, MS 39350, (601) 656-4244) WHERE IT WAS DIAGNOSED THAT CYLINDER NUMBER TWO FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS OUT OF WARRANTY. THE CONTACT WAS REFERRED TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 120,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195446,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT THE HEATING AND AIR CONDITIONING WERE MALFUNCTIONING AND A KNOCKING NOISE WAS HEARD. THE FAILURES CONSTANTLY DRAINED THE BATTERY. MARK'S CASA CHRYSLER JEEP (9733 COORS BLVD NW, ALBUQUERQUE, NM 87114, (505) 897-8400) REPLACED THE OEM HVAC RE-CIRCULATION ACTUATOR, BUT THE FAILURE CONTINUED LESS THAN TWO YEARS LATER. THE CONTACT FELT THAT THE MANUFACTURER HAD NOT DEVELOPED A REMEDY SINCE THE SAME OEM PART WAS BEING USED TO REPAIR THE VEHICLE. THE VEHICLE WAS TAKEN TO MELLOY CHRYSLER DODGE JEEP RAM (357 EMILIO LOPEZ RD, LOS LUNAS, NM 87031, (888) 854-4533) WHERE IT WAS DIAGNOSED THAT THE HVAC RE-CIRCULATION ACTUATOR NEEDED TO BE REPLACED AGAIN. THE MANUFACTURER WAS NOTIFIED AND PROVIDED A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 52,687.",
        "vin": "2C3CCAETXDH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "C.E.L CAME ON WHEN CAR WAS TURNED ON AND WHEN TAKEN TO DEALERSHIP I WAS TOLD THE ESIM WAS BAD. COST ME $640.00 TO REPLACE THIS MODULE. ON A CAR THAT HAS LOW MILEAGE AND ISN'T THAT OLD I WOULD THINK THAT THIS REPAIR IS NOT NORMAL. I WAS TOLD HAD THIS NOT BEEN REPAIRED THE THE FUMES WOULD HAVE BUILT UP AND IF I WAS REAR ENDED THEN THIS COULD HAVE CAUSED AN EXPLOSION.",
        "vin": "2C3CCAKG2DH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11154428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNED A 2013 CHRYSLER 300C. THE CONTACT'S VEHICLE SKIDDED OFF THE ROAD AND CRASHED INTO SOME TREES. THE DRIVER AND PASSENGER SIDES OF THE VEHICLE WERE MANGLED AND THE REAR AXLE WAS TWISTED. THE VEHICLE WAS TOTALED. THE CONTACT'S SPOUSE, WHO WAS DRIVING, WAS INJURED AND TRANSPORTED TO THE HOSPITAL VIA AMBULANCE. NONE OF THE AIR BAGS DEPLOYED. THE VEHICLE WAS TOWED TO THE SALVAGE YARD. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. A POLICE REPORT WAS FILED. THE FAILURE MILEAGE WAS 51,000.",
        "vin": "2C3CCADG3DH"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152923,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MORE THAN 20 OCCASIONS, WHILE TRAVELING AT SPEEDS IN EXCESS OF 60 MPH, THE VEHICLE ABRUPTLY 'SHUTS OFF'. EVERYTHING IS COMPLETELY OFF. ENGINE, POWERTRAIN, POWER STEERING AND POWER BRAKES. SOMETIMES THERE'S A WARNING LIGHT THAT FLASHES AFTER THE SHUT DOWN THAT LOOKS LIKE A REDDISH ORANGE SIDEWAYS Z LIGHTING BOLT. THE CHECK ENGINE GOES ON SOMETIMES AND OTHER TIMES IT DOES NOT. WHEN IT GOES ON IT SOMETIMES STAYS ON AND SOMETIMES IT DISAPPEARS. I'VE HAD 2 CHRYSLER DEALERS AND 1 INDEPENDENT MECHANIC RUN DIAGNOSTICS AND NO ONE CAN PINPOINT THE PROBLEM. SO FAR, I'VE REPLACED THE THROTTLE BODY,  HANGED THE TRANSMISSION FLUID AND PAN, AND HAD THE FUEL SYSTEM CLEANED. I'M BEING TOLD THAT 'MAYBE' IT'S THE FUEL PUMP OR THE POWER TRAIN CONTROL MODULE. THE [XXX] HAS ONLY OCCURRED AT HIGHWAY SPEEDS SO FAR. THANKFULLY, I'VE BEEN ABLE TO PULL OFF ON THE SHOULDER EVERY TIME. THAT MAY BECAUSE I AVOID ROADS WITH NO SHOULDERS AND ONLY DRIVE IN THE RIGHT HAND LANE. THIS IS OBVIOUSLY A VERY DANGEROUS SITUATION AND HAS RENDERED THE VEHICLE UNSAFE FOR HIGHWAY DRIVING. I'VE DISCOVERED A CURRENT CHRYSLER RECALL, U87 THAT APPEARS TO BE EXACTLY MY SYMPTOMS, BUT MY CHRYSLER DEALER COULD NOT FIND A CODE THAT PROVED IT.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3CCAEG3DH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128323,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ON DRIVER DASH KEEPS COMING ON AND DINGING INDICATING SOMETHING NOT WORKING PROPERLY.  CHRYSLER DEALER DID NOT KNOW HOW TO FIX. WENT TO OTHER AUTO REPAIR TO GET FIXED. THEY REPLACED DRIVER SEATBELT BUCKLE PRETENSIONER DEPLOYMENT CONTROL CIRCUIT FOR $551. IT OCCURRED WHILE DRIVING IN ALL CIRCUMSTANCES. HAPPENED A YEAR EARLIER ALSO AND SEPARATE AUTO REPAIR ADJUSTED IT BUT THIS TIME THEY REPLACED IT TO BE SAFE.",
        "vin": "2C3CCAKG3DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121346,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 17V435000(ELECTRICAL SYSTEM) WAS RECEIVED IN JUNE OF 2017. AFTER CONTACTING THE DEALER (CROWN CHRYSLER, 511 S. LEE HWY, CLEVELAND, TN), THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE DEFECT WERE NOT YET AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CCAEG5DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118994,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CHRYSLER 300C FEW YEARS AGO. WAS INFORMED OF A RECALL FOR ALTERNATOR BY MAIL.  THE ALTERNATOR WAS NOT AVAILABLE FOR SEVERAL MONTHS. THE ALTERNATOR GOES OUT FEW MONTHS LATER CAUSING CAR TO BLINK ALL SENSORS AND POWER GOES AWAY. TOOK IT IN STILL NO RECALL PART AVAILABLE. DEALERSHIP PUTS IN SAME ALTERNATOR TO GET ME BY.  MONTHS LATER SAME ISSUE OCCURS. THEY REPLACE AGAIN WITH RECALL PART.  CAR STILL BLINKING N NOW STUCK IN FIRST GEAR SOMETHING IT WASN'T DOING WHEN BROUGHT IN.  I BELIEVE THE ALTERNATOR IS THE CAUSE OF OTHER COMPONENTS FALING..NOW THEY WANT TO CHARGE ME FOR THOSE PARTS.  I'M FURIOUS BECAUSE CAR IS NOW WORSE THAN BEFORE . I BELIEVE THIS ISSUE SHOULD HAVE BEEN RESOLVED AND FIXED AT NO CHARGE UNDER RECALL. PLEASE HELP ME WITH THIS PROBLEM I AVOIDED DUE TO UNAVAILABLE RECALL PARTS",
        "vin": "2C3CCAET7DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089912,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK RANDOMLY POPS OPEN WHEN CAR IS STATIONARY AND WHEN IN MOTION. CAN HEAR A CLICKING SOUND",
        "vin": "2C3CCAET5DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/11/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084608,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE DRIVING 35 MPH, A BURNING ODOR WAS DETECTED AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. ALSO, THE VEHICLE STALLED AND WAS UNABLE TO BE RESTARTED. FRANKLIN CHRYSLER DODGE JEEP RAM (1124 MURFREESBORO RD, FRANKLIN, TN 37064, (615) 614-8243) WAS CALLED AND REFERRED THE CONTACT TO CHRYSLER'S CUSTOMER CARE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 72,000.",
        "vin": "2C3CCAEG8DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE DEALER (PHILLIPS CHRYSLER JEEP DODGE RAM, 3440 S PINE AVE, OCALA, FL 34471) STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS ALSO CONTACTED AND CONFIRMED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CCAEG9DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "2C3CCAEG4DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "06/01/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056577,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM) REGARDING THE ALTERNATOR. THE CONTACT STATED THAT THE REMEDY AND REPAIR PART HAD NOT BEEN SUPPLIED FROM THE MANUFACTURER TO THE DEALER (LIBERTY CHRYSLER DODGE JEEP RAM, 750 W OGLETHORPE HWY, HINESVILLE, GA 31313, (912) 876-5129). IN ADDITION, THE ABS AND TRACTION CONTROL WARNING INDICATORS RANDOMLY KEPT FLASHING FOR MONTHS. ALSO, WHILE DRIVING THE VEHICLE, SMOKE APPEARED UNDER THE HOOD WITHOUT WARNING. THE VEHICLE WAS UNABLE TO BE DRIVEN. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2C3CCAET0DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055509,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE STARTED TO MAKE STRANGE SOUNDS WHEN PULLING INTO A PARKING LOT.  WHEN I CAME BACK OUT, THERE WAS SMOKE COMING OUT FROM UNDER THE HOOD.  I QUICKLY DROVE IT TO ANOTHER PARKING LOT WHERE THE ENGINE JUST QUIT WORKING ALL TOGETHER.  THERE WAS NO POWER IN THE SYSTEM. I HAD TO GET A TOW TRUCK TAKE IT TO A AUTOMOTIVE GARAGE WHERE THEY REPLACED THE ALTERNATOR AND THE BATTERY, WHICH WAS FAIRLY NEW, WITH A NEW ONE BECAUSE IT WOULDN'T HOLD A CHARGE. .  I'M GLAD I WASN'T DRIVING THE CAR WHEN IT QUIT. THE TOTAL BILL WAS A LITTLE OVER $850 FOR THE TOW, ALTERNATOR, BATTERY AND LABOR.  IS THIS COVERED UNDER THE WARRANTY?",
        "vin": "2C3CCAKT1DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "12/15/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOST ALL POWER WHILE DRIVING. STUCK IN THE MIDDLE OF AN INTERSECTION.EVERYTHING WAS LOCKED UP. STRANDED FOR 2 HOURS WAITING FOR AAA. I KNOW THERE IS A RECALL ON THE ALTERNATOR. WE TOOK THE CAR TO OLIVER C JOSEPH CHRYSLER IN BELLEVILLE, IL.  THEY SAY - THEY DON'T HAVE THE PARTS.  THEY CAN ORDER THE PARTSBUT WE WILL HAVE TO PAY FOR THE REPAIR AND WAIT TO GET REIMBURSED BY CHRYSLER.  AT LEAST $850 IN REPAIRS.   I CAN'T PAY $850! WHY SHOULD I HAVE TO IF THIS IS A RECALL.  THE DEALER CONFIRMS THIS WAS AN ALTERNATOR FIRE. I NEED CHRYSLER TO FIX MY CAR.",
        "vin": "2C3CCAET9DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052700,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT TIME FOR THE RECALL REPAIR. WHILE DRIVING APPROXIMATELY 40 MPH, THE BATTERY SAFE MODE CAUSED THE BATTERY TO DIE AND THE VEHICLE TO STALL. THE CONTACT HAD THE VEHICLE TOWED TO HERITAGE CHRYSLER DODGE JEEP RAM PARKVILLE (9219 HARDFORD ROAD, BALTIMORE, MD 21234; 855-979-5863) WHERE IT WAS DIAGNOSED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AT THE EXPENSE OF THE CONTACT BECAUSE THERE WAS NO REMEDY AVAILABLE UNDER THE RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE REGARDING THE REIMBURSEMENT FOR THE ALTERNATOR REPLACEMENT. THE CASE NUMBER WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 82,820.",
        "vin": "2C3CCAET0DH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047636,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTIVE CRUISE CONTROL WORKS PART OF THE TIME AND WILL NOT WORK PART OF THE TIME.  THE FIRST FEW TIMES IT HAPPENED, IT WOULD START WORKING AFTER I TURNED THE ENGINE OFF AND RESTARTED IT.  LATELY IT WILL BE OFF FOR SEVERAL DAYS AND THEN WORK A FEW DAYS BEFORE GOING OFF AGAIN.  AFTER CHECKING THE INTERNET FOR SOLUTIONS, I FOUND NONE BUT FOUND LITERALLY HUNDREDS OF PEOPLE THAT HAVE THE SAME PROBLEM.  I FEEL THIS IS A SAFETY PROBLEM BECAUSE IT CAUSES UNINTENTIONAL SPEEDING.  IN ADDITION, THE ADAPTIVE CRUISE CONTROL PREVENTS THE CAR FROM GETTING TOO CLOSE TO THE VEHICLE IN FRONT OF YOU.  AFTER GETTING USED TO THIS FEATURE, I FIND MYSELF GETTING TOO CLOSE TO OTHER CARS WHEN THE ADAPTIVE CRUISE CONTROL IS NOT WORKING.  THIS IS THE SITUATION WHEN THE VEHICLE IS MOVING.",
        "vin": "2C3CCAPG1DH"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042786,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE RECEIVED 2 NOTICES IN THE MAIL ABOUT 2 RECALLS ON MY CAR. I HAVE NOT RECEIVED ANY OTHER INFORMATION AND IT APPEARS THAT THE ALTERNATOR TO BE REPLACED STILL NO PARTS ARE AVAILABLE ...WITH NO EXPECTED DATE AVAILABLE. THE SAME WITH THE AIRBAGS. I HAVE REGISTERED BOTH RECALLS ON LINE AND AM WAITING FOR MORE INFORMATION.",
        "vin": "2C3CCAKTXDH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/23/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11036008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS COMING HOME FROM WORK AND SHE SAID THE RADIO TURNED OFF ON ITS OWN AND WOULDN'T GO BACK ON. THEN SHE SAID SHE BEGAN TO SMELL A \"BURNING SMELL\" OF LIKE PLASTIC OR BRAKES. SHE THEN SAID THAT THE CAR BEGAN TO SMOKE FROM UNDER THE HOOD, LUCKILY MY WIFE WORKS 5 MILES AWAY FROM HOME. I TOLD HER TO IMMEDIATELY TURN THE CAR OFF TO PREVENT ANYTHING ELSE FROM HAPPENING. I COULD STILL SMELL THE BURNING OF WHAT I LATER FOUND OUT WAS THE ALTERNATOR. I WENT ON THE INTERNET TO CHECK FOR RECALLS AND WAS SURPRISED TO FIND OUT THAT THERE WAS BUT ONLY ON THE V6 ENGINE MODELS BUT APPARENTLY WITH THE SAME EXACT ISSUES. I DISCOVERED IN ANOTHER WEBSITE THAT THERE IS MANY COMPLAINTS ON MY SAME CAR MODEL FROM OTHER OWNERS AS WELL. OUR CAR ONLY HAS 49K MILES AND DID NOT COST US CHEAP AT 45,000. CHRYSLER OUT TO BE ASHAMED FOR NOT POSTING THESE SERIOUS ELECTRICAL COMPLAINTS. MY WHOLE FAMILY HAS BEEN CHRYSLER FOR OVER 45 YEARS SINCE THE DAYS OF PLYMOUTH. PERHAPS ITS TIME TO CHANGE. PLEASE DO NOT WAIT TILL SOMEONE ENDS UP GETTING HURT OR EVEN KILLED OVER THIS SERIOUS MATTER THAT CAN MAKE VEHICLE CATCH-ON FIRE.",
        "vin": "2C3CCAET6DH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/30/2017",
        "dateOfIncident": "09/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030615,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A CAR ACCIDENT IN JULY . MY CAR WAS TOWED TO CHRYSLER IN ALEX VA  MY CAR WAS DIAGNOSED CORRECTLY THE CAR STALLED WAS SMOKING STEERING BRAKES  AIR BAG ALL WERE ISSUES. DEALER HAD MY CAR 7/29-9/6.MY CAR STEERING WHEEL WAS TIGHT DRIVING I REPORT IT TO THE DEALER VERBALLY  BY EMAIL WITH NO RESPONSE. TWO WEEKS AFTER RECEIVING MY CAR BACK IT SAFE BATTERY MODE LIGHT CAME ON AND BROKE DOWN I RECEIVED A JUMP START TWICE TO RESTART MY CAR. I SLOWLY DROVE OF APPLY LITTLE PRESSURE TO THE BRAKES THE SAFE BATTERY MODE LIGHT LIGHT CAME ON BRAKE ABS LIGHT EMERGENCY BRAKE LIGHT ENGINE LIGHT OTHER WARNING LIGHTS I HAD TO CONTROLL THE STEERING WILL TRYING TO APPLY BRAKES TO DRIVE WITH WAS DIFFICULT WHILE THE DASH IS BLANKING ORANGE AND ON AND OFF. I STOP THE CAR HAD IT TOWED TO CHRYSLER DEALERSHIP TO LEARN WHEN CALLING A 1800 NUMBER MY CAR WAS ON A RECALL LIST FOR ALTERNATOR. I CONTACT CHRYSLER CUSTOMER CARE TO RESOLVE THE RECALL TOLD THERE IS NO RESOLUTION FOR THIS RECALL. I INFORMED OF MY FEARS OF SAFETY AND ASKED FOR A SOLUTION TO AT LEAST RECEIVED A LOANER CAR UNTIL THE RECALL SOLUTION IN 2018 WOULD TAKE PLACE FOR REPAIRS. I WAS YELLED AT HUNG UP ON FOR ASKING FOR A REPLACEMENT RESOLUTION AND TOLD TO HAD THE SAME RECALL PART PLACE IN MY CAR AND PAY FOR IT AND SUBMIT THE RECEIPT TO CHRYSLER FOR REFUND. I INFORMED CHRYSLER I DON'T FEEL SAFE AND FEARFUL OF DOING THIS DUE TO MY EXPERIENCE AND NO SAFE WAY TO ENSURE THAT THIS WOULD NOT CAUSE A FIRE ANOTHER LOSS OF POWER AND CAUSES A ACCIDENT. I WAS TOLD BY CHRYSLER CUSTOMER CARE EACH TIME I CALLED THAT  MY ONLY OPTION IS TO REPLACE THE ALTERNATOR WITH ANOTHER ALTERNATOR THAT IS ON RECALL OR WAIT UNTIL CHRYSLER MAKE THE RECALL SOLUTION WHICH THE NEW PART WILL BE AVAILABLE IN 2018 I WOULD HAVE TO LET THE CAR SIT UNRESOLVED AND NOT REPAIRED. I FEEL FORCED INTO THIS OPTION BY CHRYSLER AND THE DEALERSHIP AUTO SERVICE MANGER MIKE",
        "vin": "2C3CCAET8DH"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024848,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE DRIVING 30-35 MPH, THE SEAT BELT INDEPENDENTLY UNLATCHED. THE CONTACT WAS UNABLE TO RE-LATCH THE SEAT BELT. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED OR REPAIRED. THE LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 77,867.",
        "vin": "2C3CCAKT1DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT THE VEHICLE WAS NOT OPERABLE WHEN SHIFTED INTO THE START POSITION. THE CONTACT STATED THAT THE FAILURE OCCURRED ON NUMEROUS OCCASIONS FOR OVER A YEAR. THE VEHICLE WAS TAKEN TO INDIAN TRAIL CHRYSLER JEEP DODGE (5501 W HWY, MONROE, NC) WHERE IT WAS DIAGNOSED THAT THE BATTERY WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE SAME DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL JANUARY OR FEBRUARY OF 2018. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 18,644. VIN TOOL CONFIRMS PARTS NOT AVAILABLE....UPDATED 11/15/17 *BF  CONSUMER STATED PROBLEM STARTED AFTER AN OIL CHANGE ON 9/15/2016. THE CAR WOULD NOT CRANK ALOT. UPDATED 7/19/18*JB *TR",
        "vin": "2C3CCAETXDH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021725,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE DUE TO A NATIONAL BACK ORDER AND PROVIDE CASE NUMBER 32353856. THE CONTACT HAD NOT EXPERIENCED A FAILURE. TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2C3CCAET7DH"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021120,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASE THIS VEHICLE 11 MONTHS AGO AND 6 MONTHS INTO THE CAR THE FRONT SUSPENSION STARTED TO SHAKE REAL BAD, THEN A FEW MOTHS PAST THAT, THE TORQUE CONVERTER WENT OUT AND WAS REPLACED. KNOW THE ELECTRICAL SYSTEM WENT OUT.",
        "vin": "2C3CCAET0DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015206,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE THE VEHICLE WAS STATIONARY, IT WOULD NOT START WHEN PROMPTED. THE VEHICLE WAS TOWED TO STEW HANSEN OF DES MOINES, IOWA WHERE IT WAS DIAGNOSED THAT THE ALTERNATOR FAILED AND CAUSED THE BATTERY TO FAIL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 102,101.",
        "vin": "2C3CCAKG5DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/04/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013346,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT OBSERVED SMOKE FROM THE HOOD OF THE VEHICLE. THE CONTACT CALLED FIELDS CHRYSLER (LOCATED ON 750 TOWNE CENTER BLVD, SANFORD, FL 32771), BUT NO APPOINTMENT WAS SCHEDULED. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD HAVE SOMEONE CONTACT HER TO INSPECT THE VEHICLE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2C3CCAET6DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DASH IS A LEATHER STITCHED DASH THAT HAS STARTED TO IMPEACH ON THE FORWARD VISION THROUGH THE FRONT WINDSHIELD. IT IS ON THE FARTHEST FORWARD PART OF THE CAR AND STARTING TO SLOWLY GO UP FARTHER WITH TIME. THIS HAS HAPPENED OVER TIME WHILE TURNING DRIVING AND ALL ROAD CONDITIONS",
        "vin": "2C3CCADG1DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "07/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012158,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE STALLED AND LOST POWER WITHOUT WARNING. THE CONTACT HAD TO CLIMB OUT OF THE FRONT PASSENGER SIDE WINDOW TO EXIT THE VEHICLE DUE TO THE LOSS OF POWER PREVENTING THE DOORS FROM UNLOCKING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO PALMER DODGE (LOCATED AT 11460 ALPHARETTA HWY ROSWELL, GA 37706 (770) 410-1111) WHERE IT WAS DIAGNOSED THAT THE BATTERY WAS DRAINED AND THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL. NO FURTHER ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 71,000.",
        "vin": "2C3CCAET8DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011803,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 CHRYSLER 300C. WHILE DRIVING 20 MPH, THE VEHICLE LOST POWER AND ALL THE INSTRUMENT PANEL INDICATORS ILLUMINATED. IN ADDITION, THERE WAS AN ABNORMAL ODOR COMING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TOWED TO WEAVER BROTHERS MOTORS (LOCATED AT 2035 S WHEELER ST, JASPER, TX 75951) WHERE IT WAS DIAGNOSED THAT THE BATTERY AND ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 42,000. UPDATED 09/06/17*LJ    *CN",
        "vin": "2C3CCAEG8DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010324,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST WANT YOU ALL KNOW THAT MY 2013 CHRYSLER 300 \"ALTERNATOR\" WAS BURNED IN THE SIDE STREET. WHY IS MY VEHICLE IS NOT COVERED MY THE ALTERNATOR RECALL THIS VERY DANGEROUS THAT CAN CAUSE A DEADLY ACCIDENT TO MY FAMILY. PLEASE TAKE A LOOK AT THIS PART RECALL.",
        "vin": "2C3CCAET0DH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "06/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994576,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 CHRYSLER 300 C WITH THE 5.7 HEMI. I WAS PULLING OUT MY CAR OF THE GARAGE TO PARK IT IN FRONT OF MY HOUSE, WHEN I WAS PULLING IT OUT IT BEGAN TO MAKE HUMMING NOISES UNDER THE HOOD AND THE DASH WARNING LIGHTS BEGAN TO FLASH ABS,BATTERY SAVER ECT.I LOOKED UNDER THE HOOD AND THE ALTERNATOR WAS SMOKING, I RAN IN THE GARAGE AND GOT A BUCKET OF WATER AND POURED IT ON THE SMOKING ALTERNATOR. I TOOK IT TO THE SHOP AND THEY SAID THE ALTERNATOR SHORTED OUT AND DAMAGED THE BATTERY. I THINK CHRYSLER SHOULD RECALL ALL OF THESE ALTERNATORS IN THERE CARS, 300,CHALLENGER,CHARGERS,JEEPS..ECT.",
        "vin": "2C3CCAET1DH"
    }
]