[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448834,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear brake always has soft mushy feel, even after flushing system.  Forces me to use front brake as primary braking system. Can be an issue when trying to stop quickly to avoid an accident. Heard from many other Ducati Multistrada riders that this is a common known issue. Since motorcycle in out of warranty, if has not been fixed or inspected by dealer.  This has always been an issue since owning the motorcycle, no warning light to provide help in knowing how to fix issue.",
        "vin": "ZDM12BSW9DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420697,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this motorcycle brand new in 2014.  Since that time, the rear brake has never worked properly.  It is extremely weak and does very little to slow down the motorcycle. It is available for inspection upon request.    Many times I have used the rear brakes (in conjunction with the front brakes) and the rears do very little to slow down the motorcycle.  In a panic stop situation, the rear brakes don't add anything significant to the stopping power.   Multiple dealerships have inspected the rear brake and have told me that the weak rear brake is \"normal\" on all Ducatis and especially the Multistrada.  Some have called the rear brakes \"worthless.\"   There were no warning messages, but the problem has persisted since the initial purchase of the motorcycle in 2014.",
        "vin": "ZDM12BSWXDB"
    }
]