[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429017,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Eclipse RV. The contact stated that the frame was fractured. The local dealer was contacted but vehicle was not diagnosed or repaired. The manufacturer was notified of the failure however, no further assistance was provided. The failure mileage was unknown.",
        "vin": "5LZBE2624DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "01/24/2021",
        "fire": false,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395442,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/25/2021 WHILE REPLACING THE \"SUSPENSION EQUALIZERS\" A MECHANIC AND  I DISCOVERED CRACKS IN THE METAL I BEAM FRAME OF MY REC, FIFTH WHEEL TRAILER. BASED UPON THE RUST IN THE CRACKS THEY MAY BE SEVERAL YEARS OLD. THERE ARE 4-5 CRACKS ABOVE THE SUSPENSION ON BOTH THE L AND R SIDES. ALL IN SIMILAR LOCATIONS AND LENGTH, BOTH FRAME MFG (LIPPERT) AND THE RV TRAILER MFG (ECLLIPSE) HAVE OFFERED NO ADVISE OR SUPPORT IN REPAIRING THE FRAME. BOTH COMPANIES REQUESTED PHOTO DOCUMENTATION AND THEN STATED THEY COULD NOT HELP DUE TO THE AGE OF THE TRAILER. RESEARCH REVEALED TO ME THAT THIS HAS BEEN A KNOWN DEFECT FOR MANY YEARS BY BOTH LIPPERT AND ECLIPSE YET NO RECALL. I AM NOT AN ENGINEER BUT I FEEL THESE TRAILERS MAY IN FACT BE A HAZARD ON THE HIGHWAY. OURS IS PARKED AT OUR HOME AND WE CURRENTLY ARE NOT COMFORTABLE PULLING IT ON A PUBLIC HIGHWAY OR STREET. MY RESEARCH REVEALED A CLASS ACTION SUIT HAS BEEN FILED IN 2020 AGAINST ECLIPSE BY A LAW FIRM IN SAN DIEGO. THE LAW FIRM IS AWARE OF MY SITUATION BUT HAS NOT ASKED ME TO JOIN THE SUIT, AND I DON'T KNOW IF THAT IS EVEN AN OPTION FOR ME.",
        "vin": "5LZBF2827DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "09/16/2017",
        "fire": false,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088701,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 ECLIPSE ATTITUDE. UPON VISUALLY INSPECTING THE TRAILER, THE CONTACT WAS MADE AWARE OF CRACKS IN THE FRAME. AS A RESULT, THE AXLES WERE ABLE TO BE SHIFTED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE; HOWEVER, NO ASSISTANCE OR FURTHER COMMUNICATION WAS OFFERED. THE VIN WAS NOT AVAILABLE. THERE WAS NO MILEAGE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/05/2017",
        "dateOfIncident": "09/01/2017",
        "fire": true,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031941,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 ECLIPSE ATTITUDE. UPON INSPECTION, IT WAS DISCOVERED THAT THE SUSPENSION EQUALIZER HAD CRACKED AND THE SHACKLE BOLTS BETWEEN THE WHEELS WERE WORN AND FAULTY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO REPAIRED THE FAILURES. LATER, WHILE DRIVING APPROXIMATELY 20 MPH, SMOKE APPEARED FROM THE REAR PASSENGER WHEELS. UPON INSPECTION, IT WAS DISCOVERED THAT THE EQUALIZER FRACTURED AND CRACKS WERE VISIBLE IN THE CHASSIS AND CROSS MEMBERS OF THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE LOCAL DEALER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "5LZBF2825ER"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865791,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 (NA) ECLIPSE ATTITUDE RV. WHEN THE VEHICLE WAS STARTED, THE CONTACT NOTICED THAT THE FRONT PASSENGER SIDE LED LIGHT WAS NOT WORKING. THE FAILURE RECURRED THREE TIMES WITH THE LED LIGHTS INSIDE THE RV. THE DEALER DIAGNOSED FAULTY WIRING AS THE CAUSE OF THE FAILURE, BUT THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 0.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Eclipse Recreational Vehicles, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730436,
        "products": [
            {
                "manufacturer": "Eclipse Recreational Vehicles, Inc.",
                "productMake": "ECLIPSE",
                "productModel": "ATTITUDE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2013 ECLIPSE ATTITUDE 28K TOY HAULER WITH A COMPLETE FAILURE OF THE I-BEAM AND AXLES. THE VEHICLE IS LITERALLY LEANING TO THE PASSENGERS SIDE AND THE TIRES ON THE PASSENGER SIDE ARE UNDER THE TRAILER ABOUT A FOOT. WE CONTACTED ECLIPSE KNOWING WE WERE OUT OF WARRANTY, BUT ALSO KNOWING THAT IT APPEARS TO BE A MANUFACTURER DEFECT. EXPECTED THAT THEY WOULD AT LEAST WANT TO... SEE THE VEHICLE TO SEE WHAT THEY COULD DO, BUT NO WERE TOLD \"NOTHING WE CAN DO AS IT'S OUTSIDE OF THE WARRANTY PERIOD, TURN IT INTO INSURANCE\". PROBLEM IS I SELL THE INSURANCE SO I KNOW IT IS NOT A COVERED ITEM. THERE WAS NO COLLISION AND NOTHING CAUSED IT BUT THEIR FAULTY MANUFACTURING! I ALSO CHECKED OUT A WEB FORUM AND SAW THAT THIS HAD HAPPENED IN THE PAST, WHAT AND NO ONE SAID ANYTHING! OK, SO NOW I OWN A $50,000 PAPER HOLDER! I JUST WANT SOME HELP, EVEN A PHONE CALL WOULD BE NICE, BUT NO I HAD TO CONTACT THEM. HORRIBLE CUSTOMER SERVICE AND HORRIBLE PRODUCT! BUYER BEWARE!!!",
        "vin": ""
    }
]