[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2022",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459309,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "When putting gasoline at the gas pump, pump clicks off constantly. Makes you think the tank is full when it is not, Have to pump very slow. takes 10-15 mins to fill up and have to know how many gallons are needed.",
        "vin": "3C3CFFBR4DT"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453372,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Ed Payne Chrysler Dodge Jeep RAM 2101 E Expressway 83, Weslaco, TX 78599 +1 956-272-1902  For the past years, I have complained to the car dealer I take my vehicle into that there is an issue with the fuel tank. I have been told that other Fiat car owners have had the same issues as I. Issues, the 2013 - 2014 Fait Sport 500, tank issue, when filling up the tank, the tank does not fill up normal. When filling up the gas take, the gas handle stops every 10 sec,  I have to keep clicking on the gas pump handle every 10 sec. To keep the flow of gas to fill the gas tank up. I was told by the car dealer that the issue was the gas tank on the Fait, not the gas pump machine. When adding a new gas tank to the vehicle, the problem stop, and the owners were able to fill the gas tank without any issues. I keep having headlights, blinkers, stop lights burn out all the time. I believe there's an issue with the wiring in the Fait Sport 500.",
        "vin": "3C3CFFBR5DT"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434137,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The airbag warning light comes on intermittently with nothing on the passenger seat and a message that says \"airbag service required\" also appears intermittently. Dealership was unable to diagnose (\"never seen this issue before\"}, escalated to STAR (STAR case 101975980). STAR could not diagnose and requested that the tech perform a teardown to try to figure out what was wrong. The dealership wanted to do this at my expense ($360 just to perform the tear down. Actual repair cost unknown.) I do not feel that a customer should have to cover the cost for a manufacturer to find out what is wrong with their vehicle when the error is something that they are not familiar with and cannot diagnose and was not caused by the owner, especially when it is related to safety equipment and the proper functioning of that equipment.",
        "vin": "3c3cffbr3dt"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429832,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving at 60mph, the vehicle lost power and would not accelerate.  I do not know why this happened.  I was endangered due to the inability to control the speed of my car in traffic.  I have recognized a recall that I am going to pursue with a dealer.  There was no warning lights on.  Oil level was good.  Engine temperature was in the OK zone.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406910,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ACTING A LITTLE STRANGE ON A TRIP TO THE STORE.  I SAW SMOKE COMING FROM UNDER THE HOOD WHEN I PULLED INTO THE PARKING SPOT.  UPON THIS HAPPENING THE CAR WOULD NOT GO BACK INTO GEAR.  HAD IT TOWED TO A DEALERSHIP AND WAS INFORMED OF THE S34 RECALL ON THE CLUTCH. THE SPRING HAD FAILED CAUSING THE CLUTCH TO FAIL.  THE RECALL FIX WAS COMPLETED AND WHEN I PICKED MY CAR UP I NOTICED IT WAS VERY HARD TO SHIFT INTO GEARS-BUT THOUGHT IT WAS DUE TO THE NEW CLUTCH.  I WENT TO THE STORE AND WHEN I WENT TO LEAVE IT GRINDED SO LOUD WHEN I PUT IT IN REVERSE.  I WAITED SO I COULD PULL FORWARD INSTEAD.  I TOOK IT BACK TO THE DEALERSHIP AND WAS TOLD THAT MY TRANSMISSION WAS GOING OUT BUT WAS INSTRUCTED ON HOW TO JUST PUSH IT INTO GEAR THROUGH THE GRINDING UNTIL I COULD GET A NEW TRANSMISSION. THAT THE RECALL HAD NOTHING TO DO WITH THE TRANSMISSION ISSUE.  I FOUND THIS ABSOLUTELY UNACCEPTABLE AND OPENED A CASE WITH FIAT-WHO IS STILL TRYING TO TELL ME THAT THE TWO ISSUES HAVE NOTHING TO DO WITH EACH OTHER. I AM ATTACHING DOCUMENTATION I HAVE FOUND THAT SHOWS FCA STATING THAT THE RECALL CAN CAUSE EXCESSIVE CLUTCH TRAVEL AND THAT OVER TIME CAUSE DAMAGE TO THE TRANSMISSION-LIMITING A DRIVER'S ABILITY TO CHANGE GEARS!!!!! I AM GETTING NOWHERE WITH THEM AND BASICALLY HAVE A HUNK OF METAL NOW.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399245,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED WHILE DRIVING 50 MPH, SHE WAS UNABLE SHIFT GEARS. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT PARKED ON THE SIDE OF THE ROAD. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO A FRIEND'S RESIDENCE. THE VEHICLE WAS THEN TOWED TO SOUTH MIAMI ALFA ROMEO FIAT (17220 S DIXIE HWY, MIAMI, FL 33157, (305) 305-3428) WHO WAS MADE AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED NOR REPAIRED YET. THE VEHICLE WAS TOWED TO HER RESIDENCE. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 45,000.",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385761,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 30 MPH, THE VEHICLE STALLED WITH SEVERAL UNKNOWN WARNING LIGHTS FLICKERING ON THE INSTRUMENT PANEL. THE CONTACT HAD THE VEHICLE TOWED TO HIS RESIDENCE WHERE AN INDEPENDENT MECHANIC DIAGNOSED THE VEHICLE. THE CONTACT WAS INFORMED THAT THE PCM AND ECM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE WAS LIKE NHTSA CAMPAIGN NUMBER: 15V291000 (POWERTRAIN). THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 81,200.",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378251,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALRS ARE AWARE OF THE FUEL TANK ISSUES, IT REFUSE TO FILL THE TANK THE NORMAL WAY. YOU HAVE TO KEEP PUMPING EVER SECOND UNTIL THE FULE TANK IS FULL. DEAL ADVICE TO CORRCT THE ISSUE, THE FUL TANK WAS BE REPLACE A $1000 ? VALUE. I REPORTED THE ISSUE AUG 8,2020 CASE # 76990681 TO THE FCA/MOPAR 800-853-1403. NOTHING HAS BEEN CORRECTED ON THE ISSUE, IM STILL HAVING PROBLEMS FUELING MY CAR WITH GAS. ELECTRIC ISSUE AS WELL, FRONT AND REAR LIGHT BUBBLE KEEP BURING OUT. DEALER NAME ED PAYNE2101 E EXPRESSWAY 83, WESLACO, TX 78599 (956) 272-1902",
        "vin": "3C3CFFBR5DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372682,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PETAL TRANMISSION NOISE WHEN SHIFTING INDICATING DAMAGE IT MAY BE THE SAME PART THAT WAS RECALLED BUT I PURCHASED THE VEHICLE AFTER RECALL PERIOD CLOSED FOR WORK DONE ON VEHICLE. I NEED TO KNOW IS THERE ANY TYPE OF EXTENSION OR WAIVER THAT CAN BE GIVEN TO FIX ISSUE.",
        "vin": "3C3CFFBR9DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365968,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING THE SAME ISSUE WITH DIFFICULTY SHIFTING INCLUDED IN FCA RECALL 16V302000.  AS WITH MANY OTHER COMPLAINTS FILED WITH THE NHTSA, FCA AND THE DEALERSHIP ARE DENYING MY VIN IS COVERED IN THE RECALL, BUT I HAVE A 2013 MANUAL TRANSMISSION FIAT 500, AND THE RECALL INCLUDES 2012-2016 MODEL YEARS.  THE CABLE HAS NOT BROKEN YET, BUT I AM HAVING GREAT DIFFICULTY GETTING THE CAR TO SHIFT INTO 1ST AND REVERSE.  THE RECALL SPECIFICALLY SAYS THIS IS A SAFETY ISSUE INCREASING THE RISK OF CRASH IF THE CABLE BREAKS WHILE OPERATING THE CAR, BUT FCA IS CLEARLY NO COVERING UNDER RECALL ALL OF THE VEHICLES EXPERIENCING THIS PROBLEM.  SO, AN OTHERWISE PERFECTLY MAINTAINED CAR IS NOW LEAVING ME QUESTIONING IT'S SAFETY.  THANKS FIAT FOR NOT ACCEPTING RESPONSIBILITY FOR ALL THE VEHICLES WITH THIS PROBLEM!",
        "vin": "3C3CFFHH7DT"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362899,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CEL ALERT: P0071 OBD II ERROR AMBIENT AIR TEMPERATURE. THE FORUMS ARE FULL OF PEOPLE TRYING TO FIND OUT HOW TO FIX THIS. THERE IS A FAULTY THERMOSTAT IN THE PASSENGER SIDE MIRROR THAT REQUIRES THE ENTIRE MIRROR TO BE ( $117 FROM AUTO ZONE ) A 25 THERMOSTAT IS THE ONLY THING THAT SHOULD ACTUALLY NEED REPLACEMENT",
        "vin": "3C3CFFFH7DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361454,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRE HARNESS GOING TO THE TRUNK LID IS DEFECTIVE. THE WIRES BREAK AND THE DEALER REPAIRS THE BREAKS WITH A SPLICE WHICH DOESN'T LAST.     I BROUGHT THE CAR TO THE DEALER FOR THIS DEFECT IN 2017. THEY PERFORMED THE FACTORY REPAIR PER THE SERVICE MANAGER CHARLIE THIBAULT. I EXPRESSED CONCERNS FOR THE REPAIR SINCE IT WAS SOMETHING I COULD HAVE PERFORMED. HE SAID IF THE REPAIR FAILS THEY WILL REVIEW AND DECIDE IF IT WILL BE COVERED IN THE FUTURE. THE REPAIR FAILED IN 2020, LESS THAN 20,000 MILES SINCE THE ORIGINAL REPAIR. THE CAR IS NOT DRIVEN IN THE WINTER AND IT IS STORED IN THE GARAGE SO THIS IS NOT DUE TO HARSH CONDITIONS.     I CONTACTED  FIAT CHRYSLER AUTOMOBILES (FCA) TO SEEK THEIR ASSISTANCE. THEY SUGGESTED REQUESTING A SERVICE APPOINTMENT TO GET THE DEALERSHIP INVOLVED. I DID THIS AND FCA REFUSED TO PAY FOR THE REPAIR. THEY SAID THE REPAIR HAS A 2 YEAR WARRANTY. WIRING HARNESSES SHOULD NOT FAIL EVERY 2 YEARS. LOOKING AT THE FIAT FORUMS THIS APPEARS TO BE A COMMON DEFECT WITH THIS VEHICLE. THE DEFECT CAN RESULT IN A SURCHARGEABLE OFFENSE IN MA OR AN ACCIDENT DUE TO THE LIGHTS NOT WORKING OR POSSIBLY A FIRE WHEN THE HARNESS BREAKS.    THE ATTACHED PICTURES SHOW THE ORIGINAL DEFECT, THE NEW DEFECT, THE UNTAPED REPAIR WHEN IT FAILED A SECOND TIME, THE POOR REPAIR WITH WIRES NOT SEALED AFTER FIRST REPAIR.    FIAT CHRYSLER SHOULD HAVE A RECALL FOR THIS ISSUE AND BE FORCED TO MAKE A PERMANENT REPAIR FOR THIS PROBLEM THAT WILL LAST THE LIFE OF THE CAR.",
        "vin": "3C3CFFDR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353357,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS HAD THE RECALL SAFETY RECALL S34 / NHTSA 16V-302 <BR/>MANUAL TRANSAXLE CLUTCH PEDAL PERFORMED BACK AT 30,000 MI. CLEARLY DOSENT FIX THE PRESSURE PLATE ISSUE, AS I'M AN SURE THIS IS WHAT HAPPENED WHEN I WAS GETTING TIRES INSTALLED AND THE STATE INSPECTION AT A NTB SHOP. WHEN YOU HIT THE PEDAL THE CLITCH DOES NOT DISENGAGE, MEANING THE CLUTCH IS ALWAYS ENGAGED AND YOU CANNOT SHIFT GEARS. I PERSONALLY INSPECTED THE CLUTCH SYSTEM FROM THE PEDAL TO THE CLUTCH ARM AND CAN SEE THE CLUTCH DISENGAGEMENT ARM MOVING WHICH LEADS ME TO BELIEVE THAT THE PRESSURE PLATE SPRING IS BROKEN. I HAVE TRIED TO CONTACT THE LOCAL DEALER HERE IN ROANOME, VA TO NO AVAIL. SOUNDS LIKE I WILL BE DOING THE CLUTCH AND RELATED PARTS MYSELF, SO I FIGURED I WOULD GET MY COMPLAINT IN INCASE SOMEONE WANTS TO INSPECT PARTS AS THEY GET REMOVED. THE VEHICLE HAD THIS FAILURE WHILE MOVING SLOWLY IN A SHOP TO BE PUT ON A LIFT TO HAVE TIRES INSTALLED. NO PHOTOS YET, BUT WILL BE GETTING THEM SOON.",
        "vin": "3C3CFFBR3DT"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340069,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SO - I'VE GOT A 2013 500E AND IT STARTED DOING THIS LAST WEEK OR SO. THE RBC, THE ESC, THE ABS, AND EVEN THE HILL ASSIST TRANSIENTLY, AND ONCE OR TWICE EVEN WENT INTO 'PROPULSION SYSTEM SERVICE' ERROR MODE AND WOULDN'T RUN. AFTER A RE-START IT WOULD THEN RUN. EVEN DID THE BATTERY TRICK. NOT SURE IF IT HELPED OR NOT. SO, I DECIDED TO DO THE OBD2 - WITH THE KONNWEI AND THE ALFOBD - FULL PROGRAM - AND IT WAS ABLE TO CLEAR THE CODES AND PULL UP THE ERRORS : U0001, U1201, U1487 - AND EVEN THOUGH IT RECURS AND I FEEL A CLICK AND CHANGE IN BRAKING WHEN THE RBC LIGHT GOES OFF, AND THE ESC LIGHT, AND EVENTUALLY THE ABS LIGHT TOO, AND IT STARTS MAKING FUNNY NOISES FROM THE BRAKES WHEN STOPPED AND PRESSED DEEPLY, BUT I'M ABLE TO CLEAR IT AND GOES BACK TO NORMAL. BUT IT ALWAYS RECURS. ONCE IT WENT AWAY FOR 2 DAYS. ANYWAY - FOUND A TSB ON THIS : NUMBER 08-045-16 - FROM APRIL 22, 2016. AND DESCRIBES PRETTY MUCH ALL THIS AND THE CODES. APPARENTLY THE RBC, AND ABS MODULES NEED REFLASH BY THE DEALER - OR SOMEONE WITH THE WITECH SOFTWARE AND INTERFACE. HERE'S A LINK TO THE PDF ITSELF: HTTPS://STATIC.NHTSA.GOV/ODI/TSBS/2016/SB-10076281-3639.PDF -  MY MAIN PROBLEM IS MY LOCAL DEALER IN TUCSON DOES NOT HAVE 500E CERTIFICATION NOR A TECH TO SERVICE THE 500E. I'D HAVE TO DRIVE 100 MILES OR SO UP TO PHOENIX TO GET IT DONE. SO I WOULD NEED TO HAUL IT UP THERE. THIS SUCKS. CALLED THE FCA SUPPORT LINE, THEY SAY THERE'S NOTHING THEY CAN DO, I HAVE TO GET IT THERE.",
        "vin": "3C3CFFGE2DT"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339262,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR HEADLIGHT HAD BEEN REPLACED AND IT STOPS WORKING SHORTLY AFTER REPLACEMENT.",
        "vin": "3C3CFFERXDT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "07/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO MY HOUSE, I PUT MY VEHICLE IN REVERS (A 5-SPEED STICK SHIFT), AND MY STICK SHIFT CABLE BROKE.  MY VEHICLE WILL NOT SHIFT OUT OF REVERSE.  LUCKILY, THIS OCCURRED RIGHT OUTSIDE OF MY HOUSE, BUT COULD HAVE RESULTED IN SERIOUS INJURY IF I WAS ON THE ROAD.  THE CAR NOW IS STUCK IN REVERSE AND CANNOT BE USED.",
        "vin": "3C3CFFAR8DT"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331098,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIAT 2013 FIAT 500 HAS ABOUT 51,000 MILES ON IT AND I NOW HAVE HAD TO REPLACE 2 OF 4 WHEEL BEARINGS, I HAVE BEEN TOLD THAT THIS IS NOT ROUTINE MAINTENANCE AND THAT ONE IS A FLUKE BUT TWO IS UNHEARD OF.  *TR",
        "vin": "3C3CFFCR3DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329029,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIAT 500 HAS 67,000 MILES ON IT AND THE TRANSMISSION DIED WHILE I WAS DRIVING ON THE HIGHWAY AT 60MPH. THERE WERE NO INDICATIONS PRIOR TO THIS EVENT THAT ANYTHING WAS WRONG WITH THE VEHICLE.  *TR",
        "vin": "3C3CFFCR8DT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "10/16/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327477,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT HIS CHECK ENGINE LIGHT HAD ILLUMINATED WHILE DRIVING AT 65 MPH. HE ALSO STATED THAT WHITE SMOKE HAD BEGAN EMITTING FROM THE ENGINE. DESPITE THE FAILURE, THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO HIS RESIDENCE. UPON INSPECTION, THE CONTACT STATED THAT THERE WAS NO OIL IN THE VEHICLE DESPITE A RECENT OIL CHANGE. THE CONTACT ALSO STATED THAT THE TRANSFER PLATE CLUTCH PEDAL HAD FAILED MULTIPLE TIMES DESPITE THE VEHICLE BEING PLACED UNDER NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE VEHICLE HAD NOT BEEN TAKEN TO A DEALER TO BE DIAGNOSED. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS 47,263.",
        "vin": "3C3CFFCR6DT"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323015,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,   I BELIEVE I NEED AN ATTORNEY AND LEGAL ADVICE. I HAVE A DEFECTIVE CAR THAT SHOWS ON THE FIAT DEALERSHIP WEBSITE AS A RECALL. THE YEAR MAKE AND MODEL OF MY CAR HAS A RECALL (2/2013 RECALL N09 REPROGRAM POWERTRAIN CONTROL MODULE)  I HAVE HAVE BEEN REPORTED MY ISSUE TO FIAT DEALERSHIP FOR THE LAST THREE YEARS AND WAS TOLD THAT BASED ON MY VIN NUMBER I DO NOT HAVE A RECALL. WHEN I SERVICE MY CAR AT DEALERSHIP THEY JUST TURN OFF MY ENGINE LIGHT. I HAVE NOT BEEN ABLE TO PASS INSPECTION OF MY VEHICLE IN OVER TWO YEARS. MY MECHANIC EXPLAINED TO ME THAT I HAVE A RECALL AND HE CANNOT PASS INSPECTION. I AM AFRAID TO DRIVE MY CAR, BUT CANNOT SELL IT OR TRADE IT IN DIE TO THE ENGINE LIGHT ERROR. I HAVE A RECORD OF ALL OF MY RECEIPTS. THIS STARTED IN JANUARY 2018. I BELIEVE THAT I SHOULD FILE CHARGES AGAINST FIAT AND WOULD NEED LEGAL ADVISE.     THANK YOU.",
        "vin": "3C3CFFHH6DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316573,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT WHILE AT A STOP LIGHT THE MANUAL TRANSMISSION SHIFTED INTO FIRST OR SECOND GEARS INDEPENDENTLY CAUSING THE VEHICLE TO STALL. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER AND MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "3C3CFFBR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311892,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V817000 (POWER TRAIN) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SAFFORD CHRYSLER, DODGE, FIAT (5202 JEFFERSON DAVIS HWY, FREDERICKBURG, VA 22408) CONFIRMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFBR5DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309629,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LATE IN MARCH 2019 I WENT OUT TO MY CAR AT WORK TO DRIVE HOME (HOUR COMMUTE VIA MOSTLY HIGHWAY ROADS). WHEN I PUT MY CAR IN REVERSE, THE STICK SHIFT DIDN'T SEEM RIGHT. WHEN I ATTEMPTED TO PUT THE CAR IN 1ST GEAR IT WOULD NOT GO. AT THAT POINT I ONLY HAD 2ND AND 4TH GEAR AVAILABLE (3RD AND 5TH WOULD ALSO NOT WORK). I DROVE HOME AT LOWER SPEEDS DUE TO NOT BEING ABLE TO SHIFT INTO 5TH GEAR. I IMMEDIATELY DROPPED THE CAR OFF AT A TIRES PLUS IN ATHENS, GA WHERE I LIVE. I THOUGHT MY CLUTCH HAD GONE OUT AS BY THE TIME I GOT THERE I COULD NO LONGER SHIFT GEARS AT ALL (STUCK IN 2ND). OVER THE NEXT FEW DAYS, TIRE PLUS TOLD ME THEY THOUGHT IT WAS MY TRANSMISSION AND THEY ADVISED ME TO LOOK INTO GETTING IT FIXED ELSEWHERE DUE TO THEM NOT BEING ABLE TO DO THE WORK. ONE OF THE TECHS THERE DID MENTION THE POSSIBILITY THAT IT COULD BE THE SHIFTER CABLE AND THAT IT MIGHT BE WORTH IT TO TAKE IT TO A CHRYSLER DEALERSHIP TO VERIFY. I THEN PICKED THE CAR UP AND DELICATELY DROVE IT TO ATHENS DODGE CHRYSLER JEEP ON 4/1/19. THEY RAN DIAGNOSTICS AND DETERMINED SURE ENOUGH- IT WAS A BROKEN SHIFT CABLE (INVOICE ATTACHED SAYS THEY \"REPLACED SHIFTER CABLES\"). I RECENTLY BECAME AWARE OF A RECALL (VIA MAIL?) ON FIATS IN THE AGE RANGE OF MY VEHICLE (NHTSA CAMPAIGN ID: 19V817000 AND CHRYSLER RECALL #VB4) AND UPON LOOKING INTO IT ON BOTH THE NHTSA AND FIAT SITES, FOR WHATEVER REASON MY CAR WASN'T UNDER THE RECALL. I CALLED CHRYSLER DIRECTLY AT 800-853-1403 AND THE REPRESENTATIVE I SPOKE TO SAID SHE DIDN'T UNDERSTAND WHY MY VIN # WASN'T ONE THAT WAS RECALLED BASED ON THE NATURE OF THE MALFUNCTION AND SUBSEQUENT REPAIR LAST APRIL. SHE SAID THAT PEOPLE CALL ALL THE TIME HAVING ALREADY HAD THE WORK COMPLETED PRIOR TO THE OFFICIAL RECALL SEEKING (AND RECEIVING) REIMBURSEMENT. SHE SUGGESTED GOING TO THIS SITE TO REQUEST THAT MY SPECIFIC VEHICLE BE ADDED TO THE RECALL SO THAT I COULD BE REIMBURSED, AS WELL.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302539,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO WEEKS AGO, I GOT INTO MY CAR AND UPON STARTING IT FOUND THAT IT WAS UNABLE TO SHIFT INTO REVERSE GEAR (MY CAR IS A 5-SPEED MANUAL TRANSMISSION). FOLLOWING THIS INCIDENT I HAD THE CAR TOWED TO A GARAGE, AND AFTER CONSULTING A MECHANIC, I WAS TOLD THAT THERE HAD BEEN A FAILURE WITH THE SHIFT CABLE BUSHINGS AND THAT A TOTAL REPLACEMENT WAS NEEDED; I WAS ALSO TOLD THAT THE 2013 FIAT 500 HAD BEEN ISSUED A RECALL BY THE COMPANY FOR THIS VERY ISSUE. HOWEVER, AFTER TALKING WITH A REPRESENTATIVE OF FIAT, I WAS TOLD THAT MY CAR'S VIN NUMBER WAS NOT IN THE RECALL GROUP. AS A RESULT, I WAS FORCED TO PAY FOR THE REPAIR INDEPENTLY. I AM WRITING, AT THE RECOMMENDATION OF MY MECHANIC, TO REQUEST THAT MY VEHICLE TO BE ADDED TO THE RECALL GROUP AND THAT THE REPAIR EXPENSES BE REIMBURSED.",
        "vin": "3C3CFFHH3DT"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290445,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT JUST \"HAPPENED\", BUT RATHER CONSTANTLY HAPPENING. THE \"WHEN DID THIS HAPPEN\" DATE BELOW IS WHEN IT STARTED, RIGHT AFTER I BOUGHT IT.  EVERY SINGLE TIME BRAKING SPEED REACHES AROUND 6MPH: AS I BRAKE FROM OVER 7MPH, THE BRAKES SUDDENLY GRAB, DECELERATING ALMOST VIOLENTLY.  1 OF MY FRIENDS BOUGHT A 2014, & ANOTHER LEASED A 2016, & THEY BOTH HAVE THE SAME PROBLEM.  I'M A MEMBER OF FIAT500USERS.COM & IT SEEMS LIKE EVERY SINGLE VEHICLE OF THIS MODEL HAS THE SAME ISSUE, REGARDLESS OF MANUFACTURING DATE.",
        "vin": "3C3CFFGE0DT"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287463,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO FILL UP GAS AT A FUEL FILLING STATION THE CAR WILL NOT TAKE IN ANY FUEL FROM THE GAS STATION PUMP. IT REACTS LIKE THE TANK IS FULL BUT IT IS NOT. A VERY SMALL STEADY FLOW OF FUEL WILL FLOW (APPROX 20CENTS) AND THEN OVERFLOW AS IF IT IS FULL. THIS IS A DANGEROUS PROBLEM AT THAT THE GAS PUMP AND HAS ALSO CAUSED ME TO RUN OUT OF FUEL ON THE FREEWAY AS WELL WHICH COULD CAUSE SERIOUS ACCIDENTS. FIAT DEALER SAYS THEY HAVE NOT HEARD OF THIS ISSUE, BUT I AM FINDING 1000'S OF OWNERS ONLINE WITH THE SAME ISSUE.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286354,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED, WAITING FOR A GREEN LIGHT IN MODERATE MORNING TRAFFIC; MY CAR WAS WORKING PROPERLY. THE LIGHT CHANGED, I MOVED ... COULD NOT ENGAGE ANY GEARS OTHER THAN FIRST AND REVERSE. I WAS ABLE TO PULL INTO A SMALL BUSINESS MALL; ONLY 1ST AND REV. I CALLED FOR AAA, I WAS NOT THAT FAR FROM THE DEALER FROM WHOM I PURCHASED THIS USED FIAT IN JANUARY 2017- APPROXIMATE MILEAGE 19,600 IN THAT MONTH. THE DEALER DIDN'T CARE ABOUT MY DIFFICULTIES; WOULD NOT LOOK AT IT FOR 3-5 DAYS AND THEN WOULD AUTOMATICALLY ATTACH A $275 CHARGE - \"JUST TO TAKE A LOOK AT IT\". I ASKED THEM TO NOT LOOK AT IT AND LEFT WITH MY RIDE. THE DEALER'S FIRST EFFORT WAS TO LOOK AT MY FIAT'S WARRANTY STATUS - NONE, EXPIRED DUE TO DATE ON JANUARY 7, 2017!!  TWO DAYS LATER, I RETURNED, I COULD NOT HAVE AAA TOW ME FROM THAT LOCATION SO, - HAVING JUST 1ST AND REV, I DROVE OUT INTO A BUSY BOULEVARD TO 'RELOCATE' THE CAR FOR A TOW TO AN INDEPENDENT  REPAIR SHOP NEAR MY HOME. THERE, A FEW DAYS LATER IT WAS DETERMINED THE TRANS AXLE HAD FAILED; HE PREPARED AN ESTIMATE OF $2,700 TO REPLACE IT WITH A USED TRANS AXLE.   I AM A 76 YEAR OLDSENIOR CITIZEN TRYING TO SURVIVE ON JUST SS; AFTER A LENGTHY TIME TRYING TO CONVINCE FCA THEIR CAR FAILED AT 19,600 AND SEEKING PRO BONO LITIGATION, I FINALLY HAD TO TAKE OUT A PERSONAL LOAN THAT WILL COST ME $3,762!!!  THE INDEPENDENT REPAIR SHOP HAS VERY QUALIFIED TECHNICIANS ON STAFF, THEIR VP WORKED IN NASCAR THEIR SHOP IS AAA CERTIFIED. NONE OF THESE QUALITIES ARE PROVIDED BY THE DEALER.  SINCE AUGUST 15TH I HAVE A USED TRANS AXLE WITH APPROXIMATELY 85,000 MILES ON IT FROM AN ABARTH ON MY CAR. TO DATE IT'S PERFORMING 'OKAY'.   THERE IS LITTLE TRUST WHENEVER I DRIVE IT; I'M NOT TRUSTING IT ENOUGH TO TAKE A LONG TRIP.   WHEN I GOT THE FIAT, THE TIRES WERE ALMOST BALD (DANGEROUS); THEY WERE REPLACED IN JANUARY 2018, OTHER 'ISSUES' ARE SLOWLY APPEARING, BROKEN DASH VENTS, ETC.",
        "vin": "3C3CFFHH1DT"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265891,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SHAFT/INTERMEDIATE SHAFT/INSIDE STEERING COLUMN ISSUE, OUR CAR HAS BARELY 19K MILES.",
        "vin": "3C3CFFBR0DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHITE CLIP WHICH CONNECTS TO THE MASTER CYLINDER ROD HAS BROKEN AND COME OFF THE CLUTCH PEDAL",
        "vin": "3C3CFFFH5DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258389,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I LOST THE ABILITY TO SHIFT BETWEEN GEARS USING THE MANUAL SHIFT.  THE DEALER REPLACED THE ENTIRE CLUTCH AND IT COST ME $2600.  THIS LOST OF SHIFTING IS THE SUBJECT OF A RECALL FOR FIATS BY MY VIN WAS NOT INCLUDED IN THE RECALL.",
        "vin": "3C3CFFFH3DT"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255158,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECT IN MANUFACTURE OF THE DRIVER SIDE SEAT BELT LATCH CAUSES THE SEAT BELT TO FAIL, (NO LONGER LATCH), WHICH IN TURN CAUSES THE AIR BAG TO DISABLE WHILE THE DRIVER IS IN THEIR SEAT AND THE VEHICLE IS IN MOTION. FAILURE OCCURS AT ANY SPEED. EXPOSES DRIVER AND FRONT-SEAT PASSENGER TO DANGER OF SERIOUS INJURY OR DEATH IN THE CASE OF AN ACCIDENT.",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252306,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKARA RECALL: MY 2013 FIAT ABARTH HAS BEEN GIVING PROBLEMS WITH THE TURBO AND SIDE MOLDINGS. AT THE TIME OF PURCHASE, THE MOLDINGS WERE NOT ATTACHED COMPLETELY   AND THE DEALER PROMISED TO REPAIR UNDER THE WARRANTY; HOWEVER, THE MOLDINGS  CONTINUE TO PEEL OFF EVEN AFTER THE VEHICLE WAS SERVICED. SECONDLY, MY VEHICLE CONTINUES TO THROW A P0299 CODE WHILE I'M DRIVING  EVEN AFTER I SPENT THOUSANDS OF DOLLARS TRYING TO REPAIR IT; CONSEQUENTLY, MY VEHICLE IS NOW NOT PASSING THE VEHICLE INSPECTION.",
        "vin": "3C3CFFFH1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2019",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243137,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FIAT'S CHECK ENGINE LIGHT CAME ON,AND UPON BEING DIAGNOSED NO CODES CAME UP FOR THIS CAR.   SOON AFTER BEING DIAGNOSED AS A FAULTY CODE, MY CAR SUDDENLY STOPPED BEING ABLE TO CHANGE GEARS WHILE THE CAR IS RUNNING, ALTHOUGH IT CHANGES JUST FINE WHEM IT IS TURNED OFF. THE FIRST INCIDENCE OF THIS HAPPENING OCCURED WHILE I WAS DRIVING AND POSED A HUGE SAFETY HAZARD",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242701,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE TRUNK FAILED TO UNLOCK. THE VEHICLE WAS TAKEN TO HERITAGE FIAT (11216 REISTERSTOWN ROAD, OWINGS MILLS, MD 21117, (866)-866-3241) WHERE IT WAS DIAGNOSED THAT THE TRUNK PANEL AND WIRING HARNESS WERE CORRODED. THE DEALER REMOVED SOME RUST FROM THE TRUNK PANEL AND LUBRICATED THE WIRING HARNESS, BUT THE FAILURE RECURRED. THE CONTACT STATED THAT THE EXTERIOR DRIVER'S SIDE DOOR HANDLE SEPARATED FROM THE DOOR. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO HAVE THE DOOR HANDLE INSPECTED. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233454,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE VEHICLE WAS DIFFICULT TO SHIFT IN AND OUT OF GEAR AND THERE WAS A LOSS OF POWER. THE VEHICLE WAS TAKEN TO MOSES FIAT-ALFA ROMEO (2041 MACCORKLE AVE, ST ALBANS, WV 25177, (304) 722-4900). THE DEALER STATED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE FAILURES OCCURRED AFTERWARDS. THE VEHICLE WAS NOT REPAIRED AND WAS TOWED TO THE DEALER MORE THAN ONCE. THE DEALER INDICATED THAT THE SAME OEM PARTS NEEDED TO BE REPLACED. THE DEALER TURNED THE CONTACT AWAY TWICE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3C3CFFAR9DT"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11221179,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2013 FIAT 500. WHILE DRIVING 20 MPH ON A STRAIGHT AWAY, ANOTHER VEHICLE CAME OUT FROM A SIDE STREET. THE OTHER VEHICLE CRASHED HEAD ON IN THE CONTACT'S FRONT. THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELT FAILED TO RETRACT. AS A RESULT, OF THE CRASH THE CONTACT SUSTAINED AN INJURY ON A CARTILAGE ON HER STERNUM, FOREHEAD BRUISE FROM THE SUN VISOR ALONE WITH BRUISES ON THE ARM, CHEST, RIBS, AND BACK. THE CONTACT RECEIVED MEDICAL ATTENTION AT AN EMERGENCY FACILITY. THE PERSON THAT CRASHED INTO THE CONTACT WAS NOT INJURED AND DIDN'T NEED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE OTHER PARTIES INSURANCE DEEMED THE VEHICLE TOTALED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THEY PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 29,000. THE VIN WAS INVALID.",
        "vin": "3C3CFFER1DT"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205236,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE SINCE 2014, THE HEAVY DRIVER SIDE, GLASS WINDOW HAS SLID DOWN INTO THE DOOR AND HAS NEEDED EXPENSIVE REPAIRS. DRIVING WITHOUT A FUNCTIONING DRIVER SIDE WINDOW IS NOT SAFE. THE VEHICLE WAS PARKED WHEN THIS HAPPENED. ALSO AT LEAST ONE OR OTHER OF  THE HEADLAMPS NEEDED CHANGING, THREE TIMES, CREATING AN UNSAFE VEHICLE UNTIL I HAD THE TIME TO GET IN AND HAVE THEM FIXED. THE DOORS ARE EXTREMELY HEAVY AND THE STOPS THAT HOLD THEM OPEN, DO NOT WORK WHEN THE CAR IS NOT PARKED ON THE LEVEL (WHICH IT HARDLY EVER IS, IN THE HILLY SAN FRANCISCO BAY AREA). THIS CREATES A MAJOR RISK OF THE HEAVY DOOR SLAMMING ONTO YOUR LOWER LIMBS AS YOU GET IN AND OUT OF THE CAR. THESE ARE SIGNIFICANT SAFETY DEFECTS IN THE DESIGN OF THIS CAR, AND SHOULD BE REPORTED TO THE MANUFACTURER.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204553,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK LATCH FROZEN. CANNOT OPEN. NO SIGNS OF DAMAGE OR RODENT ACTIVITY,  GOOGLE SEARCH FOUND THIS TO BE COMMON ACROSS MODELS AND YEARS.",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196904,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY COMMON PROBLEM WITH THIS CAR AND HEADLIGHTS WILL NOT TURN OFF AT ANY TIME.",
        "vin": "3C3CFFAR2DT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193127,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN OIL LEAK ON DRIVERS SIDE CAM SEAL OR ACTUATOR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW OIL PRESSURE WARNING LIGHT.  OIL LEVEL WAS FINE. THEN LOSS OF POWER.  TOOK IT TO DEALERSHIP AND NEED NEW ENGINE",
        "vin": "3C3CFFBR5DT"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN 3RD GEAR SLID AND HIT THE GUARD RAIL AND WHEN VEHICLE STOPPED COULDN'T GET VEHICLE OUT OF 3RD GEAR. HAD TO USE BOTH HANDS TO GET VEHICLE INTO 1ST GEAR. AFTER VEHICLE WAS IN 1ST GEAR THE VEHICLE STARTED TO SMOKE AND THE CLUTCH PEDAL STUCK TO THE FLOOR. FOUND A RECALL BULLETIN #16V302000 ON FCA US LLC WEBSITE WHICH DESCRIBES A RECALL FOR S34: \"IF THE CLUTCH DIAPHRAGM SPRING FAILS, THE DRIVER MAY NOT BE ABLE TO SHIFT GEARS OR THE VEHICLE MAY LOSE POWER, INCREASING THE RISK OF A CRASH.\" THAT'S EXACTLY WHAT HAPPEN TO THE VEHICLE. FIAT CHRYSLER WILL NOT STAND BEHIND RECALL S34 ON THIS VEHICLE. VEHICLE WAS IN MOTION DRIVING IN 3RD GEAR AND COULDN'T GET VEHICLE TO GO INTO 4TH GEAR STUCK AND CRASHED ON A COUNTY ROAD.",
        "vin": "3C3CFFHH8DT"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173454,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK ROLL-OVER VALVE MALFUNCTION.  IMPROPER FUELING OF VEHICLE RESULTING",
        "vin": "3C3CFFFH3DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EXPERIENCING THE EXACT PROBLEM DESCRIBED IN RECALL 16V302000 SO I CONTACTED FIAT. THEY WILL NOT REPAIR THE TRANSMISSION BECAUSE MY VIN IS NOT REGISTERED AS AN EFFECTED VEHICLE. I HAVE ON MORE THAN ONE OCCASION RUN INTO PROBLEMS SHIFTING, THE CAR WOULD PHYSICALLY NOT GO INTO GEAR UNTIL A DOWNSHIFT FIRST OCCURRED. THIS HAS CAUSED DRASTIC SLOWDOWNS WHILE DRIVING IN TRAFFIC.",
        "vin": "3C3CFFHH3DT"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154487,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS WERE INTERMITTENTLY FAILING TO TURN OFF, DRAINING THE BATTERY AND CAUSING THE NEED TO JUMP THE VEHICLE 3 TIMES OVER A COUPLE OF MONTHS. I TOOK THE VEHICLE TO A LOCAL SHOP (BILL SMITH) AND IT WAS FOUND TO BE WORKING PROPERLY, NO PROBLEMS WERE FOUND WITH THE BODY CONTROL MODULE OR ANY OTHER SYSTEM.  THEN NEXT WEEK I TOOK THE VEHICLE IN FOR A RECALL TO REPROGRAM POWER CONTROL MODULE AND THIS CAUSED THE HEADLIGHTS TO STAY ON PERMANENTLY, CONSTANTLY DRAINING THE BATTERY.  THE DEALER (BOB BAKER CARLSBAD) REFUSED TO FIX THE PROBLEM OR EVEN RE-DO THE RECALL PROGRAMMING OR DIAGNOSE THE PROBLEM.  SUBSEQUENTLY ANOTHER DEALER (JACK POWELL) FOUND THAT AFTER THE RECALL WORK THE BODY CONTROL MODULE WAS NOW DAMAGED.  THIS PROBLEM WAS CAUSED OR WORSENED BY THE RECALL WORK AND THE BOB BAKER REFUSED ANY ASSISTANCE TO REPAIR THE DAMAGE THEY CAUSED.",
        "vin": "3C3CFFER2DD"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF MOTIVE POWER WHILE I DRIVE AND I HAVE TO PULL OVER ON THE HIGHWAY.  THIS HAS HAPPENED MANY TIMES.  I HAVE TAKEN THE CAR TO FIAT AND THEY HAVE NOT FIXED THE ISSUE.  FIAT HAS A RECALL ON MY TYPE OF CAR EXCEPT FCA US LLC SAID MY VIN IS NOT INCLUDED. NHTSA CAMPAIGN ID # 16V302000.  I DO NOT WANT PASSENGERS TO BE IN MY CAR BECAUSE OF THE RISK OF DEATH.  THERE IS A SIGNIFICANT DANGER TO MYSELF AND OTHERS.",
        "vin": "3C3CFFFH3DT"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150242,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - WE HIT A DEER WITH OUR 2013 FIAT 500 LOUNGE WHILE DRIVING ON THE HIGHWAY. OVER $5,000 IN DAMAGE TO THE FRONT OF THE CAR. NONE OF THE AIRBAGS DEPLOYED.",
        "vin": "3C3CFFER2DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140088,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION LOST GEARS WHILE MERGING WITH TRAFFIC.  DUE TO SHIFTER CABLE BUSHING FAILURE.  LOST 3RD, 4TH & 5TH YEAR.    THIS HAS CAUSED NUMEROUS OWNERS STRANDED.    HTTP://WWW.FIAT500USAFORUM.COM/SHOWTHREAD.PHP?21879-LOST-SOME-GEARS-SHIFTER-BROKEN/PAGE3",
        "vin": "3C3CFFFH0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139462,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED DIFFICULTY SHIFTING GEARS, AND ONCE THE CAR STOPPED ON THE HIGHWAY; WAS ABLE TO GET IT INTO THIRD GEAR TO MOVE THE CAR.  ONCE THE VEHICLE WAS PARKED 10/09/2018 I WAS UNABLE TO ENGAGE THE GEARS; THE MANUAL GEARSHIFT WOULD NOT ENTER ANY GEAR.  EXTREMELY DANGEROUS WHILE ON THE ROAD, AS YOU ARE UNABLE TO MOVE THE VEHICLE.  THE VEHICLE WAS TOWED.  I CALLED FCA AND THEY ADVISED THAT THIS IS NOT PART OF THE RECALL, BUT THE VEHICLE IS EXPERIENCING EXACTLY THE SAME ISSUES AS THOSE INCLUDED IN THE RECALL.  I WOULD HAVE TO PAY OUT OF POCKET TO TOW THE THE VEHICLE A 2ND TIME TO A FCA REPAIR SHOP WITH NO GUARANTEE THAT A) THEY CAN FIX IT; B) THEY WILL COVER ANY OF THE COSTS INCURRED; C) THEY WOULD INCLUDE THIS INFORMATION OR VEHICLE IN THE REPORTING OF THOSE AFFECTED BY THE (ALREADY KNOWN) S34 RECALL.   VEHICLE HAS LESS THAN 80K MILES AND I CONSISTENTLY BROUGHT IT TO FCA DEALERSHIP AND SERVICE CENTERS SINCE PURCHASE.  I AM THE ORIGINAL OWNER.",
        "vin": "3C3CFFHH2DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123115,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DOWN THE HIGHWAY, (76 EAST IN AKRON OHIO)TO TAKE MY CAR TO THE SHOP FOR A CHECK ENGINE AND BATTERY LIGHT THAT CAME ON, WARNING LIGHTS OF ALL SORTS STARTED TO POP UP. IT BASICALLY APPEARED TO CYCLE THROUGH ALL OF THE WARNING LIGHTS. I WAS PROBABLY ONLY AT 45 MPH, BARELY HIGHWAY SPEED, BUT IT IS HARD TO KNOW AS THE RMP AND SPEEDOMETER KEPT FLUCTUATING WILDLY. THEN THE CAR SLOWLY DIED TO A DEAD STOP WHILE ON THE HIGHWAY. I STILL HAD LIGHTS AND AIR, AND ALL OTHER ELECTRICAL THINGS BUT THE CAR WOULD NOT RESTART. I MANAGED TO GET SAFELY TO THE SIDE OF THE ROAD, A GENTLEMEN FROM THE STATE FARM ROAD SIDE ASSISTANCE PUSHED ME INTO THE BEGINNING OF A CLOSED LANE. I WAS TOLD THIS ISSUE WAS MY ALTERNATOR NOT CHARGING PROPERLY. THERE IS ONLY ABOUT 52K MILES ON MY CAR.",
        "vin": "3C3CFFCR3DT"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119658,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 14, 2018, I BEGAN EXPERIENCING TROUBLE WITH MY FIAT 500 SPORT IVE ONLY HAD 2-3 MONTHS. I WAS DRIVING THE VEHICLE IN SOME TRAFFIC WHEN IT SUDDENLY LOSS OF POWER. THE CAR BEGAN SENDING MULTIPLE CODES DEALING WITH THE POWERTRAIN AND TRANSMISSION. RIGHT NOW NO OBD II DEVICES ARE ABLE TO READ THE CODES BECAUSE NOTHING SHOWS. I AM UNABLE TO TRACK MY VEHICLE'S MILEAGE AS WELL. THE CHECK ENGINE AND ESC LIGHTS ARE ON. IF DRIVEN THE TRANSMISSION LIGHT COMES ON AND THE CAR TRIES TO STALL. THE OIL HAS BEEN CHANGED AS REQUIRED. THERE IS VERY ROUGH IDLING. THERE ARE CONSTANT MISFIRES IN ONE OF THE CYLINDERS. I HAVEN'T DRIVEN THIS CAR IN OVER A MONTH. TODAY I HAVE FINALLY MANAGED TO GET IT TO THE DEALERSHIP. I'M NOT SURE WHAT THEY WILL SAY IS THE PROBLEM BUT I FEEL ITS A BAD ECU/BCM/PCM.",
        "vin": "3C3CFFBR4DT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "07/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SIGNS OF ANY PROBLEMS. OIL CHANGE DONE LESS THAN 3 WEEKS. WHILE DRIVING CHECK ENGINE LIGHT CAME ON AND IN LESS THEN 2 MINS LOSS OF POWER UNTIL COMPLETE STOP AND CAR SHUT OFF. TURNS OVER BUT CAR SHAKES GOT IT TOWED HOME. CAR REMAINS UNABLE TO DRIVE. SHAKES WITH NOISES IN THE ENGINE WHEN ON. I'VE ONLY HAD THE CAR FOR 2 YEARS SO I'M SHOCKED I AM HAVING THIS PROBLEM.",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104233,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I BOUGHT THE CAR WHEN I PUT IT INTO REVERSE IT SLIPS OUT OF GEAR. IVE HAD IT SINCE 2014. I'VE LOOKED UP RECALLS BUT IT HASN'T BEEN RECALLED YET. IT LOOKS AS THOUGH SEVERAL MODEL CLOSE MINE ARE HAVING THE SAME ISSUE AND HAVE BEEN RECALLED ALREADY.  I WILL BE TRYING TO REVERSE ON A STREET AND IT POPS OUT OF GEAR AND GRINDES. THIS ISSUES HAPPENS FREQUENTLY AND HAS GOTTEN ME CLOSE TO ACCIDENTS.",
        "vin": "3C3CFFFH1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100165,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE VEHICLE WOULD NOT SHIFT GEARS AND REMAINED IN NEUTRAL WHILE ATTEMPTING TO SHIFT INTO PARK. AS A RESULT OF THE FAILURE, THE VEHICLE CONTINUED TO ROLL AND ALMOST CRASHED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS CONTACTED AND STATED THERE WERE NO RECALLS ON THE VEHICLE. THE FAILURE MILEAGE WAS 98,000.",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075555,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURN MY STEERING WHEEL TO THE LEFT OR RIGHT I HEAR A CLICKING NOISE UNDER THE DRIVERS SIDE FLOOR MAT. IT ALSO MAKES A SNAPPING NOISE. I HAD A MECHANIC PUT MY CAR ON THE LIFT AND BOTH LEFT AND RIGHT RUBBER STRUT MOUNTS APPEAR TO BE QUITE LOOSE. THE CAR ONLY HAS 50K MILES ON IT. I HEAR THE POPPING AND SNAPPING NOISE AT SPEEDS LESS THAN 20 MPH AND WHEN GOING FORWARD OR BACKING UP. I NOW HAVE GREASE KICKING UP FROM THE DRIVERS SIDE.",
        "vin": "3C3CFFBRXDT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065424,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A MONTH AGO, MY WIFE WAS DRIVING TO/FROM WORK AND NOTICED A \"CHECK ENGINE\" LIGHT COME ON. WE IMMEDIATELY SCHEDULED AN APPOINTMENT WITH OUR LOCAL STUDIO AND CONTINUED TO DRIVE THE CAR AS NORMAL. AT THIS POINT, NOTHING WAS GOING ON WITH THE CAR, EXCEPT THAT THE LIGHT CAME ON. A DAY OR TWO LATER, THE LIGHT WENT OFF, AND THE CAR CONTINUED TO ACT NORMAL. WE ENDED UP CANCELING THE APPOINTMENT, GUESSING THAT THERE WAS A GLITCH WITH THE COMPUTER. THE VERY NEXT MORNING, MY WIFE STARTED THE CAR TO FIND THE ENGINE SHAKING AND THE EXHAUST MAKING A STRANGE SOUND, SO SHE SHUT THE ENGINE OFF AND WE HAD THE CAR TOWED TO THE DEALERSHIP. A COUPLE OF DAYS LATER, I GOT A CALL FROM THE STUDIO EXPLAINING THAT THE CAR WAS VERY LOW ON OIL AND THAT IT APPEARS THE CAR'S BEEN CONSUMING OIL AT AN ACCELERATED RATE. HE SAID THEY PERFORMED AN OIL CHANGE AND THAT, PER FIAT'S PROTOCOL, THEY'D PERFORM AN OIL CONSUMPTION TEST BY LETTING US DRIVE THE CAR FOR 750 MILES AND THEN WE'D HAVE TO BRING THE CAR BACK TO LET THEM CHECK EVERYTHING OUT. I WENT TO PICK UP THE CAR ONLY TO FIND THE SAME ISSUE THAT MY WIFE HAD DESCRIBED (ENGINE SHAKING, EXHAUST MAKING NOISE). IT WAS LATE AND THE SERVICE DEPARTMENT WAS CLOSED, SO I LEFT THE KEY WITH THE RECEPTIONIST AND EXPLAINED THAT THE CAR WAS IN THE SAME CONDITION AS WHEN WE HAD IT TOWED AND THAT I'D LIKE THEM TO FIND OUT WHAT'S GOING ON. A FEW DAYS LATER, THE STUDIO CALLED TO EXPLAIN THAT THE ENGINE'S OIL PRESSURE WAS SHOT AND THAT THE ENGINE NEEDED TO BE REPLACED. CYLINDER 3'S OIL VALVE WAS STUCK AND THE CYLINDER WAS MIS-FIRING. THE STUDIO RECOMMENDED REPLACED THE ENGINE AS OPPOSED TO INVESTIGATING WHAT FAILED, SINCE THE INVESTIGATION COULD TAKE HOURS AND COST MORE THAN AN ENGINE REPLACEMENT. THIS IS MY SECOND FIAT; THE FIRST EXPERIENCED THE CLUTCH RECALL THAT I HAD PREVIOUSLY REPORT TO NHTSA AND THANKS TO MINE AND OTHERS REPORTS, A RECALL WAS ISSUED.",
        "vin": "3C3CFFFH5DT"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064867,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT, TRANSMISSION LIGHT COME ON INTERMITTENTLY. AMBIENT TEMP SENSOR RECORDS CRAZY TEMPS AS LOW AS NEGATIVE 40 F. PLASTIC CASING AROUND PASSENGER SIDE VIEW MIRROR MELTED WHICH IS WHERE AMBIENT TEMP SENSOR IS LOCATED AND COULD BE FIRE HAZARD. DEALER HAS CHANGED AMBIENT SENSOR BUT WARNINGS AND WILD TEMPS STILL OCCURRING. INCIDENTS OCCUR AS SOON AS CAR IS TURNED ON AND STAY ON FOR  VARIOUS AMOUNTS OF TIME",
        "vin": "ZFBCFADH6EZ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054735,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE DRIVER'S SEAT SEAT BELT DID NOT RETRACT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO MCKEVITT CHRYSLER DODGE JEEP RAM (700 SHATTUCK AVE #100, BERKELEY, CA 94705, (510) 848-2206). THE DEALER STATED THAT THE VEHICLE COULD BE REPAIRED FOR $400 AND THAT THE SEAT BELT WOULD RETRACT IN THE EVENT OF A CRASH. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. CHRYSLER STATED THAT THEY WOULD OPEN A TICKET AND ADVISED THE CONTACT TO FILE A VEHICLE SAFETY COMPLAINT. THE FAILURE MILEAGE WAS 44,000. *TT",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054239,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING APPROXIMATELY 60 MPH, THE SUN ROOF SHATTERED ABRUPTLY. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE OR AFTER THE FAILURE. THE ALFA ROMEO OF MANHATTAN DEALER (629 W 54TH ST, NEW YORK, NY) WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS REPAIRED. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 36,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043104,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING BETWEEN BODY AND TRUNK LID BREAKS DUE TO POOR DESIGN AND SHIELDING NOT PROTECTING THE WIRES.. 4 WIRES BROKEN CAUSING THE LICENSE PLATE LIGHT TO NOT BE LIT. THIS IS A TICKETABLE OFFENSE IN MASSACHUSETTS AND RESULTS IN A SURCHARGE ON THE DRIVERS LICENSE.",
        "vin": "3C3CFFDR1DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033865,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALREADY REPLACED BOTH FRONT WINDOW REGULATORS AT $189.00 EACH. THE PLASTIC PIECT BREAKS OFF. WHEN I TOOK IT TO FIAT THE REPAIR GUY SAID HE IS CHANGING OUT  ABOUT 4 A DAY. I REPLACED MINE IN 2015 AND YET AGAIN THE SAME PIECE HAS BROKEN OFF. HOW IS THIS NOT A RECALL AS MANUFACTURE DEFECT? I HAVE ATTACHED PHOTO.",
        "vin": "3C3CFFAR3DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024137,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 FIAT POP WAS CALLED IN FOR A RECALL ON THE CLUTCH PLATE AND SPRING. DESERT FIAT OF VICTORVILLE  MADE THE REPAIR AND I DROVE IT UNTIL JUNE 6,WHEN THE CLUTCH FAILED AND I HAD IT TOWED TO THEIR SERVICE CENTER. THEY HAD MY CAR FROM JUNE 6 UNTIL JULY 7. WHEN I SPOKE WITH FCA (888-242-6342 FILE #[XXX])THEY TOLD ME I HAD TO AUTHORIZE THE SERVICE AND THEY WOULD HELP IF THE REPAIR WAS NOT COVER UNDER THE RECALL.  THE REPAIR IS 1748.00 AND THEY ARE HOLDING MY CAR HOSTAGE AND WILL NOT NEGOTIATE WITH ME AS THEY SAID THEY WOULD. THEY HAVE THREATEN TO PUT A LIEN ON MY CAR. I HAVE CONTACTED THE BUREAU OF AUTOMOTIVE REPAIR ([XXX])AND THEY HAVE FOUND 3 VIOLATIONS . I AM TRYING TO GET MY CAR BACK IS THERE ANYTHING THAT CAN BE DONE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2017",
        "dateOfIncident": "08/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021313,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON AND IT REVEALED A EVAP LEAK WHICH HAS HAPPENED BEFORE AND MECHANIC FOUND NO LEAK AND SAID IT MUST HAVE BEEN GAS CAP. A COUPLE MONTHS LATER LIGHT CAME ON AGAIN FOR THE SAME EVAP LEAK CODE. BUT THEN THE CAR BEGAN TO SHUDDER WHILE COMING TO STOP AND RAN ODD. TOOK IT TO FIAT DEALERSHIP. TURNS OUT THERE WERE THREE CODES OR MORE WHICH CANNOT BE READ UNLESS AT DEALERSHIP. SURPRISE SURPRISE. TOTAL REPAIR COSTS WERE 2500 AND I HAD NO IDEA MY CAR WAS MESSED UP CAUSE ENGINE LIGHT DID NOT INDICATE ISSUES. KEPT SAYING EVAP WHEN I HAD AN OIL PRESSURE SENSOR MESSED UP. GASKETS LEAKING AND A BLOWN VALVE ACTUATOR ASSEMBLY. CAR HAS LESS THAN 45K AND IS WELL MAINTAINED AND DRIVEN. VERY UPSET AT THE LOST OF INCOME. IT HURTS. IT'S A LOT OF MONEY FOR NO REASON. DISAPPOINTED IN AMERICAN BUILT CARS.",
        "vin": "3C3CFFFH2DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011605,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS BETWEEN THE CHASSIS AND THE TRUNK LID BREAKS. THERE ARE SEVERAL BROKEN WIRES. THIS IS CAUSING THE \"CHECK LICENSE PLATE LIGHT\" WARNING ON THE INSTRUMENT PANEL. THE LICENSE PLATE LIGHT IS OUT WHICH IS A TICKET-ABLE OFFENSE WITH SURCHARGE IN THE STATE OF MASSACHUSETTS WHERE THE CAR IS REGISTERED.     THE EXPOSED WIRES COULD ALSO ARC AND CAUSE A FIRE.",
        "vin": "3C3CFFDR1DT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010038,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO AN APPOINTMENT AND WAS SITTING AT A RED LIGHT WHEN MY FIAT BEGAN TO SHAKE.  I TOOK IT TO THE FIAT DEALERSHIP AFTER MY APPOINTMENT ON JUNE 16, 2017.  THE FOLLOWING TUESDAY THEY SAID I WAS MY SPARK PLUGS AND I APPROVED CHANGING THEM. WHEN THEY STARTED THE CAR AGAIN THEN THEY GOT A MESSAGE STATING NO COMPRESSION IN CAM 2.  I AN THE ORIGINAL OWNER AND HAVE HAD THE CAR JUST UNDER 4 YEARS. I  HAVE HAD ALL THE SCHEDULED MAINTENANCE DONE THERE AT THE DEALERSHIP. I HOWEVER HAVE 54K ON THE ENGINE SO I AM JUST OUTSIDE OF THE WARRANTY.    I HAVE BEEN GOING THROUGH VARIOUS FIAT FORUMS AND SEE THAT THIS SEEMS TO BE AN ISSUE WITH CAM 2.",
        "vin": "3C3CFFDR0DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000347,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY VEHICLE IN A PUBLIC LOT AND WHEN I RETURNED TO MY VEHICLE AND STARTED IT THE LIGHTS TURNED ON THEN SHUT OFF QUICKLY AND THE KEY WAS STUCK IN THE IGNITION. I JUMP STARTED THE VEHICLE WHICH SEEMED TO JUST CHARGE IT AND WAS ABLE TO GET THE KEY RELEASED AND THE POWER, LIGHTS AND WINDOWS ALL WORKING AGAIN BUT WHEN I TURNED TO START THE ENGINE IT DOES NOTHING BUT CLICK. I ALSO TRIED BOTH KEYS THAT I HAVE FOR THE VEHICLE AND THE POWER LOCK AND UNLOCK DOES NOT EVEN WORK.",
        "vin": "3C3CFFCRXDT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "05/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000436,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE OIL PRESSURE AND SERVICE ENGINE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS SERVICED BY AN INDEPENDENT MECHANIC. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE CONTACT STATED THAT THE MANUFACTURER HAD NOT SUPPLIED THE REMEDY AND PARTS WITHIN A REASONABLE TIME FRAME. MONTHS AFTER WAITING FOR THE RECALL REPAIR PARTS, THE CLUTCH WAS NOT FUNCTIONING PROPERLY AND THERE WAS A STRONG VIBRATION COMING FROM THE PEDAL. THE MANUFACTURER HAD A DEALER (BOB FRENSLEY CHRYSLER JEEP RAM FIAT IN MADISON, TN) SCHEDULE AN APPOINTMENT FOR JULY 6, 2017. IN THE INTERIM, THE CONTACT COULD OBTAIN A RENTAL VEHICLE AND WOULD BE REIMBURSED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "10/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000504,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE LOSS OF POWER WHEN DRIVING , I FILED FOR LEMON LAW. I WON. NOW THEY ARE GOING TO SELL THIS CAR ON THE INTERNET AS A BUY BACK.",
        "vin": "ZFBCFADH5EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "05/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994378,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE ATTEMPTING TO DRIVE OUT OF A PARKING STRUCTURE, THE CONTACT WAS UNABLE TO SHIFT THE VEHICLE INTO GEAR. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE SHIFTER CABLE FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "3C3CFFDR4DT"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "01/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993790,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED SEVERAL RECALLS ON MY CLUTCH. I TOOK IT TO MY DEALERSHIP AND THEY WERE MADE AWARE OF THE ISSUE JANUARY 11TH, 2017 AND THEY STILL HAVE YET TO CONTACT ME. ALSO I HAVE AN OIL LEAK IN WHICH THEY SAID THEY FIXED. RIGHT AFTER I TOOK IT HOME OIL HAS BEEN FLOODING OUT OF IT AND SPRAYING ALL OVER MY CAR. THIS SHOULD NOT BE A PROBLEM GIVEN MY MILES AND YEAR OF MY CAR. I GOT ALL OF THE NECESSARY OIL CHANGES BUT HAVE NO PROOF SINCE MY HUSBAND DID THEM HIMSELF AND PAID CASH FOR THE ITEMS HE NEEDED. SO THE DEALERSHIP IS REFUSING TO WORK WITH ME AT ALL WITH THIS ISSUE EVEN THOUGH THEY MADE THE OIL LEAK WORSE THEN IT ORIGINALLY WAS.",
        "vin": "3C3CFFBR7DT"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUCKLING MECHANISM IS JAMMED ON THE DRIVER'S SIDE CAUSING ME NOT TO BE ABLE TO BUCKLE THE SEAT BELT IN MY CAR. THE CAR \"THINKS\" THERE IS ALREADY A SEAT BELT BUCKLED. I AM USING THE PASSENGER SIDE BUCKLE FOR THE DRIVER'S BELT AT THIS TIME. IF I HAVE A PASSENGER, BOTH OF US CANNOT BE BUCKLED IN.",
        "vin": "3C3CFFAR9DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "03/20/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980807,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT ATTEMPTED TO DOWNSHIFT TO EXIT THE HIGHWAY, BUT THE VEHICLE DID NOT ENGAGE IN GEAR. THE VEHICLE LOST ACCELERATION AND WAS RUNNING VERY SLOWLY. THE CONTACT PULLED OVER TO THE SHOULDER AND NOTICED A BURNING ODOR. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DETERMINED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE CONTACT NEVER RECEIVED ANY COMMUNICATION FROM THE MANUFACTURER. THE VEHICLE HAD BEEN AT THE DEALER FOR FIVE WEEKS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 29,000.",
        "vin": "3C3CFFAR2DT"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "04/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980843,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A SEVERE ACCIDENT ON INTERSTATE 405 WHERE A LARGE SUV HIT US FROM BEHIND AT SPEED AND PUSHED US INTO A STATIONARY TRUCK. BOTH THE REAR AND FRONT OF THE CAR WERE SEVERELY DAMAGED. WE WERE MODERATELY INJURED. WERE GIVEN FIRST AID BY PARAMEDICS AND WE CHOSE NOT TO GO TO EMERGENCY AND GO TO URGENT CARE INSTEAD.",
        "vin": "3C3CFFFH2DT"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR CUTS OFF WHILE DRIVING OR BEING IDLED. I WOULD DRIVE IT IN THE CITY AND AFTER ABOUT 20-30 MINUTES OF DRIVING STOP AND GO. IT WOULD CUT OFF WHILE I'M STOPPED AT A LIGHT. THEN I WOULD PUT IT IN PARK AND IT WOULD RESTART. THEN AFTER THAT IT WOULD READ AS HIGH COOLANT. ALSO GOING UP STEEP HILLS IT WOULD CUT OFF WHEN I TURN IT AT THE TOP OF THE HILL AND READ NOTHING JUST COMPLETELY TURN OFF. I FINALLY GOT TO REPLICATE THE PROBLEM WITH FIAT SERVICE AND THEY ARE TRYING TO FIGURE OUT HOW TO STOP IT FROM CUTTING OFF. THIS SHOULD BE A RECALL AND REPLACE BY FIAT",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968876,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL IN EFFECT SINCE MAY OF 2016.  NO REMEDY AS OF YET.  PLEASE FOLLOW UP ON THIS",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958017,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FIRST BOUGHT MY CAR I HAD ISSUES WITH A TAIL LIGHT GOING OUT WITHIN THE FIRST 6 MONTHS. THEN A HEADLIGHT 2 MONTHS AFTER THAT THEN 12 MONTHS A TAILLIGHT THEN ANOTHER TAILLIGHT AND HEADLIGHT WELL YOU SEE WHAT I MEAN THEN THEY RECALLED A CLUCH ON MY CAR BUT THEY DIDNT HAVE A REPLACEMNT PART YET AND THEY NEVER CONTACTED ME ABOUT THE RECALL I ASSUME IT WAS THIS ORGANIZATION BUT WHEN I WAS DRIVING AT NIGHT THE CLUCH JUST DROPPED OUT FROM UNDER MY FOOT AND ALMOST CAUSE ME TO CRASH   WHEN I RECOVERED AND HAD TO STOPO BECAUSE OF A RED LIGHT I THROUGH ON MY EMERGANCIES  AND ANOTHER TAIL LIGHT WENT OUT BUT THIS TIME I WAS ALMOST REAR ENDED BECAUSE THEY THOUGHT I WAS SWITHCHING LANES I NEVER RECIEVED A WARNING LIGHT THAT MY TAILLIGHT  WAS OUT NOW I HAVE HAD MY TAIL LIGHT GO OUT AGAIN AND A HEADLIGHT WITHIN A MONTH OF EACH OTHER AND STILL NO WARNING SIGN ALSO NOW THE BATTERY IS GOING OUT ON ME SOMETHIMES I CAN START THE SOMETIMES I CANT BUT NO WARNING SIGN UNLESS ITS NOT GOING TO TURN OVER AT ALL THEN I GET ALL THE BELLS GOING OFF FOR THAT WHEN THEY WERE REPAIRING THE CLUCH I ASKED ABOUT MY WARRENTY AND THEY SAID IT ALREADY RAN OUT BUT THAT WASNT TRUE I WAS CLOSE BUT I HAVE RUST PINHOLES COMING FROM UNDER THE PAINT ALL OVER MY WHITE CAR.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955308,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953934,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500 SPORT HATCHBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFBR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945929,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN), THE DEALER HAD SCHEDULED TWO APPOINTMENTS AND WHEN THE CONTACT ARRIVED THE PART WAS NOT AVAILABLE. THE DEALER THEN ADVISED THE CONTACT TO CALL BACK 30 DAYS LATER TO DETERMINE IF THE PART WAS AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  PARTS DISTRIBUTION DISCONNECT. .....UPDATED 03/08/17 *BF      *CN",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946131,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFBR8DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 FIAT 500.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR RECALL NOTICE 16V-302.  *SMD  THE DEALER INFORMED THE CONSUMER, THE PEDAL ASSEMBLY WAS AVAILABLE. HOWEVER, THE CLUTCH WAS NOT AVAILABLE. THE DEALER STATED THEY WOULD NOT BE PERFORMING ANY RECALLS, UNTIL THE BEGINNING OF THE NEW YEAR. *JB",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "11/19/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937944,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIAT HAS CONTINUOUS DIFFICULTY SHIFTING GEARS.  MANY TIMES IT WON'T SHIFT OUT OF 2ND OR 3RD GEAR AT ALL EVEN WHEN GOING AT HIGHWAY SPEEDS.  THE RPM STAYS AT 3-4 WHEN THIS HAPPENS.  IT IS ALSO DIFFICULT TO ACCELERATE WITHOUT FEELING LIKE THE CAR IS GOING TO EXPLODE.  IN MID-NOVEMBER I WAS LOOKING ONLINE AS TO A POSSIBLE PROBLEM AND FOUND A RECALL \"S34\" THAT BEGAN ON 11/10/16 WHERE IT IS DESCRIBED AS \"THE CLUTCH DIAPHRAGM SPRING CAN FRACTURE & FAIL, CAUSING AN INABILITY TO SWITCH GEARS\".  THE REMEDY WAS TO INSTALL A CLUTCH PEDAL LIMITER & CLUTCH PEDAL SWITCH.  THE DEALER SAID THAT THERE WAS NO REMEDY AT THIS TIME.  I WENT ON THIS WEBSITE AGAIN AND NOW THERE IS NO RECALLS LISTED?  CALLED SEVERAL PEOPLE INCLUDING THE FCA RECALL LINE AND THERE ISN'T A RECALL FOR THIS CAR.  WHEN I CHECKED ONLINE BEFORE I SAW MANY COMMENTS AND COMPLAINTS ABOUT NOT BEING ABLE TO GET THE RECALL S34 PART, SO A SOLUTION WAS NEVER REACHED.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE TWO DEALERS CONTACTED DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFDR8DT"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "11/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10933725,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNED A 2013 FIAT 500. WHILE DRIVING 55 MPH, THE VEHICLE SWERVED TO AVOID A DEER. THE VEHICLE FLIPPED OVER SEVERAL TIMES. THE AIR BAGS FAILED TO DEPLOY. THE ETS WARNING INDICATOR ILLUMINATED PRIOR TO THE CRASH. THE DRIVER SUSTAINED INJURIES TO THE NECK, A CONCUSSION, AND MUSCLE SPASMS THROUGHOUT THE BODY. MEDICAL ATTENTION WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927836,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927193,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (SUSPENSION). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 01/05/17*LJ  CONSUMER HAS TAKEN CAR IN COUPLE TIMES DUE TO SPEEDOMETER DOES NOT REGISTER CORRECT MPH. ON 12/12/2016- VEHICLE WAS TAKEN TO \"DON JACKSON ALFA ROMEO & FIAT TO INSTALL RECALL PARTS. UPDATED 9/5/18*JB",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFARXDT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918468,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFBR7DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917794,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING 35 MPH, THE GEAR SHIFTER AND CLUTCH FAILED, AND THE CONTACT HAD TO USE THE EMERGENCY BRAKE TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFDR7DT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917571,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH COVER DIAPHRAGM SPRING MAY FATIGUE AND/OR FRACTURE.   SAFETY RISK:  A FAILED CLUTCH COVER DIAPHRAGM SPRING MAY RESULT IN THE INABILITY TO DISENGAGE THE CLUTCH, SHIFT GEARS AND THE POTENTIAL FOR A LOSS OF MOTIVE POWER WHICH COULD CAUSE A CRASH WITHOUT WARNING.   REMEDY:    IMPLEMENT A CLUTCH PEDAL LIMITER AND A CLUTCH PEDAL SWITCH.   RECALL STATUS:  RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE",
        "vin": "3C3CFFBR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917332,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913710,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911230,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE REMEDY WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. UPDATED 01/05/2017*CT  UPDATED 01/23/17.*JB",
        "vin": "3C3CFFBR0DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910063,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURES. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907070,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING 60 MPH, THE VEHICLE LOST POWER AND SWITCHED OUT OF GEAR WITHOUT WARNING. THE VEHICLE WOULD NOT ACCELERATE BEYOND 15 MPH ON THE HIGHWAY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906445,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 FIAT 500. WHILE THE VEHICLE WAS PARKED BY THE CURB IN FRONT OF THE HOUSE, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE AND CAUSED IT TO EXPLODE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A TOW YARD. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 22,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903620,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS AND TAILLIGHTS WILL NOT WORK.  THE BULBS \"BURN OUT\" AS SOON AS THEY ARE REPLACED.  THIS ISSUE HAS BEEN ONGOING SINCE THE CAR WAS PURCHASED, THE MANUFACTURER SIMPLY REPLACED THEM WHILE UNDER WARRANTY - NOW THAT THE VEHICLE IS NO LONGER UNDER WARRANTY AND THEIR DEALERSHIPS ARE CLOSED IN THE STATE THEY WISH TO HAVE ME TAKE THE CAR OUT OF STATE, PAY FOR A RENTAL WHILE THEY ATTEMPT TO DIAGNOSE THE PROBLEM.  I HAVE GIVEN THEM 5 OPPORTUNITIES PRIOR TO THIS TIME TO DO SO AND EACH TIME WAS TOLD IT WAS \"BAD BULBS\".  I CANNOT GET THE VEHICLE INSPECTED  AND THERE IS ALSO A RECALL THAT I CANNOT GET SERVICED DUE TO THEIR OTHER FACILITIES BEING UNEQUIPPED TO SERVICE THIS PRODUCT.  THERE ARE OTHER ELECTRICAL PROBLEMS THAT HAVE PLAGUED THE VEHICLE AND STILL ARE, BUT WILL NOT CAUSE A SAFETY INSPECTION FAILURE.  THESE TOO HAVE BEEN SUPPOSEDLY REPAIRED IN THE PAST ONLY TO REOCCUR.  I AM SEEKING YOUR ASSISTANCE AS I HAVE RECEIVED NO RESOLUTION FROM THE MANUFACTURER AND DO NOT HAVE THE MEANS TO PAY FOR A RENTAL CAR OF UNKNOWN DURATION FOR THEM TO ATTEMPT TO DIAGNOSE THIS FOR THE 6TH TIME.   ANY HELP I CAN GET IS APPRECIATED.  THERE HAVE BEEN MULTIPLE OCCURRENCES SINCE 2013.",
        "vin": "3C3CFFAR3DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898627,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A 45 MPH ROAD WHEN SUDDENLY THE CLUTCH PEDDLE FELL TO THE FLOOR, BECAME EXTREMELY STIFF AND BECAME UNRESPONSIVE. THE GEAR SHIFTER STAYED STUCK IN SECOND GEAR AND COULD NOT MOVE. THIS WAS A NARROW, WINDY ROAD WITH NO SHOULDER AND SIGNIFICANT ELEVATION CHANGES RUNNING THROUGH A DENSELY WOODED AREA OF PENNSYLVANIA.  THERE WAS NO WHERE TO PULL OVER AND OTHER CARS ON THE ROAD. THERE IS CURRENTLY A RECALL FOR THIS CLUTCH BUT THE PARTS HAVE NOT YET BEEN MANUFACTURED. I HAVE ALREADY HAD THE CLUTCH REPLACED ONCE, SO THIS NEW CLUTCH ALSO SUDDENLY FAILED WITHOUT WARNING AND WITH NO SIGNS OF THE USUAL CLUTCH WEAR AND FATIGUE. JUST SUDDEN CLUTCH FAILURE WHILE DRIVING. THE CAR HAS59000 MILES ON IT AND IS ONLY3 YEARS OLD. FIAT EXPECTS ME TO PAY IN FULL TO HAVE THE SAME DEFECTIVE CLUTCH PARTS INSTALLED A THIRD TIME. I CAN THEN APPLY FOR REIMBURSEMENT FOR THESE KNOWN DEFECTIVE PARTS. I WILL THEN HAVE TO BRING THE CAR BACK FOR A FOURTH CLUTCH WHEN THE NEW PARTS ARE AVAILABLE UNDER TYRE RECALL.",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898184,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898098,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE IN JUNE, 2 MONTHS LATER AND THE DEALERSHIP IS STILL TELLING ME THAT FIAT HASN'T SENT THEM THE PARTS AND THERE'S NOTHING THEY CAN DO. THE RECALL IS RELATED TO THE CLUTCH GOING OUT. THE RECALL NOTICE NOTED THAT THIS CAN CAUSE AN ACCIDENT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR9DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10894440,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER CONTACTING CHRYSLER CORP I AM BEING TOLD THAT THERE ARE NO PARTS FOR MY RECALL AND THAT I SHOULD MAKE THE REPAIR ON MY OWN UTILIZING THE SAME DEFECTIVE PARTS THAT ARE ON RECALL!!! I ALREADY HAD AN ACCIDENT ON 7/29 WHEN THE CAR STALLED IN THE MIDDLE OF THE STREET AND WHEN I ATTEMPTED TO PUSH IT OUT OF HARMS WAY I FELL HARD ON THE CONCRETE. TO PUT IN AT MY COST THE SAME DEFECTIVE PARTS IS PUTTING MY LIFE IN DANGER.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FIAT 500 STICK SHIFT RECALL  I HAVE CONTACTED CHRYSLER CORPORATE TO INQUIRE ABOUT MY RECALL AND THEY ARE STATING THAT THEY HAVE NO PARTS. IF I WOULD LIKE TO PAY FOR THE REPAIR I COULD THEN I COULD \"BATTLE IT OUT\" WITH CHRYSLER FOR REIMBURSEMENT.  I NEVER RECEIVED A RECALL LETTER. I ONLY FOUND OUT WHEN I CONTACTED THE DEALER. I WAS DRIVING MY CAR WHEN THE STICK SEIZED UP AND I COULDNT SHIFT MY CAR AND IT LEFT ME STRANDED IN THE STREET. I PUSHED MY CAR OUT OF HARMS WAY AND I ENDED UP FALLING ON THE STREET WHEN I LOST CONTROL OF THE CAR PUSHING IT. 2 POLICE OFFICERS CAME TO MY AID. I CONTACTED THE DEALER AND THEY HAD IT TOWED. THEN I WAS ADVISED THAT THERE WERE NO PARTS AVAILABLE/. I HAVE CALLED CHRYSLER CORPORATION BUT NO ONE WILL ADDRESS MY COMPLAINT. I AM WITHOUT A CAR, A RENTAL NOTHING. I WAS ADVISED 3 TIMES THAT A FIAT MANAGER FROM CORPORATE WOULD CALL ME. THEY HAVE NOT. NO ONE WANTS TO ASSIST ME.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892981,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE PULLED TO THE LEFT AND RIGHT. THE SHIFTER GEAR FAILED TO SHIFT. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 13,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 09/22/16*LJ  *TR",
        "vin": "3C3CFFAR2DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892596,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888772,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FROM FCA US LLC REGARDING MY VEHICLE'S SAFETY RECALL (S34 / NHTSA 16V-302) ABOUT A MONTH A HALF NOW.  EVERY TIME I TRY TO REACH FIAT OR THE FCA RECALL ASSISTANCE CENTER, THEY KEEP TELLING ME THAT THE PART HAS NOT BEEN RECEIVED.  PER THE FCA'S NOTICE IT INDICATES THE FOLLOWING \"THE INABILITY TO DISENGAGE THE CLUTCH, SHIFT GEARS AND/OR LOSS OF MOTIVE POWER COULD CAUSE A CRASH WITHOUT WARNING\".  IT'S BEEN OVER A MONTH THAT I GET IN MY CAR WONDERING WHAT IS GOING TO HAPPEN --WILL I CRASH, GET HURT OR EVEN DIE DUE TO THIS?!!?  YET NO ONE IS HELPING AND I KEEP GETTING THE RUN-AROUND.  HOW LONG DOES IT TAKE TO GET THE PART IN QUESTION?  THIS IS UNACCEPTABLE AS WE TRUST THE CARS WE BUY TO BE SAFE!!",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE VEHICLE FAILED TO SHIFT IN AND OUT OF GEAR. THE VEHICLE WAS TOWED TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE TECHNICIAN STATED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 44,000.",
        "vin": "3C3CFFBR7DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883358,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) WAS RECEIVED. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR1DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876350,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MANUAL SHIFTER IS VERY DIFFICULT TO ENGAGE IN REVERSE, 1ST AND SECOND GEAR.  I WAS TOLD BY FIAT THAT THE REVERSE GEAR IS A QUIRK OF THE CAR AND THERE IS NO SOLUTION. THIS 1 &2 SHIFTING PROBLEM IS INTERMITTENT AND HAPPENS WHILE DRIVING IN TRAFFIC FROM A COMPLETE STOP.  THE DEALERSHIP STATED THE GEARS WERE DIFFICULT DUE TO THE CLUTCH AND NEEDED REPLACEMENT. MY CAR HAS 12,400 MILES AND THE CLUTCH WAS NOT COVERED AND I PAID FOR THE REPLACEMENT. I WAS SHOCKED THAT MY CLUTCH NEEDED REPLACEMENT AT 12,000 MILES! I CONTACTED THE MANUFACTURE ABOUT THE DEFECT, BUT  FIAT AGREED THAT I HAD TO PAY FOR THE REPLACEMENT OF THE CLUTCH. AFTER THE REPAIR, THE CAR HAS THE SAME PROBLEM WITH THE GEARS. I DON'T BELIEVE THAT CLUTCH NEEDED REPLACEMENT, THE CAR HAS A DEFECT.",
        "vin": "3C3CFFFH4DT"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872661,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING 65 MPH, THE HEADLIGHTS BURNED OUT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 82,000.",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871449,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED THE SECOND FIAT 500 THOUGHT THE BRAKE'S ISSUE WOULD GO AWAY WHEN DRIVING IN THE WINTER TIME.  BRAKES WOULD NOT STOP THE CAR AND EVEN YOU PRESSED IT ALL THE WAY DOWN.  I HEARD FROM A FRIEND WHO LOST CONTROL OF HER FIAT'S BRAKE THIS LAST WINTER IN BOSTON, MA AND WOULD LIKE TO KNOW IT'S SOMETHING WRONG WITH MY VEHICLES AS WELL BEFORE THE WINTER THIS YEAR.",
        "vin": "3C3CFFAR7CT"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/23/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT THE LIFTGATE LATCH MALFUNCTIONED AND THE HATCHBACK COULD NOT BE OPENED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "3C3CFFAR9DC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851111,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 25,000 MILES I HAD AN OIL CHANGE AND TIRE ROTATION. AFTER THAT, I NOTICED UNSAFE FEELING ON MY STEERING ON HIGH SPEED (OVER 75MPH) THAT I NEVER FELT BEFORE THE SERVICE. IT JUST DIDN'T FEEL STEADY. BROUGHT THE CAR BACK IN THEN THEY REPLACED AN INTERNAL SHAFT BUT DIDN'T HELP. BROUGHT BACK IN TWICE MORE AND THEY TEST DROVE IT AND CHECKED EVERYTHING (SO THEY SAID) BUT NOTHING WAS FOUND. I WAS TOLD THAT THE TIRES WERE GETTING OLD AND TO JUST GET USED TO IT AND NOT TO DRIVE SO FAST. BUT ON INTERSTATES, SOMETIMES YOU HAVE TO GO WITH THE FLOW AND THAT FLOW CAN BE THAT HIGH SPEED. I TALKED TO TWO SERVICE PERSONNEL BUT THEY SEEMED LIKE THAT THEY DIDN'T UNDERSTAND MY CONCERN NOR CARE ABOUT IT. I POSTED MY CONCERN ON FIAT USA FACEBOOK PAGE AND SOMEONE FROM THE FIAT HEADQUARTERS CONTACTED ME WHICH WAS NICE BUT NOT MUCH HELP BECAUSE MY DEALERSHIP DIDN'T WANT TO DEAL WITH THEM. I WAS EVEN SUGGESTED BY A PERSON FROM THE HEADQUARTERS TO CHANGE THE DEALERSHIP. THE BOTTOM LINE IS THAT I WILL HAVE TO BUY NEW TIRES ABOUT 6,000 MILES FROM NOW BUT THIS KIND OF THING NEVER HAD HAPPENED TO ANY OF MY PREVIOUS CARS.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2016",
        "dateOfIncident": "01/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819915,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 30 MPH, WHILE DEPRESSING THE CLUTCH TO SLOW DOWN, THE CONTACT HEARD AN ABNORMAL SOUND AND THE GEAR FAILED TO SHIFT WITHOUT WARNING. THE CONTACT MANEUVERED THE VEHICLE TO A PARKING AREA. THE DEALER WAS NOTIFIED OF THE FAILURE BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 59,000.   ...UPDATED 02/19/16 *BF    *CN",
        "vin": "3C3CFFBRXDT"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/26/2015",
        "dateOfIncident": "05/22/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777868,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TO HAVE MY FRONT TWO TIRES REPLACED ON MY 2013 FIAT 500 ABARTH IN MAY 2015 AFTER ONLY 17 MONTHS OF OWNERSHIP (BOUGHT IT NEW AT THE END OF 2013) AND 12,666 MILES, AND WAS TOLD THEY WERE NOT COVERED BY ANY WARRANTY. THESE WERE THE PERELLI 205/40R17XL BSW 3 SEASON TIRES.  THE WEAR WAS SO BAD THEY WOULD NOT PASS INSPECTION.  I PREVIOUSLY OWNED A 2012 FIAT 500 SPORT WITH PERELLI'S AND HAD IT FOR 17 MONTHS, BUT PUT 30,105 MILES ON IT, AND ONLY HAD TO REPLACE TWO TIRES BECAUSE ONE GOT A NAIL IN IT.  I KNOW ROTATING THE TIRES WHEN RECOMMENDED IS IMPORTANT.  I HAVE HAD MY RECOMMENDED SERVICES FOR BOTH CARS AS THE DEALERSHIP HAS RECOMMENDED.",
        "vin": "3C3CFFFH4DT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745152,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE IN FOR A TAPPING SOUND COMING FROM THE ENGINE COMPARTMENT.  THE AFTERNOON AFTER I DROPPED OFF MY CAR I RECEIVED A CALL FROM THE SERVICE ADVISER TELLING ME THAT THE NOISE WAS COMING FROM AN INTERIOR COMPONENT OF MY ENGINE AND THAT THE ENGINE WOULD HAVE TO BE REPLACED. THE ENGINE DID NOT COME IN UNTIL JULY 20, 2015. WITHIN A DAY OR TWO I RECEIVED ANOTHER CALL FROM THE SERVICE ADVISER TELLING ME THAT THE CLUTCH PRESSURE PLATE WAS WORN DOWN TO THE METAL AND THAT IT NEEDED TO BE REPLACED.  HE WENT ON TO SAY THAT THIS PARTICULAR PART WAS NOT COVERED UNDER THE MANUFACTURERS WARRANTY AND I WOULD NOW INCUR AN OUT OF POCKET EXPENSE.  AT FIFTY THREE YEARS OF AGE I HAVE HAD SEVERAL VEHICLES WITH MANUAL TRANSMISSIONS AND NEVER HAVE HAD PROBLEMS WITH MY CLUTCH LET ALONE WITH THE PRESSURE PLATE. SOON AFTER I RESEARCHED SEVERAL VEHICLE REVIEW WEB SITES TO LEARN THAT THERE ARE A NUMBER OF COMPLAINTS WITH THE CLUTCH PRESSURE PLATE VEHICLES WITH MILEAGE FROM 11K TO 25 K.",
        "vin": "3C3CFFAR2DT"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE DRIVING AT VARIOUS SPEEDS, THERE WAS A LOUD SCREECHING NOISE COMING FROM THE REAR PASSENGER SIDE OF THE VEHICLE. THE CONTACT STATED THAT THE BRAKE PEDAL HAD TO BE LIGHTLY DEPRESSED AND THE STEERING WHEEL HAD TO BE TURNED IN ORDER FOR THE NOISE TO SUBSIDE. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. A WEEK LATER, THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT STRUT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN BACK TO THE DEALER AGAIN WHERE IT WAS DIAGNOSED THAT THE REAR BRAKES FAILED AND THE CALIPER SEIZED, WHICH CAUSED THE REAR PASSENGER SIDE ROTOR TO ABNORMALLY DETERIORATE. THE ROTOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. A FEW MONTHS LATER, WHILE DRIVING APPROXIMATELY 60 MPH, THE CLUTCH COULD NOT BE DEPRESSED AND THE VEHICLE COULD NOT SHIFT. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE CLUTCH FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 3,171.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/05/2015",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10723542,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 FIAT ABARTH WAS REAR ENDED.  I WAS STOPPED.  THE OTHER DRIVER, IN A GRAND CHEROKEE, REAR ENDED ME.  HIS SPEED WAS APPROXIMATELY 20-30 MPH.  I WAS KNOCKED UNCONSCIOUS BRIEFLY & HAD SEVERE HEAD PAIN.  I AM STILL UNDERGOING TREATMENT.  NONE OF MY CARS SAFETY FEATURES WORKED, INCLUDING THE FUEL PUMP SHUT OFF.  I BELIEVE THE SEAT HIT ME IN THE HEAD.  THE ABARTH HAS UNIQUE, HIGH BACKED SEATS WITH A FIXED / INTEGRATED HEAD REST WITH A HARD, PLASTIC INSERT.  MY SEATBELTS FAILED TO TIGHTEN AND THE FUEL PUMP FAILED TO SHUT OFF. I WORKED FOR CHRYSLER FIAT AT THE TIME AND DID TELL PEOPLE IN ENGINEERING ABOUT THE CONCERN.  I SUFFERED A CONCUSSION & NOW HAVE CONSTANT, DAILY HEADACHES AND MIGRAINES.",
        "vin": "3C3CFFFH7DT"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LOW SPEEDS 20 MPH AND BELOW YOU COULD HEAR A GRINDING NOISE THAT SOUNDED MUCH LIKE BAD BRAKES BEARINGS.  SECOND TIME WE SUGGESTED THIS PROBLEM.  FIRST TIME THE TECH SAID HE COULD NOT DUPLICATE THE NOISE.  THIS TIME THEY FOUND BOTH OF THE REAR BEARING HAD BEEN COMPLETELY EATEN AWAY BY BRAKE DUST INSIDE THE BEARING ASSEMBLY.",
        "vin": "3C3CFFFH3DT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TECH FOUND TRANSMISSION LEAKING AND SEALED WITH EPOXY. SECOND LEAK WAS UNAWARE A REPAIR HAD BEEN MADE UNTIL I RETURNED CAR TO DEALER FOR A LEAK FOUND MY OIL CAN HENRY'S",
        "vin": "3C3CFFFH3DT"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/21/2015",
        "dateOfIncident": "04/17/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10712093,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPRESSWAY DRIVING AT 55MPH WHEN TRAFFIC CAME TO AN ABRUPT HALT. HARD BREAKING TRANSPIRED, ATTEMPT AT EVASION, RESULTING IN A FRONT IMPACT INTO THE REAR OF ANOTHER VEHICLE, AND THEN A REBOUND IMPACT INTO A RETAINMENT WALL ON THE DRIVERS SIDE. NONE OF THE 7 AIRBAGS DEPLOYED...UPDATED 05/07/15 *BF   UPDATED 9/16/2015  *JS  *TR",
        "vin": "3C3CFFAR5DT"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660175,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRES ON THIS FIAT ARE PIRELLI NERO ZERO . ALL FOUR ARE VERY CHOPPY AND BADLY WORN. THEY WERE ROTATED AT 5,000 MILES. THE ROAD NOISE IS SO LOUD IT OVERPOWERS THE FACTORY RUMBLING OF THE FLOW THROUGH EXHAUST SYSTEM. THE TIRES AFFECT THE HANDLING AS I GET VIBRATIONS AND THE CAR DARTS FROM SIDE TO SIDE ON UNEVEN ROAD SURFACES.  *TR",
        "vin": "3C3CFFFH6DT"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650239,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. WHILE TURNING AT AN UNKNOWN SPEED, THE VEHICLE STALLED AND THE ELECTRONIC THROTTLE CONTROL WARNING LIGHT ILLUMINATED. THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER ON SEVERAL OCCASIONS WHERE THE FAILURE WAS UNDETERMINED. THE TECHNICIAN RECOMMENDED THAT THE COMPUTER BE REPROGRAMMED. THE REPAIR FAILED TO REMEDY THE VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "3C3CFFAR0DT"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643350,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPER FLUID RESERVOIR LEAKING AND CAN NOT HOLD FLUID FOR WIPER. WENT TO DEALERSHIP UNDER WARRANTY BUT NO PARTS TO REPLACE AND NO ETA OF PARTS. CONTACTED THE FIAT USA ABOUT PARTS  AND WAS TOLD NO PARTS AVAILABLE AND WILL NOT GIVE ANY ETA ON PARTS. I HAVE BEEN DRIVING IN HOUSTON IN RAINY SEASON AND CAN NOT CLEAR WINDSHIELD WITH WIPER FLUID WHEN DRIVING. WHEN CALLING THE FIAT USA, SERVICE REP CAN NOT HELP AND WILL NOT PROVIDE ANY UPPER LEVEL MANAGEMENT CONTACT TO ADDRESS THIS PROBLEM.  *TR",
        "vin": "3C3CFFJHXDT"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630910,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FIREHAWK",
                "productYear": "9999",
                "size": "P215/55R18",
                "type": "Tire"
            }
        ],
        "summary": "PROBLEM WITH LOW TIRE PRESSURE; OCCURS IN MULTIPLE TIRES, NOT JUST SAME ONE, OCCURS ABOUT EVERY OTHER WEEK. MOST RECENT INCIDENT OCCURRED 8/25/14, DEALER HAS CHECKED AND STATES NO PROBLEM/LEAKS FOUND.  WAS AT DEALER FOR SERVICE ON 8/29/14 NO PROBLEMS IDENTIFIED THEY FILLED AIR IN ALL TIRES TO MFG. RECOMMENDED PRESSURE - 5 DAYS LATER ON 9/3/14 HAD A LOW PSI OF 24 ON RIGHT REAR TIRE. HAVE COMPLAINED TO DEALER SERVICE DEPARTMENT AND HAVE A FOLLOW UP SERVICE APPOINTMENT ON 9/8/14.  *TR",
        "vin": "3C3CFFARXDT"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619350,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2013 FIAT 500.  THE CONTACT STATED THAT WHILE DRIVING 30 MPH ON THE HIGHWAY, THERE WAS A ROCK OR METAL PIECE THAT HIT THE FUEL TANK. THE FUEL FROM THE GAS TANK LEAKED OUT OF THE TANK AND ONTO THE ROAD.  THE VEHICLE WAS PULLED OVER TO THE RIGHT. THE VEHICLE WAS TOWED TO A LOCAL DEALERSHIP.  THE DIAGNOSIS ON THE VEHICLE WAS A FAULTY FUEL TANK.  THERE WERE NO REPAIRS COMPLETED ON THE VEHICLE. THE FAILURE MILEAGE WAS 22,000.",
        "vin": "3C3CFFAR4DT"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10614805,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 FIAT 500 WAS HIT ON THE DRIVER'S SIDE OF THE CAR.  THE AIRBAGS DID NOT DEPLOY AND I BROKE MY ARM AND HAD A HEAD INJURY... UPDATED 08-20-14 *BF--UPDATED 08-26-14*BF   UPDATED 09/2/2014   *JS",
        "vin": "3C3CFFAR2DT"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605729,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER EMBLEM KEEPS COMING OUT OF THE MIDDLE OF THE STEERING WHEEL REVEALING THE AIRBAG BEHIND IT.  I KEEP \"POPPING\" IT BACK IN PLACE, BUT IT DOES NOT STAY.  THE NEAREST DEALER FOR REPAIRS IS 90 MILES AWAY.  I SCHEDULED A TIME FOR THEM TO LOOK AT IT, BUT NOW HAVE TO BRING IT IN AGAIN SO THEY CAN KEEP IT LONGER TO DETERMINE IF IT JUST NEEDS THAT PIECE REPAIRED OR IF I NEED A WHOLE NEW STEERING WHEEL.  I CAN ONLY HOPE THE AIRBAG DOES NOT DEPLOY FROM BEHIND THIS LOOSE PIECE AS IT IS CLEARLY NOT ATTACHED TO ANYTHING.  *TR",
        "vin": "3C3CFFCR0DT"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584164,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE THE OEM TIRES ON MY 2013 FIAT 500 @ 5000 MI BECAUSE OF SIDEWALL BULGE,. TIRE SIZE IS 185 55 15 FIRESTONE FIREHAWK GT. NO LETTERS AFTER GT,FIRESTONE STORE TOLD ME ITS A ROAD HAZARD PROBLEM. I LOOKED ON THE WEB FOR FIAT TIRE PROBLEMS,OTHERS ARE HAVING SAME PROBLEM BUT SEEMS TO ONLY BE CARS WITH FIRESTONES.SO I BELIEVE THERE IS A PROBLEM,NONE OF MY 5 OTHER CARS,WHICH GO THE SAME PLACES HAVE A TIRE PROBLEM. I JUST TRIED TO CALL IN TO VSH HOTLINE AND GOT TREATED LIKE AN IDIOT. I'VE BEEN A MECHANIC FOR OVER 30 YEARS,I MAY HAVE SOME INSIGHT OF WHAT IS NORMAL TIRE PERFORMANCE.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/15/2014",
        "dateOfIncident": "02/08/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10582921,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "235/45R19",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500 SPORT. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE FRONT PASSENGER SIDE TIRE EXPERIENCED A BLOW OUT. THE CONTACT ALSO INDICATED THAT THE SAME DEFECT OCCURRED WITH THE DRIVERS SIDE FRONT TIRE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 60.",
        "vin": "3C3CFFBRXDT"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "03/18/2013",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574704,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500.  THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE WOULD INDEPENDENTLY DECELERATE. THE CONTACT SHUT OFF THE VEHICLE AND WHEN RESTARTED, THE FAILURE RECURRED.  THE VEHICLE WAS TAKEN TO A DEALER, WHO COULD NOT DIAGNOSE THE FAILURE. THE VEHICLE WAS SERVICED FOUR TIMES FOR THE RECURRING FAILURE.  THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM.  THE APPROXIMATE FAILURE MILEAGE WAS 4,600.",
        "vin": "3C3CFFARXDT"
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/17/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572980,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY FIRST CAR 2013 FIAT, I AM A STUDENT AND I DRIVE ABOUT 1.20 HRS TO MY UNIVERSITY FROM HOME.  ON 3/17/14 I WAS DRIVING TO SCHOOL THAT I HAD A FLAT TIRE .I FOUND OUT THIS CAR IT DOES NOT COME WITH SPARE TIRE JACK AND TOOLS, THERE IS A SMALL AIR PUMP UNDER THE SEAT THAT YOU HAVE TO REMOVE IT AND PLUG IT IN TO THE OUTLET AND PUT AIR IN TO THE TIRE, I TRIED TO PUT AIR INTO THE TIRE BUT THE PUMP DID NOT WORK. I CALLED FIAT THEY TOLD ME THE PUMP IS GOOD ONLY WHEN YOU HAVE LOW AIR IN THE TIRE BUT IF YOU HAVE A FLAT YOU HAVE TO TAKE IT TO THE DEALER TO CHANGE THE TIRE OR FIX IT I CALLED MY FATHER TO COME AND HELP ME BECAUSE I WAS STRANDED AND FRIGHTENED AND LATE FOR MY SCHOOL AND NO SPARE TIRE CAN YOU IMAGINE THIS ACCIDENT HAPPENED IN THE MIDDLE NO WERE OR I HAVE TO TAKE SOMEBODY TO THE HOSPITAL EMERGENCY OR....A YOUNG GIRL WITH OUT NO SPARE TIRE WHAT WOULD HAPPENED TO ME OR ANY OTHER FIAT OWNERS.  MY FATHER CAME AND CHECK THE TIRE ALL OVER AND TOOK PICTURES OF IT THERE WAS NO SIGN OF NO NAILS INTO THE TIRES. HE CALLED FIAT ROAD SIDE ASSISTANT THEY TOLD HIM YOU HAVE TO WAIT FOR 90 MINUTES FOR TOW SERVICE AND WHEN HE COMPLAINT TO THEM FOR LONG HOUR WAIT THEY TOLD MY FATHER YOU CAN PAY FROM YOUR POCKET AND DEAL WITH IT..!! . I THINK THE SPARE TIRE AND JACK & TOOLS ARE NECESSITY AND A SAFETY ISSUE FOR A VEHICLE AND THEY MUST HAVE IT IN THE CAR IN CASE YOU ARE FAR AWAY AND NO ACCESS TO ANY DEALER AROUND YOU AND YOUR LIFE SAFETY ISSUE. MY FATHER ASK THE FIAT OVER THE PHONE WHY THE VEHICLE DOES NOT HAVE SPARE TIRE PACKAGE THEY TOLD HIM YOU SHOULD ASK THE DEALER AT THE TIME OF THE SALE TO SELL IT TO YOU..??? ALL THE CARS MANDATORY BY LAW MUST HAVE SAFETY FEATURES FOR THE CONSUMERS ONE OF THEM IS SPARE TIRE PACKAGE. AT THIS TIME I WOULD LIKE TO FILE A FORMAL COMPLAINT AGAINST FIAT AND FIAT DEALERS FOR SELLING  UNSAFE VEHICLE TO THE CONSUMER.  *TR",
        "vin": "3C3CFFDR7DT"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2014",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567694,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING THE SPEEDOMETER WOULD NOT READ ANY HIGHER THAN 20 MPH, EVEN WHEN GOING SPEEDS WELL OVER 20 MPH ON THE INTERSTATE.  COMING TO A COMPLETE STOP THE SPEEDOMETER WOULD READ AT 0, HOWEVER ONCE ACCELERATING OR DECELERATING FROM OVER 20 MPH WOULD NOT BE REGISTERED.  THE CAR WAS TURNED ON AND OFF SEVERAL TIMES, AND SHIFTED THROUGH ALL THE GEARS, STILL NO FIX.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560114,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC THROTTLE CONTROL (ETC) LIGHT CAME ON AFTER SLOWING DOWN AND THEN HAVING TO ACCELERATE FAST TO AVOID AN ONCOMING CAR AT AN INTERSECTION CROSSING. AT THE SAME TIME THE CAR LOST SPEED AND ACCELERATION. WE CONSULTED THE MANUAL IMMEDIATELY AND DID WHAT IT SAID, THAT IS TO RESTART THE CAR. WE DID THIS AND THE LIGHT WENT OFF. TO DO THIS WE HAD TO PULL OFF THE INTERSTATE AND PARK AND THEN GET BACK ON. WHEN GETTING BACK ON I HAD TO SLOW DOWN AND AGAIN ACCELERATE QUICKLY AGAIN TO PROPERLY MERGE WITH ONCOMING TRAFFIC ON THE 4 LANE WE WERE TRAVELING. THE ECT LIGHT CAME ON AGAIN AND WE AGAIN STOPPED AND RESTARTED THE CAR AND THE ECT LIGHT WENT OUT. ABOUT 4 MILES LATER AT AN INTERSECTION I SLOWED THEN ACCELERATED AFTER MAKING A RIGHT HAND TURN (THE LIGHT WAS GREEN).THE ECT LIGHT CAME ON AGAIN AND THIS TIME I IMMEDIATELY LOST POWER AND ACCELERATION AND COULD NOT GET THE CAR ABOVE ABOUT 40 TO 45 MILES AN HOUR.WE HAPPENED TO BE TRAVELING TO THE CAR DEALERSHIP ON ANOTHER MATTER (PHONE PAIRING) AND WE WERE ONLY A HALF A MILE FROM THE DEALERSHIP SO WE TOOK IT IN TO HAVE THEM LOOK AT IT. THEY GAVE US THE SAME MAKE AND MODEL AS A LOANER.WE WENT A FEW MILES THE ECT LIGHT CAME ON IN THIS CAR (FIAT 500) SO WE WENT BACK TO THE DEALERSHIP TO SEE WHAT MIGHT BE CAUSING THIS IN TWO CARS. THE SERVICE TECHNICIAN FOUND THAT I HAD TOUCHED OR PRESSED THE BRAKE PEDDLE AND THE ACCELERATOR AT THE SAME TIME AND THIS CAUSES THE ECT SYSTEM TO ACTIVATE AN ECT LIGHT TO COME ON. HOWEVER, IT APPEARS THAT IF YOU EVEN TOUCH THE BRAKE FOR EVEN A SECOND WHILE THE ACCELERATOR IS ENGAGED OR ESPECIALLY IF IT IS TRYING TO INCREASE SPEED TO THE TIRES THE ECT WILL ENGAGE AND LIGHT WILL COME ON AND TO RESET YOU HAVE TO IMMEDIATELY STOP THE CAR TURN IT OFF SO THE SYSTEM WILL RESET.  THIS WHOLE EXPERIENCE TO ME WOULD INDICATE A SAFETY PROBLEM OR A DESIGN DEFECT. SIMILAR PROBLEMS SEEN ON INTERNET WITH THE ECT.  *TR",
        "vin": "3C3CFFAR7DT"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2013",
        "dateOfIncident": "08/26/2013",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550172,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED REPEATED FAILURE OF THE AIR BAG SAFETY SYSTEM.  VEHICLE HAS BEEN IN FOR REPAIR FOUR TIMES AND FAILURE REOCCURED AT BETWEEN 1 AND 80 MILES DISABELING THE AIR BAG SAFETY SYSTEM.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523336,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE VEHICLE DECELERATED INDEPENDENTLY AND INTERMITTENTLY. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS BUT THEY WERE UNABLE TO DUPLICATE THE PROBLEM. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.  *TR",
        "vin": "3C3CFFAR3DT"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/28/2013",
        "dateOfIncident": "05/28/2013",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513814,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FIAT 500. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE CRUISE CONTROL FAILED AND THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 17.   *TR",
        "vin": "3C3CFFAR1DT"
    }
]