[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2021",
        "dateOfIncident": "11/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441819,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving my truck down the highway it will violently shake until I brake below 40 MPH. This occurs when there is a change in surface on the roadway. An example is going over a bridge or rough pavement.  It has happened several times in the past year, and most recently last weekend while my wife was with me. We were driving on a major interstate at 65 MPH, maintaining a single lane when the truck went into a \"death wobble.\" The front end shook so violently, it became a safety risk for our lives as well as other drivers. It was extremely difficult to maintain the steering until the truck stopped shaking. My wife no longer feels safe driving the vehicle.   In the past, we have taken it to a local mechanic and I was advised they were not able to find an issue. We have purchased new tires and taken them to the Ford dealership to balance and align. We check the tire pressure regulary, and had an alignment done, though the violent shaking is getting worse, rather than better, when it happens.  The truck gives no prior warning when this occurs.    I don't see any form of recall for this issue, and a forum only advises buying an after market component to fix it. I want the truck fixed correctly, with Ford parts, as my intent was to keep it for several more years.",
        "vin": "1FT8W4DT1DE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390712,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 F-450 REGULAR PICKUP, FUEL SYSTEM FAILURE, MY VEHICLE ARE EQUIPPED WITH BOSCH-SUPPLIED CP4 HIGH-PRESSURE FUEL INJECTION PUMPS THAT WERE 'NEVER COMPATIBLE WITH AMERICAN FUEL STANDARDS. MY PU HAS 49,000 MILES I HAD PURCHASE AN EXTENDED WARRANTY FROM FORD  THEY DENIED THE COVERAGE AS WELL, SAYING IT HAS WATER CONTAMINATION, CP4  PUMP IS SIMPLY NOT BUILT TO WITHSTAND U.S. SPECIFICATIONS FOR DIESEL FUEL WITH REGARD TO LUBRICATION OR WATER CONTENT AND STRUGGLES TO 'LIFT A VOLUME OF FUEL SUFFICIENT TO LUBRICATE ITSELF.  FORD MOTOR COMPANY SURE RECAL THIS PROBLEM, THIS BILL IS OVER $16,000.00",
        "vin": "1FT8W4DT8DE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210552,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I64 WESTBOUND SANDSTONE MOUNTAIN W VA 8 MILE 6% GRADE REALIZED INTEGRATED TRAILER BRAKES FAILED AND HAD 2 USE MANUAL BRAKE OPTION ON BRAKE CONTROL.  WAS NEVER GIVEN ANY WARNING BY TRUCK THAT TRAILER BRAKE CONTROLLER HAD FAILED. I AM EXPERIENCED ENOUGH TO KNOW HOW TO MANUALLY OPERATE TRAILER BRAKES FROM THE CONTROLLER.  INEXPERIENCED OPERATORS MAY NOT BE SO FORTUNATE.",
        "vin": "1FT8W4DTXDE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155173,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F-450 2013 HORTON AMBULANCE HAD THE FUEL TANK FALL FROM THE FRAME ON TO THE ROAD ON EMERGENCY 911 CALL. FRAME HAS HUGH CRACK WITH RETAINING STRAPS. HAD TO TOW TO DEALERSHIP. WE HAVE 9 OF THESE EXTENDED CAB HORTON AMBULANCES WITH 7 HAVING CRACKS IN THE FRAME IN DANGER OF FALLING OFF. 2 ARE LEAKING DISEAL FUEL.",
        "vin": "1FD0X4GT4DE"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P2201 SETTING AND CAUSING TRUCK TO GO INTO LIMP MODE AND REDUCE POWER. VEHICLE IS USED A A BRUSHPUMPER FOR FIRE DEPARTMENT. HAS BEEN IN FOR REPAIRS TO DEALER 12 TIMES WITH NO REPAIR THAT HAS LASTED. CODE SETS WHEN IN MOTION, DE-RATES POWER AND HAS TO LIMP BACK TO SHOP. CANNOT BE USED TO FIGHT FIRES AT THIS TIME.",
        "vin": "1FD0X4HT6DE"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/27/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594249,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ONLY WAY TO CHECK THE TIRE PRESSURE ON THE INSIDE TIRE OF A DUALLY IS TO REMOVE THE OUTSIDE TIRE.   *TR",
        "vin": "1FT8W4DT5DE"
    }
]