[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458212,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Ford Expedition. The contact stated that while driving at 50 MPH, the transmission suddenly downshifted into first gear. The vehicle was taken to the dealer where it was diagnosed with brake sensor and transmission failure. The dealer replaced an unknown transmission part; however, the failure recurred. The vehicle was taken back to the dealer, but the dealer could not duplicate the failure. The vehicle was not repaired. The manufacturer was made aware of the failure and a case was opened. The failure mileage was 82,702.",
        "vin": "1fmju1h52de"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "During a recent oil change and tire rotation, my mechanic advised the lug nuts on my tires needed to be replaced due to swelling and distortion.  I was advised this is a known problem by  Ford but no recall is in force as of yet.  I incurred a cost to have all of them replaced.",
        "vin": "1FMJU2A53DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433620,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle suddenly shifted into first gear causing it to slow down abruptly. If someone were behind me there would be a high probability that they would hit me from behind since the slowdown was caused by a down shift and there would be no brake lights.   This same thing happened to me two years ago and I brought it to the Ford dealer for service.  They did not try to reproduce the problem because there is a TSB 19B05.  They reprogrammed the Powertrain module.  I did not experience this problem again until 8/30/2021 (I think, it could have been 8/23).  At which point I started looking into this.  Apparently Ford knows this is a problem and has extended the warranty on the affected part (see Customer Satisfaction Program 19N01). But, they will not perform the needed repair unless I have the Wrench light on my dashboard.  There is every indication that my vehicle has a problem with OSS sensor because three times (in the past few weeks) my vehicle has either downshifted or failed to shift out of first gear and all three times the speedometer read 0 (not operational) even though I was going 25 - 30 mph.  I think there should be a recall on this part because if I was going at a high rate of speed in heavy traffic this would be a disaster. In the mean time I am driving on side roads hoping that the light comes on so that I can get this fixed.  I looked into having the repair done and the estimate is $1100.",
        "vin": "1FMJU1J54DE"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle suddenly loses power the wrench light comes on and the vehicle will not go when pushing the accelerator. The vehicle has to be turned off and restarted before it becomes mobile again.",
        "vin": "1fmju2a53de"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425148,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "While I was driving my vehicle on the highway it just downshifted from 5th gear to a much lower gear causing my vehicle to come to an almost complete stop in traffic.  Also my speedometer quit working and my vehicle transmission was stuck in the lower gear.  I had to pull off on the shoulder during traffic and avoid being hit by another car.  I was able to turn the vehicle and then restart it to get the transmission to shift into another gear.  I was fortunate enough to be able to get home but that did not correct the issue Ford created to my and my family's safety.  Ford knows this is an issue and had a recall out there for the issue but because my vehicle is out of the mileage for the warranty they will not repair the issue at their cost.  The dealership confirmed the issue is the same as the recall-- replacement of transmission molded leadframe  is necessary.  Ford will not cover the repair cost because it is out of the mileage and also the extended date 11/30/2019.",
        "vin": "1FMJU1H50DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Personal experience matches exactly the symptoms identified and described in Ford TSB 13-6-8. The downshift and immediate power train reduction in speed has thrown the passengers forward and prompted immediate control issues. To date the tires have not locked up on this VIN but there are numerous reports of that situation.",
        "vin": "1FMJK2A54DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362136,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING THE CAR ON THE FRONT AIR CONDITIONER VENTS WON'T BLOW MOST OF THE TIME. IF THE WIRING UNDER THE DASH ON THE PASSENGER SIDE IS TAPPED/BUMPED IT WILL THEN START BLOWING. IT STOPS BLOWING AND STARTS BLOWING AGAIN WHEN BUMPED. THE WIRING GETS HOT. THERE ARE MULTIPLE CASES OF THIS BEING DESCRIBED ON THE INTERNET. THERE IS SOMEONE WHO STATES THEIR VEHICLE CAUGHT ON FIRE AND BURNED TO A SKELTON WITHIN 5 MINUTES. THIS IS NOT SAFE AND SEEMS TO BE A COMMON PROBLEM.THIS HAPPENS AT ALL TIMES WHEN THE VEHICLE IS RUNNING WITH THE AC TURNED ON. THE VEHICLE CAN BE EITHER STATIONARY OR MOVING. I PURCHASED THE VEHICLE  IN JULY 2020 AND IT'S BEEN HAPPENING ANY TIME THE AC IS RUNNING.",
        "vin": "1FMJU2A53DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE EXPERIENCING THE ISSUES IN FORD'S TSB 13-6-8 THE VEHICLE WILL SUDDENLY HAVE THE SPEEDOMETER DROP TO 0, FUEL GAUGE SHOWS EMPTY, WRENCH OR CHECK ENGINE LIGHT COMES ON, AND THE RPMS GO EXTREMELY HIGH. IT IS EXTREMELY DANGEROUS AS IT HAS HAPPENED ON THE FREEWAY AT HIGH SPEEDS AND ALSO WHEN STARTING UP FROM A STOP LIGHT. FORD IS ONLY PAYING FOR THE PARTS IF IT'S 10 YEARS OR 150,000 MILES WHICHEVER COMES FIRST. THE VEHICLE IS 7 YEARS OLD BUT HAS 155,000 MILES. THE REPAIR IS $1,100.",
        "vin": "1FMJU2A54DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "05/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340988,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS HAVING A KNOWN TRANSMISSION ISSUE. AT LEAST 6 OTHER VEHICLES ARE WAITING ON A PART THAT IS ON BACK ORDER WITH FORD CURRENTLY.   THIS ISSUE CAUSES YOUR TRUCK TO FEEL AS IF IT SHIFTS INTO NEUTRAL OR PARK WHILE DRIVING THROUGH TRAFFIC! IT IS VERY DANGEROUS AND SCARY FOR ALL IN THE VEHICLE! OUR VEHICLE IS AT ONE FORD DEALER WAITING TO BE TRANSFERRED TO ANOTHER BECAUSE OF POOR CUSTOMER SERVICE.",
        "vin": "1FMJU1K51DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330377,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT STEPPING ON GAS PEDAL TO GO TO 65MPH AND THE TRANSMISSION DOWNSHIFTED TO THE FIRST GEAR AND WENT LIMP ON THE HIGHWAY.  I ATTEMPTED TO GO TO DESIRE HIGHWAY SPEED AND IT WOULD NOT MOVE AND I WAS LUCKY TO GET OFF THE HIGHWAY AND NOT GET KILLED.  NO LIGHT TURNED ON EXCEPT THE FUEL GAUGE MOVED LIKE CRAZY.  ON A DIFFERENT OCCASION MY HUSBAND DROVE IT ON THE HIGHWAY AGAIN AND IT DID IT AGAIN, DOWNSHIFT TO FIRST HEAR IN THE MIDDLE OF HIGHWAY WHEN HE WAS GOING AT 65 MPH.  IT WAS  VERY SCARY BECAUSE THERE WAS A LOT OF TRAFFIC AND HE NEARLY HAD AN ACCIDENT.  TOOK TO MY MECHANIC AND HE DID NOT FIND ANY CODES OR ANYTHING TO FIGURE OUT WHAT HAPPENED.  AFTER DISCUSSING WITH MY BROTHER'S MECHANIC, HE SAID THAT THE PROBLEM IS THE TRANSMISSION AND A SENSOR THAT IS KNOWN TO BE FAULTY IN FORD EXPEDITION.  *TR",
        "vin": "1FMJU1H58DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING A PROBLEM WITH THE ENGINE AND WHEN I TOOK MY CAR IN TO ADDRESS THE SITUATION AND ALSO THE RECALL, THE GENTLEMAN SAID THAT IT WAS MERELY AN EXTENSION OF COVERAGE FOR A POSSIBLE PROBLEM AND THAT WHEN THE PROBLEM OCCURRED THEN THEY WOULD ADDRESS IT. SO THIS LIMITS ME FROM THE USE OF MY VEHICLE. I?M PLANNING A TRIP ACROSS 1/2 THE COUNTRY WITH MY 4 GRANDKIDS AND AM HELD HOSTAGE TO USE MY CAR FOR THIS TRIP. I CANNOT BE GOING 60-70 MILES DOWN THE ROAD TO ALL OF A SUDDEN MY CAR DOWNSHIFT TO 1ST GEAR CAUSING A  TREMENDOUS VIBRATION AND LOSING CONTROL THAT CAN CAUSE IRREVERSIBLE DAMAGE TO THE CAR, AS WELL AS, PEOPLE IN THE VEHICLE. I AM UTTERLY AMAZED THAT FORD WILL NOT ADDRESS THIS ISSUE BEFORE SOMEONE OR SOMETHING CRITICALLY HAS TO HAPPEN. I GUESS FORD SEES CLIENTS AS INESSENTIAL AS LONG AS THEY MAKE SALES.  *TR",
        "vin": "1FMJK1H54DE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323685,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 FORD EXPEDITION WILL NOT SHIFT OUT OF PARK. VEHICLE WILL NOT REVERSE OR DRIVE. I WAS STUCK AT MY BANK DRIVE THRU. I COULD NOT SHIFT OUT OF PARK TO GO FORWARD OR REVERSE.  *TR",
        "vin": "1FMJU1H57DE"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT A HIGH SPEED (HIGHWAYS, INTERSTATE, ETC) THE VEHICLE STUTTERS - ALMOST LIKE AN EXTREME DOWNSHIFT.  DEALER PERFORMED A LEAD FRAME RECALL REPAIR TO THE TRANSMISSION BUT THE VEHICLE CONTINUES TO DO IT.  IT CAUSES EXTREME ANXIETY TO THE DRIVER AND PASSENGER, ESPECIALLY WHEN IT HAPPENS IN THE \"MIDDLE OF NOWHERE\".",
        "vin": "1FMJK1J50DE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303043,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT PART OF WIPER CONTROL NOT WORKING",
        "vin": "1FMJK2A53DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MOONROOF QUIT WORKING IN THE OPEN POSITION",
        "vin": "1FMJK2A53DE"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL STALLS FOLLOWED BY CRANK NO START CONDITIONS OVER SEVERAL MONTHS WITH NO ASSOCIATED CHECK ENGINE LIGHT, CODE P0627 WHILE VEHICLE IN MOTION. 4M AUTO SERVICE CENTER ABILENE TX PERFORMED FUSE 27 RELOCATION TO FUSE 73 ACCOMPLISHED. VEHICLE RETURNED TO SERVICE.     SEVERAL STALLS FOLLOWED BY CRANK NO START CONDITIONS OVER SEVERAL MONTHS WITH NO ASSOCIATED CHECK ENGINE LIGHT, CODE P0627 WHILE VEHICLE IN MOTION. CODE CLEARED, VEHICLE RETURNED TO SERVICE.    STALLED FOLLOWED BY CRANK NO START CONDITIONS WITH CHECK ENGINE LIGHT, CODES P025A, U0109 AND P0627 WHILE VEHICLE STATIONARY. 4M AUTO SERVICE CENTER ABILENE TX REPLACED FUEL PUMP CONTROL MODULE. VEHICLE RETURNED TO SERVICE.    SEVERAL STALLS FOLLOWED BY CRANK NO START CONDITIONS OVER SEVERAL MONTHS WITH NO ASSOCIATED CHECK ENGINE LIGHT NO CODES. VEHICLE OWNER REPLACED FUEL PUMP DUE TO BURNT WIRE (SEE ATTACHED PHOTO). VEHICLE RETURNED TO SERVICE.    CONTACTED 4M AUTO SERVICE CENTER, ARROW FORD ABILENETX AAND FORD MOTOR COMPANY CUSTOMER SERVICE.",
        "vin": "1FMJU1H51DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291892,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON CHRISTMAS EVE 2019 I LEFT CHURCH SERVICE AT 8:30 P.M. MY 3 SMALL BOYS AND I HAD BEEN IN OUR 2013 FORD EXPEDITION EL ABOUT 10 MINUTES. IT WAS 28 DEGREES OUT. WE HAD JUST PASSED THROUGH A SMALL TOWN AND WERE ON A HIGHWAY BY OURSELVES WHEN I THOUGHT I HEARD A SCRATCHY SPEAKER AND TURNED MY RADIO DOWN. WITHIN A MINUTE THERE WAS A LOUD EXPLOSION.  I WAS DRIVING BETWEEN 50 AND 55 MPH DRIVING STRAIGHT FORWARD ON A SMOOTH HIGHWAY. ONE OF MY SONS SCREAMED AND ASKED IF WE BLEW A TIRE WHICH I QUICKLY RULED OUT BECAUSE AIR PRESSURE SIGNALS WERE FINE AND NO PULLING ON MY WHEEL. I FIGURED A DEER RAN INTO OUR VEHICLE BECAUSE IT HAPPENS HERE IN THE MIDWEST. AFTER A FEW MORE MINUTES OF DRIVING I HEARD TINY PIECES OF GLASS FLYING OFF THE TOP OF THE VEHICLE AND THEN IT HIT ME THAT THE SUNROOF EXPLODED.  I REMEMBER READING THE ARTICLE IN MY CONSUMER REPORTS ABOUT THIS HAPPENING ACROSS THE US BUT NEVER IN A MILLION YEARS THOUGHT IT WOULD HAPPEN TO MY OLDER VEHICLE. WHEN I CHECKED IT OVER AT HOME THE GLASS HAD ACTUALLY BUBBLED UP AN AREA IN THE CENTER AND BLEW THAT AREA OUT. IT WAS ABOUT A 10\" BY 5\" AREA THAT BLEW OUT AND THE REST ALL CRACKED BUT DIDNT SHATTER. I ENDED UP GETTING A RECYCLED PIECE OF GLASS FROM A SALVAGE YARD AND HAD A GLASS PLACE REPLACE IT FOR A TOTAL OF $200 - WHEN I WAS QUOTED $1,000 - 1,200 TO REPLACE THE WHOLE GLASS THROUGH FORD AND A NEW SEAL.",
        "vin": "1FMJK2A54DE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242776,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD LEAK CAUSED BY BROKEN MANIFOLD STUD. VEHICLE HAD APPROXIMATELY 118,000 MILES AT TIME OF FAILURE.",
        "vin": "1FMJU1J59DE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11234604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 FORD EXPEDITION. THE CONTACT STATED THAT WHILE DRIVING ABOUT 65 MPH IN THE RAIN, THE VEHICLE FLIPPED OVER (UPSIDE DOWN) AND SPUN WITHOUT IMPACT AND NO WARNING. ALL THE AIR BAGS DEPLOYED.  A POLICE REPORT WAS FILED. THE DRIVER AND THE FRONT PASSENGER SUSTAINED MINOR CUTS AND BRUISES AND WERE TREATED BY THE PARAMEDICS AT THE SCENE AND RELEASED, WITHOUT GOING TO THE EMERGENCY CENTER. THE VEHICLE WAS DAMAGED AND WAS TOWED TO A POLICE IMPOUND, WAITING FOR THE INSURANCE COMPANY. THE CONTACT RECEIVED AN UNKNOWN RECALL (19B05) FROM THE MANUFACTURER VIA \"CUSTOMER SATISFACTION PROGRAM\": THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS CALLED BUT NO ONE ANSWERED THE PHONE.  THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.",
        "vin": "1FMJU1J57DE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231252,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NUMBER FOUR SPARK PLUG ISSUE WITH THE 5.4L V8 ENGINE AND PHASER CAUSED MY ENGINE TO FAIL. THIS IS THE SECOND FORD VEHICLE THAT I HAVE OWNED THAT THIS HAPPENED TO AND FORD HAS DONE NOTHING TO RESOLVE THIS LONG KNOWN ISSUE WITH THE PHASERS AND NUMBER FOUR SPARK PLUGS. PLEASE HELP SMALL BUSINESS OWNERS WHO DEPEND ON VEHICLES. FORD NEEDS TO EITHER PAY FOR REPLACEMENT MOTORS OR SOMETHING. I SPENT $5000 ON A NEW MOTOR AND FORD TOLD ME IT IS A KNOWN ISSUE AND TO CONTACT YOUR AGENCY AS IT IS UNDER INVESTIGATION.",
        "vin": "1FMJK2A56DE"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220454,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY AS I WAS DRIVING ON PERRY RD ABOUT TO TURN ONTO FM 1960 RD E. WHEN I STARTED TO ACCELERATE TO TURN, MY TRANSMISSION DOWN SHIFTED WHILE I'M DRIVING AT ABOUT 15 MILES AN HOUR INSTEAD OF GOING UP AND JERKED MY CAR PRETTY GOOD. I LET GO OF THE GAS PEDAL FOR A SECOND, THEN TRIED AGAIN SLOWLY. THE CAR STARTED TO JERK AS IF IT WAS STRUGGLING TO ACCELERATE FORWARD. IT DID AFTER ABOUT 10 SECONDS. THEN THE SPEEDOMETER DROPPED DOWN TO 0 AND MY DIGITAL FUEL INFORMATION THAT'S DISPLAYED ON MY DASH DOTTED OUT AND A SCREWDRIVER ICON FLASHED FOR A FEW TIMES. THE CAR THEN STARTED TO MOVE SMOOTHLY, BUT SEEMED STUCK IN GEAR. THIS FOLLOWED WITH THE TMPS SENSOR KICKING ON. NO CHECK ENGINE LIGHTS SHOWED UP DURING THIS PERIOD AND WHEN I GOT TO WHERE I WAS SAFE, I TURNED THE CAR OFF FOR ABOUT 15 MINUTES. WHEN I TURNED IT ON AGAIN, IT WAS PERFECTLY NORMAL. THIS HAS HAPPENED BEFORE WHILE I DROVE ON A MAJOR HIGHWAY AND IT IS SCARY. NO DIAGNOSTIC TEST HAS FOUND AN ISSUE AND I CANNOT AFFORD TO PAY FOR AN EXPLORATORY SERVICE AS I JUST DID A COOLANT REPAIR A COUPLE OF WEEKS AGO.",
        "vin": "1FMJK1K57DE"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220133,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON THE HIGHWAY, THE SPEEDOMETER STOPPED OPERATING AND FUEL INFO MALFUNCTIONED. THE TPMS SENSOR LIGHT CAME ON AS WELL. I TURNED THE CAR OFF AND BACK ON TO FIND IT WAS ALL WORKING AGAIN.",
        "vin": "1FMJK1K57DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218279,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL SWITCH GEARS WHILE TRAVELS NG AT 70 MILES PER HOUR. I IMMEDIATELY PULL TO SIDE AND HAVE TO STOP AUTOMOBILE AND RESTART. THE DASH SHOWS MOTOR AND CHECK ENGINE. AT THIS TIME THE PASSENGER SEAT BELT WILL NOT REMAIN LATCHED. THE AIR CONDITIONER HAS STOPPED WORKING. MY SPOUSE IS A MECHANIC AND CHECKED THE PLUG BELOW THE GLOVE COMPARTMENT. THE PLUG RECEIVER (NOT SURE WHAT IT'S CALLED ) HAD A WHOLE MELTED IN BOTTOM OF FEMALE AND OF PLUG.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206499,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 FORD EXPEDITION TRANSMISSION UNEXPECTEDLY DOWNSHIFTS TO A LOWER GEAR WITHOUT INPUT FROM THE DRIVER CAUSING THE VEHICLE TO SLOW DOWN SUDDENLY WITHOUT WARNING, OR THE TRANSMISSION DOES NOT SHIFT UP TO A HIGHER GEAR WHEN ACCELERATING. THE SUDDEN DOWNSHIFT HAS OCCURRED AT SPEEDS OVER 50 MPH AND CAUSED THE REAR TIRES TO LOCK UP AND SKID. THESE TRANSMISSION ISSUES ARE SPORADICALLY ACCOMPANIED BY THE CHECK ENGINE LIGHT AND/OR WRENCH ICON ON THE DISPLAY.  MY TRUCK IS CURRENTLY WITH THE FORD DEALER IN FOLEY, AL FOR REPAIR. THEY HAVE TOLD ME THAT COST FOR REPAIR OF THIS ISSUE IS NOT COVERED UNDER A RECALL.",
        "vin": "1FMJU1J54DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183942,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE STALLS AND STAYS IN FIRST GEAR BEFORE LAUNCHING FORWARD. IT ALSO WILL AFFECT THE DASHBOARD GAGES. THEY WILL RANDOMLY SHUT OFF AND/OR FLASH DIFFERENT SENSORS. I AM WRITING THIS COMPLAINT BECAUSE I SEE THAT IT IS UNDER INVESTIGATION AND WANT TO LET YOU KNOW IT'S HAPPENED TO ANOTHER VEHICLE. THIS IS NOT SAFE FOR A FAMILY CAR.",
        "vin": "1FMJK2A57DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE RANDOMLY DOWNSHIFTS AND STALLS WHILE DRIVING SPEEDOMETER DOESN'T READ. THE LOSS OF POWER IS A DRIVING SAFETY CONCERN FOR A MOTHER OF 3 TO STALL IN THE MIDDLE OF THE ROAD WIRH NO WARNING. PLEASE SEE RECALL 12C23 IN EHICH IT STATES 2011 THRU 2013 BUT UNDER DOCUMENTATION IT LIST ONLY 2011 THRU 2012. HELP THIS IS AN ONGOING ISSUE THAT WARRANTS IMMEDIATE ATTENTION",
        "vin": "1FMJU1H59DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. WHILE DRIVING, THE VEHICLE STARTED TO LOSE POWER WHILE ACCELERATING FROM A COMPLETE STOP. IN ADDITION, THE ODOMETER AND SPEEDOMETER STOPPED WORKING. THE CONTACT PULLED OVER AND TURNED OFF THE VEHICLE. ONCE THE VEHICLE WAS RESTARTED, THE SYSTEM RESET. THE FAILURE OCCURRED SEVERAL TIMES. THE CONTACT STATED THAT THE VEHICLE SHIFTED HARD AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A PARTS STORE AND WAS INFORMED THAT THE TURBINE SPEED SENSOR FAILED. THE CONTACT PURCHASED THE PART AND A MECHANIC INFORMED HER THAT THERE WAS NO SUCH PART FOR HER VEHICLE. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS TAKEN TO ANOTHER PARTS PLACE WHO DIAGNOSED THAT THE COMPUTER BOARD (MOLD LEAD FRAME) FAILED. THE MANUFACTURER STATED THAT THERE WAS NO RECALL FOR THE VEHICLE AND TRANSFERRED THE CONTACT TO NHTSA TO FILE A COMPLAINT. THE EXTENDED WARRANTY FOR THE VEHICLE RECENTLY EXPIRED. THE FAILURE MILEAGE WAS 135,000.",
        "vin": "1FMJK1J54DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING AT SPEEDS OF 45 TO 50 MPH MY VEHICLE SUDDENLY DOWNSHIFTS UNTIL IT COMES TO A COMPLETE STOP.",
        "vin": "1FMJK1K59DE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL SELF ENGAGES AND ACCELERATES.  TAPPING BREAK OR PRESS THE OFF SWITCH WILL DEACTIVATE, BUT CRUISE WILL CONTINUALLY SELF ENGAGE.",
        "vin": "1FMJK1K51DE"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. THE VEHICLE EXPERIENCED INDEPENDENT BRAKING WHILE BEING OPERATED AT 70 MPH. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT THE FAILURE COULD NOT BE DUPLICATED. IN ADDITION, THE FUEL GAUGE AND SPEEDOMETER FAILED TO DISPLAY CORRECT INFORMATION. THE DEALER (FRIENDLY FORD OF CROSBY, 2425 US-90 BUS, CROSBY, TX) DIAGNOSED THAT THE TRANSMISSION MODULE FAILED AND RECOMMENDED IT BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 15410976. THE FAILURE MILEAGE WAS 86,000.  *JS",
        "vin": "1FMJU1H58DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2018",
        "dateOfIncident": "06/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100572,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ILLUMINATED MALFUNCTION LIGHT (WRENCH LIGHT) CAME ON AS THE VEHICLE EXPERIENCED AN UNINTENDED DOWNSHIFT INTO FIRST GEAR ENTERING THE HIGHWAY.  WE ALSO NOTED THAT OUR SPEEDOMETER FELL TO 0 WHILE STILL DRIVING.  WE WERE ABLE TO QUICKLY PULL OFF TO THE SHOULDER AND TURNED THE VEHICLE OFF.  UPON RESTARTING THE ENGINE, WE WERE ABLE TO CONTINUE OUR TRIP HOME.  WE EXPERIENCED THE SAME ISSUE AGAIN (UNINTENDED DOWNSHIFT TO FIRST GEAR WHILE DRIVING) THE NEXT DAY PROMPTING US TO TAKE THE CAR TO THE DEALERSHIP.  WE TOOK THE EXPEDITION TO THE DEALER AND WERE INFORMED THE ISSUE WAS WITH THE MOLDED LEADFRAME.  UPON RESEARCH FOUND THE EXACT SAME ISSUE WAS RECALLED ON 2011-2012 VERSIONS. GIVEN OUR VEHICLE IS A 2013, WE ARE NOT ELIGIBLE.  THIS IS UNACCEPTABLE AND EXTREMELY DANGEROUS.  IF OUR VEHICLE IS AFFECTED WITH THE SAME CONCERN THAT CAUSED A RECALL IN 2011-2012 VERSIONS, THOSE DRIVING 2013 AND POTENTIALLY OTHER YEARS WILL LIKELY EXPERIENCE A SIMILAR ISSUE.  WE WERE LUCKY THAT THIS DID NOT HAPPEN AT FULL SPEED ON THE HIGHWAY.",
        "vin": "1FMJK1K52DE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED SWAY BAR LINKS THREE TIMES ON BOTH SIDES",
        "vin": "1FM5K7D89DG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093637,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE'S CHECK ENGINE LIGHT WOULD SUDDENLY COME ON AND THE VEHICLE WOULD SPORADICALLY DOWNSHIFT. THE MOST NOTABLE INSTANCE WAS DRIVING 65 MPH ON THE HIGHWAY. LUCKILY NOBODY WAS EVER HURT AND THERE WAS NO DAMAGE. AFTER THAT I DID SOME RESEARCH AND FOUND A TSB FOR MY CAR'S TRANSMISSION AND A RECALL FOR THE PREVIOUS TWO YEARS. TSB 13-6-8. SINCE THE REPAIRS THE CAR IS RUNNING FINE.",
        "vin": "1FMJU1K54DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE TRANSMISSION DOWNSHIFTS AND MAKES THE RPMS REF HIGH. THEN THE WRENCH ICON WILL SHOW ON THE DASH AND THE CAR SAYS ' MILES TILL EMPTY AND THE MPH GAUGE GOES TO 0 EVEN THOUGH IT'S STILL DRIVING. IT WILL ALSO MENTION THE SPEED WHEEL SENSOR HAS MALFUNCTIONED. I CORRECT THIS BY PULLING OVER AND RESTARTING THE CAR SOMETIMES A FEW TIMES WITHIN 5 MINUTES HAVING TO PULL OVER EACH TIME.",
        "vin": "1FMJK1K52DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074995,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK SLOWS DOWN AND THE WRENCH COMES ON THE DASHBOARD AND AFTER THAT 3 DASHES COME UP ALONG WITH THE STATEMENT \"MILES TO E FUEL LEVEL LOW\" AND THE FUEL IS NOT LOW AT ALL. IN THE BOOK IT STATES POWER TRAIN.  THIS HAS BEEN HAPPENING FOR ABOUT 3 MONTHS NOW.",
        "vin": "1FMJK1K57DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "01/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH MY FAMILY OF 3 KIDS ON A 4-LANE HIGHWAY AT ABOUT 60 MPH, THE TRANSMISSION DOWNSHIFTED INTO WHAT I BELIEVE WAS 1ST GEAR. THE VEHICLE LUNGED FORWARD, LOCKED UP OR SKIDDED THE REAR TIRES AND SLOWED WAY DOWN. AFTER LETTING OFF THE GAS PEDAL, THE VEHICLE DROVE AT 20 MPH FOR A BIT AND THEN WENT BACK TO ACTING NORMAL.",
        "vin": "1FMJK1H55DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VACATIONING IN VIRGINIA I WAS DRIVING ABOUT 60 MPH ON A BUSY HIGHWAY WHEN THE CAR SUDDENLY SHIFTED INTO FIRST GEAR, WHICH VERY NEARLY CAUSED  A REAR END COLLISION BY THE VEHICLE BEHIND ME. I GOT THE CAR TO A FORD DEALERSHIP AND IT WAS REPAIRED UNDER WARRANTY.   SEEMS LIKE A VERY DANGEROUS DEFECT!",
        "vin": "1FMJK2A50DE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING (SPEEDS RANGING FROM 25MPH- 70MPH) THE CRUISE CONTROL ON OUR 2013 FORD EXPEDITION LIMITED EL WILL SELF ENGAGE. TAPPING THE BREAKS AND HITTING THE CRUISE CONTROL \"OFF\" SWITCH WILL TEMPORARILY DEACTIVATE CRUISE CONTROL BUT IT WILL REENGAGE WITHOUT DRIVER ENGAGING CRUISE CONTROL ACCELERATING THE CAR. THIS HAS HAPPENED MULTIPLE TIMES EVEN AFTER TURNING OFF AND RESTARTING THE CAR (AND ACROSS MULTIPLE DAYS).",
        "vin": "1FMJK2A50DE"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990852,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION ON AN OREGON COASTAL HIGHWAY AT ABOUT 35 MPH VEHICLE HESITATED MADE A LOUD NOISE AND QUIT.  AT THE TIME VEHICLE HAD ABOUT 72000 MILES ON IT, AND NEVER GAVE A WARNING INDICATOR, SHOWING ANYTHING WAS WRONG.  AS A RESULT THE ENGINE HAD TO BE REPLACED.  THE ONLY INDICATOR THE SERVICING DEALER PROVIDED REGARDING THE FAILURE WAS A MISFIRE IN NUMBER 3.  THE PRODUCT IS DEFECTIVE EITHER IN CONSTRUCTION OR SOFTWARE AS NON WARNING WAS GIVING THAT ANYTHING WAS WRONG.  PREVIOUSLY ON 2 DIFFERENT OCCASIONS AT 2 DIFFERENT LOCATIONS I TOOK VEHICLE IN BECAUSE IT SEEMED TO BE IDLING LOW AND BOTH DEALERS STATED NOTHING WRONG.",
        "vin": "1FMJK2A51DE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "01/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956209,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. WHILE DRIVING APPROXIMATELY 73 MPH WITH THE CRUISE CONTROL ACTIVATED, THE SERVICE INDICATOR SUDDENLY ILLUMINATED AND THE VEHICLE LOST POWER AND REDUCED SPEED. THE DRIVER COASTED TO THE SIDE OF THE ROAD AND STOPPED THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE THROTTLE BODY WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE FAILURE WAS REMEDIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 32,000.",
        "vin": "1FMJU1J57DE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "01/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10956060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. WHILE DRIVING 35 MPH, THE CONTACT'S VEHICLE \"T-BONED\" ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE CHEST, NECK, AND LOWER LEFT LEG, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED AND TOWED. THE MANUFACTURER WAS NOT MADE AWARE OF THE CRASH. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "1FMJU2A59DE"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "12/23/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948854,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. WHILE DRIVING 45 MPH, THE REAR PASSENGER DOOR OPENED WITHOUT WARNING. IN ADDITION, THE FRONT DRIVER SIDE DOOR WOULD NOT CLOSE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V643000 (LATCHES/LOCKS/LINKAGES). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "1FMJU1J52DE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE FAILED TO HOLD THE VEHICLE AT 1500 RPM WHICH IS REQUIRED IN MASSACHUSETTS TO PASS STATE INSPECTION. IT DOES NOT  PERFORM TO SPECIFICATIONS.  VEHICLE WAS ABOUT 2 YRS OLD WITH 9500 MILES.  DEALER HAD TO REMOVE AND CLEAN PARKING BRAKES PARTS AND REASSEMBLE. I HAD THE EXACT SAME ISSUE WITH 2000 EXPEDITION EVERY YEAR THE PARKING BRAKE WOULD FAIL STATE INSPECTION AND HAD TO BE REPAIRED. I CONSIDER THIS A SAFETY ISSUE AND DESIGN FLAW IF THE PARKING BRAKES CHRONICALLY UNDER PERFORM ON THESE FORD VEHICLES",
        "vin": "1FMJU1J52DE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2016",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925571,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON BRAKING AT HIGH SPEEDS SUCH AS 65 MPH EXITING THE INTERSTATE, THE. STEERING WHEEL WOULD SHUDDER VIOLENTLY, THEREFORE IN JANUARY 2016 AT 39,416 MILES, HAD FRONT BRAKES AND ROTORS REPLACED PRIOR TO DRIVING IN THE ROCKY MOUNTAINS OF COLORADO.  BY JULY~ AUGUST 2016, REOCCURRENCE OF SAME PROBLEM SO TOOK VEHICLE TO AN ALIGNMENT SHOP FOR SERVICE, WHERE NEW ROTORS WERE THE PLAN BUT THEY DISCOVERED FRONT BRAKES ALSO NEEDED REPLACING SO BOTH REPLACED ON THE FRONT. NOW, NOVEMBER 10, MILEAGE IS 54,125, AND VISITED  FORD DEALER AFTER SMOKE AND GROANING NOISE OCCURRED. I WAS TOLD FRONT BRAKES WEREN'T SAFE TO DRIVE. I HAVE NOW PAID FOR NEW FRONT BRAKE, NEW FRONT CALIPER, NEW BRAKE HOSE.",
        "vin": "1FMJK2A55DE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915789,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STRUTS WERE REPLACED AT 26,344 ON 6/30.16 AND  NOW IN OCTOBER 2016 THE NEW ONES ARE ALSO LEAKING OIL AND NOT WORKING. I DRIVE ON PAVED ROADS.",
        "vin": "1FMJU1H54DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE NOTICED WHAT APPEARTED TO BE A DRIP ON DRIVER WINDOW AND CLEANED IT OFF.  TIME WENT BY AND THEN NOTICED AGAIN IT ALONG WITH LITTLE NICKS IN FILM.  BROUGHT CAR IN FOR OTHER ITEM AND IT WAS MENTIONED. REPRESENTATIVE CALLED AND SAID THE INNER WORKINGS OF WINDOW WAS DISINTEGRATING INSIDE THE DOOR PANEL.  WE HAD TO HAVE THE REGULATOR REPLACED.  THE TOTAL COST WAS $494.00.  WE DONT USE THE WINDOW OFTEN SO WE HAVE NO IDEA HOW LONG THIS AS BEEN GOING ON.  WE CERTAINLY WOULD NOT EXPECT THIS TO HAPPEN IN THIS AGE OF A CAR.",
        "vin": "1FMJU1H55DE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903779,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT STRUTS LEAKING FLUID AFTER ONLY 36,000 MILES",
        "vin": "1FMJU1K55DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899641,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS 31,000 MILES ON IT, AND HAS BEEN PROPERLY MAINTAINED ACCORDING TO FORD SPECIFICATIONS.  ON 4 DIFFERENT OCCASIONS, THE CAR HAS SWITCHED INTO LIMITED POWER MODE WITHOUT ANY WARNING.  NO ENGINE WARNING LIGHTS APPEARED, THE CAR JUST SUDDENLY SLOWED DOWN.  IN EACH CASE FULL POWER RESUMED IN ABOUT 5 SECONDS.  IN 3 OF THE CASES, THE POWER LOSS OCCURRED DURING A TURN, AND POWER RESUMES AFTER STRAIGHTENING OUT.  ON THE FOURTH TIME, THE CAR WAS NOT TURNING IT WAS TRAVELING STRAIGHT ON A SURFACE STREET . UNDER 30 MPH AND WE ATTEMPTED TO ACCELERATE..  IF WE HAD BEEN TRYING TO ACCELERATE INTO FREEWAY TRAFFIC COMING OUT OF AN ON RAMP, WE COULD EASILY HAVE BEEN HIT BY ONCOMING CARS TRAVELING AT HIGH SPEED.    THE FIRST TWO INCIDENTS HAPPENED IN MAY, THE NEXT TWO IN AUGUST.    I TOOK IT TO A FORD DEALER IN FLORIDA, AND THEY SAID THAT SINCE THE COMPUTER DID NOT RECORD ANY INCIDENT CODE AND THEY COULD NOT SEE ANYTHING THAT WAS WRONG, THEY COULD NOT DIAGNOSE THE PROBLEM.    WHEN IT HAPPENED AGAIN AT HOME IN TEXAS, I TOOK IT BACK TO THE FORD DEALER WE BOUGHT IT FROM.  THEY ALSO SAID THEY WOULD HAVE TROUBLE FINDING THE PROBLEM WITHOUT ANY INCIDENT CODE.  THEY WERE UNABLE TO REPLICATE THE PROBLEM.  BUT THEY DID SAY THAT THE FRONT TIRES NEEDED AN ALIGNMENT, AND THAT THE STEERING WHEEL WAS OFF CENTER CAUSING THE THE STEERING ANGLE TO READ INCORRECT. THEY ALSO DECARBED THE ENGINE AND CLEANED THE THROTTLE BODY.  THEY SAID THEY DID NOT KNOW IF THE REPAIRS WOULD SOLVE THE PROBLEM.    TODAY, AUGUST 30, WHILE DRIVING STRAIGHT AT ABOUT 45 MPH, WITHOUT ANY ATTEMPT TO ACCELERATE, THE CAR SWITCHED INTO LIMITED POWER MODE FOR A COUPLE OF SECONDS, AND THEN RESUMED NORMAL OPERATIONS.  THIS WAS THE 5TH OCCURRENCE.    THIS CONTINUES TO BE AN EXTREMELY HAZARDOUS SITUATION, AND FORD CANNOT FIX IT.",
        "vin": "1FMJU1K57DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2016",
        "dateOfIncident": "07/23/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896861,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT HIGHWAY SPEED THE WRENCH LIGHT COMES ON AND THE VEHICLE LOSES POWER. I AM ABLE TO BREAK AND GET TO THE SIDE OF THE ROAD BUT HAVE NO ACCELERATION. IF I SHUT OFF THE VEHICLE AND RESTART IT THE CHECK ENGINE LIGHT IS ON. THE ERROR CODE INDICATES IT IS A THROTTLE BODY SENSOR FAULT, BUT THE DEALERSHIP HAS CLEANED THE SENSOR AND REPLACED THE ELECTRONIC THROTTLE BODY TWICE AND IT IS STILL HAPPENING. THIS COULD CAUSE A SERIOUS ACCIDENT IF I'M IN THE MIDDLE OF TRAFFIC.",
        "vin": "1FMJK2A52DE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "10/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT STRUT FAILED LOSING CHARGE AND CAUSING UNSAFE STEERING AND SUSPENSION MOVEMENT WITH LESS THAN 31K MILES.  RIGHT REAR STRUT FAILED SHORTLY AFTER.  FORD STATES THIS IS A KNOWN SAFETY ISSUE BUT NO RECALL.",
        "vin": "1FMJU1J56DE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "11/21/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR STRUT FAILED CAUSING HANDLING ISSUES AND SAFETY CONCERNS.",
        "vin": "1FMJU1J56DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 13,000 MILES REAR DIFFERENTIAL STARTED SHOWING SIGNS OF FAILURE, FORD STATED HOWL AND NOISE WAS NORMAL.  AT 31,000 MILES FORD STATED THERE WAS AN ISSUE AND RING AND PINION HAD BEGUN TO FAIL.  HAD IT FAILED WHILE DRIVING THE REAR END WOULD HAVE MOST LIKELY LOCKED UP. A COMPLETE WORK ORDER WITH PART NUMBERS IS AVAILABLE FOR NHTSA REVIEW.",
        "vin": "1FMJU1J56DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WET OR RAINY CONDITIONS PERSIST THE FRONT PARK ASSIST SYSTEM ACTIVATES ANYTIME THE VEHICLE DROPS BELOW THE PRESENT SPEED THRESHOLD ALERTING THAT THERE IS AN 'OBJECT' PRESENT NEAR THE SENSOR.  THE OCCURS WHEN THE VEHICLE IS STARTED AND PUT IN GEAR WHEN PARKED OR WHEN THE VEHICLE SLOWS FOR TRAFFIC OR TRAFFIC CONTROL DEVISES AND NO VEHICLES ARE PRESENT. THE SYSTEM ALSO RANDOMLY ALERTS IN CLEAR AND DRY CONDITIONS BUT THIS IS RARE (MAYBE ONCE A MONTH).  THIS CAUSES A GRAVE SAFETY ISSUE AS YOU ARE UNSURE IF THERE COULD BE A SMALL PERSON OR ANIMAL PRESENT IN FRONT OF THE VEHICLE, THE DRIVER MUST TAKE EXTRA TIME TO EXIT THE VEHICLE AND VISUALLY VERIFY THAT NO ONE HAS ENTERED THE BLIND SPOT WHILE STOPPED OR PARKED.  FORD CHECKED THE SYSTEM AND STATED THIS IS NORMAL AND A KNOWN ISSUE.  THEY SAID THAT THEY ARE NOT SURE HOW TO REMEDY THE ISSUE BUT JUST TO USE EXTRA CAUTION.  SERVICE HISTORY REPORTS ARE AVAILABLE ON THIS AS WELL AS VIDEO TO SHOW THIS ISSUE.",
        "vin": "1FMJU1J56DE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2015",
        "dateOfIncident": "05/16/2015",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHOLE CAR BURNT WITHIN LESS THAN 5 MIN, AIR CONDITION WAS WORKING FRONT BLOWER STOPPED WORKING, SMOKE STARTED COMING FROM DASHBOARD, RAN OUT OF THE CAR. SAW FIRE FROM THE DASH AND UNDER WIPER OUT SIDE OF THE CAR. WITHIN A MINUTE CAR WAS ON FIRE. EVERY THING BURNT WITHIN 5 MIN, INCLUDING HOOD SEATS. KIND OF SKELETON LEFT.",
        "vin": "1FMFK2A58DE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2014",
        "dateOfIncident": "02/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL - THE CONTACT OWNS A 2013 FORD EXPEDITION. THE CONTACT STATED THAT THE ANTI SKID (ABS) SYSTEM ACTIVATED INDEPENDENTLY. THE CONTACT ALSO STATED THAT A CHIME SOUNDED AND THE ABS WARNING LIGHT ILLUMINATED. THE VEHICLE WAS RESTARTED AND FUNCTIONED AS NORMAL. THE CONTACT WAS CONCERNED FOR HIS SAFETY BECAUSE THE FAILURE COULD POTENTIALLY RESULT IN A CRASH. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE COMPUTER AND SOME SENSORS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,000. DR",
        "vin": "1FMJU1J5XDE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/16/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622653,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT HEADRESTS ARE INTOLERABLE. HAVE NEVER DRIVEN A VEHICLE THAT CAUSED SUCH SEVERE DISCOMFORT DUE TO  POSITIONING OF HEAD RESTS. NEEDS ABILITY TO ADJUST TILT FORWARD AND BACK. FIXED POSITION IS ANGLED FORWARD WAY TOO MUCH. VERY DISTRACTING WHILE DRIVING. PLEASE HELP?!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583211,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DEVELOPED A VIBRATION STARTING AT 25MPH AND CONTINUED AS SPEED INCREASED.  FORD DEALER UPON EXAMINATION FOUND THAT ONE BOLT WAS MISSING AND ANOTHER WAS LOOSE AT THE REAR END OF DRIVE SHAFT CONNECTION TO THE REAR END .  *TT",
        "vin": "1FMJU1H54DE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "03/21/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579114,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS HOOKING UP A TRAILER TO THE BACK,  AS I BACKED UP I COULD NOT SEE THE TRAILER ALIGNMENT IN THE CAMERA DUE TO DARKNESS.  I PUT THE SUV INTO PARK, VISUALLY VERIFIED THE SHIFTER WAS IN PARK AND TOOK MY FOOT OFF THE BRAKE AND THE VEHICLE STAYED IN PLACE. WITH THE ENGINE RUNNING I GOT OUT TO VISUALLY SEE HOW I WAS LINED UP WITH THE TRAILER. I DID NOT APPLY THE PARKING BREAK.  I LEFT THE DRIVERS DOOR OPEN AND AS I PASSED THE LEFT REAR DOOR THE TRANSMISSION JUMPED OUT OF PARK AND INTO REVERSE. I JUMPED BACK INTO THE SUV AND STOPPED THE VEHICLE. THE MOVEMENT WAS SUDDEN AND UNEXPECTED HAVING HOOKED UP TRAILERS FOR MANY YEARS BUT NOT IN THIS EXPEDITION BUT IN AN EXPEDITION I OWNED FROM 2004 TO 2012 AND SEVERAL DIFFERENT PICKUPS. THIS ONE MOVED ENOUGH AND STRONG ENOUGH IN THESE FEW SECONDS TO PUSH THE TRAILER INTO A FENCE AND WIPED OUT A METAL FENCE POST AND A SECTION OF WOOD FENCE. IT ALSO RAMMED THE TRAILER INTO THE REAR BUMPER AREA ABOVE THE HITCH.  THIS ISN'T A COMPLAINT BUT I NEED TO KNOW IF THIS HAS BEEN REPORTED BY ANY OTHER EXPEDITION OWNERS WITH THIS TRANSMISSION.  *JS",
        "vin": "1FMJU1H5XDE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/16/2014",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572702,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THURSDAY, MARCH 6TH, WHILE DRIVING 70 MPH ON IH40 IN EASTERN ARKANSAS MY SUNROOF EXPLODED.  TRAFFIC WAS MOVING NICELY AND I WAS NOT CLOSE ENOUGH BEHIND OTHER VEHICLES FOR ANYTHING TO HAVE IMPACTED MY EXPEDITION.  WEATHER WAS NOT A FACTOR.  THE SHADE OF THE SUNROOF WAS OPEN, BUT THE SUNROOF ITSELF WAS CLOSED.  WE (MY SONS AND I) HEARD A LOUD NOISE AND GLASS RAINED DOWN ON ME AND MY 15 YEAR OLD SON WHO WAS IN THE FRONT SEAT.  THE SUNROOF HAD A HUGE HOLE IN THE MIDDLE OF IT AND THE REMAINING GLASS WAS SHATTERED COMPLETELY.  AT THE FIRST OPPORTUNITY TO SAFELY STOP, WE DISCOVERED THAT THE REMAINING GLASS WAS BOWED UP... IT HAD SHATTERED OUTWARD NOT INWARD TOWARD THE CABIN.  WE THEN CLOSED THE SHADE AND STOPPED AT THE FIRST FORD DEALERSHIP ON OUR ROUTE (IN BENTON, AR - ABOUT 2 HOURS AWAY).  THEY SAID THEY COULD NOT DO ANYTHING.  WE CONTINUED ON OUR TRIP AND STOPPED AT A LARGE FORD DEALERSHIP IN ARLINGTON, TX FOR ASSISTANCE.  THE SERVICE TECH TOOK PICTURES AND SENT THEM TO FORD.  I CALLED HIM THE FOLLOWING MONDAY AND HE SAID FORD WOULD NOT COVER GLASS BREAKAGE.  WE COULD HAVE BEEN SERIOUSLY INJURED IF I HAD NOT MAINTAINED CONTROL OF MY VEHICLE.  I HAVE PICTURES AND CAN SEND THEM TO YOU.   I UNDERSTAND THAT HYUNDAI HAS ISSUED A RECALL FOR THIS SAME PROBLEM AND WONDER IF FORD IS GETTING THEIR SUNROOF'S FROM THE SAME MANUFACTURER.  ANY ASSISTANCE YOU CAN PROVIDE BY LOOKING INTO THIS MATTER WITH FORD MOTORS IS APPRECIATED.  *TR",
        "vin": "1FMJU1H54DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 FORD EXPEDITION.  CONSUMER WRITES IN REGARDS TO FALSE ALARM ISSUES WITH VEHICLE PARKING AID MODULE FAILURE.  *SMD  THE CONSUMER STATED WHEN HIS WIFE STARTED THE VEHICLE, THE PARKING AID WARNING TONE WAS SOLID AND EMITTED A LOUD NOISE, THAT CAUSED A HUGE DISTRACTION. THE CONSUMER STATED THE FAILURE WAS INTERMITTENT, AND THE FAULTS CODES WERE NOT BEING CAPTURED BY THE COMPUTER.  THE CONSUMER STATED ONCE AGAIN, THERE WAS ANOTHER INTERMITTENT PARKING AID FAULTY WARNING TONE.  UPDATED 01/30/14  FORD FIELD SERVICE ENGINEER RECOMMENDED REPLACING 4 SENSORS IN THE FRONT BUMPER, AS WELL AS THE DRIVER'S KEYLESS ENTRY PAD, AS IT HAD SEVERAL LED'S THAT WERE NOT ILLUMINATED. THE CONSUMER WAS NOT SURE, IF THE PROBLEM CORRECTED, BECAUSE THE FALSE WARNING TONES, WERE INTERMITTENT.",
        "vin": "1FMJU2A51DE"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2013",
        "dateOfIncident": "08/15/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556446,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE IS ERRATIC. SOMETIMES ACCELERATION FROM A STOP IS SMOOTH AND SOMETIMES ITS AS IF THE THROTTLE IS BINDING AGAINST SOMETHING. OTHER TIMES THE THROTTLE IS DEPRESSED AND NOTHING HAPPENS UNTIL THE VEHICLE SUDDENLY LURCHES FORWARD. THE LAST EPISODE WAS PULLING INTO A PARKING PLACE AND THE ENGINE SUDDENLY WENT INTO IDLE. I MASHED THE GAS MORE AND MORE AND IT SUDDENLY ALMOST LURCHED OVER THE CURB. I HAVE HAD IT TO[XXX] IN PLANO TEXAS ON SEVERAL OCCASIONS, EVEN LEAVING IT FOR SEVERAL DAYS FOR THEM TO DRIVE. THEY CHANGED SEVERAL ITEMS ON THE TRANSMISSION, BUT IN THE LAST FEW DAYS IT HAS WORSENED(MORE FREQUENT).  THERE ARE NO ERROR CODES, BUT IT IS BECOMING UNSAFE TO DRIVE. I HAVE TO LEAVE THE CAR WITH A PARKING VALET WHEN MY WIFE RECEIVES MEDICAL TREATMENT AND THIS COULD BE PROBLEMATIC.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FMJK1H5XDE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2013",
        "dateOfIncident": "12/08/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555554,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD EXPEDITION. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 10 MPH, A LOUD BANGING NOISE WAS HEARD FROM THE FRONT END OF THE VEHICLE AS THE WHEELS SEIZED. THE CONTACT WAS ABLE TO TRAVEL AT LOW SPEED IN 2-WHEEL DRIVE.  THE VEHICLE WAS LATER TOWED TO AN AUTHORIZED DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE FRONT AXLE SHAFT WAS FRACTURED AND CAUSED DAMAGE TO THE TRANSMISSION COOLING LINE AND OIL PAN. THE PARTS WERE ORDERED AND THE VEHICLE WAS SCHEDULED FOR REPAIRS WHEN THE PARTS BECAME AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 1,200.",
        "vin": "1FMJU1J59DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2013",
        "dateOfIncident": "11/20/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 35 MPH WE LOST ALL SYSTEMS INCLUDING EXTERIOR, INTERIOR AND EMERGENCY LIGHTS. WE WERE ABLE TO STOP WITHOUT GOING OFF THE ROAD, ONCE WE HAD STOPPED AND PUT VEHICLE IN PARK WE WERE UNABLE TO GET IT OUT OF PARK. WE COULD TURN THE ENGINE ON AND OFF, BUT STILL COULD NOT GET VEHICLE TO COME OUT OF PARK, NOR COULD WE GET THE LIGHTING SYSTEM TO COME BACK ON, THE ONLY LIGHTS THAT WORKED WERE THE DASH LIGHTS. THE COMPUTER SYSTEM INDICATED: 1- TOW HAUL MALFUNCTION  2- TIRE PRESSURE MANAGEMENT SYSTEM LIGHT ON.    HAD VEHICLE TOWED TO FORD DEALER. THEY FOUND SEVERAL MODULES LOST COMMUNICATION WITH BCM, RESET SYSTEM, TEST DROVE BUT UNABLE TO DUPLICATE OR DETERMINE WHAT CAUSED THE PROBLEM.    WE WERE IN A VERY DANGEROUS SITUATION AS IT WAS DARK, WE WERE ON A TURN IN THE ROAD AND IN THE CENTER OF THE ROAD WITH NO EMERGENCY LIGHTING.  *TR",
        "vin": "1FMJK2A55DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/10/2013",
        "dateOfIncident": "11/29/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GPS HAS NOT WORKED PROPERLY FROM DAY ONE.  I HAVE HAD IT TO THE DEALER ON FOUR (4) TRIPS AND THE PROBLEM WITH THE GPS HAS NOT BEEN CORRECTED.  THE SOFTWARE IS CURRENT BUT IT DIRECT ONE TO TURN WHERE THERE IS NO ROAD AND CANCELS BEFORE YOU REACH THE SITE PROGRAMMED INTO THE GPS.  I CURRENTLY HAVE 6000 MILES ON THE VEHICLE I PURCHASED IN NOVEMBER 2012 AND NO CORRECTION OF THE GPS.  *TR",
        "vin": "MJK2A5XDEF1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SAFETY SEAT BELT WARNING LIGHT AND INDICATOR CHIME WHEN ADULT SETTING IN THE PASSENGER SET WITHOUT SEAT BELT FASTENED. VEHICLE ENGINE ON, TRANSMISSION IN DRIVE. THE DRIVERS SIDE WARNING LIGHT AND INDICATOR CHIME WORKS CORRECTLY AS YOU WOULD EXPECT IT TO. THE VEHICLE HAS OPERATED THIS WAY FROM THE DAY WE PURCHASED THE VEHICLE APPROXIMATELY 33 DAYS AGO AND IT NOW HAS 2800 MILES.  *TR",
        "vin": "1FMJU1J52DE"
    }
]