[
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS WILL ONLY ILLUMINATE THE HIGHWAY A SHORT DISTANCE AHEAD (50-60 FT) OF THE VEHICLE.  CANNOT DRIVE AT NIGHT.      ALSO, THE BRAKES TO NOT SEEM TO BE ADEQUATE. *DT    CONSUMER SOLD THE VEHICLE.*JB",
        "vin": "1F66F5DY3D0"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099011,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FORD F-53. THE CONTACT STATED THAT THE FRONT WINDSHIELD FIBER GLASS WAS SEPARATING FROM THE MOTOR HOME. UPON INSPECTION, THE CONTACT NOTICED THAT THE GLUE BETWEEN THE FIBER GLASS AND METAL WAS PEELING AND CAUSED THE SEPARATION. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER INFORMED THE CONTACT THAT THE WARRANTY HAD EXPIRED AND NO FURTHER ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "1F66F5DY5D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021463,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR HOME WAS PURCHASED NEW IN MAY OF 2013. WHILE DRIVING THIS SUMMER   I NOTICED MORE SWAY/ROLL THAN USUAL, SO I RESEARCHED 'FORD F53 CHASSIS- HANDLING ISSUES'. I FOUND THAT A LOT OF OWNERS REPORTED PROBLEMS WITH SOME OF THE BRACKETS ON THE REAR SWAY BARS. SOME HAD LOOSE OR MISSING BOLTS, LOOSE OR BENT OR MISSING BRACKETS ( EITHER SIDE). I WANTED TO SEE IF THIS COULD BE THE ISSUE I WAS HAVING WITH THE NOTICEABLE INCREASE SWAY/ROLL, SO I CRAWLED UNDER RIG TO INSPECT THE BRACKETS ON JULY 3RD, 2017. I FOUND THE SWAY BAR BRACKET ON DRIVERS SIDE, WAS BENT, BROKEN AND HANGING DOWN. THE UPPER BOLT WAS TIGHT AND HOLDING THE OTHER PIECE OF THE BRACKET (ABOUT 1\" SQUARE) THE LOWER BOLT WAS LOOSE AND HOLDING THE REST OF THE BENT/BROKEN BRACKET AND THE POLY BUSHING HAD SLID 2\"-3\" FROM IT'S INSTALLED POSITION.  I DON'T KNOW WHEN THE BRACKET CAME LOOSE/BROKE BUT I KNEW THAT IT WOULD NOT BE SAFE TO CONTINUE DRIVING THE MH IN THIS STATE, SO I ORDERED THE NEW BRACKET FROM A NEARBY FORD PARTS SUPPLIER AND INSTALLED IT MYSELF. I WILL TRY TO ATTACH PICS OF BROKEN BRACKET AS FIRST DISCOVERED AND PIC OF REPLACEMENT BRACKET RECEIPT. THE FORUM THAT I LEARNED OF THIS PROBLEM WAS 'IRV2' AND HAVE FOUND THAT IT HAS BEEN A ISSUE ON ALL MAKES, MODELS AND YEARS WITH THE FORD F53 CHASSIS. AND THAT IT NEEDS TO BE BROUGHT TO NHTSA ATTENTION. AS A LOT OF OWNERS JUST 'FIX' THE PROBLEM THEMSELVES UNLESS VEHICLE IS UNDER WARRANTY AND THE PROBLEM NEVER GETS REPORTED.",
        "vin": "1F66F5DY5D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2017",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR STABILIZER BAR (ALSO CALLED AN ANTI-SWAY BAR) BRACKET BOLTS CAME LOOSE.  THE UNIT HAD UNDER 5,000 MILES ON IT.  I TORQUED THE BOLTS AND THEY CAME LOOSE AGAIN AFTER ANOTHER FEW THOUSAND MILES.  I WAS A CERTIFIED ASE TECHNICIAN AND ALSO AN AUTOMOTIVE INSTRUCTOR FOR 35 YEARS (RETIRED) AND EVENTUALLY FIXED THE PROBLEM WITH LOCK TIGHT ON THE BOLT THREADS.  I HAVE HEARD OF MANY OTHERS WITH THE SAME ISSUES ON THE F-53 RV CHASSIS.  BECAUSE THE BOLTS WERE JUST LOOSE NO DRIVING ISSUES WERE NOTICED.   MANY HAVE REPORTED TO ME  ABOUT MISSING BOLTS AND BRACKETS.  WHEN THIS HAPPENS A LOSS OF SWAY CONTROL WILL OCCUR.  SINCE ONLY BOLTS WERE LOOSE I DON'T HAVE PICTURES.",
        "vin": "1F65F5DY5D0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "11/24/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002229,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 FOREST RIVER FR3.  CONSUMER REQUESTS REIMBURSEMENT FOR ELECTRIC DOUBLE STEP RECALL NOTICE REPAIRS.  *LD  UPDATED 07/10/2017*JS",
        "vin": "1F65F5DY2D0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON THE MOTOR HOME ARE INADEQUATE FOR NIGHT DRIVING. THEY ARE DANGEROUS CAUSING THE NEED TO USE THE HIGH BEAMS WHICH IS NOT IDEAL. THE DAYTIME DRIVING LIGHTS ON MY CAR DO A BETTER JOB.  THE ARE SOME SORT OF CHEAP AFTERMARKET LIGHTS THAT CAN'T BE DOT APPROVED. *DT  CONSUMER NO LONGER HAS THE VEHICLE.*JB",
        "vin": "1F65F5DY7D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2015",
        "dateOfIncident": "10/17/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 WINNEBAGO ITASCA SUNSTAR RV EQUIPPED WITH A 2013 FORD F-53 SD CHASSIS. WHILE DRIVING DOWN AN INCLINE AT APPROXIMATELY 35 MPH, THE BRAKE PEDAL WAS ENGAGED AND THE VEHICLE FAILED TO SLOW DOWN. THE TOW HAUL CONTROL BUTTON WAS ACTIVATED AND THE VEHICLE CAME TO A COMPLETE STOP. THE VEHICLE CONTINUED IN OPERATION. THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THREE DIFFERENT DEALERS FOR DIAGNOSTIC TESTING, BUT THE MECHANICS WERE UNABLE TO DUPLICATE OR LOCATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 850.    UPDATED 09/03/15*LJ     UPDATED 10/17/2017*CN",
        "vin": "1F66F5DY9D0"
    }
]