[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762741,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "HSR",
                "productYear": "9999",
                "size": "11R24.5",
                "type": "Tire"
            }
        ],
        "summary": "COMPLETE TREAD SEPARATION OF DRIVER FRONT TIRE LESS THAN 3 YEARS OLD AND LESS THAN 20,000 MILES ON I-10 NEAR WILCOX, AZ.   ENROUTE TO AS MUTUAL AID SEARCH AND RESCUE CALL NORMAL TRAFFIC TRAVELING APPROX. 70 MPH.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO WILL OVER BOOST TO 31 PSI AND THE ENGINE WILL GO IN TO A FAIL SAFE MODE REDUCING POWER TO 5 MILES AN HOUR WITHOUT WARNING. CAUSING YOU TO HAVE TO PULL TO THE SIDE OF THE ROAD AND TURN OFF THE ENGINE AND RESTART TO CLEAR THE FAIL SAFE MODE. THIS HAS HAPPEN TO ME OVER 12 TIMES. FORD HAS REPLACED THE TURBO TWICE UNDER WARRANTY. THE PROBLEM SEEMS FIXED FOR THE FIRST 30 - 40 THOUSAND MILES. THEN THE SAME PROBLEM RECURS. THE BIGGEST HEADACHE WITH THIS PROBLEM IS IT TAKE WEEKS AND SOME TIMES MONTHS FOR FORD TO DIAGNOSE. DO TO THE FACT THAT WHEN THIS HAPPENS NO ENGINE LIGHT COMES ON AND NO FAULT CODE IS STORED. FORD WILL NOT WARRANTY THE PART OUT UNTIL THEY GET A FAULT CODE. THE ONLY TIME THE TRUCK WILL THROW A FAULT CODE IS WHEN THIS PROBLEM HAPPENS TWICE ON THE SAME DAY. MOST OF THE TIME IT ONLY HAPPENS ONCE A DAY. I FIND THIS PROBLEM TO BE A MAJOR SAFETY ISSUE. DO TO THE FACT THAT IT HAPPENS WITHOUT WARNING AND YOU CAN'T ALWAYS MAKE IT TO THE SIDE OF THE ROAD UNDER REDUCED POWER. BE IT HEAVY TRAFFIC OR NO SHOULDER TO PULL OFF ON. THERE HAS BEEN 2 TIMES THAT I HAD TO STOP IN THE MIDDLE OF MY LANE AND SHUT THE TRUCK OFF AND RESTART IT BEFORE I COULD REGAIN FULL POWER.  *TR",
        "vin": "1FD0W5HT0DE"
    }
]