[
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "09/02/2021",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440663,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Forest River Georgetown RV. The contact stated while the RV was parked the contact was attempting to exit out of the passenger side center door of the RV. but the door would not open from the inside. The contact had to call roadside assistance where they had pop locked from the outside of the door handle to open the door, however, the failure reoccurred several times after. The contact concern is that when the RV trailer is hot its seems the vehicle door frame expanse causing the door not to open up. The contact called a local dealer about the failure and inform the contact they are aware of the failure and recommended that they shave down the frame of the RV to fix the failure but the contact was concerned that will not fix the failure. The contact has attempted to replace the lock and linkage on the vehicle and handle but that did not repair the issue. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was unknown.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331962,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS JUST UNDER 19,000 MILES ON IT AND THE FRONT, DRIVER COMPARTMENT SUPPORT STRUCTURE IS FAILING.  THIS IS CAUSING THE WINDSHIELD TO MOVE SEPARATELY FROM THE SUPPORT FRAMING STRUCTURE CAUSING A LOUD SQUEAKING.  THE MOVEMENT HAS ALREADY BROKEN THE WEATHER STRIPPING SURROUNDING THE WINDSHIELD BOTH INSIDE AND OUT.  CONTINUING TO OPERATE THIS VEHICLE UNDER THIS CONDITION WILL EVENTUALLY RESULT IN WINDSHIELD BEING EJECTED FROM THE FRONT OF THE VEHICLE AND THEREFORE REPRESENTS A CLEAR AND PRESENT SAFETY ISSUE.    THIS CONDITION EXISTS UNDER THE MAIN DASHBOARD OF THE VEHICLE AND TRAVERSES UP THE LEFT PILLAR.  THE DIAGNOSIS IS THAT THE STRUCTURAL SUPPORT WELDS ON THE DRIVER SIDE THROUGH THE CENTER OF THE FRONT COMPARTMENT HAVE FAILED.",
        "vin": "1F66F5DY3C0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2016",
        "dateOfIncident": "02/04/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825663,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 FOREST RIVER GEORGETOWN. WHILE ATTEMPTING TO USE THE RETRACTABLE STEPS, THEY WOULD NOT COME OUT OF THE RETRACTED POSITION. THE CONTACT STATED THAT THE STEPS EVENTUALLY CAME OUT INDEPENDENTLY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V798000 (EQUIPMENT); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE RECREATIONAL VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 19,317.   UPDATED 04/13/16*LJ  UPDATED 05/24/18*JB",
        "vin": "1F66F5DY1D0"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/23/2014",
        "dateOfIncident": "10/26/2014",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660327,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 2014, WHILE DRIVING OUR GEORGETOWN CLASS A RV WITH A CAR IN TOW HEADING SOUTH ON I-95 NEAR VERO, FLORIDA, WE CAME UPON TWO VERY LARGE PIECES OF SEMI-TRUCK TIRE TREAD IN THE HIGHWAY AND COULD NOT AVOID HITTING ONE OF THEM.  THE RUBBER IMPACTED THE RV MAIN EXHAUST TAIL PIPE AND DROVE IT UNDER THE LEFT REAR DUAL WHEEL WHICH RESULTED IN THE MUFFLER AND EXHAUST PIPING SYSTEM BEING RIPPED FROM THEIR MOUNTS AND BECOMING WRAPPED AROUND THE REAR DRIVE SHAFT.  THE DRIVE SHAFT WAS BENT BY THE IMPACT FROM THE MUFFLER.  THE EXHAUST PIPE FOR THE AUXILIARY GENERATOR WAS ALSO RIPPED LOOSE.  THE RUBBER PASSED UNDER THE RV REAR WHEEL AND THEN DAMAGED THE SIDE OF THE TOW CAR.  WE HAD TO HAVE A GOOD SAM ROAD SERVICE MECHANIC CUT THE EXHAUST PIPE FROM AROUND THE BENT RV DRIVE SHAFT SO WE COULD LIMP HOME AT 30 MPH FROM VERO TO STUART.  THE COST TO REPAIR THE RV WAS $2,269.  THE FLORIDA HIGHWAY PATROL CAME TO THE SCENE BUT TOLD US THAT THEY HAD NO WAY TO DETERMINE WHAT TRUCK THE RUBBER DEBRIS CAME FROM.  IF A SMALLER VEHICLE HAD STRUCK THIS LARGE PIECE OF RUBBER IT COULD HAVE CAUSED A ROLL-OVER OR OTHER MUCH WORSE ACCIDENT.   *TR",
        "vin": "1F66F5DY5D0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/15/2014",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605447,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MOTORHOME HAS ELECTRIC ENTRANCE STEPS MANUFACTURED BY LIPPERT (LCI). THE MAIN BOLT THAT SECURES THE DRIVE GEAR SHEARED OFF. I HAD ONE FOOT ON THE STEP AND ONE INSIDE THE MOTORHOME WHEN THE BOLT FAILED. THIS IS A KNOWN AND COMMON PROBLEM WITH THESE STEPS. THIS MOTORHOME USES THE 3 STEP MODEL FOR ENTRANCE TO THE UNIT.   *TR",
        "vin": "1F66F5DY6C0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "08/28/2013",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537821,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS ENTERING THE MOTORHOME THE STEPS EXTENDED OUT BUT WHEN I STEPPED ON THE LOWER STEP IT GAVE WAY AND I FELL OFF OF THE LOWER STEP. IF I HAD BEEN EXITING THE MOTORHOME I WOULD HAVE FALLEN DOWN ABOUT 3 FEET ONTO THE GROUND AND I WOULD HAVE SUSTAINED SERIOUS INJURY.  THERE IS NO SAFETY LATCH WHEN THE STEPS ARE EXTENDED.  I HAVE READ OF OTHER PEOPLE HAVING THE SAME ISSUE.  *TT",
        "vin": "1F66F5DY2D0"
    }
]