[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle Shows on the Dash readout that the truck must keep going to clean out exhaust keep Driving, then comes to a Slowdown, and on a slight hill Stops. When you shut it off, and start it up again, it goes about a Mile, states the same thing on the dash panel, then starts to slow down, I was in the Desert of New Mexico, Had left Flagstaff, AZ. an hour before this started happening. I had no Previous warning. Took 6 hours to reach a GMC Service Center. usually takes 2 hours to reach the same town. Cortez, Colorado. They Could NOT Help Me, they had to referred me to a Service Center in town, that Put me on his machine, and Made the Vehicle Heat up, Run HOT, and Exhaust itself for two hours, this got me to my home in Monte Vista, CO. Then No further Problems until about a Month later i started getting the Same Messages, i took it to a Service Center in AR. where he Forced the Vehicle to Get Hot, exhaust itself for four and a half hours, to Clean it out, and Clear my dash Pannel.",
        "vin": "1GT125E87DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457356,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Diesel Fuel Gage is Not reading Properly. On a Full Tank which use to say I have approx., until 468 Miles, until I Have to re-fuel. Now Reads Less then 288 Miles, on a Full tank.  I have reported this Problem to the Town and Country, GMC, Dealer, of Alamosa, CO. when I have taken My Vehicle in for Service on several Occasions, and Nothing has been done about it. and GMC, has still NOT replaced the Recalled Passenger Air Bag. My Wife sits there and Could be Killed Should Her Airbag be deployed.  Thank You [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GT125E87DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11455493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata Recall. The contact owns a 2013 GMC Sierra. The contact received notification of NHTSA Campaign Number: 21V054000 (Air Bags).The contact  stated while driving approximately 30-35 mph,  the drivers seat and both side air bags deployed without warning or impact.  The contact sustained injuries to his face, experienced blurred vision and medical attention was provided. The contact called the local dealer but  vehicle was not diagnosed or repaired. The manufacturer was not contacted. The approximate failure mileage was 115,000.",
        "vin": "1GTR1TEA8DZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "10/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2013 GMC Sierra, purchased new in 2012, has approximately 35,000 miles.  The check engine light came on while driving and suddenly another light came on. Then a third light came on claiming poor engine fluid quality. I immediately stopped at an auto parts store and put DEF fluid in the pickup and continued to drive thinking the lights would go out, but instead a warning was flashing on the dash that says after so many miles the truck will be slowed down.  We started getting nervous because we were driving on the highway and if the truck suddenly slows down whilst driving in highspeed traffic, our slower vehicle would potentially cause a collision and put us and others in harms way. In reading your own safety site, there is a recall on the vehicle regarding faulty airbags, so it could be even worse! In our investigations of our current issue, we have found that there was a lawsuit from 2019 against GM and their faulty fuel system with their trucks. See link here https://www.detroitnews.com/story/business/autos/general-motors/2019/08/07/lawsuit-says-gm-sold-trucks-not-compatible-american-diesel-fuel/1943084001/  many people on many different forums have also complained about this same problem with no fixes, the only suggestions are to remove the emissions parts and refab the motor. GM tells them that they need to only use their specific DEF fluid, which is steering. GM is very well aware of the problems, because they have employees following these forums and commenting on them.(Dieselplace.com) The truck can be made available for you to see/inspect and I refuse to drive the truck until this issue is resolved.",
        "vin": "1gt125e86df"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "DISCOVER A/T3 XLT",
                "productYear": "9999",
                "size": "265/60R20",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2013 GMC SIERRA 2500 equipped with Cooper Tires, Tire Line: Discoverer A/T3 XLT, Tire Size: 265/60/R20, DOT Number: UT6K1MJ. The contact stated that the side walls were dry rotted and were separating. The contact took the tires back to the tire shop where the tires were purchased, and it was confirmed that the tires needed to be replaced. The tires had not been replaced. The manufacturer was made aware of the failure. The approximate failure mileage on the vehicle was 119,192, and the tire failure mileage was 190,000.",
        "vin": "1gt121cg7df"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 GMC SIERRA. CONSUMER WRITES IN REGARDS TO TAKATA AIRBAG SAFETY RECALL.   THE CONSUMER REFERENCED RECALL N212328790.",
        "vin": "3gtp1xe24dg"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425535,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata recall. The contact owns a 2013 GMC Sierra 2500. The contact received notification of NHTSA campaign number: 21V053000 (Air Bags) however, the part to do the recall repair was not yet available. The contact called the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "1GT120CG9DF"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 2500. THE CONTACT STATED WHILE DRIVING 65 MPH, THE VEHICLE STALLED WITH SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED BACK TO THE RESIDENCE. AN INDEPENDENT MECHANIC WENT TO THE CONTACT'S RESIDENCE TO DIAGNOSE THE VEHICLE. THE CONTACT WAS INFORMED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE FUEL PUMP WAS REPLACED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE MANUFACTURER AGREED TO PAY 20% OF THE REPAIR COST. THE FAILURE MILEAGE WAS APPROXIMATELY 106,000.",
        "vin": "1GT125E89DF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 GMC SIERRA 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V054000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE LOCAL DEALER DON MOORE CHEVROLET LOCATED AT 3232 VILLA POINT, OWENSBORO, KY 42303 WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GT12ZEG2DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A VEHICLE THAT WAS ADVERTISED AS HAVING 52000 MILES ON THE ODOMETER. I LOOKED AT THE VEHICLE AND ENDED UP PURCHASING THE VEHICLE FOR 24,500. THE VEHICLE WAS AS IT APPEARED AS ADVERTISED. THE SELLER PROVIDED A COPY OF A CARFAX REPORT WHICH SHOWED THE VEHICLE HAD 52000 MILES ON IT WITH NO DAMAGE REPORTED, HOWEVER I WAS UNABLE TO RUN MY OWN CARFAX AT THE TIME OF PURCHASE DUE LACK OF INTERNET ACCESS. LATER ON AFTER THE PURCHASE I WAS ABLE TO LOOK UP MY OWN CARFAX AND IT SHOWED THAT THE VEHICLE HAD 314,635 MILES AS THE LAST ODOMETER READING AS WELL AS MODERATE DAMAGE REPORTED. I CHECKED ON AUTOCHECK AS WELL AND THE SAME MILES APPEARED BUT DAMAGE WAS NOT REPORTED IN THIS INSTANCE. I VIEWED THE PINK SLIP AT THE TIME AS WELL AND IT APPEARED TO BE LEGITIMATE BUT AFTER CLOSER VIEWING WHERE THE LAST ODOMETER READING WAS WRITTEN IT LOOKED AS IF HE HAD FORGED THE NUMBERS AND CHANGED THEM. I AM UNSURE AS TO WHAT TO DO AT THIS POINT. I DO NOT KNOW HOW MILES ARE ON THE VEHICLE AND I DON'T KNOW IF THERE'S ANYTHING ELSE WRONG OR FRAUDULENT REGARDING THIS. IT WOULD BE GREATLY APPRECIATED IF I HAD SOMEONE HELP ME OUT. THANK YOU.",
        "vin": "1GT120C83DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 28,000 MILES ON IT AND MY DASH IS CRACKING. IT STARTED CRACKING WHILE ON A CROSS COUNTRY TRIP FROM CALIFORNIA TO GEORGIA. IT IS CRACKING IN SEVERAL PLACES AND I AM AFRAID THE PLASTIC LIKE SHARDS COULD BECOME PROJECTILES IF INVOLVED IN A COLLICION.",
        "vin": "1GT125E88DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LOSES POWER STEERING AT SPEEDS UNDER 25 MPH. I NOTICED A RECALL BY GMC FOR THIS BUT THE DEALERSHIP SAID IT DOESN'T COVER MY TRUCK.  IT ONLY HAPPENS WHEN I AM IN A SLOW TURN LIKE A TRAFFIC CIRCLE OR TURNING ONTO A STREET AFTER BEING STOPPED. THE VEHICLE HAS 201,000 MILES. ARE RECALLS LIMITED BY MILEAGE?  *TR",
        "vin": "1GT120E86DF"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2020",
        "dateOfIncident": "05/16/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKS AROUND AIR BAG ALWAYS BEEN GARAGED. *TR",
        "vin": "1GT121EG1DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH IS CRACKED AROUND MY PASSENGER SIDE AIR BAG A AND DROPPED DOWN A LITTLE BIT MY CONCERN IF THAT AIR BAG WOULD OPEN IT COULD BE A DANGER TO ME AND WHO EVER WOULD BE RIDDING WITH ME. AND ON TOP OF THAT IT NOW RATTLES WHILE DRIVING WHICH IS A DISTRACTION,THIS STARTED ABOUT 2 YEARS AGO AND IS GETTING WORST.",
        "vin": "1GT125E83DF"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STABILITRAK WARNING LIGHT CAME ON WHILE DRIVING ON HIGHWAY AT 60MPH. TRUCK WENT INTO \"LIMP MODE\" . NO TRANS PRIDAL DISPLAY. TRUCK DRIVEN SLOWLY OFF HIGHWAY. AT THE SERVICE DEALER THEY DETERMINED THAT THE TRANSMISSION CONTROL MODULE FAILED AT 79,530 MILES.  VEHICLE COVERED UNDER THE FEDERAL EMISSIONS WARRANTY 8 YEAR/ 80,000 HOWEVER GM REFUSED TO HONOR.",
        "vin": "1GT121C83DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M GETTING AN INACCURATE FUEL GAUGE READING.",
        "vin": "1GT12ZC84DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "P21DD CODE LOW VOLTAGE. THIS IS SECOND TIME IT HAS BEEN REPLACED. 62145 MILES ON TRUCK..",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP OF DASH BOARD IS CRACKED IN  NUMEROUS PLACES ABOVE THE STEERING WHEEL, CENTER OF DASHBOARD, AND AROUND PASSENGER AIRBAG. WORRIED THAT THIS WOULD BE A SAFETY CONCERN IN THE EVENT OF AN ACCIDENT. THERE WOULD BE SHARP PIECES OF DASH BOARD BEING THROWN AROUND THE CAB AND MIGHT AFFECT DEPLOYMENT OF PASSENGER AIR BAG. I HAVE ADDITIONAL PHOTOS BUT THEY ARE OVER THE 5MB LIMIT",
        "vin": "1GT125E85DF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 1500. THE CONTACT STATED THAT THE DASHBOARD HAD CRACKS ON THE PASSENGER SIDE BY THE AIR BAG UNIT, IN THE CENTER, AND AROUND THE INSTRUMENT CLUSTER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED COVERT CHEVROLET BUICK GMC (11750 RESEARCH BLVD STE D, AUSTIN, TX 78759, (512) 371-6075) AND WAS REFERRED TO THE MANUFACTURER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS  APPROXIMATELY 67,000. *TT  CONSUMER STATED CRACK AROUND THE AIR BAG. UPDATED 12/20/18*JB",
        "vin": "1GT125E87DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2013 SIERRA 2500 HD 4X4 USED WITH ONLY 42000 MILES ON IT. WITHIN 1000 MILES OF THAT PURCHASE, THE POWER STEERING PUMP FAILED AND NEEDED REPLACED. I WAS PULLING INTO THE GAS STATION AND ALMOST TOOK OUT A FUELING TOWER. POWER STEERING PUMPS DO NOT FAIL -- THEY ARE MANUFACTURING DEFECTS. I HAVE HAD VEHICLES FOR 30 YEARS AND NEVER HAD A PS PUMP FAILURE. MOST PEOPLE NEVER EXPERIENCE THIS. I HAD TO FORK OUT $500 FOR THE REPAIR -- GMC SHOULD REIMBURSE ME FOR THIS ; THEY ARE LUCKY THIS DID'T TURN OUT TO BE A CATASTROPHE. I WAS LUCKY TO HAVE BEEN MOVING VERY SLOWLY DUE TO THE CONGESTION AT THE STATION.",
        "vin": "1GT220CG8DZ"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASH GOING FROM THE PASSENGER SIDE AIRBAG COVER TO THE DASH VENT. ALSO, THE MOUNTING BRACKET FOR THE SAMES VENT CLIP IS BROKEN CAUSING THE DASH COVER TO BOUNCE AROUND.",
        "vin": "1GT125E85DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LOSES POWER STEERING IN SLOW CONDITIONS, NORMALLY WHILE IN PARKING LOTS OR MAKING A TURN.  THIS NORMALLY ONLY HAPPENS WHEN MAKING A RIGHT HAND TURN.  WHEN THIS OCCURS, IT IS NEARLY IMPOSSIBLE TO CONTINUE THE TURN OF THE WHEEL TO COMPLETE YOUR TURN.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER NUMEROUS TIMES SINCE NEW TO RECENT AND WE ARE ALWAYS TOLD THAT THEY CANNOT RE-CREATE THE ISSUE, SO THERE IS NOTHING TO FIX.  THE PROBLEM WILL LIKELY RESULT IN A CRASH AT SOME POINT IF IT IS NOT ADDRESSED, AS IT CREATES A VERY UNSAFE CONDITION AND INABILITY TO CONTROL THE TURN OF THE VEHICLE. THIS PROBLEM HAS HAPPENED SINCE THE TRUCK WAS NEW UP UNTIL MOST RECENTLY TODAY, JULY 30, 2018.",
        "vin": "1GT120C85DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKED NEAR THE AIRBAG",
        "vin": "1GT125E87DF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032958,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 2500. THE CONTACT STATED THAT THE DASHBOARD BEGAN TO CRACK SEVERELY. THE LOCAL DEALER (FRANK KENT COUNTRY, 2000 E. STATE HWY 31, CORSICANA, TX 75110) WAS CONTACTED AND STATED THAT THERE WAS NO RECALL ON THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 58,000.",
        "vin": "1GT125E83DF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GOES IN AND OUT WHEN MAKING TURNS AT LOW ENGINE RPM.  HAPPENS REGULARLY WHEN TURNING INTO A PARKING SPOT IN A PARKING LOT.  SOMETIMES, THE POWER STEERING COMPLETELY GOES OUT DURING THE TURN THAT YOU MUST COME TO A COMPLETE STOP BEFORE STRIKING ANOTHER VEHICLE.",
        "vin": "1GT120C86DF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DIC DISPLAYS, \"SERVICE TRAILER BRAKE SYSTEM\"  TRAILER NOT CONNECTED AT THE TIME OF MESSAGE.  NO FRAYED, LOOSE,  OR CORRODED WIRES FOUND AND FUSES LOOK GOOD.  CONNECTIONS DISCONNECTED, BLOWN OUT, AND RECONNECTED.  MESSAGE STILL READS EVERY DAY OF DRIVING.  SEEMED TO START AFTER DRIVING IN RAIN.  MAYBE JUST A COINCIDENCE.",
        "vin": "1GT120C86DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH HAS CRACKED AROUND THE PASSENGER SIDE AIR BAG.  IF AIR BAG DEPLOYS, IT COULD SEND SHRAPNEL TOWARDS THE PASSENGER.  GM IS AWARE OF THIS PROBLEM BUT REFUSES TO ACKNOWLEDGE OR REPAIR.  EVERETT GMC TOLD ME THEY USE TO REPAIR FOR $100.00. NOW THEY WANT $1,600.00 AND STATED IT WOULD PROBABLY OCCUR AGAIN DUE TO CHEAP PLASTIC PARTS INSTALLED BY GM.  MY VEHICLE IS GARAGE KEPT.",
        "vin": "1GT125EG3DF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983732,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 2500. WHILE THE BRAKES WERE BEING SERVICED THE TECHNICIAN DISCOVERED SEVERE RUST UNDERNEATH THE VEHICLE, INCLUDING THE FRAME. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE SEVERE RUST WAS DUE TO THE ROAD CONDITIONS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND ADVISED THE CONTACT TO CALL NHTSA. THE FAILURE MILEAGE WAS 70,000.  UPDATED 06/29/17*LJ UPDATED 10/13/2017*JS",
        "vin": "1GT125E86DF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "04/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DURAVIS M773 II",
                "productYear": "9999",
                "size": "LT245/75R16",
                "type": "Tire"
            }
        ],
        "summary": "RUNNING ERRANDS WITHOUT PULLING A LOAD AND EMPTY BED OF TRUCK. AT A STOP AND WHEN GREEN BEGAN TO ACCELERATE, RIGHT BACK TIRE BLOW OUT, NO INJURIES PULLED OVER TO A SAFE SPOT TO CHANGE TIRE. NO DISCERNIBLE DEFECTS BEFORE USING TRUCK THIS DAY. ORIGINAL TIRES TO TRUCK, APPROXIMATELY 50,000 K MILES, VERY LITTLE HEAVY USE FOR THIS TRUCK.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES NEED TO REPLACED BECAUSE THEY ARE RUSTED OUT. LOW MILES ON THIS TRUCK. DISCOVERED PROBLEM WHEN BRAKING GOING DOWN HILL, THE TRUCK SHOOK. THE FRONT END VIBRATED. TOOK IT IN AND THEY SAID THE BRAKES ARE RUSTED. WE GOT THE TRUCK IN EARLY 2014.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943828,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOSCH CP4 FUEL PUMP FAILURE.     PLEASE REFERENCE EA11-003 AND FIND THE SAME FUEL PUMPS THAT WERE FOUND TO FAIL ON AUDI/VW VEHICLES ARE ALSO USED ON GM, FORD, AND DODGE VEHICLES.     SAID PUMP FAILED DURING DRIVING WITHOUT WARNING CAUSING COMPLETE ENGINE SHUTDOWN AND LOSS OF POWER. CERAMIC AND METAL INTERNALS OF THE PUMP DISINTEGRATED AND TRAVELED THROUGH THE FUEL SYSTEM, SUBSEQUENTLY CAUSING THE INJECTORS TO FAIL. SIMILAR TO THE FINDINGS IN EA11-003, PAGE 16 PARAGRAPH 2, THE REPAIR IS TO COST APPROXIMATELY $10,000 TO FIX THE ENTIRE FUEL SYSTEM.  *TR",
        "vin": "1GT121C85DF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKED NEXT TO PASSENGER AIRBAG COVER. VEHICLE WAS STATIONARY WHEN THIS OCCURRED.",
        "vin": "1GT125E86DF"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898579,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IN MY 2013 GMC SIERRA 2500HD HAS A CRACK THAT RUNS FROM THE RADIUS OF THE UPPER LEFT HAND CORNER OF THE PASSENGER SIDE AIRBAG TO THE FWD EDGE OF THE DASHBOARD THAT RUNS PARALLEL TO THE WINDSHIELD.  THE CRACK PENETRATES THROUGH THE DASHBOARD COMPLETELY CREATING TWO SEPARATE SECTIONS WITH ALMOST COMPLETE FREEDOM OF MOVEMENT.  ACTIVATION BY THE AIRBAG WILL CAUSE INTERFERENCE/CONTACT BETWEEN THE DEVICE, AND/OR ITS COMPONENTS, AND WITH THE NON-SECURED SECTIONS OF THE DASHBOARD AND MOST LIKELY RESULT IN THEM BEING SEPARATED/DISLODGED AND POTENTIALLY LAUNCHED IN THE CABIN RESULTING IN POSSIBLE STRIKES TO OCCUPANTS.  THE VEHICLE WAS PARKED IN MY DRIVEWAY WITH NO CRACK AND WHEN I EMERGED THE NEXT MORNING AND ENTERED THE VEHICLE, STARTED THE ENGINE, THE CRACK OCCURRED.    THE MERE POTENTIAL FOR INTERFERENCE BETWEEN THE AIR BAG ACTIVATION AND BROKEN DASHBOARD SECTIONS, OBVIOUSLY DUE TO A POOR, INSUFFICIENTLY TESTED DESIGN, (RELIABILITY TESTING?) SHOULD DRIVE THE ENGINEERS TO REVISIT CURRENT RISK ANALYSIS TOOLS.  IT'S CLEAR THE RPN FOR THIS TYPE OF FAILURE MODE IN AN FMEA WOULD NOT QUALIFY UNDER CURRENT INDUSTRY STANDARDS.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "09/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852250,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT THE STEERING WHEEL WAS EXTREMELY LOOSE. WHEN DRIVING OVER BUMPS IN THE ROAD, THERE WAS AN ABNORMAL NOISE HEARD FROM THE STEERING COLUMN TO THE STEERING WHEEL. THE CONTACT WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V339000 (STEERING). THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.   UPDATED 05/03/16*LJ  THE LOCAL REPAIR SHOP, FOUND TWO SPLINE SHAFTS IN THE STEERING COLUMN WORN. THE REPAIRS WERE DONE AT NO CHARGE. UPDATED 05/05/16.*JB",
        "vin": "1GT120CG1DF"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 SIERRA DENALI HD. I AM VERY OCD WITH THIS VEHICLE AS TO I ONLY DRIVE IT ON WEEK-ENDS, ETC. TRUCK IS STORED IN CLIMATE CONTROLLED GARAGE. JUST TURNED OVER 42K MILES. I HAVE A PROFESSIONAL DETAILING SERVICE DETAIL THIS TRUCK. I PICKED UP MY TRUCK TODAY AND WAS TOLD THAT THEY FOUND A CRACK IN THE DASH LOCATED BEHIND THE INSTRUMENT CLUSTER. ONLY 6K MILES OUT OF WARRANTY. HOW CONVENIENT FOR GM. I PLAN ON TALKING TO DEALER THAT SERVICES MY TRUCK TOMORROW AND GET THEIR INPUT.",
        "vin": "1GT125E8XDF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2016",
        "dateOfIncident": "12/22/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\". CRACKED DASH STATIONARY",
        "vin": "1GT125E84DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "12/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO BOTH AN INDEPENDENT MECHANIC AND THE DEALER TO BE DIAGNOSED. THE TECHNICIANS INFORMED THE CONTACT THAT THE DIESEL RELUCTANT TANK  ASSEMBLY WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 111,000.",
        "vin": "1GT020C8XDF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818125,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD",
        "vin": "3GTP2XE26DG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING ON THE PICKUP TRUCK STICKS, LOCKS UP FOR A MOMENT THEN FREES ITSELF.  I HAVE BEEN HAVING ON AND OFF ISSUES SINCE BUT THE DEALERSHIP IS ALREADY TRYING TO GET OUT OF ANY RESPONSIBILITY ALREADY STATING THIS IS OUT OF WARRANTY AT THIS DATE.  SALT LAKE VALLEY GMC HAS BEEN AWARE OF THE ISSUE SINCE DAY ONE.  THIS HAS BECOME A SAFTEY ISSUE, THE VEHICLE IN QUESTION IS NOT SAFE TO DRIVE AT THIS TIME AND I AM LEFT HOLDING THE BAG FOR A MYSTERY THEY CANNOT SOLVE (OR GM IS COVERING UP YET ANOTHER PROBLEM)  NOTE THIS TRUCK IS THE DURAMAX 2500.",
        "vin": "1GT125E84DF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "12/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "32X11.50R15LT 113Q TL MUD TERRAIN T/A KM2 LRC RWL GO",
                "productYear": "9999",
                "size": "32X11.5/70R15",
                "type": "Tire"
            }
        ],
        "summary": "FIRST INCIDENT -BFGOODRICH MUD TERRAIN KM2 TIRE TREAD SEPARATED FROM TIRE CAUSING DAMAGE TO RUNNING BOARD ON RIGHT FRONT. WAS ON INTERSTATE GOING ABOUT 55 MPH. SECOND INCIDENT- 1 OF ORIGINAL SET OF 4 IS NOW ON BACK AGAIN ON INTERSTATE GOING APPROXIMATELY 65 MPH TIRE SEPARATED AND CAUSED DAMAGE TO  RIGHT FENDER.  *TR",
        "vin": "1GT125E80DF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S  VOLT GAUGE READ'S BETWEEN 16 AND 17 VOLT'S. CONSTANTLY. TAKEN TO DEALER AND WAS TOLD AFTER THERE TESTING OF THE SYSTEM ALL READING WERE AT 14.4 TO 14.7 VOLTS. THEY COULD NOT DUPLICATE PROBLEM. WHEN LEAVING DEALERSHIP WAITED AFTER STARTING TO WATCH GAUGE AS DRIVING DOWN THE HIGHWAY. GAUGE STILL READING BETWEEN 16 AND 17 VOLTS. HAVE NOW CONTACTED GMC CUSTOMER SERVICE FOR FURTHER HELP.  *TR",
        "vin": "1GTR2WE70DZ"
    },
    {
        "components": "EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT WHILE DRIVING AT NIGHT, THE HEADLIGHTS SEIZED AND THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 4,000.",
        "vin": "1GTR1UEH3EZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 GMC SIERRA 4WD CREW CAB THAT IS HAVING BRAKING PROBLEMS.  I PURCHASED THE VEHICLE ON 05/29/2013 NEW FROM BILL SMITH BUICK-GMC INC. LOCATED IN CULLMAN, AL AS A NEW VEHICLE AND AT THE TIME OF PURCHASE IT HAD 7173 MILES ON IT AS STATED ON THE ODOMETER DISCLOSURE STATEMENT. THE VEHICLE CURRENTLY HAS 41585 MILES ON IT THAT INDICATED I HAVE DRIVEN THE VEHICLE 36412 MILES.  I HAVE HAD TWO INCIDENTS WITH THE BRAKES WHERE THE VEHICLE FAILED TO STOP WITH THE BRAKES FULLY APPLIED. THE FIRST TIME WAS WHEN THE VEHICLE HAD APPROXIMATELY 15000 MILES ON IT.  THE SECOND TIME OCCURRED THIS PAST THURSDAY, DECEMBER 18, 2014 WHEN I APPLIED THE BRAKES AT 25 MPH AND THE CAR JUST CONTINUED TO ROLL UP HILL UNTIL I HIT A CAR IN FRONT OF ME. THERE WAS NO DAMAGE TO THE OLDER BUICK LASABER REAR END OR BUMPER BUT MY FRONT BUMPER WAS PUSHED IN ABOUT 2 INCHES.  IF I HAD BEEN ON THE LEVEL OR WAS GOING ABOVE 25 MPH I SUSPECT THERE WOULD HAVE BEEN SUBSTANTIAL DAMAGE TO BOTH VEHICLES.     WHAT?S HAPPENING IS WHEN THE BRAKE IS APPLIED THE CAR STARTS TO SHUDDER AND SOUNDS LIKE YOUR BANGING ON A TIN CAN.  WHEN THAT HAPPENS THE TRUCK IS NOT STOPPING OR SLOWING AT ALL AND THE BRAKE PEDAL IS AS FAR DOWN AS IT CAN GO.  PUMPING THE BRAKE WILL CAUSE THE BRAKES TO RECOVER AND THE VEHICLE WILL STOP.  THIS PROBLEM HAS NOT BEEN A CONSISTENT ISSUE. THIS LAST THURSDAY IS THE FIRST TIME I COULDN?T STOP IN 26000 MILES.  BACK WHEN THE VEHICLE HAD 15000 MILES ON IT THE SAME THING OCCURRED.  WHILE DRIVING THE VEHICLE TO WORK THIS MORNING AFTER PICKING IT UP FROM THE GMC DEALERSHIP THAT SAID THERE WAS NOTHING WRONG IT HAPPENED AGAIN. THIS WAS AFTER MAKING SEVERAL STOPS ON HWY 280 IN BIRMINGHAM, AL.  THIS TIME I RAN THE RED LIGHT WITH NO CONSEQUENCES BUT MY LUCK WILL NOT CONTINUE.  *TR",
        "vin": "3GTP2WE77DG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "09/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, AN ABNORMAL NOISE OF SIMULATING AIR ENTERED THE VEHICLE FROM THE DRIVER SIDE. THE VEHICLE WAS TAKEN TO THREE DIFFERENT DEALERS WHERE IT WAS DIAGNOSED THAT THE REAR AND FRONT DRIVER SIDE FOAM SEALS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 5,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 GMC SIERRAHD 2500 AND I AM EXPERIENCING POWER STEERING FAILURES. GMC IS REFUSING TO FIX THE PROBLEM BECAUSE THEY CANT FIND IT. GMC ALSO HAS NO PROBLEM PUTTING ME BACK ON THE ROAD IN A DANGEROUS UNSAFE VEHICLE THAT IS STILL UNDER BUMPER TO BUMPER WARRANTY. . THE FIRST EXPERIENCE WAS JUST PULLING INTO A PARKING SPOT. AS I WAS TURNING, ALWAYS TO THE LEFT, INTO THE SPOT THE POWER STEERING FAILED. ALWAYS AFTER A LONG DRIVE THIS OCCURS, TO THE TUNE OF 5 PLUS HOURS. THE POWER LOSS REPEATED ITSELF TWO MORE TIMES THAT FIRST DAY. OCCURRING WHEN I WAS COMING TO A SLOW LEFT TURN UNDER 10 MPH. I TOOK IT TO THE DEALER A COUPLE DAYS LATER AND THEY COULDN'T REPEAT THE PROBLEM SO THEY REFUSED REPAIRS.    THE NEXT TIME IT HAPPENED WAS A COUPLE DAYS AGO. THIS TIME IT BEGAN WITH SLOW LEFT TURNS IN A PARKING LOT OR ON DOWNRAMPS FROM HIGHWAYS.  HOWEVER THE PROBLEM GAINED INTENSITY AS I THOUGHT I COULD FEEL IT WHILE DRIVING AT HIGH SPEEDS, ALTHOUGH I DIREGUARDED THAT SINCE IT IS HARD TO TELL WHILE DRIVING 65 ON THE HIGHWAY. ONCE I REACHED MY LOCAL BACK, CURVY, MOUNTAIN ROADS, IT FAILED REPEATEDLY. ONE INSTANCE CAUSING ME TO VEER TO THE EDGE OF A SEVERE DROP OFF AND MY TIRES RUNNING OFF THE ROAD. THIS EASILY COULD HAVE BEEN A FATAL MOMENT.    AGAIN AFTER A LONG DRIVE, THEY WERE UNABLE TO RECREATE THE PROBLEM. THEY INSPECTED EVERYTHING AND RESEARCHED THE ISSUE. GMC SAID THAT WILL HAPPEN WHEN HITTING THE BRAKES AT A SLOW SPEED. HOWEVER, THE FAILURE HAS NOW OCCURRED WITHOUT BRAKING AND AT A NORMAL SPEED OF ABOUT 30 MPH. GMC REFUSED TO REPLACE ANYTHING AND WOULD NOT COMPENSATE THE DEALER IF THEY DID. THUS GMC PUT ME BACK ON THE ROAD IN A DANGEROUS VEHICLE. THEY SAID THIS WAS NORMAL AND WOULD HAPPEN FROM TIME TO TIME. DESPITE ALL THEIR EXCUSES, I HAD A CONTRADICTION FOR.I DON'T UNDERSTAND WHY IT DIDN'T START TILL NOW AND WHY AM I THE ONLY ONE HAVING THE PROBLEM.  *TR",
        "vin": "1GT120C86DF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY I FELT THE PROBLEM AS A SLIGHT \"MISSING\" IN THE ENGINE UNDER VERY LIGHT ACCELERATION BETWEEN 40 MPH AND 55MPH AND MORE PRONOUNCED UNDER CONSTANT THROTTLE GOING UP GRADES ON THE HIGHWAY AT A SPEED OF ~55 MPH (1400-1500 RPM). THE VEHICLE SEEMED TO BE \"LUGGING\", AND THEN THE RPM WOULD INCREASE BY ~20% IMMEDIATELY FOR A SHORT DISTANCE AND THEN DROP BACK (ALL AT CONSTANT THROTTLE) TO 1400-1500 RPM. WHEN DRIVING ON THE HIGHWAY IN CRUISE CONTROL AT 60 MPH AND  GOING UP A GRADE, THE VEHICLE WOULD SHOW SIGNS OF \"STRAINING\" AND IMMEDIATELY INCREASE IN THE RPM BY ABOUT 20% WITH  AN ATTENDANT ACCELERATION. THEN THE RPM WOULD INCREASE INSTANTLY BY ABOUT 1000 RPM AND THE VEHICLE ACCELERATES RAPIDLY UNTIL I ENGAGE THE BRAKES. MY DEALER OBSERVED THE SAME CHARACTERISTICS AND DETERMINED THAT IT WAS A TORQUE CONVERTER PROBLEM AND ON 07/25/2014 THEY INSTALLED A NEW TORQUE CONVERTER, WHICH PROVED TO HAVE NO EFFECT ON THE PROBLEM. I WAS INFORMED BY THE SERVICE MANAGER THAT GMC TECHNICAL SERVICES INFORMED HIM OF A SERVICE BULLETIN (#PIP4681D: RANDOM BUMP CHUGGLE OR FISHBITE SENSATION WHILE CRUISING AT APPROXIMATELY 1,300 RPM- OCTOBER 31, 2013) THAT ADDRESSED THE PROBLEM, AND FURTHERMORE NO FURTHER CORRECTIVE ACTION COULD BE TAKEN. ON AUGUST 6,,2014 I WAS DRIVING AT CONSTANT SPEED OF 60 MPH ON A MAJOR HIGHWAY IN \"CRUISE CONTROL\" AND MODERATE TRAFFIC. WHILE GOING UP A LONG GRADE FOLLOWING ANOTHER VEHICLE AT A SAFE SPEED, MY VEHICLE IMMEDIATELY JUMPED ~400 RPM AND THEN ABRUPTLY CHANGED TO A LOWER GEAR AND ACCELERATED SUDDENLY PUTTING ME AT RISK OF COLLIDING WITH THE VEHICLE AHEAD OF ME. I QUICKLY APPLIED BRAKES AND WAS ABLE TO AVOID AN ACCIDENT.  I IMMEDIATELY CONTACTED GMC CUSTOMER SERVICES WHO OPENED A CASE NUMBER ([XXX])  AND ASSIGNED A REP. TO MY CASE. I HAVE SUBSEQUENTLY BEEN INFORMED OF THE GMC COMPANY LINE--\"THE VEHICLE IS OPERATING AS DESIGNED\", \"LIVE WITH IT\"!!!        INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3GTP2XE28DG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2014",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED BACK DOOR OPEN INDICATED ON PANEL, STEPPED OUT WITH VEHICLE IN DRIVE AT A STOP, THEN ONCE OUTSIDE SLIPPED AND VEHICLE KEPT MOVING, HAD TO JUMP BACK INTO VEHICLE AND APPLY BRAKE TO PUT IT INTO PARK, WHY DOESN'T VEHICLE SHUT DOWN ONCE OFF THE SEAT? RIDING LAWN MOWERS DO!   *JS",
        "vin": "3GTP1WE00DG"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "04/29/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10588319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING HOME IN TRAFFIC WHEN A WOMAN DRIVING THE OPPOSITE DIRECTION DECIDED TO PASS A VEHICLE. HE SWERVED TO AVOID A HEAD ON COLLISION WHICH MEANT HE HAD TO GO OFF OF THE ROAD. WHEN HE ATTEMPTED TO GET BACK ON THE ROAD THE TRUCK SHOT ACROSS TO THE OTHER SIDE OF THE ROAD. THE DPS OFFICER TOLD MY HUSBAND HE HIT A CULVERT AND FLIPPED 5- 6 TIMES. WITNESSES HAD TO PULL HIM OUT OF THE TRUCK AND HAD MENTIONED THERE WAS A SLIGHT FIRE THAT THEY PUT OUT. DURING ALL OF THIS NONE OF THE AIRBAGS DEPLOYED. HE WENT TO THE DOCTOR THE FOLLOWING DAY TO GET CHECKED OUT.  *TR",
        "vin": "3GTP1VE05DG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "02/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 58 MPH, THE ENGINE STALLED WITHOUT WARNING. THE CONTACT WAITED FIVE MINUTES BEFORE RESTARTING THE VEHICLE AND RESUMED NORMALLY. THE FAILURE RECURRED FOUR TIMES. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE A DIAGNOSTIC TESTING WAS PERFORMED. THE DEALER WAS UNABLE TO LOCATE A PROBLEM. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 11,000.",
        "vin": "3GTP2WE72DG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "09/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584178,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GEAR BOX LEAKS OIL OUT OF FRONT ADJUSTMENT NUT SEAL.  AFTER THREE REPLACEMENT GEAR BOXES IT STILL CONTINUALLY LEAKS.  THE LAST ATTEMPTED FIX BY A GMC DEALER ENDED WITH POWER STEERING SPRAYING ALL OVER EVERYTHING UNDER HOOD INCLUDING EXHAUST WHICH IS A SIGNIFICANT FIRE HAZARD.  ALSO, WHEN FLUID LEVEL GETS LOW STEERING IS SIGNIFICANTLY HINDERED.  *TR",
        "vin": "1GTR2VE73DZ"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "04/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10578193,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 7, 2014, I WAS INVOLVED IN CAR ACCIDENT. MY VEHICLE WAS TRAVELING ON THE HIGHWAY THROUGH A SOLID GREEN LIGHT WHEN THE OTHER THE VEHICLE MAKING A  LEFT TURN TRIED TO SPEED UP TO GET PASS. I SAW THE OTHER THE VEHICLE AND PRESS THE BRAKES HARD BUT THE TRUCK SLID AND HIT THE OTHER VEHICLE. I WAS GREAT IMPACT AND I WAS SHOCKED THAT OUR AIR BAGS DIDN'T DEPLOY. I'M VERY CONCERN THAT MY EQUIPMENT ARE NOT WORKING PROPERLY....PLEASE ASSIST ME IN MATTER.    *TR",
        "vin": "1GTR1VE02DZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/05/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY TRUCK IN FOR A  GRINDING NOISE THE STEERING RACK WAS MAKING WHEN TURNING AT LOW SPEEDS, THE DEALERSHIP SAID IT WAS A POWER STEERING GEAR, COMMON PROBLEM AND THEY WOULD FIX IT BECAUSE IT WAS UNDER WARRANTY, THEY SOLVED THE PROBLEM. THE ISSUE IS THAT THE RE-MANUFACTURED PART THEY USED LEAKS, TOOK IT BACK A SECOND TIME, THEY SAID IT WAS A BAD SEAL AND THEY WOULD REPLACE THE SEAL. HAD TO TAKE IT IN A THIRD TIME BECAUSE IT LEAKED AGAIN, SO THEY SAID THEY WOULD REPLACE THE RACK AGAIN, COME TO FIND OUT, THE LAST TIME THEY HAD IT THEY REPLACED THE STEERING RACK AGAIN, SO THIS IS THE THIRD STEERING RACK THEY HAVE PUT ON A 2013 TRUCK, AND IT STILL LEAKS, THEY GAME ME A SERVICE BULLETIN THAT SAYS IT IS NORMAL FOR IT TO LEAK FROM THAT AREA AND IT GOES AWAY IN A FEW MONTHS, ALSO THE SERVICE BULLETIN SAYS A DRIP FROM THERE DOES NOT WARRANT A ACTIVE LEAK, I SAY A DRIP ON THE GROUND IS A ACTIVE LEAK. I LIVE IN TEXAS AND BY STATE LAW A VEHICLE CANNOT PASS STATE SAFETY INSPECTION WITH ANY LEAKS ON THE POWER STEERING SYSTEM. HOW DO I KNOW THAT THIS LEAK WILL EVEN GO AWAY? MY TRUCK WON'T EVEN PASS INSPECTION LATER THIS YEAR WHEN I HAVE TO GO BECAUSE OF THIS LEAK. I BELIEVE THIS IS A SAFETY CONCERN, THEY SHOULD NOT BE RE ISSUING SUCH A IMPORTANT PART TO THE STEERING SYSTEM AND IT LEAK, I HAVE FOLLOWED UP WITH GM AND SAID I WANT A BRAND NEW ON PUT ON AND NO LEAKS, IT DIDN'T LEAK WHEN I BOUGHT IT, IT SHOULDN'T LEAK NOW. I HAVE LOST FAITH IN THE RELIABILITY OF THE VEHICLE BECAUSE THEY HAVE REPLACE THE SAME PART THREE TIMES( A KEY PART TO THE STEERING SYSTEM), IT LEAKS, AND ALL THREE TIMES THE PART WAS RE-MANUFACTURED( USED), I HAVE NO IDEA HOW MANY MILES ARE ON THAT PART, THEY SHOULD BE USING BRAND NEW ONES AND NO LEAKS.  *TR",
        "vin": "3GTP1VE00DG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/23/2014",
        "dateOfIncident": "11/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10574287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE MOUNTAINS, I SWERVED TO MISS AN ANIMAL, TOOK THE DITCH, HIT TWO TREES, SOME BOULDERS AND THE AIRBAGS DID NOT DEPLOY. I WAS TRAVELING AT ABOUT 47 MPH. THE ACCIDENT REPORT SHOWED DAMAGES TO EVERY PART OF THE TRUCK EXCEPT THE ROOF AND TAILGATE. WE HAD A GRILL GUARD INSTALLED AT A GMC DEALERSHIP UPON PURCHASE, AND HAD IT NOT BEEN FOR THAT GUARD, THE ENGINE WOULD HAVE BEEN IN OUR LAPS. THE TRUCK SUSTAINED 20,000 DOLLARS IN DAMAGES, YET ALL GM HAD TO SAY WAS THAT THE AIRBAGS OPERATED AS DESIGNED. I SAY THAT THE DESIGN IS FATALLY FLAWED IF A CRASH OF THIS MAGNITUDE DOES NOT CAUSE THIS VERY IMPORTANT SAFETY FEATURE TO OPERATE. THE FOLKS WHO TOWED THE VEHICLE HAD SOME VERY STRONG OPINIONS ABOUT THIS FAILURE, AND SAID THAT THE GRILL GUARD WAS THE ONLY THING WHICH SAVED US, AND THAT HAVING IT INSTALLED SHOULD NOT HAVE HAD ANY EFFECT ON THE FUNCTION OF THE AIRBAGS.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2014",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573132,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, THE DATE AND MILEAGE ABOVE IS NOT ACTUAL DATE OF FIRST INCIDENT, BUT IS THE FIRST TIME I TOOK IT IN FOR THE FIRST OIL CHANGE AND VEHICLE INSPECTION WHICH ALSO WAS THE FIRST TIME I COMPLAINED TO THE DEALERSHIP ABOUT THE ISSUE. MY TRANSMISSION SLIPS BETWEEN 2ND AND 3RD GEAR AT LEAST 4 TIMES A MONTH. THE DEALER TOLD ME THAT IF I CANT PROVE IT OR IF IT DOESN'T DO IT WHEN THEY DRIVE IT THEN THEY CANT PERFORM A DIAGNOSTIC TEST TO FIX THE PROBLEM. THE SELLER WHO SOLD ME THE VEHICLE CALLED ME TWICE TO SEE HOW IM ENJOYING MY TRUCK AND I COMPLAINED TO HIM BOTH TIMES ABOUT THE ISSUE AND HE TOLD ME THE SAME THING ABOUT MY ISSUE. I EVEN LEFT VOICEMAILS TO HIM ABOUT IT AND HE NEVER RETURNED MY CALLS UNTIL I MADE A YEAR (3/16/14) OWNING MY TRUCK AND CLAIMS HE DON'T REMEMBER ME TELLING HIM THIS THE FIRST TIME. IM A STRONG GM FAN BUT I FEEL IM NOT BEING HELPED WITH MY ISSUE AND ITS ANNOYING THAT I HAVE TO DRIVE MY TRUCK CAUTIOUS GUESSING WILL IT SLIP THIS TIME OR WILL IT SLIP NEXT TIME? IF ITS PROFESSIONAL GRADE THEN WHY AM I HAVING THIS PROBLEM? I USE MY TRUCK FOR FAMILY VACATIONS AND I KNOW ANYONE WITH THE SAME PROBLEM WOULD NOT DRIVE THIS TRUCK FAR AWAY FROM HOME WITH THIS ISSUE. IT DOES IT WHEN IT WANTS TO BUT ITS JUST FUNNY HOW IM TRYING TO FIGURE OUT WHEN IT WILL DO IT AGAIN. I GET ALL THESE EMAILS ASKING ME TO RATE THE DEALERSHIP 5 STARS AND TO RATE THE TRUCK BUT I CANT EVEN GET MY TRUCK CHECKED OUT. THEN THEY TELL ME THEY WONT GIVE ME A RENTAL WHICH I WOULD NEED ANOTHER TRUCK AS A RENTAL. THIS IS SAD I SPEND 30 GRAND ON A TRUCK I CANT GET WORKED ON UNLESS I HAVE PROOF.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/15/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572546,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE STEERING WHEEL VIBRATION WHEN BRAKING AT 40 PLUS MPH.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568200,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MICE, RABBITS ETC. CHEWED THROUGH WIRES BECAUSE GMC PUTS PEANUT OIL ON THEIR WIRES. GMC DEALER SAID THEY WOULD FIX WIRES BUT THE PROBLEM WILL PERSIST BECAUSE PEANUT OIL IS BAIT FOR THESE ANIMALS. THIS IS A PROBLEM THAT WAS REPORTED ON A 2012 VEHICLE. THIS COULD CAUSE FIRES ETC  AND NEEDS TO BE FIXED. THE VEHICLE WASN'T RUNNING RIGHT, ENGINE LIGHT WAS ON AND CHEWED WIRES WERE DISCOVERED. WERE TOLD BY GMC DEALER THERE IS NO PERMANENT FIX BECAUSE THEY USE PEANUT OIL BECAUSE ITS CHEAP!  WE'VE ONLY HAD THE VEHICLE SINCE SEPTEMBER 2013. GMC WILL PUT THE WIRES TOGETHER AGAIN BUT NOT FIX THE MAIN PROBLEM OF THE PEANUT OIL. THIS IS A PROBLEM THAT IS COMPLETELY AVOIDABLE, YET A PROBLEM THAT IS BUILT INTO THE  VEHICLE.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/24/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH AND BECAME INVOLVED IN A SIX VEHICLE CRASH.  THE CONTACT'S AIR BAGS FAILED TO DEPLOY ON IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE FRONT END, RIGHT QUARTER PANEL AND THE REAR BUMPER NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 33,010.",
        "vin": "1GTR2WE77DZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2013",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK IS LEAKING OIL, AND  I HAVE A SMALL PUDDLE OH GARAGE FLOOR. BROUGHT TO ORIGINAL SELLING DEALER TO BE CHECKED. THEY CLAIMED THERE WAS A PLUG ON BACK OF ENGINE THAT WAS LEAKING. THEY HAD VEHICLE FOR 3 1/2 DAYS, AND CLAIMED IT WAS FIXED.  THEY HAD OVER 1 PAGE OF SEALS, GASKETS, PLUG WERE REPLACED.  DROVE APPROXIMATELY 50 MILES, AND IT STARTED LEAKING EXACTLY THE SAME AS BEFORE. RETURNED TO DEALER AGAIN, AND WAS TOLD BY THE SERVICE TECHNICIAN THAT IT WAS NORMAL TO SEE IT HAVING A LEAK DUE TO THE SILICONE THAT WAS USED ON ENGINE PARTS WHEN IT WAS BUILT !!!  I WAS ADVISED TO DRIVE IT FOR 1 WEEK AND BRING IT BACK AGAIN.  AT THAT POINT IN TIME, I CONTACTED GM AND WAS TOLD TO GET A SECOND OPINION AT ANOTHER DEALERSHIP. I BROUGHT IT TO THEM ON 11/15/13. IT HAS BEEN THERE NOW FOR 6 DAYS. I WAS JUST TOLD THAT THEY HAVE 4 PAGES OF NEW PARTS THAT HAVE TO BE ORDERED TO REPAIR IT. THEY (DEALERSHIP) REQUESTED THAT GM REPLACE THE ENGINE AND WAS DENIED. CONSIDERING THIS IS THE 3RD TIME TRYING TO REPAIR THE SAME PROBLEM, THEY SHOULD EITHER RE-PURCHASE OR LEMON LAW THIS.  *TR",
        "vin": "1GT125E8XDF"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/06/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THIS OCCURRENCE THE HOOD LATCH DOES NOT KEEP THE HOOD TIGHT WHEN CLOSED.  THE HOOD RATTLES AT SPEEDS OVER 35MPH AND APPEARS AS THOUGH IT IS GOING TO OPEN.  AS A RESULT OF ATTEMPTING TO SUFFICIENTLY SECURING THE HOOD, I SUBSEQUENTLY DENTED THE HOOD.  I HAVE HAD THE BODY DEPARTMENT AT THE LOCAL DEALERSHIP LOOK AT IT AND THEY FOUND THAT THE HOOD LATCH NEEDED TO BE ADJUSTED. AFTER ANOTHER 2500 MILES, THIS RATTLE HAS RETURNED.  THE COMPLAINT IS THAT THIS IS THE SECOND 2013 SIERRA DENALI THAT I HAVE OWNED SINCE OCTOBER 2012, SINCE THE DEALERSHIP BOUGHT BACK THE FIRST ONE AFTER NUMEROUS PROBLEMS INCLUDING THE TRANSMISSION BEING REPLACED AT 6250 MILES AND NUMEROUS EFFORTS TO FIX THE HOOD.  SAME PROBLEM TWO TRUCKS IS A CAUSE FOR CONCERN!  *TR",
        "vin": "3GTP2XE21DG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/05/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION IN FRONT BRAKES, WHEN BRAKING AROUND 55 - 60 MPH.  *TR",
        "vin": "1GTR2WE70DZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547613,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 1500. WHILE DRIVING 40 MPH, THE CONTACT STATED THAT THE VEHICLE WOULD JERK AND SHIFT IN BETWEEN GEARS. THE VEHICLE WAS TAKEN TO THE DEALER BUT WAS NOT REPAIRED NOR WAS THE FAILURE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 200.",
        "vin": "1GTR2VE76DZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/07/2013",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10547121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD RESTS OF OUR NEW TRUCK (PURCHASED DEC 2012) PROJECT SO FAR FORWARD THAT IT FORCES MY HEAD TO TILT DOWNWARD.  THERE IS NO FORWARD/BACK ADJUSTMENT TO THE HEAD REST, AND TURNING THE HEAD REST BACKWARDS TO MAKE IT BEARABLE MEANS IT NO LONGER WILL SERVE WELL TO PREVENT NECK INJURIES IN A CRASH. FOR SHORTER DRIVES, THE FORCED HEAD TILT IS UNCOMFORTABLE, BUT FOR LONGER DRIVES IT CAUSES ENOUGH PAIN THAT I HAD TO SEE A CHIROPRACTOR (AND I'M AN ATHLETIC, HEALTHY PERSON!).  THE DEALER AND MANUFACTURER CONTEND IT WORKS AS DESIGNED FOR SAFETY IN A CRASH.  BUT IF I CAN'T SIT IN IT FOR NORMAL DRIVING WITHOUT EXPERIENCING NECK/BACK PAIN, HOW \"SAFE\" IS THAT?  I NOTICED THE NEW 2014 GMC 1/2-TON PICKUPS HAVE A HEAD REST WITH A NOTICEABLY LESS ANGULAR DESIGN, INDICATING GMC RECOGNIZED THE HEAD REST DESIGN IN MY 2013 3/4-TON TRUCK IS, AT BEST, A POOR ONE AND, AT WORST, A POTENTIALLY DANGEROUS ONE.  IS THERE ANY RECOURSE TO GETTING GMC TO REPLACE MY HEAD RESTS WITH THE NEW DESIGN (OR EVEN AN OLDER ONE, LIKE THE STRAIGHT-UP-AND-DOWN ONES I HAVE IN MY 2003 CHEVY TAHOE)?  *TR",
        "vin": "1GT210CG9DZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON THIS VEHICLE SLIPS SOMETIMES BETWEEN 2ND AND 3RD GEAR AND ALSO WHEN PARKED ON A HILL AND PUT INTO DRIVE THE TRANSMISSION SHIFTS LATE INTO 1ST GEAR.  *TR",
        "vin": "3GTP1VE0XDG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT WAS DRIVING AT VARIOUS SPEEDS AND NOTICED A WIND NOISE COMING FROM THE WINDOW. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS BUT THEY WERE UNABLE TO DUPLICATE THE PROBLEM, STATING THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 300.",
        "vin": "1GTN1VEA0DZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/30/2013",
        "dateOfIncident": "05/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 1500. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THE VEHICLE SUDDENLY ACCELERATED TO 70 MPH. THE CONTACT WAS ABLE TO STOP THE VEHICLE BY APPLYING THE BRAKES. THE CONTACT TOOK THE VEHICLE TO THE DEALER. THE DEALER DID NOT PERFORM A DIAGNOSTIC TEST. THE DEALER STATED THE DIAGNOSTIC TEST WAS UNNECESSARY.  THERE WERE NO REPAIRS MADE TO THE VEHICLE. THE FAILURE MILEAGE WAS 3,000. ...UPDATED 08/22/13 *BF    THE DEALER WAS UNABLE TO FIND A PROBLEM. UPDATED 08/22/13",
        "vin": "1GTR2VE72DZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA. THE CONTACT STATED THAT WHILE REVERSING, THE PARK ASSIST LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS BUT THEY WERE UNABLE TO DUPLICATE THE PROBLEM. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 5,000.  UPDATED 9/17/13*CN",
        "vin": "3GTP2WE70DG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "*ISSUE IS WARNING LIGHT AND TONE THAT THE STABILITRAK SYSTEM REQUIRES SERVICING - THIS IS NOT THE STANDARD WARNING LIGHT THAT THE WHEEL TRACTION VARIES*  I HAD A 2011 GMC SIERRA WHICH I BROUGHT BACK TO THE DEALERSHIP AND CALLED GMC ABOUT FOR 6 ISSUES WITH THE STABILITRAK WARNING LIGHT.  EVEN WITH GMC CORPORATE INVOLVEMENT, ISSUE WAS NOT CORRECTED DESPITE REPLACEMENT OF NUMEROUS SENSORS, ETC.   IN ORDER TO AFFORD TO BUY A NEW 2013 VEHICLE,  I TRADED THAT TRUCK AND ANOTHER FOR THE ABOVE-NOTED GMC TRUCK AND 2-DAYS AFTER THE PURCHASE THE SAME PROBLEM HAS OCCURRED AT THE VERY SAME SPOT ON MY DRIVE HOME FROM WORK.  I CALLED GMC AND NOTIFIED THE DEALERSHIP.  THEY CANNOT FIX THE PROBLEM SO I WILL WAIT FOR THREE MORE INSTANCES AND WITH DRIVING A LOANER CAR FOR UP TO 3-WEEKS AT A TIME AND WILL INVOLVE THE LEMON LAW FOR DEFECTS WITHIN THE FIRST YEAR OF OWNERSHIP.  OF COURSE THE FEDERAL GOVERNMENT WILL DO  NOTHING EXCEPT PROVIDE GMC WITH MORE TAXPAYER-FUNDED BAILOUT MONEY!  THERE ARE NUMEROUS COMPLAINTS ONLINE ABOUT DEFECTS WITH THIS COMPLICATED SYSTEM THAT IS SO DEEPLY EMBEDDED IN THE CARS' RUNNING THAT IT CANNOT BE REPAIRED.  WHAT DOES IT TAKE FOR YOU TO DO SOMETHING ABOUT THIS CONSUMER RIPOFF????  *TR",
        "vin": "3GTP2VE78DG"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/27/2012",
        "dateOfIncident": "08/08/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC SIERRA 3500. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 5 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE CONTACT HEARD A LOUD SLOSHING NOISE OF FUEL COMING FROM THE FUEL TANK. IMMEDIATELY WHEN THE SOUND EMITTED A VIOLENT AND FORCEFUL MOVEMENT FROM THE EXTERIOR REAR OF THE VEHICLE OCCURRED. THE CONTACT CONTINUED TO DRIVE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHICH INFORMED THE CONTACT THAT THE VEHICLE OPERATED NORMALLY. IN ADDITION, THE INSTRUMENT CLUSTER AND RADIO WOULD NOT DIM IN THE NIGHT MODE. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 150. UPDATED 01/22/13*LJ  THE CONSUMER ALSO STATED GM HAS A SERVICE BULLETIN OUT ON THE CONDITION THAT HAS EXISTED SINCE THE 2007 MODEL YEAR. THERE IS ALSO A NIGHT TIME LIGHTING ISSUE WITH THE INABILITY TO DIM FURTHER, THE DASH LIGHTS OR TO TURN THEM OFF COMPLETELY. UPDATED 01/24/13",
        "vin": "1GT424E89DF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2012",
        "dateOfIncident": "08/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON LOW SPEED PANIC STOPPING WITH THE FUEL GAUGE READING 3/4 OF A TANK AND BELOW, THERE IS A VIOLENT/NOTICEABLE BUMP. LIKE BEING REARENDED AT LOW SPEED. IT IS A SITUATION THAT GM HAS A BULLETIN OUT ON #PIT5161  OR DOC ID:2851139 FOR THE 2007-2012 CHEV. SILVERADO AND GMC SIERRA P/U WITH THE 34 OR 36 GALLON TANKS. I FEEL THE BRAKES ARE CHALLENGED BY THIS CONDITION, AND EVEN MORE SO ON SLIPPERY, STEEP TERRAIN.  *TR",
        "vin": "1GT424E89DF"
    }
]