[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/16/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon. The contact stated that while driving approximately 35 MPH, the air bags inadvertently deployed. The contact stated that there were no warning lights illuminated. The contact stated that he was not involved in any crash and did not know what caused the failure. The contact stated that there was no injury. The contact stated that he then rolled the air bags up in order to be able to see as he drove the vehicle to his residence. The contact stated that he contacted the dealer who informed him that the failure was not related to NHTSA Campaign Number: 21V054000 (Air Bags). The contact stated that he had not contacted the manufacturer. The failure mileage was 190,000.",
        "vin": "1GKS2EEFXDR"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/11/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving my steering wheel jerks causing vehicle to veer, stabilitrak snd traction lights flash, lights flicker all the while driving. Vehicle nearly lost control while doing so. Auto shop cannot duplicate the issue nor any codes pop up . Very dangerous for a family while we are driving and saw many complain about this issue.",
        "vin": "1gks1ce06dr"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457612,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "GENERAL TIRE",
                "productModel": "GRABBER A/TX",
                "productYear": "9999",
                "size": "265/70 R 17 115T",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon equipped with Continental tires, Tire line: General Grabber A/TX, Tire Size: 265/70/R17, DOT Number: A3AHHMWW. The contact stated that all four tires had cracks forming on the treads, and the rubber was detaching from the tires. The dealer was made aware of the failure; however, the tires were not replaced. The manufacturer was made aware of the failure and informed the contact to send the affected tires to their location in North Carolina for inspection. The vehicle and tire failure mileage was not provided.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/16/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11457127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon. The contact stated while her son was driving approximately 20 MPH the driver's side curtain, passenger side curtain and ceiling air bags deployed with no accident occurring. The contact stated her son did not see any warning light illuminated. The contact's son safely pulled over to the side of the road and turned the vehicle off. The contact's son attempted to restart the vehicle, however it took several attempts to restart the vehicle. The son suffered injuries to the left side of his face and top of head, but did not seek medical attention. The vehicle had not been taken to local dealer or independent mechanic. The vehicle had not been diagnosed or repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 108,000.",
        "vin": "1GKS2KE79DR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "01/08/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454133,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact’s son owned a 2013 GMC Yukon XL. The contact stated while her son was driving 25 MPH on an icy roadway while slowing down to change lanes he lost control of the vehicle after hitting a patch of ice. There was no warning light illuminated. The vehicle went off the road ran through a residential fence, then collided with a parked vehicle with the rear end, ricocheted off that vehicle, then slid and collided with a tree on the driver’s side door. The contact stated that the air bags failed to deploy. A police report was filed. The contact stated her son was not injured. The vehicle was drivable and driven back to the contact's residence. Later the vehicle was towed to a local dealer where an insurance adjuster declared the vehicle a total loss. The contact stated that she had received a notification for NHTSA Campaign Number: 21V054000 (Air Bags). The manufacturer was not notified of the failure. The failure mileage was 174,000.",
        "vin": "1GKS2LE70DR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an issue with the radio head unit that causes a high pitched noise, even when the radio is off.  It happens with anything connected to the radio, like the indicator, seatbelt warning, door ajar warning.  The high pitch noise causes migraines and nausea in drivers and passengers. Issue has been ongoing for months.  All 3 radio heads installed by dealer have emitted this sound.  Dealer refuses to send in 3rd new unit. Relief from sound only happens when the fuse for the radio head unit is pulled. Attaching a picture of the sound frequency after opening the door, car not on.",
        "vin": "1gks1ke08dr"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle is kept inside in a garage in Pennsylvania with 53000 original miles.  While driving the vehicle a heard a sound that sounded like plastic cracking, low and behold I watched a crack form beginning at the split between the upper dash panel and the larger dash and it continued over the instrument cluster. I also noticed another smaller crack in the panel surrounding the air bag, of which as also been recalled but no solution as of today. Upon researching further I find I am not alone,  this is an obvious defect in either part material or assembly and should be covered by a recall.  Dealer replacement for this will run around 1,000 dollars.  I am worried that if I am involved in an accident not only do I have to worry about pieces of metal being propelled into a passenger now I also have to worry about plastic from a defective dash.  Thank you for you attention to this matter.",
        "vin": "1GKS2AE05DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The dashboard is cracking on both sides with one crack leading to the air bag. This creates a hazard as it could impact airbag or pieces of dash could cause injury as they are sharp. Dealers will not replace although it appears to be known issue",
        "vin": "1GKS2EEF8DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon. The contact stated that while driving at various speeds, she noticed a vibrating sound coming from the passenger’s side dashboard. She stated that there was a split in the dashboard that was causing the sound. The contact stated there was no warning light illuminated. The contact was concerned that in the event of a crash, the air bag would not deploy. The contact received notification of NHTSA Campaign Number: 21V053000 (Air Bags) and an appointment was scheduled to repair the vehicle. The vehicle was not yet repaired. The approximate failure mileage was 60,000.",
        "vin": "1gks1eef3dr"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata recall. The contact owns a 2013 GMC Yukon. The contact received a recall notice for NHTSA Campaign Number: 21V054000 (Air Bags) however, upon contacting the dealer, he was informed that since his dashboard was cracked, the recall could not be performed free of charge. The contact was provided an estimate for the dashboard repair. The manufacturer was not made aware of the issue. The contact stated that the manufacturer should have covered the cost of the dashboard due to the recall. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1gks2eef5dr"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon. The contact stated that he noticed there was a crack on the passenger’s side dashboard. There were no warning lights illuminated. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 50,000.",
        "vin": "1GKS2EEF6DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 GMC Yukon. The contact stated that she noticed cracks on the dashboard. There was no impact on the dashboard that could have caused the cracks. The vehicle was not diagnosed nor repaired. The dealer and manufacturer were not made aware of the failure. The failure mileage was unknown.",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE L94 ENGINE P/N 19418446 WITH THE VARIABLE LIFTERS HAVE A PROBLEM OF FAILING AND CAUSING THEM TO STICK AND DAMAGE THE CAM SHAFT. THIS CAUSES A LOUD TICKING IN THE ENGINE AND CAUSES THE ENGINE TO EITHER BE REBUILT OR REPLACED AT A COST OF 5 TO 8 THOUSAND DOLLARS WITH NO CONSIDERATION FROM GM. THIS SEEMS TO BE HAPPENING A LOT FROM TALKING TO DEALERS AND OTHER MECHANICS. THIS IS A KNOW DEFECT BY GM AS THEY NO LONGER MAKE THIS TYPE OF ENGINE WITH THE VARIABALE LIFTERS. IF THIS IS A KNOWN MANUFACTURING DEFECT GM SHOULD BE RESPONSIBLE TO CORRECT THE PROBLEM OR BE RESPONSIBLE FOR COVERING PART OF THE COST TO REPLACE / REBUILD THE ENGINE.",
        "vin": "1GKS2MEF5DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 GMC YUKON XL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V053000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GKS1MEF6DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405378,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAD 1 CRACK KNOWN PRIOR TO TAKATA RECALL, WHEN PICKED UP SEVERAL NEW CRACKS NOW EXIST. DEALER DENIED ANY WRONGDOING AND SUGGESTED I PURCHASE A COVER TO REMEDY THE PROBLEM. GMC SHOULD BE ASHAMED OF QUALITY CONTROL FOR DASHBOARD AS WELL AS POOR DESIGN/FAULTY DOOR HANDLES THAT BREAK EASILY BUT ENTIRE PANEL PURCHASE IS THE ONLY REMEDY. NO MORE GENERAL MOTOR VEHICLES FOR ME.",
        "vin": "1GKS2KE75DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402755,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKED OUT IN TWO DIFFERENT SPOTS",
        "vin": "1GKS2HE77DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS CRACKING, DASH IS VIBRATING.",
        "vin": "1GKS2MEF5DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397286,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASH",
        "vin": "1GKS2CE03DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN TENNESSEE ON A FAMILY VACATION, WE HEARD A CRACK FROM THE FRONT AREA OF THE CAR AND THE PASSENGER SAW THE DASHBOARD HAD CRACKED. THE CRACK IS IN THE MIDDLE THOUGH I'M CONCERNED IT MAY INTERFERE WITH AIRBAG DEPLOYMENT. IT WAS A SUNNY DAY IN THE SUMMERTIME. THE INTERIOR TEMPERATURE WAS SET TO 76 DEGREES. WE WERE ON A SMOOTH HIGHWAY, GOING ABOUT 50MPH. WE DID NOT HIT ANY ROAD OBSTRUCTIONS OR HOLES.  SINCE THE INITIAL CRACK OCCURRENCE, THERE HAVE BEEN SEVERAL LENGTHENING CRACKS, IN BOTH SUMMER AND WINTER, (OHIO) WHERE WE HEARD CRACKING SOUNDS BOTH DRIVING AND AT REST (PARKED BUT IDLING)  I DON'T HAVE PICTURES AT THIS TIME, THOUGH I CAN PROVIDE CURRENT JPG'S IF NEEDED.",
        "vin": "1GKS2MEF0DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 GMC YUKON XL HAS BEEN IDENTIFIED TO BE INCLUDED IN THE TAKATA AIRBAG RECALL. MY VEHICLE IS IN PRIORITY GROUP 9 ZONE A.  I ONLY LEARNED ABOUT THE RECALL ON 8 FEBRUARY, 2021 FROM A THIRD-PARTY, CARFAX, NOT THE DEALERSHIP, GM OR CALIFORNIA DMV, WHERE MY VEHICLE IS REGISTERED.  THIS IS 2.5 MONTHS AFTER GMS PETITION TO CANCEL THE RECALL WAS DENIED.  SECONDLY, THE DEALERSHIP IS STATING IT CANNOT FIX MY VEHICLE AT THIS TIME DUE TO THE LACK OF REPLACEMENT PARTS AND IT CANNOT PROVIDE ME A TIMELINE OF WHEN THE PARTS WILL BE AVAILABLE.  I HAVE REACHED OUT TO GM AS WELL AND THEY CANNOT PROVIDE ANY INFORMATION AND REFER ME BACK TO THE DEALERSHIP.  I AM CONCERNED ABOUT PUTTING MY FAMILY'S SAFETY AT RISK BY CONTINUING TO DRIVE A VEHICLE THAT HAS A SIGNIFICANT SAFETY DEFECT DUE TO THE FACT THAT I CANNOT BE PROVIDED A TIMELY FIX TO THE PROBLEM.  FURTHERMORE, I AM CONCERNED WITH THE DELAY IN NOTIFICATION AND THE MANNER OF NOTIFICATION.  THE CURRENT SITUATION HAS LEFT ME WITH THE ONLY OPTION OF INCURRING THE ADDITIONAL EXPENSE OF SECURING ALTERNATIVE TRANSPORTATION FOR MY FAMILY WHILE I WAIT FOR AN UNDETERMINED AMOUNT OF TIME TO FIX THIS SIGNIFICANT SAFETY ISSUE.",
        "vin": "1GKS2KE79DR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON .THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN RATE OF SPEED, A LOUD TICKING NOISE OCCURRED. THE CONTACT NOTICED A CODE WAS DISPLAYED ON THE INSTRUMENT PANEL: P3400 CYLINDER DEACTIVATION SYSTEM PERFORMANCE. THE DEALER NOR MANUFACTURER WERE MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 123,000.",
        "vin": "1GKS2LE78DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKED IN SEVERAL PLACES. MAIN CONCERN IS AROUND AIRBAGS. I HAVE USED  WINDSHIELD COVER TO PROTECT FROM AN DAMAGE SINCE IT WAS NEW.",
        "vin": "3GTP1XE26DG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH PREMATURELY CRACKING CAUSING ADDITIONAL RISK TO OCCUPANTS IN THE CASE OF A COLLISION.  RESEARCH SHOWS MANY MODELS WITH THE SAME ISSUE NOT BEING COVERED UNDER WARRANTY.",
        "vin": "1GKS2EEF6DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366948,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD IS CRACKED FROM THE DRIVER SIDE ALL THE WAY TO THE PASSENGER SIDE AIRBAG. UPON DOING RESEARCH, THIS IS A COMMON OCCURRENCE WITH THESE MODELS. I'VE CONTACTED GM CUSTOMER CARE AND ADVISED THEM OF THE ISSUE AS WELL AS MY CONCERN THAT THE CRACKED DASH BOARD MAY PUNCTURE THE AIRBAG AND BECOME INOPERABLE DURING AN ACCIDENT.",
        "vin": "1GKS1EEF8DR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362579,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 148000 MILES GOING 35 MPH CYLINDER 4 ACTIVE FUEL MANAGEMENT LIFTER COLLAPSED.  I LOOKED THIS UP ON THE INTERNET AND THIS IS SUBJECT OF SEVERAL TECHNICAL SERVICE BULLETINS.  THIS IS A DEFECT, THIS ENGINE HAS RECEIVED ALL REGULAR MAINTENANCE AND REPAIRS AT THE DEALERSHIP, NEVER TOWED, AND NEVER OFF ROAD WITH NO MODIFICATIONS.  THIS IS ABOUT A $3000 REPAIR JUST FOR THE AFFECTED BANK OF LIFTERS, $4200 TO DO BOTH BANKS OF LIFTERS.  THIS IS UNHEARD OF IN ANY OTHER VEHICLE.  GM KNOWS THIS IS A FAILURE OF THIS SYSTEM AND HAS DONE NOTHING BUT ISSUE BULLETINS FOR ITS CONSUMERS.",
        "vin": "1GKS2KE74DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS AND PASSENGERS PLASTIC INTERIOR DOOR HANDLES ARE BOTH CRACKED!   DASHBOARD IS CRACKED IN TWO SPOTS.",
        "vin": "1GKS1KE05DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD",
        "vin": "1GKS1CE05DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND DASH THAT HAS CRACKED.  FIRST WAS IN APPROX 2015 AND THEN THIS YEAR. LARGE COMPLETE SECTION BROKEN OUT.  CAME OUTSIDE TO FIND IT HAD CRACKED AND KEEP WINDSHIELD COVER IN IT.  BOTH DOOR HANDLES HAVE BROKEN AND I HAVE REPLACED THOSE.  VEHICLE ONLY HAS 55,465 MILES.",
        "vin": "1GKS1AW07DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND DASH THAT HAS CRACKED. FIRST WAS IN APPROX 2015 AND THEN THIS YEAR. LARGE COMPLETE SECTION BROKEN OUT. CAME OUTSIDE TO FIND IT HAD CRACKED AND KEEP WINDSHIELD COVER IN IT. BOTH DOOR HANDLES HAVE BROKEN AND I HAVE REPLACED THOSE. VEHICLE ONLY HAS 55,465 MILES CURRENTLY.",
        "vin": "1GKS1AE07DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP OF DASHBOARD CRACKING IN FRONT OF DRIVERS SEAT. THE CRACK IS TRAVELING TOWARDS THE DRIVER AND AT TIMES YOU CAN SEE IT LIFTING UP ON ONE SIDE OF THE CRACK. I'M AFRAID THAT ONCE IT TOTALLY CRACKS IT WILL CAUSE ISSUES WITH VISIBILITY WHEN DRIVING AND ALSO OBJECTS FROM THE DAMAGED AREA TO FLY INTO YOUR FACE WILL DRIVING. WENT TO RIVERHEAD GMC FOR MY NYS INSPECTION AND WAS TOLD THAT GM WILL NOT OVER IT.",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "5 CRACKS LOCATED ON THE INTERIOR DASHBOARD. THESE CRACKS VARY IN SIZE BUT ARE LOCATED ACROSS THE LENGTH OF THE DASH. THERE ARE CRACKS COMPROMISING THE SUPPORT STRUCTURE FOR THE SPEAKER IN THE MIDDLE OF THE DASH AND ALSO THE PASSENGER AIRBAG. INTERVENTIONS USED TO PREVENT THIS FROM OCCURRING AS RECOMMENDED BY GM ARE: CAR IS GARAGE KEPT AND REFLECTIVE MATERIAL IS USED WHEN PARKED OUTSIDE. THESE RECOMMENDED INTERVENTIONS DO NOT WORK. DUE TO THE VOLUME OF CUSTOMERS WITH THIS EXACT SAME ISSUE OR CONCERN, I STRONGLY ENCOURAGE FURTHER INVESTIGATION AND ACCOUNTABILITY FOR GM TO RESOLVE.",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE ABOUT 70MPH AND THE CAR STARTED SPUTTERING AND TRACTION CONTROL LIGHTS CAME ON AND I THOUGHT THE CAR WAS GOING TO STALL AND CAUSE AN ACCIDENT.  I WAS ABLE TO PULL OFF ON TO THE SHOULDER AND LOOK UNDER THE HOOD.  I THOUGHT IT WAS A BAD SPARKPLUG OR SOMETHING.  I HOOKED UP A OBD READER AND GOT CODE P0306.  GOT IT TOWED TO FIRESTONE AND THEY DID DIAGNOSTICS.  THEY SAID IT WAS A FAILED LIFTER, A KNOWN PROBLEM WITH GM VEHICLES.  THE TICKING NOISE THAT IT WAS MAKING WAS FROM THE FAILED LIFTER. I AM HOPING THE CAMSHAFT IS NOT DAMAGED EITHER.",
        "vin": "1GKS1EEF5DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKED AT AIRBAG & HAS BEEN SINCE PURCHASED",
        "vin": "1GKS1EEF7DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341412,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS CRACKED. IT RATTLES AND SHAKES WHILE DRIVING. THIS IS A KNOWN DEFECT FROM GMC.",
        "vin": "1GKS2EEF8DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKS",
        "vin": "1GKS1MEF7DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 3 MAJOR CRACKS ON MY DASHBOARD THAT APPEARED OUT OF NOWHERE. WHEN I RESEARCHED IT I SEE THAT THIS IS A COMMON PROBLEM WITH MY YEAR MAKE AND MODEL.",
        "vin": "1GKS2MEF6DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319975,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKED NEXT TO THE AIR BAG. THE BRACKETS UNDERNEATH ARE BROKEN. IN THE EVENT OF A CRASH, IT WOULD NOT PROPERLY DEPLOY.",
        "vin": "1GKS1EEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH ON MY 2013 YUKON HAS STARTED TO CRACK. IT SITS IN A HOUSE GARAGE, EXCEPT WHEN I AM AT WORK.",
        "vin": "1GKS2CE06DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY YUKON DENALI WAS BACKED INTO WHILE PARKED AT MY WORK PARKING LOT AND WHEN I GOT INTO THE VEHICLE TO DRIVE TO THE REPAIR SHOP I NOTICED THAT THE DASHBOARD WAS CRACKED IN THE UPPER LEFT SIDE OF THE PASSENGER AIRBAG.  I INFORMED THE INSURANCE ADJUSTER ABOUT THE CRACK AND THEY INFORMED ME THAT THEY COULD DO NOTHING ABOUT IT. HE INSTRUCTED THAT I TAKE THE VEHICLE TO GMC AND HAVE THEM FILE A CLAIM. I THEN WENT TO THE DEALERSHIP AND THEY INFORMED ME THAT GM WOULD PROBABLY DENY MY CLAIM, WHICH THEY DID. SO NOW IM STUCK WITH A CRACKED DASHBOARD IN MY OTHERWISE PERFECT VEHICLE.  I DO NOT KNOW WHAT TO DO NOW.",
        "vin": "1GKS1EEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN THE ROAD GOING ABOUT 45 MPH AND VEHICLE FELT LIKE IT LOST POWER THEN IT COMPLETELY SHUT OFF. HAD ONLY GONE ABOUT 3 MILES WHEN IT HAPPENED. WAS ABLE TO GET TO THE SHOULDER AND RESTART VEHICLE TO DRIVE BACK HOME. THERE WERE NO WARNING LIGHTS OR ANYTHING. IT DID SEEM LIKE THE ENGINE WAS REVVING ITSELF FOR A FEW SECONDS WHEN I RESTARTED IT. THEN IT SEEMED NORMAL AND I WAS ABLE TO DRIVE THE APPROXIMATE 3 MILES BACK WITHOUT ANY ISSUES.",
        "vin": "1GKS2MEF5DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH HAS CRACKED AT AIRBAG.  SAFETY RISK.",
        "vin": "1GKS2EEF0DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2020",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298822,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD ON MY GMC TRUCK IS CRACKED IN THREE PLACES. ONE OF THE PLACES IS A CORNER ON THE DASH THAT ENCASES THE AIRBAG. I HAVE RELIGIOUSLY COVERED THE DASH SINCE DAY ONE, BECAUSE I HAD A SIMILAR PROBLEM ON MY 2007 SIERRA. DASH CRACKED IN ONE PLACE. DEALER REPLACED IT FOR FREE.",
        "vin": "3GTP1XE26DG"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290635,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IS CRACKING OVER AIR BAGS WHICH COULD THROW PIECES AS AIR BAG DEPLOYS OR COULD PUNCTURE AIRBAG AS IT DEPLOYS.",
        "vin": "1GKS1EEF4DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS STARTED APPEARING FOR NO REASON. VEHICLE ONLY HAS 24,200 MILES AND HAS BEEN KEPT IN GARAGE.",
        "vin": "1GKS2CE03DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACK ABOVE STEERING COLUMN AND AIRBAG",
        "vin": "1GKS2EEF8DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH NEAR THE AIR BAG ON THE PASSENGER SIDE ALL OF A SUDDEN CRACKED.  CURRENT MILEAGE IS 38,692.",
        "vin": "1GKS2EEF0DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS CRACK AND CRACK IS EXPANDING....  CHEAP MATERIAL  VERY DISAPPOINTED",
        "vin": "1GKS1MEF0DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IS CRACKED JUST AS ALL OTHERS FROM THE SAME ERA. IT IS CRACKED IN THE SAME PLACE AS THE OTHERS ALSO. THIS POSES AN ISSUE SHOULD THE PASSENGER AIRBAG GO OFF. FOR THIS REASON MY DAUGHTER IS NOT ALLOWED IN THE FRONT SEAT.",
        "vin": "1GKS2MEF7DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEEP CRACKS IN DASHBOARD, INCLUDING PASSENGER AIRBAG AREA, COULD POSE SERIOUS RISK BY AFFECTING THE DEPLOYMENT OF AIRBAG. THIS IS APPARENTLY CAUSED BY THE POOR QUALITY PLASTIC MATERIAL USED TO MANUFACTURE THE DASHBOARD. THIS MATERIAL CANNOT WITHSTAND THE SUMMER/HOT CLIMATE.",
        "vin": "1GKS27E07DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD",
        "vin": "1GKS1CE06DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH IS BROKEN IN MANY PLACES AND KEEPS GETTING WORSE AND WORSE. IT IS BROKEN AROUND THE AIRBAG MY FEAR IS IF THE AIRBAG ACTIVATES IT WILL BREAK OFF PART OF THE DASH THROWING IT INTO THE PASSENGERS FACE. WITH THE AMOUNT OF FORCE A AIRBAG HAD THIS COULD REALLY BE DANGEROUS.",
        "vin": "1GKS2CE03DR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE WARNING INDICATOR ILLUMINATED. THE CONTACT ADDED BRAKE FLUID TO THE VEHICLE AND THE INDICATOR ILLUMINATED AGAIN, BUT THERE WAS NO FLUID LEAKING FROM THE VEHICLE. THE CONTACT WAS AN INDEPENDENT MECHANIC WHO STATED THAT THE BRAKE FLUID WAS LEAKING INTO THE VACUUM CANISTER FOR THE POWER BRAKE. THE CONTACT ALSO MENTIONED THAT THE FAILURE COULD NOT BE DETECTED UNLESS THE VEHICLE WAS DIAGNOSED. THE DEALER WAS NOT CONTACTED. THE CONTACT REPAIRED THE VEHICLE HIMSELF. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 134,000.",
        "vin": "1GKS2KE72DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246202,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKING AND POTENTIALLY EXPANDING ABOVE GAGE CLUSTER WHICH WOULD CAUSE SHARP PLASTIC TO BREAK FREE UPON AIRBAG DEPLOYMENT AND CAUSE SEVERE INJURY. CAUSE OF CRACKING UNKNOWN, ~50,000 MILES ON VEHICLE NORMAL NON-EXTREME USE",
        "vin": "1GKS2KE7XDR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246133,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKED ADJACENT TO PASSENGER AIRBAG AND ALSO ABOVE STEERING COLUMN. ENTIRE DASHBOARD RATTLES QUITE BADLY AND I AM CONCERNED THAT EITHER THE AIRBAG WOULD NOT FUNCTION OR THE DASHBOARD WOULD SHATTER IN A COLLISION.",
        "vin": "1GKS1CE06DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUT OF THE BLUE THE DASHBOARD ON THE DRIVERS SIDE CRACKED. IT HAS SINCE CRACKED ACROSS THE ENTIRE DASHBOARD.  THERE WAS NO DAMAGE OR EVENT THAT CAUSED THIS. IT HAPPENED OUT OF THE BLUE. I DON'T KNOW IF IT CRACKED WHEN THE VEHICLE WAS IN MOTION OR NOT.",
        "vin": "1GKS2EEF0DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST 12 MONTHS THE DASH HAS CRACKED IN MULTIPLE PLACES AND THE PAINT ON THE HOOD AND ROOF HAS CRACKED AND FADED.  I HAVE ALREADY HAD THE HOOD REPAINTED BUT THE ROOF IS MORE EXTENSIVE AND SHOULD NOT HAVE TO BE REPAINTED AFTER ONLY 6 YEARS.  THE DASH IS CRACKED NEAR THE AIRBAG SO IF I'M IN AN ACCIDENT THE DASH WILL SPLINTER INTO THE FACES OF THE PASSENGERS.",
        "vin": "1GKS2EEF6DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229173,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKED AROUND AIRBAG AND COLUMN , IN ACCIDENT DASH DEBRIS COULD CAUSE BODILY DAMAGE AS A PROJECTILE.",
        "vin": "1GKSEEF3DR1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH IS CRACKING AROUND AIRBAG POTENTIALLY COULD CAUSE PROJECTILES BEING TOSSED IN A ACCIDENT , CRACKING ALL OVER DASH",
        "vin": "1GKS1EEF3DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 CRACKS IN MY DASH NEAR BOTH AIRBAGS.",
        "vin": "1GKS1EEF2DR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE EXHAUST MANIFOLD BOLTS HAVE BROKEN OFF AT HEAD.",
        "vin": "1GK52EEF7DR"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LIVE IN ARIZONA. WAS DRIVING IN AUGUST 2018 IN AFTERNOON VEHICLE FAILED TO ACCELERATE IN INTERSECTION. ALMOST GOT TBONED. TOOK TO GMC DEALERSHIP. WE WERE SO SCARED AS WE HAD OUR SON IN THE CAR. DEALERSHIP KEPT FOR A WEEK KEPT TELLING US THERE WAS NOTHING WRONG I WOULD NOT ACCEPT THIS FOR AN ANSWER I TOLD MY HUSBAND TO TELL THEM THAT WE WERE NOT GOING TO PICK UP THE CAR COULD THEY PLEASE HAVE A MANAGER LOOK AT IT AT THAT POINT WE ALSO ASK THEM TO REPLACE ANY FLUIDS AND DO WHATEVER THEY COULD TO MAKE THE VEHICLE AS SAFE AS POSSIBLE AS THIS IS OUR MAIN VEHICLE AT THAT POINT WE WERE GIVEN A BULLETIN THAT WAS PUT OUT IN 2015 STATING THAT THIS PARTICULAR CAR HAD THIS ISSUE AT TEMPERATURES ABOVE 110 DEGREES FAHRENHEIT AND WHEN A DEALERSHIP WHY GMC DID NOT RECALL THEY INFORMED US THAT IT WAS DUE TO THE FACT THAT IT ONLY AFFECTED A FEW STATE THAT ACTUALLY GET THAT HOT I WAS FURIOUS WITH THIS ANSWER I DID CONTACT A LAWYER BUT UNFORTUNATELY IT DID NOT FIT INTO THE LEMON LAW AND SO NOTHING GOT DONE I DID NOT KNOW ABOUT THIS REPORTING METHOD UNTIL JUST NOW I AM IN FEAR AGAIN AS TEMPERATURES ARE CURRENTLY HEATING UP IN ARIZONA AND HAVE MADE A COMPLAINT TO GMC WHICH WAS VERY HARD TO DO THEY KEPT TELLING ME TO TAKE IT BACK TO DEALERSHIP WHAT DEALERSHIP HAS ALREADY TOLD ME THEY CANNOT FIX IT THAT IS WHY THEY GAVE ME THE BULLETIN THERE IS NOTHING THEY CAN DO DMC IT'S SUPPOSED TO CALL DEALERSHIP ON MONDAY AND CALL ME BACK AT THIS POINT I REALLY FEEL LIKE A RECALL ON THIS VEHICLE IS THE SAFEST OPTION FOR EVERYONE THAT MAY OWN OR COME INTO CONTACT WITH THIS VEHICLE ON THE ROAD I HAVE A COPY OF THE BULLETIN IN MY EMAIL GMC HAS STATED THROUGH INTERNET CHAT AND PHONE CALL THAT THEY CANNOT LOCATE THIS BULLETIN I DO HAVE A COPY AND WOULD PROVIDE IT IF REQUESTED",
        "vin": "1GKS2EEF3DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"DASHBOARD CRACK\"    IN 2016 I PURCHASED MY GMC YUKON DENALI XL FOR ABOUT $46,000.00 AT INGERSOLL AUTO OF DANBURY, CONNECTICUT. AT THE TIME OF PURCHASED MY YUKON WAS NOT COVERED UNDER THE BUMPER TO BUMPER WARRANTY, BUT I DID PURCHASED THE EXTENDED WARRANTY. ON APRIL 25, 2019 I NOTICED A CRACK ON MY DASHBOARD JUST TOP OF MY INSTRUMENT PANEL. THAT SAME DAY I REACHED OUT TO GM AND FILED A REPORT. THEY TOLD ME THAT THERE WAS NOTHING THEY CAN DO AND THIS WAS NOT A RECALL OR A DEFECT THAT GM WOULD COVER BUT INSIST ME TO CONTACT A DEALER TO SEE ABOUT REPAIRS. ON OR ABOUT 11:30AM ON 4/25/19 I CONTACTED THE SERVICE DEPARTMENT AT INGERSOLL AUTO OF PAWLING NY. THE SERVICE ADVISER I SPOKE TO TOLD ME HER NEVER HEAR ABOUT THIS PROBLEM AND SAID THAT THE REPAIR WOULD NOT BE COVERED UNDER MY EXTENDED WARRANTY. THE VALUE OF MY  VEHICLE HAS BEEN DIMINISHED AS A RESULT OF THE DASHBOARD DEFECT. I WOULD  NOT HAVE PURCHASED THE VEHICLE OR WOULD NOT HAVE PAID AS MUCH FOR IT HAD I  KNOWN OF THE DEFECTIVE DASHBOARD'S PROPENSITY TO CRACK AND/OR THAT THE DEFECT CAN  INTERFERE WITH THE PLANNED DEPLOYMENT OF THE DRIVER'S-SIDE AND PASSENGER'S-SIDE  AIRBAGS.",
        "vin": "1GKS2MEF9DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A CRACK EMANATING FROM THE CORNER OF THE AIRBAG COMPARTMENT ON THE DASHBOARD ON THE PASSENGER SIDE.  I NOTICED IT THE LAST WEEK IN MARCH ONE MORNING.  IT WAS NOT PARTICULARLY COLD.  THE CRACK IS NOT SPLITTING INTO TWO MORE CRACKS.  IF THE AIRBAG DEPLOYS THOSE PIECES AND PERHAPS OTHERS WILL AS WELL.  THE CAR IS SIX YEARS OLD AND HAS COMPLETE SERVICE RECORDS AND BUT FOR THE CRACK CONSIDERED IN EXCELLENT CONDITION FOR TRADE VALUE PURPOSES.  THIS IS A SAFETY CONCERN THAT SHOULD BE ADDRESSED BY GM AND THE NHTSA.",
        "vin": "1GKS2KE74DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DENALI HAS A BAD CRACK ON THE DASH BOARD AND I HIT A BUMP A PIECE OF THE PLASTIC FLEW AND CUT MY FACE , THE DASH IS GETTING WORSE AND THIS IS BECOMING A LIABILITY. I WILL BE CONTACTING MY ATTORNEY AND THE BBB, ABOUT THIS DANGEROUS ISSUE. I'M GLAD IT WAS ME AND NOT MY CHILDREN THAT GOT INJURED.",
        "vin": "1GKS2MEF3DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD 2 CRACKS IN MY DASHBOARD, PASSENGER SIDE FROM REAR/LEFT SIDE TOWARD WINDSHIELD FROM AIRBAG AND ANOTHER OVER INSTRUMENT PANEL.  THEY HAVE BEEN THERE FOR OVER A YEAR, I DIDN'T REALIZE HOW COMMON THIS PROBLEM WAS OR I WOULD HAVE REPORTED SOONER.  CONCERN RELATES TO DASHBOARD PIECES CAUSING INJURY IF AIRBAG DEPLOYED.  VEHICLE IS PARKED INSIDE DAY AND NIGHT",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173788,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKED IN 2 PLACES.  PASSENGER SIDE ABOVE THE GLOVE COMPARTMENT AND DRIVER'S SIDE ABOVE THE INSTRUMENT PANEL.  I NOTICED THE PASSENGER SIDE CRACK ABOUT 2 MONTHS AGO AND THE ONE ABOVE THE INSTRUMENT PANEL TODAY 2-3-19",
        "vin": "1GKS2EEF9DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173546,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A LITTLE OF A MONTH AGO WE NOTICED THERE WAS A CRACK FROM THE CORNER OF THE AIR BAG DOWN THE DASH. THE CAR WAS STATIONARY AND HAS NEVER BEEN IN ANY ACCIDENTS. I CALLED THE DEALERSHIP TO FIND OUT IF MY SERVICE CONTRACT WAS GOING TO COVER THIS SINCE I HAVE ONLY OWNED THIS VEHICLE A LITTLE OVER A YEAR. THE INFORMED ME IT WOULD NOT BE COVERED. THIS IS A HUGE SAFETY CONCERN FOR ME AND MY HUSBAND AS WE HAVE TWO SMALL KIDS AND ALWAYS HAVE KIDS IN THE CAR. SO I TRIED TO OPEN A CASE WITH GM CUSTOMER CARE HOPING THEY WERE GOING TO DO SOMETHING AS THIS WAS A GM CERTIFIED VEHICLE AND THAT WARRANTY JUST EXPIRED 2 MONTHS AGO. THEY DON'T CARE ABOUT ANY OF IT. THEY GO BACK TO THE ORIGINAL WARRANTY AND TOLD ME IT WAS NOT A SAFETY ISSUE BECAUSE IT DOESN'T HAVE A RECALL ISSUED ON IT AND THEY AREN'T GOING TO DO ANYTHING FOR ME. THEY ADVISED ME TO TALK TO THE DEALERSHIP CUSTOMER EXPERIENCE MANAGER AND SEE IF THERE IS ANYTHING THEY COULD DO. I HAVE ALWAYS BOUGHT GM PRODUCTS BUT THIS HAS CHANGED MY MINE. PEOPLES LIVES COULD BE AT STAKE HERE WITH DASHBOARDS CRACKING ALL AROUND THESE AIRBAGS THAT SO MANY PEOPLE ARE HAVING PROBLEMS WITH. I ADVISED THERE ARE COMPLAINTS ALL OVER THE INTERNET AND THEY ALL ACT SURPRISED!! I DRIVE A BIG SUV FOR MORE PROTECTION AND RELIABILITY FOR MY CHILDREN AND NOW I HAVE A VEHICLE THAT IS ONLY 5 YEARS OLD WITH ONLY 69K MILES ON IT THAT WAS WORTH A TON OF MONEY THAT NOW IS A HUGE SAFETY RISK FOR ME WHEN I DRIVE WITH MY KIDS AND OTHER KIDS. BUCK UP GM THIS IS A HUGE SAFETY PROBLEM...BEFORE SOMEONE GETS KILLED!",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH ISSUES HAVE PLAGUED THE 2007-2014 GMC TRUCKS.  MINE IS INCLUDED IN THIS. THERE IS CRACKING ALL AROUND THE AREA WHERE THE PASSENGER AIRBAG IS. I'M WORRIED THAT IN A DEPLOYMENT, PIECES OF DASH WOULD BE PROJECTED AT PASSENGERS.  THE DASH MATERIAL IS CLEARLY VERY BRITTLE AND FLIMSY.",
        "vin": "1GKS2EEF5DR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "12/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPERS WILL ONLY WORK ON HIGH,  LOW OR DELAYED WIPERS WILL NOT WORK IN ANY CONFIGURATION.  ALSO TAB FOR WATER AND WIPERS DOES NOT WORK. VEHICLE WAS IN A SNOW STORM AND COULD NOT USE THEM CONSISTENTLY. WE HAD TO KEEP TAKING HANDS OF THE WHEEL TO CYCLE FROM OFF AND ONLY HIGH SPEED.",
        "vin": "1GKS2KE77DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON DENALI. WHILE THE VEHICLE WAS STATIONARY, THE CONTACT NOTICED THAT THE DASHBOARD WAS CRACKED NEAR THE FRONT PASSENGER SIDE AIR BAG. SILVER STAR BUICK GMC (3601 AUTO MALL DRIVE, THOUSAND OAKS, CALIFORNIA 91362, (805) 222-4789) WAS MADE AWARE OF THE FAILURE AND PERFORMED AN ASSESSMENT OF THE DASHBOARD DAMAGES IN THE FORM OF PICTURES AND DOCUMENTED THE CONTACT'S CASE FILE. THE DEALER THEN REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THE VEHICLE WAS OUT OF WARRANTY COVERAGE AND THAT THERE WAS NO RECALL. THE CONTACT WAS PROVIDED WITH CASE NUMBER: 8-4694265955. THE FAILURE MILEAGE WAS APPROXIMATELY 75,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A MESSAGE ON MY DASH STATING TO SERVICE AIRBAG I'M AFRAID FOR MY SAFETY OR THE SAFETY OF MY PASSENGER DUE TO THIS MESSAGE INVOLVING THE AIRBAG",
        "vin": "1GKS1KE06DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 YUKON XL WITH JUST OVER 88000 MILES ON IT, VEHICLE IS IN VERY GOOD CONDITION, IT HAD BEEN SITTING IN THE GARAGE A COUPLE OF DAYS, I OPENED THE PASSENGER DOOR TO RETRIEVE AN ITEM AND HEARD A LITTLE CRACK SOUND, THE DASH HAD CRACKED ON TOP FROM THE PASSENGER AIR BAG TOWARD THE DEFROSTER, CONTACTED GMC AND WAS INFORMED THAT THIS IS THE FIRST TIME THEY HAD HEARD OF THIS PROBLEM AND VEHICLE IS OUT OF WARRANTY AND THIS WOULD BE AN OUT OF POCKET EXPENSE. UPON FURTHER INVESTIGATION AS I WAS TALKING TO UPHOLSTREY SHOPS AND CAR RESTORATION PEOPLE TRYING TO FIND SOMEONE TO REPAIR CRACK BEFORE IT GETS WORSE, THEY TOLD ME IT'S A COMMON PROBLEM AND MORE THAN LIKELY THIS IS JUST THE BEGINNING. I LIVE IN ND WHERE WE HAVE EXTREME TEMPERATURE SWINGS SO I'M A BIT CONCERNED. LASTLY, WITH THE CURRENT CRACK BEING WHERE IT IS, SHOULD THE AIRBAG EVER DEPLOY AM I GOING TO HAVE DASH PIECES FLYING THROUGHOUT THE VEHICLE?",
        "vin": "1GKS2KE7XDR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IS CRACKING AROUND THE AIR BAG AND IN FRONT OF THE DRIVER INSTRUMENTATION AREA. HAS LESS THAN 50,000 MILES ON THE VEHICLE. TRIED TO GET GM TO REPAIR BUT THEY REFUSED.",
        "vin": "1GKS2EEF6DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I TOOK VEHICLE INTO GMC SERVICE CENTER AFTER AIRBAG SERVICE LIGHT CAME ON. TECHNICIANS DIAGNOSED THAT THE PASSENGER AIRBAG MODULE REQUIRED REPLACEMENT.  IT HAS NEVER DEPLOYED AND PRESENTS A POTENTIAL HIGHWAY SAFETY ISSUE.",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK IN DASHBOARD AT CORNER OF AIRBAG PASSENGER SIDE.",
        "vin": "1GKS1CE07DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CRACK IN MY DASHBOARD THAT COULD SERIOUS INJURY OR DEATH IF THE AIRBAGS DEPLOY.",
        "vin": "1GKS1KE06DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098017,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD HAS CRACKED BY THE AIRBAG AND BY THE INSTRUMENT PANEL IN THREE DIFFERENT LOCATIONS!! UGH!! GET A DENALI THEY SAID!! LUXURY THEY SAID!!",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING ISSUES WITH THE ELECTRICAL COMPONENTS OF THE STABILITRAK AND ABS SYSTEMS. I HAVE ALSO BEEN HAVING PROBLEMS WITH THE ELECTRICAL SYSTEM THAT RUNS THE INSTRUMENTATION FOR THE AIR,HEAT AND BLOWER.  THE MAIN PROBLEM IS THAT THERE IS A CRACK ON THE DASH IN THE LEFT HAND CORNER OF THE PASSENGER AIR BAG. THIS HAS BEEN WELL DOCUMENTED BY THOUSANDS ON THE INTERNET. I CALLED GM AND THEY SAID THERE ARE NO RECALLS BUT THEY ISSUED A CASE #. THIS CASE # APPLIES TO ALL THREE PROBLEMS FOR MY VEHICLE.",
        "vin": "1GKS2KE71DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090418,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON XL. THE CONTACT STATED THAT THE DASHBOARD WAS CRACKED ON THE FRONT DRIVER'S SIDE. THE FAILURE OCCURRED WITHOUT WARNING. THE CONTACT CALLED AND TOOK THE VEHICLE TO COUNTRYSIDE CHEVROLET BUICK GMC (N8167 KELLOM RD, BEAVER DAM, WI 53916, 920-354-6097) WHERE THE TECHNICIAN TOOK PICTURES OF THE FAILURE AND STATED THAT THE DASHBOARD NEEDED TO BE REPLACED AT THE OWNER'S EXPENSE. THE MANUFACTURER STATED THAT THERE WAS NO RECALL AND THE VEHICLE WAS OUT OF WARRANTY. THE MANUFACTURER REFERRED THE CONTACT TO NHTSA. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 82,000.",
        "vin": "1GKS2MEF0DR"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL. DASH IS CRACKED AND CONTINUES TO CRACK ON THE PASSENGER SIDE NEXT TO THE PASSENGER AIRBAG. I'M WORRIED THAT THE DASH COULD SPLINTER IN A VEHICLE CRASH IF THE PASSENGER AIRBAG DEPLOYS.",
        "vin": "1GKS1EEF6DR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090248,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 50K THE SIDE DETECTION WARNING SYSTEM AND PARK ASSIST QUIT WORKING. UPON TAKING IT IN FOR REPAIRS WE FIND THAT THIS IS A MAJOR PROBLEM FOR THIS VEHICLE, AND REPLACEMENT PARTS ARE AT A SHORTAGE..DUE TO HIGH VOLUME OF REPAIRS. WE CALLED GM CUSTOMER CARE AND THEY STATE THERE IS NO RECALL AND OUR REPAIR WILL BE OVER $1000 TO FIX THIS PROBLEM.  WE FEEL THIS IS UNFAIR PRACTICE SINCE THEY ARE AWARE THEY HAVE THIS PROBLEM.",
        "vin": "1GKKVTKDXDJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECT CAUSED DASH TO CRACK AT THE PASSANGER AIRBAG, I AM CONCERNED ABOUT MY CHILDREN BEING INJURED FROM THE CRACKED DASH AS WELL AS THE SHARDS FLYING AND INJURING MY CHILD IF I WERE TO BE IN AN ACCIDENT.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASH OVER INSTRUMENT CLUSTER AND PASSENGER AIR BAG",
        "vin": "1GKS1CE00DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064445,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IN MY 2013 GMC YUKON DENALI IS HAS BEGIN TO CRACK FROM THE WINDSHIELD TO  JUST IN FRONT OF THE STEERING WHEEL.  IT IS STARTING TO SPREAD TWO WAYS. THIS COULD BE A POTENTIAL SAFETY HAZARD IF THE AIR BAGS DOESN'T DEPLOY PROPERLY BECAUSE OF THE BROKEN STRUCTURE OF THE DASHBOARD. IS THERE A VOLUNTARY GM RECALL OR A NHTSA RECALL FOR THIS PROBLEM? THE VEHICLE IS WELL MAINTAINED AND THE CRACK SPREADS AS THE VEHICLE IS BEING DRIVEN.",
        "vin": "1GKS2EEF4DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "01/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE YUKON THAT WE OWN HAS A CRACK THAT CONNECTS TO THE PASSENGER AIRBAG.  WE BOUGHT A FULL WARRANTY (WAS A PRE-OWNED CAR) THAT WAS SUPPOSED TO COVER ALL, BUT WHEN WE TOOK IT TO THE GMC DEALER, THEY SAID IT'S NOT COVERED!  I CALLED GMC DIRECTLY TELLING THEM I FEEL IT'S A SAFETY CONCERN SINCE IT'S CONNECTED TO THE AIRBAG AND THEY RESPONDED SAYING THAT ITS NOT A CONCERN AND THEY WOULD NOT REPLACE IT. IF THERE IS AN ACCIDENT AND MY PASSENGER AIRBAG IS DEPLOYED, I FEAR THAT PART OF THE DASH WILL COME FLYING OFF AS WELL.  AFTER RESEARCHING, I SEE THIS IS A VERY COMMON PROBLEM WITH THE GMC DASH.  YET, GMC WON'T DO ANYTHING ABOUT IT. VEHICLE WAS IN MOTION, GOING STRAIGHT ON THE HIGHWAY WHEN IT JUST CRACKED RIGHT IN FRONT OF US.",
        "vin": "1GKS2CE0XDR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS CRACKING AROUND THE AIRBAG ON ITS OWN.  FEEL THIS MAY BE A SAFETY HAZARD.",
        "vin": "1GKS1EEF5DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS 2 CRACKS, ONE LOCATED ABOVE INSTRUMENT PANEL/STEERING WHEEL AS LONG AS 6 INCHES. THE OTHER CRACK IS LOCATED ON LEFT HAND SIDE ABOVE PASSENGER AIR BAG. THIS HAPPENED ON MY COMMUTE HOME.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKED BY FRONT PASSENGER AIRBAG. SPONTANEOUS CRACK WITH NO EXTERNAL CAUSE. IT WAS NOT A HOT DAY. STATIONARY VEHICLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053450,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD AROUND THE AIRBAG AND STEERING/INSTRUMENT CLUSTER HAS SEVERELY CRACKED AND BROKEN.  THIS IS A SAFETY HAZARD IN THE EVENT OF AN ACCIDENT THE DASHBOARD PIECES BECOME SHARDS OF SHRAPNEL PROPELLED BY THE AIRBAG AND/OR IMPACT OF THE CRASH.  THERE HAVE BEEN NO WRECKS, MODIFICATIONS, OR ANY OTHER ACTIONS THAT WOULD CAUSE THIS DAMAGE - IT IS THE RESULT OF FAULTY PRODUCTION.",
        "vin": "1GKS1KE05DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SMALL CRACK APPEARED SUDDENLY IN TOP CENTER OF DASHBOARD THAT WAS BARELY NOTICEABLE FROM DRIVER'S SEAT BUT COULD BE SEEN IN THE PASSENGER'S SEAT. DIDN'T THINK MUCH AT THE TIME, BUT OVER THE COURSE OF JUST OVER A YEAR, THE CENTER OF THE DASH VIBRATES EXCESSIVELY WHEN DRIVING ON MAJORITY OF SURFACES THAT BECOMES VERY LOUD. CONTACTED GM SINCE MY STANDARD WARRANTY HAS EXPIRED AND THIS IS NOT COVERED UNDER MY EXTENDED WARRANTY DUE TO SAFETY CONCERNS WITH AIRBAG IN CASE OF ACCIDENT. I TOOK TO GET ESTIMATE OF COST TO REPAIR AND OWNER HAD SAME ISSUE WITH BOTH HIS GMC YUKON'S AND HIS WAS REPLACED FREE. ADVISED TO CALL GM FOR ISSUE, THEY ONLY WANTED TO COVER 1/2 THE COST OF REPAIR. THIS SHOULD BE A RECALL BY GM AS THIS IS AN APPARENT PROBLEM WITH THEIR VEHICLES AND NOT AN ISOLATED EVENT. NOT VERY HAPPY WITH THE SOLUTION I WAS PROVIDED AND WILL NOT BE OWNING ANY MORE GMC YUKON DENALI'S CONSIDERING IT IS NOT AN INEXPENSIVE VEHICLE.",
        "vin": "1GKS1MEF0DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKED AT CORNER OF PASSENGER AIRBAG. HAPPENED WHILE AT DEALER FOR STATE INSPECTION AND THEY REFUSED TO ACCEPT RESPONSIBILITY. CLAIM IT HAPPENS 'ALL THE TIME'.",
        "vin": "1GKS1EEF7DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "01/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD OVER INSTRUMENT PANEL AND AIR BAG LOCATION.",
        "vin": "1GKS2EEF7DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045791,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY GRANDCHILD STRAPPED IN HER CAR SEAT IN THE BACK SEAT OF MY YUKON. HOWEVER, AS WE MADE A STOP FOR ME TO REMOVE HER FROM THE CAR, I PULLED THE OUTSIDE DOOR HANDLE AND THE ENTIRE HANDLE CAME OFF FOR NO APPARENT REASON. THIS WAS ALARMING TO ME BECAUSE, WHAT IF THIS HAD BEEN AN EMERGENCY SITUATION AND I HAD TO IMMEDIATELY RESCUE HER FROM THE VEHICLE. WHEN I WENT TO THE DEALERSHIP THE SERVICE PERSON INFORMED ME THIS HAPPENS A LOT WHERE THE DOOR HANDLE BREAKS, AND IT APPEARS THEY WERE 'POSSIBLY ENGINEERED INAPPROPRIATELY'. THEY ASSURED ME THEY COULD FIX IT BUT IN ORDER TO DO SO, I MUST PAY THE DEDUCTIBLE. I REFUSED TO PAY ANY FEES SINCE THIS IS SOMETHING THAT HAPPENS WITH THESE VEHICLE FREQUENTLY AND REFUSED TO LET THEM FIX IT. I CALLED GMC AND THEY HAVE YET TO PROVIDE A RESOLUTION, WITH THE EXCEPTION OF SAYING I MUST PAY THE DEDUCTIBLE. MY HUSBAND ALSO HAS A YUKON 2004 AND ONE OF HIS DOOR HANDLES IS ALSO BROKEN. WE NEVER USE THE BACK PASSENGER DOORS, UNLESS THERE ARE SPECIAL CIRCUMSTANCES LIKE WITH MY GRANDCHILD. MY CONCERN IS WHY SHOULD THE CONSUMERS HAVE TO PAY THE COST FOR A FAULTY DOOR HANDLE BEING ENGINEERED INAPPROPRIATELY. I PRAY THAT SOMEONE DOES NOT GET TRAPPED INSIDE DURING A VEHICULAR ACCIDENT OR FIRE, BECAUSE THE DOOR HANDLES ARE NOT GUARANTEED TO OPEN AND WILL BREAK EASILY. I NEED TO KNOW IF IT IS ANYWAY GMC AND THEIR ENGINEERS CAN BE MADE TO DO THE NECESSARY REPAIRS AT NO CHARGE TO THE CONSUMERS AND CORRECT THEIR MISTAKE.",
        "vin": "1GKS1CE03DR"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 GMC YUKON. CONSUMER WRITES IN REGARDS TO DOOR HANDLE MALFUNCTION. *LD    THE CONSUMER STATED THE FAILURE PREVENTED THE DOOR FROM OPENING. UPDATED 10/31/2017*JS",
        "vin": "1GKS2MEF6DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH STARTED TO HAVE TWO CRACKS, ONE ON EACH SIDE OF DASH. EACH CRACK HAS CONTINUED TO RUN. THE ONE ON THE LEFT HAS NOW EXTENDED TO AREA OVER THE SPEEDOMETER DOME, THE OTHER CRACK HAS EXTENDED INTO THE SEAM OF THE AIRBAG ON THE RIGHT SIDE OF THE DASH.  VERY CONCERNED THAT AIRBAG COMPARTMENT IS COMPROMISED.  THESE CRACKS WERE NOT CAUSED BY ANY TYPE OF ACCIDENT. THE CAR SITS UNDER CARPORT 90% OF THE TIME.  MY RESEARCH SHOWS THAT THERE ARE THOUSANDS OF GMC OWNERS HAVING THE SAME ISSUE.  I AM WORRIED THAT MY SPOUSE, GRANDCHILDREN, OR ANY OTHER FRONT SEAT PASSENGER MAY BE SEVERLY INJURED.  THIS DANGEROUS FAULT NEEDS TO BE REPAIRED IMMEDIATELY!!!",
        "vin": "1GKS1EEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES ARE BRIDGESTONE DUELER H/L ALENZA 285/45R22 ON A 2013 GMC YUKON DENALI 2WD WITH APPROXIMATELY 53K MILES. WHILE WASHING VEHICLE TWO DAYS AGO (1 OCT 2017), I NOTICED CRACKS IN THE TIRE TREAD WHERE THE TREAD MEETS THE SIDE WALLS OF 3 OF THE 4 TIRES. THE CRACKS RUN AT RIGHT ANGLES TO EACH OTHER FORMING SMALL TRIANGLES OF TIRE TREAD THAT CAN BE NOTICEABLY DEPRESSED. THIS INDICATES A SERIOUS IMPENDING TIRE FAILURE OF THE SIDEWALL. ALTHOUGH THE TIRES HAVE AT LEAST 15K MILES (APPROX) OF TREADLIFE REMAINING, I AM FORCED TO REPLACE THEM NOW FOR THE SAFETY OF MY FAMILY AND OTHER DRIVERS.",
        "vin": "1GKS1EEF2DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD NEAR THE STEERING COLUMN JUST CRACKED AS WELL AS THE INTERIOR DRIVERSIDE FRONT DOOR.  BOTH PIECES APPEAR TO BE CHEAP PLASTIC.  I HAVE RECEIVED A QUOTE FOR $1600 TO FIX THE DOOR AND $1000 TO FIX THE DASH WHEN THESE ARE BOTH DEFECT FROM GM.",
        "vin": "1GKS2KE72DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2017",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS CRACKED AND IN THE EVENT OF AN AIRBAG DEPLOYMENT THE LOOSE DASH PIECES COULD COME LOOSE AND CAUSE ADDITIONAL INJURIES TO THE OCCUPANRS",
        "vin": "1GKS1CE09DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWO COMPLAINTS ABOUT THIS CAR.  1ST THE DASH HAS CRACKED STARTING AT THE LEFT REAR OF THE AIR BAG COVER TO THE REAR SEAM OF THE DASH. EVEN WITH A MAJOR GUARD PROTECTION PLAN 901770667 I'M BEING TOLD IT'S NOT COVERED.  THIS CAR IS ONLY 3 YEARS OLD AND 50,000 MILES AND I'VE LEARNED THAT THERE ARE MANY MORE CUSTOMERS OF GM VEHICLES WITH CRACKED DASHBOARDS. 2ND THE INSIDE DOOR HANDLE ON THE DRIVERS SIDE IS BROKEN. THE SMALL PIECES OF PLASTIC UNDER THE DOOR HANDLE ARE ALL BROKEN.  THIS TOO ISN'T COVERED I'M BEING TOLD.  THE DOOR HANDLE HAS BEEN CRACKED FOR OVER A YEAR . THE CRACK IN THE DASH JUST HAPPENED YESTERDAY ON 9/13/2017",
        "vin": "1GKS1CE07DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A CRACK FORMED FROM THE PASSENGER SIDE AIRBAG COMPARTMENT EXTENDING TO THE CENTER DASH VENT WITHOUT CAUSE OR INCIDENT. THE VEHICLE WAS STATIONARY PARKED IN MY GARAGE AT THE TIME THE CRACK OCCURRED. THE DASH NOW RATTLES AND SQUEAKS AND SAGS IN THE MIDDLE OF THE DASH.",
        "vin": "1GKS2MEF5DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE STRESS CRACKS IN A FAULTY DASHBOARD THAT HAS HAD NO BLUNT FORCE. THESE CRACKS ARE LOCATED AT THE INSTRUMENT CLUSTER, CENTER SPEAKER AND ANOTHER AT THE PASSENGER AIRBAG. BEHIND THE INSTRUMENT CLUSTER A PORTION OF THE DASH HAS COLLAPSED NOW. MY VEHICLE HAS BEEN GARAGED FOR MOST OF THE TIME SINCE PURCHASED. SINCE WE BOUGHT OUR NEW HOME IT HAS BEEN OUTSIDE FOR LESS THAN 4 MONTHS AND THE CRACKS APPEARED. I NOW HAVE 4 AND COLLAPSED AREA.",
        "vin": "1GKS1EEF2DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL SMALL CRACKS APPEARING ON THE VEHICLE'S DASHBOARD.  THESE CRACKS ARE AROUND THE PASSENGER SIDE AIRBAG.",
        "vin": "1GKS1CE03DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE OF DASHBOARD CRACKED WHICH HOUSES THE FRONT PASSENGER AIR BAG SYSTEM. DASHBOARD SHAKES VIOLENTLY WHEN BRAKES ARE APPLIED.",
        "vin": "1GKS1MEF3DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018868,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 YUKON DENALI XL HAS DEVELOPED A LARGE CRACK ON THE DASH ABOVE THE INSTRUMENT CLUSTER AND IT HAPPENED DURING NORMAL DRIVING CONDITIONS. THE ENTIRE DASH IS NOW VERY LOOSE FROM DRIVERS SIDE TO PASSENGERS SIDE AND IT VIBRATES VIOLENTLY WHEN BRAKING BOUNCING UP AND DOWN THE ENTIRE LENGTH OF THE DASH. IN ADDITION TO BEING QUITE LOUD AND OBNOXIOUS, IT IS UNNERVING TO THINK WHAT WILL HAPPEN IF I AM IN A COLLISION AS THE CRACK IS MAKING THE PLASTIC DASH BEGIN TO APPEAR LIKE A SPEAR TIP POINTED AT ME. TOTALLY UNACCEPTABLE IN A VEHICLE OF THIS CALIBER AND COST. AT LEAST THE WINDSHIELD IS DESIGNED TO BREAK INTO SMALL PIECES WITH TEMPERING...I WONDER IF GM SHOULD CONSIDER TEMPERING THE CHEAP PLASTIC THEY USE IN THEIR PREMIUM PRODUCT LINES SO THEY DON'T KILL SOMEONE WITH PLASTIC SHARDS OF JUNK PLASTIC.",
        "vin": "1GKS2MEF2DR"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKING DASHBOARD! DEEP CRACKS RUNNING UP TO AND ALONG THE AIRBAG",
        "vin": "1GKS1MEF5DR"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEATBELT WILL NOT LOCK.  THE DRIVER IS UNABLE TO WEAR A SEATBELT WHILE DRIVING.  THIS IS A HUGE SAFETY CONCERN FOR ME.",
        "vin": "1GKS1KE05DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON. THE CONTACT STATED THAT THE DASHBOARD WAS CRACKED ON THE FRONT DRIVER'S SIDE. THE DEALER WAS CONTACTED (DAYS CHEVROLET IN JASPER, GA) AND STATED THAT THERE WERE MANY COMPLAINTS ABOUT CRACKED DASHBOARDS. THE TECHNICIAN STATED THAT THE VEHICLE WAS OUT OF WARRANTY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 46,990.",
        "vin": "1GKS1CE0XDR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH WAS CRACKED AROUND AND ABOVE MY PASSENGER AIR BAG.  THE DEALER SAID THEY WONT FIX IT BECAUSE IT IS A COMMON PROBLEM.  IT IS A MAJOR SAFTEY HAZARD BECAUSE MY PASSENGER WILL GET PLASTIC IN THEIR FACE IF THE AIR BAG DEPLOYS. *JS",
        "vin": "1GKS2MEF0DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014925,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD CRACKING OVER PASSENGER AND DRIVER SIDE",
        "vin": "1GKS1EEFXDR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014937,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKED BY AIRBAG",
        "vin": "1GKS1EEFXDR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD",
        "vin": "1GKS1MEFXDR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE SECOND DASHBOARD CRACK ON 2013 YUKON DENALI. GMC WON'T REPAIR UNDER WARRANTY. HAVE HAD TO PAY TWICE NOW TO HAVE THIS REPAIRED. WE HAVE TWO FRIENDS WITH NEWER YUKONS WHO HAVE THE SAME PROBLEM, BUT SO FAR ONLY ONCE FOR THEM. OUR VEHICLE IS PARKED IN A GARAGE THE MAJORITY OF EACH AND NIGHT.",
        "vin": "1GKS1EEF4DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 4 YEAR OLD DENALI HAS A CRACKED DASHBOARD BY THE PASSENGER AIRBAG. THE DEALERSHIP TOLD ME THIS IS COMMON BUT GMC WILL NOT WARRANTY THE REPAIR. I AM CONCERNED THAT THE DASHBOARD WILL CUT PASSENGERS IF THE AIRBAG GOES OFF. THE CAR ONLY HAS 54000 MILES",
        "vin": "1GKSIEEF6DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004809,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IN OUR 2013  YUKON IS CRACKED AROUND THE AIRBAG AND POSES A SERIOUS CONCERN FOR SAFETY IN THE EVENT THAT AIRBAG IS DEPLOYED.  THIS PROBLEM IS UNDERSTOOD BY GENERAL MOTORS AND THE DEALERSHIP THAT CURRENTLY HAS POSSESSION OF OUR YUKON NEEDS TO REPAIR THIS  DASHBOARD UNDER WARRANTY  RATHER THAN PUTTING A DASH COVER OVER IT. MCELVEIN GMC IN SUMMERVILLE SC HAS THE YUKON CURRENTLY. 844-241-1281",
        "vin": "1GKS2EEF1DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE ONLY PERSONALLY OWNED OUR 2013 GMC YUKON DENALI SINCE OCTOBER 2016 AND LOOKED AT IT AS A LUXURY VEHICLE WHICH IS FAR FROM THE TRUTH. THIS VEHICLE ALWAYS HAS A UV PROTECTION VISOR UP WHEN NOT GARAGED AND THERE IS A HUGE CRACK ABOVE THE PASSENGER SIDE AIRBAG WHICH IS VERY CONCERNING. THIS IS NOT SAFE AND WITH FLIMSY INTERIOR LIKE THIS, GMC HAS NO BUSINESS CHARGING THE PRICES THAT THEY DO FOR THEIR CARS. THIS PROBLEM IS ALL OVER THE INTERNET AND WE EVEN BOUGHT INTO AN EXTENDED BUMPER TO BUMPER WARRANTY THAT THE DEALERSHIP IS SAYING WILL NOT COVER IT. THIS IS A HUGE SAFETY CONCERN FOR ME AND ITS UNFORTUNATE THAT GM'S INTERIOR IS CHEAPLY MADE AND THEY'RE NOT WILLING TO HONOR THEIR VEHICLES WHEN THEY FALL APART. I TRADED IN A DODGE RAM THAT HAD IMMACULATE INTERIOR THAT NEVER CRACKED AND NOW I'M STUCK WITH A VEHICLE THAT IS FALLING APART.",
        "vin": "1GKS1EEF5DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH HAS CRACKED AROUND THE PASSENGER SIDE DASH MOUNTED AIRBAG. THIS COULD CAUSE THE FRAGILE  PLASTIC TO ACT AS SHRAPNEL IF THE AIRBAG ACTIVATES. THE VEHICLE IS 4 YEARS OLD AND HAS 39000 MILES.",
        "vin": "1GKS2EEF0DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2013 DENALI WHICH WE PURCHASED NEW IN 2014 HAS HAD A CRACKED DASHBOARD ABOVE THE PASSENGER SIDE AIRBAG FOR MORE THAN A YEAR (~2 YEARS OLD). THE INTEGRITY OF THE DASH AND AIRBAG ARE PROBLEMATIC. THERE IS NO TANGIBLE SUPPORT UNDER THE DASH -- DEALERSHIP SAYS IT'S PLASTIC!!!  THE VEHICLE WAS NOT IN MOTION, JUST HAPPENED ONE DAY WHEN IT WAS PARKED IN THE DRIVEWAY. YESTERDAY THE OUTSIDE PASSENGER DOOR HANDLE BROKE OFF --- AGAIN, PLASTIC PARTS INSTEAD OF METAL. IF THERE WAS AN ACCIDENT, THAT PASSENGER MIGHT NOT HAVE AN AIRBAG PROPERLY DEPLOYED AND NOBODY COULD OPEN THAT DOOR FROM THE OUTSIDE TO RESCUE THEM!",
        "vin": "1GKS2EEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKING ABOVE GAGES AND BY AIR BAG. IT WAS MAKING A LOUD CRACKING SOUND WHILE IT WAS SPLITTING APART GOING DOWN THE ROAD.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK IN DASHBOARD CONNECTED TO AIR BAG AREA",
        "vin": "1GKS2MEF4DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD HAS MANY CRACKS AND HAS SEPARATED IN TWO LOCATIONS NEXT TO THE AIRBAG!  THE VEHICLE IS KEPT IN A GARAGE, WELL MAINTAINED WITH LESS THAN 60,000 MILES.  MY FEAR IS IF, THERE IS A FRONT-END COLLISION AND THE AIRBAGS DEPLOY, CHUNKS OF THE DASH WILL BECOME DISLODGED AND POSSIBLY CAUSE MORE INJURIES.",
        "vin": "1GKS2EEFXDR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "12/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD AROUND THE PASSENGER SIDE AIRBAG IS CRACKED AND THE PIECE OF THE DASHBOARD IS FALLING DOWN AWAY FROM THE AIRBAG.  I FEEL THAT THE AIRBAG HAS BEEN COMPROMISED BECAUSE OF THIS AND WORRY ABOUT PIECES OF THE BROKEN DASHBOARD FLYING INTO MINE OR MY CHILDREN'S FACES IF THE AIRBAG EVER HAS TO INFLATE.",
        "vin": "1GKS2EEF2DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TRADED IN A GMC HYBRID JUNE 2014 & PURCHASED A 2013 GMC YUKON XL 1500 SLT.  THE HYBRID I TRADED IN HAD A CRACKED DASH.  I JUST THOUGHT IT WAS A RARE THING THAT HAPPENED FOR WHATEVER REASON.  MY CURRENT YUKON ALSO NOW HAS A CRACKED DASH.  AFTER MINIMAL DIGGING, I HAVE FOUND THIS TO BE AN ISSUE IN THEIR VEHICLES MADE BETWEEN A CERTAIN NUMBER OF YEARS.  MY DASH CRACK IS AT MY AIRBAG.  #1, & MOST IMPORTANT, IS THE SAFETY OF MY PASSENGER.  #2 IS THE FACT THAT I PAID A HUGE AMOUNT FOR THIS VEHICLE.  ANY FLAWS OR ISSUES THAT ARE CAUSED BY THE MAKER SHOULD 100% BE COVERED AND REPAIRED.  I HAVE AN APPT. WITH THE DEALER.  LADY SAID DASH REPLACEMENT IS PROBABLY NOT COVERED AND COULD COST ME $500.00 TO REPAIR.  THIS IS NOT MY FAULT.  I FOUND WHERE ONLINE THAT MANY PEOPLE HAVE THIS SAME PROBLEM.  WHAT DO I NEED TO DO?  I AM UNABLE TO PROVIDE THE DATE IT HAPPENED.  I WENT TO CLEAN IT AND NOTICED IT WAS CRACKED.  TOOK IT INTO A LOCAL DEALERSHIP; AT THAT POINT IT WAS RECOMMENDED I GO TO THE DEALERSHIP I PURCHASED IT FROM.",
        "vin": "1GKS1KE07DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBORD SEPARATING DOWN THE CENTER. WHEN THE VEHICLE IS IN MOTION, THE DASHBOARD FLAPS. THIS IS A DEFAULT ISSUE WITH THE COMPANY. ALSO, CRACK ON THE LEFT SIDE PASSENGER AIRBAG. THIS IS A SERIOUS SAFETY CONCERN. IF THE AIRBAG DEPLOYS THE ENTIRE DASHBOARD WITH DISMANTLE CAUSING SERIOUS BODILY HARM.",
        "vin": "1GKS1EEF1DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "03/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEY ANDY    I HAVE A 2013 GMC YUKON DENALI XL. I GOT IT OCTOBER 2014, AND WILL HAVE OWNED IT THREE (3) YEARS THIS OCTOBER. AT ABOUT 40,000 MILES,  I DISCOVERED A CRACK ON MY DASH NEAR THE AIR BAG ON THE PASSENGER SIDE. THIS WAS ABOUT A YEAR AGO. I PUT IN A COMPLAINT AND THEY (GMC) TOLD ME TO TAKE MY TRUCK TO A LOCAL DEALER SHIP AND THEY WOULD SALE ME THE DASH AT COST, BUT I WOULD HAVE TO PAY FOR THE LABOR. THE TOTAL COST WOULD BE ABOUT $800.00. I TOLD THEM THE TRUCK IS JUST A FEW THOUSAND MILES OUT OF WARRANTY AND THIS SHOULD NOT BE MY RESPONSIBILITY TO REPAIR A MANUFACTURER'S DEFECT.  AFTER THOROUGH RESEARCH, I FOUND THERE ARE OTHERS THAT HAVE THE SAME PROBLEMS AS I.",
        "vin": "1GKS2MEF6DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2017",
        "dateOfIncident": "04/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984976,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKED NEAR PASSENGER SIDE AIRBAG. THIS OCCURRED WHILE VEHICLE WAS PARKED. SINCE THE CRACK OCCURRED, THE DASH NOW SHAKES AS THOUGH IT IS UNSUPPORTED IN THE CENTER WHILE DRIVING (EVEN ON ONLY MINIMALLY BUMPY ROADS). THE VEHICLE WAS BROUGHT TO THE DEALER WHILE STILL UNDER A BUMPER-TO-BUMPER GM CERTIFIED WARRANTY. THE DEALER REPORTED THAT THIS WOULD NOT BE COVERED FULLY UNDER WARRANTY (DESPITE THIS BEING A KNOWN MANUFACTURING DEFECT) AND TOLD ME I WOULD HAVE TO PAY $500 OUT OF POCKET TO HAVE THE DASH REPLACED. I AM CONCERNED THAT GIVEN THE PROXIMITY OF THE CRACK TO THE PASSENGER SIDE AIRBAG, DEPLOYMENT OF THE AIRBAG COULD RESULT IN FURTHER CRACKING OF THE COMPROMISED DASH. IN THIS VERY LIKELY SCENARIO, BROKEN BITS OF DASHBOARD COULD BECOME PROJECTILES AND RESULT IN SERIOUS INJURY TO PASSENGERS. GM IS WELL-AWARE OF THIS MANUFACTURING DEFECT AND HAS DONE NOTHING ABOUT IT TO PROTECT ITS CUSTOMERS.",
        "vin": "1GKS1MEF1DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "04/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS ON DASHBOARD.  MINE HAPPENS TO BE NEAR THE PASSENGER AIRBAG SLOT. THIS IS OCCURRING TO MANY SIMILAR GM VEHICLES.  DOING A WEB SEARCH SHOWS THOUSANDS OF PEOPLE HAVING THIS ISSUE.  THIS WAS NOTICED A FEW WEEKS AGO.  THE VEHICLE WAS PARKED WHEN IT WAS NOTICED.  I HAVE CONCERNS ABOUT THE SAFETY OF THIS.",
        "vin": "1GKS2MEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS CRACKED IN 2 LOCATIONS, ONE LOCATION IS WHERE THE AIRBAG IS IN THE DASH. IF AIRBAG DEPLOYED THE DASHBOARD WILL EXPLODE.",
        "vin": "1GKS2CE06DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASHBOARD HAS CRACKED OVER THE STEERING COLUMN. I UNDERSTAND THIS A FLAW IN THE DESIGN AND GM WILL NOT HONOR THE REPAIR OR REPLACE THE DASH.  I WOULD LIKE TO ISSUE A FORMAL COMPLAINT IN REGARDS TO THE STRUCTURAL INTEGRITY OF THIS PRODUCT.  A FORMAL INVESTIGATION SHOULD BE REQUIRED CONCERNING THIS DEFECT.  I HAVE RESEARCHED THIS ONLINE AND JOINED A GROUP OF APPROXIMATELY 6,000 OTHER PEOPLE ON FACEBOOK WHO HAVE SIMILAR PROBLEMS WITH THEIR DASHBOARDS.  M.  I HAVE ALSO TALKED TO DEALERSHIPS WHICH HAVE INFORMED ME THAT GM WOULD NOT HONOR THEIR DASH AND IF I REPLACED THE DASH THAT IT WOULD HAPPEN AGAIN DUE TO POOR DESIGN.  AGAIN, I WOULD LIKE TO REQUEST A FORMAL INVESTIGATION INTO WHY THIS DESIGN IS DEFECTIVE.  AS A CONSUMER, WE PAY A TREMENDOUS AMOUNT OF MONEY ON THESE VEHICLES AND EXPECT TO HAVE A QUALITY PRODUCT.",
        "vin": "1GKS2EEF2DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY OWNED A 2009 CHEVROLET TAHOE. WE BOUGHT IT WITH 45K MILES. ABOUT 60K MILES THE DASH BEGAN TO CRACK ABOVE THE SPEEDOMETER AND NEXT TO THE PASSENGER AIR BAG. I PAID A BODY SHOP TO REPLACE THE DASH AND THEN EVERYTHING WAS FINE. AFTER 130K MILES, THE CRACK ABOVE THE SPEEDOMETER BECAME VISIBLE. WE THEN TRADED IT IN AND NOW OWN A 2013 YUKON XL. I BOUGHT IT USED, UNDER WARRANTY AND IT NOW IT IS OUT OF WARRANTY WITH 55K MILES. OVER THE LAST 10K MILES, I HAVE SEEN MY DASH CRACK ABOVE THE SPEEDOMETER AND NEXT TO THE PASSENGER AIR BAG. THE SAME LOCATION AS THE TAHOE. I HAVE DONE SOME RESEARCH AND IT SEEMS TO BE A VERY COMMON OCCURRENCE IN 07-14 TAHOES/SILVERADO/SIERRA/YUKON/SUBURBANS. I ALSO WORK AT A LARGE GOVERNMENT AGENCY AND HAVE FOUND THIS HAS OCCURRED IN VEHICLES THAT WERE PURCHASED NEW BY MY AGENCY.  THIS MANUFACTURE DEFECT IS VERY CONCERNING. IF THE AIRBAGS WERE TO DEPLOY, THE DASH WOULD SHATTER AND CAUSE SERIOUS INJURIES. I CONTACTED GM AND WAS TOLD THERE IS NOTHING THAT CAN BE DONE. I WAS TOLD THERE ARE NO RECALLS AND TO MAKE A COMPLAINT TO YOU. IT WAS EXPLAINED TO ME THAT IF I BOUGHT THE CAR NEW, THEN MAYBE THERE WOULD BE SOMETHING THAT COULD BE DONE.  GM STATED THEY DO NOT KNOW WHAT THE PREVIOUS OWNER COULD HAVE DONE TO THE DASH. GM COULD NOT ELABORATE THIS CLAIM. I ASKED IF I PURCHASE A NEW DASH, INSTALLED BY GM AND THE DEFECT OCCURS AGAIN; WOULD THEY THEN REPLACE IT. GM STATED NO IF IT OUT OF WARRANTY. I AM WRITING TO YOU TO SHOW MY CONCERN FOR THIS DEFECT AND THE LACK OF CONCERN BY THE COMPANY DISTRIBUTING THESE PRODUCTS. I FIND IT UNETHICALL TO DISTRIBUTE A PRODUCT WHEN THEY KNOW THERE IS A KNOWN ISSUE. I HAVE ATTACHED PHOTOS OF MY VEHICLE AS IT IS NOW. I ALSO LOCATED A OLD PICTURE FROM OUR OLD VEHICLE. THIS VEHICLE IS GARAGE PARKED AND DRIVEN BY MY WIFE SO THERE IS NO ABUSE DONE. CAN SOMEONE REVIEW THIS AND CONTACT ME TO SEE WHAT CAN BE DONE?",
        "vin": "1GKS1KE08DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980240,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD. MY 2013 YUKON SLT (46,000 MILES) HAS A CRACK IN THE DASHBOARD DIRECTLY ABOVE THE AIRBAG STARTING AT THE UPPER LEFT CORNER THAT STRETCHES BETWEEN THE AIRBAG AND DEFROST VENTS. SO FAR THE CRACK IS THIN, HOWEVER IT WILL ONLY GET WORSE OVER TIME; IF YOU DO RESEARCH ONLINE THE OLDER MODELS 2008-9-10-11-12S HAVE SEVERE CRACKS AND HOLES IN THE DASH SO IT IS JUST A MATTER OF TIME. I HAVE DONE NOTHING TO CAUSE THIS CRACK AND I HAVE KEPT THE VEHICLE INSIDE A GARAGE AND/OR USE A SUNSHADE WHEN PARKED IN DIRECT SUNLIGHT. THIS IS A SAFETY ISSUE AND SHOULD BE RECALLED. IF I WERE TO BE INVOLVED IN AN ACCIDENT AND THE AIRBAG DEPLOY, SO WOULD SHARDS OF THE DASH AND BECOME SHRAPNEL. IT IS IMPERATIVE THAT GM RECALL ALL THESE FAULTY DASHBOARDS AND REPLACE FREE OF CHARGE.",
        "vin": "1GKS1CE08DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASH ON PASSENGER SIDE NEAR AIR BAG DEPLOYMENT LOCATION. HAPPENED OVERNIGHT WITH VEHICLE OFF AND IN GARAGE AND IN MODERATE TEMPERATURES.",
        "vin": "1GKS2MEF1DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRAKED DASH BOARD.  STATIONARY",
        "vin": "1GKS1CE07DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK ON THE DASHBOARD, VEHICLE WAS PARK, MOTOR IGNITION WAS OFF IN THE DRIVEWAY.",
        "vin": "1GKS1AE07DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "01/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKING ON THE INTERIOR DASH BOARD ABOVE AIRBAGS AND STEERING WHEEL. THIS HAS STARTED TO HAPPEN WITH NO SPECIFIC REASON OR ACCIDENT CAUSING IT.",
        "vin": "1GKS1MEFXDR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960336,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD IS CRACKED ON DRIVER AND PASSENGER SIDE",
        "vin": "1GKS2MEF9DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD IS CRACKED AT THE FRONT PASSENGER AIRBAG.  THE DASH HAS ALSO SEPARATED IN THE MIDDLE OF THE DASH BEHIND SPEAKER.  MAKES A HORRIBLE NOISE WHEN DRIVING OVER ROUGH ROADS.",
        "vin": "1GKS1MEF4DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "01/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946511,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKING IN TWO DIFFERENT PLACES. ONE IS UPPER LEFT SIDE OF AIRBAG ON PASSENGERS SIDE THE SECOND ONE IS RIGHT OF THE HUMP ON DRIVERS SIDE.",
        "vin": "1GKS2EEFXDR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD OF MY 2013 GMC YUKON XL IS CRACKED NEAR THE PASSENGER SIDE AIRBAG. I NOTICED ONLINE THAT THIS IS A COMMON COMPLAINT FOR THIS VEHICLE",
        "vin": "1GKS2KE74DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939868,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASHBOARD FROM THE PASSENGER SIDE TO THE DRIVERS SIDE INCLUDING THE AREA OVER THE GAUGES IS CRACKED AND SOME SECTIONS FELL IN UNDER THE DASH, LEAVING A HOLE.  MY CONCERN IS IF THE AIRBAG DEPLOYS, THE DASHBOARD WILL TURN INTO SHRAPNEL AND SERIOUSLY INJURE OR KILL THE OCCUPANTS.  *TR",
        "vin": "1GKS1KE03DR"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HYDRAULIC LIFTERS 'AFM' COLLAPSED, LIFTER WAS IN LOCKED POSITION CAUSING LIFTER TO TAP ON CAMSHAFT, BY TAPING ON CAMSHAFT CAUSED DE-LAMENTATION OF HARDENING ON CAMSHAFT, WHICH DAMAGED CAMSHAFT AND LIFTERS. THE ACCELERATION AND DE-ACCELERATION OF THE VEHICLE BECAME A MAJOR SAFETY ISSUE. THE VEHICLE WENT FROM V-8 MODE TO V-4 MODE, THIS ABRUPT REDUCTION IN SPEED WOULD HAPPEN AND DID HAPPEN WHILE DRIVING ON MAJOR ROADS IN THE CITY.  BECAUSE THE V-8 LIFTERS WOULD SHUT THE CYLINDERS OFF, V-8 MODE WOULD STAY IN LOCKED DOWN POSITION CAUSING VEHICLE TO ALMOST COME TO A COMPLETE STOP.  *TR",
        "vin": "1GKS2EE8DR2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS IN REFERENCE TO MY 2013 GMC YUKON DENALI.  SINCE PURCHASING THE VEHICLE IN DEC 2014 IT HAS BEEN IN THE REPAIR SHOP 3 TIMES FOR SHUTTING OFF WITHOUT WARNING WHILE DRIVING.  EACH TIME I HAVE BEEN ON THE INTERSTATE DRIVING AROUND 70 MPH AND THE VEHICLE SHUTS OFF.  THANK GOD NO ONE REAR ENDED ME AND I WAS ABLE TO PULL OVER TO THE SIDE OF THE ROAD.  THE FIRST TIME 28 MAY 14, THE PROBLEM WAS THE FUEL PUMP MODULE, BUT A MONTH LATER IT WAS DETERMINED IT WAS THE FUEL PUMP.  TODAY 28 DEC 16 THE FUEL PUMP IS BEING REPLACED AGAIN. SO WE HAVE REPLACED THE FUEL PUMP MODULE AND FUEL PUMP TWICE.  TRAVELING AT ANY SPEED AND YOUR VEHICLE SHUT OFF IS DANGEROUS.  I CONSIDER THIS A SAFETY HAZARD AND COULD LEAD TO SERIOUS INJURY OR DEATH.  *TR",
        "vin": "1GKS1EEF9DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 YUKON XL WAS FOUND TO HAVE EXCESSIVE RUST ON THE FRAME AND OTHER PARTS UNDERNEATH THE VEHICLE DURING AN ANNUAL INSPECTION. THE WAX COATING IF FLAKING OFF THE FRAME LEAVING BARE METAL THAT QUICKLY RUSTS. GM CLAIMS THAT THE DAMAGE IS ENVIRONMENTAL AND THE ISSUES IS THE SALT USED ON PA ROADS. IF THIS IS THE CASE, THEN GM SHOULD WARN ALL CUSTOMERS THAT THEIR VEHICLES ARE NOT BUILT TO LAST IN THE STATE OF PA AND THAT THEY WILL NOT HONOR THEIR WARRANTY. NONE OF OUR OTHER VEHICLES ARE RUSTING. THEIR ARE MANY OTHER PEOPLE COMPLAINING ABOUT THE SAME ISSUES AND THE PROBLEM HAS BEEN NOTED TO START DURING THE FIRST YEAR OF OWNERSHIP BEFORE GOING THROUGH THE WINTER. THEY HAVE NOT PROPERLY COATED THE FRAME TO WITHSTAND RUST. I HAD TO PAY FOR UNDERCOATING NOW TO RECTIFY THE PROBLEM. THE UNDERCOATING INSTALLER MENTIONED THIS IS A KNOW PROBLEM WITH GM TRUCKS AND THE COMPANY REFUSES TO ACKNOWLEDGE OR ADDRESS THE ISSUE.  *TR",
        "vin": "1GKS2KE79DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928732,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD AROUND AIRBAG AND ALL ACROSS DASH    VERY CONCERNED ABOUT PLASTIC PARTS OF DASH CAUSING INJURY OR DEATH DUE TO SHARP FLYING PIECES STRIKING PASSENGERS    2013 GMC YUKON XL DENALI MODEL GM WILL NOT REPAIR OR REPLACE THIS OBVIOUS AND DANGEROUS DEFECT",
        "vin": "1GKS2MEF7DR"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON DENALI. THE CONTACT STATED THAT THE DASHBOARD WAS CRACKED OVER THE PASSENGER SIDE AIR BAG. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 61,000.",
        "vin": "1GKS1EEF3DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKING",
        "vin": "1GKW2REG5DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH BOARD IS CRACKED AROUND THE AIRBAG LOCATION ON THE PASSENGER SIDE OF THE VEHICLE.  RESEARCHING THIS HAS SHOWN THAT IT'S A REOCCURRING DEFECT IN THE YUKON, SIERRA, SILVERADO, TAHOE AND SURBURBAN MODELS.  THERE ARE NUMEROUS REPORTS OF THE SAME ISSUE WITHOUT ANY CORRECTIVE ACTION BY THE MANUFACTURER SHORT OF A REPLACEMENT \"CASE BY CASE\" BASIS.",
        "vin": "1GKS1KE00DR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "09/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - FROM DAY TO DAY THE BACK HATCH WILL NOT OPEN. TOOK TO GMC DEALER AND COULD NOT FIND CODE WHY THIS IS HAPPENING. I DISCONNECTED BATTERY CABLE FOR 1 MINUTE AND RECONNECT AND WORKS FINE.",
        "vin": "1GKS2MEF8DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CRACK ABOVE THE INSTRUMENT PANEL ON THE DRIVER SIDE DASHBOARD. IT'S INCREASINGLY SPREADING AND I'VE SEEN THAT THIS IS NOT AN ISOLATED INCIDENT. THIS IS A MANUFACTURERS DEFECT AND I JUST WANTED TO MAKE MY COMPLIANT KNOWN. THE CRACK JUST SHOWED OUT OF NOWHERE WHEN I CRANKED THE CAR UP. WE USE A SUN VISOR TO AVOID THE SUN DIRECTLY HITTING HE DASHBOARD BUT THIS STILL HAPPENED.",
        "vin": "1GKS1CE07DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY YUKON DASHBOARD HAS A CRACK VERY NEAR THE PASSENGER AIRBAG.  MY GM DEALER TELLS ME THAT THIS IS NOT COVERED OR A RECALL.  I AM CONCERNED ABOUT THE LARGE EXPENSE OF $1,000 TO REPLACE AND THE POSSIBLE SAFETY TO AIRBAG ON THE PASS SIDE OF THE YUKON.  I AM ALSO BEING TOLD THAT MY EXTENDED WARRANTY COVERAGE WILL NOT COVER THIS ISSUE.  PLEASE HELP.",
        "vin": "1GKS1CE03DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS CRACK. LOOKS LIKE A VEHICLE WAS SOLD TO ME AND THEY FIXED THE CRACK BUT AFTER I BEEN DRIVING FOR 2 MONTHS THE CRACK IS THERE.",
        "vin": "1GKS1KE09DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898133,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKING NEAR AIRBAG, NOTICED IT THIS MORNING AFTER DROPPING KIDS AT SCHOOL. CAR IS GARAGE KEPT.",
        "vin": "1GKS1KE09DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "01/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED NEW, TWO, GMC YUKON DENALIS IN 2007, 2013. BOTH DASH BOARDS ARE CRACKING AND POSE A SERIOUS SAFETY DEFECT. I USE THESE VEHICLES FOR PLEASURE \"ON ROAD\" ONLY USE. MY DAUGHTER DRIVES THE 2007 TO COLLEGE NOW AND HER DASH BOARD IS CRACKED FROM THE DRIVERS SIDE TO THE PASSENGER SIDE AND FLAPS AROUND WHILE  DRIVING/OPERATING THE VEHICLE  DOWN THE ROAD, THIS IS A HUGH DISTRACTION. THE DEALER, THAT I PURCHASED THE TWO NEW VEHICLES FROM CLAIMS THAT IT IS NOT THERE PROBLEM AND BLAME GMC, WHO WILL NOT DO ANYTHING ABOUT THE ISSUE ON EITHER VEHICLE. I STILL OWN AND DRIVE BOTH VEHICLES TODAY AND AM BUILDING A CASE FOR WHEN SOMETHING SERIOUS HAPPENS BECAUSE OF THE LARGE DASH CRACKS FLAPPING AROUND CAUSE AN ACCIDENT. I WELCOME ANY ASSISTANCE FROM GMC OR MY GMC DEALER TO ADRESS THIS KNOWN DASH CRACKING ISSUE ANYTIME? I ALSO WELCOME NHTSA TO FURTHER INVESTIGATE THIS KNOWN ISSUE AND RESPOND BACK TO A SOLUTION OTHER THAN THE $1,000.00 DEALER SOLUTION FOR ME TO FIX THIS ON MY OWN. THANK YOU",
        "vin": "1GKS1EEF8DR"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON XL. WHILE DRIVING APPROXIMATELY 35 MPH IN THE RAIN, THE WINDSHIELD WIPERS SEIZED. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD TO WAIT FOR THE RAIN TO STOP. THE VEHICLE WAS TAKEN TO A LOCAL DEALER AND THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.  UPDATED 10/19/16*LJ  THE CONSUMER WAS INFORMED THERE WOULD BE NO CONSIDERATION BEYOND 36,000 MILES. UPDATED 10/25/16.*JB",
        "vin": "1GKS2KE73DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "06/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD  MY DASHBOARD SUDDENLY SUSTAINED A CRACKED DASHBOARD IN JUNE 2016. CRACK RUNS VERTICALLY ABOVE MY INSTRUMENT PANEL. THERE IS NO REASONABLE CAUSE FOR THIS CRACK. I DID NOT PLACE ANYTHING ON MY DASHBOARD. THE DASHBOARD NOW RADDLED WHEN I DRIVE, AND I WORRY ABOUT WHAT COULD HAPPEN TO THE DASHBOARD IF I WERE IN AN ACCIDENT. I WORRY THAT THE CRACKED DASHBOARD COULD BECOME A VERY SHARP OBJECT THAT COULD CAUSE MAJOR INJURY.",
        "vin": "1GKS1EEF4DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10877067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD SUDDENLY HAS CRACKS IN FRONT OF STEERING WHEEL.  THIS CONCERNS MY FAMILY & I'S SAFETY SHOULD THE AIRBAGS EVER NEED TO DEPLOY.",
        "vin": "IGKS1KE09DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASHBOARD",
        "vin": "1GKS1CE05DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2013 YUKON WITH CRACKS STARTING TO APPEAR ON DASH. PURCHASE THE VEHICLE IN 2014 WITH 23,000 MILES ON IT, IT'S NOW 2016 AND TRUCK IS NOW AT 51,000 MILES. TRUCK IS NOT USE OFF ROAD ONLY FOR TRAVELING NEEDS. CRACKS ARE STARTING TO APPEAR AT EYE SITE. I SEEN OTHER VIDEOS AND SEEN OTHER TRUCKS WITH THE SAME ISSUE AND IT LOOKS THAT IT GETS WORST DURING TIME. I PAY FOR A GOOD AMERICAN MADE TRUCK , I SHOULD NOT BE RESPONSIBLE TO FIX SOMETHING THAT'S HAPPENING TO EVERY TRUCK AMERICAN MADE YUKON,CHEVY,TAHOE, ECT.ECT. PLEASE HELP THE AMERICAN PEOPLE BE HAPPY AND THEY WILL STAY BUYING AMERICAN MADE CARS AND TRUCKS.",
        "vin": "1GKS1CE09DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS VEHICLE DEC 2014 USED,  SHORTLY AFTER WE PURCHASED IT, A CRACK STARTED  BY THE PASSENGER HAIR BAG IT IS GETTING WORSE I NOW HAVE 3 CRACKS SPREADING ACROSS MY DASH. WE PAID WAY TO MUCH MONEY FOR THIS VEHICLE TO HAVE THIS ISSUE ITS ONLY 3 YEARS OLD.  .",
        "vin": "1GKS2EEF5DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2016",
        "dateOfIncident": "08/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 YUKON DENALI HAS DEVELOPED CRACKS ON THE DASHBOARD. ONE IS LOCATED TO THE RIGHT OF THE HUMP OVER THE INSTRUMENT PANEL. THE CRACK STARTED AS A HALF INCH HAIR LINE CRACK AND HAS NOW TURNED INTO A EIGHT INCH LONG CRACK. SEEMS TO KEEP GROWING. THERE IS ANOTHER CRACK BY THE AIRBAG.  I HAVE ABOUT 77,000 MILES AND THE VEHICLE. IT IS WELL MAINTAINED AND CARED FOR, 99% OF TIME IS GARAGED. NO ABUSE OR OFF ROAD DRIVING. I HAVE CONTACTED THE DEALER AND GMC AND THEY WANT ME TO PAY TOO MUCH TO HAVE IT REPLACED.  IN MY WORLD THIS IS STILL A NEW VEHICLE AND AT A COST OF $60K THIS IS UNACCEPTABLE.  IT IS ALSO A SAFETY ISSUE THAT FLYING DEBRIS FROM THE DASH COULD FATALLY INJURE SOMEONE IF IN A VEHICLE ACCIDENT.",
        "vin": "1GKS1EEF3DR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "10/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE CRACKS ON DASH.",
        "vin": "1GKS1EEF8DR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK IN DASH IN FRONT OF STEERING WHEEL. MAY EFFECT SAFETY OF AIRBAGS WERE TO DEPLOY.  THE VEHICLE WAS STATIONARY. THE CRACK APPEARED WITHOUT ANY FORCE OR TRAUMA TO THE AREA.",
        "vin": "1GKS1KE01DR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "11/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON XL. WHILE THE VEHICLE WAS PARKED WITH THE IGNITION OFF, THE CONTACT HEARD AN ABNORMALLY LOUD POP EMIT FROM THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE THEN BEGAN TO ROLL AND CRASHED INTO A BRICK WALL. THE CONTACT STATED THAT THE FAILURE OCCURRED PREVIOUSLY, BUT SHE WAS ABLE TO GET BACK IN THE VEHICLE AND STOP IT BEFORE IT BEGAN TO ROLL. THE CONTACT STATED THAT THERE WAS DAMAGE TO THE FRONT END AND REAR OF THE VEHICLE DUE TO THE IMPACT OF THE TRAILER THAT WAS HITCHED TO THE REAR OF THE VEHICLE. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE, WHERE IT WAS AWAITING INSPECTION BY THE CONTACT'S INSURANCE COMPANY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1GKS2KE74DR"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 50 MILES PER HOUR AND HEARD A LOUD BONG, SOUNDING LIKE A BROKEN GUITAR STRING FOLLOWED BY EXACT SAME SOUND 1/2 MILE LATER, THEN TIRE WENT FLAT WITHIN A DISTANCE OF TWO MILES.",
        "vin": "1GKS2EEF2DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/28/2015",
        "dateOfIncident": "04/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 YUKON XL DENALI HAS DEVELOPED CRACK ON THE DASHBOARD. IT IS LOCATED TO THE RIGHT OF THE HUMP OVER THE INSTRUMENT PANEL. THE CRACK STARTED AS A HALF INCH HAIR LINE CRACK ABOUT 3 WEEKS AGO AND HAS NOW TURNED INTO A EIGHT INCH LONG CRACK. SEEMS TO KEEP GROWING.  I HAVE ABOUT 44,398 MILES AND THE VEHICLE. IT IS WELL MAINTAINED AND CARED FOR.  NO ABUSE OR OFF ROAD DRIVING.   I HAVE CONTACTED THE DEALER AND WAITING TO HEAR BACK.  IN MY WORLD THIS IS STILL A NEW VEHICLE AND AT A COST OF $60K THIS IS UNACCEPTABLE.  *TR",
        "vin": "1GKS2MEF4DR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671446,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LATELY I HAVE EXPERIENCED A LOUD POPPING OR CRACKING NOISE WHEN I AM DRIVING. MY AIRBAG LIGHT HAS ALSO BEEN ON. TODAY I NOTICED A VERY BIG CRACK ON THE DASHBOARD ABOVE THE INSTRUMENT PANEL.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "10/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10548784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC YUKON. THE CONTACT STATED THAT AFTER PARKING IN A RESIDENTIAL GARAGE, SHE WALKED AROUND TO REMOVE A SMALL CHILD FROM THE VEHICLE WHEN IT STARTED TO ROLL AWAY IN REVERSE. THE KEYS WERE NOT IN THE IGNITION AND THE VEHICLE WAS SECURED IN PARK. THE VEHICLE PROCEEDED TO ROLL AWAY UNTIL CRASHING INTO A FENCE. THE DRIVER'S SIDE DOOR WAS STILL OPEN AND WAS PUSHED UNTIL ABNORMALLY BENDING THE DOOR FORWARD. THE CONTACT SUSTAINED A BRUISED ANKLE WHEN THE DOOR SLAMMED INTO HER. THE CHILD WAS NOT INJURED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS NOT SURE WHAT CAUSED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 20,000.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/22/2013",
        "dateOfIncident": "05/22/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIPPED ON EXPOSED BOLTS. DEALER STATED THAT ALL OF THE GMC YUKON'S ON THE LOT WERE THE SAME.  *TR",
        "vin": ""
    }
]