[
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11120559,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/16/2018, I WAS DRIVING THE SUBJECT VEHICLE IN THE MOUNTAINS OF CENTRAL COLORADO ON HWY 50 JUST EAST OF GUNNISON, COLORADO GOING THROUGH MONARCH PASS. THE WEATHER WAS CLEAR THAT THE ROD WAS DRY. I WAS FULLY AWAKE AND SOBER (DO NOT DRINK). AT APPROXIMATELY 6:00 PM, AS I SLOWED MY APPROACHED TO THE TURN AT MONARCH PASS, MY VEHICLE STEERING BEGAN TO GYRATE FROM SIDE TO SIDE AT APPROXIMATELY 25 -30 MPH AS I SLOWED TO TAKE A CURVE. THE GYRATION CAUSED ME TO LOSE CONTROL OF THE MOTORCYCLE. I WAS  THROWN FROM THE MOTORCYCLE INTO THE SIDING AREA OF THE 2 LANE ROAD. THERE WERE NO REPORTED WITNESSES. I WAS KNOCKED UNCONSCIOUS AND REPORTEDLY WENT IN AND OUT OF CONSCIOUSNESS AT THE SCENE AND THROUGHOUT MY EMERGENCY TREATMENT AND TRANSPORTATION TO THE LOCAL HOSPITAL AND THEN BY EMERGENCY AIRCRAFT TO GRAND JUNCTION TRAUMA CENTER. FOR 3 WEEKS I SUFFERED MULTIPLE FRACTURED RIBS, A COLLAPSED LUNG, A CONCUSSION (WAS WEARING MY HELMET), AND A VARIETY OF BRUISES AND ABRASIONS FROM THE CRASH. I EXPERIENCED RETROGRADE AMNESIA, WHICH BLOCKED MY MEMORY OF THE ACCIDENT UNTIL THIS WEEK (8/16/18). I NOW REMEMBER THE VIOLENT GYRATION OF THE HANDLEBARS JUST BEFORE THE CRASH. I HAVE OVER 12 YEARS OF EXPERIENCE RIDING MOTORCYCLES AND WAS ON THE THIRD DAY OF RIDING IN THE ROCKY MOUNTAINS WITHOUT INCIDENT. THIS IS THE FIRST ACCIDENT I HAVE HAD SINCE I BEGAN MOTORCYCLE RIDING THE MOTORCYCLE WAS VIRTUALLY NEW (<5200 MILES) AND IN GOOD CONDITION FROM THE DEALERSHIP I BOUGHT IT FROM ON MAY 19, 2018. I AM SURE THAT THE STEERING OF THE MOTORCYCLE CAUSED ME TO LOSE CONTROL AND CRASH. THE MOTORCYCLE DID NOT SUSTAIN SERIOUS DAMAGE AND WAS RIDE-ABLE WHEN BROUGHT HOME THEN FOLLOWING WEEKEND. UP TO THAT TIME I HAD NO PROBLEMS WITH THE VEHICLE. I WANT TO REPORT THIS BECAUSE I AM CONVINCED SOMETHING WAS MECHANICALLY WRONG ON THE MOTORCYCLE THAT DAY. I MAY BE ABLE TO SAVE THE NEXT RIDER FROM THE SAME PROBLEM.",
        "vin": "1HD1FFM10DB"
    }
]