[
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/27/2013",
        "dateOfIncident": "08/27/2013",
        "fire": false,
        "manufacturer": "Gulf Stream Coach, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537658,
        "products": [
            {
                "manufacturer": "Gulf Stream Coach, Inc.",
                "productMake": "GULF STREAM",
                "productModel": "VISTA CRUISER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER CALLED ODI TO EXPRESS CONCERN THAT THE INDIVIDUAL TIRE RATINGS (OF 1870 LBS EACH TIRE; ONE PER SIDE) DOES NOT APPEAR TO  SUPPORT THE GVWR RATING OF 3980 LBS OF HIS SINGLE AXLE VEHICLE.  DISCUSSION SUGGESTED THAT THE GVWR LIKELY INCLUDES THE TONGUE WEIGHT ---I.E PORTION OF LOAD IMPOSED ON THE TOW VEHICLE THROUGH THE HITCH AND NOT IMPOSED ON THE TRAILERS TIRES.  OWNER IS CONSIDERING WEIGHING THE TRAILER RV TO OBTAIN ACTUAL VEHICLE WEIGHT.   UPDATED 12/3/13*CN",
        "vin": "1NL1DTH29E1"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/03/2012",
        "dateOfIncident": "08/04/2012",
        "fire": false,
        "manufacturer": "Gulf Stream Coach, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483230,
        "products": [
            {
                "manufacturer": "Gulf Stream Coach, Inc.",
                "productMake": "GULF STREAM",
                "productModel": "VISTA CRUISER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW VISA 2013 TT IN INDIANA NEAR FACTORY ON 7/13/2012. 2 WEEKS LATER HIT THE ROAD FOR PHOENIX TO GO TO WORKSITE.  BLEW OUT FIRST TIRE IN AMARILLO TX (OTHER TIRE WAS RIGHT BEHIND) HAD TO USE THE SPARE AND PURCHASE ANOTHER TIRE IN TX.  DEFECTIVE AXLE --WORE DOWN TIRES COMPLETELY DOWN TO THE THREADS-BOTH SIDES (UNEVEN WEAR).  FRIDGE STOPPED COOLING ON PROPANE ENROUTE AND COMPLETELY IN PHOENIX (NO BAFFLING WAS FOUND ACROSS TOP DEAD SPACE FOR INSULATION-FAN HAD TO BE ADDED.  AUG 26TH, AIR CONDITIONER STOPPED COOLING AND CAMPER NO LONGER LIVABLE/USABLE.  HAS BEEN IN SHOP SINCE. HAVE USED THIS TT TOTAL OF 4 WEEKS!  MY WHOLE LIFE HAS BEEN AFFECTED BY NOT HAVING THIS TT AVAILABLE FOR WORK/USE. COMPLETE LEMON AND LOST MY SAVINGS ON THIS JUNK. FOUR THOUSAND DOWN ON THIS TT WENT TO A SCUMBAG DEALER (OUTPOST RV) WHO CHARGED ME 1500 DOLLARS B/C I SLEPT ON TOP OF THIS CAMPER'S \"NEW BED\" OVER NIGHT ON HIS LOT. ENTIRE EXPERIENCE HAS DEAD-ENDED MY CAREER AS A TRAVELER, AND WIPED OUT MY SAVINGS. \"WARRANTY\" DOES NOT BEGIN TO COVER THE GRIEF/STRESS I EXPERIENCED ON THE ROAD BY MYSELF WITH A DOG, A CAT, AND WHAT'S LEFT OF MY WITS. STILL WAITING FOR HOUSING ON AN INDIAN RESERVATION WHILE VISA CAMPER CONTINUES WITH \"REPAIRS\"....I WILL NEVER TRUST GULFSTREAM OR OUT POST RV AGAIN IN THIS LIFETIME.  NO CLUE HOW THIS CAMPER WOULD CHANGE MY ENTIRE LIFE AS I KNEW IT ONLY A FEW SHORT MONTHS AGO. THIS ECONOMY SURE BRINGS OUT THE WORST IN PREDATORY SALES PEOPLE/MANUFACTURES. I ACTUALLY TRUSTED THEM TO 'TAKE CARE\" OF THEIR CUSTOMER; TO GIVE ME A DEPENDABLE AND SAFE PRODUCT...FOR THE MONEY I WORKED SO HARD FOR. EVEN THOUGHT I WAS DOING SOME GOOD INVESTING MY MONEY IN A DEPRESSED PART OF THE COUNTRY. DIDN'T REALIZE I WAS DEALING WITH SURVIVING MEMBERS OF THE BARNUM BAILEY CLAN...SUCKER Q MINUTE...YUP, I GUESS THAT WAS ME. HAHAHAHA....EXCUSE ME NOW WHILE I GO CRY MY EYES OUT NOW...THANKS.  *TR",
        "vin": "1NL1DTH2XD1"
    }
]