[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192400,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE OCCASIONS, AFTER THE MOTORCYCLE WAS NOT RIDDIN FOR SEVERAL MONTHS, THE REAR BRAKES STOPPED WORKING AFTER THE FIRST DEPRESSION OF THE BRAKE PEDAL. THE REAR BRAKE MASTER CYLINDER INTERNAL PISTON WOULD NOT RETURN TO ITS NORMAL POSITION AFTER RELEASING THE BRAKE PEDAL. FORTUNATLY I HAVE, ON ALL THREE OCCASIONS NEVER BEEN OUT OF MY DRIVEWAY BEFORE DISCOVERING THIS PROBLEM, AS I WAS ON EACH OCCASION JUST DONG A PRE TRIP CHECK OF THE MACHINE.   THE FIRST TIME THIS OCCURRED I TOOK THE MOTORCYCLE TO THE DEALER THAT I PURCHASED IT FROM. I WAS TOLD BY THEIR SERVICE DEPARTMENT THAT THEY COULD FIND NO PROBLEM. THEY TOLD ME THAT THEY ONLY ADDED BRAKE FLUID. THEY COULD NOT FIND ANY SIGNS OF LEAKAGES. I ALSO CHECKED FOR LEAKS BEFORE I TOOK IT TO THE DEALER. NONE WERE FOUND. IN THE FALL OF 2018 I WAS GOING TO TAKE THIS MOTORCYCLE FOR A RIDE. BEFORE I LEFT MY GARAGE, WHERE THE BIKE HAD BEEN PARKED FOR AT LEAST FOUR MONTHS, I ENCOUNTERS THE SAME PROBLEM WITH THE REAR BRAKES. THIS TIME I INSPECTED THE MASTER CYLINDER FLUID LEVEL MYSELF AND SAW THAT IT WAS FULL. I STRONGLY PUMPED THE REAR BRAKE FOR SEVERAL MINUTES UNTIL THE MASTER CYLINDER PISTON RETURNED TO ITS NORMAL POSITION AND I WAS ABLE TO FEEL THE BRAKES OPERATING PROPERLY. I RODE THE MOTORCYCLE APPROXIMATELY 20 MILES THAT DAY. LATER THAT DAY I RETURNED THE MOTORCYCLE TO MY GARAGE WHERE I REMAIND UNTOUCHED UNTIL A FEW WEEKS AGO. WHILE DOING A GENERAL CHEC OF THE MOTORCYCLE I FOUND THE SAME ISSUE. I HAVE TAKEN THE BIKE BACK TO A DIFFERENT DEALERSHIP AND EXPLAINED THE PROBLEMS TO THEM. THE MACHINE IS STILL UNDER THE EXTENDED WARRANTY. I AM AWAITING THEIR DIAGNOSIS AT THIS TIME.    I AM CONCERNED THAT THIS MAY BE AN ISSUE THAT MAY BE COMMON TO OTHER SIMILAR HARLEY DAVIDSON MODELS.",
        "vin": "1HD1MAM18DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "04/20/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615664,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING MY BRAND NEW 2013 HD TRI GLIDE I WAS SURPRISED TO FEEL THE HEAT THAT WAS PRODUCED BY THE ENGINE AND EXHAUST ON THE RIGHT SIDE OF THE BIKE. THE TEMPS OUTSIDE WERE ABOUT 80 DEGREES AND MY INNER RIGHT THIGH FELT AS THOUGH IT WAS ON FIRE. I CONTACTED THE DEALERSHIP, BOWLING GREEN HARLEY DAVIDSON, THE SERVICE DEPT RECOMMENDED THAT I HAVE THEM REMOVE THE CATALYTIC CONVERTER AS THIS WOULD HELP WITH SOME OF THE HEAT ISSUE. I PAID CASH FOR THIS TO BE DONE TO THE EMPLOYEE AS THEY SAID THIS WAS NOT A COMPANY PROCEDURE. THEY ALSO RECOMMENDED HIGHWAY PEGS ATTACHED TO THE FARING WHICH I HAD DONE. THIS WOULD ELEVATE MY LEG AWAY FROM THE HEAT. THE TEMPERATURE WAS BETTER AT 80 DEGREES AND UNDER BUT HERE IN KY IT'S OVER THAT MOST OF JUNE THROUGH MID SEPTEMBER. LAST SUMMER I RODE FROM KY TO CT OVER 2 DAYS THAT WERE 95-100 DEGREES AND HAD TO WEAR MY CHAPS AS MY LEG WAS HOT AND RED. HD HAS JUST KEPT TELLING ME THIS IS NORMAL FOR THE TRIKE. I ONLY FOUND OUT TODAY ABOUT BEING ABLE TO FILE A COMPLAINT OR I WOULD HAVE DONE IT SOONER. MY 8 YEAR OLD SON RIDES WITH ME AND EVEN THOUGH HIS FOOT PLACEMENT IS HIGHER HE COMPLAINS OF THE HEAT.  *TR",
        "vin": "1HD1MAM22DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "04/17/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10592290,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SLOW SPEED OR STOPPED THERE IS ETREME HEAT COMING FROM THE RIGHT SIDE OF THE ENGINE. IT IS SO HOT IT FEELS LIKE MY LEG IS BEING BURNED. ACCORDING TO THE DEALER THE ONLY FIX IS TO REPLACE THE EXHAUST SYSTEM WITH A SYSTEM WITHOUT THE CATALYTIC CONVERTER. THIS AT A COST OF CLOSE TO $2,000 ON A VEHICLE ALREADY COSTING $30,000.   THIS IS A SAFETY ISSUE.   *JS",
        "vin": "1HD1MAM1XDB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "08/30/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544560,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING USUALLY ON BUMPY STREETS I WOULD HEAR A FUNNY SQUEAKING. AFTER STOPPING AT MY DESTINATION I FOUND THAT THE BOLTS THAT HOLD THE ENGINE STABILIZER TO THE CYLINDER HEAD WERE LOOSE.  AFTER TIGHTENING THEM FOR ABOUT 5 TIME I BROUGHT IT BACK TO THE DEALER WHO INFORMED ME THAT THE HOLES IN THE HEAD ARE STRIPPED AND THEY WILL REPLACE UNDER WARRANTY. WELL 2 WEEKS LATER THE SOUND WAS BACK AND BOTH BOLTS WERE AGAIN LOSE. THIS SHOULD BE A SAFETY ISSUES SINCE IT SEEMS THAT THE ENGINE CAN SHIFT AND CAUSE SERIOUS DAMAGE IF THE STABILIZER ACCIDENTALLY CAME LOOSE. I HAVE READ ON A FEW FORUMS ON LINE THAT THIS IS A COMMON PROBLEM.    *TR",
        "vin": "1HD1MAM1XDB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "09/20/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544568,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREME HEAT COMING FROM EXHAUST SYSTEM WHICH RUNS VERY CLOSE TO MY RIGHT LEG.  NOT TOO NOTICEABLE WHILE RIDING AT HIGHWAYS SPEEDS BUT WHEN IN TRAFFIC OR AT TRAFFIC LIGHTS  IT BECOMES UNBEARABLE. WHEN I QUESTIONED THE DEALER ABOUT IT THEY SAID ITS NORMAL AND THIS IS THE WAY THEY RUN, BUT... I COULD DO SOMETHING ABOUT IT IF I SPEND OVER $2000.00 TO CHANGE OVER THE EXHAUST TO TAKE OUT THE CATALYTIC CONVERTERS. ITS OVER $30,000.00 FOR THIS BIKE WHY DO I HAVE TO SPEND MORE MONEY TO MAKE IT SAFE TO RIDE???  HARLEY DAVIDSON KNOWS THERE IS A PROBLEM BUT WONT FIX IT. I HAD A 2011 MODEL ALSO WITH THE SAME PROBLEM.  *TR",
        "vin": "1HD1MAM1XDB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "09/30/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541852,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCUTG",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HARLEY DAVIDSON TRIKE RIGHT SIDE MANIFOLD PRODUCES EXTREME HEAT.  WILL CAUSE BURNS AND HARLEY DAVIDSON IS AWARE OF THE PROBLEM. THEY WILL NOT REPLACE IT UNDER WARRANTY, IT IS AN AVERAGE OF $2,000 TO CORRECT THE DEFECT.  MUST REPLACE THE EXHAUST MANIFOLD, EXHAUST PIPES, AIR CLEANER AND RE PROGRAM TO BRING THE HEAT LEVEL DOWN A NORMAL LEVEL.",
        "vin": "1HD1MAM15DB"
    }
]