[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/26/2017",
        "dateOfIncident": "03/18/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968538,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTFB",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED INDICATOR LIGHTS ON THE MOTORCYCLE, THAT INDICATE EITHER YOU ARE TURNING LEFT AND ALSO THE INDICATOR FOR THE NEUTRAL POSITION HAVE BURNED OUT. HARLEY DAVIDSON WILL NOT REPLACE THIS STRIP OF LED LIGHTS, I HAVE QUESTIONED THE TECHNICIANS ABOUT THIS PROBLEM AND THEY HAVE INDICATED TO ME THAT THIS IS A COMMON PROBLEM ON THESE BIKES, THEY TOLD ME I HAVE TO PAY $150 TO REPLACE THEM WITH LABOR AND THAT IF I WOULD REPLACE THEM MYSELF THE WARRANTY WOULD BE NOT VALID. THIS PROBLEM IS VERY COMMON, HAVING SPOKEN TO OTHER HARLEY OWNERS. SINCE THE WARRANTY IS NOW EXPIRED. I HAVE TO PAY TO REPLACE IT. TWO TECHNICIANS FROM SPACE COAST HARLEY HAVE TOLD ME THAT THE LED'S WHERE OF CHEAP MANUFACTURERS AND THAT HARLEY HAS CHANGED SUPPLIERS. THIS PROBLEM IS DANGEROUS SINCE I CANNOT KNOW IF MY MOTORCYCLE IS NEUTRAL WHEN I COME TO A STOP. I HAVE TO GUESS. THIS PROBLEM HAS CAUSED ME TO HAVE AN ACCIDENT SINCE I COULD NOT KNOW IF I WAS IN NEUTRAL AND WHEN I ASSUMED I WAS, HAVING LET GO OF THE CLUTCH, THE MOTORCYCLE JUMPED AND ALMOST HIT THE CAR NEXT TO ME, THE MOTORCYCLE THEN LEANED AND FELL OVER ON ME., THANKFULLY I WAS ABLE TO RECOVER FROM THIS. I HAVE HEARD OF OTHER INDIVIDUALS THAT HAVE LOST CONTROL OF THEIR HARLEY'S BECAUSE OF THIS AND HAVE HAD MORE SERIOUS ACCIDENTS. PLEASE LOOK INTO THIS SINCE HARLEY DAVIDSON CORPORATION DOES NOT WANT TO OFFICIALLY RECOGNIZE THIS DANGEROUS PROBLEM. THE LED INDICATORS FOR TURNING SIGNALS AND THE NEUTRAL INDICATORS NOT WORKING ARE A SAFETY HAZARD.",
        "vin": "1HD1JNV11DB"
    }
]