[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "08/28/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733756,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHXI",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL ON MY 2013 HARLEY DAVIDSON MOTORCYCLE HAS AT TIMES LOCKED THE THROTTLE IN THE FULL OPEN POSITION AND AT OTHER TIMES IT HAS JUST COMPLETELY SHUT THE THROTTLE DOWN. IT HAS DONE THIS WITHOUT WARNING. THIS FIRST HAPPENED WHILE ON AN INTERSTATE AT APPROXIMATELY 73 MPH, THE THROTTLE WENT TO FULL OPEN. SINCE THEN I HAVE EXPERIENCE SITUATIONS WHERE THE THROTTLE JUST SHUTS COMPLETELY DOWN WHILE THE CRUISE CONTROL IS ENGAGED. OTHER TIMES IT IS IMPOSSIBLE TO EVEN GET THE CRUISE CONTROL TO RESPOND IN ANY MANNER. TWO DIFFERENT DEALERSHIPS HAVE LOOKED AT THIS BIKE AT SAY THEY CAN FIND NO PROBLEM. THERE IS A PROBLEM!  THIS PROBLEM/SITUATION IS AND/OR COULD BE AN EXTREMELY SERIOUS AND LIFE THREATENING PROBLEM/SITUATION GIVEN THE RIGHT CIRCUMSTANCES AND/OR IF THE WRONG PERSON WERE TO BE EXPOSED TO IT. THE LOCKING OF THE THROTTLE TO FULL OPEN AND/OR THE COMPLETE SHUTTING DOWN OF THE THROTTLE, EITHER ONE AT ANY GIVEN POINT UNDER ANY GIVEN TRAFFIC OR HIGHWAY SITUATION COULD LEAD TO EXTREMELY DANGEROUS AND LIFE THREATENING POSSIBILITY. THINKING THAT ONE OWNS A MOTORCYCLE WITH AN OPERATIONAL CRUISE CONTROL SYSTEM AND THEN FINDING OUT THAT THE SYSTEM IS LESS THAN TOTALLY FUNCTIONAL AND MAKING THAT DISCOVERY WHILE ON AN INTERSTATE HIGHWAY AT HIGHWAY SPEEDS WHILE IN TRAFFIC IS LESS THAN REASSURING. THIS PROBLEM NEEDS TO BE LOOKED INTO AND HARLEY DAVIDSON NEEDS TO ACCEPT RESPONSIBILITY FOR IT AND PROVIDE A REMEDY.",
        "vin": "1HD1KBM11DB"
    }
]