[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340250,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING ON A FLAT STATE ROAD (MD RT 124) I WENT TO USE THE FRONT BRAKE BY PULLING IN THE BRAKE LEVER AND IT SUDDENLY WENT ALL THE WAY TO THE THROTTLE/HAND GRIP. I THANKFULLY STILL HAD REAR BRAKE AND WAS ABLE TO SLOW DOWN AND STOP. UPON RELEASING THE LEVER AND PULLING IT AGAIN THE BRAKE PUMPED BACK UP. HOWEVER, ONCE RELEASED THE LEVER WENT RIGHT BACK TO THE THROTTLE AGAIN. SO ESSENTIALLY I HAD NO FUNCTION IN THE FRONT BRAKES. I SHUT OFF THE MOTORCYCLE, TURNED IGNITION SWITCH ON AND AS NORMAL THE ABS LIGHT STARTED TO FLASH. AS SOON AS I PUT THE MOTORCYCLE IN GEAR THE SYSTEM DID AN ELECTRONICS CHECK ON THE ABS BRAKE SYSTEM AND THE LIGHT WENT OUT. PROBLEM! I STILL HAD NO PRESSURE IN THE FRONT BRAKE LEVER SO AGAIN NO FRONT BRAKE WITHOUT PUMPING THE LEVER MULTIPLE TIMES AND HOLDING IT. ONCE RELEASED IT WENT RIGHT BACK TO THE THROTTLE AGAIN. I WAS VERY LUCKY I WAS NOT AT HIGHWAY SPEEDS OR GOING UP/DOWN HILLSIDE. I IMMEDIATELY TOOK THE MOTORCYCLE TO MY LOCAL H-D DEALERSHIP.  THEY EXPRESSED IT WAS A FAILURE OF THE ABS MODULE/PUMP. I CALLED HD CUSTOMER SERVICE AND FILED A COMPLAINT ABOUT WHAT HAD HAPPENED. STILL WAITING TO HEAR HOW THEY WILL RESOLVE THIS DANGEROUS SITUATION.   I SPOKE WITH ALEX WITH TECH SERVICES IN MILWAUKEE.",
        "vin": "1HD1KHM19DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/16/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10648181,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT AN ESTIMATED THIRTY MILES PER HOUR, THE FRONT (ANTI-LOCK) BRAKING SYSTEM ACTIVATED AND LOCKED, CAUSING THE MOTORCYCLE'S FRONT WHEEL TO SKID AND CAUSE A LOW SIDE FALL.  *TR",
        "vin": "1HD1KHM16DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610905,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRIEND OF MINE SENT THIS TO ME:  I MYSELF RIDE A HD 2013 ROADGLIDE CLASSIC:    CURRENTLY THIS IS JUST INFO WE KNOW ABOUT AND MAY BE SOMETHING YOU WOULD LIKE TO LOOK INTO:        I WAS TALKING WITH A GUY LAST NIGHT WITH A 13 ULTRA CLASSIC AND HE WAS TELLING ME ON HIS WAY TO DC (RIDE TO THE WALL) HIS BIKE STARTED LURCHING, DROPPED TO 1500 RPM AND HE BARELY MADE IT OF THE INTERSTATE.  THE HARLEY DEALER IN VIRGINIA FOUND THE ISSUE AND PULLED THE SAME PART OFF A 14 AFTER HD GAVE BOTH OF THEM THE RUN AROUND.  ON THE WAY HOME, IT DID IT TO HIM AGAIN OUTSIDE OF COMMERCE, GA.  APPARENTLY, THERE ARE 2 BIKES IN THE SHOP AT ROSWELL THAT HAVE THE SAME ISSUE.  THEY'VE BEEN IN PIECES FOR 6 WEEKS WAITING ON PARTS.  HD SAYS THEY ARE A NON-STOCKABLE PART WHICH TRANSLATES INTO WE HAVE ENOUGH TO MAKE OUR BIKES AND NONE TO SELL TO YOU.'  ACCORDING TO HD THERE ISN'T ENOUGH REPORTS TO WARRANT A RECALL.  WHAT I HAVE BEEN TOLD IS HD IS WELL AWARE OF THE ISSUES AND IS SPACING OUT THE RECALLS SO THEY DON'T LOOK LIKE GM.  THE LAST RECALL WAS A CLUTCH ISSUE AND THE CURRENT ONE IS THE BRAKE LINE PINCHING.  ACTUALLY, THE BRAKE LINE ISN'T PINCHING, IT'S WEARING THROUGH.    AND  THE DEALERSHIP IN VIRGINIA JUST REPLACED THE MODULE, BUT THE WIRING HARNESS CAUSED THE MODULE TO FAIL SOMEHOW.  THE GENTLEMAN SAID IT WASN'T A COMPLETE DEAD SHUT DOWN, BUT THE RPMS DROPPED AND THERE WAS NO THROTTLE RESPONSE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2014",
        "dateOfIncident": "03/13/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587245,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY, MY CHECK ENGINE AND BATTERY LIGHT CAME ON. I NOTICED MY VOLTAGE METER AT 11 VOLTS. I HAD THE BIKE TOWED TO THE HARLEY DEALER AND THEY REPLACED MY VOLTAGE REGULATOR. THIS WAS A BIG RECALL IN 2012 AND MANY OWNERS OF 2013 ARE REPORTING THE SAME ISSUE. I'M AFRAID ONCE MY WARRANTY RUNS OUT, ILL BE LIABLE FOR REPLACING IT AGAIN.  *TR",
        "vin": "1HD1KHM15DB"
    }
]