[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375052,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HARLEY-DAVIDSON FLTRU. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS ON A SLIGHTLY INCLINE HILL, THE CONTACT WENT TO DEPRESS THE FRONT HAND BRAKES HOWEVER IT FAILED TO OPERATE WITHOUT WARNING. WHEN THE CONTACT DEPRESSED THE FOOT BRAKE PEDAL AS THE MOTORCYCLE FELL OVER CAUSING DAMAGED FIBER GLASS ON THE REAR LEFT SIDE. THE MOTORCYCLE WAS INSPECTED AT HARLEY-DAVIDSON 25545 INTERSTATE 45, SPRING, TX 77380 (281) 681-0099 PRIOR TO THE FAILURE HOWEVER INDICATED THAT NO CODE WERE FAULTY AT THAT TIME. THE MOTORCYCLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "1HD1KGM1XDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321064,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST LEFT MY HOUSE AND AFTER A FEW MINUTES OF RIDING, I CAME UP TO A STOP, WHEN I ATTEMPTED TO SQUEEZE THE FRONT BRAKE LEVER, IT WAS FROZEN AND WOULD NOT BUDGE.  LUCKILY, I WAS NOT GOING FAST AND OR NEEDED AN \"EMERGENCY STOP,\" I WAS ABLE TO STOP WITH DOWNSHIFTING AND REAR BRAKE.  I COASTED BACK HOME SLOWLY WITH NO ADDITIONAL ISSUES OTHER THAN NO FRONT BRAKES.  THE FRONT BRAKE LEVER FROZE AND I WAS UNABLE TO SQUEEZE THE LEVER, CAUSING ME TO BRAKE WITH THE REAR (FOOT) BRAKE TO STOP.  I CONTACTED THE HARLEY DAVIDSON DEALERSHIP, EXPLAINED THE PROBLEM AND THEY SAID MY ABS \"ECU\" WAS BAD AND WOULD NEED TO BE REPLACED.  I ASKED HOW COULD I LOSE MY FRONT BRAKE AND IF THERE IS ANY WARNING, AND HE SAY, IT COULD BE WORKING FINE AND JUST FREEZE \"FROM ONE STOP LIGHT TO ANOTHER.\"  I ALWAYS THOUGHT THE ABS SYSTEM FAILURE WOULD CAUSE THE BRAKE TO WORK AS \"NORMAL\" NON-ABS BRAKE.  THE BIKE WAS TRANSPORTED BY THE H-D DEALERSHIP FOR DIAGNOSTICS AND REPAIR.  AS INDICATED BY THE SERVICE ADVISOR OVER THE PHONE CALL, THE ABS \"ECU\" WAS BAD AND WAS REPLACED, ALONG WITH NEW BRAKE FLUID AND BLEEDING OF THE LINE.  *TR",
        "vin": "1HD1KGM10DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/15/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11161708,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKE LEVER WAS FROZEN AND COULD NOT BE DEPRESSED. THE FRONT BRAKES DID NOT WORK. THIS HAPPENED WHEN IT WAS OPERATING OR STATIONARY. A LOSS OF THE BRAKING SYSTEM IS SERIOUS AND NEEDS TO BE INVESTIGATED.    VEHICLE WAS SERVICED (12/5/18) AT THE SPACE COAST HARLEY DEALERSHIP,  1440 SPORTSMAN LANE , PALM BAY FL 32905. THE BRAKING ABS HCU FAILED AND WAS REPLACED. THE MOTORCYCLE OPERATES PROPERLY NOW.",
        "vin": "1HD1KGM12DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "10/25/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039851,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES LOCKED UP WHILE DRIVING.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003185,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY HYDRAULIC CONTROL UNIT FOR THE ABS BRAKING SYSTEM. IT'S A VERY COMMON PROBLEM AS I HAVE DISCOVERED. IT CAN CAUSE THE LOSS OF EITHER FRONT, OR REAR BREAKS AT ANY TIME. I WAS IN THE DRIVEWAY AND COULDN'T APPLY MY FRONT BREAKS.",
        "vin": "1HD1KGM18DB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704345,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FIRST GOT THE BIKE I TRAILERED IT HOME AND BY THE TIME I GOT HOME THE REAR TIRE WAS FLAT, SO I TOLD IT TO BAKERSFIELD HARLEY DAVIDSON WHERE THEY TOLD ME IT JUST NEEDED TO BE AIRED UP..THAT WAS THE FIRST INCIDENT. THE SECOND INCIDENT I RODE IT HOME AND RIGHT WHEN I PULLED INTO THE DRIVE WAY THE REAR WENT FLAT ON ME AGAIN, AT THAT POINT I TOOK IT BACK AND THEY PULLED THE TIRE OFF AND RESET THE BEAT ON IT, THINKING THAT WHEEL WAS JUST NOT SEATING RIGHT ON THE RIM ITSELF. AFTER THAT THE BACK TIRE HELD AIR FOR A WHILE.  I RODE OUT TO BIKE NIGHT WITH MY FRIENDS AND ALL WAS OK UNTIL I LEFT TO GO HOME. I WAS RIDING DOWN MING AVE AND  CAME TO THE 99 FWY ENTRANCE AND WENT TO TURN LEFT AND AS SOON AS I DID THE BACK TIRE WENT FLAT INSTANTLY AND WASHED ME OUT IN FRONT OF A TRACTOR TRAILER AND  I MANAGED TO KEEP IT FROM GOING DOWN JUST IN TIME TO ALMOST GET HIT BY ANOTHER CAR AS IT WASHED OUT FROM UNDER ME AGAIN. I THEN RETURNED IT TO BAKERSFIELD HARLEY DAVIDSON WHERE THEY FINALLY BOOKED AT THE RIM ITSELF AND FOUND THE DEFECT. I WAS TOLD BY THEM THEY WOULDN'T GIVE ME A SOLD RIM AND TOLD ME I HAD TO KEEP THE SAME SPOKE RIMS ON MY BIKE EVEN THOUGH THEY KNEW OF A DEFECT AND AN ISSUE WITH THIS STYLE RIM.   IT WOULDN'T BE THAT BAD I DIDN'T HAVE 3 OTHER FRIENDS WHO HAD THE SAME WHEELS AND ALL HAD THE SAME ISSUE...REAR BACK HARLEY SMOOTH SPOKE WHEELS.. THERE'S A 2\" FLAT SPOT WHERE THEY WELD THE RIM TOGETHER AND THEY WON'T FIX THE ISSUE THEY WOULD RATHER HAVE SOMEONE GET HURT THEN COME OUT OF POCKET TO SAVE A LIFE.  *TR",
        "vin": "1HD1KGM31DB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/30/2015",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10702466,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING THE REAR WHEEL SUFFERED A FAILURE OF THE INNER SEAL THAT SEALS THE SPOKES AND CAUSED A COMPLETE FLAT ENTERING INTO A CORNER CAUSING ME TO LOSE CONTROL/SLIDING INTO. A. PARKING LOT. INSTICTIVLY I PUT MY LEG DOWN TO TRY TO CATCH MYSELF. CALLED FOR A TOW TRUCK TO COME PICK IT UP AND DELIVER TO DEALER.  DEALER CHECKED IT AND REPORTED BACK NOTHING WRONG JUST HAD A SEAL GO OUT R&R BY HD DEALER    PICKED IT UP FOLLOWING FRIDAY RODE IT HOME NO PROBLEMS 7 MILES NEXT MORNING LEFT FOR A LARGE GROUP RIDE FOR MOTORCYCLE AWARNESS MADE IT 22 MILES WHEN IT HAPPENED AGAIN. WAS ABLE TO PULL OVER SAFELY CALLED TRUCK AGAIN TOWED TO DEALER. THIS TIME I ASKED TO WITNESS DEMOUNT AND INSPECTION DEALER SAID AGAIN NOTHING WRONG UPON MY INSPECTION SAW THAT RUBBER SEAL WAS TORN LIME IT SPUN IN WHEEL ALONG WITH A MANUFACTURING. DEFAULT IN WELD AND FINISH. THE TIRE HAD DAMAGE TO BEAD AREA THAT RESEMBLED. MOUNTING DAMAGE WITH MOUNTING. DEALER REFUSED TO ADMIT THEY DAMAGED IT BUT THEY WERE ONLY PERSON TO WORK ON IT    BOUGHT A FACTORY MAG WHEEL AND DID NOT HAVE ANY ISSUES. UNTIL I WAS TIRED OF SEEING MISMATCHED WHEELS  I BOUGHT ANOTHER SET OF TAKE OFF WHEELS THAT MATCHED MY SPOKES   INTALLED OTHER SPOKE WHEELS RODE APPOX 100 MILES AND THEN FOR NO REASON REAR TIRE WENT FLAT. CALLED TOW TEUCK AGAIN AT DEALER NOW    I HAVE KNOWN PERSONALLY 3 PEOPLE WITH ISSUES WITH THIS SAME WHEEL. SOME ONE IS GOING TO BE HURT. OR KILLED THIS IS A HUGE SAFETY ISSUES THAT EVERYONE NEEDS TO KNOW ABOUT.       TUBELESS WHEELS HAVE A HUGE MANUFACTURE DEFECT DO SOMETHING PLEASE BEFORE SOMEONE DIES!!!!!  *TR",
        "vin": "1HD1KGM38DB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "01/18/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573615,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TIME I NOTICED THE \"HARLEY WOBBLE\" I WAS ON THE HIGHWAY DOING THE SPEED LIMIT. I TOOK MY HANDS OFF THE HANDLEBARS TO FIX MY GLOVES --  THE HANDLE BARS STARTED WOBBLING SIDE TO SIDE     WOW !!!   AFTER I GRABBED THE HANDLEBARS AND CALMED DOWN -  I TOOK IT TO MY LOCAL HARLEY DEALER    NO HELP    NOT SAYING MUCH   THEY TEST RODE IT-- NOTHING !    SAID MY TIRE PRESSURE WAS OFF   I TESTED IT ON THE WAY HOME   STILL THERE.  GAVE IT TO THEM A WEEK LATER   NOTHING    I'VE TESTED IT AT DIFFERENT SPEEDS   IT'S WORST AND COMES ON FASTER AT SLOW SPEEDS    HIGH SPEED TAKES TIME TO BUILD UP   IF YOU WANT MORE INFO  GOOGLE   \"HARLEY WOBBLE\"    I CAN FEEL IT THRU THE GLOVES  BUT TAKE YOUR HANDS OFF   EVEN FOR A SECOND   AND THERE IT IS.  *TR",
        "vin": "1HD1KGM33DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2014",
        "dateOfIncident": "07/08/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562544,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING AT A TRAFFIC LIGHT, THE ENGINE OVERHEATED AND AS SOON AS THE THROTTLE WAS APPLIED, THE MOTORCYCLE STALLED OUT.   USING AN INFRARED THERMOMETER, CYLINDER TEMPERATURES MEASURED 280 DEGREES IN THE FRONT CYLINDER AND 380 DEGREES IN THE REAR CYLINDER.  THIS MEASUREMENT WAS TAKEN WITH THE MOTORCYCLE NOT HAVING BEEN RIDDEN, JUST SITTING AND IDLING FOR 15 MINUTES.  THE HEAT IS DANGEROUS ON THIS MOTORCYCLE AND H-D'S RECOMMENDATIONS INVOLVE SPENDING HUNDREDS IF NOT THOUSANDS TO MAKE A BRAND NEW MOTORCYCLE COMFORTABLE AND SAFE TO RIDE.  THIS IS COMPLETELY UNACCEPTABLE.  THE HEAT REACHES UNBEARABLE LEVELS AND WHILE IT HASN'T HAPPENED TO ME, IT HAS BEEN NOTED BY RIDERS IN CALIFORNIA THAT ACTUAL BURNS AND CLOTHING CATCHING FIRE HAS HAPPENED.   THE EITMS (ENGINE IDLE TEMPERATURE MANAGEMENT SYSTEM) IS USELESS.  THIS MOTORCYCLE IS UNCOMFORTABLE AT BEST EVEN AT 60MPH DUE TO THE HEAT.  THE HEAT NOT ONLY AFFECTS THE DRIVER, BUT THE PASSENGER AS WELL.  *TR",
        "vin": "1HD1KGM16DB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/30/2013",
        "dateOfIncident": "08/30/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538143,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING RIDING THE MOTORCYCLE AT SPEED RANGING FROM 40-75 MPH, ANY DECELERATION OF THE THROTTLE CAUSES WOBBLE IN THE FRONT END STEERING.  THIS MOTORCYCLE IS 61 DAYS REGISTERED AND HAS 4,700 MILES DRIVEN.  I BROUGHT IT TO THE DEALER BECAUSE IT IS A DANGEROUS CONDITION REQUIRING STRENGTH TO MAINTAIN STRAIGHT AND LEVEL RIDING DURING THE WOBBLE.   THE DEALER FOUND THE STEERING STEM NUT LOOSE AND REQUIRED ADJUSTMENT WHICH MEANS IT REQUIRED RE-TORQUE TO A TIGHTER \"ADJUSTMENT\".  THIS IS A SAFETY ISSUE KNOWN TO HARLEY DAVIDSON AND HARLEY DAVIDSON CLAIMS IT IS A SERVICE ISSUE \"MAYBE\" CHECKED AT 1000 AND 5000 MILES.  IT IS NOT LISTED ON THE 1000 OR 5000 MILE SERVICE CHECKS PERFORMED BY HARLEY DAVIDSON DEALERS OR IN THE BOOKLET THEY PROVIDE.   HARLEY DAVIDSON ALSO CLAIMS THIS IS NOT A STANDARD WARRANTY ITEM AND CHARGES OWNERS FOR THE SERVICE TO FIX THIS CONDITION EVEN THOUGH IT IS A SAFETY ISSUE.  IF YOU ARE ALREADY AWARE IF THIS ISSUE PLEASE CONTACT ME.",
        "vin": "1HD1KGM1XDB"
    }
]