[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745667,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "2013 HEARTLAND 3610 RE 5TH WHEEL RV. OEM TIRES. POWER KING TOW MAX ST235/80R16 STR TIRES. CHECKED TIRE PRESSURES WITH TIRE GAUGE BEFORE TRIP. ALL AT 80 PSI COLD. INSTALLED TPS  SENSORS AND CHECKED MONITOR. WORKING. 6 MILES INTO TRIP AFTER PULLING OUT FROM A RED LIGHT AT AROUND 20 MPH THE REAR LEFT AXLE TIRE BLEW OUT THROWING PLASTIC TRIM PIECES ACROSS THE ROAD. TOP OF THREAD BLEW APART. REPLACED WITH SPARE TIRE. WENT ABOUT 23 MORE MILE AND RIGHT AFTER CHECKING TIRE PRESSURE MONITOR, FOR PRESSURE AND TEMP. BOTH OK. THE RIGHT FRONT AXLE TIRE BLEW OUT WHILE DRIVING 55 MPH, THROWING FENDER TRIM PIECES ACROSS THE ROAD. FOUND RIGHT SIDE REAR AXLE TIRE WITH PIECES OF THE TIRE BELT STRAINS STARTING TO COME THREW THREAD PART OF THE TIRE. DIDN'T BLOW OUT YET. HAD ALL FOUR TIRES REPLACED. KEPT ALL TIRES. NOW HAVE REPLACED THE SPARE. BOTH SIDES OF CAMPER WHEEL FENDER AREAS DAMAGE.",
        "vin": "5SFBG3628DE"
    },
    {
        "components": "STEERING,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650107,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING APPROXIMATELY 60 MPH ON ROUTE 78 WEST JUST OUTSIDE OF ALLENTOWN PENNSYLVANIA, THE LEFT REAR TIRE -POWER KING TOWMAX ST 235/80 R 16  LOAD RANGE (E) ON OUR HEARTLAND BIGHORN 3185 (2013) SUSTAINED A BLOWOUT CAUSING SEVERE DAMAGE TO THE LEFT REAR END OF OUR 5TH WHEEL TRAILER INCLUDING BUT NOT LIMITED TO COSMETIC DAMAGE (FENDERS ETC) REAR AXL DAMAGE, BRAKE DAMAGE, HYDRAULIC LINES, BRAKE LINES, UNDERCARRIAGE DAMAGE ETC.  THANKFULLY ALL PASSENGERS WERE UNHARMED AND NO OTHER VEHICLES WERE INVOLVED WITH THIS INCIDENT.  FURTHER INSPECTION OF THE TIRE SUGGESTS EITHER TREAD SEPARATION OR A SIDE WALL BLOWOUT THAT LEAD TO THE TREAD SEPARATION.  THE TREAD DID NOT TEAR OFF OF THE TIRE ALLOWING THE SEPARATED TREAD TO CAUSE THE EXTENSIVE DAMAGE AS PREVIOUSLY STATED. THE TRAILER WAS NOT OVERLOADED AND HAD WEIGHT EVENLY DISTRIBUTED.  TIRES WERE METICULOUSLY KEPT, AND PRESSURE WAS AT SUGGESTED 80 PSI.  *TR",
        "vin": "5SFBG3527DE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/15/2014",
        "dateOfIncident": "06/07/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598381,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED MY HEARTLAND BIGHORN 3670RL 5TH WHEEL NEW IN JANUARY 2013.  THE RV CAME STANDARD WITH POWER KING TOWMAX STR TIRES, ST235/80R16 LR \"E\".  MY FIRST BLOWOUT OCCURRED IN MAY 2014 WITH FEWER THAN 2000 MILES ON THE TIRES.  LUCKILY NO DAMAGE TO THE TRAILER.  SENT THE TIRE TO THE DISTRIBUTOR WHO CLAIMED THAT IT WAS A ROAD HAZARD ISSUE AND WOULD NOT WARRANTY THE TIRE.  I KNOW I HADN'T HIT ANYTHING IN THE ROAD TO HAVE CAUSED THE PROBLEM.  THEN TWO WEEKS AGO WE WERE RETURNING FROM A TRIP TO THE TEXAS HILL COUNTRY BACK TO THE HOUSTON AREA WHEN THE SECOND BLOWOUT OCCURRED.  BECAUSE I WAS ON A MAJOR FREEWAY (I-10) I LIMPED ALONG TO THE NEXT EXIT WHERE I WAS ABLE TO CHANGE THE TIRE.  AGAIN, NO SIGNIFICANT DAMAGE TO THE RV.  AFTER STOPPING FOR ABOUT 45 MINUTES THE NEXT BLOWOUT OCCURRED.  AGAIN I HAD TO LIMP OFF THE FREEWAY COMPLETELY RUINING THE ALUMINUM RIM.  LUCKILY I HAD CARRIED TWO SPARES AND WAS ABLE TO CHANGE IT AS WELL BEFORE HEADING INTO HOUSTON.  I STOPPED AT THE FIRST TIRE STORE I FOUND AND REPLACED ALL THE TOWMAX TIRES WITH CARLISE TRAILER TIRES AND MADE IT HOME.  THE LAST BLOWOUT COMPLETELY SEPARATED THE TREAD AND BROKE SEVERAL BRAKE WIRES AND SLIGHTLY DAMAGED THE FIBERGLASS FENDER COVER ON THE RV.  NO MAJOR DAMAGE TO THE RV OTHER THAN THE ALUMINUM RIM.  ALL OF THE TOWMAX TIRES ARE DOT 83B5 MANUFACTURED IN (1012) AND (1112).  I'VE ALWAYS BEEN VERY CAREFUL TO CHECK THE AIR PRESSURE ON ALL MY TIRES BEFORE LEAVING OR RETURNING FROM THE TRIP.  I MAINTAIN 80 PSI ON ALL TIRES PER THE LOAD RATING ON THE TIRE.  I ALSO MAINTAIN A SPEED OF 65 MPH OR LESS WHEN PULLING THE RV.   *JS",
        "vin": "5SFBG3620DE"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/04/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586457,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THIS CAMPER IN JANUARY OF  2013 FROM CAMPING WORLD OF CALERA ALABAMA ON WAY TO FLORIDA .WENT ON THEN BACK TO WISCONSIN. CAME TO FLORIDA AGAIN AND NOW ON WAY HOME AN HOUR IN TO TRIP THE TIRE BEGINS TO FAIL! LOOKS LIKE INNER CORDS FAILING. FORTUNATELY MY SON WAS FOLLOWING AND WARNED ME OF WHAT HE COULD SEE HAPPENING.CALLED SALES PEOPLE BUT WERE LEFT HANGING, CAN'T BELIEVE THESE TIRES DON'T LAST MORE THAN  4000 MILES AND NO ONE TAKES RESPONSIBILITY, SOMEONE COULD GET KILLED .  *TR",
        "vin": "5SFBG4124DE"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/22/2013",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556978,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 5TH WHEEL NOV 4, 2012 - EXPERIENCED OUR FIRST TIRE BUBBLE 12/10/2013; SECOND TIRE BUBBLE 12/19/2013. WE HAD BEEN ADVISED BY SEVERAL BIGHORN OWNERS THAT THEY REPLACED THEIR \"CHINA\" TIRES PRIOR TO HITTING THE ROAD, BUT CASUAL INSPECTION ON MY PART INDICATED THAT THE POWER KING TIRES INSTALLED WERE SUFFICIENT FOR THE APPLICATION - I WAS INCORRECT. THERE ARE NUMEROUS POSTS ONLINE THAT THESE TIRE MFG MISREPRESENT THEIR TIRE'S ADEQUACY. THE TIRE DEALER THAT REPLACED MY TIRES ( THEY ARE A DEALER AND INSTALL POWER KING ON SMALLER RIGS ) CONFIRM THAT THESE TIRES ARE OVERSTATING THEIR ABILITY TO CARRY THE RATED LOAD. FORTUNATELY OUR BUBBLES APPEARED ON THE EXTERIOR WALLS- WE DISCOVERED BOTH PRIOR TO DEPARTURES. APPARENTLY OTHER OWNERS HAVE NOT BEEN SO LUCKY AND HAVE SUFFERED MAJOR DAMAGE TO THEIR RIGS.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2013",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526223,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIGHORN",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "ON HIGHWAY RETURNING FROM CAMPING TRIP ABOUT 400 MILES ONE WAY TRIP.  TIRES OVERHEATED VERY BADLY-FELT SOFT-AND SMELLED LIKE RUBBER BURNING.  CHECKING DIFFERENT SOURCES ON-LINE REVEALED THAT TOMAX TIRES ON HEARTLAND RVS ARE A KNOW PROBLEM. MY GOOD FRIEND HAS A 2012 THAT THREE OF THE FOUR TIRES CAME APART ON THE ROAD AND CAUSED MAJOR DAMAGE TO HIS RV.  HE HAD TO BUY 4 NEW TIRES WHILE SITTING BESIDE I-95.  I ASKED HEARTLAND TO CHECK MINE.  THEY SENT ME TO TIRE KINGDOM (WHO SELLS THE TIRE) OF COURSE THEY SAID BECAUSE NOTHING HAD HAPPENED YET THEY COULD DO NOTHING.  I AM VERY CONCERNED.  IT HAS TO FAIL ON THE HIGHWAY AND PUT ME AND FAMILY IN SERIOUS DANGER BEFORE ANYTHING CAN BE DONE. AS I HAVE SAID THE FORUMS ON BOTH HEARTLAND AND OTHER RV SITES HAVE NUMEROUS EXAMPLES OF THIS TIRE FAILING IN A DRAMATIC FASHION.  I AM SUBMITTING THIS TO GO ON RECORD THAT WHEN THESE TIRES GO IT WAS RECORDED AND A KNOWN ISSUE. I JUST GOT BACK FROM ANOTHER TRIP OF ABOUT 500 MILES AND THE TIRES AGAIN GOT VERY HOT. I WAS NOT EVEN CLOSE TO MY GROSS WEIGHT AND I NEVER WENT OVER 65 MPH.  *TR",
        "vin": "5SFBG3829DE"
    }
]