[
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "02/10/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11034487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE ACCIDENT AIRBAG FRACTURED MY FOREHEAD IN 3 PLACES BROKE MY NOSE,L WAS HOSPITALIZED 2 DAYS",
        "vin": "JHMZF1D41DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "02/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA CR-Z. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) HOWEVER THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JHMZF1C62DS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2017",
        "dateOfIncident": "02/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957139,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 CRV DOES NOT START AFTER BEING PARKED O ERNIGHT, FOR AN HOUR, FOR A COUPLE OF HOURS, AND JUST TODAY FOR ABOUT 10 MINUTES. THIS HAS BEEN HAPPENING EVERY 2-3 WEEKS  STARTING NOVEMBER 2016. EACH TIME REQUIRES JUMPSTART AND ON TWO OCCASIONS TOOK IT TO AUTOZONE TO CHECK BATTERY LIFE AND EACH TIME HAVE BEEN TOLD THERE IS NOTHING WRONG WITH THE BATTERY. 2013 CRV WITH 25,700 MILES. ASIDE FROM DRIVING AROUND WITH JUMPER CABLES WHAT CAN I DO NOW THAT MY 3 YEAR WARRANTY IS DONE?",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE FIRST SAFETY RECALL LETTER WAS DISTRIBUTED IN MARCH.  THE DEALER WAS CONTACTED IN JUNE, AS PARTS WERE TO BE AVAILABLE IN SUMMER OF 2016.  THE DEALER STATED THAT I WOULD BE CALLED WHEN THE PARTS HAD ARRIVED.  I CALLED AGAIN IN AUGUST TO CHECK ON THE STATUS OF THE PARTS, ONLY TO DISCOVER THEY HAD NOT EVEN BEEN ORDERED.  I ORDERED THE PARTS AGAIN AND NOW MUST WAIT 'TWO WEEKS TO THREE MONTHS' FOR THE PARTS TO ARRIVE.  I FEEL THAT THE DEALER HAS FAILED TO REMEDY THIS LIFE-THREATENING DEFECT IN MY VEHICLE, WITHOUT CHARGE, WITHIN A REASONABLE TIME PERIOD (60 DAYS FROM FIRST CONTACT WITH THE DEALER FOR A REPAIR APPOINTMENT).  CONSIDERING THE SERIOUS NATURE OF THIS SAFETY RECALL, ANYTHING THAT CAN BE DONE TO EXPEDITE THIS PROCESS WOULD BE APPRECIATED.",
        "vin": "JHMZF1C66DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893676,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN WAITING AND WAITING FOR A RECALL STATUS UPDATE, HAS BEEN INCOMPLETE SINCE ABOUT APRIL 2016.",
        "vin": "JHMZF1D69DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893731,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I CONTACTED THE DEALER THE DAY AFTER I RECEIVED THE RECALL IN THE MAIL. MARCH 25 OF 2016. I STILL HAVE NOT RECEIVED A REPLACEMENT AIRBAG FOR MY VEHICLE.",
        "vin": "JHMZF1D6XDS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883541,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL , HONDA STATES THE PARTS ARE NOT AVAILABLE YET TO COMPLY WITH THE RECALL. I HAVE REQUESTED A LOANER VEHICLE FROM THE PHONE NUMBER PROVIDED 888-234-2138. THEY PREVIOUSLY TOOK MY INFORMATION AND SAID SOMEONE WOULD CONTACT ME. NO ONE HAS.",
        "vin": "JHMZF1C6XDS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860892,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-Z",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    LAST WEEK WE WERE NOTIFIED THAT OUR CAR HAS BEEN AFFECTED BY THE TAKATA AIR BAG RECALL.  UP UNTIL THAT TIME OUR VIN NUMBER WAS NOT LISTED AS HAVING BEEN AFFECTED.  AS OF THE END OF MARCH 2016, WE ARE TOLD IT NOW IS.    WE ARE NO LONGER ABLE TO DRIVE OUR VEHICLE AND HAVE BEEN GIVEN A LOANER CAR, FOR THE 'NEXT FEW MONTHS' WHILE OUR HONDA DEALER, HERE IN FLORIDA, GETS THE REPLACEMENT AIR BAG. WE ARE BEING TOLD THEY 'HOPE TO BE ABLE TO REPLACE THIS BY THE END OF THE SUMMER.'     WE ASKED, WHEN BEING TOLD WE MUST SIGN A LIABILITY WAIVER (IN ORDER TO GET THE LOANER CAR) ABOUT JUST TRADING IN THE CAR.  THE DEALER TOLD US, NO ' BECAUSE THEY COULD NOT SELL IT, REPAIR IT, AND DID NOT HAVE ROOM TO STORE IT ON THEIR LOT ' SO, IT IS NOW STORED IN OUR DRIVEWAY ' USELESS TO US, EVEN THOUGH WE ARE PAYING MONTHLY.    I HAVE SOME CONCERNS TOO OVER OUR 'FREE' RENTAL CAR REPLACEMENT.      OUR HONDA CRZ IS A HYBRID VEHICLE AND WITH OUR DRIVING WE AVERAGE 42.2 MILES PER GALLON.  HONDA IS USING ENTERPRISE CAR RENTAL FOR THE LOANER CARS.  ENTERPRISE DOES NOT CARRY HYBRID VEHICLES IN THIS MARKET (TAMPA BAY.)  THE 'COMPARABLE' REPLACEMENT VEHICLE WE WERE GIVEN IS A NISSAN SENTRA AND WE ARE GETTING ABOUT 28 MILES PER GALLON.      SO, WE GET 14.2 MILES LESS, PER GALLON, IN OUR DRIVING.  OUR 'FREE' CAR REPLACEMENT IS COSTING US ABOUT $100 A MONTH.  I MIGHT ADD TOO, THAT WE RECENTLY PLACED NEW TIRES ON OUR CRZ, FOR JUST UNDER $1,000.  NOW THOSE TIRES SIT, UNMOVED IN THE FLORIDA SUN FOR THE NEXT FEW MONTHS, PUTTING THEM AT A HIGH RISK OF DEVELOPING FLAT SPOTS AND US AT HAVING TO SPEND ANOTHER POTENTIAL $1,000!    IF THE CAR IS FIXED WHEN THEY THINK IT 'MIGHT' BE FIXED, WE WOULD HAVE SPENT OVER $400 IN ADDITIONAL FUEL COSTS ALONE, NOT TO MENTION OUR ADDED TIME ON ADDITIONAL TRIPS TO THE GAS STATION AND THE POTENTIAL LOSS OF THE FOUR NEW TIRES!",
        "vin": "JHMZF1D44DS"
    }
]