[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423192,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT. CONSUMER WRITES SEEKING REIMBURSEMENT REPAIRS RELATED TO FRONT DRIVE SHAFT ASSEMBLIES SAFETY RECALL.   THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REIMBURSEMENT OF THE VEHICLE'S SAFETY RECALL REPAIR.",
        "vin": "99999999999"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407683,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT. CONSUMER WRITES REGARDING A DEFECTIVE PAINT JOB. *LD    THE CONSUMER STATED THE VEHICLE HAD NOT TOP COAT THEREFORE, WILL BEGIN TO RUST.  *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405261,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA SENT ME A NOTICE OF THE FOLLOWING RECALL 20V-770. IT HAS BEEN TWO MONTHS AND THERE IS NO RESOLUTION TO THE ISSUE.  THE DRIVE SHAFTS ON MY CAR COULD FAIL. I CALLED HONDA AND THEY BASICALLY SAID THERE'S NOTHING THEY CAN DO AT THIS TIME, THAT I COULD TAKE IT TO A DEALER TO HAVE IT LOOKED AT, BUT IF SOMETHING WAS WRONG THEY COULDN'T FIX MY CAR. WHEN I ASKED ABOUT A RENTAL CAR IF THAT IS THE CASE, THEY SAID THAT THAT WASN'T IN THEIR POWER TO DO AT THIS TIME. I KNOW THAT THEY CAN DO THAT BECAUSE I ALSO WENT THROUGH THE AIR BAG RECALL AND WAS WITHOUT MY CAR FOR MONTHS WHILE THOSE PARTS CAME IT. AS FAR AS I AM CONCERNED, HONDA IS BEING NEGLIGENT BECAUSE THEY KNOW SOMETHING IS WRONG, THAT IT IS DANGEROUS, YET ALL THE CARS ARE STILL ON THE ROAD.  WHAT IF I CRASH BECAUSE OF THIS? WHAT IF I ACCIDENTALLY KILL SOMEONE OR DAMAGE SOMEONE'S PROPERTY?THIS IS GROSS NEGLIGENCE ON HONDA'S PART.  I WANT A SOLUTION NOW.",
        "vin": "JHMGE8G32DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403168,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2019 THE #3 SPARK PLUG CAME OUT OF CYLINDER HEAD WHILE DRIVING ON A TWO LANE ROADWAY. I HAD THE CAR REPAIRED (SEE ATTACHED REPAIR RECEIPT).  THE SAME THING HAPPENED TO THE SAME SPARK PLUG LAST WEEK (MARCH 7, 2021). AGAIN, THIS OCCURRED ON A TWO-LANE ROADWAY AT MODERATE SPEED.  THE CAR RAN ROUGH FOR A WEEK OR SO BEFOREHAND, AND  FUEL ECONOMY SUFFERED.  ON MARCH 7TH, THE CAR LOST POWER AND THE CHECK ENGINE LIGHT CAME ON. A FOUL SMELL FILLED THE CAR.  I BECAME DIZZY AND NAUSEOUS FROM EXHAUST FUMES ENTERING THE PASSENGER COMPARTMENT.",
        "vin": "JHMGE8G39DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395320,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER IN THE MAIL TODAY (2/8/21) THAT SAYS THERE IS A RECALL ON MY HONDA FIT FOR THE DRIVE SHAFT IN SALT-BELT STATES.  THE MANUFACTURER DOES NOT HAVE THE PARTS TO FIX THE PROBLEM YET - BUT SAID IN THE RECALL THAT THEY WOULD UPDATE THE RECALL BY 1/15/21. I HAVE NOT HEARD ANYTHING FROM HONDA. THEY HAVE NOT EVEN OFFERED TO INSPECT MY VEHICLE - WHICH IS CRAZY BECAUSE IF THE DRIVE SHAFT BREAKS I COULD CRASH AND BE KILLED. HONDA SHOULD OFFER ALL VEHICLE OWNERS A RENTAL CAR WHILE THEY ARE \"PREPARING REPLACEMENT PARTS\" SO WE ARE NOT DRIVING ON THE ROADS WITH A CAR THAT COULD KILL US OR OTHER PEOPLE. OR THEY SHOULD AT LEAST BE REQUIRED TO INSPECT THE VEHICLES DRAFT SHAFTS TO SEE IF THE CORROSION HAS TAKEN PLACE.",
        "vin": "JHMGE8G32DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383670,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL WARNING",
        "vin": "JHMGE8H38DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376468,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE CV SHAFT SHEARED UNDERNEATH VIBRATION DAMPENER. I WAS TRYING TO TAKE OFF FROM A STOP AT AN INTERSECTION AND THE SHAFT BROKE. I WAS ATTEMPTING TO MAKE A RIGHT HAND TURN ONTO A RURAL STATE ROUTE. THIS COULD HAVE BEEN QUITE BAD IF ANYONE WAS COMING. AFTER PUSHING THE CAR TO THE SIDE OF THE ROAD IT WOULDN'T STAY PUT IN PARK ALMOST LEADING TO IT ROLLING INTO ANOTHER VEHICLE WHILE I WAS HALFWAY OUT OF THE VEHICLE.    THE BREAK ALSO HAPPENED INSIDE THE VIBRATION DAMPENER SO IF THERE WERE ANY CLUES OF THIS PART STARTING TO FAIL THEY WERE HIDDEN AND WOULD HAVE BEEN ALMOST IMPOSSIBLE FOR A MECHANIC TO SPOT.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362025,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER AXLE BROKE WHEN I STEPPED ON THE GAS WHEN STOPLIGHT TURNED GREEN. HAD CAR TOWED TO DEALERSHIP FOR REPAIR. I FOUND THERE WAS  RECALL ON THIS FRONT AXLE FOR 2013 FIT MADE BETWEEN 5/24-7/5/13 FOR THIS FAILURE, BUT HONDA SAYS MY CAR HAD NO RECALL ON FILE SO IT WOULDN'T BE PART OF THIS RECALL. CAR ONLY HAS 59500 MILES. CUSTOMER SERVICE UNABLE TO TELL ME ACTUAL DATE MY CAR MFG AND THAT THEY ARE METICULOUS ON RECALLS. IF THEY'RE SO METICULOUS, WHY DID THEY PUT IMPROPERLY HEAT TREATED AXLES IN 3108 CARS? I SUSPECT MINE GOT MISSED IN THE RECALL. I HAVE THE BROKEN AXLE, WHICH I CAN TAKE TO A METALLURGIST IF NECESSARY.",
        "vin": "JHMGE8G39DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338338,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 5 MONTHS BOTH MY DRIVERS AND PASSENGER SIDE AXLE HAVE BROKEN ON MY 2013 HONDA FIT. BOTH TIMES WHEN I WENT TO ACCELERATE AFTER BEING STOPPED AT A TRAFFIC LIGHT THERE WAS A LOUD BANG AND THEN A CLICKING NOISE.",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE DRIVE SHAFT BROKE IN TWO PIECES WHILE ACCELERATING FROM A STOP GOING STRAIGHT ON A RESIDENTIAL STREET.  *TR",
        "vin": "JHMGE8G32DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317201,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A WIDE TURN GOING FORWARD ON A HIGHWAY. I COULDNT COMPLETE THE TURN SUCCESSFULLY BECAUSE THE ROAD WASNT WIDE ENOUGH, SO I STOPPED AND CHANGED GEARS TO REVERSE TO BACK UP. THAT IS WHEN THE AXLE BROKE. IT PROBABLY HAD THE MOST TORQUE ON IT AND PERHAPS I DIDNT GIVE IT ENOUGH TIME TO SHIFT FROM FORWARD TO REVERSE.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316220,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY FEBRUARY 28 MY RIGHT AXLE BROKE. IN HALF. I HAD TO HAVE IT TOWED AND WHEN THEY PUT THE CAR UP THEY BROUGHT ME THE BROKEN AXLE WHICH WAS ALL RUSTED. I CONSIDER THIS VERY DANGEROUS AND EVERYONE HAS TOLD ME THIS IS A VERY UNEXPECTED THING TO HAPPEN ON A 2013 CAR. I AM VERY DISAPPOINTED IN HONDA AND VERY CONCERNED ABOUT MY SAFETY IN THIS HAPPENING. THANKFULLY, THIS OCCURRED WHEN I WAS STATIONARY AT A LIGHT IN MY OWN TOWN. THE CAR SEEMED TO BE DRIVING NORMALLY AND I CAME TO A RED LIGHT AND BRAKED AS USUAL. WHEN THE LIGHT TURNED GREEN, I PRESSED THE GAS PEDAL AND NOTHING HAPPENS. THE CAR RACED AND THERE WAS CLICKING NOISE. THE CAR WAS IN THE LEFT LANE WHEN IT OCCURRED AND I NEED TO TAKE MY OWN SAFETY INTO MY HANDS BY RUNNING TO THE SIDE OF THE ROAD, NEEDING TO GET HELP TO PUSH THE VEHICLE TO THE SIDE FO THE ROAD.",
        "vin": "JHMGE8H58DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302609,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY SON WAS DRIVING THE CAR IN PORTLAND, OREGON, AT HIGHWAY SPEEDS THE ENGINE CUT OUT MAKING CONTROL OF THE VEHICLE VERY DIFFICULT. THE CAR WAS RETURNED TO THE HONDA DEALER WHERE THE PROBLEM WAS DIAGNOSED AS (MECHANICS REPORT) \"COMPRESSION GASKETS ON PLUG 1 & 2 ARE STUCK ON THE TOP THREADS, ALLOWING THE PLUGS TO BE TIGHTENED BUT COMPRESSION IS PASSING BY THE WASHER AND INTO THE SPARK PLUG TUBE.\" \"COILS ONE AND TWO HAD HEAT DAMAGE AND CARBON TRACKING.\" FOUR SPARK PLUGS REPLACED ALONG WITH COILS FOR PLUGS 1 & 2. THE CAR WOULD NOT ACCELERATE AND \"WAS IN LIMP MODE \" WHEN DRIVEN BACK TO THE HONDA DEALER. SPARK PLUGS ARE RARELY CHANGED THESE DAYS - APPEARS TO HAVE BEEN A FACTORY DEFECT. I'VE READ SIMILAR REPORTS LIKE THIS ON THE NHTSA WEB PAGE UNDER 2013 HONDA FIT ENGINE ISSUES. DANGEROUS AND LIFE THREATENING SITUATION WHEN ALL ENGINE POWER IS LOST WHILE DRIVING AT HIGHWAY SPEEDS (60MPH-65MPH). MILEAGE - 49,381.",
        "vin": "JHMGE8H55DC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE INSTALLED FROM FIRESTONE IN BILOXI 4 NEW BRIDGESTONE ECOPIA EP422 PLUS BL 175/65R15 DOT# V6TWEC 84H 70,000 MILE LIMITED WARRANTY TIRES ON OUR 2013 HONDA FIT NOVEMBER 30TH 2016 AT 38,715 MILES. IN DECEMBER 27TH 2019 WITH 70, 830 MILEAGE, WE TOOK IT TO THE FIRESTONE DEALER IN GULFPORT AS THE TPMS LIGHT WAS ON AND LEARNED THAT THE LEFT FRONT WAS LOW 10 POUNDS. THE NEXT MORNING THE LIGHT WAS ON AGAIN SO BACK TO THE DEALER TO LEARN THAT THE INSIDE FACING OF THE TIRE, NEAR AND PARALLEL TO THE RIM, HAD A 4\" LONG ROTTED SECTION THAT YOU COULD ALMOST PUT YOUR FINGERS THROUGH. WE WERE ADVISED THAT A NEW TIRE WAS IN ORDER. IN FURTHER INSPECTION OF THIS TIRE AFTER IT WAS OFF THE RIM, ONE COULD SEE THE NUMEROUS CRACKS THAT HAD DEVELOPED ABOUT AN INCH AWAY FROM THE RIM. NOW WE ARE WONDERING IF THE REST OF THE TIRES ARE IN JEOPARDY OF FAILURE. THE DATE STAMP ON THIS TIRE WAS 4915 (END OF NOVEMBER 2015)",
        "vin": "JHMGE8H35DC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290323,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 HONDA FIT HAS ONLY 76,000 ON IT.  WHILE DRIVING THE RADIO SHUT OFF, HEAD LIGHTS DIMMED, DASH BOARD LIGHTS FLICKERED AND I LOST POWER STEERING.  TOOK IT TO THE HONDA SERVICE STATION IN JASPER ALABAMA AND THEY COULD NOT FIND THE PROBLEM.  THE ENGINE LIGHT AND STEERING WHEEL WITH EXCLAMATION POINT SHOWED UP ON THE DASH BOARD.  CAR LOOSES POWER STEERING WHILE DRIVING FOR A FEW SECONDS AND THEN COMES BACK ON.  THIS IS VERY DANGEROUS.  WITH A VEHICLE WITH LESS THAN 80,000 MILES ON IT THIS SHOULD BE RECALLED AS I AM NOT THE ONLY ONE ON THIS FORUM TO HAVE A COMPLAINT ABOUT THIS EXACT ISSUE.",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD 70,000 MILES ON IT, STARTED SMELLING FUEL IN THE CABIN WHICH GAVE ME A HEADACHE WHILE AT A STOP/IDLE/LOW SPEED WITH RECIRCULATED HVAC OFF. READING SIMILAR COMPLAINTS ABOUT THIS ODOR IT SEEMS COMMON FOR HONDA FIT SPARK PLUGS TO LOOSEN AND BACK OUT. MECHANIC WAS CONTRACTED TO INSPECT AND REPLACE THE PLUGS AND DID NOT NEED A WRENCH TO REMOVE SPARK PLUG 2, IT WAS COVERED IN CARBON. REPLACING AND RE-TORQUING THE SPARK PLUGS CORRECTED THE ISSUE.    IF I WAS NOT PROACTIVE AND FOUND THIS SEEMINGLY COMMON PROBLEM IN THE FORUMS IT COULD HAVE LED TO A BLOWN OUT PLUG STRIPPING THE ENGINE HEAD AND CAUSED A STALL OUT CONDITION. THIS VEHICLE HAS NEVER HAD ENGINE WORK AND WAS 25,000 MILES FROM SPARK PLUG SERVICE, IT SHOULD NOT HAVE BEEN SO LOOSE. I AM NOT THE ONLY ONE THAT HAS HAD THIS ISSUE THAT COULD END IN SERIOUS ENGINE DAMAGE BASED ON POSTS I HAVE READ.",
        "vin": "JHMGE8H57DC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242413,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS RAINING.  I WAS ON THE HIGHWAY, CRUISE CONTROL SET AT 65 MPH. AT THIS POINT, THE ROAD CURVES TO THE RIGHT.  I HAD JUST GONE THROUGH A DIP IN THE ROAD AND I THINK I MAY HAVE BEEN HYDROPLANING.  THE VSA LIGHT CAME ON AND THE RIDE BECAME VERY CHOPPY.  I STARTED PUMPING THE BRAKES AND I TRIED TO STEER MY CAR TO STAY IN THE LANE BUT THE STEERING WHEEL LOCKED UP AND I COULDN'T MOVE IT.  I CONTINUED ON A STRAIGHT PATH EVEN THOUGH THE ROAD CURVED.  I WAS ON THE LEFT HAND SHOULDER, HEADING OFF THE ROAD COMPLETELY, STILL TRYING TO STEER TO THE RIGHT  WHEN THE VSA LIGHT ABRUPTLY TURNED OFF.  AT THIS POINT THE STEERING WHEEL SUDDENLY UNLOCKED AND I INADVERTENTLY PULLED IT HARD TO THE RIGHT; SENDING ME ACROSS 2 LANES OF TRAFFIC, ACROSS THE RIGHT HAND SHOULDER, OVER A SMALL CURB AND INTO THE DIRT/DESERT.  AS THIS WAS HAPPENING,  I WAS ABLE TO CORRECT MY STEERING BACK TO THE LEFT BUT NOT BEFORE I WAS COMPLETELY OFF THE RIGHT HAND SIDE OF THE ROAD AND HIT A SMALL HILL NEXT TO IT WITH THE RIGHT SIDE OF MY CAR.  AT THIS POINT, I MANAGED TO GET MY VEHICLE BACK ON THE RIGHT SHOULDER OF THE ROAD.    I TOOK MY CAR TO THE HONDA DEALER TO HAVE IT CHECKED.  THEY SAID MY TIRES WERE BALD WHICH CAUSED ME TO HYDROPLANE.  REGARDLESS OF THE CONDITION OF THE TIRES, WHEN THE VSA IS ENGAGED, I SHOULD STILL BE ABLE TO STEER THE CAR BUT I COULDN'T.  THE TECHNICIAN RAN THE DIAGNOSTIC TEST(S) AND SAID HE FOUND NOTHING WRONG.  SOMETHING IS DEFINITELY WRONG WHEN YOUR STEERING WHEEL LOCKS UP AT CLOSE TO 65 MPH WHEN A SAFETY FEATURE IS ENGAGED.",
        "vin": "JHMGE8G31DC"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11241804,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE VEHICLE HAD A SUDDEN ACCELERATION, WHILE DRIVING. THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO STOP THE VEHICLE. AS A RESULT, THE CONTACT CRASHED INTO ANOTHER WHICH BROUGHT THE VEHICLE TO A STOP. THE AIR BAG ON THE DRIVER'S SIDE DID NOT DEPLOY. THE CONTACT SUSTAINED CHEST INJURIES DUE TO COMING IN CONTACT WITH THE STEERING WHEEL. MEDICAL ATTENTION WAS NOT REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS FIXED, TRADED IN, AND SOLD. THE DEALER MARIN HONDA (2 SHORELINE PKWY, SAN RAFAEL, CA 94901 (415) 968-8479) REFERRED THE CONTACT TO THE MANUFACTURER. IT WAS UNKNOWN IF THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 59,000.",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11241897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  HONDA OF SEATTLE ALREADY REPLACED MY TAKATA AIRBAG. I WAS DRIVING AND HIT (T-BONED) ANOTHER VEHICLE THAT RAN A STOP SIGN. THE NEW AIRBAG SMOKED BUT DIDN'T INFLATE UNTIL AFTER I WAS OUT OF THE CAR. MY BODY HIT THE STEERING WHEEL, BRUISING MY CHEST AND STOMACH.  SEATTLE POLICE DEPT INCIDENT #19-283454",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "03/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A CURVY BACK ROAD.  HAD NO CONTROL OF STEERING.HIT AN EMBANKMENT AND ROLLED OVER.     TOTALED VEHICLE.",
        "vin": "JHMGE8H5XDC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT AXEL FRACTURED AND BROKE. FRACTURE WAS INSIDE BOOT AND THEREFORE COULDNT BE DETECTED IN ADVANCE WITHOUT REMOVING THE BOOT. THE VEHICLE PARKED OK. AND THEN WE RE-STARTED IT BUT IT COULDNT DELIVER ANY MOVEMENT TO THE WHEELS WHEN PLACED IN GEAR.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203349,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE RADIO, DASH LIGHTS, HEAD LIGHTS, AND POWER STEERING CUTS OUT FOR A MOMENT THEN COMES BACK ON.  THIS STARTED OCCASIONALLY 3 MONTHS AGO WITH JUST THE RADIO AND DASH LIGHTS AND HAS PROGRESSED TO SEVERAL TIMES IN A ROW AND NOW INCLUDES THE HEAD LIGHTS AND POWER STEERING.  THERE IS NO PREDICTABILITY TO WHEN OR HOW MANY TIMES IT WILL HAPPEN.  ONCE IT HAPPENED WHEN I WAS COMING OFF THE HIGHWAY GOING AROUND THE RAMP AT A GOOD SPEED, THE ELECTRICAL WENT OUT I LOST POWER STEERING AND ALMOST HIT THE GUARD RAIL IT CAME BACK ON JUST IN TIME FOR ME TO REGAIN CONTROL.       TOOK IT TO HONDA DEALER WITH MY COMPLAINTS; THEY DID A MULTI POINT INSPECTION AND CHECKED FAULTS-NO FAULTS STORED.  ALSO CHECKED WIRING AND CONNECTORS-ALL OK. TOLD ME IT WAS PROBABLY THE AFTER MARKET STARTER, I SHOULD BE FINE, TO CONTACT THE STARTER PEOPLE AS IT IS MOST LIKELY THEIR PRODUCT ISSUE AND NOT HONDA'S, THEN SENT ME HOME CHARGING ME OVER AN HOUR OF LABOR.        A FEW DAYS LATER IT CUT OUT 12 TIMES IN LESS THAN 3 MILE; I HAD TO FIND A GAS STATION TO PULL OVER IN AS I DID NOT FEEL SAFE DRIVING THE CAR.  TURNED IT OFF & LET IT SIT FOR A FEW MINUTES, STARTED IT AGAIN & HAD NO FURTHER ISSUES UNTIL THE FOLLOWING DAY WHEN IT HAPPENED ANOTHER 8 TIMES IN A ROW.  CONTACTED THE CAR STARTER COMPANY TOLD THEM WHAT WAS GOING ON; THEY REMOVED THE STARTER.  BUT TOLD ME HE LOOKED IT UP ONLINE & DISCOVERED THIS HAS HAPPENED TO OTHER HONDA FITS & IS MOST LIKELY RELATED TO A FAULTY ALTERNATOR. ANOTHER ISSUE RELATED WITH THIS ALTERNATOR PROBLEM IS DEAD BATTERIES WHICH HAS HAPPENED TO ME AS WELL & AM ON MY 3RD BATTERY WITH IN 6 YEARS! THE CAR STARTER GUY SAID HE WAS CONCERNED WITH MY SAFETY & TO HAVE IT LOOKED AT BY MY MECHANIC AND HAVE THEM LOOK AT THE ALTERNATOR.  WELL 2 DAYS LATER THE CHECK ENGINE LIGHT CAME ON & IS IN THE GARAGE TODAY; NOT THE HONDA DEALERSHIP",
        "vin": "JHMGE8G34DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11185435,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BUMPED INTO A RAISED MEDIAN AND THE AIRBAG CAME OUT AND THE WHEELS GOT STUCK IN THE MEDIAN. ON WHEELER ROAD. AT 10 TO 20 MPH. I HAVE AN AIRBAG RECALL BUT I HAVE TRIED CONTACTING YOU BY PHONE AND MAIL BUT IT WOULDN'T ACCEPT MY PHONE #. I GOT HUGE BRUISES AND SMOKE INHALATION FROM THE AIRBAG GOING OFF. IT SHOULDN'T HAVE. THE RADIO AND SEATBELT DOESN'T WORK EITHER GUESS IT AFFECTED THE ELECTRICAL SYSTEM. PLEASE HELP ME. THANK YOU, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183964,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WILL NOT ANSWER PHONE CALLS",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "11/30/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183122,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHEN THE VEHICLE WAS TAKEN TO A REPAIR SHOP TO HAVE THE TIRES REPLACED, THE MECHANIC STATED THAT THEY COULD NOT REPLACE OR BALANCE THE REAR TIRES BECAUSE THE REAR AXLE WAS BENT TO THE LEFT. THE MANUFACTURER HAD NOT RESPONDED AFTER THE CONTACT SENT THREE LETTERS. THE DEALER HAD NOT BEEN CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 41,100.",
        "vin": "JHMGE8H53DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "10/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163364,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO A FRIEND HAVING AN ISSUE WITH THEIR SAME YEAR/MODEL CAR, MY MOM BEING OVERLY CAUTIOUS, THANKFULLY BROUGHT HERS IN TO BE CHECKED.  THEY FOUND THE CAR HAD PREMATURE LOOSE PLUGS AND DAMAGED COILS.  REQUIRED REPLACEMENT OF 4 PLUGS AND 2 COILS. THIS HAPPENED AT ONLY 48,077 MILES.  IF SHE HAD NOT BROUGHT IT IN WHEN SHE DID, THIS COULD HAVE BEEN A SERIOUS AND DANGEROUS PROBLEM LIKE HER FRIEND WHO WAS ON THE HIGHWAY WHEN THEIR ENGINE WENT DUE TO THE SAME ISSUE WITH LOOSE PLUGS.  APPARENTLY THIS APPEARS TO BE A FACTORY DEFECT IN THIS MODEL.   THEY CHARGED HER $105 AND COVERED THE REST UNDER A \"GOODWILL\" WARRANTY BECAUSE SHE REFUSED TO PAY FOR THE DAMAGE.",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SOY COATING IS A RODENT GOURMET BUFFET!!  FIRST ISSUE WAS JUNE OF 2015, RODENTS HAD CHEWED THROUGH THE FUEL PUMP AND GASOLINE WAS LEAKING OUT.  MY 80 YEAR OLD MOTHER SMELLED GASOLINE WHEN HER CAR WAS PARKED IN THE DRIVEWAY.  THERE WAS A LARGE NEST FOUND AS WELL WHEN HONDA  INSPECTED THE CAR.  A FEW MONTHS LATER, OCTOBER 2015, NEST AND MICE DROPPINGS WERE FOUND IN POLLEN FILTER/GLOVE BOX AREA.  SHE BROUGHT IT BACK AND UPON THE DEALER RECOMMENDATION, HONDA WRAPPED ALL OF THE FUEL/VAPOR/ELECTICAL WIRES IN RODENT TAPE (WHICH THEY HAPPILY SUPPLY). THIS IS WHEN SHE WAS TOLD BY CUSTOMER SUPPORT THAT IT WAS A COMMON COMPLAINT/ISSUE DUE TO THE SOY AND WE STARTED RESEARCHING AND FOUND OUT ABOUT THE SOY COATING AND INDUSTRY WIDE PROBLEMS.  TOTAL COST TO MY MOTHER $1373.00 FOR THE FUEL PUMP REPAIRS AND RODENT TAPING. THE COMPANY TOLD HER TO USE \"WOLF URINE\" ON THE GROUND AROUND HER CAR!!  THAT WAS THEIR RECOMMENDATION...WOLF URINE. THEY TAKE NO RESPONSIBILITY.  SHE NOW DRIVES AROUND WITH MOUSE TRAPS ON THE FLOOR BOARDS, PEPPERMINT OIL SOAKED COTTON BALLS IN EVERY CORNER SHE CAN STICK THEM, HOT PEPPER WAX SPRAYED ON THE UNDERSIDE OF THE CAR, AND STILL WE GET MICE IN THE TRAPS.  WE HAVE LIVED IN THE COUNTRY ALL OF OUR LIVES AND MY MOTHER IS NOW 82 YEARS OLD.  NEVER HAVE WE HAD THIS HAPPEN TO ANY VEHICLE INCLUDING HER RV/CAMPERS  WHICH SAT UNUSED FOR 6 MONTHS AT A TIME FOR DECADES.  NEVER.  THEY DENY IT'S THE SOY.  WE KNOW IT'S THE SOY!!  WE WOULD LIKE A PUBLIC LISTING OF ALL VEHICLES/YEARS/MODELS THAT ARE NOW USING THIS SOY PRODUCTS.  IT IS VERY DIFFICULT TO NEARLY IMPOSSIBLE TO FIND THIS INFORMATION IN ONE PLACE.",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154745,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING MY HONDA, THE CAR INTERMITTENTLY LOSES ELECTRICAL POWER FOR ABOUT A SECOND.  WHEN THIS HAPPENS THE POWER STEERING IS DISABLED.  I FEAR LOSING CONTROL ESPECIALLY WHEN MAKING TURNS.   THE STEERING WILL LOCK UP. THIS HAPPENS LITERALLY DAILY AT THIS POINT.  DOESN'T MATTER IF I AM ON THE FREEWAY OR CITY STREET.",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151571,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOANED MY CAR TO A RELATIVE  FOR THREE DAYS AND WHEN IT WAS RETURNED I DETECTED A FUEL SMELL IN CABIN WHEN OUTSIDE AIR WAS SELECTED. ON THE HEATED. I AM A RETIRED AIRCRAFT MECHANIC AND KNOW MY WAY AROUND ENGINES. I DID AN INTERNET SEARCH AND FOUND A HONDA TECH LINE SUMMARY ARTICLE ATS 160714 VERSION 2 ( LOOSE AND BLOWN OUT SPARK PLUGS DUE TO FAILED FACTORY TORQUE). NUMBER TWO PLUG HAD A VIBRATION AND WAS LOOSE, CAUSING THE FUEL BLOW BY. THE SPARK PLUG COULD NOT HAVE BLOWN OUT DUE TO THE COIL HOLDING IT IN PLACE AND ENGINE PERFORMANCE WAS FINE WITH NO CODES.THE CAR HAS 38,000 MILES. THIS UNDETECTED FAILURE WOULD CAUSE THE PASSENGERS TO BREATH GAS FUMES FOR AN EXTENDED PERIOD  OF TIME. THE DEALER CLAIMS NO KNOWLEDGE OF THIS TECH SUMMARY.  VEHICLE SAFETY  HAS MADE GREAT ADVANCEMENTS IN MY LIFETIME THANKS TO YOUR AGENCY'S WORK , AND IT CAN IMPROVE WITH THE PUBLIC'S HELP. BREATHING GASOLINE IS A SERIOUS HAZARD . HEALTH RISKS LIKE THIS NEED TO BE ADDRESSED AS SERIOUSLY AS MECHANICAL ISSUES.",
        "vin": "JHMGE8H5XDC"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHILE DRIVING AT UNKNOWN SPEEDS AND MAKING A LEFT TURN, THE ACCELERATOR PEDAL WAS APPLIED, BUT FAILED TO ENGAGE. THE VEHICLE STALLED AND AN ABNORMAL BANGING NOISE WAS HEARD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND WAS INFORMED THAT THE AXLE WAS RUSTY AND FRACTURED. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910375,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER REQUESTS REIMBURSEMENT FOR RENTAL VEHICLE WHILE AIRBAG INFLATOR RECALL REPLACEMENT PARTS BECAME AVAILABLE AND REPAIRS COMPLETED.  *SMD *TR",
        "vin": "JHMGE8H52DC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076300,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL! MY HONDA FIT 2013 HAS IS ONLY AT 40K MILES AND ITS ALREADY FAILING AT KEEPING ME SAFE. THE ESC LIGHT COMES ON RANDOMLY FOR NO REASON AT ANY GIVEN TIME. I KNOW THAT SOME MODELS HAVE A RECALL FOR THAT EXACT PROBLEM AND I'M AFRAID THAT HONDA DIDN'T FIX THE PROBLEM CORRECTLY. I KNOW THAT IT PUTS MY LIFE AT RISK BECAUSE MY CAR DOESN'T HAVE COMPLETE CONTROL EVEN WHEN I'M JUST DRIVING STRAIGHT AND UNDER 30 MPH. MY CAR NO LONGER FEELS SAFE, I KNOW THAT THAT FEATURE IS THERE TO HELP ME HAVE CONTROL AT ALL TIMES, BUT IT'S NOT WORKING AND I DON'T KNOW WHAT TO DO. WHENEVER THAT LIGHT COMES ON I FEEL MY CAR LOSER FOR SOME REASON, IT'S NOT AS STURDY AS USUAL. I HOPE THAT SOMEBODY CAN FIND OUT WHAT'S WRONG THUS BE ABLE TO HELP ME FIND A SOLUTION AND FEEL SAFE AGAIN.   THANKS!",
        "vin": "JHMGE8H69DC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073053,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHILE DRIVING 5 MPH IN REVERSE, THE CONTACT INADVERTENTLY DEPRESSED THE ACCELERATOR PEDAL INSTEAD OF THE BRAKE PEDAL. THE CONTACT LOST CONTROL OF THE VEHICLE AND IT WAS UNABLE TO BE STOPPED. THE VEHICLE SLID ACROSS THE STREET AND WENT THROUGH A NEIGHBOR'S BACK YARD FENCE BEFORE LANDING ON A SNOW EMBANKMENT. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE THE FAILURE. THE VEHICLE WAS TOWED TO IDE HONDA (875 PANORAMA TRAIL S, ROCHESTER, NY 14625, (585) 586-2820) FOR DIAGNOSTIC TESTING AND REPAIRS. THE VEHICLE WAS NOT DIAGNOSED, BUT HONDA INFORMED THE CONTACT THAT NO FAILURES WERE FOUND. IT WAS UNKNOWN IF A POLICE REPORT WAS FILED OR IF THERE WERE ANY INJURIES REPORTED. THE FAILURE MILEAGE WAS 49,000.",
        "vin": "JHMGE8H58DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072843,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE WARNING INDICATORS ILLUMINATED FOR THE ELECTRONIC STABILITY CONTROL, TRACTION, AND BRAKE LIGHTS. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE VSA MODULE FAILED TO FUNCTION AND NEEDED TO BE REPLACED. IN ADDITION, THE BATTERY CONTINUED TO HAVE A LOW VOLTAGE AND WAS REPLACED; HOWEVER, THE CONTACT WAS UNCERTAIN IF THE FAILURE WOULD RECUR. THE MANUFACTURER WAS NOTIFIED AND INDICATED THAT THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS FOR THE ELECTRICAL SYSTEM. THE CONTACT WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 13V157000 (ELECTRONIC STABILITY CONTROL). THE APPROXIMATE FAILURE MILEAGE WAS 32,300.",
        "vin": "JHMGE8G33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043091,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENT AIRBAG DEPORT ON STOP SIGN AND REPLACED BY LOCAL DEAL BUT NO RECALL WAS CALL OR  MADE FOR THIS CAR",
        "vin": "JHIMGE8H30D"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003131,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE HONDA OF SERRAMONTE DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY UNTIL SEPTEMBER. ON THREE OTHER OCCASIONS, THE CONTACT ATTEMPTED TO HAVE THE RECALL REPAIR COMPLETED WITH SIMILAR EXCUSES AS TO WHY THEY COULD NOT COMPLETE THE REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002654,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUESTED AIRBAG FIX AT DEALERSHIP WERE BOUGHT, WAS TOLD THAT THEY WOULD CALL ME BECAUSE THE AIRBAG NUMBER MUST BE MATCHED TO THE HONDA 2013 FIT. NEVER CALLED. ASKED AGAIN AND WAS IGNORED.",
        "vin": "JHMGE8H5XDC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001976,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUGS BLEW OUT THEY WERE NOT TORQUED CORRECTLY. HONDA KNOWS AND HAS KNOWN ABOUT THIS PROBLEM SINCE AT LEAST JULY OF 2016 (ACCORDING THE THEIR TECHNICAL SERVICE BULLETINS  . HONDA HAS NOT EVEN SENT OUT LETTERS TO CUSTOMERS THAT HAVE THESE 2013 HONDA FITS. I LEASED THE CAR IN APRIL OF 2014 IN JANUARY 2017 WHILE DRIVING ON THE FREEWAY IT SUDDENLY WOULD NOT ACCELERATE AND I WAS ALMOST HIT BY A SEMI.  THIS IS A SAFETY ISSUE",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000621,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DIES.  HAD IT PROFESSIONALLY RECHARGED, LASTED 6 WEEKS AND BEGAN DYING AGAIN.  HAD TO JUMP START NUMEROUS TIMES. NOW BATTERY IS RUINED AND I NEED A NEW ALTERNATOR AND NEW BATTERY.  CAR IS 4 YEARS OLD WITH LESS THAN 30,000 MILES.  I AM 2ND OWNER, BOUGHT IT IN 11/2016 AT 24,000 MILES.",
        "vin": "JHMGE8H61DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990660,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM SEEMS TO MANIFEST WHEN THE PASSENGER IS A LIGHT-WEIGHT ADULT, IN THE CASE OF MY WIFE, IN THE NEIGHBORHOOD OF 115 POUNDS ' LIGHT TO BE SURE, BUT NOT ABSURDLY SO.  *JS    WE SEE THE PROBLEM INTERMITTENTLY AND RARELY.  MAYBE A HANDFUL OF TIMES IN A WEEK.  THE LIGHT ON THE DASHBOARD THAT INDICATES THAT THE SIDE AIR BAGS ARE DISABLED COMES ON.  IF WE ARE TO BELIEVE THIS STATUS INDICATOR, FOR THE PERIOD THAT THIS LIGHT IS ON, WE ARE NOT PROTECTED BY THE SIDE AIR BAGS AS THEY WOULD NOT DEPLOY IN AN ACCIDENT.  THIS LIGHT STAYS ON SOMETIMES AS LITTLE AS THREE SECONDS, SOMETIMES AS LONG AS A MINUTE.  MOST OFTEN IT STAYS ON FOR ABOUT TEN TO FIFTEEN SECONDS.  THERE IS NO PATTERN FOR WHEN IT MIGHT COME ON, OR WHAT WILL MAKE IT GO OFF.  IT CAN HAPPEN WHEN STOPPED AT A TRAFFIC LIGHT, OR TRAVELING AT FREEWAY SPEEDS, OR ANYTHING IN BETWEEN.    THIS PROBLEM ONLY MANIFESTS WHEN I AM DRIVING THE VEHICLE AND MY WIFE IS IN THE PASSENGER SEAT.  IF SHE IS DRIVING AND I AM IN THE PASSENGER SEAT, IT NEVER OCCURS.  IN ADDITION, THE REPORTS I HAVE SEEN FROM OTHER HONDA OWNERS ON THE INTERNET SUGGEST THAT THIS IS ALWAYS THE CASE, THAT THIS PROBLEM MANIFESTS ONLY WITH LIGHT-WEIGHT ADULTS IN THE PASSENGER SEAT.    INDEED, WE HAVE SEEN THIS OCCUR ONE TIME WHEN MY WIFE WAS DRIVING AND A LIGHT-WEIGHT ADULT FRIEND OF OURS IN THE NEIGHBORHOOD OF 100 POUNDS WAS RIDING IN THE PASSENGER SEAT.  SO IT SEEMS TO BE VERY MUCH RELATED TO PASSENGER WEIGHT.",
        "vin": "JHMGE8H38DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929210,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO FAULTY AIRBAG RECALL ISSUES, DEALERSHIP REFUSAL TO CANCEL LEASE AGREEMENT AND REFUSES RENTAL VEHICLE ASSISTANCE.  *SMD     THE CONSUMER STATED THE PARTS HAD NOT COME IN FOR THE RECALL REPAIR OF THE AIR BAGS. THE MANUFACTURER PROVIDED A RENTAL VEHICLE. THE CONSUMER WAS NOT IN POSSESSION OF THE VEHICLE FOR THE LAST 3 MONTHS OF THE LEASE; THEREFORE, SHE FEELS SHE SHOULD BE CREDITED FOR THOSE 3 MONTHS. UPDATED 05/03/2017*JS",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "03/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966289,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SWERVING IN UNSAFE MANNER DURING NORMAL WIND AT 55 MPH.  HONDA FIT 2013 HB FWD TRAVELING AT 55 MPH ON INNER LOOP OF WASHINGTON DC BELTWAY SWERVED MULTIPLE TIMES TO AN UNSAFE MANNER (MOVED OUTSIDE OF LANE) FOR 1 TO 2 SECONDS WHEN MET WITH LIGHT WIND.  MANY OTHER CARS/TRUCKS TRAVELED ON SAME PATHS AT SAME OR HIGHER SPEEDS WERE NOTICEABLY UNAFFECTED. TIRES TREADS ARE IN GOOD CONDITION, BALANCED, AND ALIGNED. PROBLEM NOT NOTICED BEFORE DUE TO TRAVELING MAINLY IN CITY ROADS WITH LESS WIND; THIS SWERVING OCCURRED ALMOST DAILY ON OPEN HIGHWAY FOR PAST FEW WEEKS.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945104,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER IN FEBRUARY OR MARCH OF 2016 ALERTING ME THAT MY VEHICLE, A 2013 HONDA FIT-SPORT WAS SUBJECT TO THE TAKATA FAULTY AIR BAG RECALL. THE LETTER ASKED FOR A RESPONSE WHICH WAS SENT IN AND SAID THAT DUE TO EXTREMELY LARGE NUMBER OF VEHICLES, THAT I COULD TAKE NO ACTION AT THE TIME, BUT THAT I WOULD BE CONTACTED BY THE SUMMER OF 2016 WITH INSTRUCTIONS ON WHERE TO GET THE POTENTIALLY DEADLY AIRBAG REPLACED. IT IS JANUARY 2017. I HAVE NOT BEEN CONTACTED AGAIN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/11/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE IGNITION SWITCH MALFUNCTIONED AND THE KEY BECAME STUCK AFTER TURNING OFF THE ENGINE. THE CONTACT TOOK THE VEHICLE TO A DEALER WHERE THE KEY WAS REMOVED FROM THE IGNITION. THE FAILURE MILEAGE WAS 84,000.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944448,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   THE LETTER I RECEIVED WAS DATED MARCH 2016. I HAVE CONTACTED THE DEALER SEVERAL TIMES AND EACH TIME WAS TOLD TO WAIT FOR ANOTHER LETTER. NOW THAT THE RECALL IS 10 MONTHS OLD , I WONDER IF ANYTHING AT ALL WILL BE DONE. THANKS FOR READING.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939965,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   *JS",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939736,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS);  HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H55DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935065,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  I RECEIVED THE RECALL NOTICE FOR MY 2013 HONDA FIT IN MARCH, 2016.  IT IS NOW DECEMBER OF 2016 AND MY DEALER HAS NO IDEA WHEN A NEW AIRBAG WILL BE AVAILABLE.  I THINK 9 MONTHS OF DRIVING THIS CAR WITH THIS AIRBAG IS TOO LONG TO WAIT FOR A REPLACEMENT.  DON'T KNOW WHAT ELSE I CAN DO ABOUT IT EXCEPT TO SEND THIS NOTE TO YOU.  *TR",
        "vin": "JHMGE8H34DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934725,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NUMEROUS DELAYS SINCE MARCH...NEVER FIXED!  [XXX] HELLO! MY NAME IS [XXX]. MAY I HAVE YOUR NAME PLEASE SO I KNOW WHO I'M CHATTING WITH?  [VISITOR] [XXX] HELLO! MY NAME IS [XXX]. MAY I HAVE YOUR NAME PLEASE SO I KNOW WHO I'M CHATTING WITH?  [VISITOR] MY HONDA HAS BEEN RECALLED AND MY NAME IS [XXX]  [XXX] HI, [XXX] NICE TO MEET YOU! MAY I HAVE THE YEAR, MAKE AND MODEL OF YOUR VEHICLE PLEASE?   [VISITOR] VIN [XXX]  [[XXX]] THANK YOU, [XXX]. MAY I ASK WHAT PART IS BEING RECALLED PLEASE?  [VISITOR] AIR BAG DEATHS  [XXX] I APPRECIATE THE INFORMATION. FOR RECALL SERVICES YOU CAN CALL THE SERVICE DEPARTMENT DIRECTLY. YOU MAY REACH US AT [XXX]. I CAN ALSO HAVE THEM GET IN TOUCH WITH YOU. MAY I HAVE YOUR PHONE NUMBER INSTEAD WHERE WE CAN GET IN TOUCH PLEASE?   [VISITOR] I CALLED 3 MONTHS AGO AND THEY SAID IT WOULD FIX IT IN [XXX]  [VISITOR] THANK YOU  [XXX] I UNDERSTAND. JUST TO VERIFY, IS YOUR VEHICLE IN THE SERVICE FACILITY?  [VISITOR] NO  [XXX] THANK YOU. MAY I ALSO HAVE YOUR EMAIL ADDRESS AS AN ALTERNATE FORM OF CONTACT,PLEASE?   [VISITOR] [XXX]  [XXX] THAT IS NOTED. MAY I VERIFY THAT YOUR LAST NAME IS [XXX]?  [VISITOR] PLEASE HAVE THEM CALL ME ASAP AS I DO NOT WANT TO DIE  [VISITOR]   [XXX] OF COURSE, [XXX]. I WILL FORWARD THIS CHAT RIGHT AFTER OUR CONVERSATION AND WE WILL GET BACK TO YOU DURING OUR BUSINESS HOURS. IS THERE ANYTHING ELSE I MAY HELP YOU WITH?   [VISITOR] NO AND THANK YOU. IS THERE A RECORD LOCATOR FOR THIS CHAT?  [VISITOR] THIS WAS IN JULY AND STILL NO ONE HAS CALLED!!!!    [VISITOR] YES!!!!!  [VISITOR] NO PHONE CALL EITHER!      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/04/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929793,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JULY 2016 BOUGHT GOODYEAR ASSURANCE TIRES TO REPLACE THE WORN TIRES. I REPLACED 1 TIRE IN SEPTEMBER FOR WHAT APPEARED TO BE A PUNCTURE. ON 12/1/16, 2ND TIRE WENT FLAT AS I WAS TRAVELING ON I71 FOR WHAT I THOUGHT WAS A PUNCTURE. THE SIDEWALL IS BULGING AND IT APPEARS THE BELTING IS DEFECTIVE (THIN AND FLIMSY AND CANNOT BE REPAIRED. BOTH PUNCTURED WERE FROM A ROCK THAT SHOULD HAVE BEEN DEFLECTED WITH NORMAL BELTING. TIRES WERE MADE IN JAPAN. THE TIRES HAVE LESS THAN 10,000 MILES.",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926918,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO NO RESPONSE FROM DEALERSHIP ON REPLACEMENT PARTS AVAILABILITY TO REPAIR DRIVER FRONT AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "JHMGE8H35DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926831,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE CONTACT STATED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H55DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925363,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924501,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER HAS FAILED OR IS UNABLE TO REMEDY THIS SAFETY RECALL",
        "vin": "JHMGE8G3XDC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2016",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919966,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TACATA RECALL. NO CONTACT FROM HONDA RE RECALL. SO WE JUST KEEP DRIVING UNTIL THE BAG KILLS US? HONDA RECALL NO. JY1.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919822,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG RECALL - I CALLED BELL HONDA IN PHOENIX, AZ A FEW MONTHS AGO AND THEY SAID THEY DID NOT HAVE ANY AIRBAGS TO REPLACE MINE WITH AND THEY WOULD LET ME KNOW WHEN THEY GOT THEM.  I HAVEN'T HEARD A WORD FROM THEM WHEREAS MY SONS MITSUBISHI HAS HAD TWO NOTIFICATIONS TO BRING THE CAR IN.  WHAT'S HONDA DOING AND WHY ISN'T THIS RESOVED YET?  PEOPLE WANT ANSWERS.",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NOTICE OF THE RECALL IN MARCH OF THIS YEAR (2016) THAT THE DRIVER'S AIRBAG COULD IF INFLATED RUPTURE AND KILL THE DRIVER. THE LETTER INDICATED THAT REPLACEMENT PARTS AND REPAIRS WOULD BE AVAILABLE BY THE SUMMER. HAVING HEARD NOTHING ELSE, I CONTACTED HONDA ON 9/23/16 TO INQUIRE FURTHER AND WAS TOLD IT WOULD BE ANOTHER TWO WEEKS. TODAY, 10/28/16 I WAS TOLD THAT THERE WAS NO FURTHER INFORMATION AS TO WHEN THE REPAIR PARTS WOULD BE AVAILABLE, AND REPAIRS AFFECTED.  NO OTHER EFFORT ON BEHALF OF HONDA HAS BEEN MADE TO ADDRESS CONCERNS AS TO OUR SAFETY, AS WE ARE STILL AT RISK IN USING THIS VEHICLE AND NO OTHER OPTIONS ARE AVAILABLE TO US.  *TR",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918839,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND MADE SEVERAL CALLS TO THE DEALER. THE CONTACT HAD NOT RECEIVED A RESPONSE. THE MANUFACTURER WAS UNABLE TO PROVIDE A REASONABLE TIME FRAME TO SUPPLY THE PART TO THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918857,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE RECALL REPAIR WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "10/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917875,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" NOTIFIED IN MARCH THAT AIRBAG PARTS WOULD BE AVAILABLE IN SUMMER FOR REPAIR TO TAKE PLACE. CONTACTED TWO DEALERS AND WAS PUT ON LIST FOR REPAIR IN MAY. NOTHING HAS BEEN DONE TO THIS POINT WITH NO FURTHER CONTACT FROM HONDA. 10-21-16.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915917,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915250,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- IN MARCH 2016 I RECEIVED A RECALL NOTICE. I CALLED HONDA AT THEIR TOO-FREE NUMBER AND WAS DIRECTED TO MY LOCAL DEALER HONDA OF CAMPAIGN, IN SAVOY IL.   AS OF TODAY I HAVE AS YET TO HAVE THE DRIVER'S AIRBAG REPLACED, YET I HAVE CONTACTED THE DEALER AND HONDA AT LEAST THREE TIMES OVER THE INTERVENING MONTHS (SINCE MARCH OF THIS YEAR WHEN HONDA SAID \"I WOULD BE INFORMED BY MAIL WHEN THE PARTS WERE AVAILABLE\").  INTERESTINGLY THE LAST TIME I WAS AT THE DEALERSHIP FOR REGULAR MAINTENANCE THEY HAD TWO 2013 FIT MODELS FOR SALE ON THE USED CAR LOT.   I ASKED THE SALESMAN \"IF THE CARS' AIRBAGS HAD BEEN REPAIRED\", AND HE SAID \"YES\".  I THINK THE DEALERSHIP NOR HONDA ARE FOLLOWING THE RECALL PROGRAM.  THANK YOU  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915292,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915141,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN TRYING TO SCHEDULE REPLACEMENT OF THE DEFECTIVE AIRBAG, DEALER DOESN'T KNOW WHEN THE REPLACEMENT BAG WILL ARRIVE AND HONDA MOTORS SAYS THEY ARE AVAILABLE FOR THE DEALER.  EACH IS POINTING A FINGER AT THE OTHER ONE FOR THE REASON THE PART HAS NOT BEEN DELIVERED FOR THE DEALER TO MAKE THE REPLACEMENT.   JUST WANT TO GET IT REPLACED SO I CAN SAFELY DRIVE MY CAR.  NEED HELP IN GETTING THE AIRBAG REPLACED AS SOON AS POSSIBLE.  AM I EXPECTED TO DRIVE AN UNSAFE VEHICLE UNTIL HONDA AND THE DEALER FINALLY FULFILL THEIR RESPONSIBILITY?",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914002,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  RECALL STATUS: RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE  SO WHAT ARE WE SUPPOSED TO DO WHILE HONDA IS TRYING TO FIGURE OUT THEIR NEXT STEP?",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911100,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  ON TWO SEPARATE OCCASIONS WE'VE SCHEDULED TO HAVE THE PARTS REPLACED. BOTH TIMES HONDA CALLED US TO CANCEL STATING THE PARTS WERE NOT IN YET. THIS HAS BEEN GOING ON SINCE WE RECEIVED THE NOTICE BACK IN MARCH.",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911250,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/02/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910996,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. RECEIVED SAFETY RECALL IN MARCH. IT IS NOW OCTOBER AND THE PART TO FIX MY CAR IS STILL NOT AVAILABLE. IT HAS BEEN WELL PAST 60 DAYS SINCE I RECEIVED MY RECALL NOTICE AND CONTACTED MY DEALER.",
        "vin": "JHMGE8G38DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910233,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - THIS RECALL HAS BEEN EXTREMELY SPURIOUS WITH AN INEPT CORPORATION RUNNING IT. I RECEIVED THE SAFETY RECALL INFORMATION IN MARCH 2016 REGARDING MY 2013 HONDA FIT SPORT DRIVERS SIDE AIR BAG. I AM STILL WAITING THE FOR PART TO ARRIVED AFTER SEVERAL CALLS TO HONDA AUTOMOTIVE.    I WAS TOLD HONDA AUTOMOTIVE WILL PAY FOR A RENTAL VEHICLE TO DRIVE DURING THE OVER SIX MONTH PART DELAY (THE LETTER STATED THE PAST SUMMER THE PART WOULD BE AVAILABLE). I DO NOT HAVE THE PLACE OR INCLINATION TO LET THE NITROGEN OUT OF MY TIRES, EMPTY THE FLUID OUT OF THE CAR, AND PUT THE VEHICLE UP ON BLOCKS IN A GARAGE FOR OVER SIX MONTHS.    WHEN I SPEAK WITH A DEALER OR THE CORPORATE OFFICE THE STAFF IS VERY CAVALIER REGARDING MY WELL-BEING. I DO NOT APPRECIATE SOMEONE DECIDING TO PLAY RUSSIAN ROULETTE WITH MY LIFE ESPECIALLY INDIVIDUALS WHO ACT LIKE UNFEELING AND INCOMPETENT ROBOTS. OBVIOUSLY, MY FAMILY AND I AM CONCERNED FOR MY SAFETY AND I HOPE TO WIN THE CRUEL GAME I HAVE BEEN THROWN INTO BY HONDA AUTOMOTIVE.    I WILL SAY I HAVE OWNED FOUR HONDA CARS INCLUDING THIS ONE. I WILL NOT BE PURCHASING ANOTHER FOR SELF-EXPLANATORY REASONS. NO ONE HAS THE RIGHT TO DEVALORIZE A HUMAN BEING (CUSTOMER) FOR PROFITS; HOWEVER, THIS ACT HAPPENS DAILY.    - MAUIGIRL300, ALCOA, TN, USA",
        "vin": "JHMGE8G54DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "02/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910310,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION,    THE ACCOUNT HOLDERS BELIEVE THAT AMERICAN HONDA HAS FAILED AND IS UNABLE TO REMEDY A DEFECT IN OUR 2013 HONDA FIT WITHIN A REASONABLE PERIOD OF TIME - WITHIN 60 DAYS FROM THE DATE WE FIRST CONTACTED THE DEALER FOR REPAIR. THE ACCOUNT HOLDERS HAVE MADE SEVERAL GOOD FAITH ATTEMPTS IN PERSON AND VIA TELEPHONE  ON FEBRUARY, 26TH 2016 (FIRST ATTEMPT DOCUMENT ATTACHED); MARCH 10TH, 2016, MAY 20TH, 2016, SEPTEMBER 7TH, 2016, AND SEPTEMBER 12TH, 2016 TO HAVE THE DRIVER SIDE AIRBAGS REPAIRED FOR OUR 2013 HONDA FIT LEASE. CURRENTLY, HONDA HAS FAILED TO REPAIR THE AIRBAGS. PLEASE, SEE ATTACHED DOCUMENTS.    WE FEEL THAT OUR SAFETY HAS BEEN NEGLECTED BY HONDA AND WOULD APPRECIATE YOUR HELP IN REMEDYING THIS ISSUE.     THANK YOU FOR YOUR HELP.  *TR",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910021,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA-DEALER NOTIFIED ME OF RECALL-HAD ME SIGN A WAIVER THAT I DRIVE UNDER MY OWN PERIL. THREE MONTHS HAVE PASSED, DEALER DOES NOT HAVE THE PART AND DOES NOT KNOW WHEN IT WILL ARRIVE. DEALER TRIED TO HAVE ME TRADE IT  FOR 9K, I HAVE A PRIVATE BUYER READY TO PAY 12,500 BUT CANNOT SELL IT DUE TO THE RECALL. NO ACCIDENTS HAVE OCCURRED AS A RESULT.",
        "vin": "JHMGE8H61DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909618,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I RECEIVED A LETTER IN MARCH 2016 THAT THIS DEFECT COULD POTENTIALLY KILL OR HURT ME AND MY PASSENGERS. I'VE CALLED THE DEALERSHIP ON AT LEAST 3 DIFFERENT OCCASIONS AND TOLD THE PART WOULD BE IN SOON. I CALLED AGAIN TODAY, MORE THAN 6 MONTHS AFTER GETTING THE LETTER, AND SAT ON HOLD FROM MORE THAN 15 MINUTES WAITING FOR AN ANSWER ABOUT MY PART, STATING AGAIN MY SAFETY CONCERNS. I FINALLY GAVE UP AND CALLED HONDA NATIONAL AND WAS TOLD THAT THIS WAS SUCH A MASSIVE RECALL, GETTING THE PARTS IS SLOW. SO IN THE MEANTIME, I DRIVE A CAR THAT PUTS ME AND MY FAMILY AT RISK. TODAY, FOR THE FIRST TIME, I WAS TOLD I COULD GET AN ALTERNATIVE CAR TO DRIVE IN THE INTERIM. BETTER, BUT STILL NOT COMFORTING TO KNOW MY CAR IS NOT ONLY DEFECTIVE, BUT GETTING A RESOLUTION IS PROVING TO BE PROBLEMATIC AND POTENTIALLY DANGEROUS TO MY FAMILY.     MY CONCERNS ARE:  1. WHY DOES IT TAKE THIS LONG? THAT SEEMS COMPLETELY UNACCEPTABLE WHEN POTENTIAL DEATH IS INVOLVED.  2. WHY DIDN'T MY DEALERSHIP OFFER A CAR EARLIER FOR MY SAFETY?  3. WHY AM I ON HOLD FOR 15 MINUTES WITH A DEALERSHIP INQUIRING ABOUT MY PART WITH NO ANSWER? IT SHOULDN'T BE THIS DIFFICULT.  4. MY CAR WAS BARELY TWO YEARS OLD WHEN THIS HAPPENED, WHY COULDN'T I HAVE JUST BEEN GIVEN A NEW CAR TO REPLACE THIS DEFECTIVE ONE SINCE IT'S SUCH A SAFETY CONCERN? THIS SITUATION REALLY MAKES MY CAR A LEMON!",
        "vin": "JHMGE8G51DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909664,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2016 HONDA PROMISED THAT THE PARTS WOULD BE AVAILABLE IN SUMMER 2016 AND HONDA WOULD NOTIFY ME. IT IS NOW ALMOST OCTOBER 2016 AND THE PARTS ARE STILL NOT AVAILABLE.",
        "vin": "JHMGE8H62DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909671,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I RECEIVED NOTIFICATION FROM HONDA  IN MARCH, 2016 STATING THAT REPLACEMENT PARTS 'WILL BECOME AVAILABLE IN THE SUMMER OF 2016' AND THAT I WOULD RECEIVE AN ADDITIONAL LETTER FROM HONDA. I'VE NEVER RECEIVED ANOTHER LETTER. SINCE I LIVE NEAR THE COAST I AM CONCERNED ABOUT THE HIGHER HUMIDITY CAUSING PROBLEMS WITH THE INFLATOR.     IT HAS BEEN 6 MONTHS WITHOUT RESOLUTION. THIS IS UNACCEPTABLE.",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909815,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909333,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 12/13/16*LJ  THE CONSUMER STATED THE AIR BAG WAS REPLACED. UPDATED 12/15/16.*JB",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907973,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "JHMGE8G53DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906850,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PARTS NEEDED FOR THE RECALL REMEDY WERE UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "06/14/2016",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 10,
        "odiNumber": 10905055,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 HONDA FIT CAUGHT FIRE ON 14JUN2016. THE CAUSE OF THE FIRE REMAINS UNKNOWN, BUT IT SHOULD BE NOTED THAT THERE HAVE BEEN RECALLS HAVING TO DO WITH FIRES WITH THIS VEHICLE. I WAS DRIVING ON THE NJ TURNPIKE, AND WHILE I WAS IN THE CAR, THE VEHICLE'S ENGINE BEGAN SMOKING, THERE WAS A FIRE ON THE PASSENGER SIDE AS WELL AS ON THE FLOOR IN THE REAR OF THE VEHICLE BETWEEN THE DRIVER/PASSENGER SEATS AND THE BACK SEATS. I SUFFERED SECOND AND THIRD DEGREE BURNS ON MY HANDS AND ARMS AS A RESULT OF THIS INCIDENT, WAS TAKEN TO THE EMERGENCY ROOM, HAD SEVERAL FOLLOW UPS WITH THE BURN SURGEON AND ALSO HAD TO START THERAPY FOR POST TRAUMATIC STRESS DISORDER. ACCOUNTABILITY FOR THIS INCIDENT IS HIGHLY NECESSARY.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA HAS NOT TAKEN CORRECTIVE ACTION REGARDING THE AIR BAG RECALL ON MY VEHICLE.",
        "vin": "JHMGE8H58DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "03/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903807,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL NOTICE RECEIVED FROM HONDA IN MARCH, 2016. I ORDERED THE AIRBAG RECALL REPAIR FROM GARY SMITH HONDA IN FORT WALTON BEACH, FL ON JUNE 14, 2016. IT HAS BEEN ALMOST 90 DAYS AND THEY STILL DO NOT KNOW WHEN THE ORDER MIGHT BE RECEIVED. MY NOTICE SAYS I CAN FILE A COMPLAINT WITH NHTSA. I AM HOPING THIS WILL WORK. OR DO I HAVE TO WRITE A LETTER ON PAPER AND SNAIL MAIL IT?",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE REMEDY WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 11/17/16*LJ  THE CONSUMER STATED ITS BEEN OVER A YEAR, SINCE HE RECEIVED THE RECALL. UPDATED 11/22/16.*JB",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898797,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS OR REMEDY STILL NOT AVAILABLE TO REPAIR VEHICLE DEFECT.  *SMD",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903022,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED AN IMPORTANT SAFETY RECALL NOTICE IN MARCH OF 2016 SAYING THAT THE AIRBAGS WERE POTENTIALLY DEFECTIVE.  IT SAYS THAT \"THE REMEDY PARTS NEEDED TO CONDUCT DRIVER'S AIRBAG INFLATOR RECALLS WILL BECOME AVAILABLE IN THE SUMMER OF 2016.\"  AT THAT TIME I WILL RECEIVE ANOTHER LETTER TELLING ME TO CONTACT THE DEALER.  THE SUMMER IS QUICKLY WANING TO A CLOSE SO YESTERDAY I WENT TO THE DEALER IN PERSON (JL FREED IN MONTGOMERYVILLE, PA) AND WAS TOLD THAT THEY ARE STILL MONTHS BEHIND, THAT SOME PEOPLE HAVE HAD TO LEAVE THEIR CARS THERE FOR 3 MONTHS.  I DO NOT SEE THIS AS AN ACCEPTABLE SITUATION AND THINK HONDA SHOULD TAKE THIS CAR BACK NOW WITHOUT PENALTY.  THEY CLEARLY CANNOT RECTIFY THE PROBLEM IN A TIMELY MANNER.  MY WIFE DOES NOT FEEL SAFE DRIVING THIS CAR.  WE HAVE BEEN PATIENT, BUT HONDA IS NOT LIVING UP TO ITS PROMISE.  I DO NOT THINK WE SHOULD HAVE TO WAIT UNTIL AN INCIDENT HAPPENS TO GET A SAFE CAR, NOR DO I WANT TO BE SENDING PHOTOS AS A WIDOWER.  THANKS IN ADVANCE FOR YOUR ATTENTION TO THIS MATTER.",
        "vin": "JHMGE8G39DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902900,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR RECALL NOTICE.  *SMD",
        "vin": "JHMGE8H5XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898754,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  DESPITE A RECALL IN FEBRUARY, SIX MONTHS LATER APPARENTLY  PARTS ARE NOT AVAILABLE, AND MORE TO THE POINT NO LOANER CARS HAVE BEEN OR ARE YET  AVAILABLE, EITHER FROM MY NOW-LOCAL DEALER  (YONKERS HONDA, 2000 CENTRAL PARK AVE, YONKERS, NY 10710). WHEN I CHECKED LAST IN JUNE THEY SAID PARTS WOULD BE COMING IN THE SUMMER, BUT STILL NO PARTS.  I AM VERY NERVOUS DRIVING A CAR THAT COULD CAUSE MY DEATH IN A CRASH, AND DON'T UNDERSTAND WHY HONDA HAS MADE LOANER CAR AVAILABLE TO SOME PEOPLE, BUT NOT OTHERS (LIKE ME).",
        "vin": "JHMGE8H38DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898453,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898342,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897842,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  PURCHASED NEW TO HAUL WORKING DOGS AND OUTFITTED WITH PROTECTIVE COVERS ETC IN ORDER TO DO SO.  RECEIVED THE SAFETY RECALL FOR DRIVER'S AIRBAG ON MARCH 9TH AND MADE FIRST DEALER CONTACT IN MARCH 2016..  DUE TO THE VEHICLE USE, HONDA DEALER NEVER PROVIDED A RENTAL CAR.   IN MID-AUGUST I MADE ADDITIONAL CONTACT WITH CORPORATE AND DEALER TO NO AVAIL.  I THEN TRADED OFF THE VEHICLE AT A LOSS DUE TO THE FEET DRAGGING BY HONDA.  THEY PROVIDED AN UNSAFE CAR AND FAILED TO OFFER ME A REMEDY.  THE DEALER DID OFFER TO SELL ME ANOTHER CAR AT NORMAL PRICING AND OFFERED A LOW TRADE IN VALUE SINCE THEY STATED THEY COULD NOT RESELL MY UNSAFE CAR UNTIL A REPAIR IS MADE.  ENTIRE DEALING WAS VERY UNACCEPTABLE.  FAULTY PRODUCT WITH FAILED REMEDY.  NEVER ANOTHER HONDA.  NEVER LOST SO MUCH MONEY BUT THEY HAVE NO FIX CURRENTLY FOR THE DRIVERS AIR BAG.  I WAS HONEST WITH THE DEALER STATING I ALMOST WAS IN A WRECK AND ENOUGH IS ENOUGH.   .THIS PRODUCT IS DEFECTIVE AND HONDA FAILED TO REMEDY IT.  I FEEL LEGAL ACTION AGAINST HONDA IS APPROPRIATE.  VEHICLE HAD 13,000 MILES ON IT WHEN TRADED FOR DIFFERENT VEHICLE AT SIGNIFICANT LOSS.  MY CHOICE, BUT MY SAFETY ALSO MATTERS AT LEAST TO ME.",
        "vin": "JHMGE8G39DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897681,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8G5XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V06100 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 09/27/16*LJ  *TR",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895120,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: IT HAS BEEN MORE THAN 60 DAYS SINCE I REQUESTED MY NEW AIRBAG INFLATOR. I HAVE NOT BEEN GIVEN A DATE TO EXPECT REPLACEMENT OF MY FAULTY AIRBAG INFLATOR.     I ASKED TO BE LET OUT OF MY LEASE DUE TO THIS ISSUE. I WAS GIVEN AN APPRAISAL ON MY CAR THAT WOULD LET ME OUT AFTER 2 MORE PAYMETNS. I MADE THOSE TWO PAYMENTS. THEN I WAS GIVEN A NEW APPRAISAL SAYING I WOULD HAVE TO GIVE THE DEALER [HONDA OF SEATTLE] $2700 TO GET OUT OF MY LEASE.    I AM FRUSTRATED WITH THE DOUBLE SPEAK OF THE DEALERSHIP.  I AM FRUSTRATED WITH THE LACK OF INFORMATION ABOUT WHEN TO EXPECT A REPLACEMENT AIRBAG INFLATOR.  I AM FRUSTRATED AT THE BREACH OF TRUST AT WORK HERE. THIS WAS A KNOWN PROBLEM, BUT WAS KEPT FROM ME FOR 2 YEARS OF MY LEASE, AND NOW I AM EXPECTED TO PAY MORE BECAUSE OF THE MANUFACTURER'S ERROR.",
        "vin": "JHMGE8H38DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H50DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893389,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 10/04/16*LJ  UPDATED 10/6/2017*JS",
        "vin": "JHMGE8H52DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893130,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SEATS",
        "crash": true,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "05/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10892716,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS IN AN ACCIDENT, IT WAS REAR-ENDED BY ANOTHER VEHICLE.  THIS HONDA FIT WAS STOPPED IN TRAFFIC AT A CONSTRUCTION ZONE IN SUBURBAN CARY, NC WHEN IT WAS HIT FROM BEHIND BY A SMALL TRUCK THAT WAS GOING APPROX. 45+ MPH.  THE IMPACT PUSHED THE FIT FORWARD INTO SOME CONSTRUCTION MATERIALS.  THE TRUCK DRIVER WAS FOUND FULLY RESPONSIBLE FOR THE CRASH AND WAS NOT INJURED. FOR THE FIT, AIR BAGS INFLATED FOR THE PASSENGER SIDE BUT NONE FOR THE DRIVER. FORTUNATELY, THE DRIVER WAS THE ONLY PERSON IN THE FIT.  AS SHOWN IN PICTURES (ATTACHED), THE DRIVER' SEAT TIPPED BACKWARDS FROM IT'S UPRIGHT POSITION. THE HEAD REST COMPLETELY FELL OFF AND ENDED UP IN THE BACK SEAT, GIVING THE DRIVER MINIMAL PROTECTION.  IN ADDITION, A METAL BAR UNDER THE DRIVER'S SEAT WAS THRUST FORWARD, CAUSING A DEEP AND LARGE HEMATOMA IN THE DRIVER'S LEG.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892657,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H50DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892104,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE PARTS HAVE BEEN UNAVAILABLE FOR OVER 6 MONTHS NOW FOR A PROBLEM THAT IS POTENTIALLY DEADLY. IT IS UNREASONABLE THAT A MANUFACTURER CAN LET PEOPLE WAIT THIS LONG FOR SOMETHING THIS DANGEROUS SIMPLY BECAUSE THEY DON'T WANT TO MAKE MORE PARTS IN A SHORT PERIOD OF TIME.",
        "vin": "JHMGE8H52DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER SIDE AIRBAG INFLATOR.  *SMD",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889153,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I CALLED LITHIA HONDA IN MEDFORD , OREGON THREE MONTHS AGO AND INFORMED THE SERVICE MANAGER THAT I RECEIVED A RECALL LETTER 9IN MARCH 2016.  HE SAID THEY WOULD ORDER THE PARTS AND INFORM ME WHEN THE PART ARRIVED, THEN I COULD MAKE AND APPOINTMENT FOR REPAIR.  I CALLED YESTERDAY FOR AN  APPOINTMENT AND WAS INFORMED THE PARTS WERE NOT THERE AND THEY WOULD HAVE TO ORDER THEM AGAIN. I WAS TOLD THEY DID NOT KNOW HOW LONG IT WOULD TAKE FOR THE PARTS TO ARRIVE BECAUSE HONDA CONTROLLED THE PARTS AND THE DEALER HAD NO CONTROL IN GETTING THE PARTS.  I WAS TOLD TO CALL HONDA CUSTOMER SERVICE. HONDA IS REFUSING TO REPAIR THE CAR BY DELAYING THE REPAIR.  THE RECALL  LETTER SAID THAT DRIVING THE CAR IS DANGEROUS AND LIFE THREATENING. I NEED MY CAR TO GET TO MEDICAL APPOINTMENTS.",
        "vin": "JHMGE8H5XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887451,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JHMGE8H57DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885841,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE DEALER STATED THAT THEY WOULD CALL THE CONTACT WHEN THE PARTS BECOME AVAILABLE; HOWEVER, THE CONTACT RECEIVED NO FOLLOW UP RESPONSE. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE PARTS WOULD BECOME AVAILABLE AND WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H55DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884839,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED AIRBAG RECALL NOTICE MARCH 2016. CALL RICHFIELD HONDA FOR REPAIR, WAS TOLD NO PARTS WERE AVAILABLE UNTIL LATE JUNE 2016. CALL INVER GROVE HONDA TODAY 07/14/2016 AND WAS TOLD THERE ARE STILL NO PARTS UNTIL LATE SUMMER.",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884135,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "07/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883568,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAIALBLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H6XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883208,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED HONDA DEALER ON 6 APRIL 2016, REGARDING ISSUES WITH FRONT AIRBAG INFLATOR. NOW AFTER MORE THAN THREE MONTHS (90 DAYS) I STILL HAVE NOT GOT MY CAR FIXED, AND IT HAS CAUSED MANY INCONVENIENCES TO MY FAMILY. YES, THEY HAVE PROVIDED A RENTAL CAR BUT WE WANT OUR OWN VEHICLE BACK AS SOON AS POSSIBLE.",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882762,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\".  I RECEIVED A SAFETY RECALL LETTER FROM HONDA IN REGARDS OF THE \"TAKATA RECALL\". I E-MAILED AND SENT PHONE TXT TO WESTER HONDA (GARDEN CITY KS) ON 3-30-2016 AND 4-6-2016 RESPECTIVELY AND I HAVE NOT RECEIVE ANY RESPONSE FROM \"BUZZ\" OR \"ALFREDO\" ON THIS REGARD. IT HAS BEEN MORE THAN 60 DAYS AND I STILL WAITING FOR THE DEALER TO TAKE CARE OF THE PROBLEM.",
        "vin": "JHMGE8H68DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882081,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H57DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H55DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THE VEHICLE STALLED WITHOUT WARNING.  THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ENGINE MOTOR MOUNT WAS FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 28,900. ....UPDATED 09/19/16 *BF    *CN",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862382,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL REPLACEMENT IS STILL MISSING, WHEN WILL IT BE REPLACED?",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862279,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  MY DAUGHTER'S CAR WAS RECALLED.  WE CALLED A DEALER IN DALLAS, TX WHERE THE VEHICLE IS WITH HER AT SCHOOL.  SHE IS NOW DRIVING A RENTAL CAR UNTIL HER CAR CAN BE FIXED DUE TO THE RECALL.  WE WERE TOLD THAT THE PARTS ARE NOT AVAILABLE UNTIL JULY.  THE CAR IS PARKED AT HER COLLEGE FOR THE TIME BEING.  WE RECENTLY FOUND OUT THAT WE ARE RELOCATING DUE TO MY JOB, ON OR ABOUT MAY 19, 2016.  THE CAR CAN NOT BE DRIVEN DUE TO THE RECALL SO I CONTACTED HONDA TO SEE IF THEY WOULD PAY TO TRANSPORT THE VEHICLE FROM DALLAS TO TRUSSVILLE, ALABAMA WHERE WE WILL BE LIVING.  I RECEIVED A PHONE CALL TODAY AND THE GENTLEMAN TOLD ME THAT HONDA WILL NOT BE PAYING TO TRANSPORT THE VEHICLE.  WE CAN NOT DRIVE IT....HOW ARE WE SUPPOSED TO GET IT TO ALABAMA?  IT'S NOT OUR FAULT THAT THERE IS A RECALL...I FEEL THAT HONDA SHOULD DO SOMETHING TO ACCOMODATE US.  THE HAVE OFFERED NO SOLUTION.  THE VEHICLE WILL NOT BE ABLE TO STAY ON THE SCHOOL'S PROPERTY FOR MUCH LONGER....OUR DAUGHTER IS GRADUATING ON MAY 14TH...THEN WE WILL HEAD TO ALABAMA.  PLEASE HELP US FIGURE OUT HOW TO TRANSPORT THE VEHICLE....WE CANNOT AFFORD TO TRANSPORT IT OURSELVES.",
        "vin": "JHMGE8H34DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860799,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO UNSATISFACTORY CUSTOMER SERVICE AT DEALERSHIP WITH AIRBAG RECALL REPAIRS.  *SMD  THE DEALER INFORMED THE CONSUMER,  HER VEHICLE HAD BEEN RECALLED. HOWEVER, WHEN THE CONSUMER CALLED THE DEALER BACK,  THE ADVISOR REFUSED TO DISCUSS THE RECALL. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JHMGE8H34DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855502,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    ITHACA CARSHARE IS A SMALL NON-PROFIT ORGANIZATION SERVING 1,400 COMMUNITY MEMBERS WITH 25 VEHICLES AVAILABLE FOR SELF-SERVE RESERVATIONS ON A 24/7 BASIS. SIX OF THESE VEHICLES ARE HONDA FITS AFFECTED BY THE TAKATA RECALL. FOR THE SAFETY OF OUR MEMBERS AND LIABILITY PURPOSES, WE REMOVED THESE VEHICLES FROM SERVICE ON APRIL 4, 2016.     WE HAVE SPOKEN WITH BOTH OUR LOCAL HONDA DEALER AND HONDA CORPORATE MULTIPLE TIMES, AND THUS FAR BOTH HAVE REFUSED TO PROVIDE ANY COMPENSATION FOR THE LOSS OF REVENUE CAUSED BY THESE VEHICLES BEING UNSAFE TO DRIVE. EACH VEHICLE REQUIRES INSTALLATION OF SPECIALTY HARDWARE FOR OUR USE, SO SUBSTITUTE VEHICLES PROVIDED BY HONDA (WHICH HAVE NOT BEEN OFFERED) ARE NOT AN OPTION FOR US. AS EACH DAY GOES BY, WE LOSE $250-300 IN REVENUE, SO AS OF THIS WRITING WE HAVE LOST OVER $3,000.    AS A SMALL NON-PROFIT, THIS RECALL HAS A HUGE EFFECT ON OUR BUDGET. WE EXPECT THAT OUR LOSSES WILL TOTAL AT LEAST $10,000, IF NOT MORE.     FAILURE OF HONDA TO PROVIDE COMPENSATION FOR THIS LOSS IS BOTH INCONVENIENT AND UNACCEPTABLE. WE CONTINUE TO SEEK COMPENSATION FOR THIS LOSS AND REQUEST ANY ASSISTANCE YOU MAY OFFER ON OUR BEHALF.",
        "vin": "JHMGE8H35DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855504,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    ITHACA CARSHARE IS A SMALL NON-PROFIT ORGANIZATION SERVING 1,400 COMMUNITY MEMBERS WITH 25 VEHICLES AVAILABLE FOR SELF-SERVE RESERVATIONS ON A 24/7 BASIS. SIX OF THESE VEHICLES ARE HONDA FITS AFFECTED BY THE TAKATA RECALL. FOR THE SAFETY OF OUR MEMBERS AND LIABILITY PURPOSES, WE REMOVED THESE VEHICLES FROM SERVICE ON APRIL 4, 2016.     WE HAVE SPOKEN WITH BOTH OUR LOCAL HONDA DEALER AND HONDA CORPORATE MULTIPLE TIMES, AND THUS FAR BOTH HAVE REFUSED TO PROVIDE ANY COMPENSATION FOR THE LOSS OF REVENUE CAUSED BY THESE VEHICLES BEING UNSAFE TO DRIVE. EACH VEHICLE REQUIRES INSTALLATION OF SPECIALTY HARDWARE FOR OUR USE, SO SUBSTITUTE VEHICLES PROVIDED BY HONDA (WHICH HAVE NOT BEEN OFFERED) ARE NOT AN OPTION FOR US. AS EACH DAY GOES BY, WE LOSE $250-300 IN REVENUE, SO AS OF THIS WRITING WE HAVE LOST OVER $3,000.    AS A SMALL NON-PROFIT, THIS RECALL HAS A HUGE EFFECT ON OUR BUDGET. WE EXPECT THAT OUR LOSSES WILL TOTAL AT LEAST $10,000, IF NOT MORE.     FAILURE OF HONDA TO PROVIDE COMPENSATION FOR THIS LOSS IS BOTH INCONVENIENT AND UNACCEPTABLE. WE CONTINUE TO SEEK COMPENSATION FOR THIS LOSS AND REQUEST ANY ASSISTANCE YOU MAY OFFER ON OUR BEHALF.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855499,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    ITHACA CARSHARE IS A SMALL NON-PROFIT ORGANIZATION SERVING 1,400 COMMUNITY MEMBERS WITH 25 VEHICLES AVAILABLE FOR SELF-SERVE RESERVATIONS ON A 24/7 BASIS. SIX OF THESE VEHICLES ARE HONDA FITS AFFECTED BY THE TAKATA RECALL. FOR THE SAFETY OF OUR MEMBERS AND LIABILITY PURPOSES, WE REMOVED THESE VEHICLES FROM SERVICE ON APRIL 4, 2016.     WE HAVE SPOKEN WITH BOTH OUR LOCAL HONDA DEALER AND HONDA CORPORATE MULTIPLE TIMES, AND THUS FAR BOTH HAVE REFUSED TO PROVIDE ANY COMPENSATION FOR THE LOSS OF REVENUE CAUSED BY THESE VEHICLES BEING UNSAFE TO DRIVE. EACH VEHICLE REQUIRES INSTALLATION OF SPECIALTY HARDWARE FOR OUR USE, SO SUBSTITUTE VEHICLES PROVIDED BY HONDA (WHICH HAVE NOT BEEN OFFERED) ARE NOT AN OPTION FOR US. AS EACH DAY GOES BY, WE LOSE $250-300 IN REVENUE, SO AS OF THIS WRITING WE HAVE LOST OVER $3,000.    AS A SMALL NON-PROFIT, THIS RECALL HAS A HUGE EFFECT ON OUR BUDGET. WE EXPECT THAT OUR LOSSES WILL TOTAL AT LEAST $10,000, IF NOT MORE.     FAILURE OF HONDA TO PROVIDE COMPENSATION FOR THIS LOSS IS BOTH INCONVENIENT AND UNACCEPTABLE. WE CONTINUE TO SEEK COMPENSATION FOR THIS LOSS AND REQUEST ANY ASSISTANCE YOU MAY OFFER ON OUR BEHALF.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853857,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853216,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 05/17/16*LJ  UPDATED 11/17/2017*JS",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852357,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I CALLED TWO HONDA DEALERS AS WELL AS THE CORPORATE OFFICE THE SAME DAY AS I RECEIVED THE RECALL NOTIFICATION FOR MY VEHICLE. IN ALL CASES, THROUGH REPEATED PHONE CALLS, I HAVE BEEN TOLD THAT DESPITE THE DANGER OF THE RECALLED ITEM IF IT MALFUNCTIONS, THERE IS A 2 - 5 MONTH WAIT BEFORE THE PART CAN BE REPLACED. IN THE MEANTIME, I AM EXPECTED TO DRIVE THE DEFECTIVE VEHICLE.",
        "vin": "JHMGE8H34DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  THIS WEEKEND I RECEIVED THE RECALL NOTICE AND WHEN I CALLED THE DEALERSHIP I FIND I CAN HAVE A RENTAL CAR, BUT IT COMES WITH RESTRICTIONS.  IF MY CAR IS UNSAFE I NEED A COMPARABLE VEHICLE NOW.  I CALLED THE HONDA AUTOMOBILE DIVISION OF AMERICAN HONDA MOTOR CO NUMBER THAT WAS INCLUDED IN THE NOTICE, BUT IT WILL BE A COUPLE OF DAYS BEFORE THEY CAN GET BACK TO ME.  AGAIN, IF THIS CAR IS UNSAFE, I NEED ANOTHER VEHICLE, BUT COMPARABLE VEHICLE WITHOUT RESTRICTIONS, NOW.  I HAVE NOT HAD AN ACCIDENT, BUT I NOW DREAD THIS BECOMING A NOTIFICATION FROM A NEXT OF KIN.",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839590,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS UP WHILE DRIVING AND ATTEMPTING TO TURN THE WHEEL.  STEERING LOCKS UP ALSO WHILE STANDING STILL.  ELECTRICAL POWER SEEMS TO BE INTERRUPTED FOR A COUPLE SECONDS WHILE THIS IS HAPPENING.  HEADLIGHTS DIM AND RADIO QUITS FOR THAT PERIOD OF TIME.  THE EVENT ELECTRICALLY SEEMS TO BE INTERRELATED.  VERY SCARY AND DANGEROUS WHEN THE VEHICLE IS IN MOTION.",
        "vin": "JHMGE8H31DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785918,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE DRIVER SIDE WINDOW BECAME INOPERABLE INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "JHMGE8H32DC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2015",
        "dateOfIncident": "06/07/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783144,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS COMPLAINT ON BEHALF OF MY 78 YEAR OLD MOTHER.  APPROX. THE BEGINNING OF JUNE, SHE SMELLED GAS WHEN SHE GOT IN THE CAR AND IT WAS NOT RUNNINGR.  A FEW DAYS LATER, SHE COULD SMELL THE GAS OUTSIDE, WHEN IT WAS ALSO NOT RUNNING.   SHE CALLED HONDA AND WENT FOR AN APPOINTMENT.  THEY TOLD HER THAT THE FUEL PUMP WAS DAMAGED FROM \"RODENTS EATING\" IT AND IT WAS \"LEAKING GAS\".  IT ALSO HAD A RODENT NEST ON IT. THAT REPAIR COST HER $699.52.  ONE OF THE WORKERS AT THE HONDA DEALERSHIP TOLD HER THIS WAS A COMMON\"PROBLEM DUE TO WHAT THE PLASTICS ARE NOW MADE OF AND THE RODENTS ARE ATTRACTED TO IT\".  ON JUNE 15, SHE PICKED UP THE CAR AND WENT HOME AND HAD A FRIEND CHECK THE FILTERS AND FOUND ANOTHER NEST IN THE CABIN FILTER, AND CHANGED THE FILTER.   IN OCTOBER, SHE SAW EVIDENCE OF MICE INSIDE THE CAR.  AGAIN THE CABIN FILTER HAD MOUSE DEBRIS AND ALSO THE ENGINE FILTER.   SHE CHANGED BOTH FILTERS.  SHE CALLED HONDA SUPPORT, AND TOLD THEM THAT SHE CAUGHT A MOUSE WITH A TRAP IN HER CAR.  AND \"CEASAR\" AT HONDA SUPPORT SAID THAT THEY WERE \"HAVING PROBLEMS WITH RODENTS EATING WIRES AND PLASTIC\" WHICH WE LATER FOUND OUT WERE LIKELY MADE FROM SOY AND APPARENTLY RODENTS LIKE TO EAT.    THEN THEY TOLD HER TO GET HER WIRES COVERED WITH A \"RODENT DETERRENT TAPE\" AND SHE MADE AN APPOINTMENT WITH HONDA DEALER AND TOOK HER CAR BACK IN.  THAT COST HER $563.46.   HONDA SUPPORT SAID THE DAMAGE WAS NOT COVERED BY THE WARRANTY.   I BELIEVE THAT THIS IS A SIGNIFICANT SAFETY ISSUE IN THAT GAS WAS LEAKING OUT OF MY MOTHER'S CAR.  AND THIS IS A PROBLEM THAT HONDA HAS STATED IS KNOWN, YET THEY ARE MAKING LOTS OF MONEY BY NOT REVERTING BACK TO THE PREVIOUS OR ALTERNATIVE PLASTICS!!!",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782127,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE REMINDER CAME ON FOR OIL CHANGE.  NOW 10 DIFFERENT WARNING LIGHTS ARE LIT, THE SPEEDOMETER AND TACHOMETER WILL NOT WORK, THE AIR CONDITIONER WILL NOT COME ON, AND THE VEHICLE IS HARD TO STEER.  THE D FOR DRIVE IS RANDOMLY BLINKING.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780543,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA FIT. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, THE FRONT OF THE VEHICLE SEIZED AFTER THE BRAKE PEDAL WAS DEPRESSED. PRIOR TO THE FAILURE, THE VEHICLE MADE AN ABNORMAL NOISE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE FAILURE COULD NOT BE DIAGNOSED HOWEVER THE ROTORS, THE BRAKE PADS, AND THE TIRES WERE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,653.   UPDATED 02/10/16*LJ *JS",
        "vin": "JHMGE8H68DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735696,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY ON THIS CAR DIES CONSTANTLY, WITH NO PROVOCATION BUT WHEN A GARAGE CHECKS IT OUT, IT ALWAYS REPORTS AS A GOOD BATTERY. THE FIRST INCIDENT, I WAS DRIVING AND PULLED OVER FOR A 20 MINUTE NAP WITH THE AIR ON WITH THE CAR IN IDLE. THE BATTERY \"DIED\" AND AFTER I HAD THE VEHICLE OFF FOR AN HOUR, IT WORKED AGAIN. IT'S HAPPENED AGAIN NUMEROUS TIMES SINCE THEN, INCLUDING DYING AFTER I HAD THE CAR OFF BUT MY 4-WAY BLINKERS ON DUE TO RUNNING OUT OF GAS. IT'S GOTTEN SO BAD THAT WHEN I IDLE FOR 5 MINUTES THE BATTERY \"DISCHARGES\" AND THE IGNITION WON'T TURN OVER. I HAVE TO LET THE CAR SIT COMPLETELY OFF TO TURN THE IGNITION OVER AFTER A 5 - 10 MINUTE WAIT. THIS HAPPENED SEVERAL TIMES UNTIL, ON MY WAY TO WORK, I PULLED OVER TO TAKE A ROAD SIDE NAP FOR 5 MINUTES. THE CAR WAS IN IDLE WITH THE HEADLIGHTS ON AND THE PHONE CHARGER PLUGGED IN. THE CAR DIED AND I LOST A FULL DAY OF WORK! BUT IT ONLY DIES FOR THE IGNITION, THE ACCESSORIES WILL ALL WORK. THE DEALER TOLD ME THAT NOTHING COULD BE DONE BECAUSE \"THE BATTERY FOR THIS CAR IS SO SMALL IDLING DISCHARGES IT. SO YOU CAN'T IDLE ANYMORE.\" THEY WOULD NOT REPLACE THE BATTERY. I ACCEPTED AND WENT ON MY WAY. THEN, LATER THAT WEEK, I WENT TO SEE A MOVIE. I HAD EVERYTHING IN THE CAR SHUT OFF, BUT I LEFT MY PHONE CHARGER PLUGGED IN TO THE POWER OUTLET, WITHOUT A PHONE TO CHARGE. THE CAR DIED AGAIN AND I NEEDED MY FRIENDS TO GIVE ME A JUMP! SAME SCENARIO, ALL THE ACCESSORIES WORKED, JUST THE ENGINE WOULDN'T START. I TOOK IT TO THE DEALER AGAIN AND THEY REFUSED TO REPLACE THE BATTERY AND SAID \"WELL NOT YOU CAN'T LEAVE THE PHONE CHARGER PLUGGED IN ANYMORE WHEN THE CAR IS OFF--THAT CAN REALLY DRAIN A BATTER.\" THAT MAKES NO SENSE. THAT IS THE EQUIVALENT OF YOU LEAVING YOUR (OFF) COFFEE MAKER PLUGGED IN AND POWERING DOWN YOUR HOUSE! NO ONE HAS GIVEN ME ANY OTHER EXPLANATION. THIS SEEMS LIKE A DESIGN DEFECT WHEN ONE CAN'T IDLE A CAR.",
        "vin": "JHMGE8H64DC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2015",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722485,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STATIC SHOCK UPON INSERTING KEY INTO IGNITION.  OCCURS INTERMITTENTLY AND IS CURRENTLY ONGOING.  DON'T RECALL DATE OF FIRST OCCURRENCE BUT WAS FIRST REPORTED TO HONDA ON 10/21/14.  HONDA COULD NOT DUPLICATE PROBLEM AND INDICATED NO SIMILAR CONCERNS HAVE BEEN REPORTED. WAS ADVISED TO TOUCH SOMETHING METAL BEFORE INSERTING KEY. HAVE NEVER EXPERIENCED THIS ISSUE WITH ANY OTHER VEHICLE I PREVIOUSLY OWNED.  HAVE CONCERNS ABOUT HOW THIS MAY EFFECT THE ELECTRICAL COMPONENTS AND GENERAL SAFETY OF THE CAR'S PERFORMANCE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "05/01/2015",
        "dateOfIncident": "04/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713951,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK 2013 FIT TO DEALER DUE TO CAR NOISE UNDERNEATH AND CAR WANTING TO STALL AT STOPS, OR WHILE WAITING FOR LIGHTS TO CHANGE. MECHANIC FOUND DEBRIS/PART OF A FEATHER ON MAP SENSOR OF WHICH HE KEPT. I WAS TOLD THAT THIS RARELY EVER HAPPENS TO HONDA CARS AND WARNED THAT MY EXTENSIVE WARRANTY THAT I PURCHASED DOES NOT COVER DEBRIS FROM ROADS. I AM SHOCKED TO READ THAT THERE ARE VENTS BELOW THE LICENSE PLATE HOLDER NEAR THE ROAD, WIDE ENOUGH TO SIGNIFICANTLY EXPOSE THE ENGINE TO DAMAGE FROM ROAD DEBRIS SUCH AS A BIG ROCK, THIS CAUSES ROAD DEBRIS TO ENTER AND HIT THE A/C CONDENSER ONLY INCHES BEHIND THE OPENING. IN MY CASE, ONE WEEK AFTER TAKING MY CAR TO THE DEALER FOR STALLING CAUSED BY MAP SENSOR DEBRIS I HAD A CAR ACCIDENT. THE FRONT BUMPER FELL OFF THE HONDA FIT AND EXPOSED 4 VERY LARGE, ALTHOUGH DEAD, INTACT BIRDS NEXT TO MY ENGINE WITH MANY FEATHERS, TWO ON EACH SIDE OF THE FRONT BUMPER. THE POLICE OFFICE TOLD ME TO CONTACT HONDA AS THEY NEEDED TO BE MADE AWARE OF THE PROBLEM. I CALLED THE DEALERSHIP AND THEY DENIED ANY RESPONSIBILITY. TOLD ME THAT I CAN CONTACT THE NATIONAL CENTER FOR DISPUTE SETTLEMENT LOCATED IN MY CAR MANUAL IF I WANTED. I AM TERRIFIED TO DRIVE THIS CAR. WHY HASN'T HONDA BEEN FORCED TO PROVIDE A GRILL COVER OR OTHER FORM OF PROTECTION?? I STRONGLY FEEL THAT THE HONDA FIT 2013 IS A VERY DANGEROUS VEHICLE AND MAY CAUSED ME MANY COSTLY REPAIRS. I HOPE SOMEONE HEARS ME AND ADDRESSES THIS PROBLEM BEFORE A FATAL ACCIDENT OCCURS. ADDITIONALLY, I HAVE PICTURES OF THE FOUR LARGE ADULT BIRDS LYING INSIDE THE FRONT BUMPER OF MY CAR AS EVIDENCE THAT HONDA \"MUST\" ADDRESS THIS ISSUE AS SOON AS POSSIBLE.   *TR",
        "vin": "JHMGE8H58DC"
    },
    {
        "components": "SUSPENSION,TIRES,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706484,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 29,000 HAD TO REPLACE TIRES, SIDEWALL CRACKING AND ONE TIRE HAD A BUBBLE. ASKED HONDA ABOUT PROMISED WARRANTY AND THEY SAID THERE WAS NO WARRANTY, CONTACT TIRE DEALER BUT TIRES WERE A SPECIAL PURCHASE BY HONDA.   TPMS DAMAGED BY WARTART WHEN MOUNTING NEW TIRES, FIXED & RESET BY HONDA . HAD HONDA DO A FRONT END ALIGNMENT THEY STATE LEFT WHEEL \"FROZEN\" -\"UNFIXABLE\"  I DID HIT BRAKES VERY HAD ABOUT 6 WEEKS AGO, FELT TIRES FREEZE, GRAB, CAR WENT SIDEWAYS. CAN THIS BE RELATED TO ESC RECALL?     *TR",
        "vin": "JHMGE8H59DC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692285,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXPRESS FEATURE ON THE DRIVERS WINDOW WILL NOT STOP IN THE FULL UP POSITION. IT WILL EXPRESS BACK DOWN TO THE POSITION IT STARTED AT WHEN ACTIVATED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/13/2015",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10683265,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHILE THE VEHICLE WAS ATTEMPTING TO MERGE, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. AS A RESULT, THE CONTACT SUSTAINED PERMANENT NECK AND SHOULDER INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE  FRONT WINDSHIELD, UNDERCARRIAGE, AND HATCHBACK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. TWO MONTHS LATER, WHILE ATTEMPTING TO MERGE INTO A TRAFFIC CIRCLE, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED  NECK AND SHOULDER INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE HATCHBACK AND BUMPER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT INDICATED THAT AFTER THE FIRST CRASH, THE VEHICLE JERKED AND LOST POWER. THE VEHICLE WAS TAKEN TO A DEALER AND THE CONTACT STATED THAT THE TECHNICIAN REFUSED TO DIAGNOSE OR DUPLICATE THE FAILURE. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680984,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ANY TIME AT LOW SPEED START OFF IF LEFT FOOT IS JUST TOUCHING BRAKE PEDAL CAR WILL STALL WITH NO RESPONSE IN THROTTLE POSITION CAR STOPS! UNTIL THE ACCELERATOR PEDAL IS BACKED OFF WITH FOOT AND REAPPLIED  DEALER SAID THIS HAPPENS AND TO DRIVE WITH ONLY ONE FOOT! THIS IS VERY DANGEROUS PROBLEM NEED RECALL!      *TR",
        "vin": "JHMGE8H69DC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661678,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT. CONSUMER CONCERNED ABOUT THE RECENT RECALLS ON TAKATA AIRBAGS. *TA",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654381,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT AND 2004 HONDA CIVIC. THE CONSUMER WAS CONCERNED ABOUT THE RECENT RECALL OF TAKATA AIR BAGS AND THE CHEMICALS INSIDE THE AIR BAGS. *TA  UPDATED 03/02/16.*JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/13/2014",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE CAR ON MAY 31ST 2013  THE BRAKES SEEMED MUSHY. WHEN I TOOK IT IN 3 MONTHS LATER TO THE DEALER TO HAVE A TIRE FIXED (NAIL) THEY SAID THEY CHECKED BUT SAW NOTHING SO I ASSUMED THIS WAS THE WAY THE BRAKES SHOULD BE. A FEW TIMES WHEN I HAD TO BRAKE HARD THE WHOLE CAR SHUDDERED AND AGAIN THEY SAID NOTHING WAS WRONG. SO HERE WE ARE AFTER 15 MONTHS LATER AND I HAD THE BRAKES CHECKED AGAIN AS THEY WERE SQUEAKING A BIT. MY MECHANIC SAID THEY WERE OK, THEN A WEEK LATER AROUND OCT. 9TH  THE BRAKES BEGAN TO SCREAM METAL ON METAL IT SOUNDED LIKE TO ME. SO I CALLED THE CUSTOMER CARE PEOPLE AND ASKED ABOUT A WARRANTY FOR THE BRAKES AND WAS TOLD \"OH YES LOTS OF PEOPLE HAVE THE SAME PROBLEM WITH THAT PARTICULAR CAR, BUT IT IS NOT IN THE WARRANTY.\" NEEDLESS TO SAY I WAS A BIT UPSET AND TOOK IT TO MY MECHANIC WHO REPLACED THEM ($335) AND SAID THAT THERE WAS NO SPRING TO SEPARATE THEM AND IT WAS DONE IN THE FACTORY SO THEY SEIZED UP.  I CAN'T IMAGINE WHAT MIGHT HAVE HAPPENED IF THIS WASN'T CAUGHT WHEN IT WAS AND I CONSIDER THIS A HUGE SAFETY PROBLEM. I DON'T KNOW HOW YOU WOULD GO ABOUT WARNING PEOPLE BUT I DECIDED TO MAKE YOU AWARE OF MY EXPERIENCE. *TR",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633292,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON HOT DAYS ABOVE 88DEG THE AC SHUTS DOWN STOPS WORKING ALSO IT FAILS TO KEEP CAR COOL ABOVE 90   WENT TO DEALER AND THEY DID NOT DO ANYTHING TO FIX IT  DIFFERENT MAKES SEEM NOT TO HAVE THIS ISSUE  AT LEAST I OWN THREE NON HONDA  AUTOS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630753,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT WHILE PARKING, THE VEHICLE SURGED FORWARD AND CRASHED INTO A CONCRETE BARRIER. THE CONTACT MENTIONED THAT THE VEHICLE WENT OVER THE SIDEWALK BUT WAS SHE ABLE TO ENGAGE THE BRAKES BEFORE THE VEHICLE CRASHED INTO A BUILDING. THE CONTACT DID NOT FILE A POLICE REPORT AND NO INJURIES WERE REPORTED. THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS TAKEN TO A DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20.",
        "vin": "JHMGE8H59DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628103,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD NOT VISIBLE WHEN DRIVING IN BRIGHT LIGHT.  NO DAYLIGHT LIGHTING CONTROL FOR DASHBOARD.  UNABLE TO READ GAUGES OR WARNINGS.  *TR",
        "vin": "JHMGE8H57DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MICE EAT 3 ENGINE WIRE LOOMS SINCE HONDA USES SOY BASED CHEMICALS FOR WIRES THAT CAN LEAD TO AN ACCIDENT OR FIRE.   *TR",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615582,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE MADE A LOUD NOISE AND THE TRANSMISSION FAILED. THE TRANSMISSION WARNING INDICATOR ILLUMINATED AND THE VEHICLE SHOOK. THE CONTACT HAD TO DRIVE VERY SLOWLY BEFORE THE VEHICLE STALLED. THE VEHICLE WOULD NOT RESTART. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "STRUCTURE,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610404,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO AIR CONDITIONER AND FRONT SEAT ISSUES.  *SMD  THE CONSUMER STATED THE AC CYCLED DOWN WHEN THE OUTSIDE TEMPERATURE WAS 80 OR ABOVE, WHEN SHE HAS BEEN ON THE ROAD FOR AS LITTLE AS 30 MINUTES. THE AC WAS CYCLING OFF JUST WHEN SHE NEEDED IT MOST. THE FRONT SEATS WERE UNCOMFORTABLE. THE CONSUMER HAD TO ADD EXPENSIVE GEL CUSHION TO THE SEAT. IT HELPED, BUT IT PUSHED HER FORWARD MAKING IT DIFFICULT TO GET HER RIGHT KNEE PAST THE STEERING COLUMN AS SHE ENTERED AND EXITED THE VEHICLE. ALSO, THE VEHICLE SAT VERY LOW TO THE GROUND, WHICH PUT THE VEHICLE AT RISK FOR DAMAGE FROM ROAD DEBRIS. *JB",
        "vin": "JHMGE8H3XDC"
    },
    {
        "components": "STRUCTURE,EQUIPMENT ADAPTIVE/MOBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607664,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE \"VENTS\" BELOW THE LICENSE PLATE HOLDER NEAR THE ROAD, WIDE ENOUGH TO SIGNIFICANTLY EXPOSE THE ENGINE TO DAMAGE FROM ROAD DEBRIS SUCH AS A BIG ROCK. THIS CAUSES ROAD DEBRIS TO ENTER AND HIT THE A/C CONDENSER ONLY INCHES BEHIND THE OPENING. I HAVE RESEARCHED THIS PROBLEM AND HAVE SEEN THIS REPORTED 3 TIMES IN SEVERAL YEARS TO SAFECAR.GOV. FROM MODEL YEAR 2010 TO 2014. HONDA HAD A PROBLEMWITH OTHER HONDA CAR MODELS WHICH RESULTED IN A SUCCESSFUL CLASS ACTION LAWSUIT. HONDA STILL DOES NOT PROVIDE A GRILL COVER OR OTHER FORM OF PROTECTION DESPITE THE LAWSUIT AND REPORTS. THEY ALSO DO NOT COVER THE REPAIRS WITH THEIR MANUFACTURE WARRANTY. TO HAVE A 9 MONTH OLD 2013 AUTOMOBILE HAVE TO HAVE AIR CONDITIONING REPLACEMENT IS OUTRAGEOUS. THIS IS A EDESIGN DEFECT AND HONDA SHOULD ADDRESS THE ISSUE WHICH MAY BE OF SAFETY WHEN PEOPLE STOP ON THE SIDE OF THE ROAD TO ADDRESS IT REGULARLY. THE REPAIRS ARE APPROX. $1,000 EACH AND IT SEEMS HONDA MAY BE RUNNING A RACKET WITH THIS RECURRING DEFECT ISSUE.    *TR",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "11/14/2013",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2013 HONDA FIT.  THE CONTACT STATED THAT THE VEHICLE WOULD NOT START.  THE VEHICLE WAS TOWED TO THE DEALERSHIP.  THE FAILURE OCCURRED THREE TIMES.  THE DIAGNOSIS OF THE VEHICLE WAS THAT THE BATTERY WAS DISCHARGED.  THE VEHICLE WAS REPAIRED.  THE FAILURE RECURRED.  THERE WAS NOT A SECOND DIAGNOSIS OFFERED BY THE DEALERSHIP.  THE FAILURE MILEAGE WAS 1,900 AND THE CURRENT MILEAGE WAS 1,900.  THE CONSUMER STATED THE AIR BAG ISSUE HAS NOT BEEN RESOLVED. IT HAS BEEN OVER 90 DAYS. UPDATED 08/02/16.*JB UPDATED08/1/2017*JS",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/27/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595177,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT WITH A 1,000 MILES, BOUGH IT NEW, IS NOW HESITATING ON ACCELERATION, THEN IT LIKE IT TAKES A BIG GULP OF GAS AND IS FINE.  HAPPENED ON MORE THAN ONE OCCASION.  ROADS WERE FLAT AND ONLY ALWAYS HAPPENS AFTER I STOP THEN ACCELERATE.  DOES NOT DO THIS ALL THE TIME, BUT WHEN MAKING A TURN WITH ONCOMING CARS, IT COULD BE VERY DANGEROUS.  DO NOT FEEL COMFORTABLE DRIVING AS I NEVER KNOW WHEN THIS IS GOING TO HAPPEN.  *TR",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584995,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ENGINE ALL OF A SUDDEN SHUT OFF.  PULLED TO THE SIDE OF THE ROAD AND TURNED THE KEY OFF AND STARTED ENGINE.  NO PROBLEMS SINCE.  *TR",
        "vin": "JHMGE8H30DC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579536,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY WAS REPLACED. CAR STRUGGLING TO START SO SAID ALTERNATOR MIGHT BE BAD. BATTERY LIGHT AND CHECK ENGINE LIGHT KEEP TURNING ON. DEALERSHIP SAID I WOULD HAVE TO LEAVE CAR FOR 100 HOURS TO GET IT CHECKED .     *JS",
        "vin": "JHMGE8H51DC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576640,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA FIT.  CONSUMER WRITES IN REGARDS TO VEHICLE NOISES AND SUDDEN ACCELERATION.  *SMD  THE CONSUMER STATED WHEN SHE REACHED THE SPEED OF 45- 50 MPH, THERE WAS A DISTINCT HOWLING NOISE. ALSO AT TIMES, THE VEHICLE WOULD SUDDENLY SURGE FORWARD WITHOUT PRESSING DOWN ON THE ACCELERATOR.  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2014",
        "dateOfIncident": "01/20/2014",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573184,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2013 HONDA FIT CAUGHT FIRE WHILE PARKED.    I BOUGHT A NEW 2013 HONDA FIT ON AUGUST 10, 2013. ON AUGUST 23RD THE CAR WOULD NOT START, NEEDING A JUMP START FROM A MECHANIC. I DROVE THE CAR TO DCH HONDA IN OXNARD.  THE MILEAGE ON THE ODOMETER AT THE SERVICE CENTER WAS 491 MILES.  THE CAR WAS TESTED AND NO PROBLEM WAS FOUND AND I DROVE THE CAR BACK HOME.     THE SERVICE REPORT SAYS:  'CUSTOMER STATES IT HAD TO BE JUMPSTARTED, ADVISE.  CND INSPECTED SYSTEM.  UNABLE TO VERIFY CUSTOMERS CONCERN AT THIS TIME.  BATTERY CHECKS OUT OKAY AT THIS TIME..WAS INSPECTED/TESTED 3 TIMES..'    ON JANUARY 17TH WHEN I OPENED THE TWO REAR WINDOWS USING THE DRIVERS SEAT SWITCH, THEY WENT DOWN ABOUT 3/4 OF THE WAY AND WERE STUCK THERE.  I TRIED SEVERAL TIMES BUT THEY REMAINED STUCK.  THEY DID GO BACK UP TO THE CLOSED POSITION, BUT NOT DOWN ALL THE WAY.  ALSO THE DRIVER'S SIDE FRONT WINDOW WAS ERRATIC.  SOMETIMES GOING UP AND DOWN AND SOMETIMES STICKING.  I MADE AN APPOINTMENT FROM MY COMPUTER ASKING FOR AN APPOINTMENT FOR ELECTRICAL PROBLEMS WITH THE WINDOWS AND TOOK THE FIRST APPOINTMENT AVAILABLE WHICH WAS FOR FRIDAY JANUARY 24, AT 1PM.     ON THE AFTERNOON OF JANUARY 20TH MY CAR CAUGHT ON FIRE.  THE CAR WAS PARKED OUTSIDE, ALL THE WINDOWS ROLLED  WITH NO ONE IN IT. THE CAR HAD 1300 MILES ON THE ODOMETER.     I WAS INSIDE MY HOME AT THE TIME AND HAD NOT BEEN OUTSIDE THAT DAY AND THE CAR HAD NOT BEEN DRIVEN.  I NOTIFIED MY INSURANCE COMPANY AND CALLED DCH HONDA WHO INSTRUCTED ME TO HAVE THE CAR TOWED TO THEIR SERVICE CENTER WHICH I DID. THE CAR HAS BEEN AT THE HONDA DEALERSHIP SINCE JANUARY 20 AND IS STILL THERE.      I HAVE BEEN TOLD BY THE DCH SERVICE MANAGER THAT HONDA COMPANY DOES NOT FIND THAT THE FIRE WAS CAUSED BY ELECTRICAL PROBLEMS. I HAVE BEEN TOLD THAT THERE HAS BEEN AN INVESTIGATION OF THE FIRE AND I HAVE ASKED FOR A COPY BUT THEY HAVEN'T SENT IT TO ME.  *TR",
        "vin": "JHMGE8H3DC0"
    },
    {
        "components": "TIRES,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567003,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE TIRE PRESSURE MONITORING SYSTEM AND THE TRACTION CONTROL SYSTEM FAILED. THE TIRES WERE LOSING PRESSURE WITHOUT WARNING AND THE TRACTION CONTROL SYSTEM FAILED TO ENGAGE WHEN THE CONTACT WAS ATTEMPTING TO PASS A VEHICLE.  THE DEALER DID NOT INSPECT THE VEHICLE NOR PERFORM A DIAGNOSTIC TEST. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 800 AND THE CURRENT MILEAGE WAS 5,200.  *TR",
        "vin": "JHMGE8H56DC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563029,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT WHILE TRAVELING APPROXIMATELY 25 MPH, THE FRONT WINDSHIELD SUDDENLY BECAME FRACTURED. THE CONTACT INDICATED THAT NOTHING HAD MADE CONTACT WITH THE FRONT WINDSHIELD TO CAUSE THE DEFECT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 12000.",
        "vin": "JHMGE8H33DC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: I1410516A. 2013 HONDA FIT. CONSUMER STATED ON A BRIGHT DAY, THE DASHBOARD INSTRUMENTS CAN NOT BE READ. CONSUMER BELIEVES THIS IS A SAFETY CONCERN. *LN",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562089,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DAYTIME DRIVING, ON A BRIGHT DAY THE INSTRUMENTS CAN NOT BE READ.  THERE IS NO CONTROL TO INCREASE BRIGHTNESS OF THE INSTRUMENT CLUSTER IN DAYTIME DRIVING.  ONLY BY TURNING ON HEADLIGHTS CAN A BRIGHTNESS CONTROL FOR THE DASHBOARD BE ACTIVATED BUT THE BRIGHTEST SETTING IS STILL TO DIM TO ALLOW THE INSTRUMENTS TO BE READ IN STRONG AMBIENT LIGHTING CONDITIONS.   I BELIEVE THIS IS A SAFETY ISSUE BECAUSE A DRIVER IS UNABLE TO READ SPEED, FUEL OR TELL IF WARNING LIGHTS ARE ON.  *TR",
        "vin": "JHMGE8H57DC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE VEHICLE SUDDENLY ACCELERATED WHILE SHE DRIVING 50 MPH. THE CONTACT WAS ABLE TO CONTROL THE VEHICLE BY DEPRESSING THE BRAKE PEDAL WITH FORCE. THE FAILURE WAS EXPERIENCED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER, WHO TEST DROVE THE VEHICLE BUT WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 7,000 AND THE CURRENT MILEAGE WAS 8,000.",
        "vin": "JHMGE8H37DC"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/22/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521166,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DOING A PARALLEL PARKING ON A QUIET CITY STREET.  I WAS DOING 3 OR LESS MILES PER HOUR WHEN SUDDENLY MY BRAKES FAILED AND MY CAR CONTINUED TO GO! IT RAN INTO THE SIDEWALK AND SOME BUSHES.  I WAS HORRIFIED NOT BEING IN CONTROL ANYMORE. I TURNED OFF THE ENGINE WITH MY KEY.  THE FRONT OF MY CAR HAS BEEN DAMAGED A LOT.  IT IS AT A MECHANIC AND BODYWORK SHOP.  I WOULD LIKE TO BE ABLE TO SUE THE MAKER OF MY CAR.  *TR",
        "vin": "JHMGE8H39DC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "04/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509322,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE DOORS FAILED TO OPEN. AFTER 30 SECONDS, THE DOORS WERE ABLE TO BE OPENED HOWEVER, THE ANTI-THEFT ALARM ALSO ACTIVATED. THE CONTACT WAS ABLE TO ENTER THE VEHICLE AND START THE ENGINE, DEACTIVATING THE ANTI-THEFT ALARM. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 841.  *TR",
        "vin": "JHMGE8H36DC"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/25/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING A PARKING PLACE AT APPROXIMATELY 3 MPH, TRYING TO ADJUST THE ANGLE OF ENTRY.  WHEN I STEPPED ON THE ACCELERATOR THE CAR BOLTED FORWARD.  I APPLIED THE BRAKE BUT THE ACCELERATION WAS TOO FAST TO KEEP THE BRAKE FROM STOPPING THE CAR FROM COLLIDING WITH THE GUARD RAIL.  THE IMPACT CAUSED THE AIR BAGS TO EJECT.  THE HOOD WAS DENTED, THE RIGHT FENDER AND BUMPER WERE DISENGAGED FROM THE BODY AND THE RIGHT HEADLIGHT WAS BROKEN.  THE REPAIR CAME TO OVER $10,000. IF THE GUARD RAIL HADN'T STOPPED THE CAR IT WOULD HAVE GONE OVER FROM THE 6TH FLOOR TO THE 5TH FLOOR.  FORTUNATELY MY PASSENGER AND I WERE NOT INJURED DUE TO THE AIR BAGS EJECTING.  MY CONCERN WITH THIS CAR IS THAT THE ACCELERATOR PEDAL IS TOO \"TOUCHY.\"    THE DEALER HAD HIS MECHANIC CHECK THE CAR AFTER IT WAS FIXED DECLARING THAT THIS WAS THE NATURE OF THAT MODEL.  HAD I KNOWN THAT I WOULD NOT HAVE PURCHASED THE CAR. I'M STILL WARY ABOUT DRIVING THE CAR THREE MONTHS LATER.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503323,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE DO NOT DRIVE AT NIGHT MUCH BUT WHEN WE DID RECENTLY  THE HEADLIGHTS  DIO NOT PROJECT FAR ENOUGH INTO THE DISTANCE  THEY ARE WIDE ENOUGH AND SEEM TO BE SET AT THE RIGHT HEIGHT  BUT AS I SAID THEY DO NOT SHOW FAR ENOUGH IN THE DISTANCE TO SEE DEER ETC  THIS HAS BEEN ALREADY HAD A  NOTICE IN THE CONSUMERS REPORT  APR ISSUE   THIS CAN BE A DANGEROUS SITUATION   ALSO NOT AS IMPORTANT  BUT THE CAR DOES NOT COME WITH A VALOR KEY  SO IF YOU GET LOCKED OUT YOU CAN'T GET BACK IN  THIS CAN BE A PROBLEM IN CERTAIN CASES  WE BUY A NEW CAR EVERY 5 YRS AND THIS IS THE FIRST TIME I HAVEN'T GOTTEN A VALET KEY   AND THERE ARE TIMES WHEN IT WOULD BE A GREAT  EMERGENCY   THANKS  HOPE THIS IS CORRECTED  AND THE ONLY WAY IS IF HONDA FEELS THE PRESSURE  OF THE CONSUMER  THANKS  *TR",
        "vin": "DC005058"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/18/2012",
        "dateOfIncident": "09/17/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475885,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA FIT. THE CONTACT STATED THAT THE AIR CONDITIONER FAILED. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT A ROCK HAD PUNCTURED ONE OF THE FREON LINES. AS A RESULT, THE COMPRESSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,600 AND THE CURRENT MILEAGE WAS 1,631.",
        "vin": "JHMGE8H38DC"
    }
]