[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443269,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We were driving our Honda in a 70mph zone and the car's speed suddenly dropped to 15mph.  We were not able to drive any faster than 15mph and could have been killed while driving on a highway where other cars were driving at 70mph, or we could have caused a pile up of cars with multiple accidents.  We were very lucky that we were able to pull over to the side of the highway before another car hit us.  We were not even able to drive to an exit, and had to sit on the side of a busy highway for nearly 3 hours as we waited for a tow truck.  Multiple warning lights came on at the same time the speed of the car suddenly dropped.  Warning lights for most systems on the car starting flashing at this point, but not in advance to warn us.  We had the car towed to a local mechanic and he told us that a piston in the engine had failed completely and the engine would need to be rebuilt.   We contacted Honda on the first business day after our engine failed, which was Monday, November 15. The engine in our car is currently under an extended warranty with Honda because of problems with the pistons and engine.  It was not part of a recall, but definitely should have been!  Instead, Honda called it a \"customer preference\".  Honda admitted to us on the phone that this was part of the \"customer preference\" and that the Honda dealer should repair the engine as part of the extended warranty; however, it has been nearly a month since our initial call to Honda and they still have not authorized the work.  We have called them approximately 15-20 times in the past month and they continue to evade our calls by telling us that \"a manager will get back to us\".  We have been told this repair will cost approximately $10,000, and therefore, it's not an option for us to just pay for the repair ourselves.  Honda is aware of this safety issue, they have not issued a recall for it and they clearly have no intention of honoring their warranty for this issue.  As consumers, we don't know what to do.",
        "vin": "JHMZE2H74DS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363413,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VISOR ON THE DRIVERS SIDE WILL NOT STAY UP.  IT FALLS DOWN AND OBSTRUCTS THE DRIVERS VIEW.  EVEN WHEN IT IS PUSHED ALL THE WAY FORWARD, IT DROPS BACK AND OBSTRUCTS THE VIEW.  IT STARTED DROOPING A FEW YEARS AGO, BUT NOW HAS COMPLETELY FALLEN. LOOKING ONLINE, THERE ARE A LOT OF REPORTS OF THIS HAPPENING TO OTHER HONDA OWNERS.",
        "vin": "JHMZE2H59DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327618,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PROGRESSIVE INCREASE IN LOSS OF MOTOR OIL FOR THE PAST 12 MONTHS. I HAVE TO ADD 1 QUART OF 0W-20 VALVOLINE SYNTHETIC MOTOR OIL EVERY 2 WEEKS! DARK SMOKE COMING OUT EXHAUST WITH ACCELERATION. KNOCKING SOUND FROM THE MOTOR OBSERVED. I USED TO HAVE HONDA ACCORD AND NEVER HAD THIS PROBLEM.",
        "vin": "JHMZE2H79DS"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318635,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SO MY 2013 HONDA INSIGHT HAS ALWAYS CONSUMED OIL. I DROVE FROM IDAHO TO UTAH STOPPED AT THE STORE WHEN I STARTED MY VEHICLE UP MY DISPLAY HAS CHECK VSA, CHECK HILL START ASSIST SYSTEM, AND CHECK TPMS. I TRIED DRIVING AWAY FROM THE STORE TO GET TO HONDA AND IT LOSES ALL POWER AND BARLEY MOVES. KINDA LIKE A SAFE MODE AND DOES THIS EVERY TIME I START MY CAR.",
        "vin": "JHMZEZH72DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282751,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING 65MPH ON HIGHWAY WITH CRUISE CONTROL ON. LOST POWER AND CHECK ENGINE LIGHT CAME ON. I PULLED TO THE SHOULDER, ENGINE CONTINUED TO RUN, BUT WOULD NOT ACCELERATE. TURNED CAR OFF AND BACK ON AND MULTIPLE CHECK MESSAGES DISPLAYED. I HAD CAR TOWED TO LOCAL HONDA DEALER SHOP. THEY INFORMED ME SPARK PLUGS NEEDED TO BE REPLACED. I AGREED, BUT NEXT DAY THEY CALLED TO TELL ME THE ENTIRE ENGINE NEEDED TO BE REPLACED. HONDA HAS EXTENDED THE ENGINE WARRANTY, BUT NO ONE FROM DEALER MENTIONED THAT. THEY WANTED MORE FOR NEW ENGINE THAN THE CAR IS WORTH.",
        "vin": "JHMZE2H76DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA INSIGHT. WHILE DRIVING AT LOW SPEEDS, THE VEHICLE STALLED AND ALL THE INSTRUMENT PANEL WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE SPARK PLUGS WERE REPLACED AND MORE OIL WAS ADDED TO THE VEHICLE. THE CONTACT MENTIONED THAT THE VEHICLE WAS BURNING EXCESSIVE OIL AND MORE OIL WAS NEEDED EVERY 1,000 MILES. THE VEHICLE WAS TAKEN TO ALTOONA HONDA (201 VALLEY VIEW BLVD, ALTOONA, PA 16602, (814) 944-4517) WHERE AN OIL CONSUMPTION TEST WAS PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 76,276.",
        "vin": "JHMZE2H57DS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254159,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA INSIGHT. WHILE ACCELERATING FROM A STOP, THE ACCELERATOR PEDAL HAD TO BE DEPRESSED WITH FORCE FOR THE VEHICLE TO ACCELERATE. ALSO, THE VEHICLE EMITTED A METAL RATTLING NOISE AND THE ENGINE WAS LOSING OIL PREMATURELY. THE CONTACT BELIEVED THAT THE ENGINE LOSING OIL MAY HAVE CAUSED THE VEHICLE TO LOSE ACCELERATION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND DEALER WERE NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 56,000.",
        "vin": "JHMZE2H5XDS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222773,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA INSIGHT. WHILE DRIVING 73 MPH, THE VEHICLE DECELERATED AND SHUT OFF. THE CONTACT COULD NOT COAST THE VEHICLE AND LET IT VEER OFF TO THE SHOULDER. THE VEHICLE WOULD NOT RESTART AND WAS TOWED TO THE CONTACT'S HOME. THE VEHICLE WAS TAKEN TO VANDERGRIFF HONDA (1104 W INTERSTATE 20, ARLINGTON, TX 76017, (817) 533-4266), BUT THEY STATED THAT THEY COULD NOT ASSIST. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,514.",
        "vin": "JHMZE2H35DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132006,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL    DEALER FAILURE TO ADDRESS-REMEDY SITUATION (PLEASE SEE ATTACHMENT)",
        "vin": "JHMZE2H72DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA INSIGHT. UPON INSPECTION, THE CONTACT NOTICED AN ABNORMALLY LOW OIL LEVEL AFTER DRIVING 2,000 MILES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO WINTER HONDA (3850 CENTURY CT, PITTSBURG, CA) WHERE IT WAS CONFIRMED THAT THE VEHICLE CONSUMED AN ABNORMAL AMOUNT OF OIL. THE DEALER STATED THAT THERE WERE NO FURTHER ACTIONS THAT COULD BE TAKEN AT THAT TIME DUE TO THE CONSUMPTION BEING LESS THAN ONE QUART EVERY 1,000 MILES. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 56,000.",
        "vin": "JHMZE2H36DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029670,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA INSIGHT. CONSUMER WRITES IN REGARDS TO EXCESSIVE OIL CONSUMPTION. *LD CONSUMER SENT ADDITIONAL CORRESPONDENCE. *LD CONSUMER SENT ADDITIONAL CORRESPONDENCE.      THE CONSUMER STATED THE VEHICLE WOULD SHAKE AND HESITATE WHILE DRIVING. *JS    THE CONSUMER STATED THE ENGINE DIED TWICE ALMOST CAUSING A CRASH. THE CONSUMER WAS INFORMED THE VEHICLE WAS OPERATING AS DESIGNED. *JS",
        "vin": "JHMZE2H54DS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073569,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COMPLETELY MALFUNCTIONED AFTER 3 YEARS, SINGLE OWNER AND REGULAR MAINTENANCE. COULD NOT BE REBUILT, FLYWHEEL INVOLVED AS WELL.",
        "vin": "JHMZE2H5XDS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "01/25/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045051,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW 2013 HONDA INSIGHT.THE CAR HAD EXCESSIVE OIL CONSUMPTION FROM THE VERY BEGINNING. IT REQUIRED ONE QUART OF OIL TO BE ADDED EVERY 2-3 WEEKS. WE REPEATEDLY VOICED OUR CONCERNS IN AT LEAST 5 OCCASIONS. EACH TIME WE WERE TOLD BY THE THE DEALERSHIP THAT THE OIL CONSUMPTION 'WAS NORMAL'.  OUR COMPLAINTS WERE IGNORED, OUR CONCERNS DISMISSED.ON JANUARY 25, 2017, WHILE MY HUSBAND WAS DRIVING ON HIGHWAY I-78, THE ENGINE SUDDENLY STARTED LOSING POWER AND COMPLETELY STALLED. LUCKILY, THERE WERE NO OTHER VEHICLES BEHIND. THE CAR WAS TOWED TO THE DEALER, IT WAS DISCOVERED THERE THAT A CYLINDER EXHAUST VALVE HAD BROKEN OFF, CAUSING SEVERE AND IRREPARABLE DAMAGE TO PISTONS AND THE CYLINDER HEAD. THE ENGINE WAS RENDERED USELESS. AMERICAN HONDA REJECTED TO COVER ANY OF THE EXPENSES.  WE WERE TOLD TO PURCHASE A USED ENGINE, WHICH COST US $4,689.51 OUT OF OUR POCKET IN ENGINE, PARTS AND LABOR. AFTER THE REPAIRS, THE CAR CONTINUED HAVING EXCESSIVE OIL CONSUMPTION. ON AUGUST 24, 2017, THE 2ND ENGINE ALSO BLEW UP, COINCIDENTALLY WHILE DRIVING ON HIGHWAY I-78.  THIS TIME, WE WERE INFORMED THAT THERE WAS AN INTERNAL MEMO FROM AMERICAN HONDA, EXTENDING ENGINE WARRANTY TO 8 YEARS FOR INSIGHT MODELS 2012 AND 2013. AMERICAN HONDA KEEPS THIS WARRANTY EXTENSION QUIETLY. IT MIGHT APPEAR THAT THEY ARE JUST WAITING FOR ACCIDENTS AND/OR COMPLAINTS TO HAPPEN, AND ONLY THEN OFFER THE WARRANTY EXTENSION. I BELIEVE THIS IS A BIG SAFETY AND WARRANTY ISSUE. I FEAR FOR MY HUSBAND'S AND OTHER CONSUMERS' SAFETY. AMERICAN HONDA REJECTED HONORING THE WARRANTY COVERAGE, NOT TO REIMBURSE US FOR THE $4,689.51 WE PAID FOR THE FIRST TIME ENGINE REPLACEMENT. THIS REQUEST OF OURS WAS REJECTED FOR WITHOUT SUBSTANTIVE ARGUMENTS. WHILE AMERICAN HONDA FAILED TO ADDRESS THIS ISSUE, ENGINES FOR THIS MODEL STARTED FAILING AT ABOUT THE 100K MILE MARK, SOMETHING THAT HAS HAPPENED TO MANY INSIGHT CAR OWNERS.",
        "vin": "JHMZE2H76DS"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "01/30/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043313,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS ON-GOING \"OIL CONSUMPTION\" ISSUES THAT AMERICAN HONDA NEGLECTED TO ADDRESS. AS A RESULT, THE OIL GOES UP EXHAUST PIPES TO CAUSED ENGINE OVER HEAT AND BLOW UP DURING DRIVING ON HIGHWAY. AMERICAN HONDA ISSUED AN \"INTERNAL MEMO\" TO EXTEND ENGINE WARRANTY TO 8 YEARS WITHOUT NOTIFYING CAR OWNERS. HOWEVER, THEY FAILED TO COVER OUR BLEW-UP ENGINE WHEN THE FIRST TIME HAPPENED AND CHARGED US $4600 FOR AN USED ENGINE. WITHIN 8 MONTHS, THE SECOND ENGINE BLEW UP AGAIN ON THE HIGHWAY. AMERICAN HONDA FINALLY COVERED THE SECOND ENGINE REPAIR. THE AMERICAN HONDA REJECTED TO REIMBURSE THE FIRST ENGINE BLOW-UP. THEY DENIED ANYTHING WRONG WITH THE ENGINE, BUT THE EXTENDED THE WARRANTY TO 8 YEARS??? WE HAVE THE RECORDS FOR BOTH ENGINE BLOW-UPS.",
        "vin": "JHMZE2H76DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2017",
        "dateOfIncident": "09/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION - WARNING LIGHTS DO NOT COME ON TO TELL YOU THERE IS AN ISSUE WITH LOW OIL.  ONLY NOTICE AT TIME OF OIL CHANGES THAT LEVELS SEEMED LOW.  AND NOT OIL IS BASICALLY NEEDING TO BE CHECKED AND MONITORED LIKE GAS. AND THEN SUDDEN EMISSION LIGHT AT ONLY 60,000 MILES ON THE CAR AND I AM TOLD ALL THEY WILL DO IS FIX SOMETHING ONCE IT BREAKS.  WHY WONT HONDA JUST REPLACE ENGINE PIECES WITHOUT CONTINUED IMPACT ON MY TIME.  THIS OIL TEST IS GOING TO COST ME AN ADDITIONAL 2 HOURS OUT OF MY DAYS COMING UP FOR EVERY 1000 MILES, 3X!",
        "vin": "JHMZE2H5XDS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022443,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON INTERSTATE, CHUG CHUG, STOP; LIFE IN DANGER, STUCK ONE HOUR, WAITING FOR AAA; TOWED, HONDA DEALER, OIL CONSUMPTION BLOWS OUT SPARK PLUGS; HONDA ISSUES EXTENDED WARRANTY; AN OIL TEST IS DONE; LIFE IS IN DANGER FOR SEVERAL MONTHS DRIVING 1,000 MILES AT A TIME; VEHICLE COULD COME TO COMPLETE STOP AT ANY MOMENT. THIS SHOULD BE A RECALL, A LAWSUIT; NOTHING THE DRIVER CAN DO; OWNER PAYS FOR THE FIRST REPAIR; WHY? IT IS HONDA'S DEFECT. DEATH BEFORE REPAIR AN ACTUAL CONCERN.",
        "vin": "JHMZE2H38DS"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019531,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR CARBON BUILD UP IN A CAR THAT HAS LESS THAN 63,000 MILES ON IT.",
        "vin": "JHMZE2H30DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004286,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NO LOANER CAR TO DRIVE FOR MORE THAN ONE WEEK",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "02/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992264,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2013 HONDA INSIGHT. THE CONTACT STATED THAT THERE WAS A PREMATURE FAILURE OF THE ENGINE ASSEMBLY. THE DEALER (HONDA OF SALEM, 1101 VAN NESS AVE NE, SALEM, OR 97301, (971) 701-2708) INDICATED THAT THERE WAS A SERVICE CAMPAIGN AND AN EXTENDED SERVICE CAMPAIGN TO REMEDY THE FAILURE. THE DEALER DIAGNOSED THAT THE OIL CONTROL RINGS BUILT UP RESIDUE, WHICH CAUSED THE ENGINE TO SEIZE. ALSO, THERE WAS A LACK OF OIL INTERNALLY AS THE FAILURE OCCURRED. THE CONTACT WAS TO CHECK WITH THE MANUFACTURER TO DETERMINE A SOLUTION AND TO TRADE-IN THE VEHICLE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "JHMZE2H78DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10955304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG ON THE HIGH WAY DRIVING NORMALLY AND ALL OF A SUDDEN MY STEERING WHEEL AIRBAG WENT OFF, I HIT MY BRAKES IMMEDIATELY OUT OF FEAR. MY HAND WAS CUT, BRUISED AND SLIGHTLY BLEEDING. LUCKILY I DIDN'T HIT ANYONE. FROM MY UNDERSTANDING THIS MODEL OF CAR IS IN RECALL, YET MY VIN ISN'T ONE OF THEM. IT SCARES ME THAT THIS HAS BEEN A TICKING TIME BOMB SINCE I BOUGHT THIS CAR NEW. I FEEL LOST SINCE HONDA SAYS MY CAR ISN'T ONE THAT NEEDS TO BE RECALLED, YET WHY WOULD MY AIR BAG JUST DEPLOY WHILE DRIVING?",
        "vin": "JHMZE2H74DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE LIFE TIME OIL CHANGES, I HAD THE OIL CHANGED ON 10/27/16, I ADVISED, FOR THE SECOND TIME THAT IT WAS USING QUITE A BIT OF OIL (IT WAS LOW AGAIN). THEY SAID IT WAS NORMAL FOR THE CAR. ON DECEMBER 1, I WAS ON THE FREEWAY AND MY CAR STALLED. I WAS ABLE TO PULL OFF OF THE FREEWAY AND HAD TO WAIT FOR A TOW TRUCK AS MY CAR WOULD NOT START. WE HAD THE CAR TOWED TO THE DEALERSHIP, AND WHEN THEY ESTIMATED THE REPAIRS, IT WAS $8200.00 TO FIX. THE CAR IS NOT EVEN WORTH $7500.00. THEY TOLD ME THAT THE VALVE TIGHTENED, WHICH WAS RARE AT THIS MILEAGE, CAUSING THE SPARK PLUGS TO MELT, BURN THE EXHAUST VALVE, AND A BURNT CYLINDER HOLE. I WAS INFORMED BY THE DEALERSHIP THAT VALVE JOBS DON'T OCCUR UNTIL 100,000 MILES IN THESE VEHICLES. THEY ALSO SAID THAT THE OIL SHOULD HAVE BEEN CHANGED MORE OFTEN DUE TO THE OIL CONSUMPTION. I WAS ALREADY ADDING OIL IN BETWEEN OIL CHANGES. DUE TO THE COST OF THE REPAIRS, I AM IN SEARCH OF A REPLACEMENT MOTOR TO INSTALL INSTEAD OF HAVING THE DEALERSHIP REBUILD IT.  *TR",
        "vin": "JHMZE2H31DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2017",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924719,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA INSIGHT.  CONSUMER WRITES IN REGARDS TO UNINTENDED ACCELERATION AND TEMPORARY BRAKE FAILURE.  *SMD  CONSUMER SENT ADDITIONAL CORRESPONDENCE.  *SMD SENT AGAIN ON 12/22/16, 1/11/17.  *SMD     THE CONSUMER STATED WHILE THE BRAKE PEDAL WAS DEPRESSED, THE ENGINE  MADE A LOUD NOISE OF ACCELERATION AND THE VEHICLE SPED UP. ON A SEPARATE OCCASION THE OIL, CHECK ENGINE, CHECK EMISSION, CHECK HILL START ASSISTANT, AND CHECK VSA LIGHT ALL ILLUMINATED. THE ENGINE SHUTTERED.   *JS     THE CONSUMER STATED THE ENGINE OIL DIP STICK SHOWED A DROP OF OIL BELOW THE LOWEST OF THE TWO HOLES. THE CONSUMER ADDED OIL. HOWEVER, SEVEN DAYS LATER, THE OIL WAS LOW AGAIN.  THE CONSUMER STATED THE VEHICLE IS EXCESSIVELY BURNING OIL. *JB  UPDATED 08/4/2017*JS  *JS  *JS",
        "vin": "JHMZE2H54DS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928657,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD BEEN SITTING FOR 2 AND A HALF WEEKS WHILE I WAS OUT OF THE COUNTRY. UPON STARTING THE CAR, CHECK BRAKE SYSTEM, CHECK VSA SYSTEM, CHECK HILL START ASSIST SYSTEM, SERVICE DUE SOON AND CHECK EMISSION LIGHTS ILLUMINATED ON MY DASHBOARD. WHEN I BEGAN TO ACCELERATE, THE CAR ONLY GOT UP TO 5 MILES PER HOUR. IT WAS A 7 MINUTE DRIVE FROM AIRPORT PARKING TO MY RESIDENCE. I PARKED THE CAR AND IT SAT OVER THE THANKSGIVING WEEKEND. THE FOLLOWING WEEK I HAD THE CAR TOWED TO THE MCDAVID HONDA IN IRVING, TX. I GAVE DETAILED HISTORY FROM THE TIME OF PURCHASE A YEAR AND HALF AGO. I ADVISED THE DEALERSHIP, I WAS FULL AWARE OF THE EXCESSIVE OIL BURNING IN ISSUE THAT HAD BEEN PREVIOUS DIAGNOSED AT THE ORIGINAL HONDA DEALERSHIP I PURCHASED THE CAR FROM. I KEPT UP WITH EXCESSIVE OIL CHANGES THAT NEEDED TO BE DONE. THE SERVICE TECH SAID IT HAD ZERO OIL AND THE PISTON RINGS WOULD NEED TO BE CHANGED. HE AND HIS MANAGER STATED THAT THEY WOULD COMPLETE AN OIL CHANGE AT MY EXPENSE, I WOULD NEED TO DRIVE THE CAR A THOUSAND MILES AND THEN IMMEDIATELY RETURN THE CAR TO THE DEALERSHIP, IF THE PROBLEM OCCURRED THEN THE DEALERSHIP WOULD COVER THE COST. I ADVISED THEM AGAIN I HAD ALREADY DONE THAT TYPE OF TESTING PREVIOUSLY. BUT, THEN, SERVICE TECH PROCEEDS TO EXPLAIN I ALSO NEED ALL 8 SPARK PLUGS CHANGED AT MY EXPENSE.  HONDA IS FULLY AWARE OF THE EXCESSIVE OIL CONSUMPTION ISSUE WITH THE INSIGHTS.  THIS IS A 2013, 57,000 MILES, UP TO DATE SERVICE RECORD. I DO NOT FEEL SAFE DRIVING THIS CAR ANYMORE. THE UNCERTAINTY IS OVERWHELMING.  *TR",
        "vin": "JHMZE2H39DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "11/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925360,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE MADE MULTIPLE ATTEMPTS TO CONTACT BOTH HONDA DIRECTLY THROUGH CUSTOMER SERVICE AND THE LOCAL DEAL WHERE I PURCHASED THE CAR.  HAVE REQUESTED TO HAVE AIR BAG CHANGED. HONDA INFORMED ME A YEAR AGO THAT THE PARTS WERE BEING DELIVERED.  AT EACH OF THE LAST THREE CALLS I HAVE MADE TO THE DEALER OVER THE PAST 9 MONTHS I HAVE BEEN TOLD PARTS ARE ON ORDER AND TO WAIT.  I HAVE REQUESTED ADDITIONAL OPTIONS AND WAS TOLD THAT I WOULD JUST HAVE TO WAIT.  NEITHER THE DEALER NOR HONDA HAS OFFERED ANY FURTHER TIME FRAME NOR OPTIONS TO ADDRESS MY CONCERNS REGARDING THE AIRBAG.  CAN SOMEONE PLEASE HELP WITH GETTING THIS ADDRESSED?",
        "vin": "JHMZE2H5XDS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923911,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA IS BURNING OIL FROM THE INGINE.NO LEAKS. I CAN GET A OIL CHANGE TODAY AND IN 5 DAYS I NEED MORE OIL. I'VE TAKEN IT TO THE DEALERSHIP AND SEE ONLINE 64 COMPLAINTS OF THIS CODE 1982A. NOW THE DEALER WANTS ME TO PAY ALMOST 4,000 DOLLARS TO GET IT FIX WHEN THEY KNOW THEY SOLD ME A LEMON. HONDA DEALER SAID I NEED PISTONS,RINGS AND SPARK PLUGS. TODAY THEY GAVE ME A LOANER CAR BUT SAYS I HAVE TO PAY 485 TO BREAK DOWN MY ENGINE AND POSSIBLY 485 TO PIT IT BACK TOGETHER AFTER THE TEST.",
        "vin": "JHMZE2H36DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903542,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NEVER NOTIFIED FROM THE MANUFACTURER THAT MY NEW CAR WAS UNDER RECALL FOR A YEAR. I ONLY FOUND OUT WHEN I TOOK IT IN TO GET REGULAR SERVICE. MY SON BOUGHT HIS CAR, ALSO A 2013 INSIGHT, AND HE WAS NEVER NOTIFIED. I AM LIVID. PLEASE HOLD THEM ACCOUNTABLE FOR NOTIFYING OWNERS THERE IS A DANGER.",
        "vin": "JHMZE2H79DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896533,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. IT HAS BEEN 1 1/2 YEARS SINCE I PURCHASED THIS CAR, AND I HAVE HEARD NOTHING FROM THE DEALER (WHO SOLD ME THE CAR TO BEGIN WITH), THE MANUFACTURER OR ANYONE ELSE. I LIVE IN NEW JERSEY WHERE CAR ACCIDENTS ARE COMMON AND I DRIVE AROUND 100 MILES A DAY. WHY CAN'T MY DANGEROUS AIRBAG BE FIXED OR SOME OTHER OPTION LIKE A RENTAL, ETC.",
        "vin": "JHMZE2H74DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894258,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION FIXED BY HONDA AFTER WARRANTY EXPIRED AND AT NO COST WITH FREE LOANER CAR!!!    THERE IS A SERIOUS PROBLEM WITH THE NEWER GEN HONDA ENGINES! MY PERSONAL OPINION IS BAD PISTON RINGS!!! GROVES ARE CREATED OVER TIME AND THUS OIL IS CONSUMED INTO THE BLOCK. I DID THE RECOMMENDED OIL CONSUMPTION TEST AT DEALER AND BY THE END I WAS LOSING 1 QT OIL EVERY 800 MILES. NEW SHORT BLOCK INSTALLED AT AROUND 79K MILES. THIS IS A MANUFACTURING DEFECT AND HONDA WILL, SHOULD MAKE IT RIGHT. TO ALL THE PEOPLE GOING THROUGH THIS, BE PERSISTENT!!!!",
        "vin": "JHMZE2H78DS"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887589,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE WOULD LOSE A CONSIDERABLE AMOUNT OF OIL OVER DECREASING AMOUNT OF MILES TO THE POINT WHERE THE CAR NOW LOSES 1.5 QUARTS OF OIL EVERY 1,000 MILES (VERIFIED BY LOCAL HONDA DEALER SHOP CAN NOT SUPPORT TO INVESTIGATE WHY FULL TANK OF ENGINE OIL WAS BURNED OFF, ASKED CA CHULA VISTA HONDA DEALER BUT THEY SAID NO PROBLEM?  ONLY ERASE A CAUTION SIGN ' CHECKED ENGINE'  AT THE RESULTS, WHILE I DROVE I COULD HEAR VERY NOISY SOUND  SO I STOPPED , YOU CAN SEE SOME PISTON CLUTCH WAS DAMAGED  AND RECOGNIZED MANY BURNED PLATE SURFACE IN SIDE OF ENGINE  ROOM !! I REALLY NEED YOUR HELP",
        "vin": "JHMZE2H51DS"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HONDA INSIGHT 2013 APPARENTLY HAS DEFECTS IN THE OIL CONSUMPTION LEVEL.  I WAS DRIVING MY CAR A MONTH AGO WITH MY OIL SERVICE RENEWED COMPLETELY AT A DEALERSHOP AND SUDDENLY A MONTH LATER THE CAR STARTED TO SHOW ME SIGNS OF (OIL CHANGE NEED TO REPAIR) AND AN EMISSION SYSTEM SIGNAL ON THE FRONT LED SCREEN INSIDE THE CAR.  I KNEW AT THE MOMENT IT WAS NOT MY FAULT FOR NOT PUTTING THE OIL ON TIME BUT IT WAS THE CAR'S OIL CONSUMPTION LEVEL  I KNOW THIS BY EXPERIENCE BECAUSE ON THE OTHER CARS IT DOES NOT HAPPEN BUT THE HONDA INSIGHT DOES.  IT ALSO MADE A LARGE CLUNK NOISE WHICH MEANT THAT I HAD TO PUT MORE OIL INSIDE THE CAR TO KEEP THE CAR FROM NOT FUNCTIONING ANYMORE.  THERE NEEDS TO BE A RECALL FOR THIS TYPE OF VEHICLE BECAUSE I FEEL LIKE I AM NOT THE ONLY PERSON THAT HAS THIS TYPE OF PROBLEM.",
        "vin": "JHMZE2H51DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "05/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872828,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE ENGINE OIL CONSUMPTION. ENGINE STALLING WHEN TRYING TO ACCELERATE. LARGE CLOUD OF BLUE SMOKE COMING FROM TAIL PIPE WHEN ACCELERATING UP TO HIGHWAY SPEEDS. ALL THIS HAS HAPPENED SEVERAL TIMES.",
        "vin": "JHMZE2H30DS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860603,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA INSIGHT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,598.",
        "vin": "JHMZE2H35DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850203,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION. USES A MINIMUM OF 1 QUART EVERY 1,000 MILES. HONDA REFUSES TO DO ANYTHING WITH REPAIRING IT.",
        "vin": "JHMZE2H72DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2015",
        "dateOfIncident": "11/12/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 24500 MILES, I DROVE FOR 1500MILES RIG1500MILESOIL SERVICE AT DEALER, THE ENGINE LIGHT CAME ON. I CONTACT THEM AND THEY TOWED THE VEHICLE TO THE DEALER/SERVICE. THEY FILLED THE ENGINE AND TOLD ME TO DRIVE 1000 MILES AND CAME BACK FOR THEM TO TEST OIL CONSUMPTION.   I DID IT FOR 2 TIMES CONSECUTIVE AND THEY SAY IT WAS WITHIN NORMAL LEVEL. I ASK THEM TO TEST AGAIN. THEY AGREE. NOW, AFTER DRIVE 1500 MILES I WENT BACK AND THERE WAS NO OIL IN THE ENGINE. A FRACTION BELOW THE LOWER LEVEL. NOW, THEY WILL SUBMIT A REPAIR REQUEST TO HONDA OF USA, BUT, MY VEHICLE IS UP TO 27500 MILES. TECNICALY NOT COVERED BY WARRANTY. BUT SENSE I NOTICE AND THEY DOCUMENTED THE PROBLEM BEFORE 25000, IT WILL BE REPAIRED UNDER WARRANTY. WHAT WILL HAPPEN AFTER ANOTHER 5000 MILES ONLY GOD KNOWS. HONDA OF USA SHOULD DO A RECALL ON  ENGINE RINGS AND PISTONS OR EVEN REPLACE IT ALL.",
        "vin": "JHMZE2H74DS"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750201,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVELY BURN ENGINE OIL. DEFECTIVE PISTON RINGS      CAR WAS STALLING ON FREEWAY WITH \"CHECK ENGINE\" \"CHECK BRAKE\" \" \"CHECK HILL START ASSISTANT\" \"CHECK VSA\" LIGHT FLASHING.    I RESEARCHED AND FOUND EXACT SAME SYMPTONS WHICH WAS FILED FOR 2012 HONDA INSIGHT.  REFER TO NHTSA ID NUMBER: 10747250.    HE HAS DESCRIBED WHAT I'M EXPERIENCING WORD BY WORD.    IN 2013, HONDA SETTLED CLASS-ACTION LAW SUIT WITH SAME PROBLEM ON DIFFERENT MODELS, BUT 2013 INSIGHT HAS SAME DEFECTS, EXCESSIVE OIL-BURNING, FAULTY PISTON RINGS, ETC.    I WAS LUCKY ENOUGH NOT HAVING ACCIDENT ON FREEWAY, BUT SUDDENT STALLING MAY CAUSE CRASH, INJURY, AND FATALITY.    THIS IS SERIOUS SAFETY ISSUE.",
        "vin": "JHMZE2H56DS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732425,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDCHILD AGE 6 WAS TRAPPED IN THE SEATBELT EVERY TIME MOVED TO TRY AND FREE IT WOULD GET TIGHTER WE ENDED UP CUTTING FREE W/A BOX CUTTER, IF I HAD CALLED 911 I FEEL THE POLICE WOULD HAVE DONE THE SAME THING AS WE DID. THIS NEEDS TO BE ADDRESSED IMMEDIATELY SO NO OTHER GRAND PARENT GOES THROUGH THIS. THANK YOU    *TR",
        "vin": "JHM2E2H56DS"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "12/06/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10663474,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A BUSY S.E. STREET IN WASHINGTON DC, DRIVING ABOUT 20 TO 30 MPH., HEARD A NOISE THAT SOUNDED LIKE A TIRE BLOWING OUT OR SOME OTHER TYPE OF NOISE EMANATING FROM UNDERNEATH THE CAR.  I TRIED TO PRESS THE BRAKE, BUT INSTEAD THE CAR ACCELERATED AND WOULD NOT STOP.  IT SPED UP AT LEAST ANOTHER 15 TO 20 MORE MPH, AND AGAIN, WOULD NOT STOP.  THERE WERE VEHICLES IN THE BACK, SO I COULD NOT USE THE EMERGENCY BRAKE OR SHUT THE CAR OFF.  THERE WERE ALSO VEHICLES ON THE SIDE AND IN FRONT OF MY VEHICLE.  I HAD TO MAKE A DECISION ON HOW TO SLOW THE CAR DOWN WITHOUT HITTING ANY PEDESTRIANS OR ANY OTHER VEHICLES.  DECIDED TO TRY AND STOP THE CAR BY HITTING SOMETHING STATIONARY AND RAN INTO A SET OF STEPS THAT BELONGED TO AN OFFICE BUILDING.  AIRBAGS DEPLOYED AND TWO PASSERSBY STOPPED TO ASSIST ME AND MY PASSENGER OUT OF THE CAR.  WE WERE BOTH TRANSPORTED BY AMBULANCE TO A HOSPITAL WITH SUBSTANTIAL INJURIES TO THE CHEST, RIB, NECK AND BACK FOR MYSELF AND THE PASSENGER.  *TR",
        "vin": "JHMZE2H39DS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/14/2013",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10556060,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS HIT AT 60MPH, FROM A RUN AWAY CAR FLEEING THE POLICE, ON THE FRONT PASSENGER SIDE. MY CAR THEN FLIPPED ONTO THE DRIVER SIDE ROTATED 180 DEGREE, ROLLED OVER AND SLID 100FT TO STOPPED ON THE PASSENGER SIDE. MY CAR STOPPED WITH TWO WHEELS IN THE AIR. THE MAJOR COMPLAINT IS ONLY THE PASSENGER CURTAIN AIRBAGS DEPLOYED. THE PASSENGER SIDE AIRBAGS, DRIVER SIDE AIRBAGS, AND DRIVER CURTAIN AIRBAGS DID NOT DEPLOY. MY INJURIES WERE GLASS IN MY EYE, SEAT BELT RESTRAINT INJURIES, NECK & BACK PAIN. I WOULD LIKE TO FILE A COMPLAINT THAT THE PASSENGER SIDE AIRBAGS, DRIVER SIDE AIRBAGS AND DRIVER SIDE CURTAIN AIRBAGS DID NOT DEPLOY DURING THE ACCIDENT.  *TR",
        "vin": "JHMZE2H76DS"
    }
]