[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11399101,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 HYUNDAI EQUUS.  THE CONTACT STATED WHILE AT A STOP, A UNKNOWN TOYOTA CRASHED INTO THE FRONT OF THE VEHICLE.  THERE WERE NO WARNING LIGHTS ILLUMINATED. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED INJURIES TO THE  SPLEEN AND MEDICAL ATTENTION WAS PROVIDED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT TOW LOT. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 99,000. THE VEHICLE WAS DEEMED A TOTAL LOSS.*DT*DT*JB*JB",
        "vin": "KMHGH4J88DU"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120749,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-85 S FROM NORTH CAROLINA WHEN SUDDENLY MY CAR STARTS TO FEEL LIKE IT WAS DRAGGING.  I CONTINUED TO DRIVE FOR A FEW MORE EXITS TO SEE IF IT WOULD STOP.  I GOT OFF AFTER FOUR EXITS, TURNED OFF THE CAR, AND CHECKED THE TIRES.  NOTHING APPEARED WRONG.   I WAITED SEVERAL MINUTES AND I STILL COULD NOT DETERMINE A PROBLEM SO, I RETURNED TO I-85 S.  THE PROBLEM HAD STOPPED.  SEVERAL DAYS LATER, THE PROBLEM RETURNED. I WAS DRIVING ON A CITY STREET WHEN SUDDENLY THE DRAGGING FEEL BEGAN. I TOOK IT TO THE DEALERSHIP BUT THEY WERE UNABLE TO FIND THE PROBLEM. I WAS TOLD TO RETURN WHEN/IF THE PROBLEM RE-OCCURRED.   I CONTINUED TO DRIVE THE CAR IN THE CITY BUT PERIODICALLY IT WOULD FEEL LOPSIDED AND IT WOULD DRAG. ONCE I TURNED THE CAR OFF, IT WOULD RESET ITSELF AND STOP DRAGGING AFTER SEVERAL MINUTES WHICH TURNED INTO SEVERAL HOURS. ONE DAY, IT FELT SO LOPSIDED, I GOT OUT AND LOOKED AT IT AGAIN. THIS TIME, I NOTICED THE BACK WAS ALMOST SITTING ON THE TIRE.  I DROVE TO THE DEALERSHIP.THE SERVICE MAN SAW THE PROBLEM BUT BY THE TIME HE PULLED INTO A STALL, THE PROBLEM HAD FIXED ITSELF.  I WAS TOLD THERE ARE OFTEN PROBLEMS WITH THE FRONT AIR SPRINGS BUT THEY HAD NOT SEEN THIS PROBLEM IN THE REAR OF THE CAR.   SINCE THE BODY OF THE CAR WAS BASICALLY SITTING ON THE TIRE, THE TIRE COULD HAVE BECOME FLAT OR STOPPED CAUSING AN ACCIDENT.",
        "vin": "KMHGH4JH4DU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED THE CAR I HAVE EXPERIENCED HESITATION AT TIMES WHEN I STEP ON THE ACCELERATOR. THE CAR DOESN'T RESPOND FOR 1-2 SECONDS AND I HAVE TO HIT THE ACCELERATOR VERY HARD TO MAKE IT CATCH AND MOVE FORWARD.   IT IS INTERMITTENT BUT WHEN I AM TRYING TO GET INTO TRAFFIC IT IS VERY SCARY.  I HAVE COMPLAINED NUMEROUS TIMES BUT HAVE RECEIVED NO CORRECTIVE ACTION AND THE CAR CONTINUES TO HESITATE.",
        "vin": "KMHGH4JH3DU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/26/2015",
        "dateOfIncident": "09/18/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777816,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": ".WE HAVE HAD 3 BLOWOUTS ,ON THREE DIFFERENT OCCASIONS.THE TIRES ARE CONTINENTAL ,275/40/19.THE FIRST ONE WAS IN,NEW JERSEY,DRIVING AT APPROX 35-40MPH,APPROX WITH10K WEAR ONTHE TIRE.TIRE WAS REPLACED AT BRAD BENSON RTE 1,NJ.THE SECOND BLOWOUT WAS IN MAY 2015 WITH ABOUT 20K ONTHE TIRE IN MIAMI,FL,SPEED 35MPH..TIRE WAS RELACED AT DEL RAY HYUNDAI RTE 1FL.THE THIRD BLOWOUT WAS IN MARYLAND ON I95 ,SEPT 18,2015,WITH 23K WEAR ON THE TIRE.APPROX SPEED 70-75MPH.TIRE WAS REPLACED,AT BEL AIR HYUNDAI MD.THE MGR MALCOLM DUNCAN,TEL.NO.410-838-0222 AT BEL AIR HAS TAKEN PHOTOS OF THE DAMAGE TO THE TIRE.HE WOULD WELCOME AN INQUIRYAS TO WHY THIS TIRE FAILED.IN ORDER TO REPLACE THE TIRE THEY HAD TO CUT THE TIRE BY HAND OFF THE WHEEL.ON EACH OCCASION WE DID NOT HIT ANY DEBRIS.I HAVE CONTACTED HYUNDAI,EQUUS,ON EACH OCCASION, ABOUT THESE INCIDENTS ,SO THAT THEY MIGHT RECONSIDER USING THESE TIRES ON THEIR CARS.I I HAVE ALSO CONTACTED CONTINENTAL TIRE ,INFORMING THEM OF THE INCIDENTS.I WAS MET BY TOTAL COMPLACENCY,ABOUT THE INCIDENTS.ON EACH OCCASION THEY OFFERED ME MILEAGE ADJUSTMENT TOWARDS A NEW TIRE.I AM HAVING THE FOURTH TIRE REPLACED ON SEPT30,AS I NO LONGER TRUST THESE TIRES.I THINK THAT THEIR SHOULD BE SOME INVESTIGATION AS TO WHY THESE TIRES FAILED,AT VARIOUS TIMES AND SPEEDS.THESE TIRES WERE ALL ORIGINAL TIRES FROM HYUNDAI.",
        "vin": "KMHGH4JH8DU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT ADAPTIVE/MOBILITY,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700759,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE THIS EMAIL FORWARDED TO THE CEO OF HYUNDAI USA  OR WHO EVER CAN HELP A CUSTOMER WHO HAS PURCHASED AN EQUUS. I REFUSE TO SPEAK WITH CUSTOMER SERVICE AS THEY ARE TOTALLY USELESS AND DON'T UNDERSTAND MY CONCERNS.  MY CAR HAS BEEN AT THE KEIFFER HYUNDAI SHOP FOR NOW GOING ON 5 MONTHS. TO THIS DAY YOU HAVE SPENT OVER $30,000.00 ON PARTS AND LABOR ON MY CAR AND YET TO FIGURE OUT WHAT IS GOING ON. MY QUESTIONS IS - ARE YOU USING MY CAR AS A TEST BED IF SO THEN WHY AM I PAYING $575.00 PER MONTH LOAN ON MY CAR WHEN YOU SHOULD BE DOING THAT. THE SERVICE DEPT. MANAGER IS ALSO VERY FRUSTRATED IN HOW YOU ARE HANDLING THIS. IF I GOT AN EQUUS TO DRIVE WHILE YOU ARE FIXING MINE THEN I WOULD NOT BE COMPLAINING - BUT I HAVE HAD EVERYTHING EXCEPT THAT - ELANTRA AND SANTA FE. I HAVE ASKED YOUR CUSTOMER SERVICE PEOPLE TO HELP BUY BACK MY CAR AND THEY REFUSE. I HAVE ASKED TO EXCHANGED MY CAR AND THEY ALSO REFUSED. WHAT IS NEXT??? WHEN WILL I GET MY CAR BACK??? HOW LONG IS TOO LONG WHEN IT COMES TO CUSTOMER NOT HAVING THEIR CAR. IF I HAD A CHANCE I REPORT THIS ALL OVER. I BOUGHT THIS CAR FROM A HYUNDAI DEALERSHIP IN LIMA, OH THEREFORE IT WAS CHECKED OUT ... WHY DID A HYUNDAI DEALERSHIP SELL ME A LEMON???   *TR",
        "vin": "KMHGH4JH2DU"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630105,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR UNRESPONSIVE TO INPUTS FROM THE ACCELERATOR PEDAL.  MULTIPLE DASHBOARD WARNING LIGHTS - VSM OFF, DSC, EPB, PSB, AIRBAG, AND CHECK ENGINE LIGHTS; VEHICLE STILL RUNNING.  THE FIRST INSTANCE OCCURRED ON A FREEWAY FEEDER ROAD WHILE GOING 45MPH; CAR WAS UNRESPONSIVE TO ANY INPUTS FROM THE ACCELERATOR FOR APPROXIMATELY 10 SECONDS, SIMPLY ACTING AS IF THERE WERE NO THROTTLE INPUTS.  TURNING TO HEAD HOME IMMEDIATELY, THE VEHICLE RESPONDED SIMILARLY WHILE TRAVELING 25 MPH ON A RESIDENTIAL STREET; IT BEGAN COASTING AND ANY THROTTLE APPLICATION RESULTED IN NO ACCELERATION.  CAR LIMPED HOME AND PARKED FOR DEALERSHIP TOW TRUCK.  *TR",
        "vin": "KMHGH4JH7DU"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2013",
        "dateOfIncident": "07/11/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557865,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TEST DRIVE BEFORE PURCHASING WAS STOPPED AFTER A 1/4 OF MILE BECAUSE OF HEAVY FRONT END SHAKING. DEALERSHIP CHANGED TIRES SAYING THAT  WOULD FIX THE PROBLEM. SINCE THEN IT HAS ALSO FIXED FRONT END ALIGNMENT TWICE, CHANGED THE DRIVESHAFT AND TWO REAR AXLES. VEHICLE STILL SHAKES. VEHICLE IS PERILOUS TO DRIVE ON BUMPY SURFACES WHEN DRIVER HAS DIFFICULTY CONTROLLING FRONT END.  *TR",
        "vin": "KMHGH4JHXDU"
    }
]