[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458157,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Honda Odyssey. The contact stated while driving 45 MPH, the traction control warning light and the check engine warning light illuminated on the instrument panel. The contact continued to drive; however, the warning lights remained illuminated. The vehicle was taken to the dealer where it was diagnosed that the pistons were damaged and needed to be replaced. The contact's husband was informed of an extended warranty associated to the failure and was referred to the manufacturer for further assistance. The vehicle was not repaired. Upon contacting the manufacturer several times, the contact was informed that the repair would not be covered under warranty. The contact became aware of NHTSA Campaign Number: 13V382000 (Engine) which she associated to the failure. The vehicle was not repaired. The failure mileage was approximately 111,917.",
        "vin": "5fnrl5h43db"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444504,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I came to a stop at the stop sign and dropped off the my kids for PE at a local church.  After the stop sign I went left going slowly because of kids in the area. I then went around a dark grey minivan that was pulled over on my right side of the road letting her kids out for PE. I then proceeded to take another left.   I was pulling into the first parking space close to the PE field, with a fully turned steering wheel, as in doing a U turn. Since I was going slow my right foot was lightly pressing the brake. My minivan was in the parking spot and I was creeping closer to the concrete parking stop with my right foot pressing more down on the brake so I can come to a complete stop. I was about to place the car in park when the engine revved, the car jerked, it accelerated sending me up and over the curb and into the grassy median in front of the parking space and into a tree. The coaches and one other person came running to assist me since I was in shock.  There was smoke coming out of the engine so I placed the minivan in park and shut the engine off. The airbags did not deploy.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444021,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Car Coded P0301 Number 1 Cylinder misfire Serviced Immediately. Mechanic said Honda is having major problems with 3.5 Liter engine. Excessive wear to cylinder, Causing low oil, Misfire. Replaced sparkplug and coil. was down 1 quart of oil. It just had an oil change.  Found this on line in Recall.Honda.com: INSUFFICIENT PISTON HARDNESS NHTSA RECALL NUMBER:13V-382 MFR CAMPAIGN ID:JB4 CAMPAIGN DESCRIPTION:INSUFFICIENT PISTON HARDNESS RECALL DATE:08/26/2013 RECALL STATUS:17 Character VIN Required SUMMARY: HONDA IS RECALLING CERTAIN MODEL YEAR 2013 PILOT 2WD AND 4WD VEHICLES AND CERTAIN MODEL YEAR 2013 ODYSSEY VEHICLES. DURING MANUFACTURING OF THE ENGINE PISTON, IT IS POSSIBLE THAT THE HEAT TREATMENT PROCESS WAS NOT PROPERLY APPLIED, RESULTING IN THE PISTON HAVING AN INSUFFICIENT HARDNESS LEVEL, MAKING IT MORE SUSCEPTIBLE TO PREMATURE WEAR.  SAFETY RISK: A WORN PISTON MAY SUDDENLY FAIL, CAUSING THE ENGINE TO STALL, INCREASING THE RISK OF A CRASH.  REMEDY: HONDA WILL NOTIFY OWNERS, AND DEALERS WILL REPLACE THE ENGINE SHORT BLOCK FREE OF CHARGE. THE RECALL BEGAN ON SEPTEMBER 16, 2013. OWNERS MAY CONTACT HONDA AT 1-888-234-2138. HONDA'S CAMPAIGN NUMBER FOR THIS RECALL IS JB4.",
        "vin": "5FNRL5H94DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "11/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442539,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil leaked onto sparkplug, and caused engine misfire.  While driving on the expressway the vehicle started misfiring causing us to have to exit get the vehicle serviced.  The service shop confirmed this issue happens with honda vehicles, and we observed a recall has been issued for this exact issue, but my VIN, for some reason, is not eligible.  The check engine light flashed when this issue occurred.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/17/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440821,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Honda Odyssey. The contact stated while driving 55 MPH, the engine misfired and the vehicle inadvertently stalled. The check engine warning light illuminated. The vehicle was towed to the dealer and was repaired under NHTSA Campaign Number: 13V382000 (Engine) however, the dealer replaced the piston rings instead of replacing the engine short block per the manufacturer's instructions. The contact stated that the engine had been misfiring and smoke had been coming from underneath the hood of the vehicle. There were no warning lights illuminated. The vehicle was taken to the dealer who diagnosed the failure as oil leaking from the head gasket. The manufacturer was notified of the failure and advised the contact that they could not assist because the recall history on the VIN did not show a recall that required the engine short block to be replaced. The vehicle was not repaired. The approximate failure mileage was 70,000.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433282,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We have been told by the dealership we purchased this vehicle from that there was an extension for issues with the piston rings going bad on this van. For some reason it is not included in this extension. The check engine light is flashing and the car is shaking violently. We’ve been told that the issue is oil getting into the cylinders causing misfires in the engine. At this point we are on our own to repair even though it is a wide spread issue with these vehicles.",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421717,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Honda Odyssey. The contact stated that while driving at various speeds the vehicle's gauges would begin to fluctuate, the electrical systems would begin to malfunction, and the vehicle would display all icon options on the instrument panel. The vehicle had been taken to the dealer a total of 5 times where they could not successfully identify the exact cause of the failure. The contact was told that the alternator may be at fault. The vehicle had not been repaired. The manufacturer was made aware of the issue and opened a case regarding the matter. The approximate failure mileage was 56,432.",
        "vin": "5fnrl5h60db"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419642,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My car engine light came on.  I had towed to place of repair.  They replaced valve cover gaskets and spark plug well gaskets.  Within 2 months did it again.  They replaced #3.  In 3 months did it again and we found out a warranty extension was put in place but customers were not contacted.  My car was in for 2 recalls but they did not catch this.  The warranty extension is over and it is going to be costly to get it fixed.  The more I checked into this it is a safety hazard on the car.  I am asking for help and they are not willing to help.  I lost my job and during COVID and live on my social security which is not much.  I called asking for help and they said sorry.Is there any way you can help me.",
        "vin": "5FNRL5H22DB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WILL SHAKE VIOLENTLY AND THE CHECK ENGINE LIGHT WILL FLASH.  MISFIRING.  PISTONS AND SPARK PLUGS NEED TO BE CHANGED.  SAME ISSUE AS FOUND IN SERVICE BULLETIN 13-081.  HONDA DIAGNOSED THE PROBLEM BUT WILL NOT COVER THE COST OF THE REPAIR BECAUSE MY VIN UNEXPLAINABLY NOT INCLUDED.",
        "vin": "5FNRL5H47DB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412933,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "A TIRE SUDDENDLY DEFLATED AND DISENTIGRATED AT HIGHWAY SPEED.  THIS WAS A CONTINENTAL TRUE CONTACT TOUR 104T.  THE TIRES WERE MOUNTED NEW DEC 5, 2020 AND HAD LOW MILEAGE.",
        "vin": "5FNRL5H64DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/27/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405113,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN HAS THE BRAUN CONVERSION PACKAGE (WHEELCHAIR ACCESSIBLE VAN). WHILE PARKED THE PASSENGER SLIDING DOOR FELL COMPLETELY OFF OF THE VAN AS IF WAS CLOSING. NO PRIOR ISSUES WITH THE DOOR.    THE MOTOR TO THE WHEELCHAIR RAMP HAS NEEDED TO BE REPLACED TWICE. THE FIRST REPLACEMENT RAMP MOTOR DID NOT LAST 18 MONTHS AND COST OVER $1800 TO REPLACE. WHEN YOU HIT ANY OF THE BUTTONS TO ENGAGE THE RAMP, YOU HEAR THE MOTOR, HOWEVER IT IS NOT MOVING. YOU MUST PHYSICALLY PULL THE RAMP OUT AND LIFT IT UP. I WAS TOLD THE THE GEAR SYSTEM IN THE MOTOR GOES BAD OFTEN. THE DOOR STILL WORKS(UNTIL TODAY) WHEN YOU HIT THE BUTTON TO OPEN OR CLOSE.",
        "vin": "5FNRL5H6XDB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404865,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT THERE WAS OIL ON THE SPARK PLUGS CAUSING THE VEHICLE TO MISFIRE. THE CONTACT STATED THAT THE SPARK PLUGS WERE REPLACED ONCE EVERY MONTH FOR THE PAST 6 MONTHS. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO THE LOCAL DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 200,000.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUGS ARE GETTING WET WITH OIL SINCE THE DAY I BOUGHT IT I HAD TO REPLACE THEM EVERY 2 MONTHS BUT NOW IS MORE OFTEN SPARK PLUGS THEY NEED TO BE REPLACED EVERY 20 DAYS BECAUSE THE OIL IS FILTERING TO THE SPARK PLUGS.  PLEASE IF SOMEONE ELSE HAS THE SAME PROBLEM ADVANCE WHAT IS THE NEXT STEP.  MI NAME IS [XXX]OR EMAIL ME [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384732,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS PEELING OFF ON THE ROOF IN BIG CHUNKS.",
        "vin": "5FNRL5H98DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361329,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HERE ARE VIDEOS  OF THE 3RD AND 4TH  TIME ON 4&21SEP2020:     HTTPS://WWW.YOUTUBE.COM/PLAYLIST?LIST=PLH4SBOV18800XGTDIEKS76DO7UR-OIC-W    HONDA OF AMERICA CASE #11568519 EXPLAINS THE REPAIR IS NOT POSSIBLE WITHOUT A DTC NOR A CHECK ENGINE LIGHT. VICTORY HONDA, PLYMOUTH, MICHIGAN REVIEWED VEHICLE WITH ID #69730  (CHECKED BY WAYNE GOWARD) AND EXPLAINED IT'S NOT POSSIBLE TO REPAIR VEHICLE WITHOUT DTC.  I WAS DIRECTED BY THE DEALERSHIP TO GO DRIVE THE VEHICLE LONGER TIME (10 MINUTES) DURING VEHICLE MISFIRE FAILURE IN ORDER TO INCREASE THE OPPORTUNITY THAT THE DTC WILL BE REGISTERED.  I BELIEVE DRIVING THE VEHICLE IN THIS CONDITION IS NOT SAVE SINE ACCELERATION IS LOST.  I AM VERY CONCERNED THIS IS HAPPENING A LOT TO OTHER HONDA ODYSSEY OWNERS AND THEY GET THE SAME INADEQUATE COMPLAINT FROM HONDA.     LET'S DO THE RIGHT THING FOR SOCIETY AND GET HONDA TO FIX ALL ODYSSEY'S WITH THIS MISFIRE THAT DOES NOT REGISTER DTC. THE ENGINNEERS KNOW THIS IS WRONG BUT ARE TOO AFRAID TO STAND UP FOR WHAT'S RIGHT.",
        "vin": "5FNRL5H63DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A TWO LANE ROAD IN WARREN COUNTY, INDIANA, AND TRYING TO PASS A FARM VEHICLE AT 55 MPH, THE VEHICLE SUDDENLY STALLED AND CHECK ENGINE LIGHT STARTED FLASHING. MY VEHICLE HAD ENOUGH MOMENTUM TO GET AROUND THE FARM VEHICLE. ONCE ABLE TO STOP, I SHUT THE VEHICLE OFF. I RESTARTED THE VEHICLE EXPECTING TO SEE THE CHECK ENGINE LIGHT, BUT IT WAS NOT THERE, AND VEHICLE RAN NORMALLY. THE NEXT DAY I PURCHASED AN OBDII CODE READER, AND VEHICLE REGISTERED A P0303 CODE. VEHICLE HAS APPROXIMATELY 166,000 MILES.",
        "vin": "5FNRLSH9XDB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323113,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS PEELING FROM THE TOP OF THE ROOF BETWEEN THE DRIVERS WINDOW AND THE SUNROOF. THE VEHICLE HAS ONLY BEEN STORED IN VIRGINIA AND INDIANA.",
        "vin": "5FNRL5H9XDB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322879,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 HONDA ODYSSEY. THE ENGINE BEGAN TO MISS BADLY. I TOOK IT TO THE DEALERSHIP FOR REPAIRS. THE MECHANIC SAID THAT THE OIL WAS GETTING ON THE SPARK PLUGS AND CAUSING THEM TO FAIL. THE COST TO REPAIR WOULD BE VERY EXPENSIVE. THE MECHANIC AND MANAGER SAID THAT MY VAN WAS NOT UNDER WARRANTY. I DID SOME CHECKING AND FOUND THAT THERE WAS AN EXTENDED WARRANTY FOR THE 2013 HONDA ODYSSEY FOR THE EXACT PROBLEM MY VAN HAD. DESPITE EXPLAINING THIS TO THE DEALERSHIP MANAGER HE COMPLETELY STONE WALLED AND REFUSED TO HELP. APPARENTLY ALOT OF HONDA ODYSSEYS IN THE 2011-2014 TIME PERIOD ARE HAVING THIS SAME ISSUE. HONDA REFUSES TO ACCEPT RESPONSIBILITY AND MAKE THE REPAIRS. DO NOT BY A HONDA AS THEY DO NOT BACK UP THEIR PRODUCT.",
        "vin": "5FNRL5H20DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "03/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320397,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A SERVICE BULLETIN AND WARRANTY EXTENSION FOR 2011 - 2013 ODYSSEY'S WAS ISSUED ON JANUARY 20, 2015 REGARDING AN ISSUE WITH PISTON RINGS RESULTING IN THE FOULING OF SPARK PLUGS SETTING DTC'S P0301 THROUGH P0304.      LATE IN 2019 OUR ODYSSEY THREW A P0302 CODE AND STARTED RUNNING VERY ROUGH.  AFTER SOME DIAGNOSING OF THE PROBLEM IT WAS FOUND THAT CYLINDER 2'S SPARK PLUG WAS FOULED; IT WAS REPLACED AND THE PROBLEM WENT AWAY.  IN MARCH OF 2020 THE SAME ISSUE OCCURRED, THE SAME SPARK PLUG WAS FOULED AGAIN, REPLACED AND THE PROBLEM WENT AWAY.  A WEEK LATER, CODE P0301 APPEARED AND CYLINDER 1'S SPARK PLUG WAS FOULED.  I TOOK THE VAN TO THE DEALERSHIP AND WAS TOLD THAT THIS WAS A COMMON PROBLEM WITH THIS YEAR OF ODYSSEY.      AFTER PAYING $2,686.36 FOR LABOR AND PARTS BY MY HONDA DEALERSHIP TO REPAIR THIS ISSUE I STARTED DOING SOME RESEARCH AND FOUND THE 13-081 BULLETIN STATING THAT A WARRANTY EXTENSION WAS ISSUED FOR THIS VERY ISSUE.  I CALLED HONDA TO ASK WHY THE DEALERSHIP DID NOT MENTION THE WARRANTY EXTENSION AND TO SEE WHAT NEEDED TO BE DONE TO COVER THE REPAIR BILL, I WAS TOLD THAT MY VIN NUMBER WAS NOT INCLUDED IN THE WARRANTY EXTENSION.      I AM NOT UNDERSTANDING HOW MY VERY MAKE AND MODEL WAS LEFT OUT OF THE WARRANTY EXTENSION WHEN IT OBVIOUSLY HAD THE SAME ISSUE THAT THE SERVICE BULLETIN WAS ISSUED FOR.  CAN YOU HELP?  *TR",
        "vin": "5FNRL5H4XDB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT ON VARIOUS OCCASIONS WHILE ENGAGING THE KEYFOB, THE POWER WINDOWS AND POWER LOCKS OPERATED INDEPENDENTLY. THE CONTACT SPOKE WITH HONDA OF SEATTLE LOCATED AT (2005 AIRPORT WAY S, SEATTLE, WA 98134) WHERE THE CONTACT WAS INFORMED TO REPLACE THE BATTERY IN THE KEY FOB. THE CONTACT ATTEMPTED TO USE THE ALTERNATE KEYFOB HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 199,248.",
        "vin": "5FNRL5H9XDB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318823,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS FADING, BUBBLING, AND PEALING IN MULTIPLE PLACES ON THE EXTERIOR OF THE CAR.  I'VE SEEN THE MENTIONS OF THE BACK HATCH/DOOR, BUT WE'RE SEEING IT ON THE DOORS AS WELL AS THE BACK HATCH.",
        "vin": "5FNRL5H64DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312034,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE SHUT OFF WHILE IN MOTION ON LOCAL STREET.   A BAD/DEFECTIVE  FRONT SPOOL VALVE LEAKED OIL ON THE ALTERNATOR AND THE ALTERNATOR WENT BAD RIGHT WAY. WHICH CAUSE ENGINE TO SHUTDOWN WHILE CAR IS IN MOTION. TRY TO START THE CAR, IT WON'T START, NEITHER ELECTRICAL POWER.  ITS VERY DANGEROUS SITUATION, LIKELY WASNT DRIVING ON THE HIGHWAY.  DEALER MAINTENANCE SHOP ADVISOR TOLD ME THAT ALOT HONDA ODYSSEY HAVE SPOOL VALVE LEAKED OUT TO CAUSE THE ALTERNATOR GOES BAD & SHUT DOWN THE CAR.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311056,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS WARP CAUSING STEERING WHEEL VIBRATION AND BRAKE PEDAL THUMPING. ROTORS HAVE BEEN RESURFACED 3 TIMES ONLY TO HAPPEN AGAIN AFTER A FEW THOUSAND MILES. AT HIGHER SPEEDS ALMOST LOST CONTROL OF STEERING. HONDA WON'T UPGRADE TO BETTER PERFORMING ROTORS. NEED A SAFETY RECALL. LONG TIME ISSUE.",
        "vin": "5FNRL5H98DB"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306990,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I FOUND OUT THAT MY PISTONS WERE BAD IN MY 2013 ODYSSEY.  I HAD JUST HAD MY POINTS, PLUGS AND WIRES CHANGED OUT IN LATE NOVEMBER EARLY DECEMBER.  I WAS SURPRISED TO SEE THAT THIS IS A COMMON PROBLEMS WITH THE ODYSSEYS.  I HAD TAKEN MY VAN TO AUTO ZONE TO HAVE IT DIAGNOSED AND IT SAID CODE P0302 INDICATES THAT CYLINDER 2 HAD TO MANY MISFIRES SAME CODE THAT IS IN THE EXTENDED WARRANTY FOR THIS ISSUE.  I WAS TOLD THAT MY VIN NUMBER WAS NOT ON THE LIST TO SERVE. WOW.  I ASKED WHY AND  THE CUSTOMER SERVICE REPRESENTATIVE STATED BECAUSE THAT NO ONE HAD COMPLAINED WITH THAT VIN NUMBER.  WELL IF YOU ASK ME THE VIN NUMBER IS DIFFERENT FOR EACH CAR, OR AM I WRONG?? HOW WOULD I COMPLAIN IF THE PROBLEM HAD NOT STARTED AS OF YET?  KNOWING  THAT THIS IS AN ISSUE WITH THE 2013 ODYSSEY VANS.  IT SHOULD INCLUDE THE ONES THAT YOU BUILT FOR THAT YEAR.  NOT JUST THE ONES YOU HAD COMPLAINTS ON.  IT IS IRONIC THAT THE SAME ISSUE IS OCCURRING IN MY VAN.  WHEN THE TECH CALLED ME THIS MORNING HE MENTIONED 3 DIFFERENT CYLINDERS THAT WERE MISFIRING.  IF THIS WAS A PROBLEM SHOULDN'T PROCESSES BEEN PUT IN PLACE TO CHECK THE PISTONS REGARDLESS IF THERE IS AN ISSUE TO MAKE SURE THIS IS NOT PROBLEM IN  THAT PARTICULAR VEHICLE.  I NOW AM PAYING FOR NOT ONLY ALL OF THE PISTONS SEALS TO BE REPLACED BUT ALSO ANOTHER POINTS, PLUGS, AND WIRE REPLACEMENT THAT IS ONLY A FEW MONTHS OLD.  I AM VERY DISAPPOINTED IN HONDA RIGHT NOW.  IF YOU HAD ASKED ME LAST WEEK WHAT MY NEXT CAR WOULD BE I WOULD HAVE SAID ANOTHER HONDA BUT AFTER TODAY NOT SO SURE ON THAT.",
        "vin": "5FNRL5H56DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288290,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AMERICAN HONDA ANNOUNCED A POWERTRAIN WARRANTY EXTENSION AS A RESULT OF A SETTLEMENT OF A CLASS ACTION CAPTIONED, SOTO ET AL.V. AMERICAN HONDA MOTOR CO., INC., CASE NO. 3:12-CV-1377-SI (N.D. CAL.). FOR SPECIFIC 2013 HONDA ODYSSEY ONLY. THIS ISSUE DO IMPACT OTHER MINI-VANS THAT ARE NOT PART OF ORIGINAL SETTLEMENT, LIKE MINE. I WANT THIS ISSUE TO RE-OPEN SO THAT VIN THAT WERE NOT ORIGINALLY PART OF THIS SETTLEMENT IS INCLUDED TOO AND ALL REPAIR COST ARE BORN BY HONDA.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280308,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A PARKING LOT GOING LESS THAN 5 MILES AN HOUR AND WAS TURNING RIGHT INTO A PARKING SPACE. MY FOOT WAS ON THE BRAKE, BUT THE CAR LURCHED FORWARD AND ACCELERATED OVER THE CEMENT CHOCK BLOCK, HITTING A POLE IN FRONT OF THE STORE.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220688,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 4, 2019, WHEN MY VEHICLE REACHED APPROXIMATELY 104,000 MILES, THE CAR'S ENGINE LIGHT AND VSA LIGHT CAME ON WHILE DRIVING. THE CAR IDLED ROUGHLY AND WOULD NOT ACCELERATE. IT LIMPED ALL THE WAY TO THE MECHANIC. THE INDEPENDENT MECHANIC DIAGNOSED THE PROBLEM, IDENTIFIED BY THE PROBLEM CODE GENERATED BY THE VEHICLE'S COMPUTER AS P0301: CYLINDER #1 MISFIRE. THE MECHANIC REPLACED ALL THE SPARK PLUGS AND THE IGNITION COIL FOR THAT CYLINDER. TWO MONTHS LATER, WITH THE ODOMETER AT APPROXIMATELY 107,000 MILES, THE CAR AGAIN MALFUNCTIONED, WITH A ROUGH IDLE, ENGINE AND VSA LIGHT, AND LIMPING PERFORMANCE. THE CAR WAS RETURNED TO THE SAME INDEPENDENT MECHANIC, WHO TOLD US THE SAME PROBLEM CODE (P0301) WAS GENERATED, INDICATING A MISFIRE IN THE FIRST CYLINDER. THE MECHANIC REMOVED AND INSPECTED THE SPARK PLUG, WHICH SHOWED EVIDENCE OF OIL FOULING. ONLY AFTER THE SECOND REPAIR DID I FIND INFORMATION THAT THE MANUFACTURER HAD EXTENDED THE WARRANTY FOR THIS SPECIFIC DEFECT PURSUANT TO A CLASS ACTION SETTLEMENT. I WAS NEVER INFORMED BY HONDA OF THE SUIT, SETTLEMENT, OR WARRANTY EXTENSION. WHEN I CALLED THE HONDA DEALER TO ASK THEM TO FIX MY VEHICLE PURSUANT TO THE SETTLEMENT'S WARRANTY EXTENSION, AND NOTED BY MULTIPLE SERVICE BULLETINS, THE DEALER DECLINED AND SAID THEY WOULD NOT FIX THE PROBLEM UNTIL THE CAR BROKE DOWN FOR A THIRD TIME. I CALLED THE MANUFACTURER DIRECTLY, AND A REPRESENTATIVE THERE ALSO DECLINED TO FIX THE CAR UNDER THE WARRANTY EXTENSION, SAYING THEY WOULD NOT DO ANYTHING UNTIL THE CAR BROKE DOWN AGAIN, DESPITE MY DOCUMENTATION THAT THE PRECISE CONDITIONS FOR THE WARRANTY EXTENSION HAD BEEN MET: A PROBLEM CODE OF P0301 AND A SPARK PLUG WITH OIL FOULING. GIVEN THAT THIS HAS HAPPENED TWICE WITHIN 3,000 MILES, MY CAR IS NOT SAFE TO DRIVE, AS I DON'T KNOW WHEN IT WILL BREAK DOWN AGAIN DUE TO A KNOWN AND DOCUMENTED PROBLEM THE MANUFACTURER REFUSES TO ADDRESS.",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218698,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PISTONS ARE MISFIRING. THIS HAS CAUSED ITS RINGS TO MOVE AND ALLOW OIL THROUGH AND RUIN SPARK PLUGS SIGNIFICANTLY.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE PERFORMED AS IF IT CHANGED GEARS AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO VANDERGRIFF HONDA (817-533-4266, LOCATED AT 1104 W INTERSTATE 20, ARLINGTON, TX 76017) WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO CARBON BUILD UP. THE DEALER RECOMMENDED THAT CYLINDERS 1, 2, AND 3 BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 97,000.",
        "vin": "5FNRL5H48DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204152,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE PAINT IS PEELING OFF OF THE VEHICLE IN 3 SPOTS. THIS BEGAN ABOUT A YEAR AGO AND CONTINUES TO GET WORSE. RIGHT AND LEFT SIDE OF THE TAILGATE, AND 1 SPOT ON THE ROOF BETWEEN THE WINDSHIELD AND THE MOONROOF. MANY OTHER HONDA ODYSSEY AND PILOT OWNERS ARE EXPERIENCING THIS SAME PROBLEM.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203665,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE LEAKING BELOW PASSENGER SIDE DOOR. THIS VAN WAS MODIFIED FOR A WHEELCHAIR AND HAD AN AFTERMARKET FUEL TANK INSTALLED. HONDA DEALER INSPECTED IT, SAID LEAK IS AT TOP OF TANK BUT CANNOT SERVICE DUE TO THE TANK NOT BEING OEM. DEALER SAID THIS HAS HAPPENED BEFORE BUT THEY REFUSE TO REPORT IT. THE BUILDER IS BRAUN ABILITY. LEAK STARTS WHEN KEY IS TURNED TO ON.",
        "vin": "5FNRL5H24DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195702,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON THE ROOF HAS BEEN PEELING OFF DUE TO A DEFECT IN THE PAINTING PROCESS AT THE FACTORY. THIS CAUSE PAINT CHIPS TO COME OFF THE CAR AND EXPOSES THE ROOF TO RUSTING.",
        "vin": "5FNRL5H96DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182307,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, MY HONDA ODYSSEY EX HAS JUST 65000 MILES ON IT AND ALWAYS MAINTAINED VERY WELL. BUT SUDDENLY ENGINE BLINKING CHECK SIGN AND STEADY TRACTION CONTROL SIGN TURN ON. TOOK TO DEALER RIGHT AWAY AS I WAS JUST QUARTER MILE AWAY OF IT. DEALER SAYS IT IS CODE P0302 ISSUE AND THEY NEED TO REBUILD ENGINE AND REPLACE PISTON RINGS, SPARK PLUGS , ETC. ESTIMATED COST IS $5000/-.  I JUST DON'T UNDERSTAND HOW COME WELL MAINTAINED BRAND NAME CAR HAS ENGINE PROBLEM IN JUST 65K MILES?!! I NEVER HAVE ANY PROBLEM WITH TOYOTA CARS. I ALSO FIND FROM GOOGLE THAT SOME 2013 MODEL DO HAD RECALL WITH SIMILAR TYPE ENGINE ISSUE BUT DEALER SAYS MY CAR IS NOT PART OF THAT RECALL. THIS IS A VERY BAD EXPERIENCE. DEALER SAYS AS WARRANTY EXPIRED JUST 6 MONTHS AGO, HONDA WILL COVER 85% REPAIR COST. I CAN SAY THIS IS STILL COSTLY REPAIR FOR ME. NOW HOW CAN I TRUST HONDA AND THIS CARE FOR RELIABILITY AS I NEED TO MAKE LONG DISTANCE FAMILY TRIPS???",
        "vin": "5FNRL5H4XDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132531,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA ODYSSEY. CONSUMER WRITES IN REGARDS TO DEFECTIVE BRAKE ROTORS BEING USE BY MANUFACTURERS AND REPAIR PROCESS.  *AS  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132176,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS VEHICLE BRAND NEW. OVERALL IT HAS BEEN EXCELLENT, BUT IT DOES HAVE ONE HORRIBLE SAFETY FLAW.  THE BRAKES HEAT UP AND WARP ON EVEN A SMALL HILL AND CAUSE THE STEERING TO SHAKE TERRIBLY WHEN BREAKING.  THE DEALER WILL FIX THE PROBLEM, FOR A PREMIUM OF COURSE, AND YOU ARE GOOD TO GO FOR SEVERAL MONTHS.  THEN IT COMES RIGHT BACK.  THIS IS A KNOWN PROBLEM, AND I'M REALLY SURPRISED THAT HONDA HASN'T BEEN FORCED TO DO A RECALL SINCE THEY WON'T DO ONE ON THEIR OWN.  THEY CALL IT \"WEAR AND TEAR\".  YEAH, RIGHT. IT'S SO COMMON THAT THE DEALER SPECIFICALLY ASKS ABOUT IT EVERY TIME WE COME IN FOR AN OIL CHANGE OR WHATEVER.  \"ANY ISSUES WITH SHAKING DURING BREAKING?\"  SORRY, BUT YOU WILL NEVER GET ME TO BELIEVE THAT THIS IS A NORMAL QUESTION EVERY TIME A CAR COMES IN FOR SERVICE.  WE'VE PAID FOR THE \"REPAIRS\" A FEW TIMES, BUT I CAN'T AFFORD TO KEEP PAYING FOR THE SAME PARTS OVER AND OVER AGAIN. SO NOW I JUST ANSWER YES, BUT THAT IT'S NOT SHAKING ENOUGH TO PAY FOR THE TEMPORARY REPAIRS AGAIN.  REALLY, IT'S KIND OF SCARY AND HORRIBLE. THIS SEEMS LIKE IT'S A SERIOUS SAFETY ISSUE, BUT NO ONE SEEMS TO CARE.  THIS IS A MINIVAN.  MINIVANS ARE USUALLY FILLED WITH KIDS.  HOPEFULLY SOMEONE AT HONDA OR THE US GOVERNMENT WILL FINALLY REALIZE THAT PARENTS SHOULDN'T BE STRUGGLING TO HOLD ONTO THEIR STEERING WHEELS JUST SO THAT HONDA CAN SELL NEW BRAKES EVERY FEW MONTHS.  I'M ONLY BRINGING IT UP NOW BECAUSE IT'S SO COMMON THAT I'M STARTING TO RECEIVE LETTERS FROM ATTORNEYS ABOUT CLASS-ACTION SUITS.  I'D RATHER HONDA JUST ISSUE A RECALL AND FIX THE PROBLEM.  DO THE ROTORS SIMPLY NEED TO BE BETTER QUALITY STEEL? I WOULD EVEN BE FINE IF I HAD TO PAY FOR THE BRAKES YET AGAIN, AS LONG AS THE PROBLEM IS ACTUALLY FIXED ONCE AND FOR ALL.  THE MINIVAN ONLY HAS ABOUT 59K MILES ON IT.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131798,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PULSATION/SHAKING OF THE STEERING WHEEL AND BRAKE PEDAL TO THE POINT OF FEELING LIKE GOING TO LOSE CONTROL OF THE VEHICLE WHEN BRAKING AT SPEEDS HIGHER THAN 45 - 55 MPH.  HAVE HAD TO HAVE ROTORS RESURFACED TWICE TO TAKE CARE OF THE PROBLEM (1ST IN 2015 AT 24,177 MILES BUT UNDER WARRANTY, 2ND IN 2017 AT $204 AND THE PROBLEM CAME BACK AGAIN AT 51,542). NOW BEING TOLD TO RESURFACE THEM ONCE MORE OR REPLACE FRONT BRAKES AND PADS FOR $668 AND IF REPLACED WILL BE WITH THE NEW DESIGN OF THE ROTORS ALLOWS FOR MORE AIR FLOW.  IF THERE IS A NEW DESIGN, THEN OBVIOUSLY HONDA KNOWS THAT THERE WAS A PROBLEM WITH THE OLD DESIGN AND SHOULD HAVE DONE A RECALL.  IN RESEARCHING THE ISSUES ONLINE (CARSCOMPLAINTS.COM, REPAIRPAL.COM) MANY OTHER PEOPLE SEEM TO HAVE THE SAME COMPLAINT.   I'VE NEVER HAD TO HAD ROTORS RESURFACED SO MANY TIMES.",
        "vin": "5FNRL5H60DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128810,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS BACKFIRING DUE TO PISTON MALFUNCTIONING.",
        "vin": "5FNRL5H21DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE MY CAR REACHED THE 20,000 MILE AGE THE CAR STARTS TO SHAKE WHEN HITTING THE BRAKES WHEN DECELERATING AT 50-30 MPH SPEED. ASKED THE DEALERSHIP IF THEY CAN CHECK WHAT IS WRONG. THEY SAID THE BRAKES ARE FINE. I THOUGHT IT WAS A WHEEL BALANCE ISSUE BUT THE CAR IS NEW. NOT UNTIL I READ ALL OF THE COMPLAINTS ABOUT THIS CAR. NOW MY CAR IS 57,000 MILES OLD AND WILL NEED THE ROTOR AND PADS REPLACED. OUTSIDE MECHANIC CHARGING ME $450 FOR ROTOR REPLACEMENT, PADS AND LABOR.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119959,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A BUSY 4 LANE ROAD AT THEIR SET HIGHWAY SPEED, RIGHT ALONG WITH THE REST OF TRAFFIC. I HAD MY 4 KIDS IN MY 2013 HONDA ODYSSEY, WHICH I TRUSTED, WHEN WITHOUT WARNING, MY VAN SHUT OFF. MY KEY WAS STILL ENGAGED. THERE WAS NO WARNING LIGHT OR SOUND. I DID NOT RUN OUT OF GAS. MY BATTERY DID NOT DIE. THERE WAS NO SLOWING DOWN, MY CHECK ENGINE LIGHT DID NOT COME ON. MY CAR DID NOT OVERHEAT. WHILE DRIVING NORMALLY, MY ENGINE SUDDENLY CUT, ALL MY LIGHTS WENT OUT, MY DASH WENT BLACK, AND MY WHEEL LOCKED.  I WAS BARELY ABLE TO GET THE CAR TO GO INTO THE RIGHT LANE AND THANKFULLY, MY HAZARDS STILL WORKED BUT THE REST WAS DEAD. I HAD ENOUGH MOMENTUM TO STAY MOVING FOR A LITTLE WHILE AND I EVENTUALLY GOT OVER INTO A SMALL AREA BESIDE THE ROAD. SOMEHOW I WASN'T HIT BY THE MANY CARS AROUND ME, INCLUDING TRACTOR TRAILERS. ALL I DID NEXT WAS TURN MY VAN OFF, AND THEN TURN IT BACK ON AND IT STARTED LIKE NOTHING EVER HAPPENED. I HAD A FULL DIAGNOSTIC RUN AT OUR LOCAL DEALERSHIP AND NO ONE COULD FIND ANYTHING WRONG WITH THE VEHICLE. MY CAR WAS IN MOTION AND DRIVING NORMALLY. I NEEDED TO SCHEDULE A B1 SERVICE (OIL CHANGE AND TIRE ROTATION) SOON BUT IT WAS NOT DUE YET.",
        "vin": "5FNRL5H92DB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2018",
        "dateOfIncident": "07/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON VACATION LAST WEEK AS WE WERE DRIVING AT APPROXIMATELY 70MPH ON I-64 EASTBOUND IN VIRGINIA WE HEARD A LOUD POPPING SOUND AN THEN LOUD AIRFLOW.  WE QUICKLY REALIZED OUR SUNROOF HAD EXPLODED.  THANKFULLY WE HAD IT CLOSED AND THE SHADE WAS ALSO CLOSED AND NO ONE WAS HURT.  NOTHING HIT OUR VAN AND WE WERE NOT INVOLVED IN A ACCIDENT THE SUNROOF JUST SUDDENLY EXPLODED.  WHEN WE WERE ABLE TO PULL OVER WE FOUND THE CENTER OF OUR SUNROOF WAS COMPLETELY SHATTERED.  WE HAVE FOUND OTHER REPORTS ONLINE OF THIS HAPPENING.",
        "vin": "5FNRL5H96DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "06/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103382,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK SLIDE DOORS WILL NOT STAY OPEN MOST OF THE TIME WILL COME SLIDING CLOSED WHEN YOU ARE GETTING IN AND OUT AND I WORRY ABOUT THE KIDS GETTING HURT FROM THEM CAUSE THEY ARE VERY HEAVY DOORS,I HAVE COMPLAINED TO HONDA TOLD ME THEY COULDN'T FIND ANYTHING WRONG",
        "vin": "5FNRL5H22DB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101724,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT THE BRAKE ROTORS WERE DAMAGED BECAUSE THE VEHICLE SHOOK WITH GREAT FORCE. THE VEHICLE WAS TAKEN TO LONG BEACH HONDA (1500 E SPRING ST, SIGNAL HILL, CA 90755, (562) 426-4444), BUT THE FAILURE COULD NOT BE DUPLICATED. THE CONTACT STATED THAT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE BRAKE ROTORS FAILED DUE TO BEING WARPED. THE CONTACT STATED THAT THE VEHICLE WAS BEING REPAIRED.  THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 27,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097755,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON MY BACK HATCH OF MY VAN IS CRACKING AND PEELING OFF. WE BOUGHT THIS VEHICLE 2 YEARS AGO CERTIFIED PRE-OWN FROM A HONDA DEALERSHIP. IT HAS ROUGHLY 50K MILES ON IT. I DO NOT BELIEVE THE PAINT SHOULD BE CHIPPING LIKE THIS.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "05/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094036,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE REAR DOOR HANDLE FOR SLIDING DOOR CAME OFF IN MY HAND WHEN I WAS TRYING TO GET MY CHILD OUT OF THE VEHICLE IN 2016. TOOK VEHICLE INTO THE DEALERSHIP FOR REPAIR AND THEY STATED THAT THE HANDLE MUST HAVE COME OFF DUE TO ALLEGED AND IMPOSSIBLE \"DAMAGE\" EVEN THOUGH THE HANDLE WAS NEVER SUBJECTED TO ANYTHING BUT NORMAL EVERYDAY USE.  IN 2018, THE DOOR HANDLE ON THE PASSENGER SIDE CAME OFF IN THE SAME MANNER EVEN THOUGH WE HAVE BEEN EVEN MORE CAREFUL WITH THE HANDLES AFTER THE FIRST INCIDENT. REPORTED SECOND INCIDENT TO HONDA CUSTOMER SERVICE AND DEALER SERVICE SHOP.  BOTH SAW NOTHING WRONG WITH DOOR HANDLES FALLING OFF RELATIVELY NEW VEHICLE WITH NORMAL USE.  VERY UNSAFE TO BE UNPREDICTABLY PREVENTED FROM GETTING YOUR CHILD OUT OF THE VEHICLE.",
        "vin": "5FNRL5H29DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093819,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ENGINE MOUNT FAILED WITHIN 5 YEARS LESS THAN 36,000 MILES IN NORMAL DRIVING CONDITION.  THIS CAUSED EXCESSIVE ENGINE VIBRATION.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093323,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE HESITATED AND FELT AS IF IT WOULD STALL. THE CONTACT WAS ABLE TO DRIVE HOME. THE FOLLOWING DAY, THE VEHICLE WAS TAKEN TO LUTHER BROOKDALE HONDA IN BROOKLYN CENTER, MINNESOTA 55429 WHERE IT WAS DIAGNOSED THAT THERE WAS CARBON BUILD-UP ON PISTON NUMBER THREE AND THE ENGINE NEEDED TO BE REBUILT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE VIA E-MAIL. THE APPROXIMATE FAILURE MILEAGE WAS 96,000.",
        "vin": "5FNRL5H92DB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092075,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLSOM LAKE HONDA HAS NOT REPAIRED OUR SEAT FOR THE TWO SAFETY RECALLS THAT WE HAVE REPEATEDLY CALLED THEM ABOUT. THEY NEVER SEEM TO HAVE THE PART OR MAY JUST BE UNWILLING TO PERFORM THE REPAIR. AT THIS POINT WE ARE AFRAID TO SEAT OUR KIDS IN THE OUTER 2ND ROW SEATS.",
        "vin": "5FNRL5H91DB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/14/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11085017,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND SEAT FLIPPED OVER A KID SEATED ON THE RIGHT MIDDLE ROW PASSENGER SEAT WHILE CAR WAS DRIVING/IN MOTION.  THIS HAS BEEN ONGOING AND THIS IS THE 2ND TIME THIS HAS HAPPENED. THE KID BECAME TRAPPED, FOLDED AT THE WAIST IN A SEATED POSITION UNTIL WE WERE ABLE TO PULL OVER THE VAN TO RESET THE SEAT.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083935,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. (NORTH SHORE HONDA, 611 GLEN COVE, GLEN HEAD, NY) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5FNRL5H65DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079864,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CASE # 11078950  COULD YOU CANCEL THIS CASE?  I RECEIVED A GOOD ANSWER.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078859,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE NOTIFIED ON 12/202016  ABOUT THIS SAFETY RECALL FOR THE SECOND ROW OUTBOARD SEATS IN OUR HONDA ODYSSEY. WE CONTINUE TO CHECK ON THE RESOLUTION AND THE STATUS WITH HONDA CONTINUES TO BE \"UNRESOLVED, REMEDY NOT YET AVAILABLE\". THIS IS UNSAFE AND CONTINUES TO BE OUR BURDEN TO SPEND TIME ON THIS WITH NO RESOLVE OFFERED.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078950,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE BULLETIN 13-081.  CEL (1/7/16) : CYLINDER 3 COIL R/R WITH SPARK PLUG ( OTHER SHOP - PAID $166.75 )  CEL (3/11/16) : P2422EVAP CANISTER CAME UP FOR SAME SYMPTOM (HONDA SAID CODE IS NOT P0303 - PAID $1722.86)  CEL (7/18/17) : P0303 MISFIRE NO.3 CYLINDER (AUTOZONE)  CEL (7/18/17 - 10 MIN FROM AUTOZONE) - P0353 NO3 CYLINDER IGNITION COIL CIRCUIT CAME UP  (HONDA - PAID $255.41 ; HONDA SAID CODE WAS NOT BETWEEN P0301 TO P0304 SO I HAD TO PAY FOR IT - THEY DO NOT CARE WHAT AUTOZONE SAID )  RECEIVED SEVERAL TIMES WARNING WHEN I GO AND CHANGE ENGINE OIL FROM THE SHOP THAT I DO NOT HAVE ANY LEFT OVER OIL IN THE TANK.  CEL (3/5/18) : FOUND OUT CAR HAS A MISFIRE ON CYLINDER 4 AND RING ON CYLINDER 4 IS LEAKING (OTHER SERVICE  - GOT A SUGGESTION TO GO HONDA DEALER TO CHECK)  MADE AN APPOINTMENT AT HONDA DEALER ON 3/8/18 WITHOUT CEL.    TECH SAID NO CODE IN PCM FI SYSTEM.  HE SAID HONDA CODE IS DIFFERENT FROM ANY OTHER SHOP, SO THEY ONLY FOLLOW WHAT HONDA'S COMPUTER SAYS.(MY OPINION IS THAT WHAT IF THEY DEBUG THEIR SOFTWARE AFTER LOST SETTLEMENT NOT TO SHOW CODE P0301 TO P0304 AND SHOW LITTLE DIFFERENT CODE FOR CUSTOMER'S RESPONSIBILITY - WHAT IF ALL OTHERS SAY P0303 ; ONLY HONDA COMES UP WITH DIFFERENT CODE)  TECH SAID IF I DO NOT PAY FOR IT, HE DOES NOT EVEN LOOK AT IT. HE SAID HE DOES NOT WANT TO DO ANYTHING ON THE ENGINE WHICH HAS 184,000 MILES ON IT IF HONDA OR I DO NOT PAY (IT'S 2013 ODYSSEY)  HE TOLD ME THIS FOR THE OIL LEAKING WHICH EVERY CAR BURN A QUART OF OIL EVERY 1,000 MILE, SO I HAVE TO CHECK OIL LEVEL ALL THE TIME.  HE SAID WHEN I HAVE ANOTHER CEL ON, JUST COME TO HONDA TO CHECK. (DO NOT GO ANY OTHER SHOP OR BRING CODE FROM OTHER SHOPS - HE IS NOT GOING TO AGREE ON ANY OTHER SHOP'S CODE OR COMMENT)  MY WORRY IS THAT IF OTHER SHOPS SAY P0303 OR P0304, AND HONDA SAYS DIFFERENT CODE WHICH MAKE I PAY FOR IT. WHAT'S GOING TO HAPPEN?",
        "vin": "5FNRL5H4XDB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066291,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA ODYSSEY. CONSUMER WRITES IN REGARDS TO DEFECTIVE TAILGATE. *LD    THE CONSUMER STATED THE HYDRAULIC STRAY STRUT WAS REPLACED UNDER WARRANTY. THE FAILURE RECURRED. *JS",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066202,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND ROW OUTER SEATS TIPPING  2ND ROW WALK-IN FUNCTION INOP",
        "vin": "5FNRL5H41DB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064626,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. WHILE DRIVING VARIOUS SPEEDS, THE SECOND ROW SEATS WOULD NOT LATCH AND MOVED BACK AND FORTH. SURPRISE HONDA IN SURPRISE, ARIZONA WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO A COLLISION CENTER TO HAVE THE SECOND ROW SEATS REMOVED AND WELDED BACK TO THE SEAT TRACK. EARNHARDT HONDA IN AVONDALE, ARIZONA WAS MADE AWARE OF THE FAILURE AS WELL AND REPLACED THE RUBBER GARMENTS OF THE SEAT TRACK, BUT THE FAILURE RECURRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS), BUT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. WHILE DRIVING VARIOUS SPEEDS, ESPECIALLY ABOVE 40 MPH, THERE WAS VIBRATION IN THE VEHICLE AND THE ECO WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER (APOSTOLAKIS HONDA, 3156 ELM RD, CORTLAND, OH 44410) WHERE IT WAS DETERMINED THAT THE VEHICLE WAS FUNCTIONING AS DESIGNED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 35,000. *TT  *TR",
        "vin": "5FNRL5H47DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES VIBRATE WHEN SLOWING DOWN ON THE FREEWAY, OCCASIONALLY WHILE DRIVING ON SURFACE STREETS WHEN SLOWING DOWN FOR LIGHTS.  I FIRST NOTICED THIS SEVERAL MONTHS AFTER PURCHASE.  I TOOK THE VAN IN ASKED FOR THE BRAKES TO BE CHECKED.  THE VIBRATING STOPPED FOR SEVERAL WEEKS THEN STARTED BACK UP.  I RETURNED TO THE DEALERSHIP AND THEY CHECKED THE TIRES.  IT STOPPED AGAIN FOR SEVERAL WEEKS THEN STARTED BACK UP AGAIN.  I TOOK THE VAN IN AND ASKED FOR THE ROTORS TO BE TURNED.  THAT AGAIN HELPED FOR A FEW WEEKS AND THE VIBRATING RETURNED.  IT IS FRUSTRATING AND SCARY TO FEEL THE VIBRATION IN MY STEERING WHEEL AND IF I BRAKE HARD TO FEEL THE VAN PULL TO THE RIGHT.  I HAVE EXPLAINED THIS PROBLEM TO THE SERVICE TECHNICIAN BUT THERE SEEMS TO BE NOTHING THEY CAN DO TO FIX THIS PROBLEM.  I COMPLAIN ABOUT IT BUT CANNOT AFFORD TO CONTINUE TO TAKE IT IN AND GET NO SATISFACTORY REPAIRS.  AT ONE POINT I CAME HOME AND AIRED UP MY TIRES AND THAT SEEMED TO HELP FOR ABOUT 3 MONTHS.  THEN THE VIBRATION IS BACK AGAIN.  THIS PROBLEM HAS BEEN GOING ON SINCE I PURCHASED THE VAN IN DECEMBER, 2014 AND CONTINUES TO THIS DAY.  IS THERE ANY SOLUTIONS THAT HAVE BEEN FOUND FOR THIS PROBLEM???",
        "vin": "5FNRL5H21DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "QUITE OFTEN, THE VEHICLE DOES NOT RESPOND TO THE ACCELERATOR WHEN MOVING SLOWLY, I.E. AT AN INTERSECTION, OR WHEN STOPPED.  IT HAPPENS MOST OFTEN WHEN INITIATING A TURN, FROM A STOP OR SLOW ROLL. THE HESITATION IS UNNERVING!  IT CAN LAST A HALF-SECOND, WHICH IS A LONG TIME WHEN CARS ARE APPROACHING.  IT MAY BE THE ACCELERATOR, THE ENGINE, OR THE TRANSMISSION.  SEEMS THE ENGINE IS NOT BEING TOLD TO INCREASE POWER IN REAL TIME. THE DEALER, OF COURSE, WILL NOT DO ANYTHING UNLESS IT CAN BE DUPLICATED, WHICH IS HARD TO DO IN A SHORT TEST DRIVE WITH A TECHNICIAN.  THEY WANT $106.00 FOR EVERY TIME I TRY.  I AM SURE HONDA IS AWARE OF THE SITUATION, BUT THEY PUT IT ON THE DEALER, SO NO ACTION IS TAKEN.  THANK YOU HONDA FOR RUINING OUR FAITH IN YOUR PRODUCT!",
        "vin": "5FNRL5H60DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "07/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN HWY 41 IN ACWORTH, GA, WITH MY 2 KIDS IN THE CAR, AND I HEARD A VERY LOUD \"POP.\" IT SOUNDED LIKE SOMETHING EXPLODED, BUT I DIDN'T SEE ANYTHING. I THEN HEARD THE SOUND OF WIND, THINKING ONE OF MY KIDS ROLLED DOWN ONE OF THE WINDOWS, BUT I CHECKED THEM ALL AND THEY HAD NOT. I OPENED THE SHADE COVER FOR THE SUNROOF, TO FIND A HUGE HOLE IN THE MIDDLE OF IT, AND THE REST OF THE GLASS SPIDER WEBBED/SHATTERED. I QUICKLY CLOSED IT AND GOT HOME TO FURTHER INSPECT. WE WERE UNABLE TO FIGURE OUT WHY IT HAPPENED, BUT SPENT $800 HAVING IT REPAIRED (AND THAT WAS WITH A USED SUNROOF).",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AT 77250 MILES DEALERSHIPINSP    CHECK ENGINE LIGHT CAME ON AT A    CHECK ENGINE  LIGHT CAME ON AT APPROXIMATELY 77230 MILES HONDA DEALERSHIP DIAGNOSED  AS CODE P0302 MISFIRE  FOUND FILED PLUG  REPLACED PISTON RINGS ON CAL 1-3  AND REPLACED SPARK PLUGS            1-4 .THIS IS NOT THE WORK SCOPE CALLED FOR BY THE 2013 RECALL FOR PISTON PROBLEMS BUT COULD BE RELATED. I AM CONCERNED SINCE I AM THE ORIGINAL OWNER OF A2003 HONDA ODYSSEY WITH 372000 MILES ON IT WITHOUT REQUIRING ANY ENGINE WORK OTHER THAN MAINTENANCE SPECIFIED AND PERFORMED BY HONDA .I AM THANKFUL FOR THE ENGINE WARNING LIGHT  HOWEVER THE SUDDEN STOPPING TO RESULTING FROM ITS FAILURE  COULD CAUSE A SERIOUS OR FATAL ACCIDENT.R",
        "vin": "5FNRL5H64DB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035137,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONSUMES OIL-ENGINE MISSES AND STALLS-LIGHTS COME ON SIGNALING TRACTION. BACK SEAT SLIDES BACK AND FORTH CONSTANTLY-  SOLUTION ON NHTSA WEBSIT IS RECALL NUMBER  13V382000  RECALL DATE  08/27/2013  COMPONENT  ENGINE  SUMMARY  HONDA IS RECALLING CERTAIN MODEL YEAR 2013 PILOT 2WD AND 4WD VEHICLES AND CERTAIN MODEL YEAR 2013 ODYSSEY VEHICLES. DURING MANUFACTURING OF THE ENGINE PISTON, IT IS POSSIBLE THAT THE HEAT TREATMENT PROCESS WAS NOT PROPERLY APPLIED, RESULTING IN THE PISTON HAVING AN INSUFFICIENT HARDNESS LEVEL, MAKING IT MORE SUSCEPTIBLE TO PREMATURE WEAR.    CONSEQUENCE  A WORN PISTON MAY SUDDENLY FAIL, CAUSING THE ENGINE TO STALL, INCREASING THE RISK OF A CRASH.    WHAT OWNERS SHOULD DO  HONDA WILL NOTIFY OWNERS, AND DEALERS WILL REPLACE THE ENGINE SHORT BLOCK FREE OF CHARGE. THE RECALL BEGAN ON SEPTEMBER 16, 2013. OWNERS MAY CONTACT HONDA AT 1-800-999-1009. HONDA'S RECALL NUMBERS ARE JB4 (HONDA ODYSSEY) AND JB5 (HONDA PILOT). VICTORY HONDA REFUSES TO REPLACE SHORT BLOCK--THEY CLAIM MY VIN NUMBER DOES NOT MATCH COMPLAINT--CALLED HONDA AMERCAN AND THEY HUNG THE PHONE UP ON ME.    CAR WAS BEING DRIVEN ON HWY 51 NEAR COVINGTON (SPEED LIMIT 55)    I AM ALSO BEING TOLD BY VICTORY HONDA OF JACKSON TN THAT MY ODYSSEY FALLS UNDER SERVICE BULLETIN 13081 (PISTON RING REPLACEMENT) AND NOT UNDER BULLETIN SERVICE 13075 (SHORT LOCK REPLACEMENT). I AM TRYING TO VERIFY THIS AND CAN FIND NO SUPPORTING DATA.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/11/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032947,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. WHILE DRIVING APPROXIMATELY 45 MPH, A LOUD BOOMING NOISE SUDDENLY OCCURRED. AFTER STOPPING THE VEHICLE, IT WAS DISCOVERED THAT THE GLASS SUN ROOF HAD EXPLODED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE DEALER (MIKE WHATLEY HONDA IN BROOKHAVEN, MISSISSIPPI) AND THE MANUFACTURER WERE BOTH NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013978,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY 70 MILES PER HOUR AND I ADJUSTED IN MY SEAT.  MY KNEE KNOCKED THE IGNITION FROM THE \"ON\" POSITION TO OFF.  I QUICKLY TURNED THE KEY BACK TO THE ON POSITION.  THE CHECK ENGINE LIGHT WAS ON FOR SEVERAL DAYS AND WENT OFF AND REMAINED OFF.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "06/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004212,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING IN VARIOUS SPOTS ON THE VEHICLE. FIRST SPOT WAS A SMALL PEEL ON THE ROOF, HONDA REPAIRED. NOW THE ENTIRE LOWER HALF OF THE TAILGATE PEELED DURING A SIMPLE CAR WASHING. IT CAME OF LIKE IT WAS A DECAL WITH NO MORE GLUE! UGHH.",
        "vin": "5FNRL5H9XDB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003835,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 HONDA ODYSSEY SLIDING DOOR CABLE BROKE AND THE DOOR SLID FORWARD NEARLY CATCHING MY YOUNG SON'S HAND BETWEEN THE DOOR AND THE FRONT PART OF THE FRAME.  ALSO NOW THAT THE CABLE HAS SNAPPED THE DOOR WILL NOT OPEN COMPLETELY TOWARD THE REAR OF THE VEHICLE LIMITING THE ABILITY TO EXIT THE VEHICLE FROM THAT SIDE IN AN EMERGENCY.  THE VEHICLE HAS APPROXIMATELY 70K MILES ON IN IT AND IT APPEARS AS THOUGH THE CABLE RUSTED THROUGH IN ONE SPOT ALTHOUGH IT IS COATED IN PLASTIC.",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001458,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Diono",
                "productMake": "DIONO",
                "productModel": "RAINIER",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A DIONO  SAFETY SEAT, MODEL TYPE: RADIAN RXT MODEL, MODEL NUMBER US16900 AND MANUFACTURED IN 4/01/2013. THE SAFETY SEAT WAS BEING UTILIZED IN A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE ATTEMPTING TO RELEASE THE CROTCH BUCKLE, THE BUCKLE FAILED TO RELEASE AND REQUIRED EXCESSIVE PRESSURE TO RELEASE. THE LATCH THAT HELD THE SEAT IN PLACE ALSO FAILED TO SECURE THE SEAT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO PURCHASE REPLACEMENT PARTS, BUT THEN STATED THAT THE MANUFACTURER WOULD REPLACE THE CROTCH BUCKLE. THE SEAT WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995821,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL ON MY MODEL. THIS PISTON RINGS WEAR PREMATURELY AND CAUSE THE ENGINE TO STALL. THE OFFICIAL REPORT (RECALL #13V382000) LISTS ONE OF THE DANGERS AS THE FACT THAT THE ENGINE CAN STALL AND INCREASE THE RISK OF CRASH/INJURY. HOWEVER, HONDA WILL NOT COVER THE REPAIR AS THE VEHICLE HAS A SALVAGE TITLE. HOWEVER, I DO NOT SEE HOW THIS IS NOT A SAFETY ISSUE AND THEREFORE SHOULD BE LEGALLY REQUIRED TO BE COVERED AS IT PUTS MY FAMILY IN DANGER.",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000062,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL OWNER OF 2013 HONDA ODYSSEY, NOTICED SIGNIFICANT STEERING WHEEL VIBRATION AT 35K MILES WHILE GOING DOWN OR AT HIGHWAY SPEEDS WHILE SLOWING DOWN UNEXPECTEDLY. IT MADE ME GRAB THE STEERING WHEEL HARDER TO TRY TO STEADY THE WHEELS SO WE DON'T DRIVE OFF THE CLIFF.  I BELIEVE IT POSES A DANGER AS IT CREATES A SITUATION WHERE SUCH STEERING WHEEL VIBRATION AND TIRES VIBRATION CAN CAUSE A DANGEROUS SITUATION IN WHICH THE CONTROL OVER VEHICLE COULD BE LOST ALONG WITH LIVES OF THOSE IN THE CAR. I HAVE JUST REPLACED THE TIRES, WHICH WAS NOT THE CAUSE OF THE VIBRATION. THE CAR IS IN GOOD STANDING AS ALL RECOMMENDED SERVICES WERE COMPLETED TIMELY. WHEN CONTACTED THE LOCAL HONDA DEALER, THEY SAID THAT ROTORS NEEDS TO BE RESURFACED. BUT AS I AM READING ON THIS SITE AND OTHERS, THIS COULD BE AN ENDLESS AND EXPENSIVE RECURRENT SERVICE. THIS VEHICLE IS DESIGNED TO BE A FAMILY VEHICLE, THEREFORE IT SHOULDN'T BE A STANDARD WHEN ROTORS COME OUT OF FUNCTIONALITY AS SOON AS VEHICLE IS OUT OF FACTORY.",
        "vin": "5FNRL5H44DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT BRAKE ROTORS WERE UNSAFELY SHUDDERING AT 31,000 MILES AND I HAD THEM REPAIRED ON 6/29/2016.  NOW, THEY ARE SHUDDERING AGAIN AT 44,341, ON 6/7/2017.  THERE ARE MANY SIMILAR COMPLAINTS EASILY FOUND ON THE INTERNET WERE DRIVERS, SIMILAR TO ME, ARE ALARMED BY A SEEMING UNSAFE AND DEFECTIVE OVERALL BRAKE SYSTEM ON THE 2013 HONDA ODYSSEY, AND SIMILAR YEAR MODELS.  THE SHUDDERING  CAN BE SEVERE WHEN BRAKING BETWEEN 50 TO 70 MPH. THERE ARE MANY OTHER CASES SIMILAR TO MINE WHERE PEOPLE ARE REPAIRING THEM AND THEN THE UNSAFE SHUDDERING REOCCURS AGAIN IN JUST A FEW THOUSAND MILES. THE VAN HAS BEEN ADULT DRIVE FOR ITS ENTIRE HISTORY, WITH 4 SMALL CHILDREN AND ADULTS AS OCCUPANTS.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE NEW IN MAY 2013.   VEHICLE SHAKES VIOLENTLY WHENEVER BRAKING.  ALL 4 ROTORS REPLACED AT 15,900 MILES WITH AFTER MARKET.  HAPPENED AGAIN AT 48,000 MILES AND THE FRONT ROTORS WERE REPLACED WITH AFTERMARKET AGAIN.  HAPPENED AGAIN AT 72,000 MILES AND FRONT ROTORS WERE RESURFACED.  CURRENTLY HAVE 72,300 MILES ON VEHICLE.",
        "vin": "5FNRL5H90DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10983322,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INSIDE THE VEHICLE AT THE BACK SEAT, VEHICLE WAS STATIONARY ON PARK, AND FOOT BREAK WAS ON. I WAS ON MY SISTER IN LAWS DRIVEWAY WHICH IS SLIGHTLY INCLINED, I WAS WAITING FOR MY HUSBAND WHO WENT INSIDE THE HOUSE, HOWEVER I DECIDED TO FOLLOW HIM. I WENT OUT OF THE VEHICLE, AND WENT TO OPEN THE DRIVER'S SIDE DOOR TO REACH THE KEY AND TURN OFF THE VEHICLE; UNFORTUNATELY, WHEN I TURNED OFF THE ENGINE, THE VEHICLE STARTS ROLLING, I WAS KNOCKED DOWN BY THE OPENED DOOR AND FELL ON THE DRIVEWAY, WITH MY LEFT LEG/ MORE ON THE ANKLE AREA WAS RUN OVER BY THE FRONT WHEEL. THESE RESULTED WITH SEVERE BRUISE ON MY ANKLE, AND HUGE BUMP ON MY HEAD. THERE WAS NO WITNESS, HOWEVER THERE WAS A CAR THAT PASSED AND I I ASKED FOR HELP, THE DRIVER CALLED BY HUSBAND WHO IS INSIDE THE HOUSE, ALSO A NEIGHBOR CAME TO HELP AND CALLED 911. BY HUSBAND LOOKED INSIDE THE VEHICLE WHICH SLIDE TOWARDS THE  FRONT NEIGHBORS DRIVEWAY, THE VEHICLE STOPPED, STILL ON \"P\" MODE AND FOOT BREAK IS STILL ON.        THE VEHICLE ON P AND FOOT BREAK ON SHOULD NOT MOVE OR ROLL.",
        "vin": "5FNRL5H95DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A UNPREDICTABLE MANNER, THE VAN LOOSES POWER WHEN TRYING TO ACCELERATE AT SPEEDS OF 35-65 MPH. TWICE I THOUGHT THERE WAS A REAL CHANCE WE WOULD GET REAR ENDED. HERE IS WHAT HAPPENED ON AT LEAST 20 OCCASIONS OVER A TWO WEEK PERIOD. 1) I WOULD TRY TO ACCELERATE AT  SPEEDS OF 35-65 MPH AND USUALLY WHEN GOING UP HILL. 2) THE VAN WOULD NOT RESPOND (ACCELERATE) BUT RATHER THE ECO LIGHT WOULD FLASH ON AND OFF 2 OR 3 TIMES AND MANY TIMES THE RPMS WOULD DROP RAPIDLY FROM 2000 DOWN TO 1000 OR SO. 3) EVEN AFTER 1-3 SECONDS NO RESPONSE. 4) IF I REMOVED MY FOOT FROM THE ACCELERATOR AND THEN DEPRESSED THE ACCELERATOR AGAIN, IT WOULD THEN RESPOND NORMALLY. AS FAR AS I CAN RECALL, THE CRUISE CONTROL WAS NOT ENGAGED WHEN ANY OF THESE INCIDENTS OCCURRED. AFTER NO PROBLEMS AND OVER 2000 MILES LATER, THE VAN FAILED TO ACCELERATED WHEN GAS PEDAL PRESSED 5 MORE TIMES IN 2 DAYS. SO FAR FOR 6  WEEKS NO PROBLEM.  ALSO, THERE ARE TIMES THAT THE VEHICLE, WHEN STOPPED,  WILL HESITATE FOR 1-2 SECONDS AND THEN SURGE FORWARD WHEN ACCELERATOR IS DEPRESSED.",
        "vin": "5FNRL5H97DB"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980345,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SENSOR ISSUES",
        "vin": "5FNRL5H63DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980017,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A HONDA ODYSSEY 2013 AND HAVE HAD THE ROTORS TURNED TWICE ALREADY AT A COST OF OVER $400 EACH TIME.  I NOW NEED IT AGAIN BECAUSE OF VIBRATION WHEN YOU TRY TO BRAKE AT HIGHER SPEEDS AND JUST SEE THAT I AM NOT THE ONLY PERSON COMPLAINING ABOUT THIS.  WHY ISN'T THERE A RECALL ON THESE ROTORS?",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTARS WARP PREMATURELY. MY VEHICLE HAS 124,000 MILES ON IT AND AROUND EVERY 25,000 OR SO THE FRONT ROTARS HAVE SYMPTOMS OF BEING WARPIED. THEN THE BRAKES AND ROTARS NEED REPLACING.",
        "vin": "5FNRL5H65DB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969367,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V933000 (SEATS). AFTER TAKING THE VEHICLE TO THE DEALER TO BE REMEDIED THE CONTACT WAS INFORMED THAT THE RECALL WAS CORRECTED. THE CONTACT STATED THAT WAS NOT PLAUSIBLE DUE TO THE RECALL COMPONENT BEING AT THEIR RESIDENCE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 06/02/17*LJ  *AS",
        "vin": "5FNRL5H40DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PULLING OUT OF MY DRIVEWAY, MY BRAKES WOULD NOT ENGAGE.  IT WAS SIMPLY AS IF THEY WERE NOT THERE.",
        "vin": "5FNRL5H43DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956890,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/22/2017, MY WIFE  WAS DRIVING VEHICLE, SUDDENLY HESITATES AND STALLS.  PROCEEDS TO THE NEAREST  VEHICLE SERVICE LOCATION (NOT A HONDA DEALER).  TECHNICIAN EVALUATES CODES (ALL MISFIRES - P0304, P0305, P0306 & P0300).  INFORMS WIFE OF PISTON/ENGINE RECALL AND SERVICE BULLETINS.  REPLACES 3 SPARK PLUGS TO MAKE VEHICLE DRIVABLE AND CLEARS CODES.  ADVISES TO CONTACT HONDA DEALERSHIP.  I CONTACT DEALERSHIP AND MAKE APPOINTMENT FOR NEXT MORNING (2/23).  AFTER BRINGING IN VEHICLE, DEALER ADVISES THAT UNDER WARRANTY THEY ARE NOT AUTHORIZED TO DO REPAIR AS THE CODES WERE CLEARED BY 3RD PARTY AND ARE NOT SHOWING NOW.  THEIR RECOMMENDATION IS TO DRIVE VEHICLE UNTIL ISSUE ARISES AGAIN (NOT IF ISSUE ARISES, BUT WHEN ISSUE ARISES) AND TO HAVE IT BROUGHT BACK TO DEALER FOR REPAIR.  I EXPRESSED CONCERN THAT THIS IS A KNOWN AND DOCUMENTED DEFECT, YET THEY WILL NOT REPAIR.  I ALSO EXPRESSED THAT THIS IS A LEGITIMATE SAFETY CONCERN IN THAT THE FAILURE WAS SUDDEN AND UNEXPECTED AND THAT IF MY WIFE WAS DRIVING THE VEHICLE WITH MY CHILDREN ABOARD AND THE FAILURE OCCURS IN TRAFFIC OR AS SHE IS MERGING OR ENTERING A ROADWAY, A CRASH CAN OCCUR.  DEALER MAINTAINED POSITION THAT THEY WERE NOT AUTHORIZED TO DO THE WORK UNDER THE WARRANTY.  CONTACTED AMERICAN HONDA AND WAS TOLD THAT WORK WOULD NOT BE AUTHORIZED DUE TO 3RD PARTY CLEARING CODES.  HONDA ASSIGNED CASE MANAGER AND CASE NUMBER ([XXX]) AND ADVISED THE SAME.  I HAVE ASKED TO SPEAK TO SUPERVISORS, BUT HAVE NOT RECEIVED A RESPONSE TO DATE.  AM CONCERNED THAT THIS IS A KNOWN DEFECT, WITH A KNOWN REPAIR, AND HONDA'S REFUSAL TO ADDRESS IS A SIGNIFICANT SAFETY CONCERN.   NOTICED SIMILAR COMPLAINTS LISTED AS NHTSA 10950032, 10907653, 10875963, 10682162, 10660226, 10588234, 10496891. DEALERSHIP IS HONDA KINGSPORT (TN).    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950032,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST TAKEN A SHORT DRIVE AND WAS BACKING THE VEHICLE BACK INTO MY DRIVEWAY WHEN THE ENGINE LIGHT CAME ON AND THE ENGINE STARTED TO ACT LIKE IT HAD A MISFIRE. THIS HAPPENED AT JUST OVER 60,000 MILES.  I TOOK IT TO THE LOCAL HONDA DEALER (JENKINS & WYNNE OF CLARKSVILLE, TN) TO SEE IF THERE MIGHT BE A RECALL ON THE ISSUE OR IF IT WAS A COMMON PROBLEM.  THEY CHECKED OUT MY VAN AND TOLD ME THAT IT WAS A COMMON RECALL FOR MY MODEL WHICH WAS A FOULED SPARK PLUG IN CYLINDER FOUR DUE TO THE PISTON RINGS ALIGNING AND CAUSING OIL TO ENTER THE CHAMBER AND CAUSE THE SPARK PLUG TO FOUL.  THIS ALSO EXPLAINS WHY I USE SO MUCH OIL IN BETWEEN OIL CHANGES.  HOWEVER, WHEN THEY ENTERED MY VIN INTO THE COMPUTER, MY VEHICLE DOES NOT COME UP AS COVERED UNDER THE 8 YEAR UNLIMITED MILLAGE RECALL THEY HAD FOR THIS PROBLEM.  SO I TALKED TO TWO DIFFERENT PERSONNEL AT AMERICA HONDA TO SEE IF I COULD GET THIS PROBLEM RECTIFIED WITH OUT ME SPENDING OVER $2,000 OUT OF POCKET. SINCE IT IS THE EXACT SAME PROBLEM ON THE VEHICLES COVERED UNDER THE WARRANTY.  THEY WERE NO HELP IN FIXING MY PROBLEM.",
        "vin": "5FNRL5H44DB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934784,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE MOUNTAINS OF COLORADO WHILE ON VACATION OUR STEERING WHEEL WAS VIOLENTLY SHAKING AND VIBRATING WHILE BRAKING DOWNHILL.  THIS WAS VERY SCARY FOR OUR FAMILY FROM ILLINOIS TO EXPERIENCE. WE SCHEDULED IMMEDIATE REPAIRS AT THE SHOP  NEAREST US ON 6/22/2015 WITH 36,206 MILES ON OUR HONDA ODYSSEY. WE HAD NEW ROTORS ON FRONT AND REAR REPLACED AND FRONT BRAKES $685. UNFORTUNATELY, WHILE ON A ROAD TRIP TO SEE FAMILY IN MICHIGAN WE AGAIN EXPERIENCED SHAKING OF THE STEERING WHEEL UPON BRAKING.  ON 12/2/2016 57,428 MILES WE AGAIN HAD TO PAY FOR REAR ROTORS AND BRAKES.  WE HAVE NEVER EXPERIENCED THE FREQUENCY OF REPAIRS (WE TRUST OUR REPAIR GUY) IN ANY OF OUR OTHER VEHICLES (FORDS AND CHEVYS). OUR VAN IS USUALLY DRIVEN AROUND TOWN WITH KID'S ACTIVITIES.  EXPRESSWAY AND HIGH SPEED DRIVING IS LIMITED. THIS IS OUR FIRST HONDA.  THEN ON 12/10/2016 WITH 57,569 MILES THE ENGINE LIGHT AND VSA (VEHICLE STABILITY ASSIST) LIGHT STAYS ON.  TURNS OUT SPARK PLUGS 1 AND 2 FOULING..I'M SEEING THERE ARE COMPLAINTS HERE ABOUT THESE SAME ISSUES. I CONTACTED HONDA REGARDING THE SPARK PLUGS AND THEY SAID THERE IS AN EXTENSION TO COVER THIS IF I WENT TO AN AUTHORIZED DEALER. I HOPE THIS IS TRUE AND IT WORKS OUT, REPAIRS ARE EXPENSIVE AND WE WANT TO BE SAFE!",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/06/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915953,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A HEAD ON CRASH WITH FRAME AND STRUCTURAL DAMAGE TO THE ENTIRE FRONT END AT SPEEDS OF 30 MILES PER HOUR, HITTING A STATIONARY TRUCK ON A CITY STREET.  THE AIR BAGS DID NOT DEPLOY.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913649,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING ON THE HIGHWAY GOING 65 MPH THE CAR IN FRONT WAS GOING SLOW SO I DECIDED TO HIGH BEAM THEM SO THEY MOVE OVER TO THE RIGHT LANE BUT THEY DIDN'T SO I WENT AROUND THEM AND THEY SWERVE TO MY RIGHT LANE. SO I SLOW DOWN AND WHEN I HAD THE CHANCE TO PASS THEM THEY WERE RECORDING MY CAR/MYSELF. AFTER I PASSED THEM THEY CAME IN FRONT OF US AND THREW SOMETHING OUT THE WINDOW AND NOW I GOT A SCRATCH ON THE CAR. WHEN THEY THREW SOMETHING I DECIDED TO GO NEXT TO THWRE CAR HER PASSENGER  WHICH LOOK LIKE IT WAS HER SON WAS THE ONE WHO THREW IT OUT THE WINDOW.",
        "vin": "5FNRL5H99DB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10910494,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO- MY WIFE WAS INVOLVED IN A ACCIDENT ON 9-28-16. SHE HIT ANOTHER CAR ON ITS SIDE. THE OTHER CARS AIRBAGS DEPLOYED HOWEVER HER'S DID NOT. SHE WAS DRIVING ABOUT 25MPH BUT COULD NOT STOP IN TIME. SHE WAS ON A CITY STREET GOING STRAIGHT. WE WANTED TO MAKE SURE THAT THE AIRBAGS WERE OPERATING CORRECTLY AND NOT INVOLVED IN THE TAKATA RECALL. THANKS",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907653,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL BURNING AND PREMATURE SPARK PLUG FAILURE. THE CAR WAS DRIVING ON THE  HIGHWAY WHEN IT WAS NOTICED TO BE RUNNING POORLY.",
        "vin": "5FNRL5H21DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905577,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CLEANING OUR EVENFLO SYMPHONY CONVERTIBLE CAR SEATS, I FOUND THE STRAPS WHICH RESTRAIN OUR CHILDREN CUT WEARING ON THE SEAT PLASTIC IN THE EXACT SAME SPOT ON BOTH SEATS. THE FIRST SEAT IS MODEL NUMBER 3451953, MANUFACTURE DATE: 5/13/2010. THE OTHER (NEWER) SEAT (MODEL 3101964, MADE 2-14-2013).  I CONTACTED EVENFLO AND THEY SAID TO JUST THROW THE SEATS AWAY , WHICH WE DID. I ATTACHED A PICTURE OF THE OLDEST SEAT.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897726,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VIBRATING WHEN HITTING BRAKE ON HIGHWAY. MY CAR MILEAGE IS 36642. THE HONDA DEALER SAID IT'S FRONT ROTORS ISSUE BEFORE CHECKING. I GUESS IT'S COMMON FOR THIS YEAR MODEL. I ALSO GOT THE 2ND OPINION FROM THE WHEELWORKS SHOP AND THEY SAID \"THE FRONT ROTORS HAVE HEAT RINGS\", BUT THE FRONT BRAKE PADS BOTH ARE \"8MM\"(GREEN MEANING GOOD CONDITION).",
        "vin": "5FNRL5H67DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES VIBRATE EXCESSIVELY WHEN APPLIED AND WHEN AT LEGAL SPEEDS OF 60 OR 70 VEHICLE IS SOMETIMES HARD TO CONTROL.  I ASKED THE DEALER TO FIX THE PROBLEM AND HE SAID HONDA WOULD NOT REPLACE THE DISCS AND HE COULD ONLY TURN THEM THE STOP THE VIBRATION.  THIS WAS DONE AT AROUND 16,000 MILES, BUT WITHIN A FEW MONTHS AND A FEW THOUSAND MILES THE VIBRATION BEGAN TO REAPPEAR AND HAS CONTINUALLY GOTTEN WORSE.  FROM TALKING TO MECHANICS THAT WORK ON THESE VEHICLES AND SEARCHING THE WEB IT IS MY UNDERSTANDING THAT THE DISC DESIGN DOES NOT ALLOW FOR THE HEAT FROM BRAKING TO DISSIPATE THUS WARPING THE DISC.  I FEEL HONDA SHOULD REPLACE THE DISCS WITH NEWLY DESIGNED ONES TO ALLEVIATE THIS PROBLEM.  IF MYSELF OR MY WIFE HAD TO APPLY THE BRAKES IN AN EMERGENCY IT IS POSSIBLE THAT THE VEHICLE COULD BE UNCONTROLLABLE AND COULD CAUSE A SEVERE ACCIDENT.",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887996,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA ODYSSEY TAKEN TO SHOP IN 8/14 WITH 11,000 MILES.  TOLD DEALER WAS SHAKING WHEN SLOWING DOWN.  RESURFACED ROTORS.  STARTED AGAIN IN 8/15 AT 18,000 MILES.  THEY BALANCED TIRES.  STARTED AGAIN IN 5/16 AT 26,000 MILES.  WAS TOLD IT WAS BRAKE ROTORS BUT DON'T NEED TO RESURFACE AS IS NOT DANGEROUS AND CAN WAIT UNTIL REPLACE COMPLETELY.",
        "vin": "5FNRL5H49DB"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2013 HONDA ODYSSEY EXL 1 YEAR AGO (7/18/16).  WE  IMMEDIATELY EXPERIENCED EXCESSIVE VIBRATION OF THE STEERING WHEEL WHILE DRIVING, AND ALSO BRAKING AT HIGHWAY SPEEDS. THE DEALER REPLACED THE FRONT TIRES ABOUT 4 MONTHS OUT TO CORRECT THE PROBLEM.  I DIDN'T WORK.  WE ASKED THEM TO CONSIDER THE ROTORS AS THE ISSUE, BUT THEY WERE RELUCTANT SINCE THEY WERE JUST RESURFACED THEM BEFORE WE BOUGHT THE VEHICLE.  EVENTUALLY, THEY DID AGREE, AND ALL FOUR ROTORS NEEDED RESURFACING. THE SERVICE DEPT TOLD US OUR 8 MONTH OLD TIRES HAD WEAR BEYOND THE NORMAL AMOUNT, AND SUGGESTED IT WAS PROBABLY CAUSED BY THE VIBRATION PROBLEMS.  WE'RE GETTING ANOTHER SET OF TIRES FROM THE DEALER, BUT ARE CONCERNED THAT WE WILL SOON BE HAVING TO RESURFACE THE ROTORS AGAIN BASED ON THE HISTORY I'VE ALREADY SPOKEN OF HERE, AND OTHER COMPLAINTS THAT HAVE BEEN FILED.  WE FEEL HONDA SHOULD BE FORCED TO RECALL AND REPLACE THE ROTORS ON THE 2013 HONDA ODYSSEY. THERE IS CERTAINLY ENOUGH DOCUMENTATION OF THE PROBLEM.",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881845,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ODYSSEY IS 19,600 MILES. I'M EXPERIENCING VIBRATIONS IN BRAKE PADDLE, ACCELERATOR PADDLE AND STEERING WHEEL WHEN BRAKING AND WHILE ACCELERATING BETWEEN 35-40 MILES. TOOK THIS VEHICLE TO SERVICE CENTER, THEY WRAP ROTORS. SO, BRAKING VIBRATIONS ARE GONE, BUT ACCELERATOR VIBRATION IS ON. HONDA SERVICE CENTER CANNOT RESOLVE IT AS VIBRATION IS NOT HEAVY. THIS SEEMS TO BE COMMON PROBLEM WITH MANY HONDA ODYSSEY OWNERS. I REQUEST YOU TO HELP RESOLVING THIS ISSUE FOR ME AND ALL OWNERS FOR ONCE AND ALL.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/30/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875963,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN TOWN AND STOPPING FOR LIGHTS THE CAR HESITATES WHEN STEPPING ON THE GAS AGAIN AND ALMOST STOPS.  I CAN GET IT TO GO AGAIN IF I LET GO OF THE GAS AND STEP ON THE GAS AGAIN.  THIS ALSO HAPPENS WHEN I AM DRIVING ON THE FREEWAY AND I GO TO ACCELERATE AND IT HESITATES THEN I DO THE SAME THING AND IT STARTS TO PICK UP SPEED.  THIS IS DANGEROUS WHEN I AM TRYING TO TURN IN FRONT OF CARS, SWITCH LANES AND WHEN OTHERS DO NOT NOTICE I STOP WHEN STARTING OFF AT A LIGHT.  I HAVE HAD THIS INTO THE REPAIR SHOP AND THEY SAY IT IS A COMPUTER PROBLEM BUT THERE IS NO FIX.  I WANT TO BUY A NEW HONDA BUT CAN NOT BUY ANOTHER CAR WITH THIS PROBLEM CONNTINUES.  UNFORTUNATELY IT DOES NOT DO IT ON COMMAND SO I CANNOT GO AND GET A REPAIR MAN TO RIDE AND FEEL THE PROBLEM.  I HAVE HAD SEVERAL FRIENDS WHO DROVE THE CAR ALSO COMMENT ON THIS PROBLEM. PROBLEM STARTED WHEN I BOUGHT THE CAR AND IS STILL HAPPENING 3 YRS LATER.",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875271,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING AT HIGHWAY SPEEDS (FOR EXAMPLE, USING AN EXIT RAMP) THE STEERING WHEEL BEGAN TO SHAKE.  ALSO EXPERIENCED RHYTHMIC LURCHING WHEN BRAKING AT LOW SPEEDS.  AVERAGE DRIVING CONDITIONS, AND I WOULD SAY I'M A GENTLE DRIVER.  THE DEALER MACHINED THE ROTORS AT ABOUT 24K MILES, WHICH TEMPORARILY RESOLVED THE ISSUE.  NOW AT 38K MILES, THE PROBLEM IS RECURRING.  SOMETHING IN THE BRAKING SYSTEM IS FAULTY.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874412,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM READING FORUMS AND BLOGS ON THIS PARTICULAR ODYSSEY YEAR AND EXPERIENCING FIRST HAND, I'M JUST IN DISBELIEF THAT HONDA WON'T RECALL THIS SITUATION! THE VAN ONLY HAS 21000 MILES ON IT (BOUGHT IT CERTIFIED) AND I'M HOPING THAT WHEN I CALL HONDA THEY'LL DO THE RIGHT THING FOR THIS IS A SAFETY ISSUE IN PLAIN SIGHT! BREAKING WHEN COMING DOWN A STEEP GRADE OF HIGHWAY AND SUDDENLY GETTING A VIOLENT SHAKING ON THE STEERING WHEEL AND FEELING THE TIRES SKIP AND BOUNCE...HOW CAN THAT NOT BE A RECALL ISSUE?! ESPECIALLY HAVING FAMILY IN THE VEHICLE! I'M GOING TO CALL HONDA CUSTOMER SERVICE LINE (LIKE OTHERS HAVE) AND VOICE IT OUT TOO. HOPEFULLY THEY WILL SEE THE IMPORTANCE OF THIS SITUATION AND STAND BY THEIR QUALITY AND NAME. THEY DO HAVE THE BEST VANS, BELIEVE ME I'VE HAD 4DIFFERENT MAKES, BUT TO READ AND EXPERIENCE THE BREAKING ISSUE AND HONDA NOT RECALLING IT...THAT'S NOT RIGHT ESPECIALLY IF FAMILIES LIVES ARE AT HAND! HONDA, PLEASE DO THE RIGHT THING!",
        "vin": "5FNRL5H47DB"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874083,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA ODYSSEY.  CONSUMER WRITES IN REGARDS TO DEALERSHIP REFUSAL TO PROVIDE LOANER VEHICLE UNTIL RECALL REPAIRS ARE COMPLETE, REFUSAL TO REPLACE KEY AND BATTERY.  *SMD  THE CONSUMER STATED THERE WERE SEVERAL RECALLS ON THE VEHICLE. THE DEALER REFUSED TO PROVIDE SERVICE, BECAUSE THE CONSUMER DID NOT HOLD A WASHINGTON STATE LICENSE. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873636,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ~20K MILES, WHILE BRAKING AT HIGHWAY SPEEDS THERE IS A VIOLENT SHAKING IN THE VEHICLE AND STEERING WHEEL.  MOSTLY PREVALENT GOING DOWNHILL WHERE THIS IS EVEN MORE DANGEROUS.",
        "vin": "5FNRL5H9XDB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/23/2016",
        "dateOfIncident": "04/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10870406,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THE VEHICLE ACCELERATED WITHOUT WARNING, THE CONTACT DEPRESSED THE BRAKE PEDAL, BUT THEY FAILED TO STOP THE VEHICLE. THE CONTACT LOST CONTROL AND CRASHED INTO FIVE VEHICLES. THE CONTACT SUSTAINED CHEST AND NECK INJURIES AND NOSE BLEEDING THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A POLICE LOT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 205,000.",
        "vin": "5FNRL18603B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/10/2016",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS WARP AROUND EVERY 12,000 MILES. DEALER STATES BRAKES ARE UNDERSIZED. NOT SURE IF THAT INFORMATION IS CORRECT. STEERING WHEEL SHAKES QUITE A BIT WHEN SLOWING FROM HIGHWAY SPEEDS. DOES NOT SEEM CORRECT OR SAFE.",
        "vin": "5FNRL5H97DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/23/2016",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837781,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 15,000 MILES NOTICED SHAKING/PULSATION WHEN BRAKES ARE APPLIED, WORSE AT HIGHER SPEEDS. NOW, AT 25K, SHAKING IS DANGEROUS.   THE PROBLEM IS PREMATURE WARPING OF FRONT BRAKE ROTORS. HONDA KNOWS OF THIS PROBLEM AND REDESIGNED THE FRONT ROTORS TO A CORRECTED VEIN DESIGN TO DISSIPATE THE HEAT BUILD UP CAUSING PULSATION. CONTACTED TWO HONDA DEALERS FOR CONFIRMATION AND THEY CONFIRMED THERE ARE NEW PART #'S TO SOLVE THIS PROBLEM AND THERE IS NO WARRANTY, EXTENDED OR OTHERWISE.   I WOULD HOPE HONDA AS A RESPONSIBLE MANUFACTURER WOULD WARRANTY THE BRAKE ROTORS AS THIS IS A FAULTY DESIGN AND IS A MAJOR SAFETY CONCERN THUS DECREASING STOPPING DISTANCE AND EMERGENCY STOPPING. THANK YOU.  *TR",
        "vin": "5FNRL5H60DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DISC ROTORS WARPED AT 31,000 MILES AND HAD TO BE RESURFACED (OUT OF WARRANTY). AT 50,000 MILES REPEAT OF THE SAME PROBLEM, NO HARD BRAKING AND OR STOPPING. HIGHWAY DRIVEN MILES, NO STOP AND GO. PREMATURE ROTOR WEAR, A REPEATED COSTLY SAFETY-ISSUE PROBLEM.  OVER 61,000 GOOGLE NOTATIONS OF SIMILAR UNUSUAL ROTOR WEAR PROBLEMS. HONDA NEEDS TO RECOGNIZE THE ISSUE AND COVER REPAIRS AND OR ISSUE REPLACEMENT PART(S) TO CORRECT THE PROBLEM. SPEAKING WITH HONDA CORPORATE CUSTOMER RELATIONS PERSONNEL WAS A VERY UNSATISFYING EXPERIENCE. THEY STATE NO AWARENESS OF ANY ROTOR PROBLEMS AND TAKE NO RESPONSIBILITY/OWNERSHIP OR NEED TO ADDRESS.",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "07/05/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836408,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKE VIOLENTLY WHEN BRAKE IS APPLIED AT SPEED ABOVE 60 MPH.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820248,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS 23,000 MILES AND IS EXACTLY 3 YEARS OLD.  THIS PROBLEM HAS BEEN PRESENT FOR 10,000 MILES AND FOR OVER A YEAR.  WHEN TRAVELING AT HIGHWAY SPEEDS AND THEN DEPRESSING THE BRAKES, FOR EXAMPLE TO SLOW DOWN FOR AN EXIT RAMP, THE STEERING WHEEL VIBRATES VIOLENTLY AND THE BRAKES VIBRATE.  THIS IS NOT THE ANTILOCK BRAKES ACTIVATING BECAUSE IT IS NOT A SHORT STOP -- IT  OCCURS DURING GRADUAL STOPS OR SLOWING DOWN.  HONDA DEALER SAYS THE FRONT BRAKE ROTORS ARE \"WARPED.\"  I HAVE SEEN COUNTLESS COMPLAINTS OF THIS SAME PROBLEM ALL OVER THE INTERNET AND HERE AT THE NHTSA WEBSITE.  HONDA REFUSES TO CORRECT THE PROBLEM UNDER WARRANTY.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790573,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING, STEERING WHEEL RAPIDLY SHAKES/VIBRATES BACK AND FORTH AND FEEL LIKE BRAK IS NOT WORKING AS IT SHOULD BE.   I HAD COMPLAINED THIS TO MY PREVIOUS SERVICE AT DEALER . THEY SAID ROTOR NEEDS TO RESURFACE AND THEY DID . IT LAST ONLY 4 MONTHS AND AGAIN I FEEL LIKE THE SAME PROBLEM.  IT IS 2013 VAN AND RAN ONLY 40K  USED AND DROVE ONLY BY ME .SEARCHES ON INTERNET REVEAL THIS IS AN EXTREMELY COMMON DEFECT ON ODYSSEYS. PEOPLE HAVE COMPLAINED ABOUT ODYSSEY ROTORS WARPING.  BUT STILL HONDA IS NOT SERIOUS ABOUT IT . I THINK HONDA SHOULD TAKE CARE FOR THIS AND CORRECT ALL THE VEHICLE WHICH HAS THE PROBLEM . IT IS VERY SERIOUS SAFELY ISSUE AND SHOULD BE TAKEN CARE SERIOUSLY.",
        "vin": "5FNRL5H60DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2015",
        "dateOfIncident": "09/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776627,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA ODYSSEY 2013 SHOOK ABRUPTLY AS I WAS SLOWING DOWN TO PARK AND SUDDENLY STOPPED RESPONDING TO ANYTHING, STEERING WHEEL GOT LOCKED AND THE VEHICLE STOPPED MOVING.  I CALLED AAA AND MY CAR WAS TOWED  TO THE DEALER AND I LEFTED MY VEHICLE THERE OVER NIGHT.  IN THE MORNING, THE AERVICE MANAGER EXPERIENCED THE SAME SHAKING AND DYING OF THE ENGINE, CALLED ME AND CONFIRMED THAT HE ALSO EXPERIENCED THE SAME PROBLEM THAT I EXPERIENCED THE NIGHT BEFORE.  HOWEVER,  I GOT A CALL IN THE AFTERNOON FROM THE SERVICE MANAGER AND HE EXPLAINED TO ME THAT HIS TECHNICIANS WERE NOT ABLE TO REPLICATE THE PROBLEM.  HE SAID THAT THEY TESTED MY VEHICLE AND FOUND NO PROBLEM.  THEY ARE GOING TO RETURN THE VEHICLE TO ME WITHOUT FINDING OUR OR FIXING THE PROBLEM, AND ARE GOING TO CHARGE ME OVER $100 DOLLARS TO RUN TESTS THAT SHOWED NOTHING.  NOW, THEY ARE GIVIBG ME NO CHOICE BUT TO DRIVE A CAR THAT CAN DIE ON ME IN THE MIDDLE OF FREEWAY OR BUSY STREET.  LIVES CAN BE LOST OR SERIOUS INJURY CAN OCCUR, BUT THEY ARE REFUSING TO DO ANYTHING ABOUT IT.  I CALLED NATIONAL HONDA CUSTOMER SERVICE REPRESENTATIVE, FILED A COMPLAINT ON 9/23, BUT THE REPRESENTATIVE SAID THAT BECAUSE I'M OUT SIDE OF WARRANTY, I'M REPONSIBLE FOR THE DIAGNOSTIC TESTING FEE, AND HE DOESN'T THINK THEY CAN DO ANYTHING ABOUT THE PROBLEM.  HE DID, HOWEVER SENT MY CASE TO A CASE MANAGER.  I'M STILL WAITING TO HEAR FROM HIM/HER.",
        "vin": "5FNRL5H67DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "09/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762561,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GOING DOWNHILL IN THE MOUNTAINS OF COLORADO, THE VAN BEGAN SHAKING EXCESSIVELY AND WOULD NOT RESPOND TO BRAKING AT ABOUT 20,000 MILES.  THE VAN DROVE FINE AT LOWER SPEEDS OR ON FLAT STRETCHES BUT FELT LIKE BRAKING CONTROL WAS LOST AT HIGHER LOADS (FAST SPEED GOING DOWNHILL WITH MULTIPLE PASSENGERS).  TOOK TO LOCAL DEALER WHO SAID ROTORS NEEDED RESURFACING.  THAT LASTED ABOUT 1 YEAR AND THE PROBLEM HAS REOCCURRED.  MULTIPLE OTHERS ARE POSTING THE SAME EXPERIENCE ALL OVER THE US WITH THIS VAN MODEL.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760609,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE ROTORS HAVE WARPED VERY SEVERELY AT LESS THAN 20K MILES OF LIGHT TO NORMAL BRAKE USAGE. WHEN BRAKING FROM HIGHWAY SPEEDS THE STEERING WHEEL SHAKES VERY HARD AND HAS SURPRISED MY WIFE WHO BECAME VERY CONCERNED FOR HER AND OUR THREE CHILDREN'S SAFETY. HONDA DEALERS ALREADY KNOW OF THE SUBSTANDARD BRAKE ROTORS ABILITY TO WARP SO QUICKLY. ALL THEY WANT TO DO IS PUT THEM IN A LATHE AND TURN/ SMOOTH THEM. THIS IS A VERY SHORT TERM FIX AS I HAVE READ OVER AND OVER. YES, THE SHAKING GOES AWAY FOR A SHORT TIME BUT RETURNS QUICKLY, AS THE UNDERLYING CAUSE ( INFERIOR ROTOR) IS NOT ADDRESSED. AS FOR BEING A SAFETY ISSUE I WOULD THINK THAT BRAKE ROTORS AS WELL AS ANY OTHER PARTS OF THE BRAKE SYSTEM SHOULD A BIG CONCERN, WE ARE NOT TALKING ABOUT WEATHER STRIPPING, SEALS OR PAINT QUALITY ETC, THIS IS THE SYSTEM THAT IS USED EVERY TIME WE WANT TO STOP! I ALSO UNDERSTAND THAT BRAKE ROTORS, PADS, BRAKE LINE FLUID ARE WEAR ITEMS, HOWEVER, WE ARE NOT USING THIS VEHICLE ON RACE TRACKS, OR EVEN ABUSING THESE PARTS REGULARLY. I BELIEVE THAT UNDER NORMAL USAGE CONDITIONS WHICH I HAVE OBSERVED IN THE MANY VEHICLES I HAVE OWNED THAT BRAKE ROTORS SHOULD LAST AT A MINIMUM 50K, BEFORE HAVING TO LATHE THEM FOR THE FIRST TIME OR REPLACE THEM IF THEY HAVE BEEN ON A HIGH POWERED PERFORMANCE VEHICLE. LESS THAN 20K MILES OF LIGHT TO NORMAL USE ON A FAMILY MINIVAN IS RIDICULOUS! I ONLY HOPE NO ONE HAS HAD AN ACCIDENT CAUSED BY THE STEERING WHEEL SHAKING SEVERELY AND SURPRISING THE DRIVER CAUSING THEM TO PANIC THINKING A WHEEL HAS OR IS FALLING OFF WHILE TRYING TO COME TO A STOP.",
        "vin": "5FNRL5H96DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760435,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING, STEERING WHEEL RAPIDLY SHAKES/VIBRATES BACK AND FORTH.  DEALER SAYS THE CAUSE IS WARPED ROTORS.  SEARCHES ON INTERNET REVEAL THIS IS AN EXTREMELY COMMON DEFECT ON ODYSSEYS FOR MANY YEARS.  PEOPLE HAVE COMPLAINED ABOUT ODYSSEY ROTORS WARPING AT VERY LOW MILEAGE (SOME AS LOW AS 10,000 MILES) FOR MANY YEARS; YET HONDA WILL NOT FIX THE PROBLEM.  HONDA'S ONLY SOLUTION TO CUSTOMER IS TO RESURFACE OR REPLACE ROTORS - AT CUSTOMER'S EXPENSE.",
        "vin": "5FNRL5H95DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "08/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759971,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THIS VEHICLE BRAND NEW - SINGLE OWNER CAR EQUIPED WITH GENUINE HONDA PARTS.  THE FRONT ROTORS QUICKLY AND PREMATURELY WARE DOWN CAUSING SEVERE BRAKING AND STEERING ISSUES, MAINLY HARD VIBRATIONS OF THE STEERING WHEEL AND IT FEELS LIKE THE WHOLE CAR SHAKES AND YOU COULD EASILY LOSE CONTROL IF NOT HAVING BOTH HANDS ON THE STEERING WHEEL.  THE PROBLEM USUALLY OCCURS OR IS MOST NOTICEABLE DURING LONGER ROAD TRIPS (AFTER ~120 MILES) ONCE THE ROTORS ARE HOT AND THE DEGREE OF THE PROBLEM IS DEFINITELY WORSE AS YOU DRIVE DOWN (DECLINE) OR UP (INCLINE) AND IT DOES NOT SUBSIDE RATHER GETS WORSE IF PRESSURE IS APPLIED TO BRAKES GOING DOWN HILL.  ROTORS SHOULD LAST MUCH LONGER THAN 16K MILES.  WE ARE CAUTIOUS, SAFE DRIVERS AND HAVE NOT PUT A LOT OF MILES ON THIS CAR AND DRIVE MOSTLY HIGHWAY AND INTERSTATE ROADS.  THE DEALER TEMPORARILY FIXED THE PROBLEM BY ROTATING/SANDING DOWN THE ROTORS AT 15,823 MILES BUT NOW WITH ONLY 31, 287 MILES ON IT, THE PROBLEM HAS RESURFACED WITH THE VIBRATIONS SLOWING GETTING MORE FREQUENT AND STRONGER TO THE POINT THE WHOLE STEERING WHEEL COLUMN SHAKES.  IT IS VERY SCARY AS THE VAN \"THUMPS THUMPS THUMPS\" AND THE STEERING WHEEL SHAKES RAPIDLY GOING DOWN INCLINES AND/OR WHILST BRAKING.  NOW THE DEALER IS SAYING THE ROTORS SHOULDN'T BE ROTATED AGAIN AND ARE NO GOOD, AT ONLY 31K MILES, AND NEED REPLACED.",
        "vin": "5FNRL5H93DB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTIPROCONTACT",
                "productYear": "9999",
                "size": "225/45R17 91H",
                "type": "Tire"
            }
        ],
        "summary": "3 CONTINENTAL CONTIPROCONTACT TIRE FAILURES AND 1 ABOUT TO FAIL SHOWING A CRACK IN THE SIDEWALL. ALL 4 WERE ORIGINAL EQUIPMENT ON THE CAR. FIRST FAILURE WAS AT 7 MONTHS AND 3,463 MILES. SECOND WAS AT 23 MONTHS AND 15,097 MILES. THIRD AT 24 MONTHS AND 16108 MILES (BLOW OUT @ 60 MPH). FOURTH DISCOVERED WHEN REPLACING THIRD ONE.",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 15000 MILES MY STEERING WHEEL WAS VIBRATING VIOLENTLY WHEN BRAKING.  I BROUGHT IT TO THE HONDA DEALERSHIP AND THEY STATED THAT THE ROTORS WERE WARPED. I WAS ALSO TOLD BY THE SERVICE ADVISOR THAT THE ODYSSEYS AND PILOTS WERE HAVING THIS PROBLEM. I ASKED HIM TO REPLACE THE ROTORS AND HE STATED THAT THE REPLACEMENT WAS THE SAME TYPE OF ROTOR.  HE MACHINED THE ROTORS WITHOUT CHARGING ME AND THE BRAKING PROBLEM WAS SOLVED TEMPORARILY.  IN ABOUT 20000 MILES, THE PROBLEM STARTED AGAIN.  I WAITED UNTIL ABOUT 46000 MILES, WHEN I HAD AN OIL CHANGE DUE, TO NOTIFY THE DEALER AND THEY REFUSED TO STAND BEHIND THE ISSUE. I BELIEVE THIS ROTOR PROBLEM IS KNOWN BY HONDA AND POTENTIALLY VERY DANGEROUS TO CONSUMERS ESPECIALLY WHILE DRIVING AT HIGHER SPEEDS.",
        "vin": "5FNRL5H98DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2015",
        "dateOfIncident": "06/04/2015",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747288,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST COMPLETED A TRIP TO GREENVILLE, SC AND PULLED INTO MY DRIVE.  I HAD TAKEN A LOAD OF ITEMS INTO MY HOUSE WHEN I CAME BACK OUT AN NOTICE SMOKE COMING FROM UNDER THE HOOD.  I UNLATCHED THE HOOD TO CHECK ON THE SMOKE WHEN FLAMES STARTED COMING OUT OF FROM UNDER THE HOOD.  I START SPRAYING WATER UNDER THE HOOD AS I CALL OUR SECURITY WHICH CALL OUR LOCAL FIRE DEPARTMENT.  OUR SECURITY CAN AND ASSISTED ME TRYING TO EXTINGUISH THE FIRE UNTIL THE FIRE DEPARTMENT CAN AND FINISHED EXTINGUISHING THE FIRE.  THE 2013 HONDA WAS DETERMINED TO BE A TOTAL LOSS BY USAA.  THE FIRE DEPARTMENT STATED IT WAS AN ELECTRICAL/MECHANICAL PROBLEM THAT CAUSED THE FIRE.  I CONTACTED HENDRICKS HONDA DEALERSHIP IN GREER, SC ABOUT THE FIRE WHERE THEY COULD INVESTIGATE FOR WARRANTY CLAIM/DEFECT.  THEY DID NOT DO ANYTHING,  THEY HAVE IGNORED MY REQUEST NOR HAS HONDA AUTOMOTIVE OF AMERICA ACCEPTED OR INVESTIGATED.",
        "vin": "5FNRL5H65DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731748,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN IS TWO YEARS OLD AND HAVE HAD ROTORS TURNED TWICE AND NOW THEY NEED   REPLACED. HAVE HAD MANY CARS AND I HAVE ALWAYS HAD PROBLEMS WITH HONDA   ROTORS AND NEVER ON ANY OTHER MAKE WE HAVE OWED. THEY SHAKE SO BAD IT SCARES ME.",
        "vin": "5FNRL5H63DB"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "06/10/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724457,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE REDUCING SPEED WITH BRAKE, STEERING SHAKING BADLY. IT HAPPENS ESPECIALLY WHEN REDUCING SPEED BY BRAKING FROM HIGHWAY SPEED LIKE 5,60MPH OR HIGHER. THIS FEELS ME DANGEROUS ESPECIALLY BRAKING WHILE NOT IN STRAIGHT ROAD. ESPECIALLY SUDDENLY REACHING TO THE END OF TRAFFIC JAM IN CURVED ROAD, HARD TO CONTROL DRIVING ALONG THE CURVE WITH SUCH STEERING SHAKING. THIS SHAKE IS THAT MUCH BAD. I RESEARCHED ONLINE AND MANY PEOPLE CLAIMING ABOUT THIS ISSUE OF THIS MAKE OF THIS MODEL BUT HOW THE DEALER DEAL WITH THIS ISSUE IS DIFFERENT DEPENDS ON DEALER.",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END BEGAN TO SHAKE ON BRAKING, MORE NOTICEABLE AT HIGHER SPEEDS AND GOING DOWNHILL, VERY DANGEROUS CONDITION,  DEALER SAID IT WAS WARPED  BRAKE ROTORS AND THE ALIGNMENT WAS OFF,  ROTORS WERE GROUND CAR WAS ALIGNED TO FIX PROBLEM EVEN THOUGH IT WAS ALMOST NEW AND ONE OF THE MORE EXPENSIVE MODELS,  AFTER 12000 MORE MILES THE SAME PROBLEMS HAVE REOCCURRED , AGAIN NO SYMPATHY FROM THE DEALER, HE BLAMED IT ON NORMAL WEAR AND POTHOLES.",
        "vin": "5FNRL5H98DB"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "05/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10722096,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PLACED THE VAN IN PARK AND LEFT IT RUNNING AT THE TOP OF A DRIVEWAY WALKED ABOUT 40-60FT AND ABOUT 3 MINUTES LATER IT COMES ROLLING DOWN THE DRIVEWAY AND HITS THE CORNER OF HOUSE AND ME. BOUNCES BACK 23 FEET AND STOPS.  GEAR SHIFT IS STILL IN PARK AND CAR IS RUNNING.  AIR BAG INFLATES AND ALARM GOES OFF.  TURNED OFF ENGINE AND REMOVED KEY.",
        "vin": "5FNRL5H6XDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721216,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES AT HIGH SPEED, ESPECIALLY GOING DOWNHILL, ARE VERY ROUGH AND CAUSE VIBRATION/SHIMMY IN THE STEERING WHEEL. I WAS TOLD BY THE DEALER THAT WARPED ROTORS ARE A COMMON ISSUE WITH HONDA ODYSSEY VEHICLES. HONDA NEEDS TO ADDRESS THIS ISSUE.",
        "vin": "5FNRL5H46DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "07/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715635,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST SERVICE SINCE NEW (7500 MI)OIL, TIRE ROTATION. IMMEDIATELY NOTICED SHIMMY UPON BRAKING.  RETURNED TO DEALER AFTER 2 MONTHS.  DIAGNOSIS: WARPED ROTORS.  TURNED.  PROBLEM SOLVED.  QUESTIONED AS TO WHY, THEY STATED WATER PUDDLE, AGRESSIVE DRIVING, ETC.  NO MENTION OF A PROBLEM WITH THE ROTOR HEAT DISSIPATION.  ALL WAS FINE UNTIL RECENTLY,  ABOUT 30,00 MI.  NOW SAME PROBLEM.  SHOULD THIS PROBLEM WORSTEN, AND IT WILL, CONTROLING A VEHICLE ON A LONG MOUNTAIN HILL WILL BE DISASTROUS.  THIS IS A KNOWN PROBLEM DOCUMENTED BY NUMEROUS PEOPLE ON FORUMS ON THE INTERNET, AS FAR BACK TO AT LEAST 2006.  WHY HASN'T THIS DEFECT BEEN ADDRESSED.  I'M CALLING HONDA AMERICA TODAY, AS IF IT WILL DO ANY GOOD.  I HAVE ONE HONDA CIVIC IN MY DRIVEWAY NOW THAT HAS 136,000 MI. ON  IT AND THE PADS HAVE NEVER BEEN REPLACED.  DEALER SAID PADS ARE GOOD.  136,000 MILES. MUCH LESS THE BRAKE ROTORS.  NO I'M NOT HARD ON THE BRAKES AS THE DEALER INSINUATED.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2015",
        "dateOfIncident": "04/27/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED SIX HONDA ODYSSEY'S AND THE LAST THREE STARTING WITH THE 2007 MODEL ALL NEEDED TO HAVE A NEW POWER STEERING PUMP BECAUSE IT STARTS TO WHINE AND NOT PUMP WELL. PREVIOUS MODELS HAVE ALL FAILED UNDER WARRANTY. I CURRENTLY HAVE A 2013 ODYSSEY THAT HAS 41000 MILES ON IT AND ONCE AGAIN THE PUMP STARTED E STEERING HAS GIVEN OUT TWICE IN THE LAST WEEK. IT IS RANDOM AND WITHOUT WARNING ALL OF A SUDDEN I CAN'T STEER WITHOUT GREAT EFFORT. I ABOUT GOT HIT THE FIRST TIME AS I WAS TURNING AROUND ON A MAIN ROAD AND THE STEERING JUST QUIT, NO POWER STEER AT ALL. IT USUALLY RECOVERS QUICKLY BUT IF I WERE NOT AN EXPERIENCED DRIVER I WOULD HAVE BEEN IN TWO ACCIDENTS BECAUSE OF THIS PROBLEM ALREADY. HONDA WILL NOT REPLACE THEIR KNOWN DEFECTIVE PUMP UNDER WARRANTY BECAUSE THE CAR HAS OVER 36K MILES. I THINK HONDA SHOULD REPLACE THE DEFECTIVE PUMP UNDER WARRANTY AS THIS IS NOT A NEW ISSUE FOR THEM AND I PERSONALLY HAVE HAD TWO OF THESE VEHICLES SINCE 2007 THAT HAVE HAD A BAD PUMP. THIS IS A SERIOUS SAFETY ISSUE AND PERHAPS HONDA NEEDS SOME GOVERNMENT HELP TO BE FORCED TO DEAL WITH THIS ISSUE THAT CONTINUES TO PLAGUE THEIR VEHICLES WITH A DANGEROUS SITUATION THAT NEEDS CORPORATE ACTION TO REMEDY.  *TR",
        "vin": "5FNRL5H6XDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/30/2015",
        "dateOfIncident": "03/29/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702491,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA ODYSSEY 2013 TOURING WITH 22K MILEAGE BRAKES WARPED. HEAVY VIBRATION UNSAFE WHEN BRAKING AT HIGH SPEEDS 60+ MPH. VIBRATION WHEN BRAKING AT LOWER SPEEDS. VEHICLE IS STILL NEW UNDER B2B 36/3 WARRANTY. LARGE NUMBER OF OTHER CONSUMERS COMPLAINING ABOUT THE SAME ISSUE. HONDA APPEARS TO HAVE A BRAKE DESIGN FLAW. SUBMITTING COMPLAINT IN ORDER TO SUPPORT HONDA RECALL ON BRAKE ISSUES. VIBRATION STARTED AROUND 10K MILES HAS PROGRESSIVELY GOTTEN WORSE. VERY UNSAFE VIBRATION AT HIGHWAY SPEEDS. THIS IS A TRUE SAFETY ISSUE AND SHOULD BE LOOKED INTO BY THE NHTSA DOT.     HTTP://WWW.ODYCLUB.COM/FORUMS/54-2011-ODYSSEY/150734-DOES-ANYBODY-HAVE-ISSUES-FRONT-BRAKE-ROTORS-6.HTML.  *TR",
        "vin": "5FNRL5H94DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM THAT I AM REPORTING IS THAT TWO OF MY KEYS RECENTLY SPONTANEOUSLY DEPROGRAMMED THEMSELVES. FORTUNATELY NEITHER KEY WAS RUNNING MY IGNITION AT THE TIME OF FAILURE.  I TOOK MY KEYS TO MY LOCAL SERVICE DEPARTMENT AND HAD THEM REPROGRAMMED.  TO BE CLEAR:  THIS WAS NOT THE RESULT OF A BATTERY FAILURE, AS THE PROBLEM PERSISTED EVEN AFTER BATTERY REPLACEMENTS. I ASKED MY DEALERSHIP'S SERVICE DEPARTMENT FOR AN EXPLANATION OF THIS INCIDENT AND RECEIVED NONE WHATSOEVER.  I THEN CONTACTED AMERICAN HONDA AND STILL RECEIVED NO EXPLANATION.      TO BE CLEAR:  ONE OF THE KEYS THUS AFFECTED, A MASTER KEY, HAD ALWAYS BEEN STORED IN A LINGERIE DRESSER DRAWER, AND I MENTION \"LINGERIE\" TO MAKE IT CLEAR THAT NO MAGNETS OR OTHER POTENTIALLY DAMAGING ITEMS WERE STORED WITH OR NEAR THE KEY, AND THAT IT WAS IN A CLEAN, DRY PLACE. THE KEY HAD NEVER BEEN USED EXCEPT WHEN I TESTED IT RIGHT AFTER RECEIVING IT FROM THE DEALERSHIP.  (I ONLY FIGURED OUT THAT IT WASN'T WORKING WHEN I MISPLACED THE KEY THAT I USUALLY USED AND NEEDED A TEMPORARY REPLACEMENT.)  THE OTHER KEY AFFECTED, MY VALET KEY, WAS ALWAYS WITH ME ON MY KEYCHAIN.  IT STRIKES ME AS VERY IMPROBABLE, IN THE GRAND SCHEME OF THINGS, THAT TWO SUCH DIFFERENT KEYS SHOULD ARBITRARILY FAIL UNDER SUCH DIFFERENT CIRCUMSTANCES. WHAT ARE THE ODDS?    WHAT CONCERNS ME IS THIS:  WHEN THE KEYS FAIL, THEY IMMOBILIZE THE ENGINE.  I REQUESTED THAT AMERICAN HONDA AT LEAST ADMINISTER A QUESTIONNAIRE TO DEALERSHIPS TO DETERMINE WHETHER THEIR SERVICE DEPARTMENTS ARE SEEING THIS HAPPEN TO OTHER HONDA OWNERS, BUT AS FAR AS I CAN TELL THIS INCIDENT IS BEING SUMMARILY DISMISSED.  GIVEN THE TRAGEDIES THAT OCCURRED WHEN GM IGNITIONS TURNED OFF UNEXPECTEDLY DURING TRAVEL, RELYING ON A KEY THAT CAN IMMOBILIZE MY IGNITION AT WILL IS UNSETTLING, TO SAY THE LEAST.  I WOULD DEEPLY APPRECIATE IT IF SOMEONE COULD LOOK INTO THIS INCIDENT.  *TR",
        "vin": "5FNRL5H28DB"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682162,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING - OUR TRACTION CONTROL AND ENGINE LIGHT HAS COME ON SEVERAL TIMES AND THE ENGINE HAS BEEN SO ROUGH THAT WE HAD TO STOP AND LET IT COOL DOWN BEFORE TAKING IT IMMEDIATELY HOME.  THE FIRST TIME WE TOOK IT IN - WE WERE TOLD THAT \"SOMETHING\" (DIRT) MAY HAVE GOTTEN INTO THE PISTON CHAMBER AND CAUSED A MISFIRE OF THE SPARK PLUGS, BUT THAT WE SHOULD BE OK.  THEN IT HAPPENED AGAIN AND AGAIN, BUT BECOMING MORE FREQUENT BETWEEN RESETTING THE CODES. WE WERE TOLD JUST TO REPLACE SPARK PLUGS 1 & 2.  THEN AS WE WERE HAGGLING WITH HONDA OVER THE PHONE ABOUT WARRANTY COVERAGE AND THE FACT THAT THE LIGHT WAS CONTINUING TO COME ON - IT HAPPENED AGAIN BUT WORSE: THE ENGINE LIGHT WAS FLASHING AND IT WAS SOUNDING WORSE, SO WE DID NOT DRIVE IT UNTIL WE COULD GET IT SERVICED.  WHEN IN THE SHOP THIS TIME - WE WERE TOLD AFTER THE DIAGNOSTIC THAT THE VAN NEEDED A NEW SHORT BLOCK DUE TO FAULTY PISTONS/PISTON RINGS AND IT WAS COVERED UNDER A RECALL/WARRANTY.  THEN, AFTER WE LEFT THE VEHICLE AT THE DEALER FOR A WEEK WAITING FOR THEM TO GET THE PARTS AND FIX IT - WE CALLED TO PICK IT UP.  BUT THIS TIME - THEY SAID WE WERE NOT COVERED, AND ALL THEY WOULD DO IS REPLACE THE SPARK PLUGS 1 THROUGH 4 - UNDER WARRANTY.   *TR",
        "vin": "5FNRL5H43DB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "12/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680796,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, THE PASSENGER SIDE AIRBAGS DEPLOYED INADVERTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER, WHERE IT WAS DIAGNOSED THAT THE AIR BAG MAY HAVE DEPLOYED DUE TO A PREVIOUS CRASH THE VEHICLE WAS INVOLVED IN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 12,060.",
        "vin": "5FNRL5H6XDB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668124,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 1 HR OF HIGHWAY DRIVING TO WARM UP THE ENGINE,  SMELLING GASOLINE VAPORS AROUND ENGINE BAY, MIDDLE OF CAR ( UNDERCARRIAGE ) AND VAPORS GETTING INTO CABIN.  WHEN YOU POP A HOOD, THE GAS VAPORS REALLY GO INTO YOUR FACE.   THE OIL ON DIPSTICK SMELLS LIKE GAS ( AS OPPOSED TO OIL ).  I CALLED HONDA AND CREATED A CASE AND TOOK IT TO DEALERSHIP WHICH REPRODUCED A PROBLEM.  DEALER COULD SMELL GAS FROM HOOD VENTS WHEN CAR WAS STATIONARY AS WELL AS ON TESTDRIVE. AT THIS POINT DEALERSHIP IS WAITING FOR ADVISE FROM HONDA.  P.S.THE GAS IS NOT DRIPPING, SO DIAGNOSIS IS HARD BUT RISK OF FIRE IS REAL.",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "10/28/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKING AT  FREEWAY SPEEDS CAUSED A SIGNIFICANT VIBRATION IN THE STEERING WHEEL. BRAKE ROTORS REQUIRED RESURFACING. I STATED TO THE HONDA DEALER THAT I HAVE OWNED A 2002 AND 2008 ODYSSEY AND HAVE ESSENTIALLY DRIVEN EACH THE SAME WAY, SO WHAT IS WRONG WITH THE 2013. HE TOLD ME THE 2011,2012 AND 2013 PILOTS AND ODYSSEYS HAVE SHOWN THIS TENDENCY. IT WAS REPAIRED UNDER WARRANTY, BUT WITH SUCH AN EARLY FAILURE, IT WOULD SEEM LIKELY TO HAPPEN AGAIN. A RECALL SHOULD  BE CONSIDERED IN THE INTERESTS OF HIGHWAY SAFETY. *JS",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660226,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS SECOND OCCURRENCE, AS WE STARTED TO DRIVE FROM PARK POSITION, THE CAR WAS RUNNING ROUGH AND THE CHECK ENGINE LIGHT AND TRACTION LIGHT CAME ON.  THE DEALER DIAGNOSED IT IS THE PISTON RINGS, CAUSED BY BAD RINGS THAT LET THE SPARK PLUGS GET FOULED.  THIS APPEARS TO BE THE SAME ISSUE AS RECALL # 13V382000 WHERE THEY CHANGED THE SHORT BLOCK.  THEY WANT TO FIX THE PISTON RINGS AND LEAVE IT AT THAT.  THAT IS NOT PROPER MECHANICAL  PROCEDURE.  *TR",
        "vin": "5FNRL5H49DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660033,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-15 IN RURAL SOUTHERN UTAH (WHICH HAS A HIGH SPEED LIMIT), ON CRUISE CONTROL, AND SUDDENLY LOST ALL POWER. THE VAN CONTINUED TO COAST (NO LOCK UP OF GEARS OR ANYTHING) AND I IMMEDIATELY WENT TO THE SIDE OF THE ROAD WHERE I TURNED OFF THE IGNITION (WHICH WAS STILL ON) AND THEN TURNED IT BACK ON. THE VAN STARTED UP WITHOUT PROBLEMS AND I HAVEN'T HAD A PROBLEM SINCE.  *TR",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653097,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS NEEDED TO BE RESURFACED AFTER 20,000 MILES AND ONLY 16 MONTHS.  *TR",
        "vin": "5FNRL5H97DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "10/24/2014",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650340,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2013 HONDA ODYSSEY WITH 22,000 MILES WAS PARKED IN OUR DRIVEWAY FOR 2 DAYS AND SPONTANEOUSLY COMBUSTED.  THE VEHICLE IS A TOTAL LOSS AND THE FIRE DAMAGES OUR POP-UP CAMPER AND THE SIDING ON OUR HOME.  *TR",
        "vin": "5FNRL5H61DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "08/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS VEHICLE WAS TRAVELING ON INTERSTATE, OCCUPANTS HEARD A SUDDEN, LOUD NOISE FROM ROOF OF CAR.  NO FLYING DEBRIS WAS NOTED, NO OTHER VEHICLES NEARBY, NO TREES, ETC. IN VICINITY. AS SOON AS WAS SAFE, WE EXITED INTERSTATE AND OPENED SUNROOF COVER TO FIND THAT THE GLASS HAD COMPLETELY SHATTERED, AND THERE WAS ACTUALLY A LARGE SECTION IN THE VERY CENTER THAT WAS GONE.  THE VEHICLE HAD BEEN PARKED IN AN ENCLOSED PARKING GARAGE ALL WEEKEND (48 HOURS) IN EXTREME HEAT. THE LOCAL DEALER WILL NOT WORK WITH ME THROUGH MY WARRANTY, AND I AM HAVING A HARD TIME FINDING A LOCAL AUTO GLASS DEALER WHO CAN EVEN ORDER THE REPLACEMENT GLASS, EXCEPT THROUGH THE DEALER. I HAVE CONTACTED THE CORPORATE OFFICE FOR HONDA BUT HAVE YET TO HEAR BACK FROM THEM.  EVERYONE I HAVE SPOKEN TO (GLASS REPAIR FOLKS) STATES THAT IT ALMOST HAS TO BE  DUE TO ABNORMAL STRESS ON THE GLASS AND SHOULD BE COVERED  BY WARRANTY ON A 1-YEAR OLD VEHICLE.  *TR",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630266,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING THROUGH STEERING WHEEL WHEN BRAKING FROM HIGH SPEED (50 TO 70 MPH).  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/31/2014",
        "dateOfIncident": "07/04/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629714,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 2013 EX-L.  WHEN MILEAGE WAS AROUND 18K, CAR STARTED VIBRATION WHEN BRAKING BETWEEN 45 TO 75 MILES PER HOUR.  DEALER TOLD ME IT HAPPENED BECAUSE OF MY DRIVING HABIT..WOW..SO FUNNY...  I HAVE 3 MORE CARS..BUT ONLY THIS HONDA ODYSSEY HAS PROBLEM...  ALSO I FOUND LOTS OF 2013 ODYSSEY OWNERS HAS SAME BREAK PROBLEM ON THE INTERNET..  HONDA SHOULD RECALL THIS PROBLEM.   *TR",
        "vin": "5FNRL5H63DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2014",
        "dateOfIncident": "04/07/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629633,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HONDA ODYSSEY BOUGHT NEW IN APRIL 2013 FROM HONDA OF PASADENA (CA).  AT APPROXIMATELY ONE YEAR OF AGE AND 12,000 MILES I EXPERIENCE A (SOMEWHAT VIOLENT) 'SHIMMY' IN THE STEERING WHEEL WHEN BRAKING AT FREEWAY SPEEDS.  SPECIFICALLY, WHEN REQUIRED TO BRAKE QUICKLY FROM 70/75 MPH TO 50/55 MPH.    AT JUST OVER 15,000 AND HAVING COME OFF A LENGTHY ROAD TRIP WHERE PROBLEM BEGAN TO REALLY SCARE US, WE TOOK THE VAN TO THE DEALER.  THEY ROAD TESTED IT AND GOT IT ON THE RACK AND SAID THE ROTORS WERE WARPED AND NEEDED TO BE RESURFACED ($223 VS. NEW OF ABOUT $600).    I ASKED THE SERVICE WRITER ABOUT THE NEED FOR RESURFACING ROTORS AT SUCH LOW MILEAGE (BRAKES PADS OVER 9MM THICK).  I WAS TOLD THAT IT'S COMMON IN ODYSSEYS!!  THE REPAIR IS NOT COVERED UNDER WARRANTY (NO BRAKE OR TIRE ISSUES ARE COVERED BY MFG WARRANTY).  AFTER READING NUMEROUS WEBSITES ABOUT THE ISSUE, I AM VERY CONCERNED THAT I WILL HAVE A RECURRING PROBLEM.  HONDA HAS ISSUED RECALLS IN OLDER MODEL ODYSSEY'S (2006-2010).  WHEN WILL THEY FIX THIS SAFETY ISSUE?  *TR",
        "vin": "5FNRL5H65DB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621763,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECOND ROW SEATS ARE NOT LOCKING IN PLACE.  AS A RESULT, THE SEAT SLIDES BACK AND FORTH.  IF THERE IS A PERSON IN THE SEAT, IT IS A VERY DANGEROUS SITUATION, AS MY PASSENGERS HAVE HIT THEIR LEGS ON THE SEAT IN FRONT OF THEM GOING AT A VERY SLOW SPEED.  TO LOCK THE SEAT, YOU MUST FORCE THE BAR BELOW THE SEAT DOWNWARD, WHICH WILL THEN ALLOW THE SEAT TO WORK AS IT SHOULD.  I NOTICE THE PROBLEM HAPPENING AFTER SOMEONE HAS ACCESSED THE THIRD ROW BY USING THE LEVER ON THE SIDE OF THE SECOND ROW SEAT TO LEAN THE SEAT FORWARD AND LET IT SLIDE TOWARDS THE FRONT. WHEN THE SEAT BACK OF THE SECOND ROW SEAT IS RETURNED TO ITS UPRIGHT POSITION, THE SEAT DOESN'T LOCK IN PLACE, RESULTING IN IT SLIDING BACK AND FORTH AS THE CAR MOVES.  *TR",
        "vin": "5FNRL5H68DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619006,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 EX-L WITH 18K MILES, STARTED NOTICING SLIGHT VIBRATION WHEN BRAKING FROM APPROX 50 MPH IN THE STEERING WHEEL. I LIVE IN FLORIDA AND THOUGHT NOTHING OF IT MORE THAN AN ANNOYANCE. THIS PAST 4TH OF JULY WENT TO NC WHEN DRIVING ABOUT 45 MPH WHILE GOING DOWN A HILL AND APPLYING BRAKES THE VIBRATION BECAME TERRIBLE, THE VIBRATION BECAME A SAFETY ISSUE AS THE WHOLE VAN WOULD RATTLE AND SHAKE. TOOK NOTICE OF THIS AND VIDEOED THE OCCURRENCE. WHEN I GOT BACK TO MY CITY TOOK THE VAN TO HONDA AND SHOWED THE MASTER TECHNICIAN MY ISSUE, STATED THAT IT COULD BE WARPED DISKS, AND QUITE COMMON ON ODYSSEYS AND PILOTS. HE DID STATE HE HAD NOT SEEN THE VIBRATION AS HIGH AS ON THE VIDEO, AGAIN I GIVE CREDIT TO THE FLATNESS OF THE FLORIDA PENINSULA. HONDA RESURFACED THE FRONT DISKS AT NO COST, BUT SAID THAT USUALLY THEY DO NOT AS THE BRAKING WARRANTY IS 12 MONTHS OR 12K MILES. I DID CALL AND RAISE A TICKET W/ HONDA OF AMERICA, LETTING THEM KNOW ALL THAT HAD OCCURRED AND OFFERED THEM THE VIDEO AS WELL, ALSO DISCUSSED WITH THE HONDA REP. THAT WARPED DISKS AT LESS THAN 20K MILES SHOULD BE A DESIGN FLAW, AND THAT MAYBE IF ENOUGH PEOPLE COMPLAIN SOMETHING MAY BE DONE. CURRENTLY MY VAN IS RUNNING WELL, BUT WONDERING IF IN 20K MILES I HAVE TO RESURFACE THE DISKS AGAIN OR BUY HIGH PERFORMANCE DISKS TO AVOID THIS.. AGAIN FOR A CAR OVER A NEW STREET VALUE OF $40K I BELIEVE CERTAIN WEAR AND TEAR PARTS SHOULD BE DESIGNED TO LAST AT LEAST MORE THAN 25K OR AT LEAST TWO YEARS OF USE.. JUST MY TWO CENTS.. HOPE THIS HELPS OTHERS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/21/2014",
        "dateOfIncident": "11/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT THE BRAKES FAILED TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THERE WAS AN AIR POCKET IN THE BRAKE SYSTEM. AS A RESULT, THE BRAKE LINE HAD TO BE DRAINED AND REFILLED IN ORDER TO REPAIR THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000 AND THE CURRENT MILEAGE WAS 18,000.",
        "vin": "5FNRL5H47DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610530,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AT 55 MPH WHEN THE ACCELERATOR STOPPED WORKING AND VEHICLE CAME TO A COMPLETE STOP WITHOUT BRAKING. ENGINE WAS STILL RUNNING BUT THERE WAS NO ACCELERATION POSSIBLE. SHUT ENGINE OFF AND RESTARTED. HELD ACCELERATOR PEDAL ALL THE WAY TO THE FLOOR WITH NO ACCELERATION FOR 10-15 SECONDS. THEN, ALL OF A SUDDEN, THE VAN LUNGED FORWARD. HAD VAN TOWED TO DEALERSHIP AND THE MECHANIC TRIED TO DRIVE INTO GARAGE TO CHECK WITH COMPUTER. HE PRESSED THE ACCELERATOR TO THE FLOOR AND NO RESPONSE UNTIL, AGAIN, IT LUNGED FORWARD. DEALERSHIP HAS HAD THE VAN FOR ALMOST 3 WEEKS AND CAN NOT REPLICATE THE PROBLEM WHILE HOOKED UP TO THE COMPUTER.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609984,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEATBELTS' MECHANISM THAT REQUIRES THE SEATBELT TO BE FULLY RETRACTED BEFORE IT CAN BE PULLED OUT AGAIN IS ULTRA SENSITIVE. ALMOST EVERY OTHER TIME MY CHILDREN ATTEMPT TO BUCKLE THE SEATBELT, THIS MECHANISM IS ACTIVATED AND I HAVE TO PULL THE BELT OUT OF THE BOOSTER SEAT, REMOVE THE BOOSTER, ALLOW THE BELT TO FULLY RETRACT THEN REINSTALL THE BOOSTER AND THEN ATTEMPT TO BUCKLE. BEYOND A TOTAL ANNOYANCE, I NEVER IMAGINED THIS PROBLEM WOULD ENDANGER MY CHILDREN.  ON JULY 10TH, MY SON ATTEMPTED TO BUCKLE HIS SEATBELT, BUT BECAME ENTRAPPED WHEN THE SEATBELT MECHANISM ENGAGED AND CONTINUED TO TIGHTEN AROUND HIS 40 LB BODY TRAPPING HIM IN HIS BOOSTER. I HAVE A PHOTO FOR REVIEW. IT WAS SO TIGHT WE ALMOST HAD TO CUT THE SEATBELT TO FREE HIM. WE WERE BARELY ABLE TO SLIDE HIM UNDER. THERE IS NO MANUAL RELEASE MECHANISM. THE BELT MUST BE FULLY RETRACTED TO RELEASE IT. THIS IS ALARMING AND DANGEROUS, ESPECIALLY IN CONJUNCTION WITH BOOSTER SEAT USE. THE BOOSTER SEAT PREVENTS THE SEAT BELT FROM FULLY RETRACTING. PLEASE CONTACT ME FOR THE PHOTO.  *TR",
        "vin": "5FNRL5H61CB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599131,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN SHAKING WHEN BRAKING AT AROUND 20,000 MILES.  AT AROUND 30,000 MILES, DEALER AGREED TO TURN ROTORS THIS ONE TIME ONLY.  PROBLEM RETURNED AROUND 40,000 MILES.  *TR",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599133,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPEATED PROBLEMS WITH CAR SHAKING WHEN BRAKING, ROTORS & PADS HAD TO BE REPLACED AT 40,500 MILES.  HAD SIMILAR ROTOR PROBLEMS YEARS AGO WITH AND ACCORD AND A HONDA STATION WAGON.  NEVER HAD PROBLEM WITH CHRYSLER TOWN & COUNTRY THAT I DROVE FOR 167,000 MILES.  HUSBAND HAS NEVER HAD THIS PROBLEM WITH SEVERAL TOYOTAS DRIVEN TO HIGH MILEAGES.  HONDA HAS A SERIOUS PROBLEM WITH ROTORS.  I LOVE THE ODYSSEY, BUT WON'T BUY ANOTHER HONDA FOR THIS REASON!  *TR",
        "vin": "5FNRL5H69DB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/05/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596357,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBING NOISE ON THE RIGHT REAR SIDE WHENEVER MAKING A RIGHT TURN.  *TR",
        "vin": "5FNRL5H43DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "04/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593622,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS JUST 1 YR OLD, AND HAS A LITTLE OVER 12000 MILES. WHEN I DRIVE AT 50MPH OR HIGH AND APPLY BRAKES STEERING SHAKES SERIOUSLY. THE DEALER SAID THE ROTORS NEED RESURFACING, AND IT WAS COVERED UNDER WARRANTY. 15 DAYS AFTER THEY DID IT, THE SAME PROBLEM STARTED AGAIN, AND THE DEALER SAYS IT NEEDS RESURFACING AGAIN.  I FEEL THE QUALITY OF THE ROTORS NEEDS BE CHECKED AS IT IS FAIRLY NEW CAR, WITH A FEW MILES ON IT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED AND SPUTTERED. THE ENGINE LIGHT CAME ON AND WE WENT TO THE DEALERSHIP. THE DEALER, HONDA AT THE AVENUES IN JACKSONVILLE, FL TOLD US THAT THEY COULD NOT REPLICATE THE PROBLEM AND SENT US HOME. TWO DAYS LATER IT HAPPENED AGAIN AND WHEN WE TOOK IT TO THE DEALER THEY TOLD US THAT HONDA WAS RECALLING OUR MODEL AND THAT WE HAD TO LEAVE THE CAR AT HONDA FOR THE WEEKEND. SOMETHING ABOUT REPLACING THE ENGINE BLOCK BECAUSE OF MELTING PISTON.  *TR",
        "vin": "5FNRL5H67DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/09/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587376,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE ROTORS HAVE BECOME WARPED AND NEEDED TO BE RESURFACED.   ONLY THREE THOUSAND MILES AFTER THE REPAIR THE BRAKE ROTORS NEED TO BE REPLACED DUE TO THE SAME ISSUE.    DRIVING HABITS ARE NOT THE CAUSE - AS THIS IS THE FIRST VEHICLE I HAVE OWNED THAT HAS EVER HAD THIS PROBLEM.  I HAVE READY MULTIPLE ACCOUNTS OF OTHER HONDA ODYSSEY OWNERS WITH THIS SAME ISSUE.  *TR",
        "vin": "5FNRL5H6XDB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/09/2014",
        "dateOfIncident": "05/08/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587470,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "P235/65R17",
                "type": "Tire"
            }
        ],
        "summary": "A CONTINENTAL CONTIPROCONTACT P235/65R17 TIRE THAT CAME INSTALLED ON A NEW 2013 HONDA ODYSSEY HAD THE SIDEWALL BLOW OUT WHILE DRIVING AT ABOUT 45 MPH.  THE TIRES HAVE AROUND 25000 MILES ON THEM.  THERE IS NO OTHER VISIBLE DAMAGE TO THE SIDEWALL TO INDICATE THAT THERE WAS ANY EXTERNAL CAUSE FOR THE BLOWOUT.  A LARGE SECTION (APPROX. 2\"X3\") COMPLETELY BLEW OUT ON THREE SIDES REMAINING ATTACHED ONLY ON THE SIDE FARTHEST FROM THE WHEEL.  THE WARRANTY DOCUMENT PROVIDED WITH THE VEHICLE WAS FOR GOODYEAR TIRES RATHER THAN CONTINENTAL, SO I AM CURRENTLY WAITING TO HEAR BACK FROM THE DEALERSHIP ON THE WARRANTY.  *TR",
        "vin": "5FNRL5H65DB"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10567080,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHILD OPERATED BUTTON TOO CLOSE AUTOMATIC REAR PASSENGER DOOR AND REACHED BEHIND FOR SEAT BELT. IT WAS DARK AND THE CHILD WAS FEELING AROUND FOR THE BELT, WHEN THE DOOR CLOSED ON CHILD'S HAND AND CRUSHED FINGERS. THIS WAS IN THE REAR PART OF THE DOOR, NEXT TO WHERE THE SEAT BELT ANCHOR IS.    CHILD WAS SCREAMING AND PARENT OPERATED DRIVER SIDE DOOR OPEN BUTTON TO RELEASE HAND. FINGERS ARE BADLY BRUISED.    THERE IS NO WARNING THAT FINGERS CAN GET CAUGHT IN THE REAR, SO IT WAS UNEXPECTED. THERE IS ALSO NO AUTOMATIC RELEASE SIMILAR TO THAT WHEN AN OBSTRUCTION IS ENCOUNTERED IN THE FRONT PART OF THE DOOR.  *TR",
        "vin": "5FNRL5H99DB"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/28/2014",
        "dateOfIncident": "01/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE  EMITTED A LOUD NOISE AS THE STEERING WHEEL MOVED ABRUPTLY TO THE LEFT. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A DITCH. THE CONTACT DID NOT SUSTAIN ANY INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE HOWEVER, THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 10,000.",
        "vin": "5FNRL5H63DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2014",
        "dateOfIncident": "12/21/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565019,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VIEW SCREEN WHICH IS SHARED BY THE CLOCK, RADIO, PHONE AND BACK UP CAMERA DOES NOT WORK PROPERLY.  WHEN WEARING POLARIZED SUNGLASSES THE BOTTOM RIGHT QUADRANT AND PART OF THE BOTTOM LEFT QUADRANT OF THE SCREEN ARE BLACKED OUT WITH A YELLOWISH EDGE.  THIS MAKES BACKING UP ON SUNNY DAYS HAZARDOUS BECAUSE THE ODYSSEY DOES NOT HAVE GOOD VISIBILITY IN THAT AREA AND IS A RISK OF COLLISION.  WHEN I FIRST BOUGHT THE VEHICLE THE AREAS OF BLACKNESS WERE DIME SIZED, BUT HAVE PROGRESSIVELY INCREASED IN SIZE.  THE HONDA DEALER AND CONSUMER LINE SAY THAT THIS OCCURS WITH ALL HONDAS THAT HAVE A VIEW SCREEN AND THAT THE SOLUTION IS \"DON'T WEAR SUNGLASSES WHEN BACKING UP\".  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NO ACCELERATION RESPONSE TO DEPRESSED ACCELERATOR PEDAL FOR ABOUT 1 TO 2 SECONDS, WHEN PULLING AWAY FROM TRAFFIC LIGHTS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560293,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING 10 MPH IN A PARKING GARAGE, SHE HEARD A LOUD NOISE AS THE PASSENGER'S SIDE FRONT AND SIDE AIR BAGS DEPLOYED INADVERTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR FURTHER INSPECTION. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2013",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557498,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING THE BRAKES UNDER NORMAL CONDITIONS, THE VEHICLE BEGINS TO SHAKE.  I BROUGHT IT INTO THE HONDA DEALER FOR THIS ISSUE, AND THEY TOLD ME THAT THE ROTORS ARE WARPED, THE VEHICLE ONLY HAS 16000 MILES ON IT AND IT IS ONLY 8 MONTHS OLD.  *TR",
        "vin": "5FNRL5H66DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/02/2013",
        "dateOfIncident": "11/29/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554326,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING INTO A SPOT IN A PARKING LOT, THE VEHICLE SURGED FORWARD ON ITS OWN AT AN ALARMING SPEED AND CRASHED INTO A PARKED CAR. DRIVER AIRBAG WAS DEPLOYED. NO INJURIES. POLICE REPORT WAS FILED.   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/13/2013",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552033,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY.  THE CONTACT STATED THAT WHILE ENTERING A RESIDENTIAL GARAGE, THE VEHICLE SURGED AND RAPIDLY ACCELERATED INDEPENDENTLY. THE CONTACT CRASHED AGAINST THE GARAGE DOOR AND THE PASSENGER?S SIDE REAR-VIEW MIRROR BECAME DETACHED FROM THE VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THE REPAIRS WERE MADE TO THE DAMAGE. HOWEVER, NOTHING WAS FOUND WRONG WITH THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 15,382.    UPDATED 12/30/13*CN",
        "vin": "5FNRL5H44DB"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541960,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR PULLS TO LEFT AT SPEEDS ABOVE 60 MPH AND GET WORSE THE HIGHER THE SPEED. I AM FAMILIAR WITH HONDA ODYSSEY AS I HAVE OWNED THIS ONE SINCE 2003 AND IT HAS 180000 MILES. THIS NEW ONE DRIVES FINE IN TOWN AND AT SPEEDS 60 OR BELOW. I HAVE TAKEN IT BACK TO DEALER AND THEY DID RE ALIGNMENT AND LOWERED TIRE PRESSURE TO 30 PSI BUT I LIKE TO RUN AT LEAST 35 PSI.  CAN YOU LET ME KNOW IF ANYONE ELSE HAS HAD A SIMILAR PROBLEM.  I LOVE THE CAR OTHERWISE.  IT IS NO FUN TO FIGHT A CAR TRYING TO PULL TO THE LEFT AT 75 MPH.  IT IS A DANGEROUS PROBLEM. *JB",
        "vin": "5FNRL5H9XDB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2013",
        "dateOfIncident": "07/27/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538113,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE INTERSTATE FOR ABOUT 1 HOUR WHEN THE VEHICLE WENT INTO A SUDDEN ACCELERATION WITH NO INPUT FROM ME.  THE SPEED GOT PAST 75 WHEN I DISENGAGED THE CRUISE CONTROL AND HIT THE BRAKE.  THE VEHICLE DID SLOW DOWN AND WHEN I RESET THE CRUISE CONTROL, IT HELD SPEED.  JUST BEFORE THIS HAPPENED BY ABOUT 20 MINUTES, I NOTICED THAT THE SPEED I WAS TRAVELING WAS SLOWLY DECREASING SO I \"BUMPED\" UP THE SPEED WITH THE \"ACC\" BUTTON ON THE CRUISE CONTROL, NOTHING HAPPENED.  SO I BUMPED IT UP A FEW MORE TIMES WITH NO EFFECT.  I THEN CAME TO AN OVERPASS BRIDGE AND THE SPEED SLOWED DOWN TO 66 GOING UP THE BRIDGE AND WHEN OVER THE TOP, RAPIDLY ACCELERATED TO 75MPH, WHEN I GOT TO THE BOTTOM OF THE BRIDGE AND ON FLAT HIGHWAY, I WAS STILL TRAVELING AT 75.  SO IT SEEMS THAT THE \"SYSTEM\" KNEW THAT I WAS TRYING TO BUMP UP THE SPEED BUT DIDN'T REACT UNTIL I WAS OVER THE BRIDGE.  I DISENGAGED THE CRUISE CONTROL AND RESET IT AND IT HELD FOR 20 MINUTES BEFORE HAVING THE SUDDEN ACCELERATION, FEELING LIKE IT DOWNSHIFTED AND SPED UP RAPIDLY (AS IF I WAS TRYING TO PASS SOMEONE).  I TOOK THE VEHICLE TO THE HONDA DEALERSHIP TO BE CHECKED AND THEY SAID THAT THEY COULD NOT REPLICATE THE PROBLEM AND THAT NO CODES WERE IN THE SYSTEM.  I FEEL THAT THE SUDDEN ACCELERATION IS SOMEHOW RELATED TO THE CRUISE CONTROL AS WELL AS THE NON-REACTION TO MY ATTEMPT AT ADJUSTING THE SPEED.",
        "vin": "5FNRL5H90DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "08/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537223,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE DISCOVERED THAT THE 2013 MODELS OF THIS VEHICLE DO NOT SOUND THE BEEPER IF THE DRIVER OR FRONT PASSENGER DOOR IS OPEN WHILE DRIVING.  PAGE 77 OF THE OWNER'S MANUAL CLEARLY STATES \"THE BEEPER SOUNDS AND THE INDICATOR COMES ON IF ANY DOOR OR THE TAILGATE IS OPEN WHILE DRIVING.\"  WE HAVE CONTACTED THE DEALER AND AMERICA HONDA AND THEY SAY THEY CAN DO NOTHING ABOUT THIS FEATURE NOT WORKING AS STATED IN THE MANUAL AND THE VEHICLE IS NOT DESIGNED TO ALERT THE DRIVER TO THIS HAZARD AS STATED IN THE MANUAL.  THIS COULD BE QUITE DANGEROUS TO SMALLER INDIVIDUALS SHOULD SOMEONE BE DRIVING WITHOUT A DOOR COMPLETELY CLOSED.  THIS ALSO MAKES ONE WONDER HOW MANY OTHER SAFETY FEATURES HONDA CLAIMS TO HAVE IN THEIR VEHICLES THAT DO NOT WORK AS THEY CLAIM AND HAVE THE POTENTIAL TO CAUSE INJURY AND HONDA IS HIDING FROM THE CONSUMERS.  *TR",
        "vin": "5FNRL5H46DB"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/14/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533572,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2010 & 2013 HONDA ODYSSEY.  CONSUMER WRITES IN REGARDS TO  RADIO ISSUES IN BOTH VEHICLES.  *SMD  THE CONSUMER NO LONGER OWNS THE 2010 MODEL. HOWEVER, WHEN HE DID OWN THE VEHICLE, THE SIRUS XM SATELLITE RADIO WOULD CHANGE STATIONS ON ITS OWN, OVER A THREE YEAR PERIOD. DURING THAT PERIOD, TWO RADIOS WERE REPLACED, NUMEROUS RADIOS HARNESSES WERE ALSO REPLACED.  THE CONSUMER BELIEVED THE PROBLEM WAS DUE TO A FAULTY SATELLITE RADIO SIGNAL. THE CONSUMER HAS SINCE PURCHASED A 2013 MODEL, AND IS CURRENTLY EXPERIENCING THE SAME RADIO PROBLEMS. THE RADIO WOULD CHANGE STATIONS, THEN IT WOULD READ NO DISC.",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT THE AIR CONDITIONING WOULD AUTOMATICALLY ACTIVATE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE CONTACT STATED THAT THE TECHNICIAN ADVISED HIM THAT THE HUMIDITY SENSOR ACTIVATED THE AIR CONDITIONER AUTOMATICALLY AND THAT THERE WAS NO REMEDY AVAILABLE FOR THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 3,500.",
        "vin": "5FNRL5H96DB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2013",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525081,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITION IN THE VEHICLE COMES BY ITSELF AND GOES OFF AFTER CERTAIN TIME EVEN THOUGH THE SWITCH IS OFF. WE GET COLD IN THE VEHICLE AND DOESN'T HAVE ANYWAY TO SWITCH IT OFF. DRIVER NEED TO SWITCH OFF FAN WHEN IT'S TOO COLD AND SWITCH ON THE FAN WHEN THE CABIN BECOMES HOT. HAVING DRIVERS MIND IN MAKING THIS MANUAL OPERATOR JOB, HE/SHE  LOOSES THE CONCENTRATION ON THE ROAD. HAVING KIDS IN THE BACK THE CAR AND COMPLAINING ABOUT TEMPERATURE IS MOST ANNOYING THING FOR THE DRIVER AND MAKE DRIVER IRRITATING. THIS HAPPENS IN THE NEW HONDA VEHICLE IS UNBELIEVABLE.  *TR",
        "vin": "5FNRL5H62DB"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "06/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523255,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE PARKING, THE VEHICLE SURGED FORWARD AND CRASHED INTO A GARAGE WITHOUT WARNING. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED HOWEVER, THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS INSPECTED BUT THERE WERE NO FAILURES DETECTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 940. *TR",
        "vin": "5FNRL5H95DB"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "05/28/2013",
        "dateOfIncident": "05/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513928,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A DEER RAN IN FRONT OF OUR  2013 HONDA ODYSSEY VAN, WE HIT THE DEER DEAD CENTER NEITHER HEADLIGHT WAS BROKEN HOWEVER, THE GRILL, AC CONDENSER, FAN, GRILL, BUMPER, HOOD, LOCK ASSEMBLY AND SECURITY SYSTEM , RADIATOR SUPPORT AND MANY OTHER PARTS WERE DAMAGED TOTALING $4263.06. THE MOST INTERESTINGLY IN ENTIRE INCIDENT WAS THE AIR BAGS DID NOT INFLATE OR EVEN COME OUT UPON IMPACT. WE HAVE TAKEN IT TO JACK OF DIAMONDS IN TYLER FOR THE FIRST RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "04/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510176,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THIRD ROW, RIGHT HAND SIDE ARM REST/CUP HOLDER AREA WALL GETS HOT TO A POINT THAT PASSENGER ON THAT SIDE CANNOT SIT AND IS HOT ENOUGH TO BURN A PERSON.THIS ALSO AFFECTS THE COOLING/AIRCONDITIONING OF THE CAR AS WELL.  THIS IS A SERIOUS SAFETY ISSUE AND CAN CAUSE FIRE. *TR",
        "vin": "5FNRL5H90DB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2013",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496891,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING FROM A STOP SIGN OR RED LIGHT, THERE IS SOMETIMES A \"HESITATION\" WHERE THE TACHOMETER FALLS FROM AROUND 2000 RPM TO ABOUT 1000, THEN RECOVERS AFTER ABOUT 1 SECOND. THE CAR HAS BEEN TO THE DEALER TWICE - THEY ARE UNABLE TO REPLICATE THE CONDITION. *TR",
        "vin": "5FNRL5H49DB"
    }
]