[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454642,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The timing chain needs to be replaced on my vehicle with under 80,000 miles.  Researching the issue i found that this is a very common problem with this specific engine.  This is an $80,000+ car brand new and it did not last 80,000 miles.  This is an obvious part malfunction due to the design of the vehicle.  Infiniti should do something.  It is a costly repair.",
        "vin": "JN8AZ2NE6D9"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448098,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "While my wife was driving our QX56 during normal conditions at approximately 40MPH, QX56 begun to swerve repeatedly left to right in a dangerous manner and she had to apply brakes rapidly.  Looking under the vehicle, the lower control arm was badly cracked and the cause of the swerving.  I towed to my local shop (not Infiniti dealership) for repair and they confirmed the right control arm was cracked.  They stated the left control arm was also severely rusted / damaged and wasn't too far from cracking either.    Fortunately, my wife was only going 40mph and was able to control the swerving.  If going 70 or 75MPH on the highway, I'm not sure that would have been possible.  Pictures are attached, both of broken right control arm which caused swerving and left control arm that is near cracking.  With both control arms going out at same time, I feel this is a dangerous, quality control issue from Infiniti.  I spoke with Seth at Infiniti Consumer affairs who stated they wouldn't reimburse the repair at a non-Infiniti repair show and didn't appear to plan to pass on the seriousness of the problem.",
        "vin": "JN8AZ2NE8D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Infiniti QX56. The contact stated upon starting the vehicle, the vehicle made abnormal rattling sounds. The check engine warning light illuminated. The contact also stated that the failure was occurring while driving. The vehicle was taken to an independent mechanic who diagnosed that the timing chain guide and the timing chain needed to be replaced. The manufacturer was notified of the failure and advised the contact that they could not assist because the VIN was not included in a recall related to the failure. The contact referenced service bulletin #P6305. The vehicle was not repaired. The approximate failure mileage was 105,000.",
        "vin": "JN8AZ2NE9D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434820,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Took car in for maintenance and was told I needed a new timing chain as its an often replaced part and that is failing on my car ,  I looked it up and found out that its a voluntary recall at present after numerous complaints and the dealer admitted they are faulty but mine wasn't in the VIN range for reimbursement. I had to pay $3800 dollars to replace and wait 10 days for completion, this is an expensive repair on a car of this caliber , yet Infiniti offers no compensation. This faulty chain which is supposed to last a cars lifetime could cause the engine to FAIL resulting in a hazard to my family.",
        "vin": "jn8az2nexd9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433350,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Timing Chain",
        "vin": "JN8AZ2NFXD9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431708,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV WOULD NOT START SO HAD TO GET A JUMP.  1 WEEK LATER SAME THING. HAD BATTERY TESTED BUT WAS NOT BAD AND IT HAD JUST BEEN REPLACED BY DEALER IN 2019.  1 WEEK LATER AGAIN SUV WOULD NOT START. GOT A JUMP AND TOOK TO JBA INFINITI IN ELLICOTT CITY, MD WHO CHARGED THE BATTERY FOR 2 HOURS.  2 WEEKS LATER, SUV IS HESITATING TO START.  I REFUSE TO PAY ANOTHER $186 FOR THEM TO DIAGNOSE AND THEN RECHARGE THE BATTERY AGAIN.  AFTER SOME RESEARCH IT LOOKS LIKE OTHERS ARE HAVING THIS SAME ISSUE. NEXT, CATALYTIC CONVERTERS.  SUV IS 8 YEARS OLD AND JBA INFINITI IS TELLING ME I NEED TO REPLACE THEM @ A COST OF $7500.  THIS IS RIDICULOUS.....I DON'T HAVE LOSS OF POWER BUT I SO GET THE \"ROTTEN EGG\" SMELL SOMETIMES.  I WOULD THINK THIS PART WOULD BE COVERED UNDER EMISSION WARRANTY FOR AT LEAST 15 YEARS.  I HAVE 142000 MILES ON IT.",
        "vin": "JN8AZ2NEXD9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2021",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421511,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Timing belt/chain failure - Recalled and repaired by dealership.   When picking up my vehicle from the dealer for the above mentioned repair I was notified that I need new Catalytic Converter's as now the Service Engine light was coming on.  The Service Engine light was NOT coming on prior.  After an hour or two researching the CAT issue online I have found hundreds if not more instances with the same issue for this vehicle.   A bad CAT can cause numerous issues with vehicle performance to vehicle fires which could cause accidents putting not only passengers but other motorists at risk.  And then there's the damage to the environment.   If the timing belt warranted a recall for causing misfires...etc.  why wouldn't the manufacturer include parts of the system effected by the part being recalled?  Timing Belt causes misfires -->  Misfires cause CAT damage/failure,  but CAT not included in the recall.",
        "vin": "JN8AZ2NF9D9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,BACK OVER PREVENTION",
        "crash": true,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413961,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS CAR THAT PULLED UP BEHIND ME WHILE I WAS IDLE IN THE DRIVEWAY  AND AS I PULLED OUT NO WARNING BEEP..AND NOW THE VEHICLE. WAS NOT CRANKING FOR SEVERAL HOURS AND NOTHING IS WRONG WITH BATTERY AND REMOTE IS FULLY CHARGED & HAVE BEEN STRANDED SEVAL TIMES BECAUSE IF OF IT...THIS HAS TO BE A RECALL",
        "vin": "JN8AZ2NE7D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394273,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 INFINITI QX56. THE CONTACT STATED WHILE DRIVING 55 MPH, THE VEHICLE MISFIRED AND STALLED. THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED AND FLASHING. THE VEHICLE WAS TOWED TO WILLIS INFINITI (2101 NW 100TH ST, DES MOINES, IA 50325, 855-638-2280) AND WAS DIAGNOSED THAT THE TRANSMISSION WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 118,000.",
        "vin": "JN8AZ2NE7D9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364157,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY. REPLACED ALTERNATOR AND BATTERY, VEHICLE IS DEAD EVERY 2-3 DAYS. MANY OTHERS REPORT THE SAME ISSUE. INFINITI HAS AN \"INFOTAINMENT SOFTWARE UPDATE\" TO FIX THIS PROBLEM BUT HAVE NO FIX FOR OLDER VEHICLES.",
        "vin": "JN8AZ2NE8D9"
    },
    {
        "components": "SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350880,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE PEDAL SEEMS SPONGY AND WHILE BRAKING AT SLOWER SPEEDS THE SEAT BELT PULLS BACK VIOLENTLY PINNING THE DRIVER BACK AGAINST THE SEAT.  REAR BRAKES HAVE BEEN REPLACED AND BRAKE SYSTEM FLUID CHECK STILL NO DIFFERENT.",
        "vin": "JN8AZ2NE7D9"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319803,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN HIGHWAY 421 IN WILKESBORO, NC ON A 45 MPH SECTION OF THE HIGHWAY, MERGED OVER INTO THE TURNING LANE TO TURN LEFT ACROSS TWO LANES OF TRAFFIC.  WAITED FOR A BREAK IN TRAFFIC, UPON A BREAK IN TRAFFIC TRIED TO ACCELERATE TO CROSS TRAFFIC, AS VEHICLE STARTED TO ACCELERATE IT STALLED IN MIDDLE OF ROAD.  WIFE AND CHILDREN IN CAR STARTED SCREAMING.  TRAFFIC NICE ENOUGH NOT TO RUN INTO US.  HAD CAR TOWED TO LOCAL AUTOMOTIVE REPAIR SHOP.  FOUND THAT THIS IS A COMMON PROBLEM FOR THE 5.6 LITTER NISSAN/ INFINITI ENGINE.  ONE OF THE TIMING GEARS FOR THE LEFT BANK STOPPED ROTATING SOME HOW.  THIS SIDE OF THE ENGINE TIMING SYSTEM ALSO POWERS THE FUEL PUMP SO THAT YOU CANNOT EVEN LIMP ACROSS THE ROAD ON HALF THE ENGINE.  IT JUST STOPS RIGHT WHERE YOU ARE.  YOU HAVE NO STEERING NO BREAKING AND NO PROPULSION.  THIS IS A DANGEROUS SITUATION AND THE MANUFACTURE SHOULD BE HELD RESPONSIBLE FOR THE DESIGN AND LACK OF QUALITY OF THE ENGINE.",
        "vin": "JN8AZ2NE1D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316183,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS COMPLETELY DEAD AND WOULD NOT START WHEN BATTERY WAS JUMPED. BATTERY WAS REPLACED ONCE IT WAS DISCOVERED THAT THE ORIGINAL BATTERY WAS COMPLETELY DEAD. ONCE THE VEHICLE STARTED , THE ENGINE LIGHT WAS VISIBLE ON THE DASH. THE VEHICLE WAS MAKING A VERY LOUD HUMMING SOUND COMING FROM UNDER THE HOOD. THE SOUND GOT LOUDER AND INTENSIFIED AS THE RPMS INCREASED.",
        "vin": "JN8AZ2NF1D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315533,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN WAS LOOSENED AND WAS RUBBING AGAINST ANOTHER PART MAKE A LOUD NOISE WHILE SITTING AND DRIVING. THANKFULLY I STOPPED IN TO HAVE IT CHECKED OUT. THE SERVICE DEPARTMENT SAID IT WAS READY TO BREAK AT ANYTIME. THANKFULLY NOTHING HAPPEN TO ME, KIDS, AND HUSBAND ON THE HIGHWAY. FRIGHTENING TO THINK OF LOSING CONTROL OF A VEHICLE WHILE DRIVING 65 MPH. THERE WAS A RECALL ON TIME CHAINS FOR THE SAME YEAR, BUT MY VIN # WAS NOT COVERED. IT SHOULD HAVE BEEN COVERED. I HAVE HAD IT TO THE DEALERSHIP SEVERAL TIMES FOR NORMAL UPKEEP. SHOULD THERE HAVE BEEN A RECALL, THE SERVICE DEPT WOULD HAVE CAUGHT IT. THEY AGREED THIS MORNING AS WELL.",
        "vin": "JN8AZ2NC9D9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311906,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ACROSS A BRIDGE IN TOWN GOING ABOUT 40MPH.  NOTHING WAS OVER HEAD, DRIVING CONDITIONS WERE GOOD, WEATHER CLEAR AND ALL OF SUDDEN OUT OF NO WHERE I HEARD AN EXPLOSION. EXTREMELY LOUD, MADE MY EARS RING. I IMMEDIATELY THOUGHT SOMETHING BLEW UP OR MY CAR HAD BEEN SHOT. I STARTED HEARING PIECES OF GLASS HIT MY SUNROOF COVER AND PULLED UP TO FIND MY GLASS HAD EXPLODED AND LEFT A HUGE HOLE IN MY SUNROOF. THE GLASS EXPLODED FROM THE INSIDE OUT.   I IMMEDIATELY TOOK MY VEHICLE TO THE INFINITI DEALERSHIP WHERE I PURCHASED THE CAR BRAND NEW. THEY AGREED THAT IT HAD EXPLODED FROM THE INSIDE OUT AND SAID THEY HAD SEEN THIS BEFORE. I WAS ASKED TO PAY $1261 TO REPLACE THE GLASS SINCE MY CAR WAS NOT UNDER WARRANTY.",
        "vin": "JN8AZ2NE7D9"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306616,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CATALYST PROBLEM P0420 P0420. SEEN SAME VEHICLES BEING RECALLED.",
        "vin": "JN8AZ2NF4D9"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277068,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 INFINITI QX56. THE CONTACT HEARD A SQUEAKING NOISE WHEN SHE DEPRESSED THE ACCELERATOR PEDAL. ALSO, THE VEHICLE SHOOK WHEN STOPPING AND HESITATED WHEN ATTEMPTING TO ACCELERATE TO HIGHWAY SPEEDS. AN INDEPENDENT MECHANIC CHECKED THE VEHICLE, AFTER MULTIPLE INCIDENT HAPPEN THE NOISE GOT LOUDER AND THE STALLING GOT WORSE THE CONTACT STATED GOT TIMING CHAIN REPAIRED BUT FOUND NO FAILURES. THE CONTACT WAS INFORMED TO BRING THE VEHICLE BACK IN IF THE FAILURE RECURRED. THE CONTACT STATED THAT THE FAILURE RECURRED. JOE MACHENS NISSAN (201 NEBRASKA AVE, COLUMBIA, MO 65203, (573) 503-4550) STATED THAT THEY DID NOT PERFORM RECALL REPAIRS AT THEIR FACILITY AND REFERRED THE CONTACT TO THE MANUFACTURER. THE MANUFACTURER STATED THAT THERE WERE NO RECALLS AND REFERENCED TECHNICAL SERVICE BULLETIN: 16-015; HOWEVER, IT EXPI*BFRED IN FEBRUARY OF 2018. THE FAILURE MILEAGE WAS 120,000. *BF *TP",
        "vin": "JN8AZ2NE3D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270589,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD WHISTLING/WHINING SOUND FROM THE MOTOR AT START UP.  EXTREME LOSS OF POWER WHEN STARTING UP A GRADE OR TO GET UP TO SPEED ON THE INTERSTATE CAUSING FEAR OF REAR END COLLISION. IT APPEARS TO BE A COMMON ISSUE WITH THIS VEHICLE THAT RESULTS IN A TIMING CHAIN OR CATALYTIC CONVERTER REPAIR, COSTING SEVERAL THOUSAND DOLLARS. IT APPEARS INFINITI IS AWARE OF THE PROBLEM BUT WON'T ISSUE A RECALL FOR OBVIOUS REASONS.  THIS VEHICLE IS NOW VIRTUALLY INOPERABLE AS IT IS NOT SAFE TO BE ON THE ROAD UNTIL IT IS FIXED.",
        "vin": "JN8AZ2NE4D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185571,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAR ABNORMAL NOISES FROM THE ENGINE SOUND LIKE RATTLE OR TICKING",
        "vin": "JN8AZ2NE6D9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150715,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN REPLACEMENT NEEDED AFTER 80000 MILES",
        "vin": "JN8AZ2NE7D9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131472,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SERVICE ENGINE LIGHT CAME ON, AND I BROUGHT THE VEHICLE TO THOUSAND OAKS INFINITI WHERE I REGULARLY HAVE THE VEHICLE SERVICED. THE DIAGNOSIS WAS A BANK 2 CATALYTIC CONVERTOR FAILURE. BASED ON MY RESEARCH, THIS IS A VERY COMMON PROBLEM WITH THE CAR AND IT IS JUST A MATTER OF TIME THAT THE OTHER CATALYTIC CONVERTOR WILL ALSO NEED TO BE REPLACED.",
        "vin": "JN8AZ2NC4D9"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985139,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 INFINITI QX56. WHILE DRIVING 30 MPH, THE CONTACT HEARD A LOUD NOISE AND THE VEHICLE SHOOK. THE FOLLOWING DAY, THE CONTACT NOTICED THAT THE REAR OF THE VEHICLE WAS SAGGING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE SUSPENSION AIR BAG ON THE REAR DRIVER'S SIDE OF THE VEHICLE EXPLODED AND NEEDED TO BE REPLACED. THE CONTACT WAS ADVISED TO TAKE THE VEHICLE BACK TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": "JN8AZ2NF6D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/18/2015",
        "dateOfIncident": "04/16/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10717126,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "4/14/15 VEHICLE PURCHASED FROM CARMAX.    PROBLEM:  BRAKES DO NOT WORK WHEN PUSHED ALL THE WAY TO THE FLOOR    FIRST BRAKE FAILURE (4/15/15)   TWO DAYS AFTER PURCHASE, BRAKES FAILED AT APPROX. 6PM UNDER CLEAR WEATHER/GOOD ROAD CONDITIONS, WHILE TRAVELING NORTH ON VERMONT AVE. IN GARDENA, CA AT APPROX. 10 MPH.  THE QX56 HIT A DODGE STRATUS STOPPED AT A RED LIGHT.  THE STRATUS DRIVER WAS INJURED AND SUBSEQUENTLY REQUIRED MEDICAL TREATMENT.    THE QX56 WAS RETURNED TO CARMAX FOR REPAIR, BUT CARMAX SAID THEY COULD NOT RECREATE THE BRAKE FAILURE.  THE VEHICLE WAS TOWED TO INFINITI AND AN ENGINEER WAS SENT OUT TO PULL THE BLACK (RECORDER) BOX.  TO DATE, WE HAVE NOT RECEIVED THE REPORT OF FINDINGS.  INFINITI SAID THEY CHECKED THE BRAKES AND THAT THE VEHICLE WAS SAFE TO DRIVE.    SECOND AND SUBSEQUENT BRAKE FAILURES (5/16/15)  BRAKES FAILED SEVERAL TIMES WHILE TRAVELING WEST ON THE 10 FWY AND SOUTH ON THE 605 FWY FROM WEST COVINA TO  CERRITOS, CA. IN TRAFFIC AT APPROX. 40-45 MPH UNDER CLEAR WEATHER/GOOD ROAD CONDITIONS AT 1:15P.M., 1:35 P.M., ETC.  4 ADULTS WERE IN THE CAR.  IMPACT WAS AVOIDED WITH THE CAR IN FRONT BY PULLING THE INFINITI ONTO THE FREEWAY SHOULDER    AFTER OCCURRENCE, THE QX56 WAS DRIVEN DIRECTLY TO INFINITI CERRITOS (11011 E. SOUTH STREET, CERRITOS, CA 90703).  THE BRAKE CONDITION IS BEING ANALYZED.  THE CONTACT PERSON IS [XXX]        ANOTHER QX56 VEHICLE COMPLAINT FOR THE SAME YEAR, MAKE, MODEL, AND IDENTICAL BRAKE FAILURE PROBLEMS WAS REPORTED ON CARCOMPLAINTS.COM AT CAN BE FOUND AT THE FOLLOWING LINK:    WWW.CARCOMPLAINTS.COM/INFINITI/QX56/2013/BRAKES/BRAKE_PEDAL_GOES_ALL_THE_WAY_TO_THE_FLOOR.SHTM.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JN8AZ2NE6D9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2014",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667433,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS WITHIN TWO DAYS, THE BRAKE PEDAL WENT COMPLETELY TO THE FLOOR. IN THE FIRST INSTANCE, I WAS ALREADY AT A COMPLETE STOP WITH MY FOOT ON THE BRAKE PEDAL WHEN IT SUDDENLY COLLAPSED ALL THE WAY TO THE FLOOR. IN THE SECOND INSTANCE, AS SOON AS I CAME TO A COMPLETE STOP, THE BRAKE PEDAL COLLAPSED ALL THE WAY TO THE FLOOR. I AM NOW AFRAID TO DRIVE THE CAR, FOR FEAR IT WILL OCCUR AGAIN WHEN I AM NOT COMPLETELY STOPPED, AND I WILL HAVE NO BRAKING ABILITY. THE INFINITI DEALER HAS INSPECTED THE CAR, CLAIMS NOTHING IS WRONG, AND THEY WERE UNABLE TO REPLICATE THE PROBLEM. THE CAR HAS BEEN SITTING AT THE DEALER FOR OVER A WEEK AWAITING AN INSPECTION BY A REPRESENTATIVE FROM INFINITI CONSUMER AFFAIRS. THE PROBLEM SEEMS VERY SIMILAR TO A PROBLEM EXPERIENCED ON EARLIER MODEL YEARS, WHEN THE BOOSTER CYLINDER MALFUNCTIONED. CLEARLY, THERE IS SOME SORT OF PROBLEM WITH THE BRAKE HYDRAULICS...",
        "vin": "JN8AZ2NC7D9"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/26/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628623,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING UP IN PARKING LOT SLOWLY (3MPH), UTILIZING ALL MIRRORS, GLANCING OVER BOTH SHOULDERS WHEN I BACKED INTO A VEHICLE'S BUMPER CAUSING DAMAGE TO MY BUMPER WHILE NONE TO THE OTHER CAR. THE INFINITI QX56 IS EQUIPPED WITH CAMERA AIDING CORNER SONAR AND MOD (MOVING OBJECT DETECTION). THE SONAR SYSTEM UTILIZES CAMERAS ON THE VEHICLE WHICH ARE DISPLAYED ON THE DASHBOARD DISPLAY SCREEN AS WELL AS AUDIBLE TONES WHICH INCREASE IN INTERMITTENT FREQUENCY UP TO CONTINUOUSLY, THE CLOSER THE OBJECT BECOMES. THE CORNER SONAR IS ADJUSTABLE TO HIGHER OR LOWER SENSITIVITY AND IS SET TO THE HIGHEST SETTING WHICH SOUNDS A TONE TO INFORM THE DRIVER OF OBSTACLES NEAR THE BUMPER - PER THE OWNER'S MANUAL. THE MOD SYSTEM INFORMS THE DRIVER OF MOVING OBJECTS SURROUNDING THE VEHICLE WHEN DRIVING OUT OF GARAGES, MANEUVERING INTO PARKING LOTS AND IN OTHER SUCH INSTANCES AND IS AUTOMATICALLY TURNED ON WHEN THE SELECTOR LEVER IS IN THE R (REVERSE) POSITION. HOWEVER, THE OWNER'S MANUAL STATES THAT WHILE THE SONAR IS BEEPING, THE MOD SYSTEM DOES NOT CHIME.THIS IS THE SECOND TIME THIS VEHICLE'S SAFETY FEATURES HAVE NOT PERFORMED IN REVERSE WITH NO SONAR TONES NOR MOD CHIMES SOUNDING AN ALERT. I REPORTED THIS ISSUE DIRECTLY TO THE DEALERSHIP WHERE THE VEHICLE WAS PURCHASED, AFTER THE FIRST FAILURE TO ALERT WHICH RESULTED IN MINOR DAMAGE TO THIS VEHICLE'S BUMPER BY CONTACT WITH A STATIONARY SIGN POLE IN A PARKING LOT. THE VEHICLE WAS INSPECTED WITH NO MALFUNCTIONS FOUND AND I WAS ADVISED (PER INFINITI'S DISCLAIMER'S) TO NOT JUST USE THESE TOOLS TO PREVENT ACCIDENTS, BUT TO USE THEM IN CONJUNCTION WITH THE REAR-VIEW MIRROR, SIDE-VIEW MIRRORS, AND LOOKING AND CHECKING TO MAKE SURE IT IS SAFE TO MOVE. THESE ADDITIONAL SAFETY FEATURES WERE VERY IMPORTANT TO OUR PURCHASE OF THIS VEHICLE AS I WANT TO FEEL SAFE IN A VEHICLE AND KNOW THAT THE VEHICLE'S FEATURES/OPTIONS OPERATE AS INTENDED AND IS RELIABLE.   *TR",
        "vin": "JN8AZ2NF8D9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "01/12/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500481,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 INFINITI QX56. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE LOST ACCELERATION POWER.  THE CONTACT ALSO STATED THAT THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 2,000. MAH  UPDATED 06/26/2013 *JS",
        "vin": "JN8AZ2NF6D9"
    }
]