[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine made some rattling noise, then smoke came from muffler while driving on a highway. The vehicle stalled and the vehicle needed to be towed. The vehicle was inoperable (unable to start the engine)..",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454012,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Left rear door will not unlock.  Numerous complaints of similar issue found online; youtube videos showing how to repair.  Took our 2013 into Hyundai dealership and they wanted $800+ to repair (a known defect).  Request NHTSA require Hyundai to recall the door locks and repair them at their expense.",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451071,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle has an engine oil leak at the oil pan gasket. This was previously recalled by Hyundai (19V063000) as potentially causing a sudden loss of power or rapid slowing of the vehicle during operation. The Hyundai dealership addressed that recall by placing RTV on the gasket. It appeared to fix the issue for a few months to a year. Then I noticed the vehicle was dripping oil and that it appeared to be coming from the oil pan gasket. The \"fix\" that Hyundai previously performed has stopped working resulting in the same safety issue as identified in the prior recall. My wife took the vehicle to a Hyundai dealership today and where they confirmed that it was leaking from the oil pan and quoted $396 to fix it. My wife was told that they would not remediate the safety issue since they already performed work for that recall and it had been a year. I feel this is a serious issue - that the work they did to resolve a safety recall has failed and they are unwilling to fix it. I wonder if the work to my vehicle was done correctly compared to others (did the remediation call for RTV to be used?), or if Hyundai did not take the correct approach to remediate the issue (should it have been a new, thicker gasket instead of the RTV?). In either case, the fix has failed and resulted in the same deficient safety condition stated in the prior recall.",
        "vin": "KM8JUCAC8DU"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449399,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "This is in direct relation to Hyundai Recall Campaign 181. NHTSA recall # 19Vx-063. Engine stalled without warning - no engine light - in February of 2020. Vehicle was towed to a local certified and well known auto repair shop for $115.00. Owner of repair shop advised he looked for recalls and at that time, nothing was showing up for my vehicle and because the engine had 171,000 miles on it, we authorized him to locate the same engine (used) and install it. Cost to us, $5000.00. It wasn't until months (?) year (?) down the road that we received a recall notice from Hyundai; campaign recall 181. (Their letter's are not dated nor are the envelopes postmarked with dates, so I cannot provide those dates).  My vehicle was slated to be inspected on 12/3/21; I advised the dealership that it is not the original engine, but the vehicle never made it to the inspection. The weekend prior to 12/3/21 (Thanksgiving weekend of 2021), the vehicle stalled (engine seized) on the highway at 65mph; lost power steering and it had to be towed. Our cost $310. We have a video where you can hear the awful grinding noises it made during that time. This time we towed the vehicle to the dealership where they confirmed the engine seized. Hyundai denied any claim to the engine seize. This used engine had less than 100,000 miles on it when it seized. We expected they would fix this one, but they told the dealership that since we did not get the 1st engine fixed by the dealership they won't replace the 2nd engine for us.  We towed the vehicle back to our home where it is sitting.  Safety was definitely a concern at 65mph and engine seizing; lost power steering. The problem has been confirmed by the dealership.  No warning lights or messages; the grinding noise just came out of nowhere and the vehicle continued to lose power and stall on the side of the highway.",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448764,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Hyundai Tucson. The contact stated that after her husband made a right turn at a low rate of speed, the engine ceased without warning. The vehicle failed to restart after multiple attempts. Due to the failure, her husband had the vehicle towed to an independent mechanic where it was diagnosed with engine failure. The manufacturer had been notified and informed her that there were no recalls on the vehicle; they offered no further assistance. The vehicle had yet to be repaired and remained in the possession of the mechanic. The failure mileage was 121,600.",
        "vin": "km8ju3ac9du"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448273,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Spontaneous breaking of the sunroof.    Second time this has happened",
        "vin": "Km8jucac2du"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "12/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446292,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Hyundai Tucson. The contact stated that the catalytic converter was stolen, and the vehicle was towed to an independent mechanic for repair. The vehicle remained in its possession for a month before being returned to the contact. While the contact was driving home from the mechanic shop at an unknown speed, the engine shut off without warning. The contact initially towed the vehicle back to the independent mechanic who then informed her of NHTSA Campaign Number: 19V063000 (Engine and Engine Cooling). The contact then had the vehicle towed to a dealer where a diagnostic test was performed, and it was determined that the vehicle experienced engine failure. The results were sent to the manufacturer who informed the dealer that the failure was not a result of the recall and that they would only cover half the cost of a new engine. The contact called the manufacturer directly and was given the same information. A case was filed. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was approximately 150,000.",
        "vin": "km8jucac2du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443845,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My engine failed without any check engine lights prior. Started making a REALLY loud flapping noise when accelerating and would get worse the higher the RPM and the higher MPH. Even while coasting the noise was still prominent. It started around 12pm on 12/11/2021 and at 1:07pm (approximately 1 hour later) on the same day, it officially failed. The noise had started and gradually got worse while I was on the highway going approximately 65-70mph. I had stopped and pulled over shortly after it had started and made some calls to some certified Hyundai dealers to try and see what to do. I had made an appointment for first thing on Tuesday morning, 12/14/2021. I told them I would drop it off as soon as possible because I was sure it was going to blow. Tuesday appointment was the earliest appointment available at ANY Hyundai dealer within an acceptable/safe range. After I had made the calls, I proceeded to try and make it home. I was about 35-40 miles to home and my engine got EXTREMELY loud and not running properly. I was approximately 10 minutes from the dealership I bought my car from and I decided, if I made it there that I would leave the car there and not drive it home because I did not feel safe. About 45-60 seconds after the noise got so loud I couldn’t hear the radio. I was trying to find a safe spot to pull over but apparently didn’t make the decision in time because at 65-70mph (cruise control set at 67mph)  my engine made a crash/boom sound then every light on my car’s dash lit up and car longer was functioning. I got pulled off to the curb immediately and shut the car off. Approx 5/2021, check engine came on, code read all cylinders were misfiring, spark pugs were changed because no engine failure was detected. My KDS recall serviced 11/27/2021, approximately 78,000-79,000 miles. Shop never mentioned and concerns with my car while it was there. Engine failed just over 80,000 miles.",
        "vin": "KM8JUCAC3DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443804,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My rear passenger door will not open from inside or outside.  Safety issue",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443006,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear Passenger door latch does not open from interior and/or from exterior. Just suddenly happened, no minor malfunction neither signal.  This is a safety risk because the passenger in danger need to open the door to escape the vehicle.",
        "vin": "km8jucac2du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The whole engine shut down as I was going 70 mph on an interstate. At that time both the oil light and battery light came on. Once I pulled over, I could smell burning wires and a haze of smoke started coming in through the front air vents. The SUV was towed first to my mechanic then to the Hyundai service center who said this was a recall defect and they would look into it.   At the time of the failure, I was out of cell tower range, but able to make a 911 call from the side of the 4 lane interstate. I was able to put on my hazard lights. I received a ride home from a state trooper. The car had regular oil changes, tire rotations, and normal inspections. Nothing out of the ordinary; no concerns about the engine. No warning lights came on prior to the shut down. It was 100% out of the blue.    The Hyundai service center has now informed me the 2013 Hyundai Tucson has an “open campaign” recall on it (#966). They have extended coverage to repair/replace any engine under150,000 miles. My Tucson has 125,197 miles on it, but because I did not see their recall flyer in the mail, this service center is refusing to cover the expense of replacing the engine. Instead, they are asking me to foot the bill to the tune of $12,000.00.  This is not an expired recall and a know issue by Hyundai.",
        "vin": "Km8jucacxdu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440082,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving at 70mph on the highway when the failure occurred. The engine began making a very loud knocking noise and I was thankfully able to safely pull over before the car completely shut down. No check engine or oil lamps turned on and there were no signs that the engine was failing. It just all of a sudden started knocking while driving on the highway and I was lucky to get to the side of the road without causing an accident or being stuck in the middle of the highway with a broken engine. Checked the oil and found metal shavings on the dipstick so I called a tow truck to have the vehicle towed to the dealership that last serviced it. The dealership initially kept telling me it was upper engine noise until I pushed them to actually tell me which part failed. They then finally admitted that it was one of the engine bearings. This failure was also 2 months after that same dealership had pulled the oil pan off and replaced the gasket and oil pressure sensor for an active recall.  This seems to be a VERY common problem for this 2.4theta engine from Hyundai. Hyundai is refusing to warranty the engine and wants $9600 to replace the engine that failed and left me stranded on the highway 2hrs away from home. The vehicle has now been at the same dealership for over 2 months while I fight with Hyundai's warranty and customer service dept who keep denying my claim that the engine is defective and should be warrantied. While my car has been at this same dealership they have preformed another NEW active recall for programming the knock sensor to sense bearing failures on these engines. THIS NEW RECALL WORK WAS DONE WITHOUT MY CONSENT AND I DID NOT SIGN OFF ON THEM PREFORMING THIS WORK BECAUSE THE ENGINE HAS ALREADY HAD A BEARING FAILURE!!!",
        "vin": "km8jucacxdu"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438384,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Hyundai Tucson. The contact stated that the rear driver’s side door would not open from either the inside or the outside of the vehicle without warning. The contact also stated that the trunk latch had once failed to open as needed without warning. The contact had taken the vehicle to a dealer to service a recall and was given an estimate to repair the door. The manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was approximately 69,000.",
        "vin": "km8ju3ac0du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434602,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving on the highway at 74 mph when the engine started knocking and smelled of smoke, no other warning symptoms and all routine maintenance have been performed timely, in fact on-time pul change was performed the day before. I safely exited the highway and when I came to a complete stop at the end of the off ramp the oil, engine _ battery light came on and engine died. I checked the oil - it was clean and full. Had to get towed to a shop. They said the rod in the 4th cylinder is the culprit and requires a new engine ($7,500). I've called the Hyundai dealer and am waiting to hear back. Cars mileage is 139k and otherwise in excellent condition.",
        "vin": "Km8jucac8du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434438,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I have Only 113186 miles on my Tucson.I started hearing  a engine knock while driving the vehicle and then the vehicle started stalling out.The next day I took it to my mechanic.He tested everything then he drained my oil and found metal shavings from the rod bearing and told me the engine was no good.I changed the oil at regular intervals.I found out they have a recall on the 2017-2018 Tucson's with bad bearing issues.The engine is the same as mine the 2.0",
        "vin": "Km8ju3ac8du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432630,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request? Engine failure while operating vehicle How was your safety or the safety of others put at risk? My wife, 2 children and myself were on a busy interstate and immediately lost all power from the engine, unable to accelerate. Had to navigate other vehicles to reach the shoulder where we were stranded for at least an hour. Has the problem been reproduced or confirmed by a dealer or independent service center? The independent service center immediately cited well known issues with this specific 2.4L engine and recommended we go to the dealer. Awaiting the dealers feedback at this time. Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Not at this time Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? No; the vehicle was well maintained. The oil/fluid levels were appropriate before the start of the trip. No warning lamps or the like were present prior to the incident. No symptoms evident prior to the incident.",
        "vin": "KM8JU3AC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431189,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Daughter was driving up a mountain pass. Suddenly engine emitted a puff of smoke and she pulled over. Car failed to start after. Noticed oil all over ground. Towed 100 miles over pass into Denver. Mechanic said it was engine failure with a hole blown in the engine. Mileage was only 90K. Well maintained. Insurance wouldn't cover and mechanic advised not to fix because it would require a complete engine overhaul for $6000.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/29/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431266,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Hyundai Tucson. The contact stated that the vehicle engine failed. When driving with the cruise control set at 70 mph, the engine emitted a loud knocking sound and the vehicle decelerated. The vehicle powered off and the vehicle rolled onto the road shoulder.  The contact was able to open the hood and smoke emitted from under the hood and emitted an engine oil burnt odor. The vehicle was not towed to a dealer or mechanic to have a diagnostic performed. The vehicle was not repaired. The manufacturer was not contacted.  The failure mileage was 65,000.",
        "vin": "km8ju3ac0du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430697,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My 81 year old Mother was driving the vehicle when it just stopped on her on a busy intersection and a tow company and police had to be called.   The tow company tried to jump the car and it did not work.  The mechanic said that the engine is shot and it only has 124k miles and has been well taken care of and all recalls have been addressed.   This is a hazardous and dangerous issue that could have ended badly.  I contacted the Hyundai dealer that did my recall to check it and they do not have any appointments until 09-15-2021 which is 3 weeks away.  I do not understand how a vehicle that has regular maintenance has the engine just go with no prior warning.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426741,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Without warning it lost acceleration while driving on the interstate going 80mph. Barely had time to make it to the shoulder as all the panel lights came on and then total power loss. Couldnt even power the emergency flasher  lights. When roadside assistance showed up 4 hours later and got it restarted the engine had a loud clanking sound. Vehicle had to be towed from the side of the interstate. Shop is saying rod and bearing have failed and engine is a total loss.  This same year model of the Santa Fe has been recalled for this EXACT PROBLEM!",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We were taking a family trip to Disney, after an hour and a half trip on the turnpike. we arrived at the park. As we started to depart from the car, the rear passenger side door would not open. The door unlocked but when trying to open the door it wouldn't open. There was no warning that there was any problem, it worked fine when we left for the park but it was broken when we arrived. I would consider this a very serious problem. If we had got into an accident something could have seriously gone wrong, the child wouldn't have been able to evacuate the car because the door wouldn't open.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425601,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on highway 65miles an hour plus, car started making horrible knocking/banging sound.  No lights or indicators had went off.  I pulled off highway and car just stopped and died.  From full speed.  Had I not pulled off the highway or was unable to get over it would have stopped without warning and someone could have hit me.  I towed the vehicle straight to Hyundai.  They told me it was internal engine failure in the lower bearing system.  They recommended a full engine replacement.   No warning lights.  Car was maintained with ALL suggested maintenance and oil changes.  My particular car is not under recall however this issue in the 2013 Hyundai happens too frequently for it to be a coincidence.  In a well maintained car.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425698,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2.4 Theta-II engine failed at 95k miles. The engine is the same engine recalled on the santa fe and sonata and dealer does not want to replace.",
        "vin": "km8ju3ac1du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423152,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunday june 20th 2021 My husband and Son were driving down the highway at 70mph (speed limit) suddenly and without warning the car died. He was unable to steer, with his defensive driving training he was able to veer to the side of the road. The engine oil and Battery indicator flashed AFTER  he was pulled over to the side of the road.  If it wasn't for my husbands training he would have had ZERO abilities to pull the car over. He is a truck driver and this incident scared him. The semi truck behind him almost slammed into him and the car coming twards him.  He was worried about the safety of our family as well as everyone on the road. They were in an isolated location with no cell service. He and my son had to walk 5 miles in the 110° heat to call for help.  I towed the car to a mechanic who looked at it. He said the oil pan was leaking from the seal. He dropped the pan to look at the damage, he instructed me to call Hyundai after learning there was a recall for that issue.",
        "vin": "Km8jucac9du"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Hyundai Tucson. The contact stated while driving at an undisclosed speed, there was an abnormal sound before the vehicle stalled. The vehicle was towed to the contact's residence and diagnosed by an independent mechanic as engine failure. The contact was informed that the engine needed to be replaced. The vehicle was towed to the dealer and the contact was informed that the vehicle was no longer under warranty. The vehicle was not repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 207,000.",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420975,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving vehicle, engine started knocking, noises got louder, engine stalled, caused 360 in the highway, was able to come to a stop on side of road.  Inspected by mechanic, noted as engine failure, if vehicle would not have been stopped, would have caused fire in engine.",
        "vin": "km8ju3acxdu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420630,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on the highway at approximately 65 mph. Suddenly heard a knocking sound from the engine. Accelerator lost any power and could not drive. Check engine light, oil light came on. Had to pull off the side of major interstate without any forward power.",
        "vin": "KM8JUCACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on I-15 in a 80 MPH road in holiday traffic, when suddenly my engine just shut off. I was lucky to squeeze through 2 diesels and onto the shoulder. I only had about 1 foot between my vehicle and passing vehicles. I had my daughter in the car and we were lucky to not have been in a major accident.  I tried to restart the Tuscon and it shook and made a horrible banging / pounding sound but didnt turn over. It was towed to Goodyear in Cedar City. They stated it was an engine failure. I contacted Hyundai and they told me I had to get it to a Hyundai dealership. It was towed to Findlay Hyundai in St. George Utah where they confirmed the engine had failed. It only has 106K miles. There was no warning, no indication of issues. I had kept up on maintenance and never had any issues with the vehicle during my time owning it. I am not being compensated in any way. I had someone else pick us up and continued home. I do not have any documentation from the dealership or Goodyear since I was on my way home from vacation.",
        "vin": "KM8JU3AC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/17/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418907,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Recall 181 - failure to complete repairs (defective oil pan seal/switch) as requested by owners, that resulted in a catastrophic, high speed stall, loss of control and engine failure.  On Mon May 17, 2021 at 4pm EST our 23 year old daughter and 3 of her college graduate girlfriends were driving from Atlanta to Charleston, SC (65-70 mph) on Hwy I-26 when suddenly & without warning her 2013 Hyundai Tucson engine started knocking, smoking and ultimately exploded throwing a piston through the engine block creating a huge hole and completely seizing up.  She couldn't see due to the intense smoke, lost control of the car but thankfully was able to steer it to the roadside.   As the girls struggled to get out they saw fire underneath the car and highway shoulder.  They called 911. By the time the fire dept arrived, the fire had diminished but not before terrifying the 4 girls that the gas tank might explode.   Our daughter & friends were completely frantic stranded on the side of a major hwy.  After approx 1 1/2 hours, a County Sheriff drove by and stopped to assist.  He took them to the next exit to wait for the tow truck.  The vehicle was towed to Hyundai of North Charleston and inspected discovering a large gaping hole in the engine block.  We had to pay $599 to have the car shipped back to Atlanta on Mon May 25th.   On Thurs May 27, 2021, we went to Rick Case Hyundai in Roswell, GA and met with the GM.  It was his service center involved in our attempts on Jan 6, 2021 to get the car repaired as per Hyundai Recall 181 instructions.  We were told their was a national shortage of parts, received only an oil change and left driving a totally unsafe car which ultimately could have resulted in serious injuries or even loss of life to 4 young women.  The dealership should not have allowed the car to be driven and a loaner car provided until repairs completed. The 2013 Tucson is available for inspection upon request as it is a nonrunning, engine completely totaled, vehicle.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/01/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416607,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM DINNER ON MAY 1, 2021 ON US HIGHWAY 75 TRAVELING NORTH MY CHECK OIL LIGHT CAME ON AND THEN MOMENTS LATER THE ENGINE LIGHT CAME ON AND THE BATTERY LIGHT CAME ON , ALL LIGHTS WERE FLASHING IN MY DASHBOARD I PULLED OVER AND WITHIN SECONDS MY CAR WAS ENGULFED IN FLAMES. I ESCAPED WITH MY LIFE!",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED WHILE DRIVING 70 MPH, THE VEHICLE STALLED. THE VEHICLE FAILED TO RESTART AND WAS TOWED FROM THE SCENE BY AAA. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE CONTACT REFERENCED AN UNKNOWN RECALL AS THE CAUSE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,563.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413442,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WERE INOPERABLE AT TIME. CALIPER WAS LEAKING AND CAUSE OF THE PROBLEM. REAR DRIVER'S SIDE CALIPER REPLACED. BRAKES STILL HAVING PRESSURING ISSUE WITH THE PEDAL. TAKEN TO A REPAIR SHOP WERE IT IS DEEMED THE BRAKE MASTER CYLINDER NEEDS REPLACED. SUV HAS 65,000 MILES.",
        "vin": "KM8JUCAC9DU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/10/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407201,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT HIGH SPEED OF 55 MPH AND EXPERIENCED A HIGH-SPEED STALL ON MY 2013 HYUNDAI TUSCON. I HEARD A KNOCKING SOUND AND THEN ALL MY LIGHTS CAME ON (OIL,ENGINE,ETC.).  I WAS SO SCARED AND MADE IT TO THE SHOULDER SAFELY. THANK GOD. I TRIED TO START THE CAR BUT IT WOULDN'T START. I ALSO, SAW SMOKE SO I DIDN'T KNOW WHAT WAS HAPPENING. SO I WAS STRANDED ON THE HIGHWAY AND CALLED A TOW TRUCK AND THEY TOWED ME TO THE MECHANICS SHOP IN MY TOWN. THE MECHANIC STATED TO ME THAT THERE IS OIL LEAKING UNDERNEATH AND THAT MY ENGINE IS SHOT! I HAVE ALWAYS TAKEN VERY CARE OF MY VEHICLE, I STILL HAVE TWO YEARS OF CAR PAYMENTS ON IT! HE SAID IT LOOKS LIKE A ROD BROKE AND THERE IS A HOLE IN MY ENGINE! ALSO, SOME KIND OF METAL DEBRIS IN MY OIL. SO GLAD I AM SAFE AND MY 9 YEAR OLD DAUGHTER IS SAFE. I AM SO UPSET. VERY SCARY SITUATION. STAY SAFE WITH THESE VEHICLES EVERYONE. NOT GOOD...",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406763,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR WILL NOT OPEN FROM OUTSIDE. ONLY OPENS FROM INSIDE",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403149,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STARTED MAKING LOTS OF BLUE SMOKE AND STRANGE NOISE. NO WARNING LIGHT. TOOK TO MECHANIC SHOP WHO SAID THIS WAS PROBABLY DUE TO HYUNDAI RECALL. TOOK TO DEALER ON FRI 3/12/2021 WHO BOOKED IT IN. GOING FOR SHORT TRIP TO SHOPS ON SAT 3/13 LOTS OF BLUE SMOKE, ENGINE SHUDDER AND WARNING LIGHT CAME ON - TOOK VEHICLE STRAIGHT HOME.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399985,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A RURAL ROAD AT ABOUT 45 MPH. I STARTED HEARING SCRATCHING NOISE FROM ENGINE. THE ENGINE STARTED LOSING POWER. I STOPPED MY CAR, CALLED AAA TO HAVE MY CAR TOWED TO WILE HYUNDAI. THE DEALER SERVICE DEPARTMENT SAID MY ENGINE HAS TO BE REPLACED, THE CAR IS UNDER MANUFACTURER WARRANTY, BUT THEY NEED AN APPROVAL FROM HYUNDAI MOTORS USA TO GET A NEW ENGINE. ONE WEEK AGO I CONTACTED HYUNDAI CUSTOMER SERVICE TO CHECK THE STATUS OF MY CASE. I WAS TOLD I WOULD BE CONTACTED WITHIN 3-4 BUSINESS DAY BY FRIDAY, MAR 5, 2021. AS NOBODY CALLED ME, I CONTACTED CUSTOMER SERVICE AGAIN TODAY, MAR 9, 2021, AND THE RESPONSE I RECEIVED IS THE SAME, I WAS TOLD I WOULD BE CONTACTED WITHIN 4-5 BUSINESS DAY.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "01/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 HYUNDAI TUSCON THAT IS MY PRIMARY CAR. I WAS DRIVING ON A RURAL ROAD GOING MAYBE 45 MPH TOPS AND MY ENGINE AND OIL LIGHT CAME ON AND WHEN RIGHT BACK OFF. THEY DID NOT STAY ON BUT IT SEEMED MY VEHICLE WAS LOSING POWER. AS I PULLED UP TO A STOP SIGN, MY CAR JUST SHUT OFF. A FEW DAYS LATER I NOTICED A KNOCK UNDER THE HOOD. I TOOK MY VEHICLE TO THE DEALERSHIP AND WAS TOLD MY MOTOR NEEDED REPLACED. THEY CHANGED THE OIL AND IT WAS ONLY TURNED ON TO BE MOVED AT THE DEALERSHIP SO IT COULD BE TOWED HOME. MY WARRANTY IS REFUSING TO PAY TO REPLACE MY MOTOR AND I WASN'T GOING TO HAVE IT SIT IN A PARKING LOT MILES AWAY FROM MY HOUSE. WHEN THE VEHICLE WAS BACK IN MY POSSESSION, I CHECKED THE OIL DIP STICK AND IT WAS GLITTERY. THIS TELLS ME THAT SOMETHING INTERNALLY IS WRONG DUE TO METAL SHAVINGS IN MY OIL. AFTER DOING RESEARCH ON MY VEHICLE, I'VE COME TO FIND MANY COMPLAINS HAVE BEEN FILED AGAINST HYUNDAI 2.4L MOTORS.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS STALLED MULTIPLE TIMES AND HAVE TAKEN IT TO THE MECHANIC MULTIPLE TIMES.  EVERY TIME THE MECHANIC COULD NOT FIGURE OUT THE ISSUE.  SO THIS FINAL TIME TOOK IT TO SOMEONE ELSE AND WAS TOLD THERE IS METAL  SHAVINGS FROM THE ENGINE AND THE ENGINE WILL NEED TO BE REPLACED.  THE ENGINE HAS LESS THAN 115000.00 MILES ON IT.  ALL OIL CHANGES HAVE BEEN DONE AND MAITENANCE HAS BEEN KEPT ON THIS VEHICHLE.  I HAVE RESEARCHED AND SEE THIS ENGINE IS THE SAME ENGINE THAT WAS PLACED IN OTHER HYUNDAI'S AND KIAS.  THIS ENGINE SHOULD ALSO BE PART OF THAT RECALL!!!",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394769,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT HIGHWAY SPEED, CAR WAS DRIVING FINE, WHEN SUDDENLY THE ENGINE BEGAN TO MAKE TAPPING NOISE, WHICH PROGRESSIVELY GOT LOUDER WITHIN SECONDS, AND THEN COMPLETELY LOST POWER. I COASTED TO THE SHOULDER OF THE ROAD, AND OPENED THE HOOD TO LOOK FOR ANY OBVIOUS SIGN OF TROUBLE. I FOUND NOTHING UNUSUAL. I CALLED A TOW TRUCK AND THE CAR WAS TAKEN TO MY LOCAL MECHANIC. I GOT A CALL INFORMING ME THAT THERE WERE METAL SHAVINGS ON THE DIPSTICK, AND THAT HE WANTED TO DROP THE OIL PAN. I TOLD HIM NOT TO , BECAUSE I WAS AWARE OF A RECALL ON OTHER HYUNDAI'S, THAT WERE HAVING THE SAME TYPE OF ENGINE FAILURE. THE OIL PAN BOLTS APPEAR TO HAVE NEVER BEEN REMOVED IN THE PAST, DESPITE AN  NHTSA  RECALL THAT INSTRUCTED HYUNDAI TECHNICIANS TO REMOVE THE PAN, REPLACE THE GASKET, AND THE OIL PRESSURE SENSOR. DESPITE THE NHTSA WEBSITE INDICATING THAT MY CAR HAS  ALREADY BEEN EXAMINED FOR THIS ISSUE, THE PAN APPEARS TO HAVE NEVER BEEN REMOVED FROM THE CAR.",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387284,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR UP IN WYOMING ON I-80 THE DAY BEFORE I GOT MY SCHEDULE OIL CHANGE. MY CAR ALL OF A SUDDEN MADE A LOUD BANGING NOISE ON THE ENGINE AND DIED. THERE WAS NO CHECK ENGINE LIGHTS NO LIGHTS WHATSOEVER THE CAR HAS BEEN RUNNING GREAT. UP UNTIL THIS MOMENT NOTHING WAS WRONG WITH MY CAR I MANAGED TO GET IT TO A MECHANIC AND HE SAID THE ENGINES WAS FRIED. THIS IS DEFINITELY A MANUFACTURER'S DEFECT, ACROSS-THE-BOARD THERE'S SO MANY PEOPLE WITH THIS CAR COMPLAINING OF THE SAME PROBLEM. NOW I NEED A NEW ENGINE. THEY HAVE RECALLS ON JUST ABOUT EVERY OTHER MODEL EXCEPT THIS ONE WHICH I THINK IS WRONG CUZ IT'S THE SAME THING HAPPENING.",
        "vin": "KM8JUCAC6DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385796,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY 2010S HYUNDAIS HAVE AN ISSUE WITH DOORS GETTING STUCK CLOSED ON THEIR OWN WITHOUT ANY KNOWN CAUSE. THIS IS A SERIOUS SAFETY ISSUE AND HYUNDAI IS CHARGING $1000+ TO FIX IT. HERE IS A LINK WITH MANY OTHER OWNERS EXPERIENCING THE SAME ISSUE. HTTPS://WWW.HYUNDAI-FORUMS.COM/THREADS/REAR-PASSENGER-DOOR-WONT-OPEN.603329/    THIS ISSUE COULD VERY EASILY TRAP A PASSENGER IN THE VEHICLE",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383394,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE ENGINE FAILURE VERIFIED BY MY MECHANIC. RECENT RECALL OF THE HYUNDAI MODELS DID NOT INCLUDE THE TUCSON AND IT SHOULD HAVE. I FEEL THIS ISSUE NEEDS TO BE CONSIDERED SINCE IT LOOKS LIKE I'M SEVERAL OF MANY OUT THERE WITH THE SAME PROBLEM AS THE CURRENT CLASS ACTION SUIT AGAINST HYUNDAI. THE TUCSON SHOULD BE INCLUDED. DATE OF MALFUNCTION 12/12/2020. JUST DRIVING DOWN A COUNTRY ROAD AND HEARD A POP NOISE AND THAT WAS IT. HAD IT TOWED.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378228,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED WHILE DRIVING 75 MPH, THE VEHICLE THE SEIZED WITHOUT WARNING. THE CONTACT PARKED ON THE SIDE OF THE ROAD. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO HER RESIDENCE. THE CONTACT STATED THAT THE BATTERY WAS REPLACED HOWEVER, THE VEHICLE FAILED TO START. THE CONTACT CALLED COCONUT CREEK HYUNDAI (4960 N STATE RD 7, COCONUT CREEK, FL 33073; (888) 441-7737) AND THE DEALER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACE. THE VEHICLE WAS REPAIRED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375896,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE LOST POWER AND STARTED TO KNOCK. CONTACTED HYUNDAI USA TO BE TOLD TO BRING MY CAR IN FOR A DIAGNOSIS. I HAD MY CAR TOWED TO THE DEALERSHIP(ADVANTAGE HYUNDAI). THEY CALLED TO TELL ME \"WHY IS MY CAR THERE\"?? IN UTTER SHOCK I MENTIONED THAT I HAD CALLED THE DEALERSHIP TO ARRANGE FOR ARRIVAL AND HAVE IT DIAGNOSED. THEN WAS MENTIONED A FEE, WHICH WASN'T MENTIONED FROM ANYONE PRIOR TO HAVING MY CAR TOWED. I HAD UPDATED MY REF # FROM HYUNDAI USA ONLY TO SPEAK WITH SOMEONE TELLING ME THAT BECAUSE THE CAR IS OUT OF WARRANTY HE CANT HELP. WHY DID IT TAKE OPENING A CASE WITH HYUNDAI, UPDATING THE CASE WITH INFO, HAVING MY CAR TOWED TO THE DEALERSHIP(SUGGESTED BY HYUNDAI USA) TO BE TOLD THERE NOTHING THEY CAN DO??  MY CAR IS IN GREAT SHAPE WITH 81K. WHY ARE THESE ENGINES FAILING?? AND WHY ARE THE CONSUMERS VICTIMS TO INFERIOR PRODUCT?? BTW HYUNDAI CONSUMER AFFAIRS DON\"T HELP THE CONSUMER. IT'S MORE OF HYUNDAI EXPLAINING THERE WARRANTY.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375663,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/20/20, LEAVING THE PARKING GARAGE AT MY PLACE OF EMPLOYMENT I THOUGHT I HEARD A NOISE COMING FROM THE VEHICLE, BUT AS I ROLLED DOWN THE WINDOW TO LISTEN, I DIDN'T HEAR ANYTHING.  I CHECKED THE DASH FOR WARNING LIGHTS; THERE WERE NONE.  THE TEMPERATURE WAS ALSO NORMAL, SO I CONTINUED HOME.  ABOUT 10 MIN. LATER, DRIVING SOUTH ON I-5 WHILE IN THE FAR LEFT LANE AT 70 MPH, MY 2013 HYUNDAI TUCSON LIMITED EXPERIENCED A MAJOR ENGINE FAILURE, MANIFESTING WITH A TERRIBLE METAL CRASHING SOUND AND SHAKING.  I HAD TO IMMEDIATELY CROSS TWO LANES OF HEAVY TRAFFIC, HAZARDS FLASH, TAKING THE EXIT THAT WAS FORTUNATELY RIGHT THERE ON THE IMMEDIATE RIGHT.  I WOULD NOT HAVE MADE IT TO THE NEXT EXIT 1 MILE AWAY.  BY THE TIME I REACHED THE END OF THE RAMP AND PULLED INTO THE EMERGENCY PARKING, THE ENGINE WAS BARELY SPUTTERING, THE CAR BARELY ROLLING. NEXT DAY, UPON INSPECTION BY THE DEALER, THEY SAID METAL DEBRIS WAS FOUND IN THE ENGINE, SAME BEARING ISSUE AS THE OTHER ENGINE FAILURES THAT WERE RECALLED EARLIER (SANTA FE MODELS, SONATAS, ELANTRAS, AND OTHER TUCSONS).  MY MODEL AND TRIM PACKAGE ISN'T PART OF THE RECALL YET. ONE MONTH PRIOR, THE DEALER HAD DONE A SAFETY INSPECTION AND $1,000 OF WORK REPLACING THE DRIVE BELT, HOSES, AND THERMOSTAT GASKET SO THAT I WOULDN'T LOSE THE ENGINE, AS I WAS TOLD BACK THEN. SINCE I STILL LOST THE ENGINE ONLY ONE MONTH LATER AND WITHOUT ANY WARNING AND BECAUSE MY MILEAGE WAS OVER WARRANTY AT APPROX134K, THE DEALERSHIP SUBMITTED A REQUEST TO HYUNDAI FOR GOODWILL AND RENTAL CAR ASSISTANCE ON MY BEHALF. THE MANUFACTURER AGREED TO PAY 75% AND PROVIDE RENTAL CAR ASSISTANCE IF PARTS WERE ON NATIONAL BACK ORDER. IT WAS 3 WEEKS TO ORDER PARTS AND COMPLETE REPAIRS. NO RENTAL CAR ASSISTANCE. I PICK UP THE CAR TODAY. MY PORTION OF THE COST IS MORE THAN $2200.  IF THE 2013 TUCSON LIMITED IS ADDED TO THE RECALL LIST, WILL I BE ELIGIBLE FOR REIMBURSEMENT?",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361569,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE VEHICLE JERKED WITH AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT PULLED OVER AND HAD THE VEHICLE TOWED BACK TO HER RESIDENCE. THE VEHICLE WAS LATER TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT OIL PAN DISINTEGRATED AND CAUSED SEVERE DAMAGES TO THE ENGINE. THE CONTACT STATED THAT THE OIL PAN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING) AND WAS REPAIRED ON SEPTEMBER 27, 2019 AT SOUTH SHORE HYUNDAI (360 W. SUNRISE HIGHWAY, VALLEY STREAM, NY 11581, (516) 561-8772). THE CONTACT STATED THAT THE DEALER WAS CONTACTED AND RUDELY DISMISSED THE CONTACT'S CONCERNS AND DENIED THE RECALL REPAIR. THE CONTACT KEPT PRINT OUTS FOR THE COMPLETED RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 70,083.",
        "vin": "KM8JUCAC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361263,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 HYUNDAI TUCSON WITH THETA ENGINE. MOTOR HAS FROZEN AND ALTHOUGH MANY OTHER THETA ENGINES SIMILAR IN VIN # HAVE BEEN REPAIRED UNDER A CLASS ACTION SUIT/ OR RECALL, HYUNDAI IS REFUSING TO REPLACE MINE. OIL CHANGE RECEIPTS HAVE BEEN PROVIDED. DRIVING ON A HWY AND MOTOR FROZE",
        "vin": "KM8JT3ABXDU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361041,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC WINDOW SWITCHES HAVE QUIT WORKING ON THE PASSENGER SIDE FRONT AND BACK DOORS AND THE DRIVER SIDE PASSENGER WINDOW ONLY ROLLS DOWN AND HAS TO BE ROLLED UP BY THE DRIVER PANEL. THE VEHICLE WAS NOT IN MOTION SITTING IN MY DRIVEWAY",
        "vin": "KM8JU3AC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352387,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": ". DEALER STATES ENGINE NEEDS REPLACEMENT BUT IS OUT OF WARRANTY SO DEALER DENIES COVERAGE. DEALER SAID BEARING ON BIG END OF PISTON RODS AND/OR MAIN BEARING DAMAGED, I HAVE ALL RECORDS OF OIL CHANGES EVERY 3-4K FROM REPUTABLE MAINTENANCE BUSINESS.  I SEE OTHER COMPLAINTS OF SIMILAR ISSUE WITH MOTORS. ENGINE STARTS TAPPING UNDER LOAD AND ENGINE STOPS AT HIGHWAY SPEED OR WHEN AT OPERATING TEMPERATURE. WHEN THE MOTOR COOLS IT WILL REPEAT PROBLEM. VEHICLE TO DANGEROUS TO DRIVE EXCEPT ON BACK ROADS WITH ENOUGH ROOM ON SHOLDER TO PULL OVER UNEXPECTEDLY.",
        "vin": "KM8JT3AB0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351611,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-75 IN BROWARD COUNTY AND I DECIDED TO PASS A VEHICLE IN FRONT OF ME, WHEN I ACCELERATED, THE CAR MADE A VERY STRANGE SOUND AND STARTED TO LOOSE POWER... IT STARTED TO SLOWING DOWN BY IT SELF, SO I DECIDED TO GET OUT FROM I-75, LUCKILY WE WERE CLOSE TO ONE REST AREA WHERE WE COULD PARK AND CALL SOMEONE FOR HELP. BEFORE CALLING ANYONE, WE TRY EVERYTHING ON THE CAR. MY BROTHER-IN-LAW CHECKED THE BATTERY, WHICH WAS GOOD, THE ELECTRICAL WAS WORKING FINE FOR FEW MORE MINUTES AND STARTED TO SHUT DOWN SLOWLY. EVERYBODY SAID THAT WAS VERY STRANGE...THEY SAID MY CAR WAS NOT SUPPOSE TO BE IN THAT SITUATION. IT IS WITH 70,000 MILES, IN AN EXCELLENT CONDITION AND THE MAINTENANCE IS UP TO DATE. I CALLED THE TOWING TRUCK FOR PICK UP AND PARKED IT ON MY COUSIN DRIVEWAY WHERE IS TILL TODAY.  NOW, I DON'T KNOW WHAT TO DO. IT WILL BE EXPENSIVE TO FIX IT, AND I DON'T HAVE THE MONEY. I DIDN'T RECEIVED ANY RECALL FOR \"ENGINE FAILURE\" ON THIS SPECIFIC CAR, ALL THOUGH I FOUND ON THE INTERNET A LOT OF COMPLAINTS WITH THE SAME PROBLEM ON SAME YEAR AND MODEL.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349352,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2013 HYUNDAI TUCSON ON 11/2012. WITHIN 2 YRS OF BUYING THE CAR I STARTED TO HEAR A KNOCKING SOUND  FROM THE FRONT OF THE CAR, LOSS OF POWER AND IT FELT LIKE IT WAS GOING TO SHUT DOWN.I WOULD STOP AND THEN PUSH THE GAS TO GO AND IT WAS FINE. THIS CONTINUED TO HAPPEN INTERMITTANTLY EVER SINCE I HAVE CONTINUED OVER THE YRS TELLING THE SERVICE DEPARTMENT OF THE ISSUE BUT THEY COULD NEVER REPLICATE THE PROBLEM.THEY TRIED A FEW THINGS LIKE A COMPUTER UPDATE/REBOOT.THE ISSUE WAS A LITTLE LESS FREQUENT BUT IT STILL CONTINUED. OVER THE YEARS SEVERAL FAMILY MEMBERS WITNESSED THIS AND WERE VERY CONCERNED! RECENTLY 08/7/2020 WE WERE DRIVING INTERSTATE 70 IN MD, CONSIDERABLE TRAFFIC, AND NUMEROUS TRACTOR TRAILORS ALL TRAVELING AT HIGH SPEEDS! ALL OF A SUDDEN THERE WAS A CONSISTANT KNOCKING SOUND EVEN MORE INTENSE THAN THE ONES I HAD HEARD OVER THE YEARS SINCE BUYING THE CAR.THE FRONT OF THE CAR WAS SHACKING AND LOOSING POWER! MY HUSBAND WAS DRIVING IN THE LEFT LANE AND STRUGGLED TO GET IT TO THE SHOULDER WHERE THE ENGINE STILL MAKING THE LOUD KNOCKING SOUND COMPLETELY SHUT DOWN.THERE WAS A TRACTOR TRAILOR BEHIND US WHEN WE GOT TO THE RIGHT LANE AND IF IT HAD DIED THEN WE WOULD HAVE BEEN KILLED! STANDED FOR 40 MINUTES IN A DANGEROUS LOCATION! IT WAS TOWED TO A HYUNDAI DEALER IN HAGERSTOWN MD. WHEN THEY TRIED TO TURN IT ON THERE WAS SMOKE AND THEY WERE QUICK TO PREVENT IT FROM CATCHING FIRE. WE WERE TOLD IT EXPLODED, A BEARING BROKE OFF HIT THE PISTON CREATING A HOLE IN THE ENGINE AND THERE WERE METAL SHAVINGS IN OIL PAN. WE ARE THE ORIG OWNERS AND HAVE KEPT UP MAINTENANCE AT OUR DEALERSHIP, IT HAS 108K MILES ON IT, A COMPREHENSIVE EXT WARRENTEE BUT THEY WILL ONLY PUT IN A 77K MILES USED ENGINE.COULD HAVE THE SAME ISSUES AND MAY NOT BE SAFE. NUMEROUS COMPLAINTS WITH THE 2013 TUCSON 2.4L ENGINE.OTHER YRS THAT HAVE THE SAME ENGINE HAVE RECALS, INEXCUSABLE 2013 IS NOT INCLUDED!",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348908,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 25, 2020 I TOOK MY CAR TO JOHN AMATO TO HAVE A REPAIR DONE  BECAUSE OF THE ENGINE LIGHT WAS ON  THEY PLACED IT O  N THE MACHINE  FOR DIAGNOSTIC TESTING   AND STATED THAT IT WAS THE IN TAKE MANIFOLD FOR 421CRH 1  THEY REPLACE THE PART METAPHOR INTAKE MANIFOLD RUNNER PERFORM THEY REPLACE THE PART THEY SAID THE CAR WAS OK AUGUST EIGHTH 2020 MY CAR STOPPED RUNNING AS I WAS DRIVING DOWN THE STREET AND MADE A LOT OF NOISE . THERE WAS NO WARNING NO LIGHTS CAME ON THE CAR JUST STOPPED I HAD TO HAVE IT TOWED BY A TOW TRUCK AND NOW THE ENGINE IS COMPLETELY DONE NO ENGINE LIGHT CAME ON OR ANYTHING I THOUGHT THIS WAS A GOOD CAR WHEN I BOUGHT IT",
        "vin": "KM8JU3AC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342835,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO KNOW WHY THE 2013 HYUNDAI TUCSON WERE NOT IN THE RECALL FOR THE ENGINE FAILURE. COMPLAINTS ON ENGINE SEIZING UP IS THE SAME AS 2014 AND 2015 SAME ENGINE I WOULDN'T COMPLAIN BUT JUST HAPPEN TO ME 7/11/2020 DRIVING DOWN HIGHWAY ENGINE SEIZED UP AND LOOKS LIKE AM STUCK WITH IT JUST DOESN'T MAKE ANY SENSE TO SIT HERE AND THINK ABOUT I DON'T HAVE A VEHICLE AND WHAT HAPPENED WAS NO FAULT OF MINE ITS JUST CRAZY HOW NO ONE WILL TAKE RESPONSIBILITY AND FIX IT.",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341758,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING DOWN HIGHWAY VEHICLE MADE LOUD NOISE PULLED OVER AND TURNED VEHICLE OFF WAITED 10 TO 20 MINUTES TRIED TO START VEHICLE AND IT MADE LOUD NOISE AGAIN AND SHUT DOWN WOULD NOT STAY RUNNING.",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341760,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ADDING TO FIRST COMPLAINT VEHICLE WAS TOWED TO HYUNDAI DEALERSHIP WAS TOLD ENGINE SEIZED WAITING ON RESPONSE FOR HYUNDAI CORPORATION",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/19/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, SHE BEGAN TO HEAR A TICKING SOUND EMITTING FROM THE ENGINE WITHOUT WARNING. THE CONTACT EXITED THE VEHICLE AND CHECKED HER FLUIDS, ALL FLUID LEVELS WERE NORMAL. AS THE CONTACT CONTINUED TO DRIVE, THE VEHICLE STALLED AND SHUT OFF AS THE OIL AND THE BATTERY WARNING LIGHTS ILLUMINATED. AS THE CONTACT RESTARTED THE VEHICLE, WHITE SMOKE BEGAN TO EMIT FROM THE ENGINE. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED INITIALLY TO HOME.; THE NEXT DAY, SHE HAD THE VEHICLE TOWED TO JOHNSON HYUNDAI OF CARY (5000 OLD RALEIGH RD, CARY, NC 27511). SHE WAS INFORMED THAT HER ENGINE THREW A RODE CAUSING THE ENGINE TO MALFUNCTION, THE CONTACT WAS THEN INFORMED THAT SHE WOULD NEED AN ENGINE REPLACEMENT. THE MANUFACTURER HAD YET TO NOTIFIED OF THE FAILURE. THE VEHICLE HAD BEEN PLACED UNDER NHTSA RECALL NUMBER:19V063(ENGINE AND ENGINE COOLING); HOWEVER, THE DEALER HAD REFUSED TO SERVICE HER VEHICLE FOR THE RECALL. THE FAILURE MILEAGE WAS 185,000.",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331623,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS OPERATING NORMALLY WHEN ALL OF A SUDDEN THE ENGINE LOST POWER.  RPMS WENT TO 0. COULD NOT ACCELERATE ANYMORE AND HAD TO COAST OFF THE ROAD TO GET OUT OFF TRAFFIC.  VEHICLE TURNED OFF AND WOULD NOT RESTART. HYUNDAI DEALERSHIP SAYS THE VEHICLES ENGINE HAS LOCKED UP AND NEEDS TO BE REPLACED.  VEHICLE ONLY HAS 77946 MILES.  HAS HAD NO PREVIOUS PROBLEMS. JUST BOUGHT THE VEHICLE. WE HAVE ONLY HAD IT A WEEK AND HALF. CAR HAD TO BE TOWED BACK TO DEALERSHIP. THIS COULD HAVE CAUSED A SERIOUS OR DEADLY ACCIDENT IF THIS HAPPENED IN A BUSY HIGHWAY OR IN HEAVY TRAFFIC.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327929,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED WITH THE CHECK ENGINE AND OIL PRESSURE WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE RESIDENCE. THE CONTACT, AN INDEPENDENT MECHANIC, DIAGNOSED THE VEHICLE WITH A #3 PISTON CONNECTING ROD CYLINDER BOLT DETACHED WHICH CAUSED THE PISTON TO LOOSEN. THE CONTACT ALSO STATED THAT THERE WAS AN ENGINE OIL LEAK. THE VEHICLE WAS NOT REPAIRED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 88,000.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309707,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 13, 2017, THE ENGINE IN THE TUCSON COMPLETELY SHUT DOWN WHILE DRIVING DOWN THE INTERSTATE AT RUSH HOUR. THE VEHICLE WOULD NOT START AND HAD TO BE TOWED TO A LOCAL REPAIR SHOP. THE REPAIR SHOP INSPECTED THE VEHICLE AND FOUND THAT THE ENGINE HAD BLOWN A HOLE IN IT DUE TO NO FAULT OF THE OWNER AND WOULD NEED A COMPLETE REBUILD.   IN MY RESEARCH I CONTACTED BOTH VANDERGRIFF HYUNDAI AND HYUNDAI MOTORS AMERICA SINCE THE EVENT THAT CAUSED MY VEHICLE ENGINE TO BLOW WAS A MANUFACTURES DEFECT.  DURING MY RESEARCH I FOUND THAT THE ENGINE IN MY VEHICLE WAS THE SAME ENGINE PUT INTO SEVERAL MODELS OF HYUNDAI VEHICLES. THIS SPECIFIC ENGINE MODEL WAS ALSO INVOLVED IN A CLASS ACTION LAW SUIT REGARDING THE 2011-2013 HYUNDAI MODELS.  IN APRIL 2019 A RECALL OF THE OIL PAN AND SEAL WAS ISSUED.  THE VEHICLE RECALL REPLACEMENT WAS DONE AND A CLAIM FOR REIMBURSEMENT FOR THE ENGINE WAS SENT TO HYUNDAI.  ALL DOCUMENTS REQUESTED WERE FURNISHED AND AFTER 3 CASE MANAGERS WERE ASSIGNED I HAVE BEEN INFORMED THAT THE CLAIM HAS GONE TO UPPER MANAGEMENT A/K/A WAIT UNTIL THE STATUTE RUNS.  AS A CONSUMER I FEEL I HAVE BEEN GIVEN THE RUNAROUND AND STILL AM NOT REIMBURSED FOR AN ENGINE.  I NEED HELP!!!",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301174,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I FINANCED THIS VEHICLE ON 12/22/19, I STARTED TO NOTICE A LOUD TICKING NOISE COMING FROM THE ENGINE SHORTLY AFTER PURCHASE DATE. BROUGHT IT IN TO DEALERSHIP, WAS TOLD IT WAS A VACUUM LOOSE, THEY TIGHTENED IT AND SAID IT SHOULD BE GOOD. STILL HEARD THE TICKING JUST NOT AS LOUD. I STILL HAVE CONTINUED TO HEAR THE TICKING, BROUGHT IT IN TODAY AND WAS TOLD BY ONE PERSON WHO DIDNT ACTUALLY INSPECT THE VEHICLE THAT IT WAS A PURGE VALVE AND ITS NORMAL FOR THIS CAR AND AGE.. WAS TOLD BY THE MECHANIC AT THE HYUNDAI DEALERSHIP LOCATED ON OCALA FL, (AND WITH A STRAIGHT NO EMOTION FACE) \"THERE'S NO METAL TOUCHING\" ASKED TO BE PROVIDED PROOF THAT NOTHING CAME UP IN HIS COMPUTER, AND SAID THEY DIDNT HAVE THE CORRECT DIAGNOSING EQUIPMENT FOR THIS SPECIFIC CAR. SHOWED THE SALES MANAGER A VIDEO SO SHE COULD HEAR THE NOISE AND EVEN SHE SAID HERSELF THAT WAS NOT NORMAL. THEY DECIDED TO KEEP THE CAR OVERNIGHT. NOT SURE WHAT WILL COME FROM THIS AND DO NOT KNOW IF THIS IS RELATED BUT ACCORDING TO GOOGLE, THESE TUSCON'S ARE KNOWN FOR THE \"TICK OF DEATH\" WHICH MEANS SHORTLY AFTER, THE ENGINE FAILS...",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299515,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER REAR DOOR WILL NOT UNLOCK FROM INSIDE OR OUTSIDE THEREFORE THE DOOR WILL NOT OPEN MAKING IT A SAFETY HAZARD. NO ACCIDENT JUST QUIT WORKING ONE DAY. AFTER READING THE HYUNDAI FORUM I SEE THIS HAS HAPPENED TO QUITE A FEW PEOPLE AND FEEL THIS SHOULD BE TREATED AS A RECALL",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298182,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RETURNING TO THE DEALER FOR A RECALL NOTICE, 4 DAYS LATER TURNING INTO A FUELING STATION ENGINE STALLED AND SIEZED. VEHICLE NEVER HAD AN ISSUE PRIOR TO RECALL PERFORMANCE BEING COMPLETED. OH AND RECALL NOTICE STATED THE EXACT ISSUE IT WAS TO PREVENT ENGINE FROM STALLING AND SEIZING.  LUCKILY NO ONE WAS INJURED.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289686,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S SON-IN-LAW OWNS A 2013 HYUNDAI TUCSON. WHILE THE SON-IN-LAW WAS DRIVING APPROXIMATELY 70 MPH, THE VEHICLE BEGAN TO LOSE POWER AND OIL WAS LEAKING FROM THE ENGINE. THE CONTACT WAS UNAWARE IF ANY WARNING INDICATORS WERE ILLUMINATED PRIOR TO THE FAILURE. THE VEHICLE WAS TAKEN TO HYUNDAI OF GREELEY (4533 W 29TH ST, GREELEY, CO 80634, 970-330-3801) WHERE IT WAS DIAGNOSED AND THE ENGINE LEAK WAS REPAIRED. DAYS LATER, THE SAME FAILURES RECURRED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOTIFIED BY THE MECHANIC AND THE MECHANIC WAS INFORMED THAT THE VEHICLE WAS NOT UNDER WARRANTY AND THERE WERE NO ACTIVE RECALLS. THE CONTACT ASSOCIATED THE FAILURES WITH NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "11/03/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STALLED. WHEN I GOT IT RUNNING THE ENGINE IS MAKING A LOUD KNOCKING.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271800,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 30 MPH, NO INDICATION, NO SOUND/NOISE, THE ENGINE JUST STOPPED. TOWED CAR TO THE HYUNDAI DEALER AND WAS INFORMED THAT THE ENGINE SEIZED, THAT THEY WERE HAVING ISSUES WITH THESE ENGINES. ENGINE NEEDED TO BE REPLACE. WAITING FOR HYUNDAI'S DECISION TO SEE IF THEY WILL COVER THE REPLACEMENT.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "11/10/2016",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11270577,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I REAR ENDED A CAR INFRONT OF ME THAT HAD STOPPED ABRUPTLY, I WAS GOING ABOUT 30 MPH AND THE IMPACT WAS SO HARD I SLAMMED MY CHEST ON THE STEERING WHEEL, IT ENDED UP DOING 13,000 DOLLARS OF DAMAGE TO THE FRONT END BUT NOT ONE AIRBAG DEPLOYTED.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270340,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 3, 2019, I WAS DRIVING AND MY ENGINE STARTED MAKING A WEIRD NOISE AND WAS FLUTTERING, NOT ACCELERATING LIKE NORMAL.  I TURNED ONTO A SIDE STREET AND WAS PULLING OVER, MY CHECK ENGINE LIGHT CAME ON AND MY CAR STALLED AND WOULD NOT RESTART.  HAD THE CAR TOWED TO DEALERSHIP WHERE THE VEHICLE WAS PURCHASED AND THE ENGINE HAD SEIZED.  THE DEALERSHIP COULD NOT GIVE ME ONE REASON WHY THIS HAPPENED SINCE I REGULARLY GOT THE CAR SERVICED.  APPROXIMATELY, TWO HOURS PRIOR TO THE ENGINE SEIZING I HAD MY EMISSIONS AND INSPECTION PERFORMED AND THEY DID NOT PICK UP ANYTHING.  THIS VEHICLE HAD ABOUT 94,000 MILES.  NOW I AM STUCK WITH A BROKEN CAR THAT THE REPAIR COSTS AS MUCH AS THE VEHICLE BLUE BOOKS FOR, WHILE STILL OWING AROUND $15,000.  EVERYTHING THAT I HAD PURCHASED TO PROTECT MYSELF FROM THIS SITUATION HAS NOT PROTECTED ME AT ALL SUCH AS, THE EXTENDED WARRANTY, GAP INSURANCE, THE BANK WILL NOT EVEN DO A VOLUNTARY REPOSSESSION ON THE VEHICLE.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266751,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROPPED MY SON OFF AT SCHOOL AND WHEN I CAME BACK TO THE CAR TO PUT MY OTHER SON BACK IN THE THE REAR DRIVER SIDE DOOR WILL NOT OPEN AT ALL I HAVE TRIED UNLOCKING AND TRIED TO OPEN FROM INSIDE AND OUT IT JUST STOPPED OPENING ALL OF A SUDDEN",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266801,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED UP WITH VERY NOTICEABLE KNOCKING NOISE, THE ENGINE LIGHT WAS ON. IT WAS STILL TECHNICALLY DRIVEABLE, BUT HAD VERY SLOW ACCELERATION. STOPPED BY AUTOZONE TO HAVE THEM CHECK THE ENGINE CODE. I WAS TOLD THAT THE TWO CODES THAT CAME UP WERE RELATED TO NEEDING AN OIL CHANGE. THE FOLLOWING DAY, I STOPPED BY JIFFY LUBE TO HAVE THEM CHANGE THE OIL. THE TECH SHOWED ME A SAMPLE OF THE OIL THAT CAME OUT OF THE VEHICLE; IT LOOKED LIKE BLACK, SLUDGY COFFEE.  I KEEP UP WITH OIL CHANGES, MAKING SURE TO GO TO JIFFY SO THAT MY RECORDS ARE ACCESSIBLE.  I ALWAYS HAVE THEM USE SYNTHETIC WHEN I VISIT.  THE TECH TOLD ME THAT THE OIL HAD BEEN OVERFILLED THE LAST TIME IT WAS CHANGED. HE ALSO STATED THAT HE HAS NOTICED IN HYUNDAI VEHICLES THAT THE OIL ALWAYS TURNS BLACK, EVEN IF SYNTHETIC IS USED.  HE SAID THAT HE HEARD THE KNOCKING IN THE ENGINE WHEN THEY MOVED THR VEHICLE, AND THAT IT COULD BE THE LIFTERS.  AFTER THE OIL CHANGE, I GOT INTO THE VEHICLE AND SAW THAT THE ENGINE LIGHT WAS STILL ON, AND THE KNOCKING WAS STILL TAKING PLACE.  I DROVE ACROSS THE STREET TO CHRISTIAN BROTHERS TO HAVE THEM INSPECT THE VEHICLE.  THE SHOP HAD TO REMOVE THE FRONT PART OF THE ENGINE TO CHECK OUT THE ISSUE.  AFTER A FEW DAYS, I WAS INFORMED THAT THE ENGINE WOULD NEED TO BE REPLACED AS THERE WERE METAL SHAVINGS INSIDE OF THE OIL PAN. I BEGAN TO DO SOME RESEARCH AND FOUND THERE WAS AN UNOFFICIAL RECALL ON THE THETA II ENGINE (WHICH IS WHAT THIS VEHICLE HAS).  HYUNDAI WAS SLOWLY STARTING TO SEND NOTICES OUT TO PEOPLE.  I TOOK MY TUCSON TO A DEALERSHIP AND ASKED THEM TO CONTACT HYUNDAI TO BEGIN A CLAIM FOR AN ENGINE REPLACEMENT.  I WAS TOLD THE CLAIM WAS DENIED BECAUSE THE VEHICLE WAS NOT PART OF THE RECALL.  THIS IS A 2013 MODEL, AND I PURCHASED IT IN SEP/OCT OF 2016. THE ENGINE IN A 6 Y/O VEHICLE SHOULD NOT BE SHUTTING DOWN, ESPECIALLY IF MAINTENANCE WAS KEPT UP. NHTSA 19V063000",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265910,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE WHEN I NOTICED THAT WHEN I GOT OVER 3000RPM THERE WAS A KNOCKING SOUND COMING FROM THE CAR... I SLOWED DOWN AND IT STOPPED FOR A SHORT TIME BUT THEN CAME BACK REGARDLESS OF SPEED. THE KNOCKING SOUND QUICKLY GREW LOUDER SO I PULLED OVER TO THE SIDE OF THE ROAD AND TURNED THE CAR OFF. WHEN I TRIED TO RE-START THE CAR THE KNOCKING SOUND WAS PERSISTENT. I HAD IT TOWED TO A MECHANIC WHO SAID THE ENGINE NEEDED TO BE REPLACED THAT IT SEEMS TO HAVE THROWN A ROD. I KEPT UP WITH THE MAINTENANCE AND OIL CHANGES SO THERE WAS NO REASON FOR THIS TO HAPPEN AT ONLY 106K MILES. I HAVE BEEN TOLD FROM OTHER MECHANICS THEY SEE THIS QUITE FREQUENTLY IN THESE MODELS. THANKFULLY I WAS ABLE TO PULL OVER TO THE SIDE OF THE ROAD BUT I WAS LEFT STRANDED IN THE MIDDLE OF NOWHERE FOR OVER AN HOUR IN THE MIDDLE OF A HEAT WAVE WITH NO AC.",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/28/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265556,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 70 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED AND THERE WAS AN ABNORMAL NOISE COMING FROM THE ENGINE COMPARTMENT. ADDITIONALLY, THE CONTACT NOTICED SPARKS COMING FROM THE REAR PASSENGER SIDE OF THE VEHICLE. THE CONTACT WAS INFORMED BY ANOTHER MOTORIST THAT THE VEHICLE WAS ON FIRE. THE CONTACT ALSO NOTICED BLACK SMOKE COMING FROM THE ENGINE. THE CONTACT AND SEVERAL PASSENGERS IN THE VEHICLE WERE ABLE TO EXIT WITHOUT INJURIES. THE FIRE DEPARTMENT WAS CONTACTED AND EXTINGUISHED THE FIRE. A FIRE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE TOW TRUCK COMPANY'S LOT AND THEN TOWED BY THE INSURANCE COMPANY TO THEIR FACILITY. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CONTACT STATED THAT THE INSURANCE COMPANY HAD NOT DECLARED THE VEHICLE A TOTAL LOSS. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "08/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257450,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY AT ABOUT 75 MPH THE CAR SPONTANEOUSLY TURNED-OFF, FORTUNATELY, WE WERE ABLE TO GET OFF THE ROAD IN TIME.  WE WERE ABLE TO RESTART THE ENGINE BUT THEN ABOUT 20 MINUTES LATER IT STARTED MAKING A HORRIBLE GRINDING NOISE.  WE HAD TOWED TO A MECHANIC WHO TOLD US THE ENGINE HAD SEIZED-UP AND NEEDED REPLACEMENT.  IN THE MEANTIME, WE RECEIVED THE RECALL NOTICE FROM HYUNDAI ABOUT THE OIL PAN LEAK.  WE CONTACTED HYUNDAI AND THEY ARE CLAIMING THE ENGINE FAILURE IS UNRELATED TO THE RECALL AND WILL NOT COVER THE COST TO REPLACE THE ENGINE.  THERE WAS 103,000 MILES ON THE ENGINE AND WE FEEL THIS WAS PREMATURE ENGINE FAILURE CAUSED BY THE OIL PAN/SWITCH DEFECT.  THIS WAS NOT DISCLOSED TO US UNTIL EARLY SEPTEMBER.  IN ADDITION, THE CHECK ENGINE NEVER CAME ON PRIOR TO THIS POINT TO LET US KNOW THERE WAS AN ISSUE WITH THE ENGINE.  WITH THIS TYPE OF ISSUE, I WOULD THINK THE CHECK ENGINE LIGHT SHOULD HAVE ALERTED OF US OF AN ISSUE WAY BEFORE THIS TYPE OF DAMAGE TO THE ENGINE OCCURRED.",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256797,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING 30 MPH, A LOUD ABNORMAL NOISE WAS DETECTED FROM THE VEHICLE. THE CONTACT MENTIONED THAT THE ENGINE OIL LEAKED OUT THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE OIL PAN WAS LEAKING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "KM8JUCAC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256827,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT TOOK THE VEHICLE TO PHIL LONG HYUNDAI OF MOTOR CITY (170 W MOTOR WAY, COLORADO SPRINGS, CO 80905, (719) 453-0549) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE CONTACT NOTICED AN OIL LEAK IN HIS GARAGE WITH PLASTIC RINGS COVERED IN OIL. THE CONTACT HAD TO TAKE THE PLASTIC RINGS OUT OF THE OIL BAG TO SHOW TO THE DEALER WHO THOUGHT THE PARTS WERE INSECTS. THE CONTACT WAS NOT SATISFIED WITH THE REPAIR. THE DEALER ONLY REPLACED THE OIL PRESSURE SWITCH, BUT NOT THE FULL OIL PAN. THE MANUFACTURER INFORMED THE CONTACT TO MONITOR THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256919,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HWY ( APPROX 50 MPH ) WHEN THE CAR COMPLETELY SHUT DOWN.  CAR WOULD NOT TURN OVER ON THE SIDE OF THE ROAD.  GOT TOWED HOME AND TRIED TO START THE CAR AGAIN.  ENGINE TURNED OVER BUT IMMEDIATELY STARTED KNOCKING VERY LOUD.  TURNED THE ENGINE OFF IMMEDIATELY.    TOWED THE CAR TO THE LOCAL MECHANIC TO VERIFY MY INITIAL DIAGNOSIS.  COMPLETE ENGINE FAILURE AT 50K MILES.",
        "vin": "KM8JUCAC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256503,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTOR BLEW UP AT 72K MILES IT IS A SALVAGED TITLE SO THE WARRANTY WAS VOID BUT EVERYTHING THAT I RESEARCHED SAID HYUNDAI HAD A MOTOR PROBLEM WITH THIS YEAR OF MOTOR. THEY CLAIMED IT WAS ONLY THE SONOTA COVERED I REALLY DON'T BELIEVE THEY MAKE DIFFERENT MOTORS IN EACH VEHICLE WITH THE SAME SIZE MOTOR. WE WERE DRIVING THIS VEHICLE WHEN THE MOTOR BLEW UP.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256290,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 105K MILES. THE ENGINE NEEDED TO BE REPLACED DUE TO A FAULTY MAIN BEARING. I TURNED THE VEHICLE ON AND THE ENGINE LIGHT WAS ON. THE MANUAL SAYS IT'S OKAY TO DRIVE, BUT TO GET IT SERVICED. SO I DRIVE IT TO MY MECHANIC AND THE ENGINE STARTS MAKING A STRANGE TICKING NOISE, ALMOST TURNING OFF WHEN I STOP AT A LIGHT. THE MECHANIC AND A THIRD PARTY INSPECTOR FROM MY WARRANTY COMPANY DETERMINE THAT IT IS AN INTERNAL PROBLEM, A FAULTY MAIN BEARING.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255269,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE CONTACT CALLED EDWARDS HYUNDAI (1029 32ND AVENUE, COUNCIL BLUFFS, IA 51501, 888-812-6584) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE AND WOULD NEED TO BE ORDERED. THE MANUFACTURER WAS NOTIFIED AND A CASE WAS OPENED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "05/30/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254137,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). WHILE THE CONTACT'S SON WAS DRIVING 40 MPH, THE VEHICLE HESITATED AND SMOKE AND FLAMES EMERGED FROM UNDER THE HOOD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE FIRE WAS EXTINGUISHED BY THE DRIVER. THERE WERE NO INJURIES. THE FIRE DEPARTMENT ARRIVED, BUT A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO A TOW LOT AND THEN TO HERB CHAMBERS HYUNDAI OF AUBURN (735 SOUTHBRIDGE ST RTE. 12 & 20, AUBURN, MA 01501, (508) 832-9990) WHERE IT WAS DIAGNOSED THAT AN ENGINE REPLACEMENT WAS NEEDED. THE ENGINE WAS REPLACED. THE MANUFACTURER WAS NOT CONTACTED. THE INSURANCE COMPANY COVERED THE REPAIR COST. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "08/31/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252962,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND IT STOPPED CHANGING GEARS AND WOULDN'T PICK UP SPEED. THE MECHANIC LOOKED AT IT AND TOLD ME THE ENGINE WAS BLOWN BECAUSE THERE WAS METAL SHAVINGS IN THE OIL PAN. I ONLY HAD 67K MILES ON THIS VEHICLE SO THIS SHOULD NOT HAVE HAPPENED.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245716,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUDAI TUCSON. CONSUMER WRITES IN REGARDS TO SUDDEN LOSS OF POWER WHILE DRIVING ON THE HIGHWAY. *LD    THE CONSUMER STATED THE VEHICLE EXPERIENCED PREMATURE ENGINE FAILURE. THE DEALER AND MANUFACTURER WERE NOTIFIED. *JS",
        "vin": "KM8JUCACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246332,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING) THREE MONTHS AGO. PARKWAY HYUNDAI (24050 CREEKSIDE RD, SANTA CLARITA, CA 91355) WAS CONTACTED AND STATED THAT THE PART WAS NOT AVAILABLE AND THAT THE CONTACT WOULD RECEIVE A SECOND NOTICE WHEN IT BECAME AVAILABLE. WHILE DRIVING 65 MPH, ALL THE WARNING INDICATORS ILLUMINATED, THE VEHICLE STALLED, AND A CLICKING NOISE WAS HEARD COMING FROM THE ENGINE COMPARTMENT. THE CONTACT WAS ABLE TO PULL THE VEHICLE OVER TO THE SIDE OF THE ROAD AND CALLED AAA FOR A TOW. HOWEVER, AFTER WAITING FOR FIFTEEN MINUTES, THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND DROVE SLOWLY TO AN INDEPENDENT MECHANIC. THE INDEPENDENT MECHANIC DIAGNOSED THAT THE ENGINE WAS BLOWN AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 132,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8JU3AC9DU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246219,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGH SPEEDS CAR JERKS AND REMOVES ITSELF FROM CRUISE CONTROL AND RPM GAUGE DROPS TO ZERO AND STAYS THERE (HAS OCCURRED WITHOUT CRUISE CONTROL BEING ON AS WELL). WHEN THE CAR SLOWS DOWN TO 30 MPH OR LESS, OR WHILE SITTING AT A RED LIGHT, IT SHAKES VIOLENTLY. HAS OCCURRED MULTIPLE TIMES W/O PERSONAL MECHANIC BEING ABLE TO DIAGNOSE PROBLEM. ONE TIME, THE CHECK ENGINE LIGHT CAME ON AND ERROR CODE P0605 WAS IDENTIFIED. BATTERY WAS CHANGED AND CHECK ENGINE LIGHT WENT AWAY, HOWEVER, THE VIOLENT JERKING OCCURRED LATER THAT SAME DAY EXHIBITING ALL THE SAME ISSUES AS PREVIOUS OCCURRENCES.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245522,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLIER THIS YEAR (2019) I RECEIVED AN IMPORTANT SAFETY RECALL (INTERIM NOTICE) FOR MY 2013 HYUNDAI TUCSON.  THIS IS FOR CAMPAIGN 181, WHICH IS AN OIL PRESSURE SWITCH REPLACEMENT.    AS OF TODAY THIS RECALL IS STILL NOT AVAILABLE.  IT SEEMS TO ME THAT A FIX SUCH AS THIS, FOR A FAULTY PRESSURE SENSOR SHOULD NOT TAKE MORE THAN 6 MONTHS, YET IT HAS, AND THERE HAVE BEEN NO UPDATES TO THE STATUS.   CAN YOU PLEASE ASSIST BY RESPONDING WITH ANY ADDITIONAL DETAILS YOU MAY HAVE AVAILABLE.",
        "vin": "KM8JU3AC9DU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243407,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER CONTROLS FOR WINDOWS NO LONGER WORK. I'M ONLY ABLE TO CONTROL WINDOWS USING DRIVER CONTROLS. IN ADDITION, THE POWER CONTROL ON MY DRIVER SEAT NO LONGER WORK. MY SEAT IS STUCK IN AN UNCOMFORTABLE POSITION.     VIN: [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241288,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED WHILE DRIVING ON THE HIGHWAY AND SHUT DOWN. BITS OF METAL ALL THROUGH THE ENGINE AND OIL PAN. HYUNDAI TECH SAYS THAT IT IS NORMAL AND DIDNT CAUSE THE ISSUE BUT OTHER MECHANICS SAY IT CAUSES CAM SENSOR, CAM SHAFT AND CRANK SENSOR AND SHAFT FAILURES. TOOK CAR IN FOR THE RECALL THAT IS ALSO AFFECTED BY THIS AND TOLD OH WELL.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240513,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKING FROM ENGINE, WHEN CAR IS STATIONARY IT BEGINS TO SHAKE.",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240617,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT RICK CASE HYUNDAI (LOCATED AT 3550 WESTON RD, DAVIE, FL 33331, (954) 994-2397) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11240672,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS FAILED TO DEPLOY IN MODERATE COLLISION.  IMPACT WAS BY A CHEVY SILVERADO TO LEFT FRONT OF 2013 TUCSON.  AIR BAG DEPLOYED ON TRUCK.  NO AIRBAGS DEPLOYED ON TUCSON (SIDE OR STEERING COLUMN).  DRIVERS LEFT SIDE,HIP AND HEAD MADE DIRECT IMPACT WITH DOOR AND WINDOW.  FORCE OF IMPACT WAS ENOUGH TO SNAP AN AXEL AND SHIFT ENTIRE ENGINE BLOCK.  TUCSON SPUN 180 DEGREES AFTER BEING STRUCK.  STATE TROOPER AND TRUCK DRIVER ESTIMATED SPEED OF TRUCK AT IMPACT AT ABOUT 35-40MPH.    IMPACT OCCURRED WHILE TUCSON WAS  STATIONARY AND WAITING TO TURN LEFT FROM PARKHILL AVE. ONTO WADSWORTH BLVD. IN LITTLETON, CO.  PLEASE CONTACT REPORTER IF ADDITIONAL INFORMATION AND VEHICLE HISTORY IS REQUIRED.",
        "vin": "KM8JUCAC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232367,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229130,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SE FUNDIO EL MOTOR BEARING DE BIELA YBANCADA ESTA PARADO EL MOTOR NO SIRVE",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228216,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON. CONSUMER WRITES IN REGARDS TO ENGINE OIL LEAK. *LD  *JS",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223069,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING CAR SERVICED AND PREPPED FOR LONG TRIP, CAR DEVELOPED A KNOCKING NOISE IN ENGINE AND QUIT RUNNING WHILE ON INTERSTATE.",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222782,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING 30 MPH, THE VEHICLE SEIZED AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT  ATTEMPTED TO RESTART THE VEHICLE, BUT WAS UNSUCCESSFUL. THE CONTACT OPENED THE HOOD AND NOTICED AN ABNORMAL BURNING ODOR. THE CONTACT HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ENGINE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED TO CONFIRM IF THE PARTS WERE AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 103,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222212,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS AN OPEN RECALL AND I HAVE HEARD NOTHING WHAT IS TIME FRAME FOR REPAIRS",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221127,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON ENGINE RECALL-WENT TO HYUNDAI DEALERSHIP TO HAVE ENGINE CHECKED, THEY CLAIMED TO HAVE NO KNOWLEDGE OF THE RECALL AND WOULD NOT HELP ME.",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220805,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO GET MY 4TH OIL CHANGE SINCE HAVING THE CAR AND NOTICE AFTER MY CAR WAS LEAKING OIL.STARTS JERKING AT SOME POINTS",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220565,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. CIRCLE HYUNDAI (641 SHREWSBURY AVE, SHREWSBURY, NJ 07702, (732) 758-0111) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219523,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TUCSON WAS BEING DRIVEN WHEN THE ENGINE STARTED KNOCKING AND THE EHGINE LIGHT CAME ON, WE STOPED AND CHECKED THE OIL AND ENGINE COMPARTMENT ,EVERY THING WAS NORMAL WHEN WE RESTARTED THE ENGINE IT KNOCKED SO BAD THE WHOLE CAR SHOCK,THAT WAS IN NOV.2018 AND SENSE THEN HYUNDAI HAS CAME OUT WITH A RECALL NUMBER  181   AND I HAVE BEEN WITHOUT A VEHICLE EVER SENSE. I NEED YOUR HELP ON THIS MATTER .I HAVE A COLONOSTOMY AND HAVE MISSED DOCTORS APPOINTMENTS DUE TO NO WAY  THERE, I LIVE OUT SIDE THE CITY WITH NO PLUBLIC TRANSPORTATION.. I NEED THIS CAR REPAIRED OR A LOANER UNTIL IT IS FIXED  . I AM 79  SO I CAN NOT WALK FARE EITHER.",
        "vin": "KM8JUCACODU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218657,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON BUSINESS TRIP IN RI DRIVING ON HIGHWAY 65MPH RPMS WENT FROM @2500 TO @7000 CAR STALLED OUT NO VEHICLE CONTROLS. GOT CAR INTO NEUTRAL AND VERY LOUD BANGING AND KNOCKING FROM ENGINE. GOT BACK TO HOTEL (LESS THAN 1 MILE). TOE SERVICE BROUGHT ME TO DEALERSHIP WHO DIAGNOSED AS BLOWN ENGINE. HYUNDAI CORPORATE CONTACTED AND WAS TOLD ENGINE RECALL FOR SAME YR/MODEL:ENGINE WAS VIN SPECIFIC AND MY VIN NOT ON RECALL.",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217459,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING LOW SPEEDS, THE VEHICLE BEGAN TO JERK AND HESITATE, AND THE ENGINE STALLED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE LOCAL DEALER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217544,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217571,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD AT HIGH SPEED, MY CAR LOST POWER. AFTER TRYING TO RESTART, IT WOULD TURN OVER BUT TURN OFF IMMEDIATELY. AFTER GETTING IT TO THE DEALERSHIP, IT WAS EXPLAINED THAT MY 'MOTOR HAS FALLEN APART INSIDE'. THIS IS TO BE SUBMITTED TO HYUNDAI FOR REPAIR BUT MY CAR 'MAY NOT QUALIFY'. THIS IS CLEARLY A KNOWN PROBLEM AND WHY IT HASN'T BEEN BROUGHT IN FOR RECALL IS BEYOND ME. I HAVE A DISABLED SON TO DRIVE AROUND AND THIS DEFECT HAS MADE IT DANGEROUS TO DRIVE. I NEED THIS COVERED AND REPAIRED BUT MOST IMPORTANTLY I NEED THIS TO NOT BE AN ISSUE FOR ANYONE ELSE. THIS IS DANGEROUS. IT IS IRRESPONSIBLE TO ALLOW IT TO CONTINUE. DO BETTER!!!",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "04/07/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210089,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL FOR A DEFECT. THE VEHICLE MAY HAVE AN ENGINE OIL LEAK FROM THE SEAL BETWEEN THE OIL PAN & ENGINE BLOCK WHICH, IF LEFT UNREPAIRED & OPERATED OVER TIME, COULD EVENTUALLY LEAD TO ENGINE DAMAGE. A DAMAGED ENGINE COULD LEAD TO A HIGH-SPEED STALL, INCREASING THE RISK OF A CRASH. IT COULD ALSO INCREASE THE RISK OF A VEHICLE FIRE. I RECEIVED THIS NOTICE IN APRIL 2019. WHEN ARE THEY GOING TO GET THE REMEDY GOING? WHEN I PUT IN MY VIN #, IT SAYS IT IS INVALID. I WOULD THINK THEY SHOULD GET THE REMEDY IN PLACE SINCE THERE IS A POSSIBILITY OF A CRASH OR FIRE!! WHAT ARE THEY WAITING FOR?? (XXXXX)    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KM8JUCAC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209620,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE OPERATING THE VEHICLE, THE CHECK ENGINE INDICATOR LIGHT HAD ILLUMINATED BEFORE THE VEHICLE SUDDENLY STALLED AND COULD NOT BE RESTARTED. THE VEHICLE WAS TOWED TO HYUNDAI OF BEDFORD(18300 ROCKSIDE RD, BEDFORD OH) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 74,000.",
        "vin": "KM8JUCACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209802,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON, 90,000 MILES. PURCHASED FROM CARMAX 6.5 MONTHS AGO AT 80,000 MILES. ENGINE STARTED SLIGHT KNOCKING ON 5/10/2019 IN THE AM. ON THE WAY TO THE SHOP, ENGINE LOST 95% OF POWER AND BEGIN KNOCKING VERY HEAVILY. THE ENGINE HAS \"FALLEN APART\" ACCORDING TO THE MECHANIC. THIS IS AFTER I WAS TOLD THERE WAS A RECALL AFFECTING THE ENGINE ON 2/28/2019, AND IT APPEARS TO BE THE SAME PROBLEM. HYUNDAI SAID THEY CAN'T / WON'T DO ANYTHING ABOUT IT.  I'M OUT OF A CAR WITH ALMOST THE ENTIRE LOAN OF $13,000 LEFT ON IT.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207600,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR WITH 80K MILES ON IT 10 DAYS AFTER DEALER OIL CHANGE AND SERVICE. GOING 50 MPH DOWN 4-LANE HWY. WHEN ENGINE STOPPED. I WASN'T BRAKING OR ACCELERATING. FORTUNATELY I WAS IN RIGHT LANE AND COULD PULL OVER, RARE ON THAT ROAD. HAD TO HAVE TOWED TO NEAREST DEALER (NOT THE ONE WHO SERVICED IT). DEALER SAID $5700 TO REBUILD ENGINE DUE TO THROWN ROD. TALKED TO SERVICE MGR. WHERE OIL CHANGE DONE AND HE SAID THIS WAS A KNOWN DEFECT IN THE ENGINE OF 2010-2013 HYUNDAI AND THAT HYUNDAI WOULD FIX AT NO COST TO ME AND COVER COST OF LOANER. I'M NOT ORIGINAL OWNER BUT HE SAID THAT WOULDN'T MATTER SINCE THIS WAS A RECALL ISSUE. CALLED THE NUMBER I WAS GIVEN FOR CONSUMER AFFAIRS AND WAS TOLD THEY TALKED TO DEALERSHIP WHERE CAR WAS TOWED AND MY WARRANTY CLAIM WAS DENIED. ADVISED I WASN'T PUTTING IN A WARRANTY CLAIM AND THIS WAS A KNOWN DEFECT. AS STATED ON THE TAPE YOU GET WHEN YOU CALL CONSUMER AFFAIRS, THIS IS A KNOWN DEFECT WITH THE OIL PAN THAT CAN CAUSE ENGINE DAMAGE INCLUDING CAUSING A HIGH SPEED STALL. THE TAPE STATES THE RECALL HAS BEEN \"ANNOUNCED BUT NOT LAUNCHED.\" THEY ARE FULLY AWARE THERE IS A PROBLEM, ONE THAT COULD HAVE BEEN FATAL FOR ME, AND I AM GETTING THE RUNAROUND. THE CONSUMER AFFAIRS REP FINALLY ASSIGNED ME A CASE NUMBER AND SAID SOMEONE WOULD CALL IN 3-5 DAYS. THEY DID NOT, SO I CALLED. THAT PERSON RETURNED MY CALL AND TOLD ME MY WARRANTY CLAIM HAD BEEN DENIED. I ADVISED, AGAIN, NOW 8 DAYS LATER AND NEARLY 2 WEEKS WITHOUT A CAR, THAT IT WAS NOT A WARRANTY ISSUE. SHE SAID SHE WOULD CHECK AND GET BACK TO ME BUT SHE KNEW NOTHING ABOUT \"CAMPAIGN 181,\" WHICH IS THIS ISSUE. DESPITE ADDITIONAL CALLS BY ME SHE HAD NOT CALLED BACK. I'VE CONTACTED HYUNDAINATIONALCUSTOMERCARE@HMAUSA.COM AND RECEIVED NO REPLY. THEY SHOULD IMPLEMENT A RECALL IMMEDIATELY BEFORE SOMEONE IS KILLED. THEY SHOULD REPAIR MY VEHICLE AND BE THANKFUL NO ONE WAS KILLED.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206777,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS AT IDLE WAITING AT A RED LIGHT ON A CITY ROAD , MY VEHICLE JUST SHUT OFF AND WILL NOT RE START, I GOT IT TOWED TO MY MECHANIC AND HE SAID MY ENGINE LOCKED UP AND SEIZED!",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206830,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON.  THE CONTACT STATED THAT AT START UP THE CONTACT WOULD SEE SMOKE COMING FROM THE EXHAUST.  THE VEHICLE WOULD HESITATE TO ACCELERATE. THE ENGINE WARNING LIGHT HAD ILLUMINATED.  AN INDEPENDENT MECHANIC DIAGNOSE AND REPAIRED THE CYLINDER BUT THE VEHICLE STILL HAD THE SAME FAILURE. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE. THE FAILURE MILEAGE WAS 57,000.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205769,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED AND FAILED TO RESTART. ALL THE INSTRUMENT CLUSTER WARNING INDICATORS ILLUMINATED. ALSO, THERE WAS AN ABNORMAL RATTLING NOISE UNDERNEATH THE HOOD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THERE WAS AN HOLE IN THE ENGINE BLOCK. THE VEHICLE WAS TOWED TO ISLAND HYUNDAI (1590 HYLAN BLVD, STATEN ISLAND, NY 10305, (844) 672-7561) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204937,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMPAIGN181. THERE IS A RECALL THAT CAN CAUSE ENGINE DAMAGE THAT COULD LEAD TO A HIGH-SPEED STALL, INCREASING THE RISK OF A CRASH. IT COULD ALSO INCREASE THE RISK OF A VEHICLE FIRE. THERE IS NO SOLUTION. MY VEHICLE IS UNSAFE. I DRIVE 60 MILES PER DAY TO AND FROM WORK. I DO NOT FEEL SAFE IN MY VEHICLE",
        "vin": "KM8JUCAC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205032,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE (CAMPAIGN 181) IN APRIL 2019, THE NOTICE RECOMMENDED THAT I TAKE MY VEHICLE TO BE LOOKED AT, I SCHEDULED THE APPOINTMENT AND ON THE WAY TO THE DEALER SHIP THE CAR SUFFERED A HIGH-SPEED STALL, FORTUNATELY I WAS ABLE TO GET OFF THE BUSY ROAD WITH NO INCIDENTS. I HAD MY VEHICLE TOWED TO THE DEALER SHIP AT MY OWN EXPENSE. THE STALL WAS EXACTLY WHAT THEY SAID COULD HAPPEN TO MY VEHICLE ON THE RECALL NOTICE. NOW 18 DAYS LATER THERE HAS BEEN NO RESOLUTION, THE RECALL IS NOT BEING COMPLETED IN A TIMELY MANNER. HYUNDAI SAID I COULD PAY FOR THE REPAIR MYSELF AND IF THE RECALL REMEDY COVERED IT I COULD APPLY TO BE REIMBURSED. I DO NOT HAVE THE ABILITY TO COVER THE REPAIR MYSELF AND I AM WARY THEY WOULD FOLLOW THROUGH WITH ANY SORT OF REIMBURSEMENT. THEY HAVE ALSO NOT OFFERED A RENTAL VEHICLE.",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204793,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. AFTER ADDING TWO QUARTS OF OIL TO THE VEHICLE, THE OWNER NOTICED AN EXTENSIVE OIL LEAK WITHOUT WARNING. THE DEALER (LIA HYUNDAI ALBANY, 945 CENTRAL AVE, ALBANY, NY 12205, (518) 320-7235) INDICATED THAT THEY WERE WAITING ON THE MANUFACTURER TO PROVIDE THE REMEDY FOR NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS UNABLE TO BE DRIVEN DUE TO THE OIL LEAK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203412,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 181, NHTSA# 19V063   HAVE JUST LAST WEEK BEEN NOTIFIED OF THIS RECALL FOR OUR VEHICLE YET IT APPEARS TO HAVE BEEN A RECALL SINCE FEB, AND IT US NOW GOING ON 2-3 MONTHS AND THERE IS APPARENTLY STILL NO REMEDY AVAILABLE; SINCE THIS SOUNDS EXTREMELY SERIOUS, I BELIEVE NOTIFYING YOU IS AN APPROPRIATE MEASURE; AT THIS POINT WE HAVE NOT HAD ANY KNOWLEDGE, THEREFORE NO INSPECTION TO DETERMINE THE EXTENT OF THE PROBLEM IN THIS VEHICLE",
        "vin": "KM8JUCAC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197158,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SHUT OFF WHILE MOVING FORWARD ON A HIGHWAY IN THE MIDST OF TRAFFIC. THE VEHICLE RESTARTED THEN IMMEDIATELY SHUT OFF AND WOULD NOT RESTART. VEHICLE HAD TO BE PUSHED OFF THE HIGHWAY OUT OF THE FLOW OF TRAFFIC. I HAD THE VEHICLE TOWED TO A MECHANIC WHO DETERMINED THE MOTOR HAD SEIZED AND WAS RUINED",
        "vin": "KM8JT3AB0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196712,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON BOUGHT 10/30/17 WITH 31,000 MILES ON IT. IN 06/0?/18 THE ENGINE THREW A ROD. MY SISTER WAS DRIVING ON THE WAY TO WORK WHEN THE CAR STARTED MAKING A LOT OF NOISE AND SHAKING RAPIDLY SHE HAD TO PULL OVER TO THE SIDE OF THE ROAD AND CALL THE POLICE. THE COP TOLD HER THE ENGINE THREW A ROD. ONLY 46,000 SOMETHING MILES ON IT. WE CHANGE THE OIL OURSELVES BECAUSE THAT WAS SIMPLE MAINTENANCE, AND WE DO THIS WITH ALL OUR VEHICLES. BUT FAILURE TO SHOW OUR OIL CHANGE RECEIPTS HAS VOIDED THE WARRANTY ON THE ENGINE. I HAVE DONE RESEARCH AND FOUND OUT THAT THE ENGINE THETTA II HAS BEEN RECALLED BUT ON ONLY CERTAIN TYPES OF HYUNDAI AND KIA MODELS. EVEN THOUGH THE ENGINES ARE THE SAME, AND THE COMPLAINTS ARE THE SAME, AND THE FAILURES ARE THE SAME, THE TUCSON NEEDS TO BE ADDED.  WE TOWED THE VEHICLE TO HYUNDAI DEALERSHIP IN LITHONIA GEORGIA AND THEY TOOK ONE LOOK AT THE OIL DIPSTICK AND SAID THE REASON FOR THE ENGINE FAILURE WAS BECAUSE THERE WAS NO OIL. NOW WE HAVE THE VEHICLE SITTING IN OUR GARAGE AND WE DID FURTHER INVESTIGATION AND FOUND A BIG HOLE ON THE ENGINE BLOCK ITSELF, THAT EXPLAINS WHY HYUNDAI'S DEALERSHIP DIAGNOSIS WOULD REPORT NO OIL BECAUSE ALL THE OIL DRAINED OUT THROUGH THE GAPING HOLE IN THE ENGINE. HYUNDAI DEALERSHIP WANTS TO CHARGE US ANOTHER $7,000 TO REPLACE THE ENGINE. EVEN THOUGH WE HAVE MANY MEMBERS ( HYUNDAI THETA II ENGINE FAILURE FACEBOOK GROUP) WHO HAVE BEEN WAITING 6 MONTHS AND ONGOING FOR A REPLACEMENT ENGINE. THEY KEEP POSTPONING BECAUSE THEY HAVE NO ENGINES BECAUSE THE ENGINES HAVE MANUFACTURER DEFECTS CAUSING A BEARING TO PREMATURELY FAIL RESULTING IN CATASTROPHIC ENGINE FAILURE. NOW OUR 2013 TUCSON SITS IN OUR GARAGE WHILE STILL MAKING PAYMENTS $16,000! THEY RECENTLY ADDED 2011-2013 TUCSON TO THE RECALL. FOR SOME REASON OUR 2013 IS NOT.?!!",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11196436,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING 35 MPH IN INCLEMENT WEATHER, THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A POLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED BACK AND NECK PAIN. THE PASSENGER SUSTAINED BODY ACHES. THE CONTACT STATED THAT THE INFANT CHILD LOCATED IN THE REAR DRIVER'S SIDE SEAT MAY ALSO HAVE BEEN INJURED. THE CONTACT WAS CURRENTLY EN ROUTE TO THE HOSPITAL TO SEEK MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOW YARD. IT WAS UNKNOWN IF THE VEHICLE WAS DESTROYED. THE VEHICLE WAS NOT TAKEN TO AN INDEPENDENT MECHANIC OR DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 43,000. THE VIN WAS INVALID.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195854,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 19V063000 (ENGINE) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. SUPERIOR HYUNDAI NORTH (5565 DIXIE HWY, FAIRFIELD, OH 45014) AND THE MANUFACTURER STATED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11195498,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A CITY STREET IN SLOW MOTION COMING TO A FULL-STOP INTERSECTION, ATTEMPTS TO SAFELY SLOW AND STOP THE VEHICLE BY DEPRESSING BRAKE PEDAL FAILED WITH NO FEEDBACK FROM THE VEHICLE. THE VEHICLE DID NOT DECELERATE RESULTING IN AN ACCIDENT.    IT WOULD SEEM THAT THE BRAKE MASTER BOOSTER HAD WORN AND WAS NO LONGER FUNCTIONING. COLLISION CENTER RESPONSIBLE FOR REPAIRS HAS STATED THE FOLLOWING: \"OUR FINDINGS ARE THAT THE BRAKE MASTER BOOSTER NEEDS TO BE REPLACED.  YOUR VEHICLE CAME TO OUR SHOP FOR COLLISION REPAIRS FROM AN ACCIDENT <DATE REDACTED> AND DURING OUR REVIEWS TO THE COLLISION DAMAGES WE FOUND THE POOR BRAKING CONDITION.  THIS IS NOT PART OF THE ACCIDENT AND IS A MAINTENANCE WEAR ITEM.  AS AN UNDERSTANDING TO THIS FAILURE THERE IS LITTLE OR NO WARNING WHEN THE BRAKES FAIL AND CAN HAPPEN AT ANY TIME.  I FEEL THAT THE BRAKING CONDITION MAY OF HAD SOME SIGNIFICANT RELATION TO THE CAUSE OF ACCIDENT.\" VERBALLY THE SAME COLLISION CENTER REPRESENTATIVE SAID, THAT IT WOULD TAKE A VERY STRONG PERSON TO STOP THE VEHICLE WHEN PARTICULAR PART MALFUNCTIONS. AND THAT EVEN ON THE COLLISION CENTER LOT PRIOR TO REPAIRS USING BRAKES WAS CHALLENGING.    THE VEHICLE HAS BEEN MAINTAINED IN HYUNDAI DEALERSHIP AND BRAKE PADS WERE REPLACED ACCORDING TO DEALERSHIP RECOMMENDATIONS PRIOR TO THE INCIDENT.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191174,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MARCH 20,2019 MY SUV SHUT DOWN, WITHOUT WARNING, WHILE I WAS DRIVING IN A RESIDENTIAL AREA. I TRIED TO START IT AGAIN, BUT WASN'T SUCCESSFUL. MY INTERIOR LIGHTS, HORN, AND RADIO WAS STILL WORKING, AND I HAD A FULL TANK OF GAS. LUCKILY, I WASN'T IN REAL TRAFFIC OR ON THE HIGHWAY, BECAUSE IT COULD'VE BEEN WORSE. I HAD MY VEHICLE TOWED, AND IT ARRIVED AT FENTON HYUNDAI OF MESQUITE, IN MESQUITE TX, AT APPROXIMATELY 6:54 A.M. I CALLED THE DEALERSHIP, AROUND 9 A.M., AND NO ONE IN THE SERVICE DEPARTMENT COULD TELL ME WHAT WAS GOING ON OR WHAT THE PROBLEM. I WAS TOLD TO \"GIVE THEM A CALL BACK IN A FEW HOUR\".  AT APPROXIMATELY 3:56 PM, I CALLED AND SPOKE THE SUPERVISOR OVER THE SERVICE DEPARTMENT, AND WAS TOLD THAT \"I MAY NEED A NEW ENGINE AND YOUR WARRANTY EXPIRED AT 60,000 MILES AND YOU HAVE 88,000 + MILES ON YOUR SUV\". I INFORMED THE SUPERVISOR THAT I HAD GAP AND WAS COVER ROOF TO ROAD, BUMPER TO BUMPER, FOR 10 YEARS OR 100,000, WHICHEVER COMES 1ST. I WAS ALSO TOLD THAT THAT WARRANTY WASN'T IN THEIR SYSTEM. ON MARCH 21, 2019, AT APPROXIMATELY 9:20 A.M., I ARRIVED AT THE DEALERSHIP, WITH MY CONTRACTS AND ASKED FOR THE SERVICE DEPARTMENT SUPERVISOR AND ATTEMPTED TO SHOW HIM MY CONTRACT AND HE STATED \"THIS ISN'T A GAP ISSUE. I STILL WAITING ON ANSWER FROM HYUNDAI, ON HOW WE SHOULD HANDLE IT\". AT THAT POUINT, I ASKED FOR A LOANER CAR, UNTIL MINE WAS FIXED AND READY FOR PICK UP, BUT WAS TOLD THAT ALL 23 LOANER CARS WERE IN USE. NO OTHER OPTION WAS OFFERED. FAST FORWARD, TO TODAY, MARCH 24,2019, STILL NO LOANER OR RENTAL, AND NO ANSWERS REGARDING MY VEHICLE. MY VEHICLE WAS PURCHASED BRAND NEW AND IS ONLY 6 YEARS OLD.",
        "vin": "KM8JT3AB9DU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183133,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING VARIOUS SPEEDS WITH THE ACCELERATOR PEDAL DEPRESSED, THE ENGINE REVVED, BUT THE VEHICLE WOULD NOT INCREASE IN SPEED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE DEALER REPLACED THE SPARK PLUGS, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 122,356. THE VIN WAS INVALID.",
        "vin": "KM8JT3AB8BU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/07/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181565,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 HYUNDAI TUCSON. WHILE OPERATING THE VEHICLE, SMOKE WAS PRESENT COMING FROM THE REAR TAIL LIGHTS AND THE DASHBOARD. THE VEHICLE WAS TAKEN TO CHAPMEN PAYSON (100 N. BEELINE HIGHWAY, PAYSON, AZ) BEFORE BECOMING ENGULFED IN FLAMES. THE FLAMES WERE EXTINGUISHED BY WORKERS AT THE DEALER. THE VEHICLE WAS DESTROYED. THE INSURANCE COMPANY STATED THAT THE FAILURE WAS CAUSED BY AN ELECTRICAL SHORT. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 37,125. THE VIN WAS UNKNOWN. *TT  CONSUMER STATED CHECK FINALLY ARRIVED ON 4/9/19. LOAN FINALLY PAID OFF. *JB",
        "vin": "KM8JU3ACODU"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179771,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "105,000 MILES AND THE ENGINE ON MY (JUST PAID OFF) HYUNDAI TUCSON GLS 2.4L THREW A MAIN ROD BEARING.THE ENGINE IS BLOWN AND NEEDS TO BE REPLACED. I WAS DRIVING DOWN THE INTERSTATE AT 65 MILES PER HOUR IN THE CENTER LANE TRAVELING FROM LAS VEGAS TO CALIFORNIA. THE VEHICLE STARTED TO DECELERATE THEN A LOUD TICKING SOUND WAS PRODUCED THEN THE TICK GREW INTO A VERY LOUD (ENGINE COMING APART FROM THE INSIDE SOUND) AT THAT MOMENT I ALMOST LOST CONTROL OF THE VEHICLE WHILE TRYING TO MANEUVER THROUGH TRAFFIC AT SPEED. THIS IS A MAJOR ISSUE LADIES AND GENTLEMEN. \"FIX IT\"      I'VE NEVER MISSED AN OIL CHANGE I HAPPEN TO BE MECHANIC. THIS SAME ENGINE IN TWO OTHER HYUNDAI'S FOR THE SAME YEAR HAVE BEEN RECALLED EXCEPT FOR THE TUCSON? WHY NOT? ESTIMATED COST OF REPAIRS IS IN THE RANGE OF 5,000.00 -6,500.00 I CAN BUY A USED HONDA ACCORD THAT WILL RUN FOREVER AT THAT PRICE.. I'M VERY DISAPPOINTED IN HYUNDAI AT THIS POINT. THEY DO NOT TAKE PROPER CARE OF THEIR REPUTATION OR PRODUCTS LET ALONE THE CONSUMER.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171402,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "5 YEAR OLD TUCSON WITH ONLY 75,000 MILES EXPERIENCING ROD KNOCK AND REQUIRING AN ENTIRE ENGINE REPLACEMENT. I HAVE NOT HAD A SINGLE ISSUE WITH THIS CAR AND HAVE KEPT UP ON REGULAR MAINTENANCE. THE DEALERSHIP SAYS THAT I DO NOT QUALIFY FOR THE POWER TRAIN WARRANTY BECUSE I AM THE SECOND OWNER. AFTER MUCH RESEARCH I SEE THIS IS A RECURRENT PROBLEM WITH HYUNDAI TUCSON'S AS WELL OTHER MODELS IN THEIR LINE UP. NO RECALL OR SOLUTION TO THE PROBLEM HAS BEEN BROUGHT FORWARD. MY CAR STARTED KNOCKING WHILE ON A MAJOR HIGHWAY WITH CARS GOING 75MPH. I LUCKILY GOT IT OFF AN EXIT AND DID NOT CAUSE AN ACCIDENT INVOLVING THE CARS BEHIND ME.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166726,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE WAS MAKING AN INTERNAL KNOCKING NOISE.  AT FIRST THOUGHT IT WAS THE TIMING CHAIN AND TENSIONER. IT TURNS OUT THAT THE NOISE IS COMING FROM THE CONNECTING ROD BEARINGS. ACCORDING TO THE HYUNDAI DEALER, THE ENGINE MUST BE REPLACED.  THE CAR ONLY HAS 78,500 MILES AND WAS PURCHASED USED IN MARCH 2017.  THE CAR HAS BEEN WELL TAKEN CARE OF WITH REGULAR OIL CHANGES AS RECOMMENDED.  THIS SEEMS TO BE  COMMON PROBLEM WHERE METAL DEBRIS, LEFT OVER FROM THE MANUFACTURING PROCESS PLUGS UP INTERNAL LUBRICATION HOLES AND THE BEARINGS DO NOT RECEIVE PROPER LUBRICATION.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "07/30/2017",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11161390,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING 25 MPH, THE CONTACT ATTEMPTED TO MAKE A TURN, BUT THE WHEELS DID NOT TURN IN THE DIRECTION THE VEHICLE WAS STEERED. AS A RESULT, THE VEHICLE CRASHED INTO A TREE AND CAUGHT ON FIRE. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS NOT FILED. THE LOCAL FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE CONTACT SUSTAINED INJURIES TO THE RIGHT FOOT, HAND, SPINE, AND NECK THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE VEHICLE WAS TOWED TO A LOCAL SALVAGE YARD. THE CONTACT MENTIONED THAT AN UNKNOWN EXPERT INSPECTED THE VEHICLE AND STATED THAT THE FAILURE COULD POSSIBILY BE DUE TO THE RACK AND PINION; HOWEVER, THE VEHICLE WAS TOO DAMAGED TO DETERMINE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 36,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155425,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOCKS, WINDOWS AND HATCHBACK ALL QUICK WORKING CORRECTLY. YOU HAVE TO MANUALLY UNLOCK ALL DOORS AFTER YOU UNLOCK DRIVER DOOR WITH THE KEY. ONLY DRIVER WINDOW BUTTON WORKS, YOU HAVE TO OPEN HATCHBACK BY CLIMBING IN THE BACK TO OPEN WITH EMERGENCY LATCH BEHIND INTERIOR PANEL. KEY PHOB DOESN'T WORK AT ALL WITH OR WITH OUT A NEW BATTERY.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154445,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON ENGINE MALFUNCTIONED WHILE IN MOTION AND THIS IS A NATIONAL THING BECAUSE THE DEALERSHIPS CAN NOT KEEP UP WITH FIXING THE ISSUE AND PARTS ARE ON BACK ORDER. I WAS GIVEN A 2019 HYUNDAI SANTA FE AS A LOANER AND I HAD A MAJOR ACCIDENT AND NO AIR BAGS DEPLOYED ON THIS VEHICLE AT ALL.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151618,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE PROBLEM OCCURRED, VEHICLE WAS IN MOTION ON A LOCAL HIGHWAY GOING APPROXIMATELY 75 MPH. SUDDENLY THE VEHICLE LOST A BIT OF POWER, AND ALLOWED ONLY 65 MPH TO BE ATTAINED AND WOULD NOT RETURN TO 75 MPH. THIS CONTINUED FOR AROUND FIVE TO TEN MINUTES. THEN ONCE AGAIN, THE VEHICLE LOST POWER FROM 65 MPH TO AROUND 55 MPH, AND THE ENGINE BEGAN MAKING A \"METALLIC CLANKING\" SOUND. ONCE THIS HAPPENED, THE VEHICLE STARTED TO POWER DOWN, LOSING ALL REMAINING SPEED IN TRAFFIC, AND WAS GUIDED TO THE SIDE OF THE HIGHWAY, AWAITING A TOW TRUCK TO TAKE IT BACK TO OUR RESIDENCE. WE THEN HAD IT INSPECTED BY A LOCAL MECHANIC GARAGE WHO TOLD US THAT A MAIN ROD BEARING HAD BEEN THROWN, AND THAT WHEN THEY CONTACTED HYUNDAI, THEY HAD BEEN INFORMED THAT THIS WAS A COMMON ISSUE WITH THESE THETA II ENGINES, YET NO RECALL HAD BEEN PUT FORTH FOR 2011 - 2014 HYUNDAI TUCSONS. WE ARE CURRENTLY HAVING THE VEHICLE INSPECTED AT A LOCAL HYUNDAI DEALERSHIP AWAITING THEIR VERDICT AND INSPECTION NOTES TO BE SENT TO HYUNDAI TO BEGIN BUILDING A CASE, WITH CASE NUMBER.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/31/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144476,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS MAKING A CLICKING / KNOCKING NOISE SO I TOOK IT INTO THE HYUNDAI DEALERSHIP IN LANCASTER, PA. MY CAR HAS 53,000 MILES AND NOW A DEAD ENGINE. HOW DOES THAT HAPPEN IN A NEWER CAR WITH NOT THAT MANY MILES? THEY TOLD ME I CAN REPLACE IT WITH AN OLDER ENGINE THAT HAS 2X THE MILAGE THAN MY CAR FOR $6,000 OR GET A NEW CAR.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142637,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2013 HYUNDAI TUCSON BEGAN SHUTTING OFF WHILE THE CAR WAS IN MOTION MULTIPLE TIMES RESULTING IN EXTREMELY DANGEROUS DRIVING CONDITIONS. IT HAPPENED TWICE WHILE ON THE HIGHWAY. WE ENDED UP HAVING TO REPLACE THE ENTIRE MOTOR ON A CAR THAT IS ONLY 5 YEARS OLD. WHEN RESEARCHING THIS ISSUE ONLINE, I FOUND NUMEROUS PEOPLE HAD THE SAME EXACT ISSUE. I AM SHOCKED THERE IS NOT ALREADY A RECALL AND NOW I AM OUT $5800.00 TO REPLACE THE MOTOR AFTER ME AND MY HUSBAND WERE JUST LAID OFF.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142334,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/25/2018, MY HYUNDAI TUCSON FOR THE FIRST TIME BEGAN MAKING A STRANGE KNOCKING NOISE. I IMMEDIATELY CALLED HYUNDAI TO BRING IT IN. WHILE ON MY WAY TO THE DEALERSHIP AT 12:30 PM, IT BROKE DOWN ON ME IN THE MIDDLE OF LUNCH HOUR TRAFFIC ON ONE OF THE BUSIEST STREETS, WHILE WAITING AT A RED LIGHT. (THANKFULLY IT WASN'T A HIGHWAY OR INTERSTATE!)    TWO DAYS LATER, I FOUND OUT THAT MY ENGINE HAD TO BE REPLACED. THEY FOUND METAL SHAVINGS IN THE OIL PAN, WHICH IS CONSISTENT WITH THE PRIOR RECALLS FOR SONATA AND SANTA FE ENGINE FAILURES, BUT THEY NEVER RECALLED THE TUCSONS. THANKFULLY, MY CAR IS STILL UNDER WARRANTY (2013 - ONLY 48,000 MILES), BUT THE SITUATION WAS VERY SCARY.     I AM SENDING THIS BECAUSE I HAVE BEEN READING MORE AND MORE THAT OTHER VEHICLES LIKE MINE HAVE BEEN HAVING THIS SAME ISSUE, YET HYUNDAI HAS STILL NOT ISSUED A RECALL FOR OUR MODEL.     MY CAR HAS BEEN AT HYUNDAI SINCE 6/25/2018 WAITING FOR THE NEW ENGINE TO ARRIVE, WHICH HAS NO ETA. IF I CAN PREVENT ANOTHER HYUNDAI TUCSON OWNER FROM HAVING TO GO THROUGH WHAT I CURRENTLY AM, THEN I WANT TO HELP AS MUCH AS POSSIBLE.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142129,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 10TH, 2018 WHILE DRIVING ON THE HIGHWAY, I HEARD A STRANGE NOISE AND MY CAR WOULD NOT ACCELERATE.  I MANAGED TO MAKE IT HOME AND MY HUSBAND SAID TO HAVE IT TOWED TO DEALERSHIP, ENGINE WAS KNOCKING.  THE SAFETY RISK WOULD BE THE CAR SUDDENLY STALLING IN THE MIDDLE OF HIGHWAY TRAFFIC.  THE DEALERSHIP CONFIRMED IT WAS ENGINE FAILURE.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141593,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR SEIZED UP AND NEEDS A NEW MOTOR. RON TONKIN HYUNDA HAS HAD MY CAR SINCE MAY OF THIS YEAR. EXTENDED WARRANTY COVERS THE COST BUT HYUNDAI HAS FAILED ON SUPPLYING THE MOTOR NEEDED FOR 5 MONTHS. WAS SUPPOSED TO BE HERE JULY 6TH AND HAS BEEN PUT OFF 5 OR 6 TIMES.",
        "vin": "KM8JUCACXDU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "07/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140112,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,  I AM PART OF A GROUP ON FACEBOOK FOR THIS MATTER CONCERNING HYUANDAI TUCSON ENGINE FAILURE WHICH HAS OVER 200 PEOPLE WHO EXPERIENCED THE SAME OR SIMILAR ISSUE WITH THE THETHA II ENGINE IN THE HYUANDAI TUCSON.. MY 2013 HYUNDAI TUCSON ENGINE FAILED JULY 4, 2018 WITH APPROXIMATELY 54 THOUSAND MILES. I WAS DRIVING HOME FROM A BIRTHDAY PARTY WITH MY DAUGHTER WHEN THE CAR JUST LOST POWER ON A BUSY ROAD WITH NO WARNING. IT JUST WOULD NOT DRIVE ANYMORE. LUCKILY I WAS ABLE TO PULL IT OVER TO THE SIDE SAFELY  AND A NICE GENTLEMAN HELPED PUSH THE CAR FURTHER ON THE SIDE OF THE ROAD. I HAD TO SIT IN OVER 90 DEGREES WITH MY DAUGHTER FOR APPROXIMATELY 2 HOURS WITH NO AIR CONDITIONING OR ANYTHING BECAUSE THE CAR SIMPLY WOULDN'T START BACK UP. HYUNDAI OF CENTEREACH IT'S THE DEALERSHIP I AM DEALING WITH. THEY SAID THERE WAS GOING TO BE A RECALL ON THIS ENGINE SOON SO THEY WOULD REPLACE IT AT THEIR EXPENSE. THEY ALSO INFORMED ME THAT THEY DON'T KNOW WHAT'S CAUSING THIS TO HAPPEN WHICH IS NOT COMFORTING AT ALL SINCE THEY'RE PUTTING THE SAME MODEL ENGINE INTO MY CAR. I'VE BEEN WAITING OVER 3 MONTHS NOW AND THEY HAVE SAID THEY DON'T KNOW WHEN THE ENGINE WILL ARRIVE AND I HAVE BEEN PAYING CAR PAYMENTS AND ENSURANCE ON A DEAD CAR FOR THE LAST THREE MONTHS. THEY ARE SUPPLYING ME A RENTAL HOWEVER I DON'T FEEL THIS IS ENOUGH COMPENSATION FOR THE HEADACHE I AM DEALING WITH. I AM A STRUGGLING SINGLE MOTHER WHO NOW HAS A CAR I WILL NEVER TRUST TO DRIVE MY 4 YEAR OLD DAUGHTER AROUND IN. I'M NOT SURE WHAT TO DO AT THIS POINT I AM LOSING HOPE. PLEASE ADVISE ON WHAT ACTIONS I CAN TAKE. I'VE ALREADY SPOKE TO HYUNDAI MOTOR FINANCE AND THEY REFUSED TO HELP ME OUT AT ALL WITH EVEN POSTPONING PAYMENT UNTIL I RECEIVE MY VEHICLE. THANK YOU SO MUCH FOR YOUR TIME AND I LOOK FORWARD TO HEARING FROM YOU.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132037,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A WEEK BEFORE GOING ON VACATION, I JUST HAD AN INSPECTION AND OIL CHANGE DONE. THE CAR PASSED INSPECTION WITHOUT ISSUE. I'VE HAD THIS VEHICLE SERVICED ON TIME SINCE I BOUGHT IT IN 2015. I NEVER HAD ANY ISSUES WITH THE CAR PRIOR TO THIS. I WAS REACHING THE END OF AN 8 HOUR DRIVE WITH THE CAR. WE JUST CROSSED THE PA STATE LINE. I WAS DRIVING IN THE PASSING LANE ON THE INTERSTATE, GETTING UP TO SPEED, AND I JUST HIT 60 MPH WHEN THE CAR MADE A RATTLING NOISE AND I WAS NOT ABLE TO ACCELERATE PAST 60 MPH. WE WERE ABLE TO PULL OVER TO THE SHOULDER. THE CHECK ENGINE LIGHT CAME ON. WE PROCEEDED TO TURN THE CAR OFF AND CHECK THE OIL WHICH WAS FINE. THERE WAS NO SMOKE COMING FROM THE VEHICLE. WE ATTEMPTED TO RESTART THE CAR BUT THE ENGINE JUST KEPT TURNING OVER. WE WAITED AN HOUR FOR A TOW TRUCK AND DURING THE SHORT AMOUNT OF TIME THE CAR LOST ALL POWER. WE HAD IT TOWED TO A HYUNDAI DEALERSHIP WHERE THEY PROCEEDED TO TELL US THE CAR ENGINE WAS BLOWN AND IT WOULD NEED TO BE REPLACED. HOWEVER, THERE WAS NO EXISTING REFURBISHED ENGINES IN THE COUNTY WE WERE IN OR WHERE WE LIVE. MY CAR NOW CONTINUES TO SIT AT THE HYUNDAI DEALERSHIP FOR THE PAST 2 WEEKS AWAITING TILL I HAVE THE MEANS TO TOW IT UP TO WHERE I LIVE. NOW I AM STUCK WITH NO CAR AND STILL MONEY TO OWE ON THE LOAN.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130628,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED MAKING A RATTLING NOISE DURING ACCELERATION AT AROUND 75,000 MILES. TOOK IT IN JUNE 11, 2018 FOR A DIAGNOSTIC, AND IT IS ENGINE FAILURE DUE TO MANUFACTURER DEFECT. HYUNDAI IS COVERING THE REPAIR, BUT STILL, AS OF SEPTEMBER 21, 2018 DOES NOT HAVE THE PART AVAILABLE AND HAS NO ETA. AT LEAST HUNDREDS OF OTHERS ON THE INTERNET ARE EXPERIENCING THE SAME PROBLEM WITH THIS MODEL YEAR, AND SOME HAVE BEEN WAITING ON PARTS FOR 4 MONTHS OR LONGER. NO RECALLS HAVE BEEN ISSUED.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122472,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY (AT HIGHWAY SPEED), THE ENGINE SUDDENLY FAILED WITHOUT WARNING, RESULTING IN THE VEHICLE TO COMPLETELY LOSE ACCELERATION AND OPERATION. THE FAILURE OF THE ENGINE WAS INSTANT; NO CRANK OR RESPONSE WHILE ATTEMPTING TO RESTART VEHICLE SEVERAL TIMES. THE VEHICLE WAS TOWED TO A PROFESSIONAL AUTO GARAGE, AND THE DIAGNOSIS WAS PROMPT: COMPLETE ENGINE FAILURE DUE TO BACK DESIGN. THE OIL WAS GOOD, AND ALL THE COMPONENTS OF THE VEHICLE WERE IN GREAT SHAPE ACCORDING TO THE MECHANICS. THE MILEAGE ON THE VEHICLE IS 72,000, AND I HAVE BEEN THE OWNER OF THE VEHICLE SINCE JUNE 2013. THE VEHICLE WAS THEN TOWED FROM THIS AUTO GARAGE TO THE HYUNDAI DEALER, WHERE THE SAME DIAGNOSIS WAS CONFIRMED.     THERE NEEDS TO BE A RECALL TO INCLUDE THE HYUNDAI TUCSON MODELS FROM THIS SAME YEAR, SINCE THE KIA SPORTAGE, SORENTO, AND HYUNDAI SANTA FE ARE ALREADY PROMPTED AS 'RECALL ELIGIBLE' VEHICLES. THE SAME SYMPTOMS THAT PLAGUE THESE OTHER MODELS APPLY TO THE TUCSON AS WELL. THIS ALMOST COST ME MY LIFE, AND MY CONFIDENCE IN THIS AUTO MAKER IS COMPLETELY ABSENT AFTER THIS INCIDENT.",
        "vin": "KM8JUCACODU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122320,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD AFTERNOON,  I'M SENDING THIS E-MAIL IN REFERENCE TO MY 2013 HYUNDAI TUCSON. ON THURSDAY THE 23TH OF AUGUST , I WAS IN MY VEHICLE WITH MY FAMILY COMING HOME FROM  DINNER IN ATLANTIC CITY NEW JERSEY. WE WERE TRAVELING SOUTH ON THE NJ PARKWAY IN THE OUTSIDE LANE.  AT APPROX.9:15 PM AT MILE MARKER 48, I HEARD A SMALL POP , MY VEHICLE STARTED SMOKING AND STOPPED RUNNING. THE MOMENTUM CARRIED ME OFF TO THE RIGHT SHOULDER OF THE HIGHWAY. I HAD TO GET TOWED HOME. THE TOW TRUCK DRIVER CHECKED UNDER THE HOOD AND HE SAW OIL LEAKING AND PIECES ON THE ENGINE BLOCK. HE ADVISED THAT I POPPED A ROD ON THE ENGINE.              AFTER DOING SOME INQUIRES ON THE NET , I FOUND THAT HYUNDAI HAD RECALLS ON THEIR SONATAS FOR ENGINE PROBLEMS.... ALSO TUCSON OWNERS WERE HAVING THE SAME PROBLEMS. I CHECKED TO SEE WHAT KIND OF ENGINE I HAD. I DID SO BY VIN NUMBER.  ON THE VIN NUMBER POSITION 8 IS THE CODE FOR ENGINE. I HAVE CODE C . THIS ENGINE WAS USED IN SONATAS . IS IT POSSIBLE THAT MY ENGINE WAS ONE OF THE RECALLED ONES.   MY VEHICLE ONLY HAD 122,000. MAINTENANCE  WAS DONE. THERE WAS NO WARNINGS '.ENGINE LIGHT NEVER CAME OR OIL PRESSURE LIGHT.  THANK YOU FOR YOUR COOPERATION IN THIS MATTER.....",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119709,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE SUFFERED A COMPLETE FAILURE WHILE TRAVELING ON THE INTERSTATE AT 70+ MPH.  IN THE MIDDLE OF A 300 MILE ROAD TRIP, I NOTICED THE CAR WOULD HOLD SPEED WITH CRUISE CONTROL, BUT NOT ACCELERATE TO PASS ON THE HIGHWAY.  WITHIN 10 MINUTES OF NOTICING, THE ENGINE BEGAN MAKING A LOUD NOISE.  I WAS NOT ABLE TO STOP, AS I WAS ON A LONG STRETCH OF INTERSTATE WITH NO GAS STATIONS, ETC.  SUDDENLY, THE ENGINE REVVED TO ABOUT 6000 RPM, THE CAR SHOOK, AND THE ENGINE STOPPED.  I HAD ENOUGH SPEED TO PULL OVER TO THE SHOULDER AND TURNED OFF THE CAR.  THE ENGINE WOULD NOT RESTART.  I HAD TO CALL A TOW TRUCK AND HAVE THE VEHICLE TOWED 40 MILES TO A HYUNDAI DEALERSHIP, WHERE THEY DIAGNOSED IT AS BLOWN, MOST LIKELY TO A BEARING FAILURE.  AT THE TIME OF THE INCIDENT, THE VEHICLE WAS TRAVELING AT OVER 70 MILES PER HOUR.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "06/17/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119738,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": ". ON JUNE 17, 2018 MY ENGINE BLEW ON MY 2013 TUCSON, LESS THAN 75000 MILES. WE WERE TRAVELING ON THE INTERSTATE AT SPEEDS OF 75 MILES PER HOUR WHEN THE ENGINE BEGAN TO KNOCK THEN LOOSE SPEED. TRAFFIC ALL AROUND US WAS TRAVELING AT 75-80 MILES PER HOUR, VERY SCARY AS WE WERE GOING 10-15 MILES PER HOUR WHEN WE MANAGED TO PULL OFF ON AN EXIT AND THE ENGINE SIMPLY DIED AND NEVER WOULD RESTART. WE HAD TO PUSH IT THROUGH A BUSY  INTERSECTION TO A GAS STATION. WE HAD IT TOWED TO THE LOCAL HYUNDAI DEALER WHERE IT STILL SITS 2 MONTHS LATER WAITING ON AN ENGINE TO BE DELIVERED.   THESE ENGINES HAVE BEEN RECALLED IN THE SONATA'S AND THE SANTA FE'S BUT NOT IN THE TUCSON'S.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/03/2018",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118639,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEED VEHICLE BEGAN TO SHUDDER THEN LOUD \"CLUNK\" AND LOST POWER.  SMALL ENGINE COMPARTMENT FIRE DEVELOPED BUT THEN THANKFULLY WENT OUT. VEHICLE WAS TOWED TO NEAREST SHOP WHICH INFORMED US THAT VEHICLE HAD THROWN A ROD AND WILL REQUIRE ENGINE REPLACEMENT.  VEHICLE HAS NOW BEEN TOWED TO NEAREST HYUNDAI DEALER THAT \"WILL GO TO BAT TO TRY AND GET HYUNDAI TO FIX\". WE ARE NOT THE ORIGINAL OWNERS OF VEHICLE SO APPARENTLY THE 10/100 DOES NOT APPLY. VEHICLE HAS BEEN MAINTAINED PROPERLY. NEED TO KNOW WHAT TO DO OR WHO TO COMMUNICATE WITH TO GET HYUNDAI TO RECOGNIZE THIS PROBLEM.",
        "vin": "KM8JUCAC2DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118056,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 HYUNDAI TUCSON ENGINE FAILURE. DRIVING ON HIGHWAY ENGINE SEIZED. ONLY 53,000 MILES ON CAR. CAR WAS REGULARLY SERVICED BY DEALER. DEALER TO REPLACE ENGINE. ENGINE UNDER WARRANTY, DEALER HAS HAD CAR FOR 4 MONTHS. DEALER STATES CAN'T GET A REPLACEMENT ENGINE. NEED HELP IN GETTING HYUNDAI TO PROVIDE /INSTALL REPLACEMENT ENGINE..",
        "vin": "KM8JT3AB6DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112094,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 80 MPH DOWN THE HIGHWAY, ENGINE STARTED KNOCKING, WITHIN 90 SECONDS THE VEHICLE WAS DEAD ON THE SIDE OF THE ROAD.  METAL SHAVINGS IN THE OIL. ENGINE NEEDS REPLACED 5 YEARS OLD 77K MILES. WELL MAINTAINED VEHICLE OIL CHANGES REGULARLY.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110732,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HYUNDAI TUCSON HAS THE THETA 2 ENGINE. THIS ENGINE HAS ALREADY BEEN RECALLED 4 METAL SHAVINGS FROM THE A DEBURRING PROCESS CAUSES THE ENGINE TO HAVE OIL DISTRIBUTION PROBLEMS RESULTING IN ENGINE FAILURE FOR EXAMPLE A THROWN ROD. THIS IS EXACTLY WHAT HAPPENED TO MY 2013 HYUNDAI TUCSON WITH ONLY 42000 PLUS MILES ON IT. SO WHY HASN'T THE TUCSON BEEN ADDED TO THE RECALL LIST ALONG WITH THE SONATA AND SANTA FE, THEY BOTH HAD THE SAME EXACT ENGINE IN THE SAME EXACT PROBLEMS. NOW I AM STUCK WITHOUT A VEHICLE STILL HAVING TO MAKE PAYMENTS ON, AND BATTLING HYUNDAI DEALERSHIP OF LITHONIA GEORGIA, BECAUSE THEY AREN'T WILLING TO FIX THE ISSUE DUE TO AN EXPIRED WARRANTY OF 5 YEARS OR 60,000 MILES. WARRANTY IS NOT AN ISSUE AT THIS POINT, BECAUSE THE ENGINE HAS BEEN RECALLED.    THE CONSUMER STATED THE MANUFACTURER WOULD NOT REPAIR THE VEHICLE UNDER THE WARRANTY DUE TO NOT HAVING EVIDENCE OF OIL CHANGES. THE VEHICLE HAD NO OIL UPON INSPECTION. THE CONSUMER STATED THE ENGINE HAD A HOLE IN IT CAUSING THE OIL TO DRAIN OUT. *JS",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110257,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON FREEWAY, ON VACATION, WHEN HEARD CLACKING NOISE. BECAME WORSE AND ALL OF A SUDDEN THE ENGINE QUIT AND THE ENGINE LIGHT CAME ON. TOWED TO REPAIR SHOP. TOLD US THE ENGINE WOULD NEED TO BE REPLACED. NOT SURE IF TRUE, BUT WE WERE TOLD THAT THIS IS THE SAME ENGINE THAT WAS RECALLED IN THE SONATAS (WE ALSO HAVE A SONATA THAT HAD THE RECALL). QUESTIONING WHY THE MOTORS ON ALL VEHICLES WITH THAT ENGINE WERE NOT RECALLED. SEEMS THE PROBLEM IS WITH THE MOTOR, NOT THE ENGINE?!?!",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/06/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110275,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRECTION TO COMPLAINT NUMBER:11110257  DRIVING ON FREEWAY, ON VACATION, WHEN HEARD CLACKING NOISE. BECAME WORSE AND ALL OF A SUDDEN THE ENGINE QUIT AND THE ENGINE LIGHT CAME ON. TOWED TO REPAIR SHOP. TOLD US THE ENGINE NEEDED REPLACED. NOT SURE IF TRUE, BUT WE HAVE BEEN TOLD THAT THIS IS THE SAME ENGINE THAT WAS RECALLED IN THE SONATAS (WE HAVE A SONATA THAT HAD THE RECALL). QUESTIONING WHY THE MOTORS ON ALL VEHICLES WITH THAT ENGINE WERE NOT RECALLED. SEEMS THE PROBLEM IS WITH THE ENGINE, NOT THE VEHICLE.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110058,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN A STREET 35 MPH, ENGINE MADE LOUD SOUND ALL THE LIGHTS CAME  ON AND CAR SHUDDERED AND WOULD NOT DRIVE. MOVED TO SIDE OF ROAD AND TOWED TO DEALERSHIP.   THETA-II ENGINE SEIZED. NOT REPAIRABLE. DEALERSHIP AND MANUFACTURE REFUSED TO HELP IN ANY WAY DESPITE KNOWN PROBLEM. EVENTUALLY TRADED IN AS COST TO REPLACE ENGINE WITH USED ENGINE(NO NEW ONES AVAILABLE) WAS PROHIBITIVE. RECEIVED TRADE IN OF $3500 BLUE BOOK VALUE $9000.",
        "vin": "KM8JU3AC3DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104251,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BLOWN AT MILEAGE 129653. WHILE DRIVING ON INTERSTATE IN PENNSYLVANIA, ENGINE SEEMED TO LOSE POWER AT 60 MPH, IN HEAVY TRAFFIC. STARTED TO SHUTTER AND ENGINE MADE A LOT OF NOISE, BAD RATTLE SOUND.  ENGINE LOCKED UP. I COASTED TO STOP ON SIDE OF ROAD. ON JUNE 30,2017.  VEHICLE WAS TOWED TO CIOCCA HYUNDAI IN QUAKERTOWN PA, WHERE I WAS TOLD ENGINE HAD BLOWN.   HAD TO HAVE ENGINE REPLACED$5237.34 COST.  TOOK MONTH TO FIND GOOD REPLACEMENT ENGINE AS THIS WAS SAME ENGINE TYPE I WAS TOLD AS SANTE FE AND ACCORDS ON RECALL.  I PERSONALLY BELIEVE THE TUCSONS ENGINE SHOULD BE RECALLED ALSO.",
        "vin": "KM8JUCAC0DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104263,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 13, 2017, THE ENGINE IN THE TUCSON COMPLETELY SHUT DOWN WHILE DRIVING DOWN THE INTERSTATE AFTER WORK. THE VEHICLE WOULD NOT START AND HAD TO BE TOWED TO A LOCAL REPAIR SHOP IN CANYON, TEXAS. THE REPAIR SHOP INSPECTED THE VEHICLE AND FOUND THAT THE ENGINE HAD BLOWN A HOLE IN IT DUE TO NO FAULT OF SYDNEE PARKHURST AND WOULD NEED A COMPLETE REBUILD. RESEARCH WAS DONE AS TO WHAT OPTIONS WERE AVAILABLE. [XXX] CONTACTED THE VANDERGRIFF HYUNDAI IN ARLINGTON, TEXAS WHERE THE VEHICLE WAS PURCHASED AND HYUNDAI MOTORS AMERICA FOR A MANUFACTURER'S DEFECT. RESEARCH HAD SHOWN THE SAME ENGINE WAS PUT INTO SEVERAL MODELS OF HYUNDAI VEHICLES. THIS SPECIFIC ENGINE MODEL WAS ALSO INVOLVED IN A CLASS ACTION REGARDING THE 2011-2013 MODELS (BUT NOT THE 2013 TUCSON). THE LOCAL REPAIR SHOP REPLACED THE ENGINE AND SOME PARTS THREE (3) TIMES DUE TO MANUFACTURER ISSUES WITH THE PARTS FOR $8,751.28.  AFTER MORE THAN SEVEN PHONE CALLS TO EACH VANDERGRIFF HYUNDAI AND HYUNDAI MOTORS AMERICA, IT WAS LEARNED THAT NEITHER WAS WILLING TO HELP OR OFFER ANY AID OR ASSISTANCE CLAIMING THAT BECAUSE IT WAS SOLD TO A SECOND OWNER, THEY COULD NOT CONFIRM WHETHER THE PRIOR OWNER HAD BEEN NEGLIGENT IN THEIR CARE OF THE VEHICLE EVEN THOUGH IT WAS SOLD AS A CERTIFIED PRE-OWNED VEHICLE. HYUNDAI BLAMED THE OWNER FOR THE DEFECT. AFTER THE ENGINE WAS REPLACED VANDERGRIFF CONTACTED THE OWNER ATTEMPTING TO PURCHASE THE VEHICLE BACK FOR LESS THAN THE PURCHASE PRICE AND EXCLUDING THE COST OF THE ENGINE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103628,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BEGAN MAKING A KNOCKING AND BEGAN SHAKING WITHIN MINUTES THE ENGINE BLEW UP",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088892,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS ONLY 5 YEARS OLD THIS IS THE FIRST TIME I'M TAKING IT FOR INSPECTION AND IT IS READING FUEL SYSTEM NOT READY. WHEN I BOTH THE CAR THEY SAY I HAVE A TEN YEAR WARRANTY OR 100.000 WHICHEVER IS FIRST. MY CAR IS NEITHER BUT THEY ARE TELLING ME THAT IT IS NOT COVERED FOR THEM TO CHECK IT IS $230 PLUS TAX. AND MY WIPER BLADES",
        "vin": "KM8JUCAC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088370,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED INTO A PARKING LOT TO TALK ON MY PHONE AND AFTER I PULLED AWAY THE ENGINE STARTED MAKING A KNOCKING NOISE. I HAVE CHANGED THE OIL ON TIME EVERY TIME AND MOST OF ALL THE MILES ON IT ARE HIGHWAY MILES. I HAVE ISSUE THAT HYUNDAI RECALLED THE SONATA AND SANTA FE OF THE SAME YEAR AND ALSO KIA RECALLED THE SPORTAGE FOR ENGINE KNOCKING. THE ENGINE IS THE SAME EXACT ENGINE IN THE 2013 HYUNDAI TUSCON BUT IT DOESN'T HAVE A RECALL. THIS MAKE ZERO SENSE.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "03/31/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084864,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE FREEWAY, MY CAR BEGAN TO SHAKE AND FELT AS THOUGH I HAD A TIRE ISSUE. I SLOWED DOWN, AND THE VIBRATION ESCALATED SO I PULLED OVER. ONCE I WAS AT THE SIDE OF THE ROAD, THE ENGINE STARTED MAKING LOUD KNOCKING NOISES. I CALLED A TOW TRUCK AT THIS POINT AND THE CAR WAS TOWED TO A HYUNDAI DEALERSHIP WHERE IT WAS DETERMINED THAT THE ENGINE HAD BLOWN. I CONTACTED HYUNDAI CONSUMER AFFAIRS AND THEY DID A CASE REVIEW. I WAS TOLD THAT SINCE THE CAR, WHICH IS 5 YRS OLD AND HAS 87,900 MILES, IT IS OUTSIDE OF THE WARRANTY. I QUESTIONED THE RECALL ON OTHER CARS WITH THE THETA II ENGINE SUCH AS THE SANTA FE AND THE SONATA AND WAS INFORMED THAT MY CAR DIDN'T HAVE ENOUGH COMPLAINTS TO BE INCLUDED. APPARENTLY, ALTHOUGH THEY HAVE THE SAME ENGINE, THE TUSCON ENGINE IS SLIGHTLY SMALLER SO DOES NOT QUALIFY FOR THE RECALL. THE SAME ISSUES APPLY WITH THE RECALLED ENGINE THAT MY ENGINE HAS WHICH IS METAL SHAVINGS AROUND THE CRANKSHAFT. THE METAL SHAVINGS HAVE CAUSED INSUFFICIENT MOVEMENT OF OIL THROUGHOUT THE ENGINE.",
        "vin": "KM8JUCAC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081445,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING IN RESPONSE TO THE RECENT ISSUES I AM HAVING WITH MY 2013 TUCSON.  IT IS CURRENTLY SITTING (BECAUSE IT IS UNABLE TO START) AT A HYUNDAI DEALERSHIP.  I WAS TOLD FROM HYUNDAI CUSTOMER SERVICE TO HAVE IT TOWED THERE DUE TO THE ENGINE TROUBLE I AM HAVING WITH THE CAR, AND DID SO ON MARCH 16, 2018.   I DO NOT FEEL THAT THE COMPLETE ENGINE FAILURE IS DUE TO ANY NEGLIGENCE ON MY PART.  I HAVE ALWAYS KEPT UP WITH REGULAR MAINTENANCE ON THE CAR INCLUDING OIL CHANGES.  I CHOSE TO PURCHASE A HYUNDAI BECAUSE OF THEIR KNOWN RELIABILITY AND SAFETY. THESE ARE MOST IMPORTANT WHEN CHOOSING A VEHICLE TO OWN, AND I FELT HYNDAI WAS TOP IN BOTH THOSE CATEGORIES. I HAVE TWO YOUNG GIRLS TO KEEP SAFE.  HOWEVER HYNDAI HAS PROVEN TO NOT BE.  ONE MOMENT I WAS ABLE TO DRIVE MY TUSCON AND THEN THE NEXT MOMENT I AM UNABLE TO START IT AND AM LOOKING AT A COST TO FIX IT AT WELL OVER $5000.00.AUTO NATION HAS LOOKED AT THE CAR AS HAS STATED THAT THERE ARE COMPLICATIONS WITH THE CVVT GEAR AND THE TIMING CHAIN.  HENCE THE REASON THE CAR NO LONGER CAN START AND NEEDS TO BE FIXED.    I FEEL THAT THE ENGINE PROBLEMS NEED TO BE ADDRESSED AND PAID FOR BY HYUNDAI DUE TO MANUFACTURER'S ERROR.  I HAVE TRIED TO FACILITATE THESE ISSUES BY SPEAKING DIRECTLY WITH HYUNDAI CUSTOMER SERVICE. EVERY TIME I HAVE CALLED, I HAVE SPOKEN TO A DIFFERENT CUSTOMER SERVICE REPRESENTATIVE AND GIVEN A DIFFERENT CASE NUMBER.  DESPITE EXPLAINING TO A NEW PERSON THE DETAILS OF THE PROCESS I AM GOING THROUGH, EACH REPRESENTATIVES HAS HAD A DIFFERENT EXCUSE AS TO WHAT WILL HAPPEN IN REPAIRING MY CAR. THERE HAS BEEN NO CONSISTENCY ON YOUR END.  MY FAMILY AND I HAVE BEEN LOYAL CUSTOMERS OF HYUNDAI FOR YEARS.  IN RETURN, I WOULD EXPECT HYUNDAI TO BE AVAILABLE FOR ASSISTANCE IN THIS MATTER.",
        "vin": "KM8JUCAC1DU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075983,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAGS DID NOT DEPLOY DURING AN ACCIDENT IN WHICH MY CAR WAS COMPLETELY TOTALED. I WAS AT A COMPLETE STOP ON THE HIGHWAY WHEN I WAS REAR-ENDED AT FULL SPEED, WHICH CAUSED MY VEHICLE TO RICOCHET ONTO THE ONE AHEAD OF ME. TWO SERIOUS IMPACTS AND NOT ONE AIRBAG.",
        "vin": "KM8JUCAC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074709,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT AROUND 40-50 MPH, THE LIGHTS ON THE DASH SUDDENLY CAME ON AND THEN THE ENGINE OF THE CAR JUST STOPPED.  THANKFULLY NO ONE WAS HURT AND THIS DID NOT CAUSE AN ACCIDENT WITH ANOTHER VEHICLE.  ACCORDING TO THE DEALERSHIP, THE ENGINE HAS SEIZED.  WHILE SITTING IN TRAFFIC WAITING FOR A TOW, WE CHECKED THE OIL IN THE ENGINE AND THERE WAS PLENTY.  WE DID REGULAR OIL CHANGES ON THIS CAR.  WE ARE THE 2ND OWNER AND THE CAR HAS 76,000 MILES ON IT, SO IT IS NO LONGER COVERED UNDER WARRANTY.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "04/17/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065215,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON THE MORNING OF APRIL 17, 2017,  I HAD JUST TURNED ONTO A 2-LANE ROAD WHEN THERE WAS A LOUD NOISE THAT SOUNDED LIKE A GUN BEING FIRED INSIDE THE VEHICLE.  I IMMEDIATELY PULLED OVER TO FIND THAT MY PANORAMIC SUNROOF HAD EXPLODED.  I HAD JUST MADE A TURN, SO I WAS NOT GOING FAST, MAYBE 30-35 MPH, IT WAS A COOL SPRING MORNING, NOT OVERLY HOT OR COLD, THERE WAS NO PRECIPITATION, NO EXTREME TEMPERATURES.  I CALLED THE HYUNDAI DEALER WE BOUGHT THE VEHICLE FROM, AND THEY SAID IT WAS NOT A DEFAULT IN THE VEHICLE, IT WAS NOT THEIR FAULT, AND THEY WOULD NOT REPLACE IT.",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "06/14/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051599,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING 40 MPH, THE INSTRUMENT PANEL FAILED TO ILLUMINATE. THE CONTACT HAD THE VEHICLE TOWED TO THE DEALER (AUTONATION HYUNDAI MALL OF GEORGIA, 3445 BUFORD GA 30519) WHERE IT WAS DIAGNOSED THAT THE VEHICLE HAD A FUSE FAILURE. THE VEHICLE WAS REPAIRED. A FEW MONTHS LATER, WHILE STARTING THE VEHICLE, THE CONTACT SHIFTED INTO DRIVE AND DEPRESSED THE ACCELERATOR PEDAL, BUT THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED, BUT COULD NOT OFFER ANY ASSISTANCE. THE FAILURE MILEAGE WAS APPOXIMATLY 8,000. *TT  UPDATED 8/9/18*JB",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043106,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MERGING ONTO THE HIGHWAY DRIVING AROUND 65-70 MPH, THE CAR'S CHECK ENGINE LIGHT, OIL LEVEL LIGHT AND BATTERY LIGHT ALL CAME ON AND THE CAR POWERED DOWN AND LOST ALL SPEED WITHIN A .5 MILE DISTANCE. AFTER HAVING IT TOWED, THE CAR NOW NEEDS A NEW ENGINE ENTIRELY DUE TO FAULTY BEARINGS THAT CAUSED THE CAR TO SEIZE WHILE DRIVING.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039626,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AT 5AM, 10/12/2017.  I WAS A COUPLE OF MILES FROM MY HOME, ON ROUTE 66, WHEN MY PANORAMIC SUNROOF EXPLODED.  THE SOUND WAS SO LOUD, IT WAS LIKE A SHOTGUN GOING OFF NEXT TO MY EAR. THE TEMPERATURE AT THE TIME WAS 55 DEGREES, AND I WAS ONLY GOING 35 MPH.  I PULLED OVER IMMEDIATELY TO SEE WHAT HAD HAPPENED.  SINCE THE SHADE WAS DRAWN ON THE SUNROOF, I HAD NO IDEA AT FIRST THAT THAT WAS THE PROBLEM. ONCE I SAW THE GLASS ALL OVER THE ROOF, I LOOKED AT THE SUNROOF, AND SAW THE HUGE HOLE",
        "vin": "KM8JUCAC9DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "09/09/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030582,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT. 9TH 2017 WE WERE EVACUATING FROM HURRICANE IRMA. WE HEADED NORTH FROM GA. ON I-77 IN N.C ALL THE LIGHTS CAME ON AND CAR SLOWED DOWN. WE PULLED OVER AND SHUT IT OFF. WHEN TURNING IT BACK ON A LOUD HORRIBLE NOISE WAS COMING FROM THE FRONT. WE WERE ABLE TO SLOWLY GET OFF THE EXIT. WE FOUND A MECHANIC SHOP AND TOOK IT THERE TO SEE IF THEY COULD TELL US WHAT IT WAS. THE CAR NEVER GAVE US ANY WARNINGS OR LIGHTS CAME ON PRIOR TO THIS. WHEN WE PURCHASED THE CAR IN 2016, WE HAD TAKEN IT TO THE HYUNDAI DEALER WE BOUGHT IT FROM DUE TO A KNOCKING NOISE COMING FROM THE FRONT. WE TOOK IT ABOUT 3 TIMES AND TO NO AVAIL THEY DIDN'T FIND ANYTHING. WE PURCHASED THE CAR WITH ALMOST 35,000 MILES AND IT WAS AT 78,000 MILES WHEN IT LEFT US STRANDED IN NC. ON MONDAY 9/11/17 THE MECHANIC CALLED US AND TOLD US HE FOUND OIL AND METAL SHAVINGS IN THE PAN AND THAT THE ENGINE HAD FAILED. WE'VE ONLY HAD THIS CAR FOR 1 1/2 YRS. NOW NOT ONLY WE WERE OUT OF POCKET FOR 4 NIGHTS AT A HOTEL, WE HAD TO RENT A UHAUL TO TRANSPORT THE CAR BACK TO GA. FILED A COMPLAINT WITH HYUNDAI ON 9/16/17. THEY GOT BACK TO ME ON 9/28 AND 9/29. I WAS TOLD THE SAVANNAH HYUNDAI DEALER WANTS US TO TOW THE CAR TO THEIR SERVICE DEPT. AT OUR EXPENSE PLUS WE WOULD HAVE TO PAY THEM $400 SO THEY CAN DO A FULL INSPECTION ON OUR CAR. THE SAME CAR I WAS BRINGING TO THEM WITH ISSUES BEFORE WE WERE OUT OF WARRANTY. I AM AWARE OF A LOT OF ISSUES WITH THESE ENGINES AND THEY NEED TO BE RECALLED AND REPLACED.",
        "vin": "KM8JUCAC9DU"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015889,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ORDERING AN OIL CHANGE ONLINE APPT. AND THERE WAS A NOTE SATING A RECALL ON AIRBAGS FOR MY VEHICLE. I VE BEEN SERVICING MY VEHICLES AT DEALERSHIPS IN 3 STATES AND NEVER ONCE TOLD OR SENT AN EMAIL OR LETTER. I LIVE IN GA AS OF MARCH 2017.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "07/30/2017",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11014693,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 HYUNDAI TUCSON. WHILE OPERATING THE VEHICLE AND ATTEMPTING TO MAKE A SHALLOW TURN, THE STEERING COLUMN WAS TURNED, BUT THE VEHICLE DID NOT RESPOND. AS A RESULT, THE VEHICLE DROVE OVER AN EMBANKMENT, COLLIDED WITH A TREE, AND CAUGHT FIRE. A POLICE REPORT WAS FILED. THE FIRE DEPARTMENT WAS CONTACTED AND THE FLAMES WERE EXTINGUISHED. THE VEHICLE WAS TOWED TO AN IMPOUND LOT. THE VEHICLE WAS THEN TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED DESTROYED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE DRIVER SUFFERED BROKEN BONES IN THE FOOT AND MODERATE BRUISING FROM THE CRASH. MEDICAL ATTENTION WAS REQUIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012733,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RELIGIOUSLY MAINTAINED MAINTENANCE ON MY SUV, BUT OUT THE BLUE, LAST WEEKEND 7/29-30 I WAS AT A LIGHT AND THE CHECK ENGINE LIGHT APPEARED AND SOMETHING BROKE IN THE ENGINE AREA, I HEARD A SNAP, IT SOUNDED LIKE A BELT. WELL, I FLAT BED TOWED THE VEHICLE TO THE DEALERSHIP AND TO MY AMAZEMENT, I RECEIVED A CALL FROM THE SERVICE ADVISOR THAT I NEEDED A NEW ENGINE? THE COST WOULD BE AROUND $8,000.00. I RELIGIOUSLY HAD EVERY WARRANTY SERVICE DONE AND THEY CAME BACK WITH MY CRANK SHANK PINS AND PISTONS WERE WORN OUT AND ROD KNOCKING WAS TAKEN PLACE, PLUS NO MORE ROD BEARINGS. I ASKED WHAT COULD OF CAUSED THIS AND HE STATED, \"LACK OF OIL?\". I NEVER MISSED AN OIL CHANGE ON THE SUV, SO HOW COULD THIS BE?? ALSO, METAL SHAVINGS WERE FOUND IN THE OIL PAIN AND CYLINDER 2 AND 3 GONE. THERE WAS A RECALL ON THE SANTA FE SUV 2011-2013, KIA 2011-2014 WHEREBY THE SAME THING CRANKPINS, METAL SHAVINGS FOUND, THE EXACT WORDING FROM THE CLASS ACTION LAWSUIT (FOUND ONLINE) IS \"DURING MACHINING OF THE ENTIRE ENGINE, CRANKSHAFT AND CRANKPINS, METAL SHAVINGS MAY HAVE BEEN LEFT WITHIN THE CRANKSHAFT OIL PASSAGES, OIL MAY BE BLOCKED AND CAUSE THE CONNECTING RODS TO WEAR, WHICH WOULD THEN CAUSE HEM TO FAIL AND SEIZE THE ENGINE. NOW, THEY DIDN'T LIST MY VEHICLE, BUT IT'S THE EXACT AND SHOULD BE INVESTIGATED SINCE MY VEHICLE HAS THE SAME ENGINE! ALSO, THIS OCCURRED AT EXACTLY 100,000 MILES WHEN THE WARRANTY EXPIRED. NOW, THE SERVICE ADVISORS ARE BEING HORRID AND HEATED EXCHANGES ARE GOING ON WITH THE CAR DEALERSHIP TEAM ON MY CAR REPAIR. IT'S STILL SITTING AT THE DEALERSHIP AND I'M IN AN EXPENSIVE RENTAL. I HAD JUST MADE MY LAST PAYMENT....",
        "vin": "KMBJU3AC5DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993737,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 65 MPH, THERE WAS A KNOCKING NOISE COMING FROM THE FRONT PASSENGER SIDE OF THE ENGINE COMPARTMENT WHILE ACCELERATING. THE ENGINE SEIZED WITHOUT WARNING. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND ATTEMPTED TO START THE ENGINE, BUT IT FAILED. THE VEHICLE WAS TOWED TO THE DEALER (HEADQUARTERS HYUNDAI LOCATED AT 3775 N US HIGHWAY 17-92, SANFORD, FL, 32773) WHERE IT WAS DIAGNOSED THAT THE SECOND BEARING MELTED AND THE ENTIRE ENGINE NEEDED TO BE REPLACED. THE DEALER INFORMED THE CONTACT THAT THE VEHICLE WAS OUT OF WARRANTY AND COULD NOT BE SERVICED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V226000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "KM8JU3AC7DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990692,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2013 HYUNDAI TUCSON WITH 70,000 MILES ON IT.  I MAINTAIN IT PROPERLY, USE SYNTHETIC OIL REGULARLY, BUT THE ENGINE SEIZED YESTERDAY WHILE DRIVING ON THE PENNSYLVANIA TURNPIKE.  HYUNDAI KNOWS THEY HAVE A PROBLEM WITH THEIR ENGINES AND I AM HOPING MY ACTION TODAY WILL LEAD TO A RECALL OF THIS TYPE OF VEHICLE.",
        "vin": "KM8JUCACXDU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "04/19/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985133,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING THE VEHICLE IN 2013, THE SERPENTINE BELT HAS SHREDDED ON MULTIPLE OCCASIONS WHILE DRIVING AT SPEEDS OF 50-70 MPH. THE SERPENTINE BELT HAS BEEN REPLACED 5 TIMES DUE TO A CONTINUOUS OIL LEAK SATURATING THE BELT OVER EACH PERIOD OF 6-9 MONTHS, WATER PUMP PULLEY DEFECT AND THE ALTERNATOR SEIZING AFTER IT WAS REPLACED 90 DAYS PRIOR. THE CAR WAS IN MOTION ON CITY STREETS. EACH TIME THE BELT SHREDDED, THE VEHICLE REQUIRED A TOW TRUCK (TWICE)",
        "vin": "KM8JUCAC3DU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/22/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979931,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUETOOTH ANSWER BUTTON ON THE STEERING WHEEL DOES NOT WORK NOR DOES THE VOLUME DOWN. THEREFORE, I AM HAVING TO TAKE MY EYES OFF OF THE ROAD TO ANSWER A PHONE AND TURN VOLUME DOWN. THIS MAKES THE HANDS FREE FEATURE NON EXISTENT. THIS HAPPENS WHILE DRIVING.",
        "vin": "KM8JU3AC8DU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "06/30/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978772,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND THE ENGINE SEIZED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE CAUSE OF THE FAILURE COULD NOT BE DUPLICATED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V226000 (ENGINE). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT NOTHING COULD BE DONE TO ASSIST. THE FAILURE MILEAGE WAS APPROXIMATELY 61,000.",
        "vin": "KM8JUCAC4AU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ON DIFFERENT ROADS (I.E. - INTERSTATE, CITY,) THE ENGINE REVS OVER TO THE RIGHT WITHOUT MY CHANGING GAS PEDAL PRESSURE.  MY CAR IS ON CRUISE WHENEVER POSSIBLE. THIS HAPPENS INTERMITTENTLY WHILE DRIVING. SPEED CAN VARY, AS ON THE INTERSTATE OR ON A CITY STREET. I PLACED A DATE WHEN IT PROBABLY STARTED, AS IT HAS BEEN GOING ON A LONG TIME. HYUNDAI TODAY TOLD ME THERE IS A REVVING ISSUE, BUT NOT THAT APPLIES TO MY VEHICLE; HOWEVER, I AM ON THE PHONE TELLING HIM IT HAS BEEN HAPPENING TO MY VEHICLE A LONG TIME.",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2017",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOUCH SCREEN (NAVIGATION/RADIO/ETC) DOES NOT LIGHT UP WHEN THE WEATHER GETS TOO COLD. THE SCREEN HAS A BACK LIGHTING BUT IS COMPLETELY BLACK. THE RADIO WORKS AND I AM ABLE TO CHANGE CHANNELS. WHEN I TOUCH THE BLACK SCREEN, I CAN TELL THAT IT IS CONTROLLING IT BECAUSE IF I HIT THE RIGHT SPOT, THE CHANNEL WILL CHANGE. I HAVE TAKEN IT TO THE DEALERSHIP TWICE FOR REPAIR. THE FIRST TIME IT WAS A WARM DAY AND THE DEALER WASN'T ABLE TO FIND AN ISSUE. THE SECOND TIME, THEY TOLD ME THE SCREEN WAS OBVIOUSLY DEAD AND I WOULD NEED TO REPLACE IT AT A COST OF $600. ONE WEEK LATER AFTER I HAD BEEN DRIVING IT FOR SEVERAL HOURS, THE SCREEN TURNED BACK ON SO IT OBVIOUSLY IS STILL OPERABLE. I HAVEN'T HAD IT TURN ON AGAIN SINCE. I FOUND A TSB THAT I BELIEVE MAY ADDRESS THE PROBLEM - TSB #14-01-031-1. NHTSA ID #10060593.",
        "vin": "KM8JU3AC0DU"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894406,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT THE VEHICLE INDEPENDENTLY ROLLED BACK AFTER THE GEAR SHIFTER WAS PLACED IN PARK. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO A PARKED VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "KM8JT3AB0DU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/11/2016",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846213,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR NEW IN 2013. HAD VEHICLE IN FOR 20,000 MILES SERVICE AT 19, 700 MILES. TREADS ON ALL 4 TIRES ARE AT 5/32. TIRES ARE THE ORIGINAL KUMHO SOLUS KL21. WAS IN CONTACT WITH HYUNDAI AND KUMHO, NO WARRANTY ON THE OE TIRES. NEED TO REPLACE THESE TIRES. I DIDN'T EXPECT A NEW CAR TO HAVE SUCH CHEAPLY MADE TIRES ON IT.",
        "vin": "KM8JUCAC6DU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "06/21/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726626,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI PANORAMIC SUNROOF EXPLODED  FATHER'S DAY 2015, WE WERE TRAVELING WESTBOUND ON HWY 70 FROM LITTLE ROCK TO HOT SPRINGS AR AROUND 10:45 AM.  IT WAS NOT EXCESSIVELY HOT, AND IT WAS A BIT OVERCAST.  THERE WAS NO NOISE ALERTING US TO THE IMPENDING EXPLOSION. AND THAT EXPLOSION SOUNDED JUST LIKE A GUNSHOT AT VERY CLOSE RANGE.  THANKFULLY, WE HAD THE SHADE CLOSED WHEN THE FORWARD PORTION OF THE SUNROOF LITERALLY BLEW UP, SENDING A THOUSAND GLASS SHARDS THRU THE AIR, ONTO THE SHADE, AND BOUNDING OFF THE TOP AND REAR OF THE CAR...WE WERE ABLE TO PULL OVER AND REMOVE MUCH OF THE GLASS SHARDS, BUT THE GLASS STILL CLINGING TO THE FRAME OF THE SUNROOF WAS CURVED UPWARD, LIKE TO HAD LITERALLY BLOWN \"UP\"....I WENT ONLINE AND SAW MANY PICTURES AND STORIES OF THIS SAME THING HAPPENING TO OTHERS, THROUGHOUT THE COUNTRY.  THE SAFETY RAMIFICATIONS SEEM MORE THAN ENOUGH TO WARRANT SOME SORT OF INVESTIGATION AND ACTION BY THE HYUNDAI COMPANY.....UPDATED 08/24/15*BF",
        "vin": "KM8JU3AC6DU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/18/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10725905,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 30 MPH, A PIECE OF METAL FROM ROAD WORK PUNCTURED THE TIRE. THE CONTACT LOST CONTROL OF THE VEHICLE AND IT ROLLED OVER THREE TIMES. THE FRONT DRIVER SIDE AIR BAG FAILED TO DEPLOY. THE CONTACT EXPERIENCED A HEAD INJURY, A BLACK EYE, MUSCLE DAMAGE, AND BRUISING THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 36,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714641,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED MULTIPLE TIMES. IN ADDITION, THE PUSH TO START FAILED INTERMITTENTLY TO START OR SHUT OFF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS AN UNKNOWN CODE REGISTERED AND CORRECTED ITSELF HOWEVER, THE FAILURE RECURRED MULTIPLE TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "KM8JUCAC8DU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/11/2015",
        "dateOfIncident": "03/08/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10693580,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED THAT AFTER CRASHING INTO ANOTHER VEHICLE, THE AIR BAGS FAILED TO DEPLOY AND THE SEAT BELT FAILED TO RETRACT.  A POLICE REPORT WAS FILED. THE PASSENGER SUFFERED A FACIAL LACERATION AND A BLACK EYE. THE VEHICLE WAS TAKEN TO A YARD WHERE NO INSPECTION HAD BEEN PERFORMED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 18,000.    UPDATED 4/20/15*CN",
        "vin": "KM8JU3ACXDU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693030,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2013 HYUNDAI TUSCAN. THE CONTACT STATED THAT WHILE DRIVING AT 2 MPH, THE VEHICLE HESITATED BEFORE MOVING FORWARD. THE VEHICLE WAS TAKEN TO A DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KM8JU3AC1DU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "11/22/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681541,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE LOST ALL POWER AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. ALSO, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE REGAINED POWER. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "KM8JU3AC5DU"
    },
    {
        "components": "SUSPENSION,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/26/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658674,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY TIRES HAD BEEN EXTREMELY WORN, VIRTUALLY NO TREAD LEFT FOR ONLY HAVING THE CAR FOR 6 MONTHS. I BEGAN NOTICING THAT DRIVING WAS MUCH MORE DIFFICULT THAN EXPECTED IN RAIN AND SNOW, UNTIL I REALIZED MY TIRES WEREN'T IN LINE LIKE THEY WERE SUPPOSED TO. ONCE I BROUGHT IT TO THE DEALERSHIP THEY HAD REALIZED THAT MY CAMBER BOLTS WEREN'T PROPERLY TIGHTEN WHICH CAUSED MY TIRES TO BECOME OUT OF LINE AND BEGIN TO TILT CAUSING THE INSIDES TO BECOME VERY WORN DOWN. I WANT TO BRING THIS TO SOMEONES ATTENTION IN HOPES THEY CAN FIGURE OUT WHAT MANUFACTURER MY VEHICLE CAME FROM TO HELP PREVENT THE SAME ISSUES FOR OTHER VEHICLE OWNERS.  *TR",
        "vin": "KM8JUCAC0DU"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "07/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10609839,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire U.S.A., Inc.",
                "productMake": "KUMHO",
                "productModel": "SOLUS KH25",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON EQUIPPED WITH KUMHO TIRES, TIRE LINE: SOLUS KH25, TIRE SIZE: 225/45R17. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE REAR PASSENGER SIDE TIRE BLEW OUT AND THE CONTACT CRASHED INTO A CONCRETE MEDIAN. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED NECK AND BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED AND DECLARED AS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE TIRE AND VEHICLE FAILURE MILEAGE WAS 15,000.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "AIR BAGS,TRACTION CONTROL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "07/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609279,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON.  THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE TIRE TRACTION WARNING LIGHT ILLUMINATED.  THE VEHICLE VIBRATED AND THE REAR PASSENGER TIRE BLEW OUT. THE VEHICLE SPUN OUT OF CONTROL CAUSING THE VEHICLE TO CRASH INTO A CONCRETE DIVIDER. THE AIR BAGS DID NOT DEPLOY.  A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED.  THE VEHICLE WAS DESTROYED.  THE FAILURE AND CURRENT MILEAGE WAS 15,000.",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606493,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME WHEN THE CAR FELT FUNNY AND STARTED TO SHAKE A LITTLE. I PULLED OFF THE ROAD INTO A PARKING LOT.  I GOT OUT AND SAW THAT THE SIDE OF MY TIRE WAS BLOWN OUT.  MY HUSBAND CAME AND CHANGED THE TIRE. TO OUR SURPRISE IT WAS NOT ONLY BLOWN OUT ON THE OUTSIDE BUT ON THE INSIDE ALSO.  IT APPEARED TO US THAT THIS TIRE WAS DEFECTIVE.  WE HAD ONLY HAD THE CARE A LITTLE OVER A YEAR.  WE TOOK IT BACK TO THE DEALER WHICH INFORMED US THAT SINCE WE DIDN'T BUY THEY'RE WARRANTY PLAN FOR THE TIRES THEY COULDN'T HELP US.  IF THE PEOPLE THAT SOLD US THE TIRE CAN'T HELP THEN WHO DO WE GO TO.  FEELING UNSAFE DRIVING WITH THE OTHER TIRES THAT MAY BE JUST AS BAD WE DECIDED TO REPLACE THEM ALL.  WE WENT TO OUR LOCAL TIRE PLACE AND BOUGHT 4 NEW TIRES.   *TR",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10598059,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2013 HYUNDAI TUCSON. THE CONTACT STATED WHILE DRIVING AT AN UNKNOWN SPEED, ANOTHER VEHICLE CRASHED INTO THE FRONT DRIVER'S SIDE AND AS A RESULT, THE CONTACT CRASHED INTO A POLE. THE CONTACT MENTIONED THE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS DESTROYED. THE CONTACT RECEIVED MEDICAL ATTENTION FOR MINOR INJURIES. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS NOT AVAILABLE.  REMAILED 07/29/14*LJ     UPDATED 8/15/14*CN   UPDATED 08/21/2014 *JS",
        "vin": "KM8JUCAC7DU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2014",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574858,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RED AIRBAG LIGHT ON DASH TURNS ON AND OFF RANDOMLY WHILE DRIVING. THIS IS THE RED AIRBAG LIGHT...NOT THE PASSENGER AIRBAG LIGHT. WE HAVE HAD IT \"FIXED\" 3 TIMES AT THE DEALER, AND IT CONTINUES TO HAPPEN. WE HAVE HAD THE DRIVERS SEAT AIRBAG SENSOR REPLACED, PASSENGER SEAT CUSHION ASSY-FR SEAT REPLACED, AND CODES RESET. SPECIFICALLY GDS CODE B1490 AND PODS RESET. THE CODES WERE RESET MARCH 14, 2014 AND ON MARCH 22, 2014 THE RED AIRBAG LIGHT BEGAN TURNING ON AND OFF AGAIN. WE KNOW HYUNDAI HAS HAD AIRBAG PROBLEMS IN THE PAST. THAT IS WHY WE ARE REPORTING THIS COMPLAINT. HOPEFULLY THIS IS JUST A SINGLE INCIDENT, NOT A GIANT AIRBAG PROBLEM AGAIN!  *TR",
        "vin": "KM8JT3AB4DU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2013",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556959,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ENTERING AN ATTENDED AUTOMATIC CAR WASH, I PLACED THE CAR IN NEUTRAL, FOOT OFF THE BRAKE, AS INSTRUCTED BY ATTENDANT.  THE CAR CONTINUED TO MOVE FORWARD, SLOWLY AND TAPPED THE CAR IN FRONT.  THEY STOPPED THE CAR WASH AND SAID THE CAR HAD BEEN IN GEAR.  HOWEVER, IT WAS IN NEUTRAL.  WHEN THEY RESTARTED THE CAR WASH, MY CAR CONTINUED TO CREEP FORWARD, WITH MY HAVING TO TAP THE BRAKE REPEATEDLY TO MAINTAIN A SAFE DISTANCE FROM VEHICLE IN FRONT.  LATER THAT DAY I CHECKED THIS ON A LEVEL SURFACE IN A PARKING LOT.  WHEN THE CAR WAS PLACED IN NEUTRAL WITH THE ENGINE RUNNING, AND FOOT OFF THE BRAKE, IT WOULD CREEP FORWARD AT A SLOW WALK SPEED.  WHEN IT WAS IN NEUTRAL WITH THE ENGINE TURNED OFF,AND FOOT OFF BRAKE,  THE CAR WOULD NOT MOVE.  IT APPEARS THAT THE TRANSMISSION IS ENGAGING TO SOME DEGREE EVEN WHEN IN NEUTRAL.  THIS CONSTITUTES A HAZARD SINCE THE CAR MAY MOVE IN SITUATION LIKE A CAR WASH OR OTHER  CIRCUMSTANCE WHERE IT IS PLACED IN NEUTRAL WITH BRAKE OFF AND ENGINE RUNNING.   ON THE DAY AFTER THIS INCIDENT, I RECORDED A VIDEO DOCUMENTING THIS ISSUE.   *TR",
        "vin": "KM8JUCAC5DU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544079,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "SOLUS",
                "productYear": "9999",
                "size": "P225/60R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 HYUNDAI TUCSON EQUIPPED WITH KUMHO SOLUS TIRES, SIZE: 225/60/R17. THE CONTACT STATED THAT WHILE DRIVING 75 MPH, THE REAR PASSENGER'S SIDE TIRE EXPLODED. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD AND THE DEFECTIVE TIRE WAS REPLACED WITH A SPARE. THE VEHICLE WAS THEN TAKEN TO AN AUTHORIZED DEALER, WHO REPLACED THE SPARE TIRE WITH A NEW TIRE. THE CONTACT WAS ALSO INFORMED THAT DUE TO THE FAILURE THE INNER FENDER LINER, UNDER BUMPER PLATE, SHOCK BOOT, AND THE MUD GUARD WOULD ALL NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 2,100.",
        "vin": "KM8JU3AC2DU"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/14/2013",
        "dateOfIncident": "02/18/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535384,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN IN SHOP ABOUT 8 TIME FOR PULLING TO RIGHT 1ST THEY SAID IT WAS BAD TIRES SWITCHED OUT BUT STILL CONTINUED TO PULL WENT IT SHOP AGAIN SAID IT WAS THE TIRES SO SWITCHED OUT AGAIN TOOK ANOTHER DEALER SAID THAT IT WAS THE CROWNING IN ROAD I DROVE OTHER TUCSON'S AND THEY DID NOT PULL THEN THEY SAID IT WAS BECAUSE OF ALL THE MILEAGE THAT WAS ON MY CAR NEXT THEY SAID IT WAS PULLING BC OF ELECTRONIC STEERING ID REALLY LIKE TO KNOW WHAT IS WRONG WITH THE CAR. I HAVE A REGIONAL PERSON COMING DOWN ON THE 28TH OF AUG TO LOOK INTO CAR PULLING TO RIGHT. ALSO HAVE TOOK MY CAR TO FIRESTONES AND THEY SAY THAT THERE IS SOMETHING DEFINITELY WRONG WITH THE TOW AND ALIGNMENT YET THE DEALER INSISTS THAT IS NOT THE PROBLEM.  *TR",
        "vin": "KM8JU3AC4DU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514413,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HYUNDAI TUCSON 2013, HAS DUAL SUNROOFS. THE REAR ONE EXPLODED WHILE I WAS DRIVING ON THE HIGHWAY. IT COULD HAVE CAUSED ME TO CRASH AND SERIOUSLY INJURE MYSELF.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/01/2012",
        "dateOfIncident": "09/28/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478221,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS STOPPED BRIEFLY ON WINDSHIELD DURING RAIN WHILE DRIVING. FOLLOWING DAY WHILE PARKED PREPARING TO DEPART WIPERS WERE TURNED ON, WIPERS MOVED UP ABOUT SIX INCHES AND STOPPED ON THE WINDSHIELD. NO RESPONSE AT WIPERS FROM CONTROLS DURING HI-LO, INTERMITTENT OR WASH SETTINGS.  UNABLE TO USE VEHICLE. THE FOLLOWING DAY THE DEALER SERVICE DEPARTMENT FOUND LOOSE WIPER MOTOR WIRING CONNECTOR AND PINS.  *TR",
        "vin": "KMBJUCAC5DU"
    }
]