[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763819,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE ALPINE TRAILER EQUIPPED WITH POWER KING TOWMAX TIRES, SIZE  ST235/80R16 (NA). WHILE DRIVING APPROXIMATELY 55 MPH, THE REAR PASSENGER SIDE TIRE EXPERIENCED A BLOW OUT. APPROXIMATELY 200 MILES LATER, THE FRONT PASSENGER SIDE TIRE EXPERIENCED A BLOW OUT. APPROXIMATELY 400 MILES LATER, THE FRONT DRIVER SIDE TIRE EXPERIENCED A BLOW OUT. THE CONTACT INDICATED THAT THE FAILURES ALL OCCURRED DURING THE SAME TRIP. THE CONTACT DISCOVERED DAMAGE TO THE REAR DRIVER SIDE TIRE AND REMOVED THE TIRE FROM THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE VEHICLE FAILURE MILEAGE WAS 5,000 AND THE TIRE FAILURE MILEAGE WAS 4,000.",
        "vin": "4YDF35520DE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/26/2015",
        "dateOfIncident": "07/26/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743545,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND BLOW OUT, THE LAST TWO TIMES OUT WITHIN A MONTH. THE TIRES FAILED ON OPPOSITE SIDES OF THE RV, TIRE PRESSURES WERE CHECKED AND TOP OFF AFTER WINTER STORAGE (INDOORS). BOTH TRIPS THE OUTDOOR TEMPERATURE WAS APPROXIMATELY 90 DEGREES. BOTH SIDES OF THE RV WERE DAMAGED AFTER THE BLOW OUTS, METAL SIDING AND FENDER WELL PARTS WERE DESTROYED.",
        "vin": "4YDF35028CE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640849,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE ALPINE RECREATIONAL TRAILER EQUIPPED WITH POWER KING TOW MAX TIRES, SIZE: ST235/80R16E (NA). WHILE DRIVING APPROXIMATELY 45 MPH, THE FRONT PASSENGER SIDE TIRE TREAD SEPARATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DISCOVERED THAT THREE TIRES EXPERIENCED TREAD SEPARATION. THE LOCATION OF THE DEFECTIVE TIRES WERE UNKNOWN. THE TIRES WERE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 800.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638847,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE ALPINE RV BEING TOWED BY A 2013 DODGE RAM 3500. THE CONTACT STATED THAT THE MICROWAVE FREQUENTLY TURNED ON AND OFF. THE MICROWAVE CONVECTION OVEN WAS MANUFACTURED IN JANUARY OF 2013, MODEL NUMBER CFMV154CLS AND SERIAL NUMBER KG30102106. THE CONTACT NOTICED THAT ITEMS INSIDE OR NEAR THE MICROWAVE BURNED WHEN THE UNIT WAS NOT ACTIVATED. AS AN INTERIM REPAIR, THE CONTACT DISCONNECTED THE MICROWAVE TO PREVENT THE POSSIBILITY OF A FIRE. THE MANUFACTURER STATED THAT THE UNIT WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V136000 (ELECTRICAL SYSTEM). THE FAILURE WAS NOT REMEDIED. THE RV WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "4YDF34920DE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638576,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOWMASTER",
                "productMake": "TOWMASTER",
                "productModel": "TOWMASTER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "RV WITH 1088 MILES ON TIRES.  HAD A BLOWOUT ON THE FREEWAY. TIRE COMPLETELY SHREDDED WITH TREAD SEPARATED THROUGHOUT.  WHEN WE HAD THE TIRES REPLACED 3/5 TIRES WERE DAMAGED.  1 SHREDDED THAT CAUSED THE BLOWOUT AND TWO OTHER WITH LARGEST BLOBS INSIDE THE TIRE.  THESE TYPE OF TIRES ARE VERY UNSAFE AND SHOULD BE REMOVED FROM THE MARKET.  *TR",
        "vin": "4YDF34927DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "12/28/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559825,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A RETIRED AIRFORCE AIRCRAFT TECHNICAN.I HAVE A CDL. THEREFORE,I KNOW THE IMPORTANCE OF PROPER VEHICLE MAINTENANCE.  THERE HAS ONLY BEEN 2 TRIPS(PGH.PA. & DALLAS,TEX.)ON THIS RV SINCE PURCHASED.ON THE DAY IN QUESTION,I CHECKED AIR PRESSURE OF ALL TIRES(TOW VEHICLE & RV).I WAS ON I-20 EASTBOUND ABOUT 65 MI. FROM DALLAS,TEXAS WHEN,I HEARD A LOUD BANG.THE RVPASSENGER SIDE FRONT TIRE BLEW OUT.IN ADDITION TO THE BLOWN TIRE,DAMAGE WAS DONE TO SLIDE OUT.I HAD NO PRIOR INDICATION THAT ANYTHING WAS WRONG WITH THE 5TH WHEEL I WAS TOWING.I HAD NOT RUN OVER ANYTHING THAT WOULD HAVE CAUSED DAMAGE TO THE TIRE.I DID NOT EXCEED THE MAXIMUM SPEED OF 65MPH RECOMMENDED BY TIRE MANUFACTURER(POWER KING TOWMAX STR 235/80R16E).I HAVE BEEN TOWING RV'S FOR OVER 7 YRS. I HAVE NEVER HAD A TIRE ISSUE UNTIL NOW. I ACQUIRED THE KEYSTONE ALPINE 3600RS ON 4/28/2013 AND HAVE HAD PROBLEMS WITH IT FROM DAY ONE. I HAVE LEARNED TOO LATE AND TO MY DISMAY ABOUT ALL THE BLOW-OUT PROBLEMS WITH THE POWER KING TOWMAX TIRES VIA THE INTERNET.I FEEL THAT MY LIFE WILL BE IN JEOPARDY IF I CONTINUE TOWING WITH THESE DEFECTIVE TIRES. NOT TO MENTION,WORRYING ABOUT ANOTHER POSSIBLE BLOW-OUT.THESE TIRES SHOULD BE RECALLED.I FEEL THESE TIRES ARE NOT THE PROPER SIZE TIRES TO BE INSTALLED ON MY CURRENT RV.MY PREVIOUS 5TH WHEEL HAD A GVWR OF 16,000 LBS AND TIRE SIZE OF LT235/85R16 LOAD RANGE G (110 PSI).HOWEVER,THE GVWR OF THE KEYSTONE ALPINE I NOW HAVE IS 15,500 LBS WITH TIRE SIZE OF ST 235/80R16 LOAD RANGE E. I FEEL THESE TIRES ARE NOT CAPABLE OF HANDLING THE WEIGHT OF MY KEYSTONE ALPINE 5TH WHEEL.I FEEL KEYSTONE RV CORPORATION SHOULD HAVE TO PAY FOR DAMAGES TO MY RV AND REPLACE ALL TIRES AND ASSOCIATED HARDWARE (I.E. PROPER RIMS TO HANDLE LOAD RANGE G TIRES AND BRAKE DRUMS WITH PROPER SIZE LUG NUT STUDS FOR UPGRADED RIMS). WHEN WILL ANYTHING BE DONE ABOUT THESE TIRES? DOES SOMEONE HAVE TO GET INJURED OR DIE FIRST!!!!!!  *TR",
        "vin": "4YDF36026DE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/03/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558385,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "ALPINE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOWMASTER",
                "productMake": "TOWMASTER",
                "productModel": "TOWMASTER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE BOUGHT A KEYSTONE ALPINE NOV 2012 AND MADE 5000 MILES ON THE 5TH WHEEL TIRES. TRAVELING FROM MPLS TO MADISON WI HAD A BLOW OUT CAUSING SEVERAL THOUSANDS OF DOLLARS TO THE 5TH WHEEL PLUS THE WRECKER SERVICE FEES. THIS WAS ON A TWO LANE HIGHWAY AND PARTS OF THE TIRE WENT ALL OVER INTO THE OPPOSITE LANE CAUSING GREAT DANGER THE TIRE WAS A TOWNMASTER ST235/80R16. WE ENDED UP HAVING TO BUY 4 NEW FIRESTONE TIRES TO ENSURE OUR SAFETY.  *TR",
        "vin": "4YDF35023DE"
    }
]