[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Kaufman Trailers of NC, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242590,
        "products": [
            {
                "manufacturer": "Kaufman Trailers of NC, Inc.",
                "productMake": "KAUFMAN",
                "productModel": "TRAILER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A HYDRAULIC DUMP TRAILER FROM KAUFMAN TRAILER MANUFACTURER. WHEN I  REQUESTED AN OPERATIONAL, SAFETY AND USER MANUAL FROM THE COMPANY, THEY COULD NOT PROVIDE ONE  AND DID NOT SEEM TO CARE ABOUT MY REQUEST FOR SAFETY. MY CONCERN IS THAT THERE ARE MANY SAFETY  AND OPERATIONAL ISSUES THAT ARE NOT ADDRESSED IN WRITING AND THE COMPANY NEEDS TO PROVIDE A  USER MANUAL. A COMPETITOR TRAILER COMPANY BRI-MAR TRAILER MANUFACTURER PROVIDES A 146 PAGE  OPERATIONAL, SAFETY AND USER MANUAL. A FEW EXAMPLES OF CONCERN ARE AS FOLLOWS:  1. INTRODUCTION/GENERAL INFORMATION  2. GENERAL SAFETY INFORMATION.  I COULD LIST MANY MORE BUT THE LIST IS ENDLESS. I AM NOT TRYING TO PUNISH THIS COMPANY I AM TRYING  TO MAKE IT A BETTER COMPANY AND LESSEN IT'S LIABILITY AGAINST INJURY AND POSSIBLE DEATH. THE  COMPANY DOES PROVIDE TIRE AND AXLE MANUALS BUT THEY ARE COPIES PROVIDED BY THE TIRE AND AXLE  MANUFACTURING COMPANY'S. KAUFMAN TRAILERS DOES NOT PROVIDE A USER, OPERATIONAL AND SAFETY  MANUAL FOR THEIR PRODUCT. MY WIFE AND I HAVE ALREADY MADE SEVERAL MISTAKES USING THIS TRAILER FOR  LACK OF WRITTEN INSTRUCTION, FORTUNATELY NOTHING SERIOUS HAPPENED BUT THERE WAS THE POTENTIAL OF  SERIOUS INJURY. MY REQUEST IS A REASONABLE REQUEST AND WOULD NOT COST THE COMPANY ANY  SUBSTANTIAL MONEY. ALL COST TO PRODUCE A USER MANUAL COULD BE EASILY MADE UP IN THE COST OF THE  THE TRAILER. I WOULD HOPE THAT YOUR CONSUMER SAFETY ORGANIZATION WOULD TAKE A PROACTIVE POSITION  AND AT LEAST LET THIS COMPANY KNOW THEY ARE BEING REPORTED AND REVIEWED FOR POSSIBLE SAFETY  VIOLATIONS. I WOULD ALSO HOPE THAT THE FACT THESE COMPANY RETAIN ATTORNEYS WILL NOT DAMPEN YOUR  EFFORTS TO MAKE THIS HAPPEN. THANKING YOU IN ADVANCE, [XXX]  THE COMPANY NAME AND ADDRESS IS AS FOLLOWS:  KAUFMAN TRAILERS  702 N. SILVER STREET  LEXINGTON, NC 27292  WWW.KAUFMANTRAILERS.COM  MY EMAIL ADDRESS AND PHONE NUMBER ARE AS FOLLOWS:  EMAIL: [XXX]  PHONE #: [XXX]  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Kaufman Trailers of NC, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732562,
        "products": [
            {
                "manufacturer": "Kaufman Trailers of NC, Inc.",
                "productMake": "KAUFMAN",
                "productModel": "TRAILER",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "VOMA TIRE CORP.",
                "productMake": "VOMA",
                "productModel": "TRAIL EXPRESS",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KAUFMAN TRAILER EQUIPPED WITH VOMA TRAIL EXPRESS POWER TOURING YTR06 TIRES, SIZE: ST235/80/R16. WHILE DRIVING 65 MPH, THE FRONT PASSENGER SIDE TIRE BLEW OUT AND THE BELT FAILED ON THE REAR PASSENGER SIDE TIRE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC. THE TIRES WERE REPLACED. THE TIRES WERE ORIGINAL TIRES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE VEHICLE FAILURE MILEAGE WAS 600 AND THE TIRE FAILURE MILEAGE WAS 500.",
        "vin": "5VGFW5033DL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/20/2014",
        "fire": false,
        "manufacturer": "Kaufman Trailers of NC, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638756,
        "products": [
            {
                "manufacturer": "Kaufman Trailers of NC, Inc.",
                "productMake": "KAUFMAN",
                "productModel": "TRAILER",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "RFD COMPONENTS, INC.",
                "productMake": "RFD",
                "productModel": "TRAIL EXPRESS",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KAUFMAN TRAILER EQUIPPED WITH TRAIL EXPRESS POWER TRAIL (NA) TIRES, SIZE ST225/75R15 LOW RIDGE D (NA). WHILE DRIVING 55 MPH, THE CONTACT HEARD AN UNUSUAL SOUND COMING FROM THE VEHICLE. THE CONTACT MANEUVERED THE VEHICLE TO THE SIDE OF THE ROAD AND OBSERVED THAT THE REAR DRIVER AND REAR PASSENGER SIDE TIRES BLEW OUT. THE CONTACT WAS HAULING SOMETHING AT THE TIME OF THE FAILURE. THE TIRES WERE REPLACED. THE TIRE FAILURE MILEAGE WAS 1,000 AND THE VEHICLE FAILURE MILEAGE WAS 38,000.",
        "vin": "1FT8W3BT3CE"
    }
]