[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "05/25/2016",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872829,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON OUR FAMILY VACATION, WITH OUR 2013 KEYSTONE COUGAR 5TH WHEEL. WE EXPERIENCED 2 TIRE BLOWOUTS. WHILE TRAVELING N ON I-59 (JUST INSIDE GA STATE LINE) AT APPROX. 60 MPH, THE RIGHT REAR TIRE EXPLODED CAUSING DAMAGE TO THE CAMPER. PUT SPARE ON AND CONTINUED ON OUR TRIP. ONCE WE ARRIVED AT CAMPGROUND THE EXPLODED TIRE WAS TAKEN TO A TIRE STORE AND REPLACED. NEW TIRE WAS PUT ON CAMPER AND THE SPARE RETURNED TO THE SPARE POSITION ON THE REAR OF THE CAMPER. UPON OUR RETURN TRIP HOME, TRAVELING ON I-75 S, WE HAD BLOWOUT #2. IT WAS THE LEFT REAR TIRE. NOW DAMAGE HAD BEEN DONE TO BOTH SIDES OF THE 5TH WHEEL. THANKFULLY WE HAD TIRE REPLACED WHILE ON VACATION OR WE WOULD HAVE BEEN SITTING ON THE SIDE OF THE INTERSTATE WAITING WITH OUR 2 SMALL CHILDREN FOR WHO KNOWS HOW LONG ON SOMEONE TO COME TOW US OR REPLACE TIRE. WE CHANGED THE TIRE AND HEADED STRAIGHT FOR THE TIRE STORE AT HOME, WHERE ALL 4 TIRES WHERE REPLACED. SO NOW WE ARE OUT ALL THE MONEY FOR 4 NEW TIRES, BUT ALSO OUR $500 INSURANCE DEDUCTIBLE THAT WILL BE APPLIED TWICE!! SINCE IT HAPPENED ON 2 DIFFERENT DAYS, BUT ON THE SAME TRIP LESS THAN 300 MILES APART, IT HAD TO BE 2 SEPARATE CLAIMS. THEREFORE $1000.00 DEDUCTIBLE! THERE ARE SO MANY COMPLAINTS ALL OVER THE INTERNET ABOUT THESE TIRES. EITHER THE TIRE MANUFACTURER OR THE RV MANUFACTURER NEEDS TO RESOLVE THESE ISSUES BEFORE SOMEONE ENDS UP GETTING KILLED!!!",
        "vin": "4YDF33025D2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "04/10/2016",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854791,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE COUGAR. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE REAR BUMPER FRACTURED WHILE THE SPARE TIRE PLUMMETED INTO TRAFFIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NO NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000.",
        "vin": "4YDF33326D2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "09/13/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807027,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sailun Tire Americas, Inc.",
                "productMake": "TOWMAX STR",
                "productModel": "ST",
                "productYear": "9999",
                "size": "ST225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "2013 KEYSTONE COUGAR TRAILER.  CONSUMER WRITES IN REGARDS TO TIRE FAILURE.  *SMD  THE CONSUMER NOTICED AS HE WAS DRIVING, HE NOTICED THAT ONE OF THE RIGHT SIDE TRAILER TIRES WERE SHREDDING.  WHEN HE WAS FINALLY ABLE TO STOP, HE DISCOVERED THE TIRE WAS LOOSING AIR AND THE TREAD HAS COMPLETELY SEPARATED FROM THE CASING AND THE SIDEWALL WAS STILL INTACT.  THERE WAS EXTENSIVE DAMAGE TO THE SHEET METAL AND DUAL AXLES. *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "08/07/2014",
        "dateOfIncident": "08/21/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10620648,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE 2 FOLD OUT COACHES ON THE TRAILER WITH AIR MATTRESS' FOR THE PAD.  WE HAVE NOT BEEN ABLE TO HAVE EITHER AIR MATTRESS STAY INFLATED OVER NIGHT SINCE WE BOUGHT IT.  ONE OF THEM LEAKS THROUGH THE OUTLET TO DEFLATE IT AND WE HAVE TO PUT A CELLOPHANE BAGGIE UNDER THE CAP TO KEEP IT UP PART OF THE NIGHT.  THE OTHER AIR MATTRESS  HAS ONE CORNER THAT THE WAS FOLDED OVER WHEN IT WAS MADE (THE MATERIAL IS DOUBLED OVER) AND THERE IS A LEAK THERE. WE HAVE TRIED EVERY PATCH MADE AND CANNOT GET THE LEAK STOPPED BECAUSE IT IS ON THE EDGE.  THE OTHER 3 CORNERS ON THAT AIR MATTRESS LOOK NORMAL AND ARE JUST FINE, THAT IS HOW I KNOW THAT THE ONE CORNER IS A MANUFACTURER DEFECT.  I HAVE CALLED KEYSTONE TWICE, ONCE MORE TODAY, AND THEY SAID THERE IS NO RECALL ON IT SO THEY CANNOT HELP.  THESE ARE MANUFACTURERS DEFECTS AND I HOPE YOU CAN HELP.   THANK-YOU  *TR",
        "vin": "4YDF32421D2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2014",
        "dateOfIncident": "04/04/2014",
        "fire": true,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577632,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2013 KEYSTONE COUGAR 5TH WHEEL MODEL 331MKS. ON 4/4/14 WE WERE AT A CAMPGROUND AND STARTED TO SET UP. THE RIG WAS ONLY ON 12V BATTERY POWER. I HAD NOT YET CONNECTED TO SHORE POWER. WHEN I PUSHED THE BUTTON TO LOWER THE LANDING GEAR, NOTHING HAPPENED. I TRIED THE REMOTE CONTROL, AND NOTHING HAPPENED AGAIN. I WENT TO GET THE POWER CORD INTENDING TO PLUG IT IN. THE CORD WAS IN THE STORAGE AREA IN THE FRONT, UNDER THE HITCH, WHERE THE BATTERY IS. WHEN I OPENED THE DOOR, IMMEDIATELY SMOKE WAS BILLOWING OUT. THEN I SAW THE FLAME. IT WAS COMING FROM THE CIRCUIT BOARD ABOVE THE BATTERY.I IMMEDIATELY GOT THE FIRE EXTINGUISHER. AFTER USING IT SEVERAL TIMES, THE FLAME KEPT COMING BACK. I CALLED 911 FOR THE FIRE DEPARTMENT. THE PROPANE TANKS ARE RIGHT NEXT TO THE AREA BURNING. I IMMEDIATELY REMOVED BOTH OF THEM. ALL I COULD THINK OF WAS THE POSSIBILITY OF AN EXPLOSION. THE DISPATCHER ASKED IF THERE WAS ANYTHING ELSE NEARBY THAT COULD BURN. I SAID \"YES, IT IS CONNECTED TO MY TRUCK WHICH IS FULL OF DIESEL.\" I COULD IMAGINE EVERYTHING GOING UP IN SMOKE. I TURNED OFF THE BATTERY, TURNED OFF ALL THE CIRCUIT BREAKERS, BUT THE FLAME KEPT COMING BACK AFTER I KEPT USING THE FIRE EXTINGUISHER.MY WIFE WENT FOR THE CAMPGROUND RANGER. I FINALLY EMPTIED THE FIRE EXTINGUISHER AND THE FLAME CAME BACK. I HAD NOTHING ELSE TO TRY, SO I REACHED IN AND PULLED THE WIRES OUT WHICH WERE ALL MELTED AT AND AROUND THE CIRCUIT BOARD. THE CAMP RANGER TOLD US THAT HE HAD NEVER SEEN ANYTHING LIKE THIS BEFORE SINCE IT WAS NOT PLUGGED INTO 110. I DROVE THE RIG TO THE DEALER. AT THE DEALERSHIP, 3 MEN CAME OUT TO LOOK. THEY SAID THAT THEY COULDN'T BELIEVE WHAT THEY SAW AND THAT THEY HAD NEVER SEEN THIS HAPPEN BEFORE. THEY TOOK PICTURES. OUR 5TH WHEEL IS NOW AT THE DEALER. THEY SAID THEY WILL BE TALKING TO KEYSTONE ON MONDAY TO SEE WHAT NEXT STEPS THERE ARE.   *TR",
        "vin": "4YDF33126D2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "04/18/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509288,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE COUGAR. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE REAR BUMPER BEGAN TO SEPARATE FROM THE VEHICLE OVER THE COURSE OF A TWO HOUR DRIVE. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT THE BUMPER WOULD HAVE TO BE RE-ATTACHED. THE VEHICLE WAS REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 120.   UPDATED 06/10/13 *BF  UPDATED 06/14/2013*JS",
        "vin": "4Y0T2912596"
    }
]