[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219939,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "KENWORTH",
                "productModel": "T700",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAB IS COMING DETACHED FROM FLOOR AND FIREWALL. WE ARE WORRIED ABOUT THE SAFETY OF THE DRIVER.  TRUCK CAME FROM TRANS AM FLEET. SALES MANAGER STATED THAT THEY HAD SEVERAL TRUCKS WITH THE SAME PROBLEM. PACCAR NEEDED TO REINFORCE FLOOR TO FIREWALL AND DOOR JAM.",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/01/2017",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "PACCAR Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939010,
        "products": [
            {
                "manufacturer": "PACCAR Incorporated",
                "productMake": "KENWORTH",
                "productModel": "T700",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS A HARBOR DRIVER THAT HAULED REFERS FROM PORT TO YARD COMPANY TRUCKS THAT WERE ISSUED FOR HARBOR DRIVERS WERE KENWORTHS T700 WITH SUPERSINGLESS TIRES DON'T KNOW IF THOSE ARE THE MANUFACTURES ORIGINAL TIRES. I WAS INVOLVED IN A ROLL OVER ACCIDENT IN WHICH I FEEL THERE WAS SOME MECHANICAL ISSUE WITH TRUCK I WAS TOLD TO USE BY MANAGEMENT AFTER DOING MY BASIC INSPECTION EVERYTHING CHECKED OUT. AFTER THE ACCIDENT I LEARNED FROM OTHER DRIVERS THAT TRUCK KW T700 2013 VIN# [XXX] // [XXX] HAD PREVIOUS SUSPENSION AND BRAKE PROBLEMS THAT WERE FIXED BY COMPANY MECHANICS AND TRUCK WAS CLEARED FOR HARBOR OPERATIONS. IF POSSIBLE SINCE COMPANY HARBOR DRIVERS ARE NOT GIVEN THE WEIGHT OF THE REFERS THAT THEY WILL BE PICKING UP FROM HARBOR JUST THE CONTAINER # AND PIN ARE LISTED ON DRIVER WORK SCHEDULE COMPANY DRIVERS UNKNOWINGLY HAUL HEAVY WEIGHT CONTAINERS SO A SUSPENSION PROBLEM OR TIRE / BRAKE PROBLEM COULD THE SAFETY OF THE DRIVER AND THE COMMUNITY THAT SHARE THE ROADS WITH TRUCKS.THE EVENING OF THE ACCIDENT I WAS BOBTAIL TO THE PORT BUT ON THE OUT WITH LOAD APPROXIMATELY 2MILES DRIVING I FELT THE TRUCK STRANGE WHEN LIKE SUSPENSION OR BRAKES THEN FELT VIBRATION THEN I WAS ON THE UPSIDEDOWN THANK GOD NO ONE WAS HURT OR INVOLVED. TWO YEARS I HAULED REFERS ROM THE PORT FOR COMPANY WITHOUT AN INCIDENT SINCE NEW LOGISTIC MANAGER CAME HE STARTED INSTALLING NEW TIRES( FRONT) ON COMPANY TRUCKS AND REMOVING RUBBER AIRHOSES FOR PLASTIC HOSES I WOULD LIKE TO KNOW IF THIS WAS COMPANY ERROR OR MANUFACTURE ERROR ON THE TRUCK THANK YOU. COMPANY DRIVER ICAN SEND YOU PIC IF U REACH ME AT MY EMAIL.  *TR",
        "vin": "1XKFD49X4DJ"
    }
]