[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458383,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine has started making ticking/clicking sound that appears to be common in Kia's . Vehicle has been well maintained, regular oil changes, etc. It seems other Kia's with the same engine, and seemingly same problem, have been recalled. A quick google search shows that the ticking issue is very common with kia's. Hopefully this can be added to a recall. Thank you.",
        "vin": "knAFU4A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451290,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving to work on the freeway on Saturday, while driving my oil light came on one second later the engine stopped working and all lights came on including he engine light. I pulled over turned it off and on and it would not start. A transmission shop and Kia dealership did a diagnostic and said the engine ceased. Something in the engine failed knocking down an d the part failed",
        "vin": "KNAFU4A21D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447733,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My engine which is the 2.0 liter has the same tapping noise from the engine that the other Kia Fortes had and I don’t get a recall. The engine has gone to crap and I’m still paying on it from a dealership. How does it not have a recall like the others when it’s doing the same thing.  My dealership said it’s a common problem with these years and engines  and now my engine is on its last leg. It’s going to leave me stranded or get me hurt by blowing up unless someone does something about these tapping/knocking engines!!! It has did it for 3 years that I’ve owned it but now it’s really bad to the point it’s serious metal on metal. Also this vehicle has been well maintained and I have all my service records and receipts to frequent oil changes etc etc",
        "vin": "Knafu4a29d5"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446038,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We  have not been able to get this vehicle to pass emissions, ive taken it to multiple kia locations and no one has been able to help. The engine light has been on and theyve changed the sensor as thats what repair shop suggested it may be, but still nothing. Then just out of the blue its stopped working. I took it to a smaller shop as i no longer trusted the kia dealership and the guy told me it was a recall as this is not an old car and it needed engine work. I contacted kia and they said yes there was an important sfety recall that we should of received a letter, suggested to call 18003334542 for a tow, but i have spoken to 6 people who i cant understand and have been able to get a tow to a kia dealership",
        "vin": "knafw6a36d5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443220,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine Knock, Engine failure and replacement.   The car had to be towed to the dealer and they would not cover the repair because we were the second owner.  We purchased the car with 67k miles on it and the engine failed 6 months after purchase.",
        "vin": "knafw4a31d5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "06/08/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438039,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Kia Forte. The contact received notification of NHTSA Campaign Number: 20V750000 (Engine). The contact stated that while driving at 50 - 55 mph, noises were heard and smoke came from the front and rear of the vehicle. The contact pulled over and had the vehicle towed to the dealer. The dealer replaced the engine and fuel pump. However, while the dealer was test driving the vehicle, abnormal noises were heard. The dealer informed the contact that they would contact the manufacturer to replace the engine. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure. The failure mileage was 66,917.",
        "vin": "knafw6a36d5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle would not start moving. I am unable to ignite the engine.",
        "vin": "KNAFU4A29D5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429806,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "When I’m driving down the road it’s starts losing power and the icon of car with dizzy lines starts flashing but if the car gains any speed the icon goes out .And like today when I tried to push brake to stop and pull over it started shaking so bad I felt like the whole front in was going to fall out ,The last time I had smoke come out when I tried to give it a little gas to move.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "03/05/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11421549,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I have owned my 2013 kia forte for over 7 years. Within the last 3 years I have had significant issues with my tail lights and break lights burning out. To the point that the socket completely melted and shattered the light bulb.upon attempting to fix and remove the melted socket I sliced my hand open. I have been pulled over multiple times for my lights flickering or even just being out. It's to the point where I carry spare light bulbs in my car. I've had a mechanic look at my vehicle and I've been advise that I need to have the whole tail light assembly replaced. This is a huge safety issue especially when traveling with my small children.  I've spoken with many people that have this model car and all experience the same issue. I'm shocked to know this is not a recall issue!",
        "vin": "Knafw4a39d5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/05/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420163,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2013 Kia Forte. The contact stated while driving 10 mph, the vehicle loss motive power and stalled. The contact parked the vehicle and saw smoke entering the cabin of the vehicle through the vents. The contact exited the vehicle before the vehicle caught on fire. There was no injury sustained. The fire department extinguished the fire. A fire report was filed. A police report was not filed. The insurance company deemed the vehicle a total loss. The contact called local dealer and made them aware of the failure. The manufacturer was informed of the failure. The VIN was included in NHTSA Campaign Number: 20V750000 (Engine). The failure mileage was approximately 85,400.",
        "vin": "KNAFW6A37D5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415986,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A CAR ACCIDENT, PUSHED ON MY BRAKE THE CAR KEPT MOVING AND I HAD NO WARNING, MY CAR IS NOW TOTALED",
        "vin": "KNAFU4A25D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "02/10/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406929,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 KIA FORTE KOUP WAS PARKED AS I RAN INTO THE STORE, I CAME OUT TO MY CAR ON FIRE AND IT IS NOT REPAIRABLE. IT WAS ALL FROM BEHIND THE DASHBOARD THE ELECTRICAL I BELIEVE AS MY STEERING WHEEL AND EVERYTHING WAS ON FIRE. I HAVE A 10YR WARRANTY ON MY CAR, I RECEIVED AN URGENT RECALL A FEW DAYS AFTER MY CAR FIRE IN REGARDS TO POSSIBLE ENGINE COMPARTMENT FIRE AND SOMETHING ELSE. I CONTACTED THE DEALERSHIP WHO I PURCHASED MY CAR FROM BUT THEY SAID WE DO NOT DEAL WITH THAT YOU MUST CONTACT KIA CONSUMER ASSISTANCE SO I DID THE VERY NEXT DAY. I SPOKE WITH RYAN AND HE GAVE ME A CASE NUMBER STATED NOT TO WORRY THEY WILL GET ME IN A CAR AND HAVE MY CAR INSPECTED AND SEE WHAT THEY CAN DO FOR ME. I HEARD FROM HIM TWICE THEN NOTHING FOR TWO WEEKS THEIR SYSTEMS WERE DOWN, I HAVE CALLED AND EMAILED SO MANY TIMES WITH NO CALL BACK OR EMAIL BACK. I DEMANDED TO SPEAK WITH A SUPERVISOR BECAUSE 3 WEEKS AND NOTHING HAS BEEN DONE I DID NOT HAVE A REPLACEMENT CAR OR RENTAL AND MY RENTAL THROUGH MY INSURANCE COMPANY WOULD ONLY BE FOR 30 DAYS. THE MANAGER WAS JEFF STROUP WHO WAS NOT HELPFUL AND A LITTLE SHADY ALSO LAUGHED AT ME BECAUSE I WAS UPSET I HAD NO CAR NO ANSWERS NO RESULTS. HE SAID IT TAKES A WHILE TO HAVE VEHICLE INSPECTED AND THEN ANOTHER MONTH FOR THE RESULTS, BUT YET I AM AT THEIR MERCY BEING I HAVE NO CAR AND I HAVE A WARRANTY. HE WAS RUDE AND NOT HELPFUL AT ALL. HE ASKED ME TO SEND HIM THE BILL FOR THE RENTAL CAR I HAD TO PAY OUT OF POCKET, I DID AND HAVE NOT HEARD FROM HIM. I HAVE CALLED MANY TIMES AND THEY DO NOT GIVE YOU ANYONES DIRECT NUMBER OR EMAIL. IT IS ABOUT 2 MONTHS SINCE MY CAR FIRE AND NO PHONE CALLS NO INSPECTION OF MY CAR AND ABSOLUTELY NO HELP FROM KIA! I DO NOT UNDERSTAND HOW THEY GIVE HORRIBLE CUSTOMER SERVICE AND FAIL TO ASSIST SOMEONE WHO SPENT A LOT OF MONEY ON THEIR CAR AND HAS A WARRANTY. I CURRENTLY HAVE NO VEHICLE BUT A WARRANTY THAT DOES NOTHING",
        "vin": "KNAFW6A36D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405621,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR TO GET WASHED.  DROVE HOME EAST TO WEST.  CAR IN MOTION SLOWED U.W. BAY DRIVE 40 MILES, 30, 20.  CAR STATIONARY 1 HOUR OR MORE.   POLICE JUMP.  DIDN'T  TURN",
        "vin": "KNAFU4A21D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "12/04/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400208,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT NOTICED HER CHECK ENGINE LIGHT WAS ILLUMINATED WHILE DRIVING AT 50 MPH, SHE STOPPED FOR FUEL AND THE CHECK ENGINE LIGHT WENT OFF.  THE CONTACT STATED THE VEHICLE WOULD SPUTTER AND SHAKE WHILE THE VEHICLE WAS IN PARK.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH A MISFIRE SHORT IN THE WIRING. THE CONTACT STATED WHILE PARKED A BURNING ODOR WAS DETECTED. THE VEHICLE HAD NOT BEEN REPAIRED. THE LOCAL DEALER WAS NOT INFORMED OF THE FAILURE. THE MANUFACTURE WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "KNAFU5A27D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/10/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398954,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED AN EMAIL FROM CARFAX NOTIFYING ME OF A RECALL FOR MY CAR PERTAINING TO A POSSIBLE FIRE, I CALLED DEALERSHIP TO SET UP APPOINTMENT AND FOUND OUT THERE WAS 2 RECALLS FOR MY CAR BUT NEVER ONCE RECEIVED ANY NOTIFICATION FROM KIA. MY APPOINTMENT WAS FOR THE COMING SATURDAY BUT ON WEDNESDAY AFTER I PARKED AND RAN INTO THE GROCERY STORE FOR LESS THAN 15MINS I CAME OUT TO A GENTLEMAN WHO ASKED IF THIS WAS MY CAR, WHEN I LOOKED AT IT I WAS CONFUSED BECAUSE ALL THE WINDOWS WERE BLACK AND SMOKE WAS COMING I BELIEVE FROM EITHER THE HOOD OR WINDOW, HE SAID YOUR CAR IS ON FIRE. BEFORE I KNEW WHAT WAS HAPPENING THERE WERE FIRE TRUCKS AND POLICE. MY ENTIRE INSIDE OF MY CAR BEHIND THE DASHBOARD AND ALL ELECTRICAL WIRES WERE BURNED THE ENTIRE DASHBOARD STEERING WHEEL RADIO EVERYTHING. MY CAR WAS DESTROYED, I CALLED MY INSURANCE COMPANY RIGHT AWAY AS THE POLICE ADVISED ME TOO AND LATER ON A FRIEND GAVE ME THE NUMBER TO THE KIA CONSUMER ASSISTANCE WHERE I NOTIFIED THEM.",
        "vin": "KNAFW6A36D5"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/10/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398959,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA WENT ON FIRE AND I WAS NEVER NOTIFIED BY KIA, I FOUND OUT FROM CARFAX AND SET UP APPOINTMENT TO HAVE THIS RECALL FIXED AND FOUND OUT THERE WAS 2 RECALLS. SET UP THE APPT FOR SATURDAY, WHILE MY CAR WAS PARKED AND OFF I RAN INTO THE STORE CAME OUT AND MY CAR WAS ON FIRE ALL OF THE DASHBOARD ALL BEHIND IT. MY CAR WAS TOTALED BY INSURANCE. 2 DAYS AFTER MY CAR GOES ON FIRE I AM SUDDENLY GETTING RED EMERGENCY RECALL NOTICES IN THE MAIL. DEALERSHIP WILL NOT SPEAK WITH ME, THE KIA CONSUMER ASSISTANCE GAVE ME A CASE NUMBER BUT HAS DONE NOTHING IN OVER 2 WEEKS. I STILL HAD MY 10YR WARRANTEE AND KIA SAID I WOULD SETTLE WITH YOUR INSURANCE YOU WILL GET MORE MONEY FROM THEM. THEY DO NOT RETURN CALLS OR EMAILS AND THEY DO NOT WANT TO TAKE RESPONSABILITY AT ALL.",
        "vin": "KNAFW6A36D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397481,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD TICKING OR KNOCKING SOUND COMING FROM ENGINE. SOUNDS EXACTLY THE SAME AS OTHER ENGINES THAT WERE REPLACED BECAUSE OF 'ROD KNOCK'. THIS SAME ENGINE WAS RECALLED ON MANY OTHER MODELS SO WHY NOT ON THE 2013 KIA FORTE?",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396326,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL RECALLS HAVE BEEN ISSUED FOR THE THETA II ENGINE. I OWN A 2013 KIA FORTE KOUP EX WHICH IS EQUIPPED WITH THE 2.0L MPI ENGINE. THE 2.4L ENGINE OF THE SAME TYPE WAS RECALLED JUST A FEW WEEKS AGO. THE ONLY DIFFERENCE BETWEEN THESE TWO ENGINES IS THE SIZE. THEY ARE NOT FUNDAMENTALLY DIFFERENT OTHER THAN A FEW TWEAKS TO ACCOUNT FOR THE EXTRA VOLUME. LIKELY THIS MEANS THE SAME MANUFACTURING PROCESSES WERE USED FOR BOTH ENGINES. IT WOULD BE INCREDIBLY INEFFICIENT TO CREATE NEW MANUFACTURING PROCESSES FOR EACH OF THESE ENGINES. THEREFORE, IF THERE WAS A MAJOR MANUFACTURING ERROR IN THE 2.4L PRODUCTION (SAY METAL SHAVINGS THAT BLOCK OIL ACCESS TO THE ROD BEARINGS CAUSING CRITICAL WEAR AND DAMAGE), THEN THAT ERROR PROBABLY OCCURRED IN THE 2.0L MANUFACTURING.     I WANT TO KNOW WHY THE 2.0L MPI ENGINE HAS NOT BEEN RECALLED.     THE 2.0L MPI ENGINE ON MY KIA FORTE KOUP EX HAS BEGUN TO KNOCK. BY THE SOUND, THE ROD BEARING HAS PROBABLY WORN THROUGH AND THE LIFE OF MY CAR AND MY OWN SAFETY ARE AT A HIGH RISK. I CANNOT AFFORD A NEW ENGINE OR A NEW CAR RIGHT NOW JUST BECAUSE KIA SCREWED UP. PLEASE LOOK INTO THIS ISSUE. JUST BECAUSE NOT AS MANY PEOPLE HAVE CARS WITH THE THETA II 2.0L MPI ENGINE DOESN'T MEAN OUR SAFETY AND OUR LIFE SAVINGS CAN BE THROWN OUT THE WINDOW.",
        "vin": "KNAFU6A23D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394896,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TOLD BY THE DEALER MY CAR IS NOT ON THE RECALL LIST FOR 20V750000, BUT WAS TOLD I NEED AN ENGINE REPLACEMENT DUE TO ROD BEARINGS AND PISTONS.  VEHICLE MAKES KNOCKING NOISES.  VEHICLE HAS BEEN WELL KEPT AND HAS ONLY 45,000 MILES ON IT.  I WAS TOLD A NEW ENGINE WOULD COST $5,600.  MY CAR IS ONLY WORTH $5,600.  PLEASE ADD THIS VIN TO THE RECALL LIST, I CANNOT AFFORD A NEW ENGINE.  AND THE ENGINE HAS THE SAME PROBLEMS AS THE OTHER THETA II ENGINES BEING RECALLED.  I AM AFRAID IT WILL CATCH FIRE AS OTHERS HAVE, BUT I CANNOT AFFORD TO REPLACE IT",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394753,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 KIA FORTE WITH THE AIRBAG LIGHT ON. I FOUND A RECALL ON 2011-2013 KIA FORTE FOR AIR BAG: AIR BAG/RESTRAINT CONTROL MODULE WHERE IN AN EVENT OF A CRASH, THE AIR BAG CONTROL MAY SHORT CIRCUIT PREVENTING THE FRONTAL AIR BAGS AND SEAT BELT PRETENSIONERS FROM DEPLOYING. I LOOKED UP MY VIN # TO FIND OUT THAT IT WAS NOT ON THE LIST. IT WAS DIAGNOSED BY A KIA SERVICE DEPARTMENT TO BE THE DRIVER ANCHOR PRETENSIONER. MY QUESTION IS WHY MY FORTE IS NOT ON THE RECALL LIST? MY REQUEST IS TO HAVE MY VEHICLE PLACE ON THE LIST SO WE CAN HAVE THIS ISSUE TAKEN CARE OF.   THANK YOU, MARY DENISE BROWN",
        "vin": "KNAFU4A26D5"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2021",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388752,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 KIA FORTE SEDAN, 2.4L  THETA II, MY MPI ENGINE  APPROX. 98K MILES (DEC 18 2020), LIGHT TICKING WAS OBSERVED WHILE DRIVING AS USUAL.  THIS TICKING QUICKLY ESCALATED (DEC 21, 2020) TO THE POINT OF STOPPING THE CAR AND NOT DRIVING ANY FURTHER.  THE CAR WAS TOWED TO AN ASE SHOP TO LOOK INTO THE ISSUE (DEC 25, 2020).  WITHIN A FEW DAYS (DEC 28 - JAN 31) IT WAS DIAGNOSED AS INTERNAL ENGINE DAMAGE HAVING METAL IN THE OIL AND FILTER.  BASED ON MY RESEARCH, I HAVE FOUND OTHER COMPLAINTS, FORUMS AND RELATED RECALLS POINTING TO THE FACT THAT THIS IS A COMMON PROBLEM.  HOWEVER, TO DATE (JANUARY 18, 2021) THERE IS NO ACTIVE RECALL ON THIS PARTICULAR PLATFORM.  ACCORDING TO THE INFORMATION I HAVE FOUND, KIA IS TO ANNOUNCE A RECALL (JANUARY 27, 2021) OF THIS SPECIFIC SERIES OF ENGINES AS WELL.  CURRENTLY THE DEALER FROM WHERE THE CAR WAS PURCHASED HAS NOT MADE ANY EFFORT TO FACILITATE THIS ENGINE PROBLEM.  ONLY THE FACT THAT THE SERVICE DEPT HAS AGREED TO KEEP THE CAR UNTIL MORE RECALL INFORMATION IS AVAILABLE.  PLEASE HELP WITH INFORMATION OR CONTACT TO FACILITATE A SOLUTION TO THIS MANUFACTURER DEFECT.  THIS CAR HAS BEEN EXTREMELY WELL KEPT WITH REGULAR OIL CHANGES AND ROUTINE MAINTENANCE PRACTICES.",
        "vin": "KNAFW4A36D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388385,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A RATTLING NOISE AT 45000 MILES AND I WAS TOLD BY TAYLOR KIA AFTER DIAGNOSTICS THAT AN ENGINE REPLACEMENT IS NEEDED.  KIA HAS A DEFECTIVE ENGINE AS SHOWN ON MANY FORUMS AND THIS MODEL NEEDS TO BE RECALLED.",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388155,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, AN ABNORMAL NOISE APPEARED AS THE ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT MANAGED TO DRIVE THE VEHICLE BACK TO HIS RESIDENCE WHERE THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO FERGUSON KIA (1501 N ELM PLACE, BROKEN ARROW, OK 74012, (918) 258-1800) WHERE IT WAS DIAGNOSED THAT THE ROD BEARING FAILED AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 20V750000 (ENGINE)AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 133,000.",
        "vin": "KNAFW6A31D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2021",
        "dateOfIncident": "07/20/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386011,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE I-70 MD AT 65MPH WHEN I HEARD A TICKING SOUND AND I WASNT GETTING ANY POWER. CAR WAS STRUGGLING TO MOVE WHEN ALL THE SUDDEN BANG!!!! SMOKE, PLASTIC AND METAL WENT FLYING EVERYWHERE FROM THE ENGINE BAY, RICOCHETING OFF THE ASPHALT TOWARDS THE SIDES OF MY VEHICLE AND OTHER CARS TRAILING BEHIND ME. CARS SWERVED TO AVOID THE DEBRIS FROM HITTING THEIR VEHICLES. POWER STEERING WENT OUT AND I STRUGGLED TO MOVE THE CAR OVER TO THE SHOULDER ACROSS ANOTHER LANE. I COULDVE EASILY BEEN KILLED HAD A DRIVER NOT BEEN PAYING ATTENTION OR LOOKING AT THEIR PHONE CROSSING LANES AS THE VEHICLE QUICKLY WAS COMING TO A STOP, INABLE TO MOVE. I SOMEHOW SAFELY GOT TO THE SHOULDER AND GOT THE CAR TOWED AT MY EXPENSE TO THE MECHANIC. CATASTROPHIC ENGINE FAILURE. ROD SNAPPED AND BLEW A 2 INCH HOLE THROUGH THE ENGINE BLOCK AND CAR LIT ON FIRE BRIEFLY. BOUGHT A NEW (USED) THETA II ENGINE (THE SAME ENGINE RECALLED IN HUNDREDS OF THOUSANDS OTHER KIAS AND HYUNDAIS) BUT NOT FOR THE 2013 KIA KOUP WITH THE SAME ENGINE PROBLEM. $4800+ LATER, IM STILL SCARED DRIVING ON THE HIGHWAY AS I COULDVE EASILY BEEN SMASHED THAT DAY BY ANOTHER VEHICLE. KIA NEEDS TO RECALL EVERY SINGLE MAKE YEAR AND MODEL WITH THE THETA 2 ENGINE. HAVE NEW (USED) ENGINE RECIEPT AND ALL DOCUMENTATION PERTAINING TO THE INCIDENT.",
        "vin": "KNAFW6A3XD5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384385,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING HOME ON SEPTEMBER 25TH 2020 AT 1AM ON NJ TURNPIKE CAR  STARTED TO TAP VERY LOUDLY AND LOST POWER AT 65 MPH.  CAR HAS 83,659 MILES.  CAR WAS TOWED TO DEALER ON SEPTEMBER 29TH ,2020  DEALER NOTIFIED US ON OCTOBER 1ST THAT THE ENGINE FAILED AND IT IS NOT COVERED UNDER ANY RECALL.  BOUGHT THE CAR WITH 21,530 AND WAS TOLD WE HAD THE FULL FACTORY WARRANTY.   CAR HAS FULL SERVICE RECORDS, VERY WELL MAINTAINED AND STILL LOOKS NEW.  KIA CONSUMER AFFAIRS HAS ESCALATED THIS CLAIM TWICE AND STILL REFUSES TO FIX.  THEY KNOW ABOUT THIS PROBLEM AND STILL WILL NOT HONOR THE REPAIR.   WE ALSO OWN AN 2013 OPTIMA THAT HAD SAME PROBLEM AT 90,000 AND THEY FIXED IT RIGHT AWAY.  CAR IS STILL SITTING AT DEALER FOR 83 DAYS NOW AND THEY ARE STARTING TO GET AGGRAVATED",
        "vin": "KNAFW6A38D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384246,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE MAKING CLICKING SOUND.  SOUNDS EXACTLY LIKE THE OTHER ENGINE ISSUES KIA HAS RECALLED.",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384287,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE AT HIGHWAY SPEED AND IT BEGAN TO MAKE A LOUD KNOCKING NOISE, THE ENGINE INCREASINGLY BECAME LOUDER AND I LOST THE ABILITY TO ACCELERATE.  THERE WAS A LOT OF TRAFFIC AROUND ME AND MY 9 YEAR OLD SON WAS IN THE CAR.  WE WERE SCARED.  I BARELY GOT THE VEHICLE TO THE BREAKDOWN LANE WHERE OTHER CARS AND TRACTOR TRAILERS WERE PASSING US ONLY FEET AWAY FROM US.  THE VEHICLE WOULD NOT MOVE AT ALL AND THE ENGINE WAS IDLING ROUGHLY.  I HAD THE CAR TOWED OFF OF THE HIGHWAY.  FROM THE RESEARCH THAT I HAVE DONE OVER THE WEEKEND, IT SEEMS AS THOUGH MANY KIA FORTE EX OWNERS ARE EXPERIENCING THE SAME NIGHTMARE THAT I HAVE GONE THROUGH. THE ISSUES RECALL DOES NOT APPEAR TO INCLUDE THE EX MODEL WITH THE 2.0L ENGINE EVEN THOUGH SYMPTOMS ARE IDENTICAL IN EVERY INSTANCE.  MY CAR HAS BEEN SERVICED REGULARLY SINCE IT WAS NEW AND ALWAYS MAINTAINED ACCORDING TO MANUFACTURERS RECOMMENDATIONS. ANY VEHICLE THAT LOSES THE ABILITY TO ACCELERATE IN TRAFFIC SHOULD BE DEEMED UNSAFE AND THE MANUFACTURER SHOULD MAKE GOOD ON THEIR PRODUCT.  MANY OWNERS ARE EXPERIENCING THE SAME PROBLEMS AND BEING TOLD AT THE DEALERSHIP THAT COST WOULD BE THE OWNERS RESPONSIBILITY.  HOWEVER, CERTAIN MODELS THAT ARE HAVING THE SAME ISSUE ARE COVERED UNDER THE GOVERNMENT MANDATED SAFETY RECALL.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378606,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A KNOCKING NOISE COMING FROM UNDERNEATH THE HOOD OF MY CAR AND I COULD SMELL SMOKE.  WHEN I LIFTED THE HOOD, I COULD SEE SMOKE ARISING FROM UNDERNEATH THE HOOD.  UNSURE WHY MY CAR HAD BEGUN SMOKING, I CALLED FOR A TOW TRUCK TO COME GET MY CAR BECAUSE I DIDN'T KNOW WHAT WAS WRONG AND IF IT WOULD CATCH FIRE.  I HAD THE TOW COMPANY TAKE MY CAR TO A MECHANIC FOR HIM TO IDENTIFY WHY MY CAR WAS SMOKING.  WHEN THE MECHANIC LOOKED AT MY CAR, IT WAS NO LONGER SMOKING.  WHEN I GOT INTO MY CAR TO BEGIN DRIVING I CONTINUED TO HEAR THE KNOCKING NOISE UNDERNEATH MY HOOD. I WAS NOT ABLE TO GO THE FULL SPEED LIMIT AS THE NOISE GREW LOUDER, AND HAD TO DRIVE UNDER THE SPEED LIMIT. AS I BEGAN DRIVING, MY OIL LIGHT CAME ON.  WHEN I STOPPED AT THE RED LIGHT, MY ENGINE AND BATTERY LIGHTS CAME ON.  WHEN THE LIGHT TURNED GREEN AND I TRIED TO PROCEED, AND MY CAR WOULD NOT MOVE.  IT WAS COMPLETING STOPPED AND NON-OPERATIONAL.  THIS SCARED ME BECAUSE IT WAS DARK, I WAS IN THE MIDDLE OF RUSH HOUR TRAFFIC ON ONE OF THE BUSIEST STREETS IN MY AREA, AND I HAD MY YOUNG SON IN THE CAR WITH ME.  MY FATHER AND A POLICE OFFICER ARRIVED TO ASSIST ME WITH MOVING MY CAR OUT OF TRAFFIC. I HAD TO HAVE A TOW SERVICE COME GET MY CAR AND TAKE IT BACK TO THE MECHANIC.  AFTER EXPLAINING TO THE MECHANIC WHAT HAPPENED AND HIM REVIEWING THE CAR TO DETERMINE WHY IT HAD ABRUTLY SHUT OFF, I WAS TOLD THAT THE ENGINE HAD LOCKED UP.  I HAD TO HAVE MY CAR TOWED TO MY HOME BECAUSE IT WAS NO LONGER OPERATIONAL.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378635,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MAKES A LOUD RATTLING SOUND AND VIBRATION DURING INITIAL START AND INITIAL ACCELERATION, THE SAID NOISE IS MUCH LOUDER DURING COLD ENGINE START UPS. THE PROBLEM ONLY STARTED WHEN THE MILEAGE REACHED AROUND 70,000 MILES. MAINTENANCE  HAS BEEN RELIGIOUSLY FOLLOWED ESPECIALLY OIL CHANGE. I EVEN USE FACTORY ENGINE OIL FILTER.",
        "vin": "KNAFU6A23D5"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378189,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I SAW THAT KIA RECALLED THE SAME YEAR AND MODEL OF THIS CAR FOR FAULTY ENGINES WHICH MAY CATCH FIRE DUE TO ENGINE MALFUNCTION, ROD BEARING FAILURE AND FUEL LEAK BUT, ONLY FOR THE 2.4L ENGINE. WHEN TECHNICALLY SPEAKING THE 2.0L ENGINE WHICH IS NOT RECALLED IS NEARLY IDENTICAL BOTH INTERNALLY AND EXTERNALLY BESIDES CUBIC INCHES. IN FACT WHEN ORDERING PARTS FOR THE 2.0L ENGINE ON KIA'S SITES AND OEM PARTS DISTRIBUTORS, THE PART NUMBERS ARE THE SAME FOR THE INTAKE MANIFOLD, FUEL DELIVERY SYSTEMS, INTERNAL BEARINGS, THE ONLY VARIANCE IN MANUFACTURING AND DESIGN ARE THE CRANKSHAFTS, CAMSHAFTS AND OIL PUMPS DUE TO THE DIFFERENCE IN DISPLACEMENT. FURTHERMORE MY CAR RECENTLY BEGAN LEAKING FUEL FROM THE FUEL DELIVERY TUBE GOING FROM THE FUEL PUMP TO THE RAIL WHICH IS THE SAME PART NUMBER AS THAT ON THE 2.4 AND SAME DESIGN AND ROUTING. DUE TO THE CLOSE PROXIMITY OF THE EXHAUST THE FUEL COULD HAVE IGNITED IF NOT CAUGHT JUST THE SAME AS THE COMPLAINTS ABOUT THE 2.4L WHICH PROMPTED THE RECALL. HOWEVER THE 2.0L OWNERS ARE NOT PROTECTED AND ARE AT THE SAME RISK.",
        "vin": "KNAFT4A2XD5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375927,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS CAR FOR ABOUT 8 YEARS NOW AND I HAVE HAD ISSUES WITH THE REAR TAIL LIGHT/ BRAKE LIGHT BULBS CONTINUOUSLY BLOWING OUT. I HAVE TO REPLACE THEM ALMOST EVERY 1-2 MONTHS. WHEN REPLACING THEM, THEY ARE VERY HOT. NOT SURE IF THIS IS A WIRING ISSUE AMONG MANY OTHER FORTES AS I HAD READ UPON NUMEROUS COMPLAINTS FROM OWNERS WITH THE SAME ISSUE.",
        "vin": "KNAFU4A21D5"
    },
    {
        "components": "WHEELS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366473,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE LIGHT KEEPS COMING ON , NOW IT'S SAYING THAT IT'S SOMETHING DIFFERENT EVERY TIME . STARTED MY CAR UP THE NEXT DAY THEN THE LIGHT WILL GO OUT . SOMETHING ISN'T RIGHT . MY BRAKES ARE ACTING WEIRD , AND TIRE LIGHT KEEPS COMING ON .",
        "vin": "KNAFT4A23D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365950,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 80000 MILES I NOTICED A RATTLING SOUND FROM THE ENGINE OF THE CAR, A SIMILAR ISSUE OTHERS ARE MENTIONING HERE. I THINK WE NEED A RECALL ON THE ENGINE OR AT LEAST WHATEVER PART IS CAUSING THIS PROBLEM.",
        "vin": "KNAFW6A34D5"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364131,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY VEHICLE FOR APPROXIMATELY 6 YEARS. SINCE 2017, I HAVE STARTED HAVING AN ISSUE WITH THE DRIVER'S BRAKE LIGHT BURNING OUT. AT THE FIRST SIGN OF TROUBLE AND MULTIPLE REPLACEMENTS WITHIN A 4 MONTH PERIOD, I TOOK THE VEHICLE TO THE DEALER. THE DEALER RECOMMENDED REPLACING THE ENTIRE TAILLIGHT ASSEMBLY. THE REPLACEMENT SERVICE WAS COMPLETED AND THE ISSUE WAS FINE FOR ABOUT 1 YEAR. IN 2018, I BEGAN HAVING ISSUES WITH THE BRAKE LIGHT AGAIN FOR THE LEFT AND RIGHT. IT STARTED WITH NEEDING TO REPLACE THE LIGHTS EVERY QUARTER. NOW, I REPLACE THE BRAKE LIGHTS AT LEAST EVERY 1-4 WEEKS. THE LIGHT EITHER HAS BECOME SO HOT AND BLOWN OUT, OR WHEN I HIT A SLIGHT BUMP IN THE ROAD -- THE LIGHT DISLODGES. I HAVE TAKEN THE VEHICLE TO THE DEALER AND THEY HAVE SURMISED THAT THE ISSUE IS NOT RELATED TO ELECTRICAL WIRING, BUT THEY BELIEVE THE SOCKET IS NOT HOLDING THE BULB SNUGLY TO RETAIN LIGHTING. THIS IS A MAJOR SAFETY ISSUE DUE TO THE INABILITY FOR OTHER DRIVERS TO KNOW THAT I AM BRAKING. THERE WAS ONE INSTANCE THAT BOTH BRAKE LIGHTS WENT OUT AT NIGHT. AS A RESULT, I CARRY A SPARE PACKET OF TAILLIGHT BULBS IN MY VEHICLE AT ALL TIMES. I INTEND TO RETURN TO THE DEALERSHIP ON 10/15/2020 TO REQUEST ANOTHER REPAIR TO THE LIGHT AND TO PURCHASE A NEW TAILLIGHT ASSEMBLY. I HAVE TAKEN CARE OF THE VEHICLE ENSURING SERVICE IS COMPLETED IN A TIMELY FASHION. THIS HAS BEEN THE ONLY NEGATIVE EXPERIENCE WITH THE VEHICLE, BUT IT IS A CRUCIAL ISSUE AS IT PUTS MY LIFE AND OTHERS' LIVES IN DANGER. THIS IS NOT A NEW ISSUE WITH THE 2013-2014 KIA FORTE. THIS IS A COMMON ISSUE IN FORUMS. YET, THERE IS NO RECALL.",
        "vin": "KNAFU4A28D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342864,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA FORTE TRAVELING ABOUT 55MPH SHUT OFF ON A BUSY MOUNTAIN PASS. IT WAS TOWED TO A DEALERSHIP AND FOUND TO HAVE A SEIZED MOTOR RELATED TO CRANK BEARING FAILURE.  THERE WERE 3 CHILDREN IN THE CAR AS THE TIME OF MOTOR FAILURE",
        "vin": "KNAFW6A38D5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325250,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL STICKS AT NEUTRAL POSITION WHILE PARKED OR DRIVING. FEELS LIKE THERE IS SOMETHING WITHIN THE STEERING COLUMN STICKING.  *TR",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320607,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LEAVING A RED LIGHT AND WHILE ACCELERATING, THE ENGINE STARTED MAKING A KNOCKING SOUND AND ABOUT 20 SECONDS LATER THE ENGINE LOST POWER AND THE DRIVER PULLED OVER. . THE HEADLIGHTS AND INSTRUMENT PANEL REMAINED LIGHTED. DRIVER TRIED TO RESTART THE CAR.  THE ENGINE TURNED-OVER BUT WOULD NOT START. A MECHANIC LOADED THE CAR ON A CAR TRAILER AND CHECKED THE ENGINE AT HIS SHOP. HE DETERMINED THAT THE ENGINE HAD LOCKED UP. THIS SEEMS IMPOSSIBLE WITHOUT A MALFUNCTION, AS THE DRIVER MAINTAINED OIL CHANGES.",
        "vin": "KNAFW5A35D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320441,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT A 2013 IN THE YEAR OF 2014 IT ONLY HAD 2300 MILES AND AT 61000 THE MOTOR WAS BLOWN I CALL KIA AND THEY SAID THEY COULD NOT HELP ME BECAUSE IT WAS 6000 MILES SO I HAD TO HAVE A MOTOR PUT IN  I HAD THE MOTOR PUT IN ABOUT IN DECEMBER MY CAR JUST STOP I HAD IT TOW TO KIA AND THEY SAID IT THROUGH A ROD. IS THERE ANY HELP OUT THERE FOR ME.",
        "vin": "KNAFW6A34D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "03/30/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319837,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LOCAL KIA DEALER HAS INFORMED ME THAT THE ENGINE KNOCKING NOISE IN MY CAR IS A ROD BEARING OR WRIST PIN FAILURE.  THIS IS THE 2.4 LITER ENGINE THAT HAS HAD RECALL ISSUES IN OTHER MODELS.  THE DEALER HAS QUOTED $7,000 TO REPLACE THE ENGINE.  KIA MOTORS HAS REFUSED TO COVER THE ENGINE SINCE I AM THE SECOND OWNER.  THESE ENGINES HAVE A LONG HISTORY OF EARLY FAILURE.  I AM AFRAID TO DRIVE THE CAR NOW BECAUSE I DON'T KNOW WHEN THE ENGINE WILL FAIL.  POSSIBLY AT THE WORST POSSIBLE TIME.  THIS IS A MAJOR SAFETY ISSUE.  THE CAR HAS BEEN WELL MAINTAINED, SO IT IS CLEARLY A MANUFACTURING DEFECT.  KIA MOTORS NEEDS TO BE HELD ACCOUNTABLE FOR ALL THE ENGINES OF THIS TYPE.  CATASTROPHIC ENGINE FAILURE AT 85,000 MILES IS UNACCEPTABLE IN MODERN CARS.",
        "vin": "KNAFW6A32D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319876,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HAS A KNOCKING NOISE",
        "vin": "KNAFU4A26D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315423,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 KIA FORTE WITH 'TICKING' SOUND WHEN IDLING. DIAGNOSTIC PERFORMED BY A MECHANIC AS 'PISTON SLAP'. WAS TOLD TO IMMEDIATELY STOP DRIVING THE VEHICLE BECAUSE THE ENGINE WOULD SOON FAIL AT ANY TIME.",
        "vin": "KNAFU5A27D5"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311597,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE PEDDLE BEGAN TO STICK. I WOULD HAVE TO TAP ON THE BRAKE PEDDLE TO GET IT TO UNSTICK. I TOOK MY CAR TO THE KIA DEALER NEAR ME. THEY TOLD ME IT COULD BE DUE THE THE BRAKE STOPPER RECALL. THEY WANTED TO DO A DIAGNOSTIC TEST THEN. WHICH I COULD NOT AFFORD AT THAT TIME. THE PROBLEM GOT WORSE. THE BRAKES ACTUALLY STARTED ENGAGING ON THEIR OWN. ONE TIME I WAS ON THE HWY AND HAD TO PULL OVER AND TAP ON MY BRAKES TO GET THEM TO UNENGAGE . I TOOK MY CAR BACK TP THE DEALER HAD THEM DO THE DIAGNOSTICS.  THEY TOLD ME MY MASTER CYLINDER NEEDED TO BE REPLACED AND BRAKES FRONT AND REAR NEEDED TO BE REPLACED. SO I CALLED KIA CORPORATE AFYER READING THE DIAGNOSTICS REPORT. I WAS HUNG UP ON TWICE! I THEN TOOK MY CAR TO ANOTHER PLACE AND HAD THEM DO THEIR OWN DIAGNOSTICS.  I HAD TO COME OUT OF POCKET TO REPLACE A REPAIR THE ENTIRE ABS SYSTEM ON MY CAR. IT WAS DUE TO A DEFECT INSIDE THE MASTER CYLINDER.  THE MAATER CYLINDER WAS COMING APART FROM THE INSIDE. THE PEICES WERE CLOGGING MY BRAKE LINES. YET KIA ONLY DYOOD BEHIND A WARRENTY NOT THE PRODUCT . I HAVE AND LIVE ON A LIMITED INCOME DUE TO MY PHYSICAL DISABILITIES.  I BOUGHT THIS CAR IN GOOD FAITH THAT KIA WAS A GOOD AND LOYAL CONSUMER.  I AM STILL STUGGLING TO PAY FOR THE REPAIRS. MY NEIGHBORS KEPT KNOCKING O. MY DOOR ONE MORNING TO TELL ME MY LIGHTS ON MY CAR WERE ON. I WENT OUT TO CHECK AND IT WAS IN FACT MY BRAKE LIGHTS. I HAD TO TAP ON MY BRAKE PEDDLE TO GET THEM TO TURN OFF. IT RAN MY BATTERY DOWN. I HAD TO CALL MY MAINTENANCE MANAGER FOR A JUMP START. KIA EVEN HAD TO NERVE TO CHARGE ME FOR A LOANER CAR TO DRIVE WHILE THEY CONDUCTED THE DIAGNOSTICS.  I DO HAVE ALL REPORTS AND PAPER WORK AND RECEIPTS.  I WAS SO PROUD OF MY NEW CAR. NOW I AM FINANCIALLY STRAPPED DUE TO THIS MAJOR DEFECT THAT WAS IN MY 2013 MASTER CYLINDER.  THIS WOULD HAPPEN ON CITY STREETS,THE HWY AND PARKED, TURNED OFF WITH NO ONE IN THE CAR.*DT*JB",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311312,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON A SINGLE LANE HIGHWAY, AND HEARD FAINT TICKING/KNOCKING SOUNDS FROM THE ENGINE. THE HIGHWAY SPEED WAS 65MPH. AFTER A COUPLE MINUTES, THE FAINT TICKS GREW INTO HARD KNOCKS AND HARSH RATTLES AS I CLEARED THE TOP OF A HILL. I ENDED UP COASTING TO THE SHOULDER BECAUSE MY ENGINE ABRUPTLY LOST POWER AND TRIED STALLING. SINCE I KNEW MY BRAKE SYSTEM OPERATED WITH VACUUM ASSIST, I TAPPED THE GAS PEDAL TO KEEP THE ENGINE RUNNING AND HAD TO DOUBLE FOOT THE PEDALS TO BRAKE AND KEEP THE ENGINE FROM STALLING. AFTER I STOPPED ON THE SHOULDER, THE ENGINE FINALLY DIED WHILE RATTLING EVEN HARDER. I TRIED STARTING THE ENGINE AGAIN, AND IT DID START, STILL RATTLING AND KNOCKING, SO I SHUT IT OFF. THE ENGINE HADN'T YET SEIZED UP. I TOOK IT TO THE DEALER I BOUGHT IT FROM, PER MY EXTENDED WARRANTY (NON-KIA DEALER). THEY WERE HAPPY TO HELP, BUT RECOMMENDED TALKING TO KIA AS A FIRST STEP. I DID SO, AND THEY DID OFFER TO TOW MY CAR TO THEIR OWN DEALERSHIP, NO CHARGE TO ME, SO THEY COULD INSPECT THE DAMAGE. I WAS TOLD THEY WOULD SEE WHAT COULD BE DONE ABOUT POTENTIALLY GETTING KIA MOTORS TO REPLACE THE ENGINE IF NEEDED, ON THEM, FREE TO ME. THIS DEALERSHIP IS ONE OF TWO IN MY CITY, AND THEY ARE THE NICER OF THE TWO IN TERMS OF CUSTOMER RELATIONS. I HAVE DEALT WITH EACH DEALER FOR VARIOUS REASONS OVER THE YEARS, AND THAT HAS BEEN MY CONSENSUS. I WILL BE WAITING TO SEE WHAT COMES OF THIS ISSUE, BUT THESE CARS THAT CAME WITH THE 2.4 ENGINE NEED TO BE ADDED TO HYUNDAI/KIA'S 2.4 ENGINE RECALL INSTEAD OF IGNORED.",
        "vin": "KNAFW6A37D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310544,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT KIA 2013 KIA FORTE EX. AT 53,000 ENGINE SEIZED UP. KIA IS REFUSING TO HONOR THE WARRANTY. MY HUSBAND PASSED AWAY AND I CANNOT PRODUCE MAINTENANCE RECORDS AS I LOST EVERYTHING TO MY NAME AT HIS PASSING. EVEN THOUGH KIA KNOWS THIS IS A ISSUE WITH THEIR CARS THEY ARE REFUSING TO FIX MY CAR. I HAVE 4 OPEN RECALLS THEY REFUSE TO FIX TOO. KIA SHOULD NOT BE ALLOWED TO OPERATE IN AMERICA. HUNDRED OF THOUSAND COMPLAINTS AND LAWSUIT YET THEY STILL REFUSE TO HONOR WARRANTY. THIS INCIDENT HAPPENED AS LOCAL GARAGE WAS TESTING DRIVING AFTER ROUTINE MAINTENANCE. YES GARAGE IS CERTIFIED TO WORK ON KIA.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303058,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FROZE UP AT 59,000.00 CAR IS UNDER WARRANTY AND KIA IS REFUSING TO FIX CAR. THIS IS A KNOWN ISSUE AND KIA HAS ALREADY SUED AND FINED BY THE GOVERNMENT BUT FOTRES WERE NOT RECALLED. I AM A WIDOW WHO LIVES AT POVERTY LEVEL AND DO NOT HAVE THE MONEY TO FIX THIS. I HAVE 4 OPEN RECALLS THEY ARE ALSO REFUSING TO FIX. I CANNOT PRODUCE MAINTENANCE RECORDS BECAUSE WHEN MY HUSBAND DIED I WAS ACTUALLY HOMELESS. KIA SAID TO BAD.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301266,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR WHEN I NOTICED A TAPPING SOUND AS I ACCELERATED FROM A STOP LIGHT. I PULLED OVER TO CHECK UNDER THE HOOD, BUT COULDN'T FIGURE OUT WHAT WAS WRONG. I CHECK ALL MY FLUID LEVELS AND EVERYTHING WAS PERFECTLY FINE. I SHUT THE HOOD AND STARTED IT BACK UP. THE TAPPING WAS STILL THERE. I DECIDED TO TURN BACK AND HEAD HOME. AS I STARTED TO ACCELERATE THIS TIME THE SOUND GREW TO A HARD POUNDING NOISE. BEFORE I COULD EVEN PULL OFF THE ROAD MY CAR COMPLETELY SHUT DOWN. I LOST ALL POWER AND MY WHEEL LOCKED UP. I TRIED TO START IT AGAIN, NOTHING. I HAD TO TOWED TO MY LOCAL MECHANIC AND AFTER A FEW HOURS IT WAS DECLARED AS \"CATASTROPHIC ENGINE FAILURE\". KEEP IN MIND THE CAR HAS ONLY 61,000 MILES ON IT! AT THIS POINT I HADN'T TOWED TO KIA FOR INSPECTION AND THEY DETERMINED \"COMPLETE ENGINE FAILURE\". \"SOMETHING HAS COME LOOSE INTERNALLY\". THIS ENGINE IS A OBVIOUS DEFECT.",
        "vin": "KNAFW5A32D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290024,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SIMPLY STARTED THE CAR ONE COLD MORNING, AND THE ENGINE STARTED KNOCKING EXTREMELY BAD, CAR NO LONGER DRIVABLE WITH LESS THAN 80,000 MILES SIMILAR TO OTHER KIA MODELS, HOWEVER THE 2013 FORTE DOESN'T SEEM TO BE COVERED BY RECALLS AT THIS POINT.",
        "vin": "KNAFU6A20D5"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11286434,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE GOT KILLED IN IT WENT THRU A BRIDGE CLOSED",
        "vin": "KNAFT4A20D5"
    },
    {
        "components": "STEERING,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280732,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD 6 RECALLS SCHEDULED I MISSED THE APPOINTMENT. NOW I ONLY HAVE 2 RECALLS.  I'VE PUT 2 MOTORED IN THIS CAR ALREADY  [XXX]  [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "KNAFU5A22D5"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270936,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DOWN THE ROAD HEADED TO THE STORE THE VEHICLE JUST DIED RIGHT THERE WHERE I WAS AT SO I HAD TO PUSH THE BRAKE AND MOVE GEAR SHIFTER TO PARK, TURN IT OFF, TURN IT BACK ON AND THEN IT WAS FINE THE REST OF THE WAY. I JUST BOUGHT THIS CAR FROM AUTO SMART IN LONGVIEW TX ON 10/22/2019 AND WHEN I GOT HOME I STARTED LOOKING UP THE VIN NUMBER TO SEE IF I COULD FIND ANY DETAILS LIKE A CAR FAX REPORT AND I CAME ACROSS THIS SITE AND FOUND THAT THERE ARE ACTUALLY RECALLS ON THIS VEHICLE THAT HAVE NOT BEEN FIXED YET. THE MOTOR ALREADY SOUNDS ROUGH AND IT HAS 120K MILES AND THE NONE OF THE ADAPTERS WORK (LIKE TO PLUG UR PHONE FOR CHARGING)!OR THE RADIO. THAT COMPANY SAID THEY HAD ANOTHER ONE ORDER. ALSO THE DRIVER SIDE WINDOW WHEN U ROLL IT UP IT WILL AUTOMATICALLY ROLL RIGHT BACK DOWN SO U HAVE TO MAKE SURE U HOLD IT UP ALL THE WAY TO THE END.",
        "vin": "KNAFU4A28D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "10/17/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR FROM A FOOTBALL GAME, IT COMPLETELY STOPPED RUNNING. I HAD THE CAR TOWED HOME THE NEXT DAY. ONCE HOME THE CAR STARTED BACK UP AS IF NOTHING HAPPENED. ABOUT A WEEK LATER THE ENGINE STARTED HAVING A TERRIBLE KNOCKING NOISE. A MECHANIC REPLACED ROD & BEARING, BUT THE CAR STILL HAS ISSUES WITH STALLING AND KNOCKING NOISE. IT HAS BEEN PARKED FOR ALMOST 2 YEARS WHILE I CONTINUE TO MAKE CAR PAYMENTS. MY OIL AND OTHER FLUIDS WERE ALWAYS CHANGED REGULARLY. I WAS OUTSIDE MY WARRENTY AND AM JUST STUCK WITH THIS CAR WITH A BAD ENGINE. I WOULD REPLACE THE ENGINE, BUT AM AFRAID THAT IT IS A DEFECT IN MANUFACTURING.",
        "vin": "KNAFW5A35D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258832,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2013 KIA FORTE WITH 66,000 MILES AND IT ALREADY HAS KNOCKING IN THE ENGINE. I WAS TOLD BY A KIA DEALERSHIP THAT THE ENGINE WOULD NEED TO BE REPLACE AND IT WOULD COST ME 5,682$. THEY ALSO SAID THAT THE CAR IS NOT SAFE TO DRIVE ANY MORE BECAUSE IT COULD SEIZE UP ON ME WHILE DRIVING. THIS CAR SHOULD NOT HAVE AN ENGINE THAT IS PREMATURELY FAILING AT 66,000 MILES. MY TOYOTA TUNDRA HAS OVER 300,000 MILES AND I HAVE NEVER HAD ANY PROBLEMS WITH ENGINE. KIA NEEDS TO HAVE A RECALL ON THE FORTE ENGINES BECAUSE I'VE SEEN OTHER COMPLAINTS ONLINE ABOUT THE SAME ISSUE OF A BAD ENGINE AT LOW MILES.",
        "vin": "KNAFU4A25D5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11252113,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 KIA FORTE. THE CONTACT STATED THAT WHILE ATTEMPTING TO PLACE THE VEHICLE INTO PARK AND THE VEHICLE WOULD NOT SHIFT GEARS. THE CONTACT TRIED TO DEPRESS THE BRAKES BUT THEY FAILED TO OPERATE AS WELL. THE CONTACT MADE IMPACT WITH A POLE AND THE AIR BAGS DID NOT DEPLOY UPON IMPACT. THE CONTACT HIT HER FACE AND CHEST AGAINST THE STEERING WHEEL. THE CONTACT WENT TO THE HOSPITAL WHERE SHE WAS TREATED FOR WHIPLASH. THE VEHICLE WAS DESTROYED DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO HER HOME. A POLICE REPORT WAS NOT FILED. UPON INVESTIGATION, THE CONTACT DISCOVERED THAT THE VEHICLE HAD BEEN INVOLVED WITH THREE ACCIDENTS PRIOR TO HER OWNING THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THEY ARE INVESTIGATING THE MATTER. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "KNAFT4A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242998,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 KIA FORTE KOUP SX WITH THE 2.4L MPI ENGINE. I WAS DRIVING DOWN THE INTERSTATE AT 75MPH AND ALL OF THE SUDDEN THE ENGINE QUIT RUNNING. I COASTED TO THE SIDE OF THE ROAD AND OPENED MY HOOD AND DID NOT SEE ANY APPARENT PROBLEMS IN THE ENGINE BAY. OIL LEVEL WAS OK. I STARTED THE CAR AGAIN AND DID NOT HEAR ANY ABNORMAL NOISES SO I DROVE IT HOME. TWO WEEKS LATER THE ENGINE STARTED TO MAKE KNOCKING SOUNDS ON MY WAY HOME FROM ANOTHER TRIP. I AM NOW TOLD THAT THE CAR NEEDS A NEW ENGINE WITH ONLY 69,000 MILES ON IT. THE KIA RECALL 17V224000 FOR IMPROPERLY MACHINED ENGINES IS NOT NEARLY AS COMPREHENSIVE AS IT NEEDS TO BE AND DOES NOT INCLUDE THE FORTE. KIA CLAIMS THAT ONLY THE GDI ENGINES ARE AFFECTED BUT THE REALITY IS THE MPI VERSION OF THE 2.0 AND 2.4 THETA II ENGINES ARE FAILING PREMATURELY IN THE EXACT SAME MANNER AS EVIDENCED BY THE MANY REPORTS FROM OWNERS ONLINE.",
        "vin": "KNAFW6A34D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242431,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2.4L ENGINE SEIZED WITH NO WARNING WHILE DRIVING AT HIGHWAY SPEED.  CAR WAS WELL MAINTAINED, OIL CLEAN, 109,000 MILES.   THIS WOULD'VE BEEN VERY DANGEROUS IF THERE HAD BEEN TRAFFIC AT THE TIME.  IT APPEARS SAME ENGINE IN OTHER MODELS SUCH AS OPTIMA AND HYUNDAI SONATA ARE UNDER A RECALL FOR THE MANUFACTURER FAILING TO REMOVE MACHINING DEBRIS FROM THE ENGINES.  SINCE KIA DID NOT INCLUDE THE FORTE FOR SOME REASON I WAS NOT AWARE OF ANY POTENTIAL PROBLEM.",
        "vin": "KNAFW6A30D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231999,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD THE CAR STARTED KNOCKING MAKING A LOUD NOISE AND THEN THE CAR WOULD HARDLY GO. THE CHECK ENGINE LIGHT DID NOT COME ON UNTIL THE CAR STEREO MAKING THE KNOCKING SOUND. THE CAR WAS ON A 35 MPH STREET WHEN IT STARTED.",
        "vin": "KNAFW4A34D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217981,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR, I HEARD A LOUD KNOCK FROM THE ENGINE, THE RPMS WENT TO 0 AND THE CAR DIED, CAR WAS SERVICED AND WELL MAINTAINED",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207483,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V773000 (SERVICE BRAKES, HYDRAULIC) AND 18V363000 (AIR BAGS) HOWEVER, THE PARTS NEEDED FOR THE REPAIRS WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE CONTACT CALLED GENE MESSER KIA DEALER, LOCATED AT 6006 19TH ST, LUBBOCK, TX 79407, (806) 776-5600, AND IT WAS INFORMED PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECTS.",
        "vin": "KNAFU6A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST SEVERAL MONTHS, THE KIA HAS BEEN KNOCKING AT LOW ENGINE RPM UPON INITIAL ACCELERATION FROM A STOP, PARTICULARLY WITH THE AIR CONDITIONING ENGAGED.  IT'S GAS MILEAGE IS ALSO SUBSTANTIALLY DOWN.  I HAD THOUGHT IT NEEDED A TUNE UP, BUT AFTER READING ABOUT THE ISSUES WITH OTHER KIA AND HYUNDAI ISSUES WITH THE THETA II ENGINE, IT SEEMS MORE LIKELY THAT THIS ENGINE IS GETTING READY TO GO DOWN THE SAME ROAD AS THE PROBLEM HAS BECOME MORE PRONOUNCED IN THE LAST MONTH OR SO.  FOR THE MOMENT I AM GOING TO PARK THE CAR AND DRIVE MY AVALANCHE (DESPITE GAS BEING NORTH OF $4 A GALLON) UNTIL THE FORTE IS INCLUDED IN THE ENGINE RECALLS LIKE THE OTHER KIA MODELS WITH THE SAME ENGINE.  IT IS BAFFLING TO ME THAT THIS MODEL WAS EXCLUDED.",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194084,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SEIZED TWICE (SEPARATE INSTANCES) WHILE DRIVING.   FAULTY CONNECTING ROD",
        "vin": "KNAFW6A37D5"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LOOKING UP THE BLUE BOOK VALUE AND NOTICED THAT IT WAS A RECALL ON MY CAR DEALING WITH THE BREAKS, SEATBELT, AND AIRBAG. I MADE A CALL TO KIA, GAVE THEM THE VIN NUMBER AND THEY SAID THE CAR HAVEN'T BEEN FIXED. I WAS NOT AWARE OF THIS AND I DID NOT GET A CARFAX SHEET.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193273,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME LIKE USUAL NOT EVEN A WEEK AFTER MY REGULAR OIL CHANGE AND AS I WAS PULLING UP A SMALL HILL CLOSE TO MY APARTMENT  MY ENGINE SPUTTERED, BACKFIRED AND STALLED. I LOST ALL POWER STEERING AND BRAKES AT THIS POINT.  I PUT THE CAR IN NEUTRAL AND COASTED TO A STOP. AFTER SOME TROUBLESHOOTING I FINALLY GOT THE CAR TO TURN OVER AND THE ENGINE IMMEDIATELY STARTED KNOCKING VERY LOUDLY.  IT IS CLEARLY UNSAFE TO DRIVE AT THIS POINT AND AN OBVIOUS MANUFACTURERS DEFECT.  THE CAR IS AT 62,000 MILES AND THE WARRANTY IS GOOD TO 100,000 MILES. I HAVE SEEN DOZENS OF COMPLAINTS ABOUT THIS MODEL OF CAR WORTH THE SAME ISSUE AND HUNDREDS OF COMPLAINTS WITH OTHER MODELS USING THE SAME ENGINE. IT IS QUITE AN ISSUE TO TAKE CARE OF MONETARILY FOR THE CUSTOMERS OF KIA AND SHOULD BE INVESTIGATED FURTHER.",
        "vin": "KNAFT4A23D5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190535,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING UP MY CAR UNDER THE CARPORT, AS I WAS PARKED STRAIGHTENING MY WHEELS, I HEARD CLICKING WITH EACH TURN.  HUSBAND CHECKED AND FOUND THE SAME CONCERN.  TOOK CAR TO KIA DEALER THE NEXT DAY.  THEY WERE GOING TO TRY TO REPLACE THE SMALL PLASTIC PART IN THE COLUMN.  DISCOVERED THEY COULD NOT AND NOW I HAVE TO PURCHASE A NEW STEERING COLUMN AT A TOTAL COST OF $1,818.36.  OUCH!  I HAVE NEVER EXPERIENCED THIS BEFORE.  MY LAST KIA LASTED 13 YEARS WITH NO MAJOR PROBLEMS.  THIS IS EXTREMELY DISAPPOINTING AND UNNERVING.",
        "vin": "KNAFU4A29D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184922,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SUBMITTING A COMPLAINT ON THE 2013 KIA FORTE EX ENGINE FAILURE FOR REVIEW.    I HAVE A COPY OF THE CARFAX REPORT GIVEN BY THE LOCAL KIA DEALERSHIP AT THE TIME OF PURCHASE WHICH SHOWS THE VEHICLE WAS MAINTAINED REGULARLY. AT THE TIME OF PURCHASE IN AUGUST 2018, THE DEALERSHIP SERVICED THE VEHICLE (OIL CHANGE, ETC.). WE HAD ANOTHER OIL CHANGE AND OVERVIEW OF THE VEHICLE SINCE THEN.      ALL WAS WORKING FINE UNTIL FEBRUARY 11,2019 WHEN WE HEARD A LOUD KNOCKING NOISE WHEN VEHICLE WAS IN IDLE AND INCREASES WHEN SHIFTED INTO DRIVE. ON FEBRUARY 12, I TOOK THE CAR TO OUR AUTO REPAIR SHOP. THEY DETERMINED THE INTERNAL ENGINE NEAR THE REAR IS WHERE THE KNOCKING NOISE WAS COMING FROM. THIS WOULD TAKE A REBUILD OR REPLACEMENT OF THE ENGINE. I CALLED A LOCAL KIA DEALERSHIP ABOUT THIS AND THEY SAID THERE WERE NO RECALLS AND ALL WORK WOULD BE BILLABLE. I HAVE NOT HAD A GOOD EXPERIENCE WITH THIS DEALERSHIP'S SERVICE DEPARTMENT IN THE PAST AND WAS SKEPTICAL ABOUT TAKING THIS CAR THERE. THIS IS WHY I DID NOT TAKE THE CAR TO THE DEALERSHIP. I HAVE A TRUSTED AUTO REPAIR SHOP THAT GIVES ME HONEST AND TIMELY ADVICE AND RESULTS.     I HAVE CONTACTED KIA MOTORS AMERICA, INC ALREADY AND AM HOPING THAT MY COMMUNICATING WITH KIA MOTORS AMERICA, INC. DIRECTLY WILL HELP TO GIVE ME THE SUPPORT THEY ADVERTISE TO CUSTOMERS ON ALL OF THEIR VEHICLES. KIA CLAIMS TO BACK UP THE QUALITY OF THEIR VEHICLES. HOPEFULLY KIA WILL ACKNOWLEDGE THE ISSUE WITH THIS MODEL'S ENGINE FAILURE AND PROVIDE FINANCIAL ASSISTANCE FOR THE EXPENSE THAT WE HAVE INCURRED.     I THANK YOU FOR TAKING THE TIME TO REVIEW THIS INFORMATION.     2013 KIA FORTE EX  SEDAN 4DR  2.0L I4 F DOHC 16V  GASOLINE  FRONT WHEEL DRIVE",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184587,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FORTE ENGINE BEGAN MAKING LOUD NOISES AND RUNNING VERY HARD. THEN THE ENGINE LIGHT CAME ON. WENT TO GET IT FIXED AND DEALER SAID THAT THE ENGINE WAS FAILING AND WOULD NEED TO BE REPLACED. IT IS A 2013 KIA FORTE WITH LESS THAN 100,000 MILES ON IT! THE ENGINE SHOULD NOT BE FAILING! AFTER READING OTHER REVIEWS, IT IS OBVIOUS THAT THIS IS A PROBLEM WITH THIS CAR.",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183270,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE ENGINE MADE LOUD NOISE SHUT DOWN WHEN OIL PAN WAS DROPPED TO SEE WHAT HAPPENED THE ENGINE BLEW A ROD DESTROYING THE ENGINE CAR WAS FINANCED STILL OWE $10,000 CAR ENGINE DESTROYED KIA IS RECALLING ALL 2.0 ENGINES DUE TO THIS DEFECT EXCEPT THE FORTE SO I PAY A PAYMENT MONTHLY CARRY FULL COVERAGE FOR A CAR THAT DOESN'T RUN ONLY RESPONSE FROM KIA IS IT IS NOT UNDER WARRANTY!!!",
        "vin": "KNAFW4A32D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176076,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE SECOND OWNER OF THIS VEHICLE WHICH I PURCHASED AT 21,000 AND IT NOW HAS AROUND 65,000. IN THE LAST THREE YEARS I HAVE HAD TO REPLACE SEVERAL DIFFERENT LIGHTS MULTIPLE TIMES. IT BEGAN SHORTLY AFTER I PURCHASED IT WITH REPLACING REAR DRIVER'S SIDE BRAKE LIGHT THREE TIMES IN A SIX MONTH PERIOD. FROM THERE I HAVE REPLACED THE LICENSE PLATE LIGHTS TWICE THE OTHER BRAKE LIGHT TWICE. WHEN REPLACING THE BRAKE LIGHT IN THE BACK WINDOW, THE SOCKET WAS MELTED. THIS PAST YEAR I REPLACED THE DRIVER SIDE HEADLIGHT AND A COUPLE BIG MONTHS LATER THE PASSENGER SIDE. NOW THE DRIVER SIDE HAS GONE OUT AGAIN.",
        "vin": "KNAFT4A21D5"
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11171034,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL LOCKED ONTO ONE SIDE, I COULD NOT REGAIN CONTROL OF THE VEHICLE AS THE BRAKES STOPPED WORKING AS WELL AND IT MADE A U-TURN ONTO THE SAME STREET I WAS DRIVING ON, HITTING THE CURB, ROLLING OVER. I WAS FOUND UPSIDE DOWN IN MY CAR UNCONSCIOUS FROM THE CRASH BECAUSE MY AIR BAGS DID NOT DEPLOY.",
        "vin": "KNAFU6A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "05/21/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170491,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE THIS INITIAL FUEL FLOW/ROD BEARINGS ISSUE WITH OUR 2013 KIA FORTE. I HAVE CONTACTED KIA AND THE DEALERSHIP A NUMBER OF TIMES, AND YET THE FORTE IS NEVER INCLUDED IN THE RECALLS. CONSIDERING THAT IT WAS BUILT WITH THE EXACT SAME THETA II ENGINE, THIS SEEMS RIDICULOUS.   HTTPS://KFOR.COM/2019/01/16/KIA-HYUNDAI-ISSUE-NEW-RECALL-DUE-TO-ENGINE-FIRE-RISKS/?UTM_CAMPAIGN=TRUEANTHEM%3A+TRENDING+CONTENT&UTM_CONTENT=5C3FC91104D3010DA25C18CA&UTM_MEDIUM=TRUEANTHEM&UTM_SOURCE=FACEBOOK&FBCLID=IWAR1DMDLSKVNOWCP34YHC3CNWHPXVPRDQLFVQ5EUZZ16WH-R70VJ0RWLHM5O",
        "vin": "KNAFT4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "06/11/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156380,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE FAILURE POSSIBLE RELATED TO FAULTY OIL PUMP. ENGINE STARTED VIBRATING WHOLE CAR THEN THE CAR LOCKED AND STOPPED WORKING WHILE DRIVING ON THE ROAD. HAD TO GET CAR TOWED. NO LEAKS. THE ENGINE HAD FLUIDS. MANY OTHER KIA'S WERE AFFECTED. OTHER MODELS HAVE RECALLS. POSSIBLY DAMAGED RODS AND BEARINGS DUE TO THE ISSUE. THE KIA COMPANY SAID NO RECALLS ON MY VEHICLE. MECHANIC SAID NEEDS TO ENGINE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "07/22/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139103,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR IN 2012 BRAND NEW WITH ABOUT 2 MILES ON IT. EVERYTHING WAS GOING SMOOTH UNTIL I WOULD GET DOWN TO A AVERAGE SPEED AROUND 10 MILES AN HOUR. I WAS GETTING ON A RAMP, AND WHEN I WAS GETTING OVER I HAD TO GUN IT BECAUSE A CAR WAS COMING AND A HUGE JOLT HIT SO HARD IT FELT LIKE A CAR JUST REAR ENDED ME. I WAS SO SCARED THINKING A CAR HIT ME WHERE I LET OFF THE GAS AND THE CAR THAT WAS COMING SWERVED TO MISS ME. SO I TAKE IT TO KIA AND THEY SAY NOTHING IS WRONG WITH THE TRANSMISSION OR SHIFTING GEARS. SO I WENT ON WITH MY LIFE. SO ALL OF A SUDDEN IT DOES IT AGAIN. THIS TIME IT JOLTED SO HARD WHERE THE SEAT BELT LOCKED UP AND I ALMOST HIT THE SIDE OF THE HIGHWAY WALL. SO AFTER THAT I REPEATEDLY TOLD KIA I'M GOING TO GET HURT IF THIS DONT GET FIXED AND THEY SAY THE SAME THING THE COMPUTER SYSTEM IS SHOWING NOTHING IS WRONG. SO I TOOK IT TO A TRANSMISSION PLACE AND THEY SAID IT COULD NEED A SOFTWARE UPDATE BECAUSE THE GEARS ARE NOT SHIFTING CORRECTLY. I'VE TALKED TO KIA OVER AND OVER AND NOTING HAS HAPPENED. I STILL HAVE MY WARRANTY 100,000 MILES OR 10 YEARS. THE CAR ONLY HAS 75K MILES ON IT. I DON'T KNOW WHAT TO DO ABOUT THIS SITUATION. NOW ITS SO BAD I'M AFRAID TO DRIVE IT. ITS GETTING SO BAD THAT WHEN IM DOING 65 AND HAVE TO COME TO A SLOW STOP OR WHAT THAT THE CAR SHAKES SO BAD YOU CAN FEEL THE GEARS SHIFTING. ITS DANGEROUS AND KIA IS DOING NOTHING",
        "vin": "KNAFU4A26D5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11129933,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT A SPEED OF 40MPH, ON A TWO LANE STATE HIGHWAY, WHEN A VEHICLE VEERED INTO MY LANE GOING THE OPPOSITE DIRECTION AND HIT THE CAR IN FRONT OF ME. THE VEHICLE IN FRONT OF ME WAS PUSHED INTO THE FRONT PASSENGER SIDE WHEEL. THE FRONT CORNER PANEL WAS DAMAGED UPON IMPACT, AND MY CAR TOTALED, BUT MY AIRBAGS NEVER DEPLOYED. I TOOK THE FULL BRUNT OF THE BLOW, AND HAD NECK, BACK, AND KNEE PROBLEMS DUE TO THE ACCIDENT.    COLLISION REPORT INFORMATION:  DATE 7/28/2018  TIME: 0442  NCIC NUMBER: 9655  OFFICER'S ID NUMBER: 19234",
        "vin": "KNAFT4A21D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/09/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121043,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 KIA FORTE. WHILE THE VEHICLE NOT  IDLING, THE CONTACT NOT ALERTED THAT THE VEHICLE WAS ON FIRE. THE VEHICLE BECAME ENGULFED IN FLAMES. THE FIRE DEPARTMENT WAS CONTACTED AND EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED TO A SALVAGE YARD AND DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED BECAUSE THE MATTER WAS RESOLVED WITH THE INSURANCE COMPANY. THERE WERE NO INJURIES. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE FAILURE MILEAGE WAS 43,000.  **TR  CONSUMER STATED CAR WAS PARKED. FAILING PART: COOLING FAN SENSOR. UPDATED 11/8/18*JB",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119380,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AT 55 MPH , ALL OF A SUDDEN ALL OF MY DASHBOARD LIGHTS CAME ON AND MY CAR  HAD NO POWER, I WAS ALMOST REAR ENDED BY SEVERAL VEHICLES AS I HAD NO ENGINE POWER TO MOVE THE VEHICLE. I WAS ABLE TO GET TO THE SIDE OF THE HIGHWAY( NOT A PULL OVER PLACE) I CALLED FOR A TOW AND HAD IT TAKEN TO THE SHOP I USUALLY GO TO ONLY TO FIND OUT THE ENGINE HAS BLOWN. KIA IS AWARE OF THIS PROBLEM ON OTHER OF THEIR VEHICLES. THIS EVENT ALMOST COST ME MY LIFE... KIA NEEDS TO BE HELD RESPONSIBLE FOR TAKING CARE OF THIS PROBLEM. MY ESTIMATE FOR A REPLACEMENT ENGINE IS $ 3780.00",
        "vin": "KNAFU4A28D5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11118949,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM KIA DATED JULY 27 REGARDING A RECALL ON AIRBAGS. ON JULY 28, I WAS IN A CAR ACCIDENT WITH A DRUNK DRIVER, AND MY AIRBAGS DID NOT DEPLOY. THE CAR IS TOTALED, AND I NO LONGER HAVE IT. THERE IS A POLICE AND COLLISION REPORT.   -   (RECALL RELATED INCIDENT)  TS",
        "vin": "KNAFT4A21D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING INTERSTATE 55 MPH ENGINE MADE CLUNKING NOISE AND STOPPED HAD TO BE TOWED HOME CHECKED TIMING CHAIN WAS GOOD DROPPED OIL PAN AND ROD SHATTERED AND METAL SHAVING ALL TORE UP ENGINE NO LONGER ABLE TO BE REPAIRED LOOKING FOR A NEW ENGINE OWE $10,000 ON CAR HAVE TO CARRY FULL COVERAGE INSURANCE DOESN'T RUN",
        "vin": "KNAFW4A32D5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114249,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR DASH BOARD SHOWS IARBAG SIGN AND IT STAYS . I CALLED TO KIA TALKED TO THEM THEY SAID WE WILL CALL YOU AND NOBODY CALLED ME . I KNOW THAT MY CAR GOT AFFECTED BY THE RECALL SC165 . PLEASE HELP ME WITH MY CAR BECAUSE I DON'T FEEL SAFE.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "05/22/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113633,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. WHILE DRIVING AT AN UNKNOWN SPEED, THERE WAS A KNOCKING NOISE COMING FROM THE ENGINE COMPARTMENT. THE VEHICLE WAS TAKEN TO JEFF BELZER'S CHEVROLET, DODGE, KIA (21111 CEDAR AVE, LAKEVILLE, MN 55044, (952) 469-4444) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "KNAFX4A69E5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113159,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65+ MPH ON THE FREEWAY, THIS 2013 KIA FORTE SX LOST POWER (ENGINE LIGHT, OIL LIGHT AND BATTERY LIGHT ILLUMINATED), STEERING STIFFENED AND VEHICLE RAPIDLY DECELERATED.  IT WAS VERY DIFFICULT AND DANGEROUS TO GET THE VEHICLE DIRECTED OVER TO THE FREEWAY SHOULDER.    THE VEHICLE HAS 61,619 MILES. IT WAS TOWED TO A KIA DEALERSHIP WHERE, BASED ON ENGINE NOISE, KIA HAS DIAGNOSED A ROD BEARING MALFUNCTION AT THE BOTTOM OF THE ENGINE.  THIS ENGINE IS THE 2.4L THETA-II MPI (MULTI-PORT INJECTION) ENGINE (VS THE GDI, OR GASOLINE DIRECT INJECTION, ENGINE THAT HAS ALREADY BEEN RECALLED).",
        "vin": "KNAFW4A30D5"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105328,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN ACCIDENT IN APRIL WHERE MY ENTIRE FRONT END WAS DAMAGED. THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELT DID NOT CATCH ME CAUSING ME TO SMASH MY FACE INTO THE STEERING WHEEL.",
        "vin": "KNAFT4A28D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2018",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104899,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I, LIKE MANY OTHER KIA FORTE OWNERS, FEEL THE RECALL SHOULD INCLUDE THE FORTE. I HAVE EXPERIENCED THE SAME ISSUES AS THE OTHER OWNERS - ENGINE KNOCKING, OIL ISSUES, WHITE SMOKE EXITING THE EXHAUST, LOSS OF SPEED WHILE DRIVING, CAR DYING AFTER ACCELERATION AND FINISHING IN A PUFF OF SMOKE. WHEN IT FIRST BEGAN IN JUNE 2016 I TOOK THE CAR IN TO THE DEALERSHIP WHERE IT WAS PURCHASED AND THEY SAID THEY WOULD NOT REPAIR IT BECAUSE IT WASN'T THEIR FAULT. YET, I SEE THAT THE SAME PROBLEMS ARE LITERALLY BEING REPAIRED ON OTHER MODELS WITH THE SAME ENGINE AND ISSUES. THE THETA II 2.4L ENGINE CLEARLY IS DEFECTIVE IN ALL OF THE VEHICLES. I FAIL TO UNDERSTAND WHY THE FORTE WAS NOT INCLUDED ON THIS LIST.  TO MAKE MATTERS WORSE, THE DEALERSHIP REALLY RAKED US OVER THE COALS ON THE PURCHASE AND FIVE YEARS LATER WE STILL OWE NEARLY $10K ON THE VEHICLE. CLEARLY OTHER DEALERSHIPS ARE AWARE OF THE DEFECT BECAUSE I CANNOT GET ANYONE TO TAKE IT AS A TRADE IN - TURNED DOWN BY OVER TEN DEALERSHIPS. PLEASE ADVISE ME ON HOW WE CAN RECTIFY THIS PROBLEM. MY HUSBAND IS A DISABLED VETERAN AND WE RELY ON THIS VEHICLE TO GET TO AND FROM APPOINTMENTS, AS IT IS OUR ONLY MEANS OF TRANSPORTATION.",
        "vin": "KNAFT4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "06/09/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102940,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLASS ACTION LAWSUIT FOR THETA II ENGINES IN KIA CARS NEEDS TO BE EXPANDED TO INCLUDE ALL THE MODELS WITH THAT ENGINE.  I HAVE A 2013 FORTE SX WITH ONE OF THOSE DEFECTIVE THETA II 2.4L ENGINES.  IT APPEARS THAT ONLY THE OPTIMA, SORENTO AND SPORTAGE MODELS MADE THE LIST.  NOT SURE IF IT IS AN OVERSIGHT OR THAT THEY MADE SO FEW FORTES WITH THAT ENGINE.  HOWEVER IT IS, THE POINT IS THAT THE ENGINE IS BAD NO MATTER WHAT VEHICLE THEY DEEMED TO PLACE IT IN.  PLEASE EXPAND THE RECALL TO MAKE THE ENGINE THE REQUIREMENT FOR THE RECALL.  ALL THESE CARS HAVE THE THETA II PER WIKIPEDIA:  THETA/THETA-II ENGINE - 2.4L (2359CC)    (G4KC, G4KE, G4KG, G4KJ,)        HYUNDAI SONATA (2006'2010)      HYUNDAI SONATA GDI (2011-)      HYUNDAI SONATA (2011-) (MIDDLE EAST)      HYUNDAI TUCSON (2010-)      HYUNDAI SANTA FE (2010-)      HYUNDAI STAREX (2007-)      KIA OPTIMA (2006'2010)      KIA OPTIMA GDI (2011-)      KIA RONDO (2007-)      KIA CADENZA GDI (2011-)      KIA SPORTAGE (2011-)      KIA SORENTO (2011-)      KIA FORTE (2010-2013)  *TR",
        "vin": "KNAFW5A38D5"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/09/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101299,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING THE FREEWAY, ACCELERATED TO MATCH TRAFFIC SPEED, I HEARD THE ENGINE'S RPMS INCREASE BUT ALMOST IMMEDIATELY AFTERWARDS THE CAR SHUT DOWN.  I WAS IN THE MIDDLE LANE OF A VERY BUSY INTERCHANGE AND GOING ABOUT 60MPH WHEN THE CAR QUIT. I KEPT TRYING TO RESTART THE CAR BY PUTTING IT IN NEUTRAL AND AT THE SAME TIME  STEER IT TOWARDS THE SHOULDER.  THERE WERE NO WARNING LIGHTS.  WHEN I HEARD THE ENGINE NOISE I LOOKED AT THE DASH, ALL WAS NORMAL, THE D FOR DRIVE WAS VISIBLE.  IT HAPPENED VERY QUICKLY.  ONCE STOPPED AND OUT OF TRAFFIC, I TRIED TO RESTART THE CAR, IT RAN FOR JUST SECONDS THEN NOTHING.  THIS CAR HAD JUST BEEN SERVICED AT THE KIA DEALER.  IT ONLY HAS 51K MILES ON IT. I HAD TO HAVE IT TOWED TO THE DEALER.  THEY ARE TELLING ME THE ENGINE IS FAULTY BUT THEY DON'T MAKE IT ANYMORE AND THEY HAVE NO RESOLUTION FOR ME.  THE CAR IS ONLY 4 MONTHS PAST THE 5 YEAR MARK AND IT IS UNDER 60000 MILES.  IT HAS BEEN MAINTAINED PERFECTLY, IT STILL LOOKS NEW.  THE ORIGINAL OWNER DID ALL THE SERVICE AS WELL. KIA KNOWS THEY HAVE FAULTY ENGINES, YET THEY DO NOTHING TO WARN THE OWNERS OR REMEDY THE PROBLEM. THE SAY THEIR CARS ARE GOOD FOR 10YRS OR 100K MILES, THEN THEY SHOULD MAKE IT SO.  THIS CAR IS A TOP OF THE LINE 2013 FORTE SX (WITH ALL THE BELLS AND WHISTLES) .  I BELIEVE IT IS ALSO AFFECTED BY THE LATEST AIRBAG RECALL AS WELL.",
        "vin": "KNAFW5A38D5"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101275,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW TIRE PRESSURE IS ALWAYS ON EVEN WHEN I CHECK THE TIRES PRESSURE AND IT RIGHT..THE BRAKES ARE ALWAYS SQUICKING",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100045,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT HEARD A KNOCKING SOUND COMING FROM THE ENGINE COMPARTMENT. THE MOTOR FAILED SEVERAL TIMES, WHICH CAUSED THE VEHICLE TO COME TO A COMPLETE STOP. THE VEHICLE WAS TOWED SEVERAL TIMES TO THE CONTACT'S RESIDENCE DUE TO THE FAILURE. THE VEHICLE WAS TAKEN TO ROUTE 6 AUTO MALL KIA (1049 GRAND ARMY OF THE REPUBLIC HWY, SWANSEA, MA 02777, (508) 646-9700) WHERE IT WAS DIAGNOSED THAT THE MOTOR NEEDED TO BE REPLACED. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC AND IT WAS ALSO DIAGNOSED THAT THE MOTOR NEEDED TO BE REPLACED; HOWEVER, THERE WAS A DELAY IN RECEIVING THE PART FROM THE MANUFACTURER. ONCE THE PART WAS RECEIVED, THE INDEPENDENT MECHANIC WOULD REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNAFW4A31D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093837,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE MAKES A REALLY LOUD TICKING OR TAPPING NOISE WHILE PARKED ON IDLE THAT GETS SIGNIFICANTLY LOUDER WHEN ACCELERATING. THERE ARE MANY VIDEOS ON YOUTUBE THAT DOCUMENT THIS NOISE. THE NOISE IS SO LOUD SOMETIMES IT SOUNDS LIKE SOMETHING IN THE MOTOR WILL COME THRU THE MOTOR.",
        "vin": "KNAFU4A23D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2018",
        "dateOfIncident": "04/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093466,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/24/18 DRIVING ON RESIDENTIAL STREET DOING APPROX 35MPH WHEN CAR BEGAN TO SLOW. ATTEMPTED TO ACCELERATE TO NO AVAIL. TRIED TO TURN AT NEXT CORNER TO ENTER GAS STATION. STRUGGLED TO MAKE TURN AS STEERING WAS VERY DIFFICULT. CAR CUT OFF AND WOULD NOT CRANK EVEN AFTER A JUMP START. CAR TOWED TO INDEPENDENT REPAIR SHOP. DIAGNOSIS \"ENGINE LOCKED UP\". NO MONEY FOR EXPENSIVE REPAIR.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083987,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE LOST STEERING AND BRAKING ABILITY. THE CONTACT COASTED THE VEHICLE INTO AN EMPTY PARKING LOT AND HAD IT TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ENGINE SEIZED. THE VEHICLE WAS NOT REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.",
        "vin": "KNAFW4A30D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078777,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND HEARD A FIZING NOISE AND LOST POWER PULLED OVER AND OIL WAS POURING OUT OF THE BOTTOM OF THE BLOCK, IT HAD THROWN A ROD, THE OIL HAD JUST BEEN CHANGE AND SET TO PROPER LEVEL BEFOR THE 2 HOUR TRIP. THERE WAS NO NOCKING OR AND INDICATION OF ANY KIND.",
        "vin": "KNAFW6A32D5"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074627,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 2ND ENGINE REPLACEMENT I HAVE HAD TO DO IN A 2013 CAR. DRIVING 60MPH WITHOUT WARNING CAR STALLED AND I WAS FORCED TO COAX TO THE SIDE OF RURAL COUNTRY ROAD, IN THE MIDDLE OF EXTREME COLD WEATHER THE 2ND TIME. THE 1ST TIME I WAS DRIVING THE CAR ABFTER JUST GETTING OIL CHANGED AND CAR MADE A LOUD NOISE AND CAR STALLED  WHILE DRIVING ON INTERSTATE AT 70MPH. CAR WAS TOWED AND ENGINE WAS BLOWN EACH TIME.   I HAVE CONTACTED KIA ON BOTH OCCASIONS AND ON BOTH OCCASIONS CAR WAS SENT TO DEALERSHIP AND COULD NOT FIGURE OUT WHY ENGINE BLEW. OIL LEVELS WHERE FOUND GOOD. THIS IS  RIDICULOUS THAT I HAVE HAD TWO REPLACE 2 ENGINES IN A 2013 KIA WHICH IS  FINANCED AND KIA REFUSES TO DO ANYTHING ABOUT IT.   I HAVE RECEIPTS AS WELL AS REPORTS DONE ON CAR EACH TIME THIS OCCURRED. HOWEVER THEY ARE IN GLOVEBOX OF CAR AT GARAGE GETTING A NEW ENGINE!",
        "vin": "KNAFT4A20D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "12/31/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071588,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING MONTH OF DECEMBER 2017 DISCOVERED ALL BRAKE LIGHTS (TOTAL OF 3 BULBS) BURNED OUT.  THE CENTER TOP BRAKE LIGHT ASSEMBLY DISCOVERED MELTED (SELF REPLACED WITH NEW ONES). THREE WEEKS AGO,  RIGHT BRAKE LIGHT ASSEMBLY AND BULB BOTH BURNED OUT AND MELTED.  I REPLACED THE LIGHT BULB AND USED ELECTRICIAN TAPE TO HOLD SOCKET AND BULB IN PLACE.",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054770,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. WHILE DRIVING 70 MPH, THE MOTOR FAILED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO DELAND KIA (2322 S WOODLAND BLVD, DELAND, FL 32720, (386) 734-7800) WHERE IT WAS DIAGNOSED THAT THE CRANK SHAFT FAILED AND DESTROYED THE ENGINE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER STATED THAT THEY WOULD NOT REPAIR THE VEHICLE BECAUSE THERE WAS NO OPEN RECALL AND THE VEHICLE WAS NOT UNDER WARRANTY. THE FAILURE MILEAGE WAS 66,000.",
        "vin": "KNAFW6A36D5"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11050992,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LIGHT BULBS KEEP BURNING OUT.  FOUND A RECALL FOR THE SWITCH.  I BROUGHT IT IN TO LOCAL REPAIR SHOP AND THEY SAY IT'S THE SWITCH.  CALLED KIA CUSTOMER REP AND THEY SAID THERE IS A RECALL BUT IT DOES NOT APPLY TO MY KIA FORTE. NOT GOOD! I HAVE A KIA AND A HYUNDAI.  HAVING ISSUES WITH THE HYUNDAI AS WELL.  THESE ARE BOTH 2013 MODELS AND I EXPECTED MORE.  I WILL NOT BE BUYING THESE CARS AGAIN SINCE THEY HAVE ONGOING ISSUES AND THE COMPANY DOES NOT STAND BEHIND THEIR PRODUCT FOR ITEMS THAT SHOULD NOT WEAR OUT IN 4 YEARS.  VERY POOR QUALITY.",
        "vin": "KNAFU420D56"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I KEEP HAVING ISSUES WITH MY BREAK LIGHT HAVING TO BE REPLACED ALL THE TIME. NOW IT'S WHERE THEY DO NOT WORK AT ALL NOR DOES THE CAR GO INTO GEAR! I HAVE TO USE SOMETHING TO PUSH THE SHIFT LOCK DOWN SO THAT I CAN SHIFT GEARS. THIS SEEMS TO BE AN UNIVERSAL ISSUE AROUND THE BOARD ON SEVERAL DIFFERENT FORUMS. NOW THIS ISSUE HAS CAUSE SOME TYPE OF ELECTRICAL ISSUE WITHIN MY VEHICLE. I TOOK IT TO KIA AND AT SOME POINT I'M SURE THIS IS ISN'T THE FIRST THEY HAVE HEARD OF THIS BECAUSE THEY KEEP SAYING WELL YOUR VEHICLE DOESN'T HAVE ANY RECALLS. OKAY I UNDERSTAND BUT AT THE SAME TIME THE EXACT SAME THATS HAPPENING WITH MY VEHICLE IS ALMOST IDENTICAL TO PREVIOUS YEAR MAKE AND MODEL BREAKLIGHT ISSUES. IT'S FAR TOO MANY COMPLAINTS ABOUT THIS ISSUE AND IF YOUR VEHICLE ISN'T UNDER WARRANTY ANYMORE, KIA REFUSES TO ACKNOWLEDGE IT OR BE RESPONSIBLE FOR IT! IF IT WALKS LIKE A DUCK....QUACKS LIKE A DUCK....IT'S A DUCK...PLAIN AND SIMPLE! I FEEL THIS IS NEGLECT AND IT'S PUTTING CONSUMERS LIVES AT RISK.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035851,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXTERIOR LIGHTS ON THIS VEHICLE NEED REPLACING EVERY FEW WEEKS ALONG WITH THE CRUISE CONTROL NOT DISENGAGING WHEN BRAKES ARE APPLIED AND GEAR SHIFT DOES NOT ENGAGE.  THE BRAKE LIGHTS WILL LIGHT WHEN THE INTERIOR LIGHT CONTROL IS IN THE OFF POSITION BUT WHEN THE CAR IS ON AND LIGHTS HAVE BEEN TURNED ON, THE BRAKE LIGHTS DO NOT LIGHT.  WHEN IT FIRST BEGAN HAPPENING THE CAR WAS TAKEN TO EARNHARDT KIA IN PHOENIX AND THEY SAID THEY COULD FIND NOTHING WRONG WITH THE LIGHTING SYSTEM OR ELECTRICAL SYSTEM.  IN THE COURSE OF THREE YEARS THERE HAVE BEEN 12-15 LIGHTBULBS REPLACED INCLUDING A HEADLAMP.",
        "vin": "KNAFU4A23D5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11034019,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCIDENT ON 10/12/2017 @6:30AM AIR BAG DID NOT  WORK (TOTALLY MY CAR",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "09/11/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023291,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT BRAKE LIGHT WAS OUT TOOK CAR TO MIDAS TO HAVE BULB REPLACED, WHERE THE MELTED LIGHT SOCKET WAS DISCOVERED. TOOK CAR KIA DEALERSHIP THE SAME DAY 9/11/2017 TO FIND OUT IF THERE WAS A RECALL ON THIS ITEM AND WAS INFORMED THERE WAS NOT. THE KIA ADVISOR JACK TOLD ME THAT THEY WHERE ABLE TO REPLACE THE BULB BUT HAD TO GET APPROVAL TO REPLACE THE WHOLE SOCKET. ON 9/12 I WAS INFORMED THAT DPSM DENIED THE REQUEST TO COVER THE PART. PICTURES SENT TO DPSM BY KIA DEALERSHIP.",
        "vin": "KNAFT4A26D5"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11018775,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS AND SEAT BELTS DID NOT WORK DURING AN ACCIDENT.  CAR WAS TRAVELING 40 MHP ON A CITY STREET WHEN IT STRUCK ANOTHER CARE FROM BEHIND.  FRONT DRIVER AND PASSENGER SEAT BELTS DID NOT LOCK AND AIR BAGS DID NOT DEPLOY RESULTING IN FACIAL INJURIES AND CONCUSSION FOR DRIVER AND PASSENGER.",
        "vin": "KNAFU6A27D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2017",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. WHILE DRIVING 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED WITH A BLOWN BEARING IN THE ENGINE, AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT FOUND AN UPCOMING RECALL ONLINE, BUT THE VEHICLE WAS NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 91,000.",
        "vin": "KNAFW4A30D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "04/06/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971607,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL MONTHS AGO I WAS DRIVING TO THE FORTE AND THE CAR IDLED DOWN AND STOPPED AT THE STOP SIGN AND SHUT OFF. THE NEXT DAY I WAS DRIVING HOME AND I HEARD A NOISE FROM THE HOOD, THE CAR BEGAN IDLED DOWN THEN SHUT OFF WHILE DRIVING.  THE CAR WAS TAKEN TO A MECHANIC SHOP, THERE WERE NO OIL GOING THROUGH THE LINES. MANY MONTHS BEFORE THAT  I WAS OUT WITH THE FORTE AND IT WOULD NOT START, THAT HAPPENED SEVERAL TIMES, I GOT THE OIL CHANGED AND I WAS TOLD NO OIL WAS GETTING THROUGH THE LINE. RECENTLY, THIS MONTH I WAS DRIVING THE FORTE TO WORK AND THE CAR BEGAN TO JUMP AND IDLING DOWN THE ENGINE WAS TREMBLING AND THE VEHICLE SHUT DOWN. A TOW TRUCK WAS CALLED.",
        "vin": "KNAFW5A3OD5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946901,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CALIPER SEIZED UP, GRINDING NOISES,  AROUND 35000 MILES",
        "vin": "KNAFU5A25D5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936581,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS REALLY COLD, THE BRAKES WHEN APPLIED GET STUCK DOWN.  I HAVE TO PHYSICALLY DISENGAGE THE BRAKES..  EVEN WHEN I PARK MY CAR AT TIMES THE BRAKE PEDAL  WILL BE DOWN AND ONLY WAY I NOTICED IS THE BRAKE LIGHTS IN THE BACK OR ON.. ONLY TIME THIS HAPPENS IS WHEN ITS COLD OUTSIDE..  DEALER TOOK 2 TIMES AND DECIDED NOT TO TAKE IT ANY MORE BECAUSE THEY ADVISE THEY CAN'T FIND THE PROBLEM.  SEEMS THEY HAD OTHER YEARS OF RECALL AND SEEMS FROM THIS SITE THAT IT IS HAPPENING WITH THIS MODEL TOO..       THIS HAPPENS MOSTLY IN THE MORNING OR LATE EVENING WHEN TEMPERATURE BELOW 40 DEGREES",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/06/2016",
        "dateOfIncident": "12/05/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10930120,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY MY BRAKE PEDAL DID NOT ENGAGE AND HAD AN ACCIDENT.  I HAD REPORTED TO KIA THAT THE BRAKE PEDAL WAS STICKING AND I WOULD HAVE TO FLIP IT BACK UP HOWEVER WHEN I TOOK IT IN THEY INFORMED ME THEY COULD NOT RECREATE THE PROBLEM.  KIA SHOULD REALLY LOOK INTO TO THIS COSTLY PROBLEM.  I HAVE LOOKED AT REVIEWS AND I SEE WHERE THERE IS COMPLAINTS OF THE SAME PROBLEM.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/13/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897135,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING THE VEHICLE AT 50 MPH WHEN AN UNKNOWN NOISE BEGAN COMING FROM THE ENGINE. I WAS ABOUT 3 MILES FROM HOME, BY THE TIME I GOT HOME THE NOISE WAS MUCH LOUDER. I SHUT IT OFF AND IMMEDIATELY HAD THE VEHICLE TOWED TO MY CLOSEST KIA DEALERSHIP. THE VEHICLE IS CURRENTLY 2,200 MILES UNDER THE 100,000 MILE WARRANTY (ORIGINAL OWNER). THE DEALERSHIP CALLED ME ABOUT 2 HOURS LATER AND TOLD ME THAT THE ENGINE EXPERIENCED A \"CATASTROPHIC FAILURE\" (LATER I LEARNED A ROD HAD GONE BAD) AND MY WARRANTY WAS VOIDED DUE TO \"OIL SLUDGE\" IN THE ENGINE. THE SERVICE DEPARTMENT IMMEDIATELY BEGAN TALKING ABOUT SELLING ME A NEW CAR, WHICH I DECLINED. I ALSO DECLINED ANY MAINTENANCE TO BE PERFORMED. I THEN HAD THE VEHICLE TOWED TO A PRIVATE CERTIFIED MECHANIC WHO SENT A CAMERA INSIDE THE ENGINE AND DETERMINED THAT THERE WAS NO \"SLUDGE\" TO BE FOUND. THE MECHANIC ALSO DETERMINED THAT THERE WAS NO WAY FOR KIA TO KNOW THIS SINCE HE COULD TELL THAT NEITHER THE VALVE COVER, NOR ANY OTHER ENGINE PART, HAD BEEN REMOVED TO FACILITATE SUCH INSPECTION. NOW I AM FACED WITH $3,700 IN ENGINE REPLACEMENT COSTS SINCE KIA REFUSES TO ACKNOWLEDGE THE PROBLEM. KIA SEEMS TO HAVE SOMEHOW DETERMINED ENGINE \"SLUDGE\" WITHOUT EVEN LOOKING INSIDE THE ENGINE. I HAVE A FEW EXTERNAL PHOTOS AS PROOF THAT THE ENGINE HAD NOT BEEN TOUCHED BY KIA BUT I AM UNABLE TO UPLOAD THEM HERE.",
        "vin": "KNAFU4A29D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/13/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS IN ADDITION TO A PREVIOUS COMPLAINT. I FORGOT TO ADD IMPORTANT INFORMATION. I WAS TOLD BY KIA THAT MY ENGINE ISSUE IS A \"BLOWN ROD\" INSIDE THE ENGINE. KIA HAS SEVERAL OTHER MODELS THAT HAVE HAD THE EXACT SAME ISSUE THAT ARE CURRENTLY IN LITIGATION. I FEEL AS THOUGH I'VE \"MISSED THE BOAT\" ON THIS ISSUE.",
        "vin": "KNAFU4A29D5"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10889314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN ACCIDENT. I WAS SITTING STILL WHEN I WAS STRUCK FROM THE REAR BY A DULLY TRUCK THAT WAS TRAVELING GREATER THAN 40 MILES PER HOUR. I WAS PUSHED APPROXIMATELY 4 FEET INTO THE CAR IN FRONT OF ME. MY AIRBAG DID NOT DEPLOY AND MY SEAT BROKE. THE SEAT IS IN THE RECLINED POSITION.  THE ADJUSTER TOTALED THE CAR DUE TO DAMAGE.",
        "vin": "KNAFT4A28D5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/05/2016",
        "dateOfIncident": "06/05/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  TURNING OFF A ROAD OF 55 MPH ONTO A 35 MPH ROAD. I LET OFF OF BRAKES AFTER TURN AND I TRIED PRESSING ON GAS AND NO GAS PEDAL! I HIT THE CURB BECAUSE I WAS N SHOCK LOOKING FOR GAS PEDAL. THIS MESSED MY RIM AND TIRE UP. THE GAS PEDAL WAS LAYING ON THE FLOOR.  NO PROPERTY DAMAGE BUT THIS IS VERY DANGEROUS BECAUSE THIS COULD OF EASILY BEEN THE BRAKE PEDAL. I'M SURE THEY ARE MADE OUT OF SAME MATERIAL. I AM WAITING FOR INSURANCE ADJUSTER TO COME IN THE MORNING TO ASSESS THE DAMAGE. POLICE DID NOT WRITE ACCIDENT REPORT.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853461,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF MY 2013 KIA FORTE EX,  THE VEHICLE ROUGHLY HAS 70,000 MILES ON IT.  THE VEHICLE HAS ALWAYS BEEN PROPERLY MAINTAINED VIA OIL CHANGES, FILTERS, ETC ON TIME WITH QUALITY NAME BRAND FULLY SYNTHETIC OIL AND FILTERS PER THE MANUFACTURER'S RECOMMENDED MAINTENANCE SCHEDULE WHICH IS EVERY 7500 MILES.  I WAS DRIVING MY VEHICLE HOME ON A VERY BUSY FREEWAY ON THE EAST COAST.  I WAS IN THE CENTER LANE OF 5 LANES ON THE SOUTH BOUND SIDE AND ALL OF A SUDDEN MY CAR LOST ALL POWER AND WAS SLOWING DOWN AT AN UNSAFE RATE OF SPEED BECAUSE I HAD NO POWER AND DID NOT WANT TO TOUCH THE BRAKES OBVIOUSLY.  I PANICKED BUT WAS ABLE TO PUT MY RIGHT SIGNAL ON TO TRY AND GET TO THE SHOULDER OF THE FREEWAY I CONTINUED TO PANIC BECAUSE MY CAR WAS STEADY SLOWING AND EVENTUALLY WOULD COME TO A STOP BECAUSE I HAD NO POWER,  THE GAS PEDAL WOULD NOT FUNCTION AND I KNEW THE CAR SHUT DOWN BECAUSE ALL THE LIGHTS WERE ON ON THE DASH AS IF YOU WERE STARTING THE CAR.  THANKFULLY SOMEONE WAS WATCHING OVER ME THAT DAY AND I MADE IT TO THE SHOULDER BEFORE THE CAR ROLLED TO A COMPLETE STOP.   IF I WERE UNABLE TO SAFELY MOVE OVER TWO LANES AND MAKE IT TO THE SHOULDER ON MOMENTUM I WOULD HAVE BEEN STOPPED IN A LANE OF TRAVEL ON A BUSY FREEWAY AND WHAT WOULD I HAVE DONE?  I PROBABLY WOULD HAVE CAUSED AND BEEN PART OF A MAJOR ACCIDENT,  EVEN THOUGH I DID MAKE IT TO THE SHOULDER I WAS STILL PANICKING BECAUSE THIS IS A VERY BUSY FREEWAY AND I FELT HELPLESS.  THE CAR WOULD NOT START IT WOULD MAKE A FUNKY NOISE AND THAT'S IT BUT WOULD NEVER START SO I WAS STRANDED.  I LOOKED IN MY OWNERS MANUAL AND CALLED KIA, THE DEALERSHIP WAS 10 MINUTES FROM MY LOCATION. I WAS TOLD THERE WAS NOTHING THEY COULD DO BECAUSE THEY DIDN'T HAVE A TOW TRUCK AND I WAS ON MY OWN. I HAD THE CAR TOWED THERE AND WAS TOLD THE ENGINE BLEW UP AND IT WAS THE BOTTOM END. I BELIEVE IT WAS IN THE TIMING SYSTEM AND KIA IS LYING.",
        "vin": "KNAFU5A25D5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/12/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825862,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL AND BRAKES DON'T RETRACT BACK UP AFTER THEY BEEN APPLIED  WHEN THE TEMPERATURE OUTSIDE BELOW 32 DEGREES.  DEALER COULDN'T FIND NOTHING WRONG, WHEN I GET TO THE DEALER ITS NOT COLD ENOUGH TO HAVE THE PROBLEM, ITS NOT A CONSISTENT PROBLEM, BUT CAN BE DANGEROUS AT TIMES.",
        "vin": "KNAFU4A20D5"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2015",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777855,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING 55 - 80 MILES PER HOUR, ESPECIALLY RIGHT AT 70, THE CAR SHAKES, AND THE ENGINE KNOCKS. IT FEELS LIKE A VIBRATION, AND THE WHEEL SHAKES UNDER YOUR HANDS WITH A RHYTHMIC KNOCKING NOISE FROM THE ENGINE.    THE CAR ALSO HAS ISSUES WITH THE FRONT RIGHT BRAKE WHEN IT IS CHILLY OR WET. THE BRAKE STICKS AND WILL NOT COME UP, GRINDING AND CAUSING THE CAR TO BECOME DIFFICULT TO DRIVE. THE PEDAL SINKS IN AND WILL NOT COME BACK UP.    I HAVE TAKEN THE CAR TO THE DEALER AND BEEN TOLD NOTHING IS WRONG WITH THE CAR. BOTH ISSUES ARE STILL GOING ON, AND WORSENING AS I DRIVE IT. PRETTY SURE BEING PUSHED PAST MY WARRANTY. TAKING TO ANOTHER DEALER FOR SECOND OPINION, WORRIED IN MEAN TIME THE CAR IS NOT SAFE TO DRIVE BASED ON OTHER SIMILAR REPORTS.    I BOUGHT MY CAR FROM DEALERSHIP, AND WAS ABLE TO VERIFY IT HAD ONE OWNER. AT TIME OF PURCHASE THE CAR DROVE FINE, BUT WITHIN DAYS BOTH ISSUES HAD BEGUN. I TOOK IT TO A DIFFERENT DEALER FOR SERVICE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2015",
        "dateOfIncident": "09/13/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776599,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL ENGINE LIGHT CAME ON WHILE THE CAR WAS AT IDLE. TURN THE ENGINE OFF AND IT FAILED TO RESTART. I HAD THE CAR TOWED TO THE NEAREST DEALER AND AFTER NUMEROUS TIMES OF THEM TRYING AT STARTING THE CAR, THE CAR  STARTED UP ONLY TO SHUT OFF. THEN THEY CHECKED IT OUT AGAIN TO FIND THAT THE ENGINE HAD LOCK UP. NOW I AM BEING ASKED TO PAY FOR A NEW ENGINE OR GET A NEW CAR.",
        "vin": "KNAFU4A25D5"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761144,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR MAKES LOUD NOISE WHILE DRIVING DOWN FWY SOUNDS LIKE ENGINE IS GOING TO DROP OUT FROM UNDERNEATH IT - SHAKES AND VIBRATES AND ACTS LIKE IT'S GOING TO STOP ANY MOMENT.  BRAKES WILL NOT DISENGAGE, THEREBY MAKING THE GAS PEDAL  UNABLE TO ENGAGE.  CAR LOSES POWER WHILE DRIVING WHEN BRAKE DOESN'T DISENGAGE BECAUSE THE GAS PEDAL DOESN'T ENGAGE.  BRAKES SMELL OF BURNING RUBBER.  CAR RIDES LIKE ALL 4 TIRES ARE FLAT - CAR SHAKES AND VIBRATES AS WELL.  THIS HAS HAPPENED NUMEROUS TIMES - MORE THAN 10 - TOOK TO DEALER - THEY TOLD ME THERE WAS NOTHING WRONG WITH THE CAR.  IT IS EXTREMELY DANGEROUS TO DRIVE - I HAD THE BRAKE SYSTEM LINE FLUSHED AND BLED AND THE SHOP TOLD ME THAT WHAT WAS IN THE BRAKE LINE WAS NOT BRAKE FLUID - WRITTEN RIGHT ON THE INVOICE.  KIA IS NOT STANDING BEHIND THEIR CARS AND SCREWING PEOPLE - ESPECIALLY WOMEN.  SERVICE MANAGERS WOULD JUST SMIRK AND LAUGH WHEN I TOOK IT IN WITH THE COMPLAINTS - LIKE I WAS AN IDIOT.",
        "vin": "KNAFT4A27D5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2015",
        "dateOfIncident": "07/12/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733462,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TRIED BACKING OUT, TURNED MY WHEELS AND WASN'T ABLE TO. HEARD A LOUD POP UNDERNEATH, THEN THE WHOLE FRONT RIGHT OF MY CAR SUNK IN. TRIED BACKING OUT, BUT THE CAR WAS NOT ABLE TO MOVE AT ALL. I PUT IT IN PARK AND WENT OUTSIDE TO SEE WHAT IT WAS. HUBCAP WAS GONE, AND THE FRONT PASSENGER WHEEL LOOKED LIKE IT SUNK INTO THE CAR. IT LOOKED LIKE THE WEIGHT OF THE CAR WAS SITTING ON THAT ONE WHEEL. IT SEEMS LIKE THE TIRE ROD MIGHT HAVE BROKEN. BEFORE, I WOULD HEAR A CREAKING SOUND WHEN I PRESSED ON THE BREAK, IT WAS LOUDER WHEN THE ROADS WERE WET. IT'S A 2013 KIA FORTE WITH ONLY 47K MILES ON IT.",
        "vin": "KNAFU4A24D5"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714715,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE DOES NOT KEEP AN ACCURATE READING.  WHEN I FILL THE TANK UP WITH GAS ONE DAY AND I DRIVE TO WORK 15 MILES AND THE TANK GAUGE WILL SHOW BELOW 3/4 OF A TANK.  *TR",
        "vin": "KNAFT4A2XD5"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "01/23/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691650,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT STATED THAT IMMEDIATELY AFTER PARKING AND ATTEMPTING TO REMOVE THE KEYS FROM THE IGNITION, THE SHIFT LEVER ROLLED OUT OF PARK INTO REVERSE. THE VEHICLE RAN OVER THE CONTACT AND PROCEEDED TO ROLL INTO THE CONTACT'S YARD. THE VEHICLE THEN STRUCK A COUPLE OF TREES AND CAME TO A STOP IN THE CONTACT'S NEIGHBORS YARD. IT WAS UNKNOWN IF THE CONTACT SUSTAINED ANY INJURIES OR IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "KNAFT4A2XD5"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "10/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671473,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "10/21/2014 I PURCHASED A 2013 KIA FORTE WITH ABOUT 21, 620 MILES ON IT AND THIS PARTICULAR UNIT WORK LIKE A CHAMPION BUT IT IS DEFECTIVE AND JUST WITHOUT WARNING WON'T TURN ON. I HAD THE SAME ISSUE FIVE TO SEVEN TIMES ALREADY IN TWO MONTHS. I RECORDED FIVE TIMES, 10/29/2014, 11/12/2014, 12/02/2014, 12/16/2014, AND 01/06/2014. THE DEALER WORKED ON THE VEHICLE FOR THE 12/02 & 12/16 INCIDENTS BUT FIND THE VEHICLE WORKING FINE AND I RETURNED THE VEHICLE TO SERVICE DEPARTMENT ON 01/08/2015. I WANT MY MONEY BACK. IT IS UNRELIABLE AND IT MIGHT BE A HAZARDOUS CONDITION, THE VEHICLE JUST DIE ON ME AND WON'T TURN ON.  THE DEALER REPLACED THE STARTER. HOWEVER, THE CONSUMER CONTINUED TO EXPERIENCE PROBLEMS. UPDATED 10/29/15.*JB",
        "vin": "KNAFT4A25D5"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDOW CRACKED WITH THE DEFROSTERS ON.  IT WAS 35 DEGREES OUTSIDE TEMP.  THE CRACK STARTED OUTSIDE THE AREA FROM THE DEFROSTERS.  2 TO 3 INCHES ABOVE THE BOTTOM OF THE WINDOW. IT ONLY CRACKED ON THE INSIDE.  NO STONE MARKS ON THE OUTSIDE.  *TR",
        "vin": "KNAFU4A23D5"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640975,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DRIVER SIDE SEAT BELT FREQUENTLY DOESN'T LATCH PROPERLY. IT CLICKS AS IF LATCHED, THEN COMES OUT WHEN THE SEAT BELT IS SLIGHTLY PULLED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630698,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40 MPH, THE POWER STEERING WHEEL SEIZED AND EXCESSIVE FORCE ON THE STEERING WHEEL WAS REQUIRED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 15,500.",
        "vin": "KNAFU4A25D5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630711,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR DECEMBER 2012; 2013 KIA FORTE EX.  ABOUT A 9 MONTHS AFTER I PURCHASED THE CAR, I WAS DRIVING AND THERE WAS A LOUD KNOCKING NOSE IN THE ENGINE AND ABOUT A HOUR LATER THE CAR STALLED ON ME IN DOWNTOWN SACRAMENTO, CA.  I GOT THE CAR TOWED TO SACRAMENTO KIA (2820 FULTON AVE, SACRAMENTO, CA 95821).  AFTER THE CAR WAS DIAGNOSED THEY TOLD ME THAT IT WAS A MANUFACTURING PROBLEM, THEY SAID WHEN THE CAR WAS BUILT A FEW PARTS IN THE ENGINE WERE PUT IN INCORRECTLY WHICH CAUSED MY ENGINE TO BASICALLY OVER HEAT AND START TO FALL APART.  SO THEY SAID THAT THEY WILL REPLACE THE ENGINE FREE OF CHARGE.         AUGUST 17 2014 AWHILE AFTER THE NEW ENGINE WAS PUT IN MY CAR, THE CAR STALLED ON ME AGAIN WITH THE SAME KNOCKING NOISE COMING FROM THE ENGINE.  AT THE TIME I WAS ON THE FREEWAY GOING ABOUT 60MPH.  AFTER THE CAR STALLED ON ME I COULD NOT GO ABOVE 30MPH NO MATTER HOW HARD I PUSHED THE GAS PEDAL.  I HAD TO DRIVE ALL THE WAY HOME ON THE FREEWAY WITH THE HAZARD LIGHTS ON GOING 30MPH.  WHEN I GOT HOME I HAD THE CAR TOWED TO SACRAMENTO KIA (2820 FULTON AVE, SACRAMENTO, CA 95821).  IT TOOK THEM A FEW DAYS TO A WEEK FOR THEM TO CALL ME AND LET ME KNOW THE CAR WAS THERE.  I CALLED TWICE EVERYDAY AND NEVER RECEIVED A CALL BACK WHEN THEY SAID THEY WERE BUSY.  I DID NOT RECEIVE A PHONE CALL UNTIL THEY CALLED ME THE THIRD WEEK AND SAID THEY ARE ORDERING PARTS FOR THE CAR.  I DID NOT AUTHORIZE ANYONE TO ORDER PARTS FOR THE CAR BECAUSE I DID NOT FIND OUT WHAT WAS WRONG WITH THE CAR.  TWO DAYS AGO SEPTEMBER 2 2014 WAS THE DATE I FOUND OUT THAT I NEEDED A WHOLE NEW ENGINE WHEN THE ENGINE WAS REPLACED A YEAR AGO.  SO THIS WOULD BE THE THIRD ENGINE FOR MY BRAND NEW 2013 KIA FORTE EX I PURCHASED A YEAR AGO.  *TR",
        "vin": "KNAFU4A25D5"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/21/2014",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615195,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BRAKE PEDAL WILL STICK AND NOT COME BACK UP.  THIS HAS ALSO CAUSED TRACTION CONTROL LIGHT TO COME ON.  ONLY OCCURS WHEN IT IS RAINING OR A LITTLE COLD OUTSIDE. 2013 KIA FORTE.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605950,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS-2",
                "productYear": "9999",
                "size": "P215/45R17",
                "type": "Tire"
            }
        ],
        "summary": "I HAD TO REPLACE THREE OF MY TIRES ON MY 2013 KIA FORTE SX.  THEY HAD SIDE WALL DAMAGE AND FORMED BUBBLES.  THESE TIRES ARE THE WORST.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "03/27/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587708,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR A YEAR AFTER IT WAS RELEASED AND IT SEEMS TO JERK AT HIGH SPEEDS WHEN GOING OVER MINOR BUMPS IN THE ROAD. ALSO SHAKES WHEN RIDING THROUGH HIGH WINDS. IT SEEMS EXTREMELY LIGHT WEIGHT AND IS HARD TO CONTROL IF THERE IS STRONG WINDS(15MPH) PRESENT WHICH EXTREMELY NERVE WRACKING ESPECIALLY TRAVELING LONG DISTANCES, OR WITH MY CHILDREN, OR ON THE HIGHWAY. THE JERKING SHOULD NOT BE OCCURRING FOR MINOR BUMPS ON THE ROAD, MAKES ME FEEL THE CAR IS UNSAFE.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "08/23/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573547,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE CAR ON THE TURNPIKE, SET THE CRUISE CONTROL FOR 65 MPH.  CRUISE STAYED ON FOR A FEW MINUTES, SHUT OFF AUTOMATICALLY AND BEGAN TO DECELERATE.  ATTEMPTED TO ACCELERATE BY DEPRESSING THE GAS PEDAL.  CAR DID NOT ACCELERATE, ALTHOUGH RPMS DID INCREASE.  HAD TO PULL OVER TO THE SIDE OF THE ROAD, TURN THE CAR OFF AND RESTART.  DROVE REMAINDER OF DISTANCE W/O CRUISE CONTROL.  CAR HAS HAD THIS SAME ISSUE INTERMITTENTLY.  HAVE HAD TO THE DEALERSHIP TWICE.  CAR HAS BEEN ANALYZED BY THE COMPUTER WITH NO ISSUE FOUND.  BOTH TIMES THEY HAVE RELEASED THE CAR SINCE THEY WERE UNABLE TO REPLICATE THE ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "10/12/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547824,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 11:30 A.M., TRAVELING ON A TWO LANE, PAVED ROAD, AT APPROXIMATELY 45 MPH, HEARD A LOAD \"POP.\"  NOTICED REAR WINDOW HAD EXPLODED.  PULLED OFF ROAD.  ALL GLASS WAS STILL INTACT, BUT, IN A MILLION PIECES.  THERE WAS NOT ANY NOTICEABLE HOLES, INDENTATIONS, OR ANY OBVIOUS SIGNS OF WHAT MAY HAVE CAUSED THE DAMAGE.  THERE DID APPEAR TO BE PRIMARY POINT OF WHERE THE DAMAGE WAS COMING FROM, ONE OF THE TOP DEFROSTER LINES.  CURRENTLY WORKING WITH LOCAL DEALER, SAME AS WHERE I PURCHASED VEHICLE, TO REPAIR.  APPEARS, MANUFACTURER WILL HANDLE, HOWEVER, NOT CERTAIN.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "09/03/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524257,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA FORTE 2013 PURCHASED NEW AND HAD PROBLEMS WITH CAR WHEN DRIVING 55-70 MILES AT HIGHWAY SPEED. THE CAR SHAKES,TIRES MAKE NOISES LIKE THEY'RE FLAT,TROUBLE WITH STEERING,REALLY ROUGH RIDE,SMOKE CAME FROM ENGINE AND THE CAR HAS BEEN A PAIN CONSIDERING IT'S SUPPOSED TO BE NEW. IT ALSO LEAKS WHEN IT RAINS AND SOMETIMES YOU CAN'T SEE OUT REAR WINDOW. ALL THESE THINGS AND MORE WERE REPORTED TO KIA MOTORS WHO SENT ME TO DEALERSHIP. THE DEALERSHIP SCOFFED AT THE REFERRAL,STATED KIA MOTORS KNOWS ABOUT PROBLEMS AND ALLEGEDLY CHECKED FORTE REPORTING NOTHING CAN BE DONE AND NOTHING IS WRONG. THE CAR CONTINUES TO HAVE PROBLEMS AND IS A TOTAL WASTE OF MONEY PLUS FEELS UNSAFE. THERE SHOULD BE SOME ACCOUNTABILITY WITH KIA SOMEWHERE BUT THERE ISN'T...GUESS THAT'S THE BUSINESS CUSHION.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/12/2013",
        "dateOfIncident": "11/22/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519537,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY DRIVING @ 65 MPH WITH A CROSSWIND GUSTING TO 25 MPH. ACROSS FRONT RIGHT FENDER.  THE REAR OF THE CAR IS FAR TOO LIGHT TO HOLD IT TO THE ROAD STRAIGHT.  BROADSIDE WIND IS OF COURSE A LOT WORSE.  BEING PASSED BY A TRUCK YOU COULD ALMOST GET JERKED RIGHT UNDER IT.  THERE SHOULD AT LEAST BE A SMALL FIN ACROSS THE TRUNK TO CATCH AIR AND MAKE SOME DOWN FORCE, BECAUSE THE TRUNK AREA IS SO SHORT IT MAY NOT EVEN CATCH AIR IF WIND TUNNELED.  30 YEARS OF DRIVING AND BEING A RETIRED PROFESSIONAL DRIVER TELLS ME THIS IS THE MOST UNSAFE CAR I HAVE EVER OWNED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/02/2013",
        "dateOfIncident": "12/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510076,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 KIA FORTE.  CONSUMER WRITES IN REGARDS TO MAJOR ENGINE DEFECTS.  *SMD  THE CONSUMER STATED THREE WEEKS AFTER HER DAUGHTER PURCHASED THE VEHICLE, THE CHECK ENGINE LIGHT ILLUMINATED AND THE VEHICLE OVERHEATED. THE VEHICLE STARTED TO MALFUNCTION AND BECAME DIFFICULT TO CONTROL. SMOKE AND A VERY STRONG BURNING ODOR EMITTED FROM THE ENGINE. THE VEHICLE WAS TOWED TO THE DEALER FOR AN INSPECTION. THE RADIATOR WAS FOUND TO BE FAULTY. SINCE THE REPAIRS WERE MADE, THE VEHICLE WAS BURNING EXCESSIVE AMOUNT OF OIL, WHICH REQUIRED ADDING OIL TO KEEP IT AT FULL LEVEL. THE TAIL PIPE WAS DARK BLACK AND HEAVILY SOILED, WHICH INDICATED THE VEHICLE STILL HAD A SERIOUS PROBLEM. ONE MONTH LATER, THE CONSUMER EXPERIENCED DELAYED ACCELERATION",
        "vin": "KNAFU4A27D5"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/30/2013",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA FORTE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, THE CONTACT LOOKED THROUGH THE REAR VIEW MIRROR AND NOTICED THAT THE REAR WINDSHIELD GLASS PROJECTED AN UNUSUAL IMAGE WHICH DISTORTED HIS VIEW. THE FAILURE OCCURRED AT ANY SPEED BEING DRIVEN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO INFORMED THE CONTACT THAT THERE WAS NOT A PROBLEM. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 100.",
        "vin": "KNAFU4A22D5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2012",
        "dateOfIncident": "08/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475215,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "FORTE",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT VEHICLE START - GAUGES ON DASH DID NOT WORK AND SHIFT LOCK WAS ENGAGED. UNABLE TO SHIFT VIA SHIFT RELEASE. AFTER SEVERAL ATTEMPTS THE PROBLEM RESOLVED.   *TR  *JS",
        "vin": "KNAFW6A36D5"
    }
]