[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454697,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The air bag light has come on and as I understand I am no longer protected in case of an accident.i do not find a recall but there should be as I am seeing many complaints for the same issue",
        "vin": "Knadm4a35d6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454490,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine is knocking because of carbon build up caused by KIA installing faulty engines . Most all other models have been recalled already .",
        "vin": "KNADM4A32D6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/13/2022",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452431,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My car started burning while I was driving. Luckily, I stoped and we (me and my wife) ran away from it.",
        "vin": "KNADM5A32D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443018,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving the car and heard something explode/pop.  I was on the right lane and was able to pull over.  Smoke was coming out of the car and oil was dripping from the bottom.   The motor seems to have combusted and cracked.   A mixture of oil and water continue to drip from the bottom of the vehicle.",
        "vin": "KNADM5A35D6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432051,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased a very low miles (42K) Kia from the dealer as a 2nd owner. In less than 6 months the car has serious safety issues. The vehicle shuts off and stalls while idling at stop lights, stop signs or slow traffic with no warning. All other powered components like radio, lights etc remain on and functioning. The car is hard to start after the vehicle shuts off and has stalled and takes multiple tries to turn over. When accelerating the vehicle will randomly not respond at all to the gas pedal, will not increase speed, RPM will not move and the car will not respond. When the car does accelerate, it will sputter and rpm will increase dramatically. This is very dangerous to those driving and those on the road. If the vehicle does not respond to acceleration the risk to the driver and occupants is serious. There could be an accident from oncoming traffic both rear and from behind. There is great life threatening risk. Local mechanic stated the car throws no codes when diagnosed, and there is no check engine light on. Kia knows their vehicles have this issue and has recalled many other models in the same years. There are multiple identical NHTSA.GOV complaints noting identical vehicle problems. The problem is not able to be found with diagnostic. The KIA RIO should be recalled and repaired immediately. The car was sold with serious safety issues. There was a class action even that did not proceed that alleges the gamma engines cause sudden stalling, excessive oil consumption, engine failures and fires in the vehicles.",
        "vin": "knadm5a3xd6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426306,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was stolen due to defective alarm system . I feel every one should know that Kia doesn’t care enough to protect its customers with a full alarm system on the car . Thieves stole my and others cars by breaking the passenger window and climbing in and starting the car with a usb stick. What in the world is that ? Like how does your alarm not sound when a window is broken if the alarm is working A1",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413418,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HARDLY EVER INDICATED LOW OIL.  HAD TO ADD OIL CONSTANTLY BETWEEN OIL CHANGES. NO PROBLEMS UNTIL THE CAR GOT OVER 100K MILES. CHECK ENGINE LIGHT CAME ON WE CHECKED THE OIL IT WAS 2 QUARTS LOW. ADDED OIL ENGINE STARTED KNOCKING. MECHANIC SAID WE HAD TOO MUCH OIL. GOT AN ENGINE FLUSH AND ANOTHER OIL CHANGE ENGINE WAS STILL KNOCKING AND OIL WAS VERY DIRTY. MECHANIC INDICATED THIS IS A COMMON PROBLEM WITH MOST KIAS WITH THE GDI ENGINES. 2 WEEKS AFTER OIL CHANGE THE CAR STARTED SMOKING AND WAS ALMOST COMPLETELY OUT OF OIL. TOOK IT TO ANOTHER MECHANIC WHO SAID THE ENGINE SHOULD BE RECALLED AND HE DIDNT UNDERSTAND WHY IT WASNT. HE SAID MY ENGINE WAS DOING WHAT ALL THE OTHER ENGINES HAVE DONE ON THE OTHER MODELS RECALLED. I CALLED THE LOCAL KIA DEALERSHIP WHO TOLD ME THAT I HAVE HAD THE CAR SINCE 2014 AND IT WAS JUST OLD. THEY WONT BE RECALLING. I TOOK GOOD CARE OF THIS CAR HARDLY EVER WENT TOO FAR PAST AN OIL CHANGE THIS SHOULDN'T HAVE HAPPENED AND I HAD TO GET A NEW CAR.  THIS SHOULD BE RECALLED LIKE ALL THE OTHER KIAS IT'S UNFAIR THEY SELL CARS THAT BREAK ONCE YOU GO PAST 100K MILES.",
        "vin": "KNADN5A35D6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399928,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA RIO WILL STALL AT SLOW SPEEDS.  SEVERAL TIMES WHILE I WAS STOPPED OR BACKING UP AND THE CAR STALLS.  WHEN I WAS DRIVING IN A PARKING LOT MY CAR STALLED WHILE I WAS ACCELERATING.  I TOOK MY KIA TO A MECHANIC.  HE SAID THE PROBLEM WAS THE REAR FUEL FILTER.  HE REPLACED MY FUEL FILTER.  THIS DID NOT RESOLVE THE PROBLEM.  HE CALLED KIA THEY RECOMMENDED HE REPROGRAM THE CAR.  THIS DID NOT WORK.  HE CLEANED THE FUEL  FILTER PUT IT BACK IN THE CAR.  THIS DID NOT SOLVE THE PROBLEM.  HIS ONLY RECOMMENDATION. IS TO TAKE THE CAR TO KIA.  BUT IF THEY DON'T KNOW WHAT THE PROBLEM IS.  HOW CAN THEY FIX IT.  RIGHT KNOW I CAN ONLY HOPE THE DOESN'T STALL AND CAUSE AN ACCIDENT.",
        "vin": "KNADM4A32D6"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396175,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR USED IN NOVEMBER OF 2020 FROM A USED CAR LOT MADE NOTE OF AIRBAG LIGHT ON AND NO HORN THEY SAID THEY WILL SCAN IT AND THEY DID SAID IT WAS THE CLOCK SPRING AND THEY WERE GONNA ORDER ONE. NEVER GOT IT ABOUT A MONTH LATER CALLED LOCAL KIA DEALERSHIP THEY SAID MY CAR DOES NOT HAVE A RECALL FOR AIRBAGS AND DID NOT FIX IT WHEN I HAD THEM LOOK AT IT. VERY SERIOUS ISSUE AND CAN BE DEADLY AS I HAVE NO HORN OR AIRBAG TO PROTECT ME IF I GET INTO AN ACCIDENT.",
        "vin": "KNADN4A37D6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT IS ON. THE DEALERSHIP STATES THIS MEANS THE AIR BAG WILL NOT DEPLOY IN AN ACCIDENT. KIA HAS EXTENDED THE WARRANTY FOR THE CLOCK SPRING BUT THE DEALERSHIP REFUSES TO FIX BECAUSE IT HAS NOT BEEN RECALLED. THIS IS PLACING ME AND MY FAMILY IN DANGER OF BEING SERIOUSLY INJURED OR KILLED IF IN AN ACCIDENT",
        "vin": "KNADN4A35D6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372626,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT THE TIRE PRESSURE SENSOR, THE DRIVER SIDE WINDOW SWITCH, THE REAR PASSENGER DOOR LOCKS, AND THE CLOCK SPRING FAILED TO FUNCTION AS DESIGNED. THE CONTACT STATED THAT THE VEHICLE WAS WELL MAINTAINED. THE CONTACT TOOK THE VEHICLE TO DIFEO KIA (1320 OCEAN AVE, LAKEWOOD TOWNSHIP, NJ 08701; (833) 842-8290) WHERE THE MECHANIC REPLACED THE CLOCK SPRING AND THE DRIVER'S SIDE WINDOW SWITCH. THE TIRE PRESSURE SENSOR WAS REPAIRED BY A CERTIFIED MECHANIC AT THE TIRE SHOP. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 78,000.",
        "vin": "KNADM5A39D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SELF DESTROYING. CAR CYLINDER CAN GET IMPACTED TO THE CEILING. KNOCK SENSOR NOT WORKING CORRECTLY IT IS FUNCTIONING PROPERLY BUT NOT WORKING CORRECTLY, CAUSING AN ENGINE TO DETERIORATE AT A RAPID RATE NON-INTENDED USE, HAS SAME ENGINE AS OTHER KEY IS IN HYUNDAIS IN THIS ONE IS NOT ON THE RECALL AND IS HAVING THE SAME ISSUE SAME ISSUES AS THE RECALLS. KNOCK SENSOR CATASTROPHIC FAILURE. FOR THE DATE OF THE START OF THE ISSUE IT WAS WELL BEFORE THEN DON'T REMEMBER THE EXACT DATE. CAR WILL NOT DRIVE SMELLS LIKE THE ENGINES GOING TO CATCH ON FIRE",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348563,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION WITH NO OBVIOUS TAIL PIPE SMOKE. NOT LEAKING OIL.  PERHAPS A QUART OF OIL ADDED TO ENGINE EVERY 750 MILES. THIS ISSUE STARTED AROUND 115,000 MILES. NO LOW OIL PRESSURE INDICATER LIGHT ACTIVATED. I HAD TO REPLACE CATALYTIC CONVERTER DO TO OIL DEPOSITS.",
        "vin": "KNADN5A36D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343200,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN USING ALOT OF OIL LAST 12 MONTHS , OIL IS CONSTANTLY LOW EVERYTIME IT HAS BEEN CHECKED , SERVICED ,  MY DAUGHTER HAS HAD TO ADD OIL TO THE VEHICLE AND CHECKED FREQUENTLY ,  THE ENGINE LOCKED UP ON HER ON A MAJOR INTERSTATE COMING HOME FROM A TRIP .   2 HOLES IN THE MOTOR NOW,   ESTIMATE OF MOTOR REPLACEMENT FROM KIA 4,000 PLUS",
        "vin": "KNADN4A32D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/26/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341539,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ON DRIVERS SIDE FLASHES AND THEN STAYS ON WHILE DRIVING. UNDERSTAND KIA IS AWARE OF PROBLEM BUT HAS DONE NOTHING TO HELP CONSUMERS. THIS IS SEVERE SAFETY ISSUE AS AIR BAG WILL NOT DEPLOY IN CASE OF AN ACCIDENT.",
        "vin": "KNADM5A32D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341393,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR LIGHT RANDOMLY COMES ON AND OFF WHILE DRIVING AND FIRST STARING UP. NO ACCIDENTS TO CAUSE THIS. CAR HAS JUST OVER 65K. AFTER SEEING MANY COMPLAINTS ONLINE ABOUT THIS SAME ISSUE OF THE SENSORS RANDOMLY COMING ON AFTER 60K MILES OR SO, SEEMS THIS ISSUE NEEDS TO BE ADDRESSED. DOESN'T SEEM RIGHT THAT THIS IS A COMMON ISSUE WHEN A CAR HAS LOW MILEAGE. CODES PROVIDED WERE FRONT DRIVER AND PASSANGER SIDE IMPACT SENSORS. AGAIN, NO CRASH OR ACCIDENTS. CAR IS GENTLY DRIVEN.",
        "vin": "KNADN5A31D6"
    },
    {
        "components": "STEERING,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331106,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLOCK SPRING LIGHT CAME ON THE CAR IS NOW HAVING ISSUES WITH THE STEERING. I WAS TOLD BY KIA DEALERSHIP THAT THIS IS A KNOWN PROBLEM FOR MY CAR AND THAT IT NEEDS TO BE REPLACED DUE TO SAFETY OF DRIVING SINCE IT EFFECTS THE AIRBAG. IF IT GET STOPPED I CAN GET A TICKET FOR THE LIGHT BEING ON.  *TR",
        "vin": "KNADM4A35D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321345,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR CAME ON AND OFF FOR A WHILE AFTER WARRANTY ON THE BAG HAD JUST EXPIRED. I WAS TOLD BY THE DEALER WHO SOLD IT TO ME NEW THAT I HAD TO REPLACE THE ENTIRE BAG, WHICH I DID. THEN AFTER REPLACING, THEY SAID THE LIGHT WAS STILL ON AND HAD TO REPLACE SOME KIND OF PIN. BUT THEY SWORE THE BAG REALLY HAD TO BE REPLACED. DID I PAY $800 FOR A BAD PIN....MAYBE. OR, IS THERE A PATTERN OF AIRBAGS GOING OUT FOR NO REASON? THE BAG WAS NOT DEPLOYED IN MY PRESENCE, BUT AFTER THAT BEING THE FOURTH \"BAD PART\" GO OUT ON THIS CAR, I FEEL I SHOULD REPORT IT. BEFORE I GOT THE NEW BAG, THE LIGHT WOULD GO ON AND OFF WHEN I TURNED SHARP CORNERS. CAR WAS AT ABOUT 80,000 MILES WHEN THE LIGHT CAME ON. IT TOOK ME ABOUT SIX MONTHS AFTER THE LIGHT CAME ON BEFORE I COULD AFFORD TO REPLACE....THE CAR HAS HAD NUMEROUS FAULTY PARTS.",
        "vin": "KNADM5A35D6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300088,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF JANUARY 10TH AROUND 8AM I HAD TO TAKE MY PET TO THE VETERINARIAN. I PULLED INTO THE ENTRANCE AND WAS GOING TO PARK MY CAR IN FRONT OF THE BUILDING WHICH HAS PARKING SPACES RIGHT IN FRONT OF THE OFFICE. AS I WAS PULLING INTO A PARKING SPACE WITH MY FOOT ON THE BRAKE ALMOST AT A COMPLETE STOP WHEN THE CAR SUDDENLY ACCELERATED AT A HIGH RATE OF SPEED CAUSING ME TO CRASH INTO A BUILDING. IT HAPPENED IN A SPLIT SECOND AND NO TIME TO RESPOND. I NEVER HAVE EXPERIENCED SUCH POWER IN THIS CAR AS WHEN THIS HAPPENED. FOR WHATEVER REASON, THE VEHICLE   JUST SHOT OUT LIKE A BULLET. NO POLICE REPORT WAS FILED DUE TO NO ONE WAS HURT OR INVOLVED IN THE ACCIDENT.",
        "vin": "KNADM4A38D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282960,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT CAME ON MY 2013 KIA RIO LX SOMETIME SHORTLY AFTER THE MILEAGE HIT 80,000 MILES. IT WOULD GO ON AND THEN TURN OFF. IT DID THIS FOR A LITTLE WHILE BUT NOW IT STAYS ON ALL THE TIME. I CALLED KIA TO ASK IF THERE HAD BEEN ANY RECALLS ON THE AIR BAGS AND THEY TOLD ME NO. THEN I WAS TOLD THAT IT WOULD BE $350-$400 JUST TO CHECK IT OUT. I HAVE SEEN MANY REPORTS OF THIS BY OTHER KIA RIO OWNERS ON THIS WEBSITE. THIS HAS BECOME A COMMON PROBLEM AND THERE SHOULD BE A RECALL FOR THIS PROBLEM.",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270041,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING",
        "vin": "KNADM5A34D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257958,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR A 2013 WHY IS MY AIR BAG LIGHT ON? THE CAR BEEN SERVICE AT KIA CASEY DEALERSHIP, THE SERVICE INVOICE RECOMMENDED REPLACING THE AIR BAG CLOCKSPRING ALREADY THE CAR 6 YEARS OLD",
        "vin": "KNADM4A35D6"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "03/19/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256665,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE SHOOK AND THE CHECK ENGINE AND AIR BAG  WARNING INDICATORS ILLUMINATED. IN ADDITION, THE WINDOWS DID NOT ROLL DOWN AUTOMATICALLY. THE VEHICLE WAS TAKEN TO KIA OF LYNCHBURG (434-847-3292, LOCATED AT 3400 OLD FOREST RD, LYNCHBURG, VA 24501) WHERE THE TECHNICIAN CHANGED THE OIL AND REPLACED THE IGNITION SWITCH. THE CONTACT ALSO STATED THAT THE FUEL PUMP WAS REPLACED BY AN INDEPENDENT MECHANIC DUE TO AN UNKNOWN FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THERE WAS NO RECALL FOR THE FUEL PUMP. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "KNADM4A37D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256382,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RUNNING THE ENGINE BURNS THROUGH OIL VERY QUICKLY. ENGINE DOES NOT WARN THAT OIL IS LOW BUT BEGINS TO RUN 'ROUGHLY' WHEN OIL IS NEEDED.  I ADD OIL EVERY COUPLE OF WEEKS IN BETWEEN ACTUAL OIL CHANGES. I ONLY DISCOVERED THIS PROBLEM WHEN I TOOK THE CAR IN FOR MAINTENANCE AND MY MECHANIC TOLD ME THAT THERE WAS ZERO OIL IN IT AND HE WAS SURPRISED THAT THE ENGINE WAS EVEN RUNNING AT ALL.",
        "vin": "KNADM5A39D6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256019,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT THE HEADLIGHTS WILL GO OUT. THIS USUALLY HAPPENS WHEN I USE THE BLINKER, OR GO OVER A SAFETY SPEED BUMP, BUT THE HEADLIGHTS HAVE GONE OFF ON THEIR OWN TOO. I CONTACTED THE KIA DEALER BUT SINCE THERE'S NO RECALL ON THE RIO THEY WILL NOT FIX IT. THEY DID SAY THERE WAS A RECALL FOR THE SAME ISSUE ON ANOTHER TYPE OF KIA BUT NOT THE RIO.  THIS HAS BEEN HAPPENING SINCE I BOUGHT THE USED CAR IN 2016.  WHEN I REALIZED IT WAS HAPPENING THE WARRANTY HAD EXPIRED",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LATCHES HAVE ALL WORN OUT AND NEED TO BE REPLACED. WE RARELY USE THE BACK DOORS AS IT IS A CAR THAT IS DRIVEN TO WORK AND BACK AND THERE ARE NO SMALL CHILDREN REQUIRING FREQUENT USE. WHEN THE DOORS ARE OPENED AND THEN CLOSED THERE IS A RATTLE THAT CAN BE HEARD. I HAVE NEVER HEARD OF A PROBLEM SUCH AS THIS AND REPLACEMENT IS EXTREMELY EXPENSIVE.",
        "vin": "KNADN4A31D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241856,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING TO LAUNDRYMAT MY ENGINE STARTS MAKING NOISE AND THEN THE CHECK ENGINE CAME ON, ALL THE OIL HAD BURNED OUT OF CAR, THE CAR STALLED AND I WAS STRANDED.  THERE WASNT ANY OIL OR ENGINE WARNING SIGNS AT ALL B4 THIS HAPPENED, IM HEARTBROKEN AND STILL HAVE 2 YEARS TO PAY, THIS ENGINE IS FAULTY!  MY AUNTY WHO IS A POLICE OFFICER OWNS A 2014 KIA AND SAME HAPPENED TO HERS!  PLEASE TAKE ACTION AGAIST KIA TO CORRECT THIS MODEL ALSO, THE 201E KIA RIO",
        "vin": "KNADM4A32D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233960,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT RANDOMLY CAME ON. IT WILL PERIODICALLY COME OFF, BUT IT ALWAYS COMES BACK ON. THIS IS NOT ONLY EXTREMELY FRUSTRATING, BUT ALSO EXTREMELY DANGEROUS. IT IS A SHAME THAT KIA IS YET TO ADDRESS THIS ISSUE. I HAVE TAKEN MY CAR TO SEVERAL MECHANICS AND NONE OF THEM CAN FIGURE OUT WHAT THE ISSUE IS.",
        "vin": "KNADM5A35D6"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229499,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE OF DAYS AGO, AIR-BAG WARNING LIGHT BECAME ON DURING DRIVING. I TRIED TO DISCONNECT THE BATTERY BUT IT WON'T GO AWAY. NOTHING HAPPENED SO FAR. NO ACCIDENT, NO DAMAGE, AND ETC.",
        "vin": "KNADM4A38D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/09/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218750,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS CONTINUOUSLY TURNING ON AND OFF AS I AM DRIVING.",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203265,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT RANDOMLY STARTED COMING ON AND THEN TURNING OFF WHILE DRIVING. NOW IT STAYS ON FOR LONG PERIODS OF TIME. NO ACCIDENTS OR REASON FOR THIS TO HAPPEN. MECHANIC SAYS IT WILL COST A LOT TO TRY TO FIGURE OUT WHAT WRONG AND KIA SHOULD RECALL AS THIS IS AN ISSUE WITH THE CAR. I AM CONCERNED THAT IF THERE EVER IS AN ACCIDENT THE AIRBAG WON'T WORK, AND THAT IS EXTREMELY DANGEROUS.",
        "vin": "KNADM4A3XD6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197243,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT STARTED OUT BY IT WOULD FLASH ON EVERY SO OFFTEN THEN IT WOULD COME ON AND GO OFF WHEN ID TURN MY CAR. THEN IT CAME ON AND STAYED FOR A COUPLE DAYS NOW IT JUST STAYS ON . I WAS TOLD THE IT WOULD COST ME ALOT TO JUST HAVE THE SYSTEM CHECKED OUT BY KIA . AND THAT IF IM TO EVER HAVE A ACCIDENT MY AIRBAGS WONT WORK. I FEEL THAT KIA IS AT FAULT AND MY CAR SHOULD BE RECALLED.",
        "vin": "KNADM5A37D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193122,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING AT A RED LIGHT IN CITY TRAFFIC, PRESSED THE GAS TO GO WHEN GREEN LIGHT OCCURRED AND CAR STALLED. LIGHTS, POWER WINDOWS, RADIO ALL STILL WORKED, BUT THE ENGINE WAS DEAD. LET CAR SIT FOR 30 MINUTES, IT STARTED UP COMPLETELY FINE. CAR STALLED AGAIN AT RED LIGHT WHILE AT IDLE IN CITY TRAFFIC. LET CAR SIT FOR A FEW MOMENTS, STARTED IT UP AND DROVE HOME WITHOUT INCIDENT. NO CHECK ENGINE LIGHT, NO BATTERY LIGHT, NO LOW OIL LIGHT. TOOK CAR TO NEIGHBORHOOD MECHANIC, WAS TOLD NOTHING WAS WRONG. BATTERY AND ALTERNATOR WERE IN GREAT WORKING ORDER, GROUND CONNECTIONS WERE FINE. THEY TOOK CAR ON 20 MILE RIDE WITH NO STALLING. TOOK CAR TO DEALERSHIP, THEY HAVE NO IDEA WHAT IS WRONG EITHER. TOLD ME TO COME BACK WHEN I HAVE A CHECK ENGINE LIGHT, OTHER THAN THAT, THEY CAN NOT HELP ME. CAR CONTINUES TO STALL WHILE IDLE WITH NO CHECK ENGINE LIGHT.",
        "vin": "KNADM5A33D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183269,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ONLY 70000 MILES I WAS TOLD THE ENGINE HAS SLUDGE BUILD UP AND NEEDS TO BE REPLACED AND IS UNSAFE TO DRIVE.  THE CAR WAS ALWAYS MAINTAINED AT THE DEALERSHIP AND THE OIL WAS CHANGED ON A REGULAR, TIMELY BASIS THROUGH THE DEALER.  THE DEALER RECORDS WERE SENT TO KIA WHO WOULD NOT GAURANTEE TO COVER THE REPLACEMENT OF THE ENGINE, THEY MAY OR MAY NOT COVER IT.  IF ITS NOT COVERED I AM ON THE HOOK.  I WAS TOLD BY DEALER THAT THE OIL HAD METAL SHAVINGS IN THE OIL, THIS WAS ALSO SENT TO KIA BY THE DEALER.  I WAS TOLD KIA NEEDED A PICTURE THAT ONLY COULD BE OBTAINED BY TEARING DOWN THE ENGINE AND THAT ONCE THIS HAPPENED THE ENGINE COULDN'T BE PUT BACK TOGETHER.  AT THIS POINT I WAS COMMITTED TO A NEW ENGINE, EITHER  KIA WOULD PAY OR I WOULD.  AT THIS TIME I HAVE NOT DONE ANYTHING.  I KNOW KIA HAS THIS ISSUE WITH OTHER KIA MODELS.  THE VEHICLE WAS TAKEN IN IMMEDATELY WHEN A CHECK ENGINE LIGHT CAME ON,",
        "vin": "KNADM5A35D6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2019",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182194,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS FLICKER ON AND OFF AND THEN STAYS OFF. FORCING ME TO TURN OFF AND BACK ON THE LIGHTS MANUALLY WITH THE SWITCH TO GET THEM TO COME BACK ON THEN REPEAT.. THEY TURN OF AND I STRUGGLE TO KEEP THEM ON AND I TRAVEL FOR WORK AND ALLOT OF NIGHT TIME DRIVING. VERY FRUSTRATING AND OTHER DRIVERS THINK I'M FLASHING THEM. VERY UNSAFE AND KIA DEALERSHIP WOULD NOT FIX IT UNLESS I PAY THEM TO FIX IT. MY CAR HAS 23,000 MILES AT THE MOMENT PROBLEM STARTED LAST YEAR AROUND 12,000 MILES BUT AGE IS PAST FACTORY WARRANTY. IT DOES NOT MATTER IF I'M DRIVING OR IT'S PARKED LIGHTS/WIRING HAS A PROBLEM. THIS IS A VERY SERIOUS SAFETY ISSUE THAT KIA REFUSES TO FIX.",
        "vin": "KNADN4A37D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173063,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BURNS THROUGH OIL. NO LEAKS, JUST BURNS OIL. WHEN OIL IS EMPTY, NO CHECK OIL LIGHT COMES ON. MUST ADD OIL CONSTANTLY. MY MECHANIC SAID I HAD 'NO OIL' IN MY ENGINE DURING MY LAST CHECK. HE FILLED IT UP AND THEN I DECIDED TO CHECK IT MYSELF A COUPLE OF MONTHS LATER AND THE SAME THING IS HAPPENING.",
        "vin": "KNADM5A39D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171358,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I ONLY DRIVE MY CAR TO WORK AND BACK, IT HAD NEVER BEEN IN ANY KIND OF ACCIDENT. THE OTHER DAY I DRIVE TO WORK, WORK MY 8 HOURS THEN GET IN MY CAR TO DRIVE HOME AND THE AIR BAG DASH LIGHT COMES ON, THE LIGHT WOULD COME ON AND OFF FOR A COUPLE DAYS, NOW IT JUST STAYS ON. I DID SOME RESEARCH AND FOUND THAT MANY MANY PEOPLE ARE HAVING THE SAME ISSUE WITH THIS CAR, SUPPOSEDLY THIS HAPPENS ONCE YOU GET IN THE 80+ THOUSAND MILE MARK. I CHECKED UNDER MY SEATS FOR LOOSE CONNECTION AND FOUND NOTHING. I ALSO LOOKED AT HOW MUCH THE DEALER CHARGES AND ITS ASTRONOMICAL. IT BEING A SAFETY ISSUE I THINK THIS SHOULD BE CONSIDERED AS A RECALL.",
        "vin": "KNADN4A34D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151826,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLES UPON ACCELERATION, BURNING EXCESSIVE OIL.  NO OIL LEAKS. INDICATOR LIGHT DOES NO COME ON UNTIL THE OIL IS ALMOST COMPLETELY GONE AND RATTLING UPON ACCELERATION IS THE WARNING!!!",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142881,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY THE ELECTRONICALLY CONTROLLED POWER STEERING QUIT WORKING MAKING IT VERY HARD TO STEER THE CAR AND COULD HAVE CAUSED A SERIOUS ACCIDENT.",
        "vin": "KNADM5A33D6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132349,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 KIA RIO SX RED, MANUAL 6-SPEED. I HAVE BEEN HAVING ISSUES WITH MY VEHICLE ROLLING BACK WITH PARKING BREAK FULLY ENGAGED. VEHICLE ROLLS BACK ON SURFACES WITH NOT MUCH OF AN INCLINE AT ALL. NO INCIDENTS OR ACCIDENTS REPORTED. VEHICLE WAS STATIONARY, TURNED OFF, GEAR IN NEUTRAL (HOWEVER I HAVE BEEN LATELY LEAVING IT IN 1ST GEAR IF FEAR IS TO ROLL BACK), PARKING BREAK FULLY ENGAGED. HAS HAPPENED ON MULTIPLE OCCASIONS.",
        "vin": "KNADN5A35D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132215,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT CAME ON THEN WENT OFF, IT STAYS ON NOW. KIA TELLS ME THE CLOCK SPRING SHORTED OUT. NO IDEA WHY! THEY TELL ME I NEED A NEW AIRBAG AND CLOCK SPRING. DRIVERS SIDE. THE CODE IS B134600. THE PRICE $1037.47 + TAX !! THAT'S 2 HOURS LABOR. THEY TOLD ME IT WON'T PASS INSPECTION WITHOUT BEING FIXED. HELP-NOT SURE WHAT TO DO. I WAS DRIVING WHEN THE LIGHT CAME ON.",
        "vin": "KNADM4A35D6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2018",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120844,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "8-12-18:  CAR STARTED TO SPUTTER WHILE DRIVING ON FREEWAY OR SURFACE STREETS. RESTARTING WAS SPORADIC. CHECK ENGINE LIGHT CAME ON.   ENGINE DIAGNOSED AS NEEDING A CRANKSHAFT POSITIONING SENSOR. PART APPROX $90. LABOR $100. CAR RUNS FINE NOW. JUST WANTED TO GET THIS OUT AND SEE IF ANYONE ELSE HAS EXPERIENCED THAT SAME.",
        "vin": "KNADM5A31D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "06/12/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113386,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 06/12/2018, MY 2013 KIA RIO HAD A FIRE IN THE ENGINE COMPARTMENT THAT TOTALED THE VEHICLE. THE FIRE WAS NOT THE RESULT OF AN ACCIDENT OR RECENT MAINTENANCE. THE CAR SIMPLY BURST INTO FLAMES IN THE ENGINE COMPARTMENT WHILE DRIVING.",
        "vin": "KNADM4A32D6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "06/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103704,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLING CAN BE HEARD FROM UNDER THE HOOD INSIDE THE CABIN",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102630,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RESEARCH I WAS ABLE TO FIND OUT THAT THE KIA RIO HAS THE SAME ENGINE USED IN THE KIA OPTIMA WHICH HAS BEEN RECALLED.  JUST RECENTLY METAL SHAVINGS WERE FOUND MY KIA RIO  WHY ARE NOT ALL CARS WITH THE SAME ENGINE BEING RECALLED?",
        "vin": "KNADM4A35D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101524,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   THE AIR BAGS ARE NOT WORKING PROPERLY THE LIGHT COMES ON SAYING THEY'RE NOT WORKING AND THAT THEY WON'T GO OFF IN A CRASH IT HAPPENS EVERY TIME I TURN MY CAR ON",
        "vin": "KNADN4A30D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099943,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY DOG TO A VET APPOINTMENT. I HEARD A NOISE THAT SOUNDED LIKE I HIT A POT WHOLE BUT I LOOKED AND THERE WAS NO WHOLE AND THE CAR WAS STILL DRIVING LIKE NORMAL SO I CONTINUED ON MY WAY. THERE WAS A DETOUR FOR ROAD CONSTRUCTION I ENDED UP HAVING TO PULL OVER BECAUSE I DID NOT KNOW WHERE I WAS. THE CAR  DIED  SEEMED TO BE BECAUSE OF THE BATTERY LOSS POWER SO I LET THE CAR REST AND WALKED MY DOG .THEN GOT BACK IN MY CAR IT STARTED BACK UP AND TURNED AROUND ON THE HIGHWAY. THEN MINUTES AFTER GOING MY CAR LOST POWER AND THE SPEED REDUCED TO 40 MILES PER HOUR WHEN I HAD BEEN DRIVING 65 MPH. ALL THE WARNING LIGHTS CAME ON  AND IT MADE A NOISE FROM UNDER THE CARRIAGE /BODY OF THE CAR.THIS ALL HAPPEN AT THE SAME TIME. I WAS ABLE TO COAST INTO A GAS STATION/ CONVENIENCE STORE. I LIVE IN ALABAMA AND IT WAS LIKE 90 DEGREES THAT DAY. I TRIED TO RESTART THE CAR WHEN SOMEONE TRIED TO HELP ME AND IT THREW METAL FROM UNDER THE BODY AT US. LATER FOUND OUT IT THREW A ROD .I AM UNDER 100,000 MILES AND WAY UNDER 10 YEARS ON THE WARRANTY AND HAVE BEEN INFORMED BY A MECHANIC THAT IT THREW A ROD AND THERE IS NO WAY TO TELL WHAT CAUSED IT.THE ROD WENT THREW THE OIL PAN. I WAS LUCKY THERE WAS NO TRAFFIC AT THE TIME THIS ALL HAPPENED. KIA TRIED TO TELL ME IT HAD TO BE A RECALL TO BE COVERED UNTIL I WENT TO THERE OFFICE AND CONFRONTED THE WOMAN WHOM HAD SAID THAT TO ME. WHEN I TOLD HER I DID NOT HAVE ALL MY PAPER WORK /RECORDS ON THE MAINTENANCE SHE SAID THEY WOULD HAVE TO CHARGE ME TO LOOK AT IT TO DETERMINED WHAT CAUSED THE ENGINE TO THROW A ROD. I THEN TALKED TO A FRIEND OF A FRIEND THAT WORKS AT KIA FOR HELP AND I AM STILL WAITING FOR HIS REPLY IF THEY WILL HELP ME OR NOT.MY CAR IS 2013 KIA RIO .MY HUSBAND HAD GONE TO CULLMAN AL. WHICH IS ABOUT 3 HOURS FROM US THE WEEKEND BEFORE THIS HAPPENED AND HAD CHECKED THE OIL AND ADDED WHAT WAS NEEDED THEN .",
        "vin": "D6295804"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11098951,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A FULL SIDE IMPACT COLLISION THE SIDE AIRBAGS DID NOT DEPLOY. I WAS TRAVELING 45 MPH AND THE VEHICLE THAT HIT THE DRIVER SIDE CENTER GOING 30 MPH. I WAS TRAVELING NORTH BOUND ON SAVANNAH HIGHWAY NEAR CALIBER COLLISION.",
        "vin": "KNADN4A3XD6"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. EVER SINCE THE VEHICLE WAS PURCHASED, THE SERVICE ENGINE INDICATOR ILLUMINATED AND THE VEHICLE FAILED TO ACCELERATE SUDDENLY DUE TO AN INTERNAL ENGINE FAILURE. THE DEALER (BOB BELL KIA OF BALTIMORE, 7900 EASTERN AVE #1, BALTIMORE, MD 21224, (410) 288-2500) INITIALLY DIAGNOSED THAT THERE WAS A WRENCH UNDER THE HOOD, BUT HAD BEEN THE ONLY REPAIR FACILITY SERVICING A VEHICLE, THE SECOND TIME, THE THROTTLE BODY WAS REPLACED. DURING THE THIRD REPAIR, THE ENGINE ASSEMBLY WAS REPLACED, BUT THE VEHICLE FAILED TO ACCELERATE OVER 20 MPH. ALSO, THE SERVICE ENGINE INDICATOR REMAINED ILLUMINATED WITHIN LESS THAN 30 DAYS OF THE THIRD REPAIR FROM THE DEALER WITH NO REMEDY. THE VEHICLE WAS TAKEN TO AN INSPECTION STATION WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS DUE TO A SENSOR RELATED TO THE THROTTLE. THE MANUFACTURER ISSUED 15 TSBS ON THE ENGINE, BUT THERE WAS NO RECALL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 6.",
        "vin": "KNADN4A37D6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2017",
        "dateOfIncident": "10/24/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040984,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME WORK ON THE FREEWAY AND HAD ONLY BEEN ON THE ROAD FOR 15 MINUTES. IT WAS RUSH HOUR TRAFFIC AND HAD MY WINDOW DOWN WHEN I NOTICED AND ELECTRICAL BURNING SMELL. I THOUGHT IT MIGHT BE FROM FROM SOMETHING OUTSIDE AND KEPT DRIVING. THE SMELL GOT STRONGER AND STRONGER. AFTER JUST A COUPLE MINUTES OF FURTHER DRIVING SMOKE STARTED POURING IN FROM MY DEFROST VENTS. I GOT THE VEHICLE TO THE SIDE OF THE ROAD AND JUST AS I GOT OUT FLAMES WERE COMING FROM UNDER THE HOOD OF THE CAR AND IT WAS TOTALLY ENGULFED IN SECONDS. THE CAUSE OF YET UNKNOWN AND UNDER INVESTIGATION FROM MY INSURANCE COMPANY. THE VEHICLE HAS NEVER NEEDED ANY WORK DONE TO IT AND JUST PASSED THE MARYLAND STATE INSPECTION FOR REGISTRATION 6 WEEKS PRIOR TO THIS HAPPENING.",
        "vin": "KNADM4A36D6"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2017",
        "dateOfIncident": "08/22/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11030684,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 22 2017 8:45 PM WHILE I WAS DRIVING DOWN A CITY STREET MY DRIVER SIDE AIR BAG DEPLOYED,  FOR NO REASON CAUSING ME TO LOSE CONTROL OF THE VEHICLE AND RUN OVER A MEDIAN IN THE ROAD.  I PROCEEDED TO PULL INTO A PARKING LOT TO AVOID ANY FURTHER INCIDENT AND INSPECT ANY DAMAGE   TO MY CAR.  WITH THE CAR STILL RUNNING, I WALKED THE PERIMETER OF THE VEHICLE TO SEE IF THERE WAS ANY DAMAGE TO THE VEHICLE, WITH NO BODILY DAMAGE VISIBLE I DECIDED TO DRIVE IT HOME.  THE NEXT MORNING, I WENT TO CHECK ON MY KIA RIO AND FOUND TRANSMISSION FLUID ALL OVER THE GROUND.  I CALLED MY INSURANCE AND REPORTED WHAT HAD HAPPENED. THEY SAID I SHOULD CONTACT KIA CORPORATION  AND REPORT THE AIR BAG FAILURE I DID AS REQUESTED. THEN HURRICANE HARVEY HIT THE AREA AND DELAYED ANY ACTIONS TAKEN.  AFTER ABOUT A WEEK KIA TOWED THE CAR TO THEIR LOT FOR INSPECTION.  KIA ASKED WHAT I WANTED, I REPLIED REPAIR OR REPLACE MY DEFECTIVE VEHICLE.  THEY WROTE A REPAIR COST ESTIMATED AT $9200.00 AND SAID THAT THE AIR BAG WAS NOT A RECALL ITEM AND DENIED MY CLAIM AFTER ANOTHER WEEK PASSED.  I HAD TO FILE THE CLAIM ON MY INSURANCE AT THAT TIME AND SEND IT TO ANOTHER SHOP FOR INSPECTION.  ANOTHER WEEK PASSED BEFORE MY INSURANCE FILED IT A TOTAL LOSS.  AFTER ALL THIS LOST TIME FROM WORK AND RENTAL COST EXPENSES THAT HAVE YET TO BE REIMBURSED.  THEN HAVING TO GO FIND A CAR THAT I FEEL WOULD BE TRUSTWORTHY AND DEPENDABLE AFTER THESE SET OF CIRCUMSTANCES HAS PROVED TO BE DIFFICULT.  REFINANCING ANOTHER CAR INSURING IT.  I DON'T FEEL KIA CORPORATION HELD UP THEIR RESPONSIBILITY OR LIABILITY IN THIS SITUATION.  AFTER FURTHER RESEARCH ON THE INTERNET I DISCOVERED THAT KIA HAD MANY AIRBAG RECALLS IN  PREVIOUS YEARS, AND AIRBAG FAILURES IN OTHER KIA AUTOMOBILES ACROSS MULTI-YEAR MODELS.",
        "vin": "KNADN4A3XD6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/11/2017",
        "dateOfIncident": "06/08/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994343,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED KIA WITH 90,000 MILES ON IT AND WITHIN 2 WEEKS WE WERE HAVING PROBLEMS WITH ACCELERATION AND POWER. IT HESITATES UPON ACCELERATION AND LUNGES FORWARD SUDDENLY. IT LOSES SPEED AN POWER ON THE INTERSTATE IN SECONDS. IT ISN'T UNCOMMON TO GO FROM 70 TO 30 UNEXPECTEDLY FOR NO REASON. AFTER THOUSANDS OF DOLLARS OF REPAIR INCLUDING MAF SENSOR, ALL O2 SENSORS, AND A NEW CATALYTIC CONVERTER THE PROBLEM REMAINS. IT IS NOT SAFE TO DRIVE A CAR THAT LUNGES AND THEN LOSES POWER UNEXPECTEDLY.  A CAR LIKE THIS COULD KILL SOMEBODY. THE MANUFACTURER SAYS THERE ARE NO RECALLS. I HAVE HAD THE CAR IN THE SHOP ALMOST EVERY 2 WEEKS SINCE I BOUGHT IT 11 MONTHS AGO. AND IT WAS PARKED FOR ALMOST 3 MONTHS UNTIL I COULD GET IT REPAIRED THE LAST TIME.",
        "vin": "KNADM5A37D6"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "05/25/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993295,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED WHEN THE VEHICLE WAS STARTED. THE VEHICLE WAS TAKEN TO THE DEALER (DCH KIA IN TEMECULA, CALIFORNIA) WHERE IT WAS DIAGNOSED THAT THE COIL IN THE STEERING WHEEL NEEDED TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE FAILURE WAS NOT COVERED BY THE WARRANTY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE RECURRED AND WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/20/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991038,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT 70MPH WITH ONE OTHER PERSON IN THE VEHICLE, WHEN THERE WAS A COMBINATION OF WHIRRING, CLICKING, AND BANGING SOUNDS FROM THE ENGINE. AS WE PULLED OFF ON THE EXIT IT SOUNDED AS IF PARTS WERE FALLING OUT FROM UNDER THE CAR, BUT WHEN WE LOOKED IN THE REAR VIEW MIRROR THERE WAS NO DEBRIS ON THE ROAD. WHEN WE PULLED INTO THE REST AREA AND PARKED THE CAR TO CHECK IT OUT AND BEGIN THE PROCESS OF GETTING A TOW TRUCK BEFORE THE CAR HAD US STRANDED AND BROKE DOWN, SMOKE BEGAN OMITTING FROM THE HOOD AND IT GOT THICKER AND FLAMES BEGAN COMING OUT FROM UNDER THE HOOD MAINLY ON THE LEFT SIDE OF THE CAR UNTIL IT HAD SPREAD TO BOTH SIDES AND BEGAN TRAVELING INTO THE CABIN OF THE CAR. CAR WAS IN GOOD SHAPE, WITH ONLY A NEED FOR AN OIL CHANGE WHEN THE PROBLEM AND FIRE BEGAN. FIRE CREWS ARRIVED AND PUT OUT THE FIRE. ENGINE LIGHT DID TURN ON AND AND START BLINKING AS WE GOT ON THE EXIT RAMP. CAR WAS TURNED OFF AT THE TIME THE SMOKE AND FIRE BEGAN. MOST OF THE DAMAGE SUSTAINED WAS ON THE DRIVES SIDE OF THE CABIN AND ALL OF THE FRONT OF THE CAR AND ENGINE AREA. WHILE WE UNDERSTAND THIS COULD BE SOMETHING UNRELATED TO A MANUFACTURER DEFAULT, WE WANT TO BE SURE THAT WE TAKE THE CORRECT STEPS SINCE A CAR THAT WAS ONLY 3 YEARS OLD DID BURST INTO FLAMES.",
        "vin": "KNADN4A37D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969681,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER FOR DIAGNOSTIC TESTING, WHICH PRODUCED A FAILURE CODE AT THE AIR BAG SENSOR LOCATED IN THE STEERING WHEEL AREA. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 72,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "02/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958632,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR NEW 13JUL2012, AND HAVE HAD NO SERIOUS PROBLEMS.  ABOUT ONE MONTH AGO THE MILEAGE REACHED 60,000 WHICH ENDED THE BUMPER TO BUMPER WARRANTY.  ABOUT TWO WEEKS AGO AT MILEAGE OF ABOUT 60,600 WHILE DRIVING THE AIR BAG LIGHT CAME ON, THEN A FEW MOMENTS LATER IT WENT OFF, THEN ON AGAIN AND OFF AGAIN, AND ETC.  I EMAILED MY KIA DEALER ABOUT THE PROBLEM, AND THEY REPLIED THAT SINCE THE BTOB WARRANTY HAD EXPIRED I WOULD BE COMPLETELY RESPONSIBLE FOR THE COSTS OF CORRECTING THE PROBLEM.  THIS SEEMS VERY UNFAIR TO ME AS THE CAR JUST EXCEEDED THE 60,000 WARRANTY MILEAGE BY ABOUT 1% (600 MILES).  AT A MAXIMUM CHARGING ME 1% OF THE TOTAL REPAIR COSTS SEEMS FAIR.",
        "vin": "KNADN5A38D6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2016",
        "dateOfIncident": "09/16/2016",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907339,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT A 2013 RIO WITH 28,000 MILES ON IT ON 9/2/16. THE CAR SAT IN OUR DRIVEWAY ALL LAST WEEK BECAUSE WE WERE ON VACATION, SO WE MAYBE PUT 100 MILES ON IT AND DROVE IT 4 TIMES.     DROVE 20 MINUTES ROUND TRIP TO THE POST OFFICE YESTERDAY, PARKED IN DRIVEWAY AND WENT BACK INTO HOUSE TO WORK.     WIFE CAME HOME FROM WORK ABOUT 10 MINUTES LATER AND CAME RUNNING IN THE HOUSE SAYING THE NEW CAR IS ON FIRE.    CALLED 911 AND BEFORE FIRE DEPARTMENT WAS ABLE TO GET THERE, THE FLAMES WERE AS HIGH AS OUR SECOND FLOOR WINDOWS.   CAR WAS PARKED ABOUT 10-15 FEET AWAY FROM HOUSE, BUT THE HEAT DAMAGED PART OF OUR HOUSE AS WELL.    I HAVE CONTACTED INSURANCE, BUT I REALLY FEEL THIS IS A KIA ISSUE / PROBLEM, AND WE REALLY SHOULD NOT HAVE TO USE INSURANCE TO REPLACE THE CAR.  THIS CAR IS STILL UNDER MANUFACTURE WARRANTY, AND THEY NEED TO BE HELD ACCOUNTABLE.      THEN LAST NIGHT AFTER THE TOW COMPANY CAME, WE STARTED RESEARCHING THIS AND HAVE FOUND MANY, MANY 2012-2014 KIA'S DOING THIS. I LOGGED A COMPLAINT ON YOUR KIA'S WEBSITE, BUT HAVE NOT GOT A RESPONSE BACK YET, AND YES, I FEEL I SHOULD GET A RESPONSE OVER THE WEEKEND. OUR CAR BURST INTO FLAMES, DAMAGED PART OF OUR HOUSE FROM THE HEAT, AND IT COULD OF BEEN MUCH WORSE, ESPECIALLY IF I PARKED THE CAR IN THE GARAGE YESTERDAY. WOULD REALLY LIKE TO HEAR FROM KIA, OR OTHER OWNERS THAT HAVE HAD THIS PROBLEM.    IT SEEMS THAT WITH ALL OF THE GOOGLE HITS ABOUT KIA'S CATCHING FIRE, THERE SHOULD HAVE BEEN A RECALL ON ANY OF THE MODELS THAT HAVE HAD THIS PROBLEM, AND GET THEM EITHER FIXED, OR OFF OF THE ROAD, AT KIA'S EXPENSE.",
        "vin": "KNADN5A31D6"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2016",
        "dateOfIncident": "05/21/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895779,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON2 OCCASIONS I  REQUESTED MY SERVICE DEPARTMENT LOOK AT THE RADIO WHEN THE CAR WAS TAKEN IN FOR THE SECOND CHECK.   BOTH TIMES THE SERVICE DEPARTMENT  STATED HE HAD FORGOTTEN BUT SURE IT WAS NOTHING TO WORRY ABOUT NEWER CARS ARE SENSITIVE A PUMP IN THE ROAD CAN MAKE THE RADIO JUMP SECOND TIME THE TIRE PRESSURE AS WELL AS THE RADIO JUMPING I WAS TOLD THE SAME NOTHING TO WORRY ABOUT THEY WILL BE SURE TO CHECK IT ON THE NEXT VISIT. APRIL 2015 I HIT A POT HOLE THE  CLUTCH HIT THE FLOOR. I IMMEDIATELY PULL INTO A GAS STATION TO ADD FLUID TO THE CHAMBER. THE CHAMBER WAS FULL. I PUMPED THE CLUTCH IT CAME TO THE TOP LIKE IT IS SUPPOSE TO I DROVE HOME CAUTIOUSLY. THE NEXT DAY WENT TO LEAVE CLUTCH ON THE FLOOR. I HAD THE CAR TOWED IN. I THEN CALLED MY INSURANCE COMPANY&MADE A CLAIM. THEN I CALLED THE SERVICE DEPARTMENT. I WAS TOLD IT WOULD BE DAYS BEFORE MY CAR WOULD BE LOOKED AT. THE WEEKEND CAME& WENT BY TUESDAY THEY HAD GOOD NEWS & BAD! ONE WAS COVERED THE OTHER NOT! HOW MUCH? $1,200 . THEY EXPLAIN I NEEDED A CLUTCH & A SLAVE CYLINDER. I AGUED I HAVE DRIVEN STICK ALL MY LIFE AND AT 14000 NO WAY. THEY ARGUED WITH ME FOR A FEW MINUTES. I THEN TOLD THEM I'D SEND IN MY OWN SPECIALIST BECAUSE THERE WAS NO WAY. LOOK AT IT AGAIN CALL ME WHEN YOU HAVE THE REAL ISSUE. ONE DAY LATER THEY CALL COME GET YOUR CAR! WHAT YESTERDAY IT NEEDS $1,200 IN DAMAGES NOW IT IS A MIRACLE IT NEEDS NOTHING? THEY REPLIED COME PICK UP YOUR CAR. I NEED TO CALL MY INSURANCE. THEY REPLIED YOU REPORTED IT TO YOUR INSURANCE? I HIT A POTHOLE. MY INSURANCE  WENT OUT & FOUND NO ISSUE DUE TO THE PIT HOLE BUT LATER I FOUND OUT THEY DID SEE OR FOUND OUT IT HAD MECHANICAL ISSUE. I A HAD PICKED UP MY CAR. 3 WEEKS LATER DRIVING 75 MILES PER HOUR IN MODERATE RAIN FAST LANE. THE SMELL OF WIRES BURNING, CLUTCH ON FLOOR, NO GEARS, STEERING LIKE NO POER STEERING HARD,TIGHT 7 LIIGHT'S.IN SORT THEY LEINED MY CAR.",
        "vin": "KNADM4A3XD6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2016",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876772,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 40K MILES THE VEHICLE DEVELOPED AN ANNOYING PING & POWER LOSS, (DEAD SPOT), WHEN ACCELERATING UP A HILL OR INTO A CORNER. DEALER 1ST TOLD ME THAT AFTER AN EXTENSIVE TEST DRIVE NO TROUBLE WAS FOUND, HOWEVER THE MILEAGE WAS EXACTLY THE SAME AS WHEN I BROUGHT CAR INTO SHOP, OBVIOUSLY TEST DRIVE WAS NOT PERFORMED, HAD THE MECHANIC COME FOR A RIDE WITH ME, NOISE WAS APPARENT IMMEDIATELY ALTHOUGH MECHANIC DID HIS BEST NOT TO ACKNOWLEDGE IT UNTIL I TOOK A TURN ONTO A STEEP INCLINE WHERE NOISE BECAME QUITE PREVALENT & MECHANIC DID ACKNOWLEDGE IT & STATED THAT IT WAS THE GDI PUMP WHICH WE THEN SCHEDULED TO HAVE REPLACED. SHORTLY BEFORE MY SCHEDULED REPLACEMENT THE DEALERSHIP CHANGED THEIR MIND & NOW SAID THAT THE PROBLEM WAS RELATED TO A CARBON BUILD UP & SUGGESTED THAT I USE TOP TIER GAS & A FUEL ADDITIVE @ 7,500 MILE INTERVALS, (TECHRON WAS RECOMMENDED), HOWEVER I'VE ALWAYS USED TOP TIER GAS, MOSTLY PURCHASED @ SHELL. DEALERSHIP THEN DECIDED THAT A FUEL SYSTEM FLUSH WAS THE WAY TO GO, WHICH THEY PERFORMED @ NO CHARGE IN AUGUST LAST YEAR. FLUS DIDN'T HELP & I CALLED DEALERSHIP AFTER TRAVELING LESS THAN 2 MILES AFTER THE FLUSH, THEY TOLD ME THAT IT WOULD TAKE A WHILE FOR THE NOISE TO GO AWAY & THE POWER LOSS TO WORK ITSELF OUT & RECOMMENDED TO CONTINUE USING THE TOP TIER GAS, AS I ALWAYS HAD & TO ADD THE TECHRON @ PRESCRIBED INTERVALS WHICH I DID. NOISE HAS NEVER GONE AWAY & POWER LOSS, (DEAD SPOT) IS STILL PREVALENT, MORE SO WHEN WARM. I CONTACTED THE DEALER AGAIN IN MAY OF THIS YEAR AS IT IS GETTING WORSE, ALSO OPENED A CASE WITH KIA CONSUMER CARE DEPT, WHICH I SHOULD'VE DONE RIGHT AT THE ONSET LAST YEAR. I'VE BEEN TOLD THE DEALERSHIP THAT IT IS A KNOWN PROBLEM & THAT NOTHING IS GOING TO FIX IT BUT THEY STILL WANT TO DO ANOTHER FUEL SYSTEM FLUSH WHICH THEY WANT ME TO PAY FOR. CCD HAS ONLY GIVING ME LIP SERVICE & TO DATE NOTHING HAS BEEN RESOLVED.",
        "vin": "KNADN4A34D6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10875234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. AFTER REAR ENDING ANOTHER VEHICLE, THE SEAT BELT FAILED TO RETRACT AND THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED CONTUSIONS THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 58,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846482,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire U.S.A., Inc.",
                "productMake": "KUMHO",
                "productModel": "SOLUS KH25",
                "productYear": "9999",
                "size": "P205/65R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO EQUIPPED WITH KUMHO SOLUS KH25 TIRES, SIZE: P185/65R15 (NA). WHILE DRIVING APPROXIMATELY 30 MPH, THE TIRE PRESSURE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER; HOWEVER, THE FAILURE WAS UNDETERMINED. THE CONTACT WAS INFORMED THAT ALL FOUR TIRES NEEDED AIR. THE TIRES WERE INFLATED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO SEVERAL DEALERS WHERE IT WAS DIAGNOSED THAT ALL FOUR TIRES WERE WORN UNEVENLY AND NEEDED TO BE REPLACED. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 25,000. THE DOT NUMBER WAS UNAVAILABLE.",
        "vin": "KNADM4A37D6"
    },
    {
        "components": "EXTERIOR LIGHTING,WHEELS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/14/2015",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790428,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "1) REPLACED OX SENSOR@ 35000 MILES  2) REPLACED RIGHT FRONT WHEEL BEARING @ 45000 MILES  3) REAR WINDOW IS TOO SMALL TO SEE SAFELY. BLIND SPOT IS LARGE.  4) HEADLIGHT AUTO-SENSOR SETTING DOES NOT INITIATE LIGHTS IN DAYLIGHT RAIN CONDITIONS.  5) SEAT DESIGN DOES NOT PROVIDE LUMBAR SUPPORT AND HEADREST IS PERMANETLY ANGLED TO CAUSE NECK PAIN DURING A LONG DRIVE.",
        "vin": "KNADN5A31D6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789059,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 62,000 MILES, REAR BRAKE WENT OUT FIRST, UPON INSPECTION, ON THE RIGHT SIDE WENT OUT, ON THE SIDE OF THE PADDING THERE WAS METAL TO METAL, MIDDLE PART HAD MINIMAL HAIR LINE MINIMAL OF PADDING LEFT HOWEVER THE LEFT ONE STILL HAD HALFWAY PADDING, PRETTY GOOD,  ROTOR WOULD NOT TURN, BRAKES HAD STAYED IN PLACE FOR A LONG TIME, WHEEL CYLINDER APPEARS TO BE DEFECTIVE, CANNOT PLACE A NEW BRAKE PAD, DUE TO THE PISTON CONSTANTLY COMING OUT, 2 MECHANICS WERE UNABLE TO FIX THIS ISSUE AND ONE OF THEM DID SUCCESSFUL GET THE BRAKE PADS IN PLACE AND PLACED THE CALIPER BACK, HOWEVER, THE ROTOR WOULD NOT TURN, MEANING MY BRAKES WOULD STAY IN PLACE ALL THE TIME THUS, HAVING TO FORCE THE CAR TO MOVE. MECHANIC SAYS THAT I HAD BEEN DRIVING WITH THE BRAKES SET AT THE SAME TIME, AND WHAT WAS ODD FOR HIM WAS THAT ONLY ONE SIDE GAVE OUT SOONER THAN THE OTHER, WHEN IT FACT IT SHOULD BE THE FRONT ONES TO GIVE OUT FIRST AND THEN THE REAR ONES BUT NO, ONLY 1 SIDE FROM THE REAR GAVE OUT, THE FRONT ONES HAD REALLY GOOD PADDING LEFT. BUT THIS POSES A BIG ISSUE FOR ME, SAFETY ISSUE, FOR ME AND MY FAMILY WHEN WE ARE IN THE CAR, IT COULD LIGHT UP IN FLAMES, BURST MY TIRE, SPARK UP, PLEASE HELP. I HAD TO PUT THE USED BRAKE PADS FROM THE LEFT SIDE ONTO THE RIGHT SIDE TO AT LEAST HAVE SOME PADDING, NEW ONES CANNOT BE PLACED BECAUSE AS SOON AS I PLACE THE CLAMP TO PUSH THE PISTON IN, AND I REMOVE IT, IT COMES RIGHT OUT, IT SEEMS LIKE THERES SOME PRESSURE THERE. I DONT KNOW IF THIS IS TO BE COVERED IN THE WARRANTY BUT IM SURE THIS IS NOT ONLY HAPPENING TO ME, PLEASE HELP!!!!",
        "vin": "KNADN5A35D6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782304,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. WHILE DRIVING 25 MPH AND APPLYING THE BRAKES, THE VEHICLE CONTINUED TO ACCELERATE. THE  VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 37,000.",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779937,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING AT 20 MPH, THE VEHICLE WOULD JERK VIOLENTLY, ACCELERATE, AND STALL. ALL THE LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER BUT THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 64,252.",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A COUPLE ISSUES WITH MY 2013 KIA RIO. THE FIRST ISSUE IS ACCELERATION. AROUND THE 30,000 MI MARK, I TOOK MY CAR TO HAVE THE RECOMMENDED SERVICE WHICH INCLUDED AN INDUCTION SVC. SINCE THEN MY CAR HAS NOT HAD THE SAME GOOD ACCELERATION ABILITY IT HAD WHEN I PURCHASED THE CAR. I'VE TAKEN THE CAR TO TWO DEALERSHIPS AND HAVE BEEN TOLD THAT THIS IS JUST NORMAL WEAR ON THE CAR. THE SECOND IS SOMETHING WITH THE STARTER, BATTERY, ALTERNATOR, ETC. I USE THE WORD \"SOMETHING\" BECAUSE NO ONE HAS BEEN ABLE TO PINPOINT WHAT IS THE PROBLEM. I BOUGHT A NEW BATTERY ON MAY 18, 2015. POST THAT BATTERY PURCHASE, THE CAR DID NOT START ON JUNE 27, 2015 (I HAD TO GET A JUMP). THIS NO CRANK WAS POST A BATTERY, STARTER AND ALTERNATOR CHECK BY THE DEALERSHIP ON MAY 23, 2015. BY THE WAY, THE TESTS ALL CAME BACK FINDING NO FAULT. I HAD TWO MORE NO CRANK SITUATIONS ON JULY 19 AND AUGUST 2, 2015. I'VE TAKEN IT BACK TO THE DEALERSHIP AFTER JULY 19 AND HAVE BEEN TOLD BY KIA THAT THIS WILL HAPPEN WHEN IT'S HOT. I DON'T BELIEVE THEM BECAUSE I BOUGHT THE CAR IN THE HELL OF ST. LOUIS, MO SUMMER AT 55 MILES IN 2012 AND DID NOT HAVE THIS RECURRENT PROBLEM UNTIL RECENTLY.",
        "vin": "KNADM4A33D6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726621,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE HEADLIGHTS FAILED REPEATEDLY. THE CONTACT MENTIONED THAT THE HEADLIGHTS WOULD FLICKER ON AND OFF MULTIPLE TIMES AS THE LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED. THE FAILURE OCCURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "KNADM5A37D6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "12/13/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10717560,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WAITING BEHIND SOMEONE AT A COMPLETE STOP FOR THEM TO MAKE A LEFT HAND TURN AND SOMEONE CRASHED INTO THE BACK OF ME AND SMASHED ME INTO THE PERSON IN FRONT OF ME. THE PERSON ADMIT HE DID.NOT SEE US STOPPED AND HIT ME AT ABOUT 45 TO 50 MPH AND MY AIRBAGS DID NOT DEPLOY I WOULD THINK THEY SHOULD HAVE AT HOW HARD I WAS HIT AND HOW HARD THE CAR FORCED ME INTO THE CAR IN FRONT OF ME . I WAS DIAGNOSED WITH DOUBLE WHIPLASH AND SEVERAL TORN. MUSCLES  IN MY CHEST AND SHOULDERS A BRUISE THE SIZE OF A SOFTBALL ON MY RIGHT HIP FROM THE SEAT BELT AND A BURN ON MY LEFT ELBOW FROM HOW HARD IT HIT MY DOOR BOTH THE PALMS OF MY HANDS WERE BRUISED AND I COULD BARELY WALK FOR 2 DAYS FROM SORENESS AND HAVE BEEN SEEING A CHIROPRACTOR FOR 5 MONTHS NOW MY CAR WAS TOTALLED",
        "vin": "KNADM4A35D6"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704355,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER CAR IS RUNNING WOULD HERE A KNOCKING OR RATTLING SOUND,HAD TOO REPLACE PARKING LIGHT BULBS THREE TIMES IN FIRST YEAR THEY  BURNT OUT AND ON THREE OTHER OCCASIONS THE CHECK ENGINE LIGHT WOULD KICK ON AND WHEN I WOULD GET CAR TO SERVICE CENTER CHECK ENGINE LIGHT WOULD GO BACK OUT AND THEY WOULD WANT TO CHARGE ME TO RUN A DIAGNOSTIC IF NOTHING SHOWED AFTER THEY RAN IT ALSO SAID MY WARRANTY WOULDN'T COVER  FAULTY IGNITION AND DOOR LOCK FIRST MY DOOR LOCKS STARTED GETTING JAMMED AND I ASSUMED THAT MAYBE SOMEONE HAD TRIED TO BREAK INTO CAR BUT THEN MY CAR WAS IN REPAIR SHOP ON A UNRELATED  ISSUE MY REPAIR GUY CALLS AND TELLS ME MY IGNITION AND KEY ARE STUCK BETWEEN ACC AND START AND WOULDN'T COME OUT OR TURN THE REST OF THE WAY ON OR OFF ALSO HAVE HAD TO PAY FOR AIR FILTER REPLACEMENT ON CAR AT SIX MONTHS OLD AND THE LABOR BECAUSE IT WASN'T PART OF EXTENDED SERVICE PLAN THE KEY THEN HAS BEEN LITTLE TRICKY HAVING TO PUT IN AT A ANGLE KINDA AND NOW ITS STUCK AGAIN IN BETWEEN ACC AND START AGAIN SO REPAIR GUY DID SOME SEARCHING AND FOUND THAT SOMETIMES IF YOU DISCONNECT THE NEG BAT CABLE IT WILL RELEASE THE IGNITION AND THAT IT COULD HAVE SOMETHING TO DO WITH THE GEAR SHIFT NOT IN GAUGING INTO PARK ALL THE WAY EVEN THOUGH THE SHIFTER SAYS IT IS AND THE SHIFTER WONT GO UP ANYMORE THERE SEEMS TO BE ONE THING AFTER ANOTHER WITH THIS CAR OH AND I ALSO BURNED MYSELF LEANING AGAINST FRONT QUARTER PANEL BUT THE HOOD ITS SELF WAS COOL TO THE TOUCH.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "03/15/2015",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701992,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. WHILE DRIVING AT APPROXIMATELY 40 MPH AND SLOWING DOWN AT A STOP LIGHT, THE CONTACT OBSERVED SMOKE COMING FROM THE HOOD OF THE VEHICLE. THE CONTACT EXITED THE VEHICLE AND LIFTED THE HOOD AND OBSERVED FLAMES. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS DESTROYED AND TOWED TO A SALVAGE YARD. THE MANUFACTURER WAS MADE AWARE THE FAILURE. THE FAILURE MILEAGE 9,175. UPDATED 09/01/2015*LJ   UPDATED 10/14/2015*JS",
        "vin": "KNADM4A30D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "02/21/2015",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694206,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 KIA RIO. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, THERE WAS SMOKE COMING FROM THE HOOD. THE CONTACT UNLATCHED THE HOOD AND DISCOVERED THAT THE ENTIRE ENGINE COMPARTMENT WAS ENGULFED IN FLAMES. THE FIRE DEPARTMENT EXTINGUISHED THE FLAMES. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED.  THE CAUSE OF THE FIRE WAS NOT DETERMINED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 57,000.",
        "vin": "KNADM5A35D6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "01/29/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10680315,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY TILL VEHICLE WAS ROLLED OVER.  *TR",
        "vin": "KNADM4A33D6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/31/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669377,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER STEERING IS CUTTING IN AND OUT INTERMITTENTLY. THIS IS ACCOMPANIED BY A NUMBER OF INDICATOR LIGHTS TURNING ON. THE DEALERSHIP IS NOT TREATING MY ISSUE WITH ANY URGENCY, AND IS CONTENT TO HAVE ME CONTINUE DRIVING MY VEHICLE FOR 6 DAYS WHILE THE POWER STEERING HAS BEEN CUTTING IN AND OUT. I WANT TO FILE A FORMAL RECORD OF THIS ISSUE IN CASE IT CAUSES A SEVERE ACCIDENT.  *JS",
        "vin": "KNADM4A36D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "01/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628307,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA RIO5 LX 2013 STARTED TO MAKE RATTLING / PINGING NOISE IN THE ENGINE AT 70000 MILES. I TOOK IT TO THE DEALERSHIP WAS TOLD THEY CAN'T HEAR IT. THE NOISE STARTED TO GET LOUDER AT 89000 MILES BROUGHT IT BACK TO DEALERSHIP AND THE TECHNICIAN SAID IT'S BECAUSE OF EXCESSIVE CARBON. THEN WAS TOLD TO DO DECARB, REPLACE SERPENTINE BELT, FUEL TANK FILTER & SPARK PLUGS AND THE PINGING WOULD GO AWAY. THE PINGING WAS STILL THERE BUT NOT AS BAD AROUND 94000 MILES BROUGHT IT BACK FOR PINGING HAD THE TECHNICIAN RIDE WITH ME AND HE AGREED IT WAS PINGING ALL THE TIME NOW. THEY DID ANOTHER DECARB SYSTEM ON IT AND TOLD ME THAT ITS NORMAL THE CAR IS GOING TO PING AND I SHOULD RUN 91 OCTANE EVERY 4TH TANK OF GAS. AT 96000 MILES CHECK ENGINE LIGHT COMES ON AND IT'S KNOCK SENSOR CODE THEY HAD TO CALL NORTH AMERICA KIA & KOREA OF KIA LOOKING FOR ANSWER TO SEE WHAT THE PROBLEM IS WITH MY CAR. MY KIA WAS AT DCH KIA OF TEMECULA FOR 7 DAYS AND THEY STILL COULDN'T GIVE ANSWER WHY OR WHAT WAS WRONG WITH MY CAR. THEY JUST SAID IT WAS ONE OF THOSE ISSUE THAT EVERYONE WAS SCRATCHING THERE HEADS AT. THEY USED A TOP ENGINE CLEANER AND THE KNOCK SENSOR CODE HAS BEEN STABLE FOR NOW BUT THE PINGING IS STILL THERE. THEY JUST KEEP TELLING ME I DRIVE TO MUCH & TO USE CHEVRON TECHRON FUEL ADDITIVE PLUS EVERY 4TH TANK USE 91 OCTANE. I CALL KIA CONSUMER AFFAIRS AND WAS TOLD MY CASE IS GETTING PASSED ON TO ONE OF THERE ANALYZE. FINALLY THE ANALYZE CALLED ME I ASKED HIM IF HE HAD MY PAPER WORK HE SAID NO HE DIDN'T NEED IT HE TALKED TO THE TECHNICIAN AT KIA OF TEMECULA AND WANTED TO HEAR MY SIDE. I EXPLAINED TO HIM MY ISSUES AND THE ANALYZE NICK SAID SO IS THE CHECK ENGINE LIGHT ON? REPLIED NO HE SAID SO IT'S FIXED THEN I EXPLAINED TO HIM NO SINCE KIA OF TEMECULA COULDN'T GIVE ME ANSWER WHY OR WHAT IS CAUSING THE ISSUES OF MY KIA RIO. NICK SAID HE WOULD CALL ME BACK, IT'S BEEN 2 WEEKS NO PHONE CALL BACK TO ME.  *TR",
        "vin": "KNADM5A30D6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622159,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUESTING THAT NHTSA PLEASE AMPLIFY AND INVESTIGATE. STEERING WHEEL ON MY KIA RIO 2010 CAR STARTED SQUEAKING WHEN THE STEERING WHEEL IS TURNED EITHER LEFT OR RIGHT. POWER STEERING FLUID IS NORMAL AND THE CAR HAS NOT BEEN IN AN ACCIDENT. THERE MAY BE A CONNECTION IN REGARDS TO THE \"CURRENT\" RECALL IN REGARDS TO \"AN IMPROPER APPLICATION OF THREAD-LOCKING ADHESIVE\" THAT THE KIA SOULS HAVE. THERE IS \"NUMEROUS\" POSTINGS ON WEB SITES OF OWNERS COMPLAINING ABOUT THE SAME STEERING WHEEL SOUND ISSUE. THE STEERING WHEEL SOUND, IS NOT NORMAL AND IT IS WAY TOO MUCH OF A COINCIDENCE TO IGNORE. PLEASE PURSUE \"DUE DILIGENCE\" IN REGARDS TO THIS. THANK YOU.  *TR",
        "vin": "UNK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595233,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE RIO BRAND NEW AT ABOUT 1000 OR MORE STARTED MAKING NOISES COMING FROM ENGINE COMPARTMENT BROUGHT CAR 2-3 TIMES TO DEALERSHIP ABOUT PROBLEMS. NEVER REPAIRED ALSO FUEL MILEAGE HAS DROPPED DRAMATICALLY AND THAT'S WITH ECO MODE ON.GOING BACK TO DEALER ONE MORE TIME TO SEE WHAT COMES OUT OF IT.ALSO I AM RETIRED ARMY STAFF SGT.  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/06/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588073,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT THERE WAS A LEAK IN THE CABIN. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE AC CONDENSER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 22,000 AND THE CURRENT WAS 22,500.",
        "vin": "KNADN4A34D6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "04/09/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I DID NOT HAVE AN ACCIDENT OR ANYTHING TO THAT NATURE.  WE BOUGHT OUR DAUGHTER A 2013 KIA RIO.  I WAS SITTING IN THE PASSENGER SEAT AND NOTICED THAT THE PASSENGER SEAT IS MUCH LOWER THAN TO DRIVERS SEAT.  I REALIZED GOD FORBID IF THE AIRBAG GOES OFF, THE PERSON WILL BE HIT IN THE FACE INSTEAD OF THE CHEST.  IM NOT SURE IF YOU CAN HELP ME, BUT IS THIS A DEFECT IN THE CAR.  I FOUND IT ODD.  THE CAR WAS BOUGHT AT AUTOWORLD KIA IN EAST MEADOW NY.      THANK YOU FOR YOUR HELP  *TR",
        "vin": "KNADN4A31D6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "09/12/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, THE POWER STEERING MALFUNCTIONED AND CAUSED THE STEERING WHEEL TO BECOME DIFFICULT TO TURN. THE CONTACT INDICATED THAT THE SENSOR LIGHTS FOR THE ELECTRONIC POWER STEERING, ELECTRONIC STABILITY CONTROL AND THE ANTI-LOCK BRAKING SYSTEM WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE POWER STEERING ASSEMBLY WAS REPLACED BUT THE DEFECT WAS NOT REMEDIED. THE MANUFACTURER WAS NOTIFIED AND NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 9,215.",
        "vin": "KNADN4A35D6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2013",
        "dateOfIncident": "06/26/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT WAS DRIVING APPROXIMATELY 60 MPH WHEN THE LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED AS THE POWER STEERING SUDDENLY MALFUNCTIONED. THE VEHICLE WAS TAKEN TO THE DEALER, WHERE THE ELECTRICAL HARNESS TO THE COMPUTER WAS REPLACED. THE FAILURE RECURRED TWICE AFTER THE REPAIRS. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 70.",
        "vin": "KNADN5A38D6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556245,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE FRONT END FAILED AND CAUSED THE VEHICLE TO ABRUPTLY VEER TO THE RIGHT. THE VEHICLE WAS TAKEN TO THE DEALER, WHO DIAGNOSED THAT THE FRONT END ALIGNMENT NEEDED TO BE REPAIRED. THE CONTACT HAD EXPERIENCED THE EXACT SAME FAILURE THREE TIMES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 100.",
        "vin": "KNADM4A33D6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "11/21/2013",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553953,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED FOR A STOP SIGN AT AN INTERSECTION WHEN FLAMES SHOT UP FROM UNDERNEATH THE HOOD!  THERE WAS NO WARNING AT ALL THAT ANYTHING WAS EVEN WRONG W/THIS CAR!  NO LIGHTS ON THE DASHBOARD...NO WARNING!  *TR    I QUICKLY PUT IT INTO PARK AND JUMPED OUT.  THE FIRE DEPARTMENT WAS THERE IN A MATTER OF MINUTES.  I AM IN THE PROCESS OF REPORTING THIS INCIDENT TO THE CONSUMER AFFAIRS IN RIVINE, CAL.    I STILL DO NOT KNOW WHAT HAPPENED TO CAUSE SUCH A FIRE!",
        "vin": "KNADM5A39D6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/27/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10532377,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING 20 MPH, THE CONTACT CRASHED INTO ANOTHER VEHICLE. UPON IMPACT, THE FRONTAL AIR BAGS FAILED TO DEPLOY. THE CONTACT ALSO MENTIONED THAT THE SEAT BELT FAILED TO PROPERLY SECURE A CHILD PASSENGER. THE CONTACT SUSTAINED MINOR BRUISING AND THE PASSENGER SUSTAINED WHIPLASH AND SHOULDER INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 24,000.",
        "vin": "KNADM4A32D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2013",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523538,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS EXPERIENCING POWER LOSS AND NOISES FROM THE MOTOR. I HAVE TAKEN THIS CAR IN THREE TIMES NOW FOR THE SAME ISSUE AND THE DEALER (TEMPE KIA) SAYS THERE IS NOTHING WRONG WITH THE MOTOR. THE SHOP MANAGER WAS EXTREMELY RUDE. THE FIRST TIME THEY TOOK IT FOR A TEST DRIVE AND HEARD THE LIFTERS. TOOK IT BACK A MONTH LATER AND THEY SAY THEY HEAR NOTHING. NOTHING WAS DONE WITH MY CAR.   *TR",
        "vin": "KNADM5A32D6"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515784,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "JOE MYERS KIA & THE MANUFACTURER OF KIA HAVE BEEN FRAUDULENT IN THEIR BUSINESS WITH ALL  THE 2013 KIA RIOS REAR WINDSHIELD DESIGN HAS A DEFECT IN THE CONSTRUCTION OF THE BUILD OF THE VEHICLE, THE BACK WINDSHIELD IS BUILT TO HIGH & IT CAUSES AN OBSTRUCTION TO DRIVERS VISIBILITY.  IN 2007, THE DOT PROPOSED A NEW SAFETY REGULATION TO HELP ELIMINATE BLIND ZONES BEHIND VEHICLES THAT CAN HIDE THE PRESENCE OF INDIVIDUALS.  THE PROPOSED RULE WAS REQUIRED BY CONGRESS AS PART OF THE CAMERON GULBRANSEN KIDS TRANSPORTATION SAFETY ACT OF 2007. IN ADDITION, ISSUED BY THE (NHTSA), WOULD EXPAND THE REQUIRED FIELD OF VIEW FOR ALL CARS.  THE KIA MANUFACTURERS DESIGN OF THE BACK WINDSHIELD OF THE 2013 KIA RIOS ARE NOT IN COMPLIANCE WITH THE SAFETY REGULATION SET BY NEITHER THE DOT NOR THE PROPOSAL ISSUED BY THE NHTSA NOR THE STANDARDS FOR SAFE DRIVING THAT ARE SET BY THE DPS FOR DRIVERS.  LISTED BELOW ARE SAFETY MEASURES THAT THE HANDBOOK INCLUDES FOR DRIVING, BOTH MIRRORS & WINDOWS ARE NEEDED.  1.BACKING UP OR REVERSE   2.BLIND ZONES OR BLIND SPOTS    3.TAILGATING   THE 2013 KIA RIOS DESIGN OF THE BACK WINDSHIELD COULD TAKE A LIFE DUE TO THE FACT THAT IT CAUSES AN OBSTRUCTION TO A DRIVERS SIGHT. VIOLATIONS BELOW THAT THEY HAVE COMMITTED UNDER DOT.  PART 579 THIS REGULATION ALLOCATES BETWEEN MOTOR VEHICLE AND EQUIPMENT MANUFACTURERS THE RESPONSIBILITIES UNDER THE 1974 MOTOR VEHICLE AND SCHOOL BUS SAFETY AMENDMENTS FOR RECALLING AND REMEDYING DEFECTIVE MOTOR VEHICLES AND EQUIPMENT OR MOTOR VEHICLES & EQUIPMENT NOT BUILT IN COMPLIANCE WITH THE LAW.  *TR",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515078,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE REVERSING FROM A RESIDENTIAL DRIVEWAY, THE CONTACT LOST REAR WINDOW VISIBILITY. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE IT WAS ADVISED THAT THE REAR WINDOW WAS BUILT ABNORMALLY HIGH. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 30.  *TR",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "05/12/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511874,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT NOTICED THAT THE REAR WINDOW WAS TOO HIGH AND THE CONTACT WAS UNABLE TO SEE OTHER VEHICLES. THE VEHICLE WAS TAKEN TO THE DEALER BUT A DIAGNOSIS WAS NOT PERFORMED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 400. *TR",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "04/02/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511946,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KIA RIO. THE CONTACT STATED THAT THE REAR WINDSHIELD WAS LOCATED TOO HIGH FOR HER TO BE ABLE TO SEE THE TRAFFIC COMING FROM BEHIND THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THAT THEY COULD INSTALL ADDITIONAL MIRRORS FOR THE CONTACT TO BE ABLE TO SEE TRAFFIC BEHIND THE VEHICLE. THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO FURTHER ASSISTANCE. THE FAILURE AND CURRENT MILEAGE WAS 400.    UPDATED 6/17/13 *CN",
        "vin": "KNADM4A34D6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2013",
        "dateOfIncident": "01/12/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496819,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I DETECT A NOISE COMING FROM THE MOTOR AND WENT TO SERVICE DEPARTMENT OF THE DEALER ON JANUARY 14, THEY MAKE A TEST DRIVE AND SAID THAT MAYBE THE PROBLEM IS WITH A \"LIFTER\" THEY GAVE ME AN APPOINTMENT FOR SERVICE FOR THE 28 OF JANUARY.  ON JANUARY 22 I LEFT MY CAR AT THE SERVICE DEPARTMENT A FEW DAYS LATER, WHEN I CALL FOR INFORMATION THEY TOLD ME THAT THE MANUFACTURER DECIDE TO REPLACE THE COMPLETE MOTOR DUE TO A \"RECALL\" FOR SOME DEFECTIVES ON THE UNIT THAT WERE POSTED.  AT THIS TIME I JUST KNOW THAT THE CAR STILL IN SERVICE WAITING FOR THE MOTOR.  NO WARNING LIGHTS TURN ON THE PANEL EVER AND I JUST NOTICE THAT THE OUTSIDE OF THE UNIT IS TOO HOT WHEN I TURN IT OFF AND PARK.   *TR",
        "vin": "KNADN4A33D6"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "07/09/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465265,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE PULLED UP TO THE RED LIGHT, THE IDLE STOP AND GO SYSTEM ENGAGED AND STOPPED THE ENGINE.  WHEN THE LIGHT TURNED GREEN, I RELEASED THE BRAKE AND, AS WE WERE ON A DOWNSLOPE, WE IMMEDIATELY BEGAN ROLLING INTO THE INTERSECTION.  UNFORTUNATELY THE GO PART DIDN'T WORK AND THE ENGINE DIDN'T RESTART.  THE LIGHT HAD TURNED RED AGAIN BEFORE I COULD FIGURE OUT THAT I HAD TO PUT THE CAR INTO NEUTRAL TO RESTART IT WITH THE KEY.  *TR",
        "vin": "KNADN5A3XD6"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466101,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE ENGINE OVERHEAT WARNING SYSTEM  THIS VEHICLE, 2013 KIA RIO, 1.6L GDI, 6-SPEED MANUAL, DOES NOT HAVE A COOLANT TEMPERATURE GAUGE. IT SUPPOSEDLY RELIES ON ONE WARNING LIGHT ON THE INSTRUMENT PANEL TO INDICATE AN OVERHEATED ENGINE, A LIGHT WHOSE CORRECT OPERATION CANNOT BE VERIFIED.  THIS SUPPOSED ENGINE OVERHEAT WARNING LIGHT NEVER COMES ON DURING THE LIGHT BULB CHECK PHASE, SO THAT THE OPERATION OF ITS LIGHT BULB CANNOT BE VERIFIED. NOTE THAT THE OTHER WARNING LIGHTS, OIL PRESSURE, BRAKES, ETC COME ON DURING THIS PHASE AND THEIR WARNING SYSTEMS CAN BE VERIFIED. IF THE OVERHEAT LIGHT BULB FILAMENT BURNS OUT (THIS FREQUENTLY HAPPENS WITH ANY BULB), THEN THE DRIVER IS NEVER GIVEN A CHANCE TO VERIFY THE BULBS OPERATION, AND THIS ENGINE OVERHEAT WARNING SYSTEM BECOMES USELESS AS THERE CANNOT BE ANY WARNING INDICATION EVER GIVEN TO THE DRIVER IF THE ENGINE DOES OVERHEAT.  A LIKELY RESULT OF THIS DEFECTIVE ENGINE OVERHEAT WARNING SYSTEM MAY BE A VEHICLE CRASH AT HIGH SPEED, WHEREBY THE DRIVER IS NEVER GIVEN AN OVERHEATED ENGINE WARNING IF ITS WARNING SYSTEMS LIGHT BULB BURNS OUT, THE ENGINE SHATTERS FROM EXCESSIVE HEAT, THE HOOD AND ENGINE FLUIDS FLY INTO THE WINDSHIELD BLOCKING THE DRIVERS VIEW, THE DRIVER LOSES CONTROL OF THE VEHICLE, AND THE KIA VEHICLE CRASHES OFF THE ROAD OR INTO OTHER VEHICLES.  THIS PROBLEM AFFECTS THE 2013 KIA RIO, AND ALSO 2012 AND POSSIBLY 2011 KIA RIOS AS WELL.",
        "vin": "KNADM4A3XD6"
    }
]