[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373715,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN MY RV AT APPROXIMATELY 10AM IN THE MORNING, AT A CAMPGROUND. I NOTICED A SMELL OF ELECTRICAL BURNING IN THE LIVING AREA OF THE RV. IT WAS A COLD MORNING, AND HAD OUR ELECTRIC FIRE PLACE ON AT THE TIME. WE ALSO HAD OUR HEAT STRIP IN OUR ROOF TOP AIR CONDITIONER ON AS WELL. THE BURNING SMELL BECAME STRONGER AS THE MORNING WENT ON. I THEN BEGAN TO INVESTIGATE WHERE THE SMELL WAS COMING FROM. IT APPEARED TO BE COMING FROM OUR FIREPLACE, WE THEN REMOVED IT PLACING IT OUTSIDE. I PLUGGED THE UNIT IN OUTSIDE TO SEE IF THE SMELL WAS COMING FROM THE FIREPLACE. THERE WAS NO SMELL FROM THE FIREPLACE. I WENT BACK IN TO THE CAMPER, THE SMELL WAS STILL PRESENT. I INVESTIGATED FURTHER, AND THE SMELL APPEARED TO BE COMING FROM THE UNDER BELLY COMPARTMENT. AFTER CLEARING OUT THE UNDER BELLY STORAGE, THE RV MECHANIC CAME OVER AND SMELLED THE ELECTRICAL SMELL. HE ASKED ME TO PLUG IN EVERYTHING THAT WAS ON AT THE TIME, WHEN I FIRST SMELLED THE BURNING SMELL. THE FIREPLACE WAS BROUGHT BACK  INTO THE RV, AND PLUGGED BACK IN TO THE OUTLET. THE RV MECHANIC WENT INTO THE UNDERBELLY AND WAS SEARCH FOR THE SOURCE OF THE SMELL. UPON DOING SO, HE HAD BUMPED THE MAIN POWER FEED WIRE COMING INTO THE CAMPER. THIS CAUSED THE LIGHTS ON THE FIREPLACE TO FLICKER OFF AND ON. I NOTIFIED THAT WHAT EVER HE HAD JUST DONE CAUSED THE LIGHTS TO FLICKER. HE DID THIS AGAIN CAUSING THE LIGHT TO DO THE SAME THING AGAIN. THIS APPEARED TO BE THE PROBLEM THE MECHANIC WAS CONVINCED. HE SHUT THE POWER OFF, AND PULLED THE PLUG OUT. UPON TAKING THE PLUG OUT, HE FOUND THAT THE SIDE OF THE PLUG COVER WAS STARTING TO BURN. THE MECHANIC, WENT TO LOOSEN THE SCREWS FOUR THE FOUR WIRES CONNECTING THE 220 VOLT 50AMP SERVICE, AND WAS ABLE TO PULLED THE WIRES OUT WITHOUT HAVING TO UNSCREW ALL THE SCREWS. HE STATED THAT NONE OF THE HOLD SCREWS FOR THE CONNECTIONS WERE NEVER TIGHTEN. PLEASE LOOK INTO THIS FIRE HAZARD THANKS.",
        "vin": "4YDF30024DR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/03/2020",
        "fire": true,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373033,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE RAPTOR 300 MP. THE CONTACT STATED THAT WHILE IN THE RV, AN ABNORMAL ODOR APPEARED. THE CONTACT OPENED THE FRONT COMPARTMENT AND NOTICED THE WIRES WERE BURNED. THE WIRES WERE LOCATED ON THE DRIVER SIDE THE FRONT UNDER STORAGE AREA. NO DEALER NOR MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 13V155000(EQUIPMENT) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000.",
        "vin": "4YDF30024DR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005880,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE BLEW OUT CAUSING 1,850.00 DAMAGE NOT COUNTING NEW TIRE. NOVEMBER 2016 . NEXT TRIP JULY 6 2017 HAD BLOW OUT 7 MILES DOWN THE HWY SECOND TIRE BLEW OUT CAUSING EXTENSIVE DAMAGE . TIRES ARE TOW MAX235/80/16 . I HAD 5 NEW ONES PUT ON THE ONES THAT DIDN'T BUST ARE ALL KNOTTED UP LIKE THE BELTS ARE BROKE  I SAVED THE TIRES .*DT*JB",
        "vin": "4YDF37723DR"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/13/2016",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895984,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING MY 2013 5TH WHEEL KEYSTONE RAPTOR ON I-95 IN VIRGINIA, I HAD THE RIGHT REAR TIRE EXPLODE. THE TIRE WAS A GOODYEAR 235/80/16 MARATHON TIRE THAT WAS NO MORE THAN A YEAR AND 4 MONTHS OLD. THE SPEED WAS BETWEEN 65-70MPH, AND WITHOUT WARNING HEARD A LOAD EXPLOSION. I LOOKED INTO THE RIGHT MIRROR, AND SAW THE TIRE DISINTEGRATING THE RIGHT SIDE OF MY 5TH WHEEL. ALL THE TIRES WERE CHECKED PRIOR TO LEAVING MYRTLE BEACH SC.,BY HAND AND VISUALLY. ALL THE TIRE HAD BETWEEN 77 TO 78 PSI IN THEM. THE SPARE WAS PUT ON, AND CONTINUED TO THE GOODYEAR SERVICE CENTER IN COLONIAL HEIGHTS VA. THE AUTO CENTER INITIALLY STATED THAT THIS WAS A ROAD HAZARD, UNTIL THE SPARE WAS TAKEN OFF. THE TIRE ON THE PASSENGER SIDE RIGHT FRONT HAD A BULGE ON THE INSIDE TREAD THAT WAS NOT VISIBLE UNTIL THE REAR TIRE WAS TAKEN. AT THIS POINT I INSISTED THAT ALL THE TIRES BE CHECKED BY THE GOODYEAR SERVICE CENTER. THEY TOOK BOTH LEFT SIDE TIRES OFF, PUT ONE TIRE ON THE SPIN BALANCER TO CHECK THE TIRE. THE SERVICE TECH FOUND TREAD SEPARATION IN A PORTION OF THE TIRE. THE SECOND TIRE ON THE LEFT FRONT ALSO SHOWED OBVIOUS TREAD SEPARATION WITHOUT THE SPIN BALANCER CHECK.THE GOODYEAR SERVICE CENTER WARRANTED ALL FOUR TIRES FOR TREAD SEPARATION. THANK GOD I INSISTED THAT THE REMAINING TIRES BE CHECKED. I BELIEVE THAT I WOULD HAVE EXPERIENCED ANOTHER BLOW OUT DOWN THE ROAD. THE GOVERNMENT SHOULD LOOK INTO A RECALL ON THESE TIRES. THE DOT DATE CODE WAS 2014 ON ALL THESE TIRES, AND HAD MAYBE 3000 MILES ON THEM. THE SERVICE CENTER STATED THAT THEY WERE ALL MANUFACTURED AT THE SAME LOCATION. GOODYEAR USA WAS CONTACTED, AND A CLAIM NUMBER WAS ASSIGNED. HAVE TO FILE A CLAIM WITH MY INSURANCE COMPANY TO HAVE DAMAGES FIXED. NO ONE SHOULD HAVE TO GO THROUGH THIS EXPERIENCE. I NOW AM LEFT IN DOUBT ABOUT HOW SAFE ARE THE NEW REPLACEMENT TIRES.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850710,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "TRAIL BOSS",
                "productModel": "LT24575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE RAPTOR TRAILER EQUIPPED WITH TRAILER KING (NA) TIRES, SIZE ST235/80/R16 (NA). WHILE DRIVING 65 MPH, THE REAR DRIVER SIDE TIRE BLEW OUT AND THE TREAD SEPARATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT ALL SIX TIRES WERE SEPARATING AND NEEDED TO BE REPLACED. THE MANUFACTURER OF THE TIRES WAS NOTIFIED. THE TIRES WERE REPLACED. THE TIRE FAILURE MILEAGE WAS 600.",
        "vin": "4YDF36524DR"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "06/27/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733950,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING WEST ON 44 THROUGH MISSOURI NEAR ST. JAMES AT 60-62 MPH OR 1650 RPM ON DIESEL WE HEARD A LARGE BOOM AND I NOTICED VIBRATIONS COMING FROM THE 5TH WHEEL TRAILER. IT'S A TOYHAULER BUT WE DIDN'T HAVE OUR TOYS WITH US! WE HAD 2 BICYCLES TO RIDE. ALSO TWO LIGHT WEIGHT DOG CRATES MADE OF PLASTIC IN THE BACK. I OBSERVED OUT THE RIGHT MIRROR PARTS COMING OFF MY TRAILER. WE SLOWLY AND SMOOTHLY EASED TO 5 MPH. I THEN WENT TO THE SIDE OF THE ROAD TO SEE WHAT HAPPENED. THE RIGHT FRONT TIRE HAD BLOWN AND SEVERED MY LEVELING SYSTEMS HYDRAULICS. ONE LEG WAS ON THE GROUND DRAGGING, I RAISED THE LEG BY HAND AND DUCT TAPED UP FOR A TEMP REPAIR SO I COULD FORWARD TO TAKE THE CAMPER OFF THE ROAD AT AN INTERSECTION WHICH  H WAS RIGHT THERE. I CALLED MY ROADSIDE ASSISTED INSURANCE AND THEY CHANGED TIRE TO SPARE. I LOOKED AT DAMAGED AND CONTINUED ON TO OUR CAMPING SPOT IN BRANSON MISSOURI. WE MADE SOME MORE MINOR REPAIRS AND CONTINUED ON OUR TRAVELS WITHOUT A SPARE AND THA LEVELING SYSTEM!      PS THIS IS THE SECOND BLOWOUT IN 10 MONTHS ON THIS UNIT.  TIRES: GRAND TOURINS ST235/80/R16 E RATED 3520 LBS.  *TR",
        "vin": "4YDF33220DR"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723951,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "LT235/80R16 E",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 KEYSTONE RAPTOR TOYHAULER TRAILER. THE TRAILER WAS EQUIPPED WITH TWO POWER KING TOWMAX TIRES, SIZE: LT235/80R16 E. WHILE DRIVING 60 MPH ON A HIGHWAY, THE FRONT PASSENGER SIDE TIRE BLEW OUT WITH EXCESSIVE FORCE AND THE TREAD COMPLETELY SEPARATED. THE CONTACT MERGED TO THE SHOULDER OF THE HIGHWAY AND REPLACED THE TIRE. EIGHT MONTHS LATER, WHILE DRIVING 55 MPH, THE FRONT DRIVER SIDE TIRE BLEW OUT WITH THE SAME EXPLOSIVE FORCE. THE MANUFACTURER OF BOTH THE TRAILER AND THE TIRE WERE NOT MADE AWARE OF THE FAILURES. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 5,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "03/16/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609329,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD TOWMAX STR ST 235-80R16,POWER KING RADIAL DOT 83B5 GPB  TIRES ON OUR KEYSTONE RAPTOR CAMPER.  WHILE DRIVING ON I-95 N IN GEORGIA, WE HAD A BLOWOUT.  ONE TIRE WAS COMPLETELY SHREDDED, AND IT DAMAGED THE CAMPER IN THE AMOUNT OF $1470.21 WE CHANGED THE TIRE AND PROCEEDED HOME.  ON INSPECTING THE REST OF THE TIRES, WE FOUND A SECOND TIRE WITH A BULGE, AND A THIRD WITH WIRES THROUGH THE TREAD.  *TR",
        "vin": "4YDF3102XDR"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/06/2014",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604395,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "LT235/80R16 E",
                "type": "Tire"
            }
        ],
        "summary": "I WAS TRAVELING EAST ON I-20 IN ALABAMA TOWING MY 2013 FOREST RIVER XLR 300X12.  THE CURB SIDE REAR TIRE (2 AXLES) DISINTEGRATED WITHOUT WARNING, CAUSING DAMAGE TO THE SIDE OF MY TRAILER AND TO THE RIM.  I INSTALLED THE SPARE AND LIMPED HOME.  I DECIDED TO REPLACE ALL OF THE TIRES.  WHEN THE STREET SIDE FRONT TIRE WAS INSPECTED AFTER REMOVAL, IT SHOWED OBVIOUS SIGNS OF TREAD/BELT SEPARATION (DEFORMATION).  THE TIRES WERE THE ORIGINAL TIRES SUPPLIED BY THE RV MANUFACTURER, POWERKING TOWMAX 235/80-16 LOAD RANGE E, DOT CODE 83B5 GPB, DATE CODE 2412.  THE TIRES WERE INSPECTED FOR PRESSURE (80LBS) AND VISUAL DEFECTS ~150 MILES BEFORE THE FLAT.  MY SPEED WAS 62 MPH, TEMPS WERE NEAR 90.  *TR",
        "vin": "4X4FXLF24D5"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545063,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "LT235/80R16 E",
                "type": "Tire"
            }
        ],
        "summary": "I BLEW 3 POWER KING TOW MAX ST235/80-16E TIRES ON MY 2011 KEYSTONE 3912 LEV RAPTOR. THE TIRES COMPLETELY FAILED WITH THE CAP COMING OFF IN ONE PIECE. THIS HAPPENED WITH 3 OF THE 6 TIRES ON 3 DIFFERENT OCCASIONS ALL OF WHICH OCCURRED IN APRIL OF THIS YEAR. NOTE: I FEEL ALL TOWED RV'S SHOULD BE REQUIRED TO HAVE TIRES RATED FOR OVER 75 MPH OR THEY SHOULD BE REQUIRED TO WARN ALL CUSTOMERS VERBALLY AND IN LARGE PRINT.. I FOUND OUT ST TIRES HAVE A MAX SPEED OF 65 MPH. I DRIVE THE POSTED LIMIT WHICH COULD BE 85 MPH IN PARTS OF TX. THE DEALER NEVER TOLD OF THE DANGERS ASSOCIATED WITH INTERSTATE USE WITH ST TIRES",
        "vin": "4YDF39127BR"
    }
]