[
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2012",
        "dateOfIncident": "07/16/2011",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482509,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "LACROSSE TOWABLE",
                "productModel": "318BHS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A NEW TRAVEL TRAILER THAT WE HAD FOR LESS THAN 4 MONTHS, WE TOOK IT TO MYRTLE BEACH, SC. ON THE WAY HOME, WHILE WE WERE DRIVING ON THE INTERSTATE IN ASHEVILLE, NC, SEVERAL SURROUNDING VEHICLES NOTIFIED US THAT THE TRAVEL TRAILER HAD CAUGHT ON FIRE. THE WHEEL, TIRE AND RESPECTIVE BRAKES AND BEARINGS WERE COMPLETELY BURNED UP ALONG WITH AXLE DAMAGE AND FIRE DAMAGE TO THE FRONT WHEEL AND TIRE. THE VEHICLE HAD TO BE TOWED, AND WE WERE STRANDED FOR NEARLY A WEEK. THE PROBLEM WAS THAT THE AXLE AND BEARINGS AND BRAKES WERE UNDERSIZED. FOREST RIVER MADE ARRANGEMENTS FOR LIPPERT COMPONENTS, THE MANUFACTURER OF THE AXLE AND ASSOCIATED PARTS, TO PROVIDE REPLACEMENTS, AND AFTER ABOUT A WEEK OF BEING STRANDED, WE WERE ABLE TO GET THE TRAVEL TRAILER REPAIRED WELL ENOUGH IN ASHEVILLE TO GET IT BACK TO INDIANA. WE HAD TO TAKE IT STRAIGHT TO THE ORIGINAL DEALER WHERE IT TOOK SEVERAL MORE WEEKS TO FINISH REPAIRS. WE PUT IT INTO STORAGE FOR THE WINTER. WE TOOK IT BACK OUT AGAIN IN THE SPRING FOR A SPRING BREAK TRIP AND HAD BEEN ON THE ROAD ABOUT 4 OR 5 HOURS WHEN THE EXACT SAME THING HAPPENED AGAIN. THE FIRST INCIDENT WAS ON THE PASSENGER SIDE, AND THE SECOND INCIDENT WAS ON THE DRIVER'S SIDE. THE AXLE, WHEEL, TIRE, BRAKES AND BEARINGS CAUGHT ON FIRE ON THE INTERSTATE. WE HAD REPAIRS MADE IN KENTUCKY WHICH IS WHERE WE WERE STRANDED THE SECOND TIME. UPON RETURN TO INDIANA, WE DETERMINED TO GET A VEHICLE WEIGHT AND AN INDEPENDENT OPINION. WE OBTAINED A WEIGHT ON A CERTIFIED TRUCK SCALE WITHOUT ANY WATER OR MUCH OF OUR BELONGINGS ON BOARD, AND THE WEIGHT WAS 7720LB. OUR INDEPENDENT ASSESSMENT BY WARNER SPRING INFORMED US THAT THE NEW AXLES, BRAKES AND BEARINGS WERE STILL UNDERSIZED. FOREST RIVER REFUSED TO MAKE THE NEEDED CHANGES. ABOUT 6 WEEKS AFTER OUR SECOND FIRE, WE MET ANOTHER FAMILY WHO HAS THE SAME TRAILER WE DO, AND THEIRS HAD JUST CAUGHT ON FIRE FROM THE EXACT SAME CAUSE.  *TR  ..UPDATED 11/14/12 *BF UPDATED 12/4/2012 *JS",
        "vin": "5ZT2LCXB5CB"
    }
]