[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418459,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover LR2. The contact stated while driving 45 mph, the brakes failed to engage while the brake pedal was depressed. The contact stated there was no warning light illuminated. The vehicle was taken to an independent mechanic where it was diagnosed with the vacuum pump needing to be replaced. The vehicle was not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 40,000. The VIN was unavailable",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395659,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CURRENTLY THE CAR HAS 36,000 MILES PER THE ODOMETER. TWO DAYS AGO, A HUMMING SOUND STARTED COMING FROM THE REAR UNDERCARRIAGE WHILE DRIVING, AND CONTINUED REGARDLESS OF SPEED. THIS WAS A NEW SOUND, ONE THAT SOUNDED LIKE SOMETHING WAS WRONG, LIKE THE TIRE WAS ABOUT TO FALL OFF THE CAR. THIS WAS SCARY ESPECIALLY SINCE A CAR WITH THIS FEW MILES SHOULD NOT HAVE ANYTHING SERIOUSLY WRONG WITH IT. THE MECHANICS CONFIRMED THAT THE REAR DIFFERENTIAL NEEDS TO BE REPLACED, AND QUOTES ARE EACH AROUND $7,000.00! THIS KIND OF DEFECT SHOULD NOT HAVE GONE UNNOTICED BY LAND ROVER FOR SO LONG WITHOUT ISSUING A RECALL OR HAVING THE DEFECT ADDRESSED PRIOR TO FURTHER PRODUCTION OF THE VEHICLE. THIS IS OBVIOUSLY A HUGE FINANCIAL BURDEN, EMOTIONAL BURDEN, AND ONE THAT COMPROMISED MY SAFETY. RESEARCHING ONLINE, THERE SEEMS TO BE NUMEROUS OTHER LR2 OWNERS EXPERIENCING THE SAME ISSUE THAT HAVE REPORTED FILING COMPLAINTS AS WELL.",
        "vin": "SALFR2BG2DH"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270220,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT A SAFE FREEWAY SPEED 70MPH, THE MOTOR SUDDENLY STOP WITH NO WARNING.  AS THE CAR SLOWED DOWN, I WAS ABLE TO TURN ON HAZARD LIGHTS, MOVE TO NEUTRAL AND SAFELY MAKE MY WAY TO RIGHT SHOULDER.  THE CAR WAS UNABLE TO START FOR OVER THREE WEEKS SINCE THEN..  THE CAR IS CURRENTLY WITH DEALER.  IT WAS A DANGEROUS SITUATION WITH MY 3-MONTH OLD AND WIFE WITH ME, HOW DOES A CAR JUST STOP ON A HIGHWAY.",
        "vin": "SALFR2BG0DH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252347,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER-SIDE AIRBAG IS DISABLED DUE TO BAD SEAT OCCUPANCY SENSOR, LOCAL DEALER DIAGNOSTIC AS SRS SENSOR ISSUE. LAND ROVER ALREADY STARTED A RECALL CAMPAIGN FOR SAME MODEL YEAR, SAME MODEL FOR THIS. HOWEVER, IT EXCLUDES ALL LR2 EXPORTED FROM ENGLAND.  THE CURRENT VEHICLE HAS THE EXACT SAME ISSUE AS RECALL \"P046 NAS5 - SAFETY RECALL: SUPPLEMENTARY RESTRAINT SYSTEM (SRS) WARNING LAMP ILLUMINATED\" HOWEVER IT IS NOT RECALLED TO FIX ISSUE THAT WILL CAUSE SERVE ISSUE FOR PASSENGER SAFETY.",
        "vin": "SALFR2BG8DH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205248,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TO BE REPLACED REAR DIFFERENTIAL ASSY (INTERNAL MECHANICAL FRAILER) AND MUFFLER ASSY  CAR IS IN QATAR, PLEASE ASSIST ME ABOUT THIS MOST COMMON PROBLEM.",
        "vin": "SALFA2BG9DH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163039,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LANDROVER 2013 LR2 BEGAN THIS MONTH BY ALL OF THE LIGHTS TURNING OFF AND NOT WORKING THEN THE HOOD SAYS BINET OPEN AND CANNOT LOCK THE VEHICLE THEN I WAS AT THE STORE AND IT HAD PROBLEMS STARTING GOT IT TO DRIVE AND DIED ON THE HIGHWAY.  WHEN IT FINALLY RESTARTED THE ENGINE MADE GRINDING NOISES THEN ENGINE LIGHT CAME ON TOOK IT TO MY MECHANIC AND OF COURSE A BOLT SHEARED OFF INSIDE THE ENGINE AND BROKE THREW ANOTHER PART THE INTAKE ACTUATOR ND THE EXHAUST ACTUATOR COSTING $2800 HEARD THERE IS A PSA OUT CAN'T FIND IT I WOULD NOT HAVE BOUGHT IT HAD I KNOWN THAT'S GUARANTEED TO HAPPEN VERY SAD",
        "vin": "SALFP2BGXDH"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076515,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  UPON TURNING MY CAR ON THE FRONT PASSENGER SEAT AIRBAG WARNING INDICATOR LIGHT HAS APPEARED. I'M AWARE THAT WHEN THE DRIVER AND/OR PASSENGER SITS IN THE FRONT SEATS OF THE VEHICLE A SEAT BELT REMINDER SENSOR APPEARS. THIS SENSOR TRIGGERS A WARNING LIGHT AND AN AUDIBLE CHIME TO REMIND THE DRIVER AND/OR PASSENGER TO FASTEN THEIR SEAT BELT. HOWEVER, MY CAR ONLY REMINDS/CHIMES FOR THE DRIVER SEAT. THE SENSOR DOES NOT TRIGGER WHEN THERE IS AN OCCUPANT IN THE PASSENGER SEAT. I'M AWARE THAT OTHER LAND ROVER MAKES/MODELS HAVE HAD RECALLS DUE TO AIR BAG ISSUES. I'M CONCERNED THAT THE MAKE/MODEL OF MY CAR HAS THE SAME PROBLEM. IT'S NOW 5 YEARS SINCE I'VE PURCHASED MY VEHICLE (NEW) AND WITHIN THAT TIME THE BATTERY HAD TO BE REPLACED WITHIN 3 YEARS THEN BOTH RIGHT AND LEFT CALIPERS HAD TO BE REPLACED WITHIN 4 YEARS (PROBLEMS THAT I THOUGHT COULD/WOULD OCCUR AT LEAST AFTER 50,000 MILES). CURRENTLY, MY CAR HAS 42,634 MILES ON IT (ROUGHLY 8,500 MILES A YEAR DRIVING TO AND FROM WORK). MY CAR HISTORY WILL SHOW THAT I HAVE NOT BEEN IN ANY SEVERE ACCIDENTS OR IN ANY INCIDENT THAT WOULD RESULT IN THE AIRBAG WARNING INDICATOR LIGHT APPEARING. I WOULD LIKE TO KNOW IF THIS ISSUE IS IN FACT A RECALL OR WAS I JUST DEALT A LEMON?",
        "vin": "SALFR2BG1DH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902929,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG SENSOR IN THE PASENGER SEAT IS BAD.  THE DEALER SAYS THAT IT IS MY RESPONSIBILITY TO FIX.  THE PART TO ME IS DEFECTIVE.  USAGE OF THIS SEAT IS EXTREMELY LIMITED.  THIS RESULTS IN THE AIRBAG NOT WORKING IN CASE OF AN ACCIDENT.  I WAS LOOKING ON THIS WEBSITE AND THERE IS A SIMILIAR ISSUE TO MINE LISTED - 2013 LANDROVER LR2 - WHEN QUESTIONED ABOUT IT THEY STATED THAT MY VIN # IS NOT INCLUDED IN THE RECALL.",
        "vin": "SALFR2BG3DH"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873089,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VACUUM PUMP FAILED CAUSING NO BOOST FROM THE BRAKE BOOSTER, COMPLETE LOSS OF VACUUM ASSISTANCE IN THE BRAKING SYSTEM. THIS CONDITION RESULTED IN HARD FEEL TO THE BRAKE PEDAL. VEHICLE BRAKING WAS VERY DIFFICULT, VEHICLE RAN THROUGH A RED LIGHT BEFORE COMING TO A COMPLETE STOP ON A CITY STREET. (SIMILAR LAND ROVER RECALL #P052)    NO COMMUNICATION AVAILABLE WITH OCCUPANCY SENSOR CONTROL MODULE, AIR BAG LIGHT STUCK ON AND APPARENTLY MAY OR MAY NOT BE WORKING. MY DEALER IS TRYING TO MAKE ME PAY FOR THIS REPAIR. (SIMILAR LAND ROVER RECALL #P052)",
        "vin": "SALFR2BG6DH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "09/02/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861922,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 LR2 BASE MODEL LURCHED AND ENGINE RPMS SURGED FOR NO REASON WHILE DRIVING IT ALSO DIES AT SLOW SPEEDS, AND DELAYED CRANKING.  HAD IRREGULAR FUEL PRESSURE READINGS, SUSPECTED FAULTY FUEL PRESSURE SENSORS.  AFTER SENSOR WAS REPLACED, STILL HAD TROUBLE AND LAND ROVER ENDED UP REPLACING MY ENGINE AT 51000 MILES, ON A CAR THAT WAS 2 YEARS OLD.  SERVICE NOTES ALSO SAY,\" B OPEN CAMP Q511 CAMP CAMPAIGN PARTS # 45835 RECALL DELAYED AT THIS TIME?  NOT SURE WHAT THAT MEANS?  NOW, MY SUV VALUE IS DIMINISHED BECAUSE IT'S \"TRUE MILES UNKNOWN\" ON CARFAX, AND THE AXEL BOOT BROKE...WHAT IS NEXT?",
        "vin": "SALFR2BG9DH"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "12/05/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676520,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE ENGINE LIGHT, STABILITY CONTROL, AND AIRBAG LIGHTS CAME ON CAUSING VEHICLE TO GO INTO \"LIMP MODE\"  WITH DECREASED POWER OF ENGINE. DUE TO THE UNEXPECTED NATURE OF THE EVENT, COULD HAVE CAUSED AN ACCIDENT WITH NO CAPABILITY OF SAFETY EQUIPMENT TO DEPLOY (I.E AIRBAGS). THIS HAPPENED A FEW MORE TIMES UNTIL VEHICLE IN FOR REPAIR. ON FIRST EVENT, REPAIR SHOP STATED OKAY TO DRIVE AS LONG AS ENGINE LIGHT WAS AMBER AND NOT FLASHING. VEHICLE REMAINS AT REPAIR SHOP >30 DAYS WITH NO FIX FOUND AS OF THIS TIME.   *TR",
        "vin": "SALFR2BG0DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574565,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "LR2",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE ACCELERATES IN A FORWARD LURCHING MOTION. THIS UNCONTROLLABLE, SUDDEN, AND SPASMODIC THRUST AHEAD IS DANGEROUS AND IN TRAFFIC COULD/WILL CAUSE THE VEHICLE TO SMASH INTO ANOTHER CAR OR PERSON; I HAVE HAD SEVERAL SCARY, CLOSE ENCOUNTERS. THE PROBLEM SEEM TO BE IN THE ENGINE'S SOFTWARE. WHEN ACCELERATION IS CALLED FOR THE TURBO CHARGER SLAMS INTO ACTION, ROUGHLY PUSHING THE CAR AHEAD. THE TURBO CHARGER'S CONTROLLING SOFTWARE NEEDS TO BE REDESIGNED (DE-TUNED) TO ASSURE THAT ANY DRIVER WHO PRESSES DOWN THE GAS PEDAL WILL GET A SMOOTH AND STEADY INCREASE IN SPEED, NOT AN UNPREDICTABLE, UNSAFE THRUST FORWARD.",
        "vin": "SALFR2BG0DH"
    }
]