[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1990 FORD F-250. THE CONTACT STATED WHILE DRIVING 50 MPH, THE CONTACT SWITCHED FROM THE FRONT FUEL TANK TO THE REAR FUEL TANK WHICH CAUSED THE REAR FUEL GAUGE TO READ EMPTY. THE CONTACT STATED AFTER FILLING THE REAR GAS TANK, GASOLINE STARTED LEAKING FROM THE FRONT TANK WITHOUT WARNING. THE CONTACT IMMEDIATELY SHUT-OFF THE VEHICLE TO PREVENT A POTENTIAL FIRE HAZARD. UPON INVESTIGATION, THE CONTACT DISCOVERED NHTSA CAMPAIGN NUMBER: 93V125000 (FUEL SYSTEM, GASOLINE) WHICH HE LINKED TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT UNDER RECALL. NO FURTHER ASSISTANCE WAS PROVIDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 143,000.",
        "vin": "1FTHF26H8LK"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "12/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE I HAVE BEEN TRAVELING DOWN A STREET I TRAVEL OFTEN WHEN OUT OF NO WHERE A VIOLENT SHAKING HAS OCCURRED IN THE STEERING WHEEL OF MY TRUCK, AS WELL AS THE ENTIRE FRONT END OF THE TRUCK. THIS VIOLENT SHAKING, I HAVE BEEN TOLD, IS CALLED A DEATH WOBBLE AND VERY NEARLY SENT ME HEAD ON INTO ANOTHER CAR. AFTER THE FIRST TIME THE TRUCK BEGAN SHAKING I CRAWLED UNDER THE TRUCK AND TIGHTENED THE BOLTS THAT HOLD EACH SIDE OF THE INDEPENDENT FRONT SUSPENSION BECAUSE A COUPLE WERE MISSING AND THE OTHERS HAD LOOSENED. THE SECOND TIME THE SHAKING OCCURRED IT FELT AS IF IT BROKE BELTS IN MY TIRES AND NO LONGER RIDES SMOOTH. I CHECKED UNDER THE TRUCK TODAY AND THE SHAKING HAS ALSO BROKEN THE STEERING STABILIZER OFF OF THE FRONT AXLE OF MY TRUCK.  AFTER LOOKING AT RECALLS TODAY, IT APPEARS THAT THERE IS A RECALL FOR A 1989 F-250 FOR FRONT END COMPONENTS, BUT NO SUCH LUCK WITH MY TRUCK ALTHOUGH, TO THE BEST OF MY KNOWLEDGE, THEY HAVE THE SAME FRONT AXLE AND STEERING COMPONENTS. IT WOULD BE NICE TO HEAR BACK FROM SOMEONE FROM FORD REGARDING ANY RECALLS THAT WOULD COVER FRONT END STEERING AND SUSPENSION COMPONENTS OF MY TRUCK.  *TR",
        "vin": "1FTHF26M8LN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2013",
        "dateOfIncident": "04/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510788,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1990 FORD F250. THE CONTACT STATED THAT ONE OF THE FUEL TANKS FAILED AND CAUSED GASOLINE TO OVERFLOW INTO THE SECOND TANK. RESULTING IN A  FUEL LEAK. THE VEHICLE WAS TAKEN TO A MECHANIC FOR INSPECTION. THE FAILURE WAS LOCATED AT THE FUEL CAP. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 127,586.",
        "vin": "1FTHX26G4LK"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/23/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441814,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1990 FORD F-250. THE CONTACT STATED THAT A DAYS AFTER SWITCHING ONE OF THE FUEL TANKS, FUEL STARTED TO SPEW OUT OF THE FILLER NECK. THE CONTACT STATED THAT ONCE THE CAP WAS RELEASE AND THE ENGINE WAS TURNED OFF, THE FUEL SPILL COULD BE STOPPED. THE VEHICLE WAS TOWED TO THE DEALER WHO DIAGNOSED THAT THE RETURN VALVE WAS STUCK BETWEEN THE TANKS, WHICH CAUSED FUEL TO ENTER THE SECOND TANK AND OVERFLOW. AS A RESULT THE FUEL PUMP FAILURE, THE JUMPER AND THE ROLL-OVER VALVES NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 93V125000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY). THE VEHICLE WAS REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 116,105.",
        "vin": "1FTHX25G3LK"
    }
]