[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A BAD EXPERIENCE TO MY CAR 2013 LEXUS GX460. I WAS DRIVING ON THE HIGHWAY AND MY CAR LOST CONTROL. I EXPERIENCED A LOSS IN POWER AND ACCELERATION, A DECREASE IN FUEL EFFICIENCY. I HAD TO TOW MY CAR TO THE SHOP AND TURNED OUT THE FUEL PUMP WAS MALFUNCTION THAT NEED TO BE REPLACED. I WAS SO DISAPPOINTED IT SINCE MY CAR IS KIND A NEW AND IT ONLY HAD AROUND 100K MILES ON IT AT THAT TIME. AND I JUST BOUGHT IT FROM A LEXUS DEALERSHIP 2 YEARS AGO. I THOUGHT LEXUS PARTS LAST LONGER THAN THAT? I HAD TO PAY OUT OF POCKET TO FIX THE ISSUE.   AND THEN AFTER 5 MONTHS DRIVING AS NORMAL, THE SIMILAR INCIDENT HAPPENED AGAIN, THIS TIME THE FUEL SENSOR (SENDING) WAS BAD THAT I HAD TO  REPLACE..    I WAS SO DISAPPOINTED WITH THIS. IT BROUGHT ME TO A RISK WHEN IT HAPPENED ON HIGHWAY, TWICE IN THE SAME YEAR. I HOPE LEXUS SHOULD RECALL THIS SO SOMEONE ELSE SHOULD NOT RUN TO THIS SITUATION LIKE ME.  *TR",
        "vin": "JTJJM7FX5D5"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306766,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BUMPER DETACHES FROM BODY, THE MANUFACTURER HAS NOT OFFERED ANY REMEDY. I HAVE SEEN THIS ON MULTIPLE VEHICLES OF THE SAME MAKE AND MODEL.",
        "vin": "JTJJM7FX1D5"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/19/2013",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544464,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I84W IN IDAHO AT 65 MPH AND TOWING A 2013 AIRSTREAM 23D TRAILER THE MIRROR ON THE DRIVERS SIDE FOLDED BACK WHILE DRIVING DUE TO THE WIND CAUSING LOSS OF VISIBILITY TO THE LEFT REAR AND WE COULD NOT SEE VEHICLES APPROACHING TO OVERTAKE US.  THE LEXUS IS EQUIPPED WITH FACTORY INSTALLED TOWING PACKAGE.  AS THE AIRSTREAM TRAILER IS WIDER THAN THE LEXUS TOWING MIRRORS ARE REQUIRED BY LAW.  LEXUS DOES NOT MAKE OR RECOMMEND ANY PARTICULAR TOWING MIRROR.  WE WERE USING THE FIT SYSTEM 3891 DELUXE UNIVERSAL CLIP-ON TRAILER TOWING MIRROR.  WE STOPPED AT THE FIRST OPPORTUNITY AND UNFOLDED THE MIRROR. THE SAME MIRROR FOLDED BACK SEVERAL MORE TIMES WHILE DRIVING WEST ON I84. THE WEATHER WAS GOOD WITHOUT ANY UNUSUAL WIND CONDITIONS. WE HAD NO PROBLEM WITH THE PASSENGER SIDE MIRROR WHICH HAD THE SAME MODEL FIT TOWING MIRROR.    KUNI LEXIS OF PORTLAND TOLD ME THERE WAS NOTHING WRONG WITH MY MIRROR AND THEY HAD NO SOLUTION TO OFFER ME.  AS THE LEXUS GX IS EQUIPPED AND SOLD AS A VEHICLE THAT CAN TOW I BELIEVE IT SHOULD ACCEPT TOWING MIRRORS WHICH ARE REQUIRED BY LAW WHEN TOWED TRAILER IS WIDER THAN THE TOW VEHICLE.  *TR",
        "vin": "JTJBM7FX1D5"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/11/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524489,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE 2013 LEXUS GX460 ON 5-31-13.  AFTER DRIVING IT FOR A DAY, IT SEEMED AS IF I HAD A FLAT TIRE ON THE FRONT PASSENGER SIDE BECAUSE THE HOOD SEEMED LOWER ON THE PASSENGER SIDE AS I WAS DRIVING. I PULLED OVER TO CHECK AND EVERYTHING SEEMED FINE.  LATER AS MY VEHICLE WAS PARKED IN MY GARAGE I NOTICED STANDING FROM BEHIND THAT THE PASSENGER SIDE WAS INDEED LOWER THAN THE DRIVER SIDE.  MY HUSBAND MEASURED IT TO MAKE SURE AND IT WAS ONE INCH LOWER ON THE PASSENGER SIDE.  WE TOOK THE CAR IN TO SERVICE AND THEY KEPT IT FOR THREE DAYS.  THEY RETURNED IT TO US IN THE EXACT SAME CONDITION.  I TOOK IT BACK A SECOND TIME TO EXPLAIN THAT THEY MUST FIX THE PROBLEM.  THE CAR IS LOPSIDED AND FEELS UNSAFE TO DRIVE.  I FEEL AS IF I AM GOING TO FLIP OVER ON RIGHT TURNS.  THEY TOLD ME THE BODY IS LOPSIDED BUT THE UNDERCARRIAGE MEASUREMENTS SHOW 3/4 OF AN INCH DIFFERENCE AND THAT IT IS NOT A PROBLEM.  I AM HOPING THAT SOMEBODY WILL LOOK INTO THIS.  IT SEEMS ODD TO ME THAT I WOULD BUY A BRAND NEW CAR AND HAVE TO SETTLE WITH DRIVING IT LOPSIDED.  I DON'T THINK THAT IT IS SAFE.  I KNOW IT IS DEFINITELY UNCOMFORTABLE.  I AM CONSTANTLY LEANING TO THE LEFT AS I DRIVE TO AVOID THE GRAVITATIONAL PULL TO THE RIGHT. THIS CANNOT BE RIGHT.  OH AND BY THE WAY THE SERVICE MANAGER TOLD ME THIS IS AN ONGOING PROBLEM THEY HAVE WITH THE GX.  WE ARE NOT THE FIRST ONES TO COMPLAIN ABOUT THIS PROBLEM.   HOPING THERE IS SOMEWAY YOU CAN LOOK INTO THIS.  I HOPE THEY CAN FIX IT.  IF NOT, I DO EXPECT A FULL REFUND.  *TR",
        "vin": "JTJJM7FX8D5"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523351,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS SOLD AS A 4 WHEEL DRIVE WITH OFF ROAD CAPABILITIES, BUT DOES NOT COME EQUIPPED WITH THE PROPER TIRES. LEXUS TRIED TO CUT COSTS BY PROVIDING TIRES MADE FOR CITY STREETS. WHEN I TRAVEL ON POORLY MAINTAINED SOFT-SAND[DIRT] ROADS THE VEHICLE IS DIFFICULT TO CONTROL BECAUSE THE TIRES DO NOT HAVE THE PROPER TREAD  FOR THE INTENDED USE. I HAVE HAD SEVERAL ALMOST ACCIDENTS AND I KNOW IT IS ONLY A MATTER OF TIME BEFORE I HAVE AN ACCIDENT. I DO NOT FEEL THAT I SHOULD HAVE TO BUY NEW TIRES. THE DEALER DOESN'T SEEM TO CARE SO I CONTACTED LEXUS OF NORTH AMERICA BY CERTIFIED MAIL AND INFORMED THEM I WILL BE HOLDING THEM RESPONSIBLE  FOR ANY ACCIDENTS CAUSED BY IMPROPER TIRES. I HAVE NOT HEARD BACK FROM THEM.  MY PREVIOUS CAR WAS A 2006[SAME MODEL] THAT CAME WITH OFF-ROAD TIRES AND I HAD NO SAFETY ISSUES.  I AM SURE THERE HAVE BEEN QUITE A FEW ACCIDENTS CAUSED BY SELLING OFF ROAD VEHICLES WITHOUT THE PROPER TIRES  BUT AS MOST OF THESE ACCIDENTS ARE \"ONE CAR ACCIDENTS' GENERALLY AT VERY LOW SPEEDS THERE ARE MOST LIKELY NO STATISTICS TO BE HAD.    THANK YOU FOR OUR SAFETY CONCERNS.  *TR",
        "vin": "JTJBM7FX7D5"
    }
]