[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459695,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The gas indicator illuminates even with gas in the vehicle. The gas usage is being used at a fast rate.",
        "vin": "SALSF2D42DA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457130,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover Range Rover Sport. The contact received notification of NHTSA Campaign Number: 21V635000 (Fuel System, Gasoline) however, the part to do the recall repair was unavailable. The local dealer was contacted and it was confirmed that the part was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. The VIN information was not available.",
        "vin": "SALSF2D49DA"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454062,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'm not sure how to explain but, there's so much going on with the vehicle.  I purchased the vehicle as is but, was told they did an inspection and it was cleared.  I was told that the brakes was brand new because, we heard squeaking.  We took the vehicle for a diagnostic test because of the brakes. We got a quote for over 6114.00.  What!! Brakes, suspension, hub, Wheel barren, Wheel aligment.  What?? I just got this vehicle August 10, 2021 and this was November when this came up.  We only had the brakes done which we paid over 1,000 and we were going to do the rest at another time. We begin having problems with the brakes and vehicle shaking bad when you drive up to 60 mph. We called them, they had no loaner car until February 18, 2022.  We were told it'll be safe to drive until then. Took the vehicle in and still having brake problems and now they said, we definetly need to get suspension done because, it could possibly be the Hub and they want to do another diagnostics.  So much wrong with vehicle. I asked about the recall because, I noticed something leaking from the back was told they will check it out but, if they don't see anything they don't have to fix it.. I told them there's a recall on it and it need to fix it but, they are refusing to fix it because, it was an AS IS VEHICLE.",
        "vin": "SALSK2D45DA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441307,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover Range Rover Sport. The contact stated that upon starting the vehicle, the check engine warning light illuminated, and she smelled a strong gasoline odor. The contact stated that she also noticed gasoline leaking underneath the vehicle. The vehicle was taken to an independent mechanic who diagnosed that the fuel tank assembly was cracked. The contact received notification of NHTSA Campaign Number: 21V635000 (Fuel System, Gasoline) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the failure had reoccurred several times while driving and she had stopped driving the vehicle. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the failure and advised the contact to wait for the second letter. The approximate failure mileage was 78,131.",
        "vin": "SALSK2D42DA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/25/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438083,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover Range Rover Sport. The contact stated while driving at various speeds, the fuel tank would make abnormal sounds. The warning message \"Check Gas Fuel Tank head cap\" illuminated. The contact also stated that the vehicle would stall inadvertently while driving with the check engine warning light illuminated. The vehicle was taken to the dealer who informed the contact that they could not determine the cause of the failure. The contact stated that the fuel tank head cap was replaced however, the failure had been reoccurring while driving. The contact stated he received a recall notification for NHTSA Campaign Number: 21V635000 (Fuel System, Gasoline) however, parts for the recall repair were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the failure. The vehicle was diagnosed but not repaired. The approximate failure mileage was 70,000.",
        "vin": "SALSK2D46DA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437831,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover Range Rover Sport. The contact stated that the brake fluid warning light was illuminated. The contact stated that while having routine maintenance performed at the local dealer, she was informed that the brake line was cracked. The vehicle was not repaired. The manufacturer was not contacted. The failure mileage was approximately 86,000.",
        "vin": "SALSF2D40DA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437647,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Land Rover Range Rover Sport. The contact stated that after entering the vehicle and attempting to start the vehicle, the vehicle failed to start up. The contact stated that there were several unknown warning lights illuminated. The contact had the vehicle towed to the residence. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 139,000.",
        "vin": "salsf2d4xda"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394436,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LAND ROVER RANGE ROVER. THE CONTACT STATED WHILE DRIVING 10 MPH, THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER LAND ROVER NORTH ATLANTA (1505 MANSELL RD, ALPHARETTA, GA 30009, (770) 587-2000) WHERE IT WAS DIAGNOSED WITH NEEDING THE WIRING HARNESS FOR THE FRONT PASSENGER?S SIDE AIR BAGS TO BE REPLACED. THE VEHICLE HAD BEEN REPAIRED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 13V607000 (AIR BAGS) HOWEVER, THE DEALER STATED THE RECALL REPAIR WAS ALREADY COMPLETED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 78,000. *BF  CONSUMER STATED WIRING HARNESS WAS REPLACED.*JB",
        "vin": "SALGS2EF2DA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360477,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL FLANGE AT THE TOP OF MY FUEL TANK CRACKED AND WAS LEAKING GAS FUMES. THE DEALER STATED THAT THIS IS A COMMON PROBLEM THAT THEY ARE SEEING. IF I PARKED NEXT TO A FLAME SOURCE (WATER HEATER, FURNACE, ETC) THIS COULD BE A POTENTIAL SAFETY PROBLEM ALONG WITH THE ENVIRONMENTAL PROBLEM OF THE FUMES ESCAPING INTO THE ATMOSPHERE.",
        "vin": "SALSK2D40DA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353880,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR DOES NOT UNLOCK UNLESS OPENED FROM THE INSIDE; OR FRONT PASSENGER DOOR DOES NOT LOCK. BOTH ISSUES HAVE BEEN ONGOING AND HAS BEEN \"FIXED\" BY LAND ROVER 3 TIMES.    THERE HAVE BEEN OTHER ELECTRICAL FAILURES INCLUDING THE AUTOMATIC LIFTGATE NOT WORKING IN THE PAST.",
        "vin": "SALGS2EF5DA"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302676,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN SUPERMARKET PARKING LOT, ABOUT TO PUT THE CAR IN PARK AND CAR ACCELARATED WITH FULL FORCE ON ITS OWN ONTO A FENCE IN FRONT OF PARKING SPACE.",
        "vin": "SALSF2D40DA"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/28/2019",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258715,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A CITY STREET MY ENTIRE STEERING WHEEL CAME LOOSE AND DETACHED FROM THE VEHICLE.",
        "vin": "SALGS2EFXDA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231005,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT THE BRAKE LIGHTS ILLUMINATED ON THE VEHICLE WHEN THE BRAKE PEDAL WAS NOT DEPRESSED. THE VEHICLE WAS INCLUDED IN AN UNKNOWN RECALL, BUT THE REMEDY WAS NOT AVAILABLE. JAGUAR DALLAS (11400 N CENTRAL EXPY, DALLAS, TX 75243, 214-691-42944) WAS CONTACTED AND WAS INFORMED THAT THE ONLY RECALL WAS FOR THE DOOR LATCH. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 69,000.",
        "vin": "SALGS2DF2DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207883,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LAND ROVER RANGE ROVER SPORT. WHILE ATTEMPTING TO PARK THE VEHICLE IN THE DRIVEWAY, THE VEHICLE DID NOT RESPOND WHEN THE BRAKE PEDAL WAS DEPRESSED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT SHIFTED INTO PARK AND TURNED OFF THE VEHICLE IN ORDER TO STOP. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 8000635255. THE APPROXIMATE FAILURE MILEAGE WAS 71,000.",
        "vin": "SALSH2E41DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2019",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192765,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 50234 MILEAGE IN MY VEHICLE AND MY TURBO WENT OUT I TOOK IT THE DELLER SHOP AND THEY DON'T COVER OR GIVE ME ANY KIND OFF DISCOUNT IF I NEW FROM THE BEGINNING I WELL NOT GONNA BY THIS CAR. I THOUGHT THIS CAR IS SUPPORT TO BE RELIABLE CAR I WANT SOME ONE TO ANSWER THIS FOR ME OR I WELL TAKE FATHER ACTION ASAP..",
        "vin": "SALVR2BG7DH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180838,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING  AND I GOT A MESSAGE SAYING ABS INACTIVE NO STABILITY CONTROL THIS HAPPEND 2 TIMES ALREADY IN THE PAST MONTH",
        "vin": "SALGSDFXDA1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162259,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TAILGATE LATCH UNLOCKS BY ITSELF AND THE TAILGATE OPENS BY ITSELF WITHOUT A KEY OR PERSON PRESSING OPEN BUTTON.  NHTSA CAMPAIGN ID NUMBER:  15V385000  NHTSA ACTION NUMBER:  N/A  COMPONENT:  LATCHES/LOCKS/LINKAGES  POTENTIAL NUMBER OF UNITS AFFECTED:  65,352  THE CAR IS PARKED, ENGINE OFF. LAND ROVER STATES MY VIN IS NOT LISTED, YET THIS VERY DANGEROUS SITUATION AFFECTS MY VEHICLE. ITEMS COULD FALL OUT OF A MOVING VEHICLE CAUSING ROADWAY HAZARDS.  SUMMARY:   JAGUAR LAND ROVER NORTH AMERICA, LLC (LAND ROVER) IS RECALLING CERTAIN MODEL YEAR 2013-2016 RANGE ROVER VEHICLES MANUFACTURED JULY 26, 2012, TO MARCH 9, 2015, AND 2014-2016 RANGE ROVER SPORT VEHICLES MANUFACTURED FEBRUARY 18, 2013, TO MARCH 5, 2015. IN THE AFFECTED VEHICLES, THE DOORS MAY UNLATCH UNEXPECTEDLY WHEN CLOSED.  CONSEQUENCE:  IF A VEHICLE DOOR UNLATCHES, THE DISTRACTION MAY INCREASE THE RISK OF A CRASH AND/OR A VEHICLE OCCUPANT MAY FALL OUT OF THE VEHICLE IF THEY ARE NOT WEARING A SEATBELT, INCREASING THEIR RISK OF INJURY.  REMEDY:  LAND ROVER WILL NOTIFY OWNERS, AND DEALERS WILL UPDATE THE KEYLESS ENTRY SOFTWARE, FREE OF CHARGE. THE RECALL IS EXPECTED TO BEGIN AUGUST 7, 2015. OWNERS MAY CONTACT LAND ROVER CUSTOMER SERVICE AT 1-800-637-6837. LAND ROVER'S NUMBER FOR THIS RECALL IS P068.",
        "vin": "SALSK2D4XDA"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138980,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 LAND ROVER RANGE ROVER SUPERCHARGE.    WHILE DRIVING AT ALL SPEEDS AND I HAVE A FRONT PASSENGER THE VEHICLE LIGHT HAS COME ON ADVISING THE FRONT PASSENGER AIR BAGS ARE DISABLED.    I HAVE CONTACTED LAND ROVER REGARDING A RECALL ISSUES NHTSA CAMPAIGN NUMBER: 15V093000 BUT THEY ADVISED MY VIN NUMBER DOES NOT APPLY TO THIS RECALL, ALTHOUGH IT IS THE EXACT SAME ISSUE.      PICTURE ATTACHED WAS TAKEN WHILE DRIVING 50 MILES PER HOUR WITH FRONT PASSENGER SEATED.",
        "vin": "SALGS2EF5DA"
    },
    {
        "components": "AIR BAGS,LATCHES/LOCKS/LINKAGES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113525,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT THE FRONT PASSENGER DOOR DID NOT LOCK. THE VEHICLE WAS TAKEN TO THE DEALER (LAND ROVER ALEXANDRIA, 2712 DUKE STREET, ALEXANDRIA, VA, 22314) WHERE IT WAS AWAITING DIAGNOSTIC TESTING. THE CONTACT ALSO MENTIONED THAT THE AIR BAGS AND CHECK ENGINE WARNING INDICATORS WERE ILLUMINATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.",
        "vin": "SALGS2EF3DA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113150,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON PHOENIX CITY STREET 51ST AVENUE GOING SOUTH AT 5:00 PM IN AFTERNOON.  FAILURE OF A ENGINE/COOLING SYSTEM OUTLET PIPE LED TO EXPULSION OF ALL COOLANT, OVERHEATING OF THE ENGINE TO ITS SHUTDOWN WITHIN THREE MINUTES, THE ENGINE GOT SO HOT IT RUPTURED A FUEL LINE OVER THE ENGINE SPRAYING THE ENGINE COMPARTMENT WITH GASOLINE.  UNAWARE OF THE FUEL LEAK I ATTEMPTED TO RE START THE VEHICLE TO MOVE IT INTO A NEARBY PARKING LOT.  I EVENTUALLY RESTARTED IT AND I LIMPED IT INTO THE PARKING LOT WHERE IT CONTINUED TO LEAK FUEL.    THE ENGINE WAS BLOWN FROM THE OVERHEATING AND REQUIRES A COMPLETE REBUILD OR REPLACEMENT AT $15K TO $35K IN COST.  THE LANDROVER SERVICE DIRECTOR ROBERT LYLER, CONFIRMED THAT FAILURE OF THE OUTLET PIPE IS COMMON.  IT OCCURS RANDOMLY AND WITHOUT NOTICE OR ANY SIGNS OF FATIGUE OR WEAR. IT'S FAILURE IS ALWAYS A MASSIVE RUPTURE, NEVER JUST A LEAK OR SMALL SPRAY.  I RECEIVED ONLY A 5 SECOND WARNING THAT THE COOLANT WAS LOW.  NO OTHER WARNING LIGHTS APPEARED AND THE TEMPERATURE GUAGE NEVER SHOWED THE HIGH TEMPERATURE OR OVERHEATING.      MY FAMILY AND I ARE LUCKY THAT THE ENGINE DID NOT CATCH FIRE AND THE FIRE FOLLOW THE FUEL LINE TO THE GAS TANK ENDING IN AN EXPLOSION.  THE VEHICLE IS NOW AT THE LANDROVER NORTH SCOTTSDALE DEALERSHIP.  IT HAS NOT BEEN REPAIRED.  THE EXTENDED WARRANTY COMPANY REFUSED TO PAY SAYING THAT THE PART WAS A WEAR AND TEAR/MAINTENANCE ITEM AND I HAVE FILED A CLAIM WITH LAND ROVER CORPORATE BUT HAVE RECEIVED NO RESPONSE AS OF THIS CLAIM.    PLEASE SEE ATTACHED DOCUMENT FOR A MORE DETAILED DESCRIPTION OF THE INCIDENT.",
        "vin": "SALSK2D49DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080092,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKE FAILED WHILE DRIVING. NO WARNING LIGHT OR ANY SYMPTOM PRESENT. FORTUNATELY NO ACCIDENT RESULTED. REASON WAS BECAUSE EMERGENCY BRAKE WAS LOCKED ON THE ENTIRE TIME WITHOUT KNOWING AND BECAME NON-FUNCTIONAL. DAMAGED MOST WHEEL COMPONENTS ON REAR DRIVER SIDE.   DIAGNOSIS: MALFUNCTIONED EMERGENCY BRAKE ACTUATOR.   VERY COMMON PROBLEM WITH THIS MODEL CAR.   THIS SHOULD NOT HAPPEN.",
        "vin": "SALSK2D47DA"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11063690,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS HAD FOUR CLAIMS WITH RANGE ROVER WHERE THE CAR SUDDENLY STOP WHILE  DRIVING . AGAIN MY CAR CAME OUT OF GEAR WHEN I USED THE KEYLESS REMOTE THE CAR BEGIN TO SUDDENLY ROLLLED.  UPON ME TRYING TO STOP THE CAR FOR HARMING OTHERS I WAS INJURED.  I HAVE MADE RANGE ROVER AWARE OF THE UNSAFE CONDITIONS OF THE CAR BUT THEY ARE REFUSING TO ACKNOWKEGE IT.  I HAVE POLICE RECORDS AND DOCUMENTATION .  I JUST WANT THE CAR REPAIRED SO THAT IT'S SAFE TO DRIVE FOR ME AND MY FAMILY TO RIDE IN.",
        "vin": "SALSK2D47DA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052884,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AS ORIGINAL OWNER OF THE RANGEROVER, DURING MY SECOND YEAR OF OWNERSHIP THE FUEL INJECTORS GAVE WAY WHERE THE GAS WOULD NOT FLOW TO THE TANK. THE GAS PUMP WOULD CONSISTENTLY SHUTOFF THE GAS TO THE POINT YOU COULD NOT FILL O YOUR TANK. I WAS UNDER WARRANTY AT THIS POINT AND IT WAS FIXED BY THE DEALERSHIP. ALMOST TWO YEARS LATER , APPX 1.75 YEARS LATER, THE FUEL INJECTOR IS CAUSING THE SAME ISSUE. WHEN TRYING TO GAS UP, THE INJECTOR OR THE SYSTEM ITSELF DOESN'T ALLOW THE GAS TO AUTO FILL UP. ALSO WHEN MANUALLY PUMPING FOR GAS THE INJECTOR KEEPS SHUTTING THE GAS FLOW OFF. THIS WOULD BE THE THIRD INSTALLATION OF THE INJECTOR AND OR ITS RELATED COMPONENTS. FIRST WAS OEM , THEN MY FIRST REPLACEMENT, NOW THIS THIRD REPLACEMENT IS REQUIRED.  RANGEROVER AND ITS AFFILIATES ARE NOT TAKING THE STEPS TO REPALCE MY EXPENSIVE REPAIR NOT WILL THEY BACKUP THERE WORK.",
        "vin": "SALSK2D49DA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044915,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS HEAVING, SEPARATING AND EXPOSING THE AIRBAG ON PASSENGER SIDE.  DEALER CANNOT REPAIR BUT SAID THAT IF THE SEPARATION BECOMES LARGER THE AIRBAG MAY NOT DEPLOY IN THE PROPER DIRECTION OR MAY DEPLOY UNNECESSARILY.  DEALER RECOMMENDED ENTIRE DASHBOARD REPLACEMENT FOR $3600.  THE SEPARATION IS OF COURSE GETTING BIGGER EVERY DAY AN POSES A SAFETY RISK. THE ATTACHED PICTURE WAS TAKEN SEVERAL WEEKS AGO AND THE SEPARATION IS NOW MUCH LARGER.",
        "vin": "SALSK2D45DA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/18/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898284,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MATTER IS BEING REPORTED AS A POTENTIAL HIGHWAY HAZARD REGARDING A \"TOW HITCH\" PART # KNB 500023,PART # WAS REPLACED THREE TIMES BY LAND ROVER. THEY HAVE DEFECTIVE \"TRIGGER\" OR LIKE A \"DOOR STRICKER\" PINS THAT THE TIPS BREAK OFF, WHEN USED ACCORDING TO THE OWNERS MANUALS, TO INSERT TOW HITCH AND FIRMLY PUSH UP TO LOCK TOW HITCH RECEIVER IN PLACE IN CROSS MEMBER SUB BUMPER.    IF NOT PROPERLY INSTALLED DUE TO PIN BREAKING TIP OFF, THE TOW HITCH RECEIVER DOES NOT COMPLETELY LOCKUP AND CAN FALL OFF WHEN THE CLASS III TOW BAR/BALL/TRAILERED VEHICLE IS BEING TOWED ON PUBLIC ROADWAYS..    LAND ROVER, UK HAS ISSUED A RECALL IN ENGLAND, BUT NO RECALL HAS BEEN MADE IN USA.. DUE TO FAILURE TO COMPLETE LOCK UP AS INDICATED IN OWNER MANUAL, VEHICLE CANNOT PERFORM AS AN ADVERTIZED TOW VEHICLE CAPABLE OF TOWING TRAILERS UP TO 7700# WITH A TONGUE WEIGHT OF #550.    EBAY HAS MANY USED PARTS LISTED AS KNB500023, KNB500080, LR 019990, WHICH HAS NOW A SHORTER SHAFT, WITH 15\" GROUND CLEARANCE. LR SELL THE 4 PARTS (2005-2013) UP TO 2013, SINCE THEY COMPLETELY REDESIGNED THE RECEIVER TO A MORE CONVENTIONAL SYSTEM  IN 2014 ON THE RANGE ROVER SPORT, NOT THE TWO PIECE OLDER SYSTEM USED FROM 2005-2013 ON RANGE ROVER SPORTS, LR 3 AND LR4.    WE HAVE CONTACTED OVER THE LAST TWO WEEKS JAGUAR LAND ROVER, IN NJ TO NO AVAILE, THEY REFUSE TO PUT ANYTHING IN WRITTING. TOMORROW I AM BRING THE DEFECTIVE TOW HITCH IN UNDER AN EXTENDED WARRANTEE/PROTECTION PLAN FOR REPLACEMENT.    WE ASK JLR IF THE PARTS, WHICH HAVE SEPERATE SERIAL NUMBERS, WERE RECALLED AND THEY HAVE NO RECORDS. THE PART IS FABRICATED IN INDIA, AND EXPORTED TO UK, THEN TO USA.    PLEASE INVESTIGATE THIS MATTER..    THIS PART FAILED WHILE STATIONARY, SINCE IT FAILED TO PROPERLY ENGAGE THE LOCKING SYSTEM (GREEN LR/ORANGE KEY IS REMOVED WHEN LOCKED PROPERLY)",
        "vin": "SALSF2D48DA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/18/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896833,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LAND ROVER PART # KNB 500023, LISTED AS KNB 500080 IN THE RANGE ROVER KIT ACCESSORY BOOKLET IS FOR A TOW HITCH, THAT HAS A HIGH FAILURE RATE. FILED CASE WITH LAND ROVER AND THEY REFUSE TO CORRECT PART UNDER THEIR LAND ROVER PROTECTION PLAN IN FORCE. THE UNIQUE PART MALE END IS INSERTED INTO A FEMALE INTEGRATED PART OF THE CHASSI AND TOGETHER FORMS A 2\" X 2\" CLASS III CAPABLE OF TOWNING 77016 # WITH A TONGUE WEIGHT OF 550# AS IMPRINTED OR FORGED ON THE LAND ROVER PART.    THERE ARE CASES ON RECORD IN OTHER COUNTRIES THAT THERE IS A HIGH DEGREE OF FAILURE RATE WHEN THE VEHICLE IS TOWING TRAILERS ACCORDING TO THE MANUFACTURE SPECIFICATION. SO REPORT THAT THE LOCKING SYSTEM , DOES NOT LATCH FULL AND REPORTS OF THESE 5# PART WILL FALL OFF WHILE THE VEHICLE IS IN MOTION.    I HAVE HAD TWO FAILURE ON TOWING AND CONSIDER THIS A HIGHWAY SAFETY ISSUE SUBJECT TO IMMEDIATE RECALL.",
        "vin": "SALSF2D48DA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893842,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER SPORT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRADED IN 2013 FORD EXPLORER 2WD FOR 39K MILES RANGE ROVER SPORT FROM A MASERATI DEALER IN DAYTONA BEACH. THE SALESMAN PROMISED A INSPECTION REPORT AND WE TOOK FOR A TEST DRIVE ALONG I 95 SOUTHBOUND. I COMMENTED ON BRAKING AND MILD SHAKING OF STEERUNG WHEEL (JUDDERING). UPON RETURNING TO DEALER PARKING LOT, INSPECTED BRAKE PADS AND ROTOS VISABLY AND APPEAR TO BE AN ISSUE. I TRIED TO GET LAND ROVER DEALERS TO CHECK VEHICLE AND CALLED TWO FROM MASERATI DEALER, BUT HAD TO WAIT A WEEK TO GET IN. SO I TOOK THE RRS AND SIGNED A \"WE OWE YOU\" FORM. NEXT DAY THERE GM  AND SERVICE DEBT COULDNT HELP WITH BRAKES, SO I TRIED TO RETURN RRS, TO NO AVAIL. FINALLY TOOK TO LR OF ORLANDO AND FOUND WARPED ROTORS WERE THE ISSUE. CONTACTED MASERATI DEALER, NO HELP, HE WOULD NOT GIVE ME A COPY OF THW \"WE OWE YOU\" DEALER FORM. SENT COMPLAINT TO FL DMV COMPLAINT. NO HELP. TOOK RRS AFTER1100 MILES TO 2ND JLR DEALER IN NY, SAME ISSUE, WARPED ROTORS. MOST NOTICABLE WHEN APPLYIN BRALES OVER 65 MPH. JUDDING- SHIMMY. MASERATI DEALER PROVIDED A COPY OF AN RO A MONTH BEFORE SALE, SHOWING FRONT AND REAR ROTORS WERE MACHINED AND NEW PADS INSTALLED. OWNER DYE STATED THREE DAYS AFTER SALE, WHEN I SPOKE TO HIM ON BRAKES, HE SAID, THE NEW PADS WOULD WEAR IN. NOW 2 LR DEALERS WANT ANYWHERE FRON $700 TO $1300 TO REPLACE ROTORS. MASERATI DEALER REFUSES TO PAY UNDER 60DAY/3000 MILES LIMITED WRITTEN WARANTEE, AND TLOD ME IT WAS MY RIGHT TO GET AN ATTORNEY. THE WARP BRAKES CAN CAUSED AN ACCIDENT ON I 95 FL-NY IF THEY LOCK UP CALIBERS. HAD I4X4 FORD BRONCO ON A FRIDAY NITE. NO FUN, BUT SAFELY STOP AND GOT REPACED CALIBER/PADS/ROTOR. DOES ANYONE ELSE HAVE PROBLEMS WITH MASERATI DEALERS, CALLED MASERATI CUSTOMER CARE NO HELP!",
        "vin": "SALSF2D48DA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "11/08/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10892346,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS REVERSED OUT OF GARAGE AND VEHICLE WAS STOPPED WHEN EXITING THE VEHICLE. I PROCEEDED TO GO IN MY GARAGE AND TAKE GARBAGE OUT WHEN AFTER ABOUT 10 SECONDS VEHICLE WAS IN DRIVE HEADING TOWARDS ME CRUSHING ME AGAINST THE WALL PINNING ME UNTIL SOMEONE HEARD TO COME FREE THE VEHICLE. I WENT BY AMBULANCE TO HOSPITAL AND INCURRED OVER 22K IN MEDICAL BILLS.",
        "vin": "SALVN2BG9DH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10884136,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AUG 3, 2015 CAR DIAL SHIFTER PUT IN PARK, STOPPED ON MY 10% GRADE DRIVEWAY. CAR WAS ON! LEFT TO CHECK MAIL BOX WITH DOOR OPEN, NOTICED CAR WAS MOVING VERY SLOW. WENT BACK TO CAR TRIED TO REACH BRAKE, LEG WAS CAUGHT IN CAR AND SPEED PICKED UP EVIDENTLY IN REVERSE, FELL ON BACK, CAR DOOR ROLLED OVER ME WITH LEGS OVER HEAD. SNAPPED 5 HAMSTRING TENDONS, 2 AVULSION FRACTURES. I HAD REPORTED ON THIS SITE. NEVER HEARD BACK. NOW JEEP HAS A RECALL ON THE SAME TYPE OF COMPUTERIZED GEAR SHIFTER. ON CONSUMER AFFAIRS THERE IS ANOTHER RANGEROVER EVOQUE REPORTED GOING INTO REVERSE (BEFORE MINE DID)WHEN IN PARK WITH RUNNING AND DOOR OPEN. DRIVER WENT BACK TO GET CAR AND IT WAS UP STREET IN REVERSE AGAINST MAILBOX.",
        "vin": "SALVP2BG2DH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872515,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT PRE OWNER RANGE ROVER SPORT FROM A MASERATI OF DAYTONA (BEACH, FL) ON 5/6/16 , ON TEST DRIVE WITH SALES PERSON NOTED POOR BRAKES AND SHIMMY AT 65MPH. REQUESTING TECH INSPECTION REPORT AND NOTED ON\"WE OWE YOU\" DEALER FORM BRAKE ISSUE. ON 5/7 BROUGHT RRS BACK TO DEALER AND COMPLAINED. GM SAID CANT HELP!    ON 5/9/16 MEET WITH SERVICE PERSON ROBERT. HE FURNISHED RO # DOCS373198 DATED 5/6 SHOWING PRE SALE INSPECTION AND 7 JOBS PERFORMED. OIL TO LR SPECS. OK; HOWEVER, 4 WHEEL ALIGHNMENT NOT TO LR SPECS; NEW FRONT AND REEAR PADS AND NOTATION\" ROTORS MACHINED. LR DOESNT PERMIT MACHINING OF ROTORS, MUST BE REPLACED.    ON 5/1816 INSPECTED BY LAND ROVER OF ORLANDO , FL; BRAKES FAILED DUE TO WARPING AND HAD TO HAVE 4 ROTORS REPLACED. $1315 COST NOT UNDER LR 4 YEARS WARRANTEE; BUT MASERATI OF DAYTON GAVE 60DAY/3000 MILES AND ONLY 300 MILES DRIVEN TO FL LR.  .  ON 5/7/16 SEND REPAIR FACILITY CERTIFIED MAIL COMPLAINING ON BRAKES; ON 5/25/16 DROVE CAR TO NY LR OF HUNTINGTON, DUE TO WIFE HAVING APPOINTMENT IN CANCER HIOSPITAL IN NYC. 5/25/16 2ND LR DEALER REINSPECTED RRS AND ALSO FOUND ROTORS WARPED.    CONTATED JLR AND FINALLY GOT LR SPECS ON MAXIMUM RUN OUT (TEST FOR WARPED ROTORS) LR SPEC .002-005 MAXIMIUN. ACTUAL ON 5/18/16 MEASURED AT .006. WARPED ROTOR CASED IRRATIC BRAKING AND SHIMMOING/ JUDDER AT 65MPH BRAKING AND WITH NEW PADS NOT BRAKING PROPERLY AND FOR SAFETY, FADE OCCURRING.    FILED COMPLAINT WITH FLORIDA (STATE OF SALE) REPAIR FACILITY ENFOREMENT AND MEDIATION CENTER CASE # 1605-197576 AGAINST  DAYTONA DODGE FL REG # MV-01534 REPAIR FACILITY  AND SEND COPIES OF ALL ORIGINAL RO BY SELLER DEALER AND TWO LR DEALERS. CAR NOT USABLE IN NY, DUE TO VIBRATION AND UNSAFE BRAKING.    SENT CERTIFIED MAIL , GM LETTER ASKING REPAIR FACILITY TO PAY UNDER 60 DAY/3000 WARRANTEE TO LR OF HUNGTON, NY FOR REPAIRS EXCEEDING $1700 OR SO.    FLORIDA CASE MANAGER HAS 30 DAYS.",
        "vin": "SALSF2D48DA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2015",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721719,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BATTERY WAS BEING DRAWN DEAD INEXPLICABLY. FOUR SERVICE VISITS TO DEALER REVEALED NOTHING OTHER THAN A SILLY STORY FROM IT THAT THE CAR WAS NOT BEING DRIVEN LONG ENOUGH FOR THE BATTERY TO RECHARGE. A DIAGNOSTIC I OBTAINED FOUND A CONSTANT 12 VOLT DRAW ON THE BATTERY MORE REASONABLY EXPLAINING WHY THE 3 BATTERIES WERE DRAINED DEAD... DEALER HAD ME USING A \"TRICKLE CHARGE\" PLUGGING INTO AN OUTDOOR ELECTRIC OUTLET EACH NIGHT WHICH ONLY DELAYED THE INEVITABLE DEAD BATTERY. I ATTEMPTED TO LEMON LAW UNSUCCESSFULLY UNDER NYS LAW... READ ONLINE ABOUT THE \"DEAD BATTERY CLUB\" AMONG OWNER AND THUS CAME HERE...",
        "vin": "SALVP1BGXDH"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701984,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT WAS A BODY SHOP OWNER AND WAS DOING FRONT END REPAIRS ON A 2013 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT THE VEHICLE WAS TRAVELING 5 MPH IN A DRIVEWAY AT THE TIME OF THE INCIDENT. THE CONTACT STATED THAT THE VEHICLE HAD SEVERE DAMAGE FOR A VERY MINOR ACCIDENT. THE CONTACT STATED THAT THE MANUFACTURER DID NOT HAVE THE PART FOR THE CONTACT TO ORDER. THE MINOR INCIDENT CAUSED THE FRONT END DRIVER SIDE SHOCK TOWER TO BREAK AWAY FROM THE VEHICLE. THE CONTACT STATED THAT THE WAY THE FRONT END WAS MADE, THE DAMAGE SHOULD HAVE BEEN A MINIMUM OF $2,500 INSTEAD OF $50,000. THE MANUFACTURER STATED THAT THEY DID NOT HAVE A REPAIR FOR MOST OF THE DAMAGE THE VEHICLE SUFFERED FROM THE INCIDENT. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "SALGS2DFXDA"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "07/07/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631673,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT OUT OF THE EVOQUE WITH IT RUNNING AND THE DOOR OPEN. WHEN I CAME WALKING BACK THE CAR WAS GOING UP THE ROAD BY ITSELF IN REVERSE. IT HIT A MAILBOX THAT STOPPED IT. IT COULD HAVE HIT KIDS THAT ARE USUALLY IN THE AREA.    LR/RR LOOKED AT IT FOR TWO WEEKS THEN TOLD ME I MUST HAVE LEFT IT IN REVERSE AND GOT OUT OF THE SUV SOMEHOW BEFORE IT MOVED. THEY WERE NOT GOING TO DO ANYTHING ABOUT IT. WHEN I GOT IN THE SUV AFTER IT HIT THE MAILBOX IT WAS STILL IN PARK.    LONG STORY SHORT IS LR/RR IS DOING NOTHING FOR US. NOW THE BODY SHOP IS TELLING US THE REPAIR PARTS THAT I HAVE TO PAY FOR WILL TAKE UP TO ONE YEAR TO GET IN. WE HAVE BEEN OVER 60 DAYS AND STILL THEY HAVE NO ETA FOR THE PARTS. WHAT A JOKE FOR A COMPANY OF THIS SIZE. MY WIFE WILL NEVER AGREE TO DRIVE THIS SUV AGAIN WITH THIS ISSUE. NEVER BUY A RR/LR.   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631674,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LAND ROVER RANGE ROVER. WHILE THE ENGINE WAS RUNNING AND THE VEHICLE WAS UNATTENDED, IT ACCELERATED BACKWARDS INTO A MAILBOX. THERE WERE NO INJURIES. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "04/02/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587038,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2013 RANGE ROVER EVOQUE IN MARCH 2013.  WITHIN DAYS OF PURCHASING THE NEW VEHICLE I HAD TO BRING THE VEHICLE TO TWO (2) DIFFERENT LAND ROVER DEALERSHIPS. AS IT TURNS OUT WHEN THE VEHICLE WAS ASSEMBLED THE STEERING COLUMN WAS NOT INSTALLED PROPERLY AND CAUSED THE VEHICLE TO PULL.  AN EFFORT WAS MADE TO FIX THIS PROBLEM.  I ALSO HAD THE FRONT AXLE REPLACED WITHIN 5 MOTHS OF OWNING THE VEHICLE.  I'VE ALSO HAD NUMEROUS OTHER PROBLEMS WITH THE VEHICLE AND HAVE HAD IT IN THE REPAIR SHOP SEVERAL TIMES.  *TR",
        "vin": "SALVR2BG7DH"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/07/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497441,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NEW GENERATION 2013 RANGE ROVER, RELEASED IN DECEMBER 2012, DOES NOT HAVE ADEQUATE WINDSHIELD WASHER SPRAY NOZZLES.  THEY ARE UNABLE TO APPLY WASHER FLUID TO CLEAR AN OBSTRUCTED WINDSHIELD AT ANY TRAVELING SPEED.  THIS CREATES A DANGEROUS DRIVING CONDITION DURING ANY WINTER DRIVING WHICH WILL LEAD TO ACCIDENTS.  LAND ROVER CORPORATE OFFICES ARE UNWILLING / UNABLE TO ADDRESS THIS DESIGN FLAW IN ANY MANNER.  THEY WOULD ONLY \"REFER THIS DESIGN COMPLAINT\" TO THEIR CORPORATE DESIGN ENGINEERING IN SOLIHULL, ENGLAND.",
        "vin": "SALGS2EFXDA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/05/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496517,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WASHER FLUID SPRAY NOZZLES DOES NOT PROVIDE SUITABLE SPRAY ONTO THE WINDSHIELD OTHER THAN IN PARK.  INADEQUATE DESIGN, FLOW, SPRAY PATTERN IS CAUSING A SAFETY VISIBILITY ISSUE.  I HAVE ATTEMPTED TO ADDRESS THE ISSUE WITH LANDROVER USA CUSTOMER SERVICE HOWEVER THEY WILL NOT FIX THE CONCERN. THEY HAVE LABELED THE ISSUE AS A \"DESIGN CONCERN\" NOT A SAFETY ISSUE AND \"NOTIFIED\" ENGINEERING IN ENGLAND FOR THEIR \"POSSIBLE\" REVIEW.     TO CLEAR THE WINDSHIELD IN WINTER DRIVING, I MUST PULL OVER EVERY 10 - 15 MILES TO SPRAY WINDOW.   THIS IS A BRAND NEW VEHICLE DESIGN FOR LAND ROVER AND AN OBVIOUS SAFETY ISSUE.  I WOULD LIKE TO FILE A FORMAL SAFETY COMPLAINT WITH NHTSA..  THANK YOU FOR YOUR CONSIDERATION.  I CAN FORWARD VIDEO AND PICTURES OF THE ISSUE IF DESIRED.  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SALGS2EFXDA"
    }
]