[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453147,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag sign on .. lexus service is asking for recalibration to fix the issue",
        "vin": "2t2bk1ba3dc"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11422817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lexus RX450H. The contact stated while driving at an unknown speed, the contact had crashed into a tree which resulted in the airbags not deploying. The contact does not remember anything between driving on the highway and waking up in an ambulance. The contact sustained shoulder, neck, and mild concussion and sought medical treatment. The vehicle was towed to a tow yard where it was awaiting diagnosis. The manufacturer was informed of failure and the contact was awaiting a response. The failure mileage was approximately 105,606.",
        "vin": "JTJBC1BA1D2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390111,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO DEALERSHIP FOR WARNING LIGHTS ON, HYBRID BATTERY MALFUNCTION AND BRAKE MALFUNCTION.  OUR LOCAL DEALERSHIP HERE ON GUAM DIAGNOSED AND PROVIDED ME AN ESTIMATE OF OVER $4K TO REPLACE THE BRAKE ACTUATOR BECAUSE IT'S LEAKING, ALONG WITH THE PUMP. CAR WAS IN MOTIKN WHEN IT FIRST CAME ON.",
        "vin": "JTJBC1BA8D2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355213,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LEXUS RX450H. THE CONTACT STATED WHILE THE BRAKE PEDAL WAS APPLIED, THE BRAKES LOCKED UP AND BECAME DIFFICULT TO STOP THE VEHICLE. THE BRAKE SYSTEM WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO KEYES LEXUS (5905 VAN NUYS BLVD, VAN NUYS, CA 91401, (818) 538-2990) WHERE IT WAS DIAGNOSED THAT THE BRAKE ACTUATOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE MECHANIC WAS INFORMED THAT THE BRAKE ACTUATOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED BUT, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "JTJBC1BA9D2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11353534,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ON THE HIGHWAY, RAINING GLASS ON THE DRIVER, WHO SUSTAINED MINOR CUTS.",
        "vin": "JTJBC1BA8D2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "04/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PULLING OUT OF OUR NEIGHBORHOOD, MY HUSBAND SLOWED DOWN TO TURN RIGHT.  UPON TURNING INTO THE MIDDLE LANE, ALL SIDE AIRBAGS, FRONT AND BACK BLEW.  WHILE THE INTENSITY FROM THE BLAST ROCKED THE CAR, THERE WAS NOTHING NEARBY THAT HE HIT.  NO VISIBLE DAMAGE WAS DONE TO THE CAR, WITH THE EXCEPTION OF, THE AIR BAGS.  WE HAD NEVER HAD ANY ISSUES WITH THIS CAR, AND IN FACT, HAD JUST BEEN AT THE DEALERSHIP THE SATURDAY PRIOR GETTING A STATE INSPECTION AND A NEW BATTERY.  THE SERVICE REP EVEN MENTIONED HOW IMPRESSED HE WAS THAT THIS WAS THE CAR'S FIRST BATTERY IN 7 YEARS AND OVER 90K MILES.  HE TOLD US THE CAR LOOKED GREAT AND TO KEEP IT UP!  AND THEN TUESDAY CAME AROUND AND THE AIR BAG MALFUNCTION OCCURRED.     NOT ONLY WAS THIS AN EXTREMELY SCARY EVENT, BUT IT COULD HAVE BEEN THAT MUCH WORSE HAD MY 2 MONTH OLD SON BEEN IN THE CAR AT THE TIME.  WE ARE THANKFUL NO ONE WAS SERIOUSLY HURT.    HOWEVER, THE STORY ONLY GETS WORSE WITH LEXUS'S (TOYOTA HEADQUARTERS) LACK OF RESPONSE.    4/14 ' CAR TOWED TO DEALERSHIP  4/16 ' DEALERSHIP RECOMMENDS CALL CORPORATE AS IT WAS A MALFUNCTION ' I CALL CORPORATE  4/20 ' CALL CORPORATE ASKING WHERE MY 24 HOUR CALL BACK WAS  4/21 - CALL AGAIN ASKING WHERE MY 24 HOUR CALL BACK WAS  4/22 ' FINALLY GET CALL.  PROVIDE STATEMENT. TOLD I WILL HEAR FROM CASE MANAGER IN 7-10 BUSINESS DAYS FOR FURTHER STEPS.  ASKED TO FILL OUT NDA AND SEND PICTURES.  NDA PROVIDED WAS FOR WRONG CAR, IMMEDIATELY CALLED BACK AND REQUESTED NEW NDA.  EMAILED PICTURES.  4/23 ' FINALLY NEW NDA SENT AND SIGNED.  5/4 ' CALL CORPORATE WONDERING WHEN CASE MANAGER WILL CALL  5/11 ' CALL CORPORATE AGAIN ASKING WHEN I WILL HEAR  5/12 ' CALL AGAIN  5/13 ' CALL AGAIN  5/14 ' FINALLY HEAR FROM CASE MANAGER ONLY TO BE TOLD NO ONE WOULD BE COMING OUT TO LOOK AT THE CAR AND A LOANER COULD NOT BE PROVIDED BECAUSE 'IT'S NOT THEIR JOB'  REQUESTED TO SPEAK TO THEIR MANAGER - WAITING.  *TR",
        "vin": "JTJZB1BA6D2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316157,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 RX450H' ABS LIGHT SUDDENLY TURNED ON WHILE I WAS DRIVING IN A LOCAL ROAD. ALONG WITH THE ABS LIGHT, THERE WERE BRAKE WARNING LIGHT, MASTER MAINTENANCE  WARNING LIGHT, SLIP LIGHT ON ALONG WITH \"CHECK ABS\" \"BRAKE SYSTEM MALFUNCTION\" WARNING MESSAGES APPEARING ON THE DASH BOARD. VERY UNSETTLING.  I TOOK THE CAR TO A LEXUS DEALERSHIP AND THEY RETRIEVED ERROR CODE AS \"C1391, ABNORMAL LEAK IN ACCUMULATOR. \" THEY DIDN'T DETECT ANY LEAKAGE OR MOISTURE IN THE DIAGNOSIS, THEY RECOMMENDED TO REPLACE THE ABS ACTUATOR AND BOOSTER BUMP/ACCUMULATOR ASSEMBLY FOR A PRICE OF OVER $4300.   AFTER I DID SOME RESEARCH OF THIS PROBLEM, I RAN INTO MANY COMPLAINT OF THE SAME ISSUE WITH VARIOUS TOYOTA AND LEXUS CARS, ESPECIALLY ON HYBRID MODELS.  I ALSO LEARNED THE FAULTY COMPONENT IS THE ISSUE AND THE ISSUE HAS BEEN THERE ON MY CAR  FOR A LONG TIME WITHOUT MY REALIZING IT.  BECAUSE 1) THE ABS ASSEMBLY WOULD MAKE THE CHIRPING SOUND WHEN I START THE CAR. SINCE THE SOUND ISN'T LOUD, I WASN'T AWARE IT WAS ANY INDICATION OF A PROBLEM. 2) I ENCOUNTERED AN EVEN MORE SERIOUS SYMPTOM OF THIS ISSUE MANY MANY TIMES. WHEN I PUT THE GEAR ON REVERSE SHORTLY AFTER I SWITCH ON ENGINE, EVEN WHILE I AM STEPPING ON THE BRAKE, THE CAR WOULD JUST MOVE BACKWARD, OUT OF CONTROL OF THE BRAKE. I HAVE TO RELEASE AND REAPPLY MY FOOT ON THE BRAKE TO STOP ITS MOVEMENT. I FAILED TO RECOGNIZE THAT THIS IS THE SYMPTOM OF A FAILING ABS ACTUATOR EARLIER, AS I THOUGHT IT WAS SOMETHING THE HYBRID MODEL HAS WITH ITS ELECTRIC MOTOR KICK IN INSTANTLY.    I ALSO LEARNED TOYOTA/LEXUS OFFERED CUSTOMER SUPPORT PROGRAMS FOR THIS SPECIFIC ISSUE ACROSS MANY MODELS AS DETAILED IN THIS POST HTTP://WWW.DIY-TIME.COM/AUTOMOTIVE/TOYOTA/FAULTY-BRAKE-ACTUATOR-BRAKE-BOOSTER-PUMP-ON-TOYOTA-LEXUS-CARS/. LEXUS SHOULD ISSUE SWEEPING RECALL TO ADDRESS THIS PREVALENT ISSUE IN ITS PRODUCTS. THE ISSUE WOULD LEAD TO REAL SAFETY ISSUES FOR DRIVERS.",
        "vin": "JTJBC1BA0D2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310572,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE ACTUATOR IS FAILING THIS IS A LARGE SCALE PROBLEM AS EVIDENT ON THE LEXUS/TOYOTA FORUMS.  LEXUS ISSUED A SMALL EXTENDED WARRANTY FOR SELECT MODELS BUT FAILED TO INCLUDE ALL EFFECTED MODELS",
        "vin": "JTJZB1BAXD2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072890,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ACTUATOR NEEDS REPLACED. CAR HAS ONLY 65,000 MILES MANY PEOPLE ARE COMPLAINING ABOUT THE ACTUATOR NOT STOPPING THE VEHICLE ACCORDING TO MANUFACTURE STANDARDS. AS WELL I PERSONALLY HAVE ISSUES WHEN AT LOW SPEEDS THE BRAKES MAKE A SQUEAK. WHEN DIAGNOSED AT THE DEALER THE DEALER NOTED THAT THIS IS AN AN ISSUE WITH BRAKE ACTUATOR AND NEEDS REPLACED. WHICH IS A VERY COMMON PROBLEM.",
        "vin": "JTJBC1BA2D2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/07/2015",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761967,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BACKING OUT OF A PARKING SPACE SUDDENLY AND FOR NO APPARENT REASON THE MY CAR SPED UP.MY BREAK DID NO STOP MY CAR.  I WAS FINALLY ABLE TO STOP MY CAR BY PUTTING INTO PARK.  THE STOP WAS SO ABRUPT THAT I DIDN'T REALIZE I HIT ANYTHING.  THIS SAME SCENARIO HAPPENED ABOUT TWO WEEK AGO, EXCEPT I DIDN'T HIT ANYTHING",
        "vin": "JTJBC1BA7D2"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "05/13/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706209,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION SYSTEM DOES NOT HAVE VOICE COMMANDS FOR \"SUSPEND GUIDANCE\", \"RESUME GUIDANCE\", \"CANCEL GUIDANCE\", ETC... THIS MEANS IN ORDER TO STOP NAVIGATION IT MUST BE MANUALLY TURNED OFF WHILE THE VEHICLE IS IN MOTION. THIS REQUIRES MANUALLY ENTERING THE COMMAND WHICH REQUIRES WATCHING THE DISPLAY AND CAUSES DISTRACTED DRIVING. IT IS NOT A SAFE CONDITION AND I AM UNSURE WHY TOYOTA/LEXUS REMOVED THE VOICE COMMANDS SINCE BOTH OUR 2006 AND 2007 TOYOTA PRII HAVE THEM AND ARE MUCH SAFER CARS TO DRIVE BECAUSE OF IT.    ALSO TOYOTA/LEXUS HAS MODIFIED THE NAVIGATION SO THAT IT CONTINUES TALKING EVEN WHEN USING THE BLUETOOTH HANDS FREE PHONE OPTION. WHICH MEANS THE NAVIGATION VOICE TALKS OVER YOUR PHONE CALL. THIS AGAIN CAN CAUSE DISTRACTED DRIVING AS YOU ARE TALKING TO SOMEONE AND SUDDENLY THE LOUD NAVIGATION VOICE BEGINS SPEAKING AS WELL. THIS IS ANOTHER UNSAFE CHANGE TOYOTA/LEXUS HAS MADE AS BOTH OF OUR PRII DO NOT ALLOW THE NAVIGATION SYSTEM TO OVERRIDE THE BLUETOOTH HAND FREE PHONE.     I AM NOT SURE WHY A 2013 LEXUS THAT IS 6 YEARS NEWER THAN OUR PRII AND COSTS TWICE AS MUCH HAS SUCH AN UNSAFE NAVIGATION SYSTEM BUT IT NEEDS TO BE CORRECTED AS SOON AS POSSIBLE. BOTH PROBLEMS READILY CAUSE DISTRACTED DRIVING.  *TR",
        "vin": "JTJBC1BA1D2"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SOUNDED LIKE A GUN WENT OFF INSIDE THE CAR. WE WERE TRAVELING ABOUT 60 MPH ON THE INTERSTATE AND AFTER THE INITIAL SHOCK I LOOKED BOTH BEHIND ME AS WELL AS TO THE SIDE TO SEE WHAT MAY HAVE CAUSED THE NOISE. TO SEE IF SOMETHING HAD HIT THE CAR ON TOP, WE PULLED BACK THE SUNROOF VISOR A FEW INCHES, ENOUGH TO SEE AND HEAR THAT THE SUNROOF HAD A LARGE HOLE IN IT. AFTER PULLING OFF AT THE NEAREST EXIT AND CLIMBING OUT OF THE CAR WE COULD SEE THAT THE SUNROOF LOOKED AS IF THE HAD EXPLODED UPWARDS AND OUTWARD. AN IRREGULAR HOLE ABOUT 5\" X 15\" ACROSS WAS EVIDENT AND THE EDGES WERE ARCHING UPWARDS AS IF SOMETHING HAS EXPLODED INSIDE THE CAR. SAFETY GLASS FRAGMENTS WERE ON TOP OF THE SUNROOF AND THERE WERE SOME ON THE VISOR INSIDE. NO GLASS HAD ENTERED THE CAR BECAUSE THE VISOR WAS CLOSED AT THE TIME. WE WERE NOT NEAR ANY BRIDGES AT THE TIME OF THE EXPLOSION, WE SAW NO ROCKS. THE TEMPERATURE OUTSIDE WAS 75-80 DEGREES AND THE AIR-CONDITIONER WAS ON INSIDE THE CAR. THERE IS NO EVIDENCE OF ANYTHING HITTING THE CAR.  *TR",
        "vin": "JTJZB1BA6D2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/11/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10597686,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2013 LEXUS RX450H.  WHILE DRIVING 25 MPH, THE CONTACT'S VEHICLE WAS CRASHED INTO FROM THE REAR BY ANOTHER VEHICLE.  THE CONTACT INJURED HIS HEAD WHEN IT STRUCK THE STEERING WHEEL.  THE AIR BAGS FAILED TO DEPLOY.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED TO A COLLISION CENTER AND RULED AS BEING DESTROYED.  THE MANUFACTURER WAS NOT NOTIFIED.  THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "JTJBC1BA4D2"
    }
]