[
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "02/02/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458101,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Our Lincoln MKX had a failure of its power brake booster showing no warning indicator light on the dashboard.  The brakes felt like they had air in the lines and excessive pumping was needed to build pressure on the brake pads which eventually needed to be pushed close to the floor in order to stop. We made an appointment at the Ford Dealership.  But, since it was a long distance from our home, and not to put us in danger of getting into an accident, we made it to the closest brake repair business we could find that was close to our home.  It was found that our Power Brake Booster & Brake Master Cylinder needed to be replaced.  We are the 2nd Owners of this Vehicle & we learned that there was an a Customer Satisfaction Program 13N02 - Supplement #1 for certain 2010-2013 Model Year MKX (& Edge) Vehicles that had an Extended Warranty Coverage on Brake Boosters.  Our car VIN #  falls in the timeframe of this.  Moreover, when the Vehicle was purchased from the Ford/Lincoln Dealership, it had 33,341 miles on it & it now only has 51,920.  The Customer Satisfaction Program repairs the issue with the power brake booster at no cost within 10 years & on cars up to 150,000 miles. We had to pay out of pocket for our repair & need assistance in getting reimbursement for this expense.  This unsafe occurrence also lead to having to replace a Stop Lamp Switch on 02/4/22 which failed & we were charged again (in less than a month's time) for another switch.  It was also found on that repair that the booster mount on the inside under the dashboard was not tight & it had a stripped fastener. Now it is being recommended that a removal of the brake booster & master cylinder be inspected for proper installation and that a cut-out of that stripped fastener be done.  Access to this requires removal of the instrument panel & steering column to access the firewall to get to the fastener.  Invoices related to all this are attached for review except for the last noted recommendations.",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447310,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln MKX. The contact stated while driving approximately 50 MPH and attempting to depress the brake pedal, the brake pedal went all the way to the floorboard and failed to stop the vehicle within a reasonable time frame. The contact was able to pull over and restart the vehicle after waiting approximately 10 minutes. The contact stated no warning light was illuminated. The vehicle was not taken to a local dealer to be diagnosed or repaired. The manufacturer was not informed of the failure. The failure mileage was 125,482.",
        "vin": "2LMDJ8JKXDB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442287,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "11.30.2021 REVERSED OUT OF DRIVEWAY, SHIFTED INTO 'DRIVE'. STOP SIGN AT INTERSECTION AND TURNED LEFT ONTO STREET. THE TRANSMISSION LUGGED, NOT IN GEAR, THE RPMs RAN HIGH (ON DISPLAY) AND THEN RE-ENGAGED AND INTO FORWARD MOTION. NO WARNING LIGHTS OR SOUNDS. CLEAR DAY, 60d, FORTUNATELY NO TRAFFIC.",
        "vin": "2LMDJ6JK4DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441257,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln MKX. The contact stated that while driving at approximately 60 MPH, the brake pedal was depressed and traveled to the floorboard. In addition, the brake pedal needed to be pumped several times for the brakes to operate. The failure recurred three times. The vehicle was taken to the dealer and then to an independent mechanic where the failure was undetermined. The vehicle was taken to the dealer where a diagnostic test was not performed. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 45,000.",
        "vin": "2lmdj6jk7db"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440840,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "My brakes failed.  I did not have a vehicle crash. I was pulling out of a parking lot and I was far enough behind the other car to avoid an accident.  I took my 2013 Lincoln MKX to the Lincoln dealer and found that there is a 13no2 bulletin but it does not include my car even though they found that the brake booster is bad.  I received no notice regarding this problem from Ford and no message on my car.  There were no warning messages.  I have 47,000 miles on my car.",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/08/2021",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln MKX. The contact stated that while driving at various low speeds, a burning odor was detected. The burning odor affected the contact's asthma. Additionally, there was fluid leaking onto the garage floor. The vehicle was taken to an independent mechanic and diagnosed with fluid leaking from the transfer case. The vehicle was not repaired and remained with the mechanic. The dealer was made aware of the failure and referred the contact to the manufacturer. The manufacturer was made aware of the failure and informed the contact that there was no recall associated with the VIN and due to the age of the vehicle, it was not covered. The manufacturer advised the contact to have the vehicle repaired by the dealer, and the dealer could request financial assistance on the contact's behalf. The failure mileage was approximately 20,000. Vehicle has not been repaired.*JB",
        "vin": "2lmdj8jk8db"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432921,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR END - REAR DIFFERENTIAL I TOOK CAR IN MANY MANY TIMES BECAUSE OF A STRANGE NOISE IT WAS MAKING AND THEY KEPT TELLING ME NOTHING IS WRONG, WELL NOW MY REAR END SOUNDS LIKE IT IS FALLING APART. THEY GAVE ME MY CAR BACK AND TOLD ME PARTS ARE ON A NATIONAL BACKORDER. NO WARNING LIGHTS IN THE CAR ARE ON, NOR EVER CAME ON. MY CAR WAS SERVICED REGULARLY BY THE LINCOLN DEALERSHIP, Bob Ferrando in Girard, PA.  I ONLY DRIVE TO WORK AND STORE SO LITTLE MILEAGE. I AM JUST AT 64,000 MILES AND IT IS A 2013.  DEALERSHIP TOLD ME THAT THEY ALSO HAVE A 2016 LINCOLN IN THE SHOP WITH THE SAME PROBLEM. I AM REPORTING THIS BEFORE ANY ACCIDENT OCCURS. DEALERSHIP GM HAS LIED TO ME SAYING THE HEAD OF SERVICE IS LOOKING INTO THIS AND HE WILL CALL ME. I WAITED AND WAITED THEN I CALLED HIM AND HE SAID THAT THE GM NEVER TALKED TO HIM ONCE ABOUT MY CAR OR SERVICE.",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430715,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln MKX. The contact stated while driving 30 MPH, he heard an abnormal noise and had to depress the brake pedal to the floor to stop the vehicle. The contact stated no warning light was illuminated. The contact took the vehicle to an independent mechanic and was informed that the brake booster system needed to be repaired. The vehicle was repaired. A dealer was not contacted. The manufacturer had not been informed of the failure. The failure mileage was approximately 102,000.",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427029,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The power brake booster failed. This happened without any warning or warnings lights coming on. We noticed a hissing sound when using the brakes and a spongy feel. We often had to push the brake almost to the floor in order to stop the car! This put us and others at risk because the brakes were not working properly. We took the car to an auto repair shop and they diagnosed the issue as the power brake booster needing to be replaced. This first started happening a couple days ago. We are now afraid to drive it. Upon doing research, we noticed this is a known issue with Ford and Lincoln and our car was manufactured one month outside of the Customer Satisfaction Program 13N02. This program repairs this exact issue at no cost within 10 years and on cars up to 150k miles. Our car has 81k miles on it. There is no question about the dangers of these vehicles on the road. There should be a recall and it should be extended to cover OUR CAR. We should not have to pay out of pocket for the EXACT same issue others whose car was manufactured one month earlier are being covered for. The issue was clearly not resolved when our car was manufactured. Please look into this.",
        "vin": "2LMDJ8JKXDB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln MKX. The contact stated while his wife was driving 35 mph and coming to a stop, the brake pedal was depressed but hesitated to respond causing 30 feet stopping distance delay. The contact stated that the brake pedal was soft. There were no warning lights illuminated. The vehicle was taken to an independent mechanic who diagnosed that the power brake booster had failed, and the failure was related to an unknown recall. The vehicle was not repaired. The contact stated the failure reoccurred while driving. The vehicle was taken to the dealer, who informed the contact that the vehicle could not be repaired under the unknown recall since the VIN was not included in the recall. The manufacturer was made aware of the failure and advised the repair would not be completed under the recall. The vehicle was not repaired. The approximate failure mileage was 31,000.",
        "vin": "2lmdj6jk2db"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING DOWN A BUMPY ROAD, I DEPRESSED THE BRAKE PEDAL JUST AS I HIT A RATHER LARGE BUMP. THE BRAKE PEDAL SUDDENLY WENT TO THE FLOOR. FROM THAT POINT ON, I HAD TO PUMP THE BRAKE PEDAL SEVERAL TIMES JUST TO GET THE BRAKES TO ACTIVATE AND SLOW THE VEHICLE DOWN. THIS IS A KNOWN ISSUE WITH VALVES STICKING IN THE ANTI-LOCK BRAKING SYSTEM ON THE FORDS AND LINCOLN'S. IN ORDER TO BE ABLE TO DRIVE THE VEHICLE, I HAD TO REMOVE THE 40AMP ABS PUMP FUSE AND THE 10AMP ABS MODULE FUSE. I NOW HAVE PERFECT BRAKE PEDAL PRESSURE, BUT THE ABS LIGHT AND BRAKE LIGHT ARE ILLUMINATED ON MY DASH. THIS ALMOST CAUSED AN ACCIDENT. LUCKILY, I WAS TRAVELING ON A ROAD WITH NO TRAFFIC. THIS SHOULD BE A RECALL, SINCE THE EARLIER VERSIONS OF THIS VEHICLE WERE RECALLED FOR SIMILAR PROBLEMS.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEPPED ON BRAKE, MADE NOISE AND PEDAL WENT ALL THE WAY TO TO THE FLOOR AND WOULD NOT STOP ALMOST HITTING CAR IN FRONT OF ME.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405660,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKED & POWER STOPPED. INTERIOR DASH LIGHTS REMAINED ON. REVERSED OUT OF A PARKING SPOT, SHIFTED TO DRIVE & STEERING LOCKED. I WAS BARELY ROLLING FORWARD. BRAKED, PUT ON FLASHERS, SHIFTED TO PARK & RESTARTED. A COUPLE OF DAYS EARLIER IT HAPPENED, BUT TWICE ? !",
        "vin": "2LMDJ6JK4DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405661,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S DOOR IS CLOSED, BUT THE 'OPEN DOOR' ALERT REMAINS ON, AS WELL AS THE INTERIOR LIGHTS & EXIT LIGHTS. MULTIPLE DOOR CLOSURES, SOFT, SLAMMING, PARK, RESTART. NO RESOLUTION.  RAMDOMLY TURNS OFF , BUT HAS STAYED ON OVERNIGHT, & IN PARKING LOTS, BEING UNAWARE IT STAYED ON. ALSO AT THESE TIMES, THE AUTO UNLOCK DOES NOT WORK, I HAVE TO USE THE KEYPAD TO OPEN THE DRIVER'S DOOR",
        "vin": "2LMDJ6JK4DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIMARY AND SECONDARY HOOD LATCHES COME UNDONE LEAVING HOOD COMPLETELY UNLATCHED. FIRST TIME, CAR WAS BEING BACKED OUT ON A CONCRETE DRIVEWAY AFTER SITTING FOR SEVERAL DAYS. THE SECOND TIME, ANOTHER DRIVER NOTICED IT AS I WAS LEAVING A PARKING LOT. HE EXITED HIS CAR AT A STOP SIGN TO TELL ME ABOUT IT AND TO CLOSE THE HOOD. NEITHER LATCH WAS ENGAGED IN EITHER INSTANCE AND WAS AFTER CAR SAT UNDRIVEN FOR A FEW HOURS UP TO 3-4 DAYS. NO DRIVING AT ANY TIME ON ROUGH TERRAIN, POT HOLES, OR GRAVEL/DIRT ROADS. ALL CITY OR HIGHWAY DRIVING M",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AND COMING TO A STOP LIGHT, THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO LOWER, CAUSING THE BRAKING DISTANCE TO BE EXTENDED. AFTER THE VEHICLE CAME TO A STOP, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS RESTARTED. THE VEHICLE WAS TAKEN TO BILL HOOD FORD (1500 N. MORRISON BLVD, HAMMOND, LA 70401) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE POWER BRAKE BOOSTER WAS FAULTY NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 107,000.*DT*JB",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSFER CASE IN MY CAR BROKE AND I JUST BOUGHT THIS CAR IN AUGUST. IS IT FROM THE RECALL?",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373053,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HVAC  AND PCM NEEDED THE VIN NUMBER RECODED?? TWO HOURS OF LABOR AT A COST OF $385. DOLLARS. REASON IS HEAT WOULD BLOW COLD AIR ON DRIVERS SIDE AND HEAT ON PASSAGEM SIDE. DEALER SAID THE VEHICLE VIN NUMBER NEEDED TO BE CORRECTED IN BOTH THE HVAC AND PCM MODULES.. DEALER SAID IT IS A GLITCH? VEHICLE IS USED REGULARLY AND THE CABIN AIR FILTER HAD JUST BEEN CHANGED BY THE DEALER WHEN PROBLEM STARTED.",
        "vin": "2LMDJ8JKXDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUED BRAKING PROBLEMS, I REPLACED ALL 4 WHEEL CALIPERS , ROTORS PADS AND CYLINDERS APPROX. 1 YEAR AGO. I HIT A BUMP AND THE BRAKE PEDAL WENT ALMOST TO THE FLOOR. I CHANGED THE BRAKE FLUID AND THE ABS PUMP. THE BRAKE PEDAL IS STILL MUSHY",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU HIT THE GAS PEDAL YOU LOSE ALL ACCELERATION.  YOU HAVE TO DRIFT TO A COMPLETE STOP, TURN THE CAR OFF AND THEN RESTART IT.  HAVE ALMOST BEEN HIT MULTIPLE TIMES AND ONCE ON THE HIGHWAY TRAVELING ABOUT 50 MPH.  THANKFULLY TRAFFIC WAS NOT HEAVY AND I WAS ABLE TO GET MY CAR STOPPED AND RESTARTED BEFORE THE POSSIBILITY OF SOMEONE RUNNING INTO US. THERE WAS NO SHOULDER TO PULL OFF ON BECAUSE OF CONSTRUCTION.  IT WAS TERRIFYING.  IT HAPPENS RANDOMLY AND THERE IS NO WARNING AS TO WHEN.  A VEHICLE IN THIS CONDITION IS NOT SAFE TO DRIVE AND LINCOLN SEEMS TO NOT KNOW WHAT THE PROBLEM IS SO THEY SEND PEOPLE HOME IN THEIR DEFECTIVE VEHICLES BECAUSE AS THEY SAY THEY CAN'T GET THE PROBLEM TO DUPLICATE SO THEY TOLD ME THAT THERE IS NOTHING WRONG WITH MY CAR AND SENT ME HOME NOW TWICE. TRUST ME THERE IS SOMETHING WRONG WITH MY CAR AND MANY OTHERS AND IT IS A HUGE SAFETY HAZARD!!!",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354211,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2013 LINCOLN MKX FOR MAINTENANCE. I WAS TOLD THAT MY POWER TRANSFER UNIT, (PTU) WAS DEFECTIVE, IT IS A SEALED UNIT AND BEING AN INTEGRAL PART OF THE DRIVE TRAIN, IT NEEDED TO BE CHANGED. VEHICLE WAS STATIONERY.  I CONTACTED LINCOLN TO SEE WHY AN ESSENTIAL PART SHOULD HAVE FAILED. I WAS TOLD THERE ARE NO RECALLS, NOTHING COULD BE DONE.  1.OTHER PEOPLE HAD SIMILAR ISSUES. 2. THE POLICE CARS WERE EQUIPPED WITH COOLERS SO THAT THE PTU WOULD NOT OVERHEAT. 3. THE CARS WITH THE PTUS SOLD OVERSEAS WERE GIVEN A DRAIN PLUG. 4. FORD SWITCHED THE MAKERS TO A NEW ONE BECAUSE OF THE INCIDENTS. I SENT AN EMAIL TO NANCY JOY FALOTICO, PRESIDENT, THE LINCOLN MOTOR COMPANY, NOT HEARING I CALLED THE EXECUTIVE OFFICES, I RECEIVED A CALL FROM ANOTHER REP. WHO WAS RESPONDING FOR MS. FALOTICO, SHE SAID AGAIN, NOTHING COULD BE DONE. KEEP YOUR RECEIPTS AND IF THERE SHOULD BE A RECALL YOU CAN GET REIMBURSEMENT.  THE MALFUNCTION OF THIS PART COULD HAVE CATASTROPHIC RESULTS.  LINCOLN MOTORS GAVE THE BBB AN UNACCEPTABLE  RESPONSE.  2.CONTACTED ATTORNEY GENERAL'S OFFICE OF CT RESPONSE NOT ACCEPTABLE. SAME RESPONSE AS TWAS SENT TO BBB.  3.RECCOMMENDED TO CONTACT YOU.  4. LETTER FROM FORD TRIED TO MAKE IT JUST A WARRANTY ISSUE. IT OBVIOUSLY HAS NOTHING TO DO WITH WARRANTY.",
        "vin": "2LMDJ8JK0DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353825,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN ANY ROAD CONDITION AND NORMAL DRIVING THE BRAKE PEDAL WHEN PRESSED GOES    VERY CLOSE TO THE FIREWALL FLOOR WHEN BRAKING AN ITS A VERY SOFT BRAKING, ITS VERY HARD TO GAUGE HOW MUCH PRESSER TO APPLY TO THE  BRAKE PEDAL. THERE WASN'T ANY ACCIDENT.  FW",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT OVER 70 WITH MY WHOLE FAMILY IN THE VEHICLE THE VEHICLE SIMPLY STOPPED RESPONDING AND WENT INTO WHAT I HAVE NOW BEEN INFORMED IS LIMP MODE BY THE GRACE OF GOD WE SURVIVED THIS FRIGHTENING EXPERIENCE ON ANOTHER INSTANCE AFTER THAT ANOTHER CAR HIT ME THANKFULLY NO DAMAGE, WHILE DOING SOME RESEARCH I SEE THERE IS A SAFETY CAMPAIGN 13NO3 BUT FOR SOME REASON THIS MODEL WAS NOT INCLUDED. I NO LONGER FEEL SAFE DRIVING THIS VEHICLE AND BELIEVE THIS VEHICLE AND OTHERS LIKE IT HAVE A SERIOUS SAFETY ISSUE THAT IS GOING TO COST SOMEONE THERE LIFE.",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IN MOTION AT 65MPH ON A 4 LANE FREEWAY TRAVELING IN LANE 2 OR 3.  IT  MADE A LOUD THUD AND THE WRENCH ICON APPEARED ON THE DASHBOARD. AT THE SAME TIME, THE GAS PEDAL NO LONGER PROVIDED ACCELERATION AND THE ONLY THING I COULD DO WAS COAST TO A STOP, WHILE MANEUVERING THE VEHICLE TO THE SHOULDER.  AFTER STOPPING I RESTARTED THE CAR AND IT FUNCTIONED PERFECTLY FINE.  THE WRENCH LIGHT WAS NO LONGER ILLUMINATED.  TWO MONTHS LATER IT HAPPENED AGAIN WHILE IN A FORWARD MOTION ON CITY STREETS...MADE A LOUD THUD, THE WRENCH ICON APPEARED.  I WAS AT THE WEST SIDE OF A 4 LANE INTERSECTION AND BARELY HAD ENOUGH POWER TO COAST THROUGH THE INTERSECTION AND PULL OVER ON THE EAST SIDE. AFTER SHUTTING THE CAR OFF, IT STARTED UP FINE AGAIN. I AM AFRAID TO DRIVE IT NOW",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350288,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR AJAR WARNING LIGHT.  DOME LIGHT STAYS LIT AND UNABLE TO LOCK DOORS AUTOMATICALLY..  I RECEIVED A RECALL NOTICE FOR THE DRIVER SIDE BUT NOT PASSENGER SIDE.  ALSO THE RECALL HAS MILEAGE LIMITS.  IT STARTED ONLY PERIODICALLY IN 2019, BUT NOW IS CONSTANT",
        "vin": "2LMDJ8JK0DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR WARNING WHILE REAR DRIVER SIDE DOOR IS CLOSED.   WHEN THE DOOR IS CLOSED, THE DOOR AJAR LIGHT STAYS ON AND  THE DOORS NEVER LATCH WHILE DRIVING. WHICH AFFECTS  SEVERAL ELECTRICAL COMPONENTS SUCH AS, AUTOMATIC DOOR  LATCHS, ALARM SYSTEM, COURTESY LIGHTS AND OTHER  ELECTRICAL COMPONENTS.",
        "vin": "2LMDJ8JK5DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349308,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN REGARDS TO MY 2013 LINCOLN MKX, THE AUTOMATIC TRANSMISSION FREQUENTLY DOES NOT ENGAGE IN PARK --- ABOUT HALF THE TIME.  WHEN STATIONARY, THE AUTOMATIC TRANSMISSION GEAR SHIFT LEVER IS PUSHED INTO THE \"P\" POSITION, BUT THE VEHICLE WARNS VIA A DINGING AND DASH WARNING THAT IT IS NOT IN PARK.  STATIONARY LOCATIONS INCLUDE MY GARAGE, WHICH IS LEVEL, AND PUBLIC PARKING LOTS, WHICH ARE TYPICALLY LEVEL IN MY AREA.  THERE IS AN EXISTING RECALL FOR THE 2013 LINCOLN MKX (NTSA CAMPAIGN NUMBER: 14N393000), WHICH REGARDS A DEFECTIVE \"HALF-SHAFT DISENGAGEMENT\".  IT INCLUDES COMMENT THAT UNTIL REPAIRED, WHEN STOPPED TO ENGAGE THE PARKING BRAKE OR THE VEHICLE COULD ROLL AWAY.  I DO NOT KNOW WHETHER THAT RECALL INVOLVES THE PROBLEM WITH MY LINCOLN.  A SEARCH WAS PERFORMED ON YOUR WEBSITE FOR A RECALL ON MY VEHICLE USING ITS VIN, BUT NO RECALL WAS FOUND.",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341268,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE BRAKE PEDAL WAS DEPRESSED AND WENT TO THE FLOORBOARD. THE CONTACT STATED THAT THE BRAKE BOOSTER AND THE ABS MODULE FAILED. THE CONTACT STATED THAT THE FAILURE RECURRED WHILE DRIVING UP HIS DRIVEWAY. THE CONTACT STATED THAT THE FAILURE WAS CAUSED BY A DEFECT IN THE HYDRAULIC CONTROL UNIT. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO FORD OF OCALA INC (2816 NW PINE AVE, OCALA, FL 34475), AND WAS REPAIRED UNDER WARRANTY. THE WARRANTY COVERED THE ABS MODULE BUT NOT THE HYDRAULIC CONTROL UNIT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY 90,700.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOES TO THE FLOOR OR FIREWALL WHEN BRAKING. THE BRAKES SEEMED TO GET BETTER BUT  CONDITION RETURNED. THIS BACK AND FORTH HAS HAPPENED TWICE BUT NOW THE BRAKE AREN'T GETTING BETTER. ALL OF THESE BRAKING SITUATIONS ARE HAPPENING ON CITY STREETS HIGHWAYS, TURNING ALL WHILE IN MOTION. LINCOLN MKX 2013.  *TR",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327074,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE 2 YEARS AGO WITH ONLY 36K MILES. 10 MONTHS AGO I NOTICED ON OCCASION THAT AFTER SHIFTING TO PARK THE VEHICLE WAS NOT RECOGNIZING AND ALERT SAID TO SHIFT TO PARK. ALSO WHILE BRAKING ON HILLS I COULD FEEL PRESSURE BUILDING UP AND PRESSING AGAINST MY FOOT CAUSING ME TO BE FORCED TO PRESS VERY HARD TO STOP,THIS CONTINUED ONLY ON OCCASION UNTIL RECENTLY WHILE STOPPED AT A TRAFFIC LIGHT MY CAR WILL LOOSE POWER AND THE LOW ENGINE PRESSURE LIGHT BEEPS 3 TIMES. AS THIS HAS PROGRESSED MY VEHICLE IS NOW UN DRIVEABLE. I TOOK MY VEHICLE TO LINCOLN DEALER IN SPOKANE WA AND WAS TOLD THE BRAKE BOOSTER WAS FAILING AND THERE WAS AN ACTIVE RECALL FOR THIS ISSUE BUT THEY WERE UNABLE TO REPAIR BECAUSE MY VIN # WASN'T SHOWING THAT MY VEHICLE WAS INCLUDED IN RECALL. PLEASE HELP  *TR",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325836,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND SEPTEMBER 2019, THE BRAKE BOOSTER ON MY LINCOLN MKX BEGAN FAILING, GETTING WORSE AND WORSE QUICKLY.  IT GOT TO THE POINT THAT I HAD TO ALMOST STAND WITH TWO FEET ON THE BRAKE TO MAKE THE CAR STOP.  (WHICH WAS FRIGHTENING WHEN I WAS TRYING TO STOP THE CAR BEFORE HITTING THE ONE IN FRONT OF ME, EVEN THOUGHT I WAS ONLY GOING ABOUT 30-40 MPH).  WHEN I PRESSED THE BRAKE THE PEDAL WOULD SLIGHTLY DEPRESS, THEN HISS AND THEN WITH MY INCREASED PRESSURE ON THE BRAKE PEDAL IT WOULD DEPRESS FURTHER, SEEMINGLY CLOSE TO THE CAR FLOOR.  THE CAR BECAME INCREASINGLY DIFFICULT TO STOP.  MY MECHANIC SAID MY BRAKE BOOSTER NEEDED REPLACED AND THAT THERE WAS AN EXTENDED WARRANTY ON THE PART.  I PURCHASED THE CAR USED.  I CALLED FORD AND GAVE THEM MY VIN NUMBER AND THEY SAID THAT THE BAD PARTS STOPPED BEING USED IN MARCH OF 2013 AND THAT MY CAR WAS PRODUCED IN MAY OF 2013.  WELL OBVIOUSLY SINCE I HAD THE EXACT SAME PROBLEM AS THAT WHICH WAS THE SUBJECT OF THE RECALL, THE BAD PART WAS USED IN MY CAR AS WELL.  FORD OPENED A CASE (#24559511K4) BUT REFUSED TO COVER THE REPAIR.  I HAD TO PAY OUT OF POCKET TO HAVE MY CAR REPAIRED SINCE IT WAS DANGEROUS TO CONTINUE TO DRIVE.  THE MILEAGE ON THE CAR AT THE TIME OF REPAIR IN OCTOBER 2019 WAS 110,334.  I BELIEVE THE FORD SHOULD REIMBURSE ME FOR THE COST OF THE REPAIR.",
        "vin": "2LMDJ8JK7DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR WARNING COMES ON DESPITE ALL DOORS BEING CLOSED SECURELY. THIS CAUSES ANY NUMBER OF ISSUES INCLUDING INTERIOR LIGHTS COMING ON WHICH IS NOT SAFE AT NIGHT, ENTRY ALARM GOING OFF AT ANY HOUR OF THE DAY OR NIGHT, AND EXCESSIVE DRAIN ON BATTERY. THE PROBLEM OCCURS BOTH WHILE IN MOTION AND WHILE STATIONARY.",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WHEN I PUT MY CAR INTO PARK IT DOESN'T ALWAYS REGISTER THAT THE CAR IS IN PARK AND THE P DOESN'T LIGHT UP. A NOTICE POPS UP ON MY DASH AND TELLS MEN TO PUT MY CAR INTO PARK.",
        "vin": "2LMDJ8JK0DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED WHILE HER HUSBANDS FRIEND WAS DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE FELT AS IF THEY WENT OVER CEMENT BLOCKS AND MADE A LOUD NOISE. THERE WERE NO WARNING LIGHTS. THE DRIVER MERGED OFF THE ROAD. THE VEHICLE WAS TOWED AND TAKEN TO A LOCAL MECHANIC FOR A DIAGNOSIS. THE VEHICLE WAS DIAGNOSED THAT THE BOLTS WERE MISSING AND THE BOLTS AT THE END OF THE DRIVESHAFT FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V393000 (POWER TRAIN). THE FAILURE MILEAGE WAS 72,000 AND THE VIN IS ([XXX]) INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE AIR CONDITION IS ON IT IS COOL FOR A WHILE THEN THE HEAT IS ON AND WILL NOT GO BACK TO AIR CONDITION.  SAME PROBLEM WITH THE HEAT IT IS WARM FOR A WHILE AND THEN THE AIR CONDITION COMES ON. ALSO, I HAVE HAD WARM AIR ON THE PASSENGER SIDE AND COOL AIR ON THE DRIVERS SIDE AT THE SAME TIME.",
        "vin": "2LMDJ6JK5DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280760,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WITHOUT WARNING. THE VEHICLE WAS TAKEN TO GREG SWEET FORD (440-593-7736, LOCATED AT 4011 E CENTER ST, NORTH KINGSVILLE, OH 44068) WHERE THE BRAKE MODULE (PART NUMBER: DT4Z2C215A) WAS REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 62,000.",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269805,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION WHEN BRAKE PRESSURE WAS LOST AS I WAS TURNING RIGHT. I HAVE TO PUSH THE BRAKE ALL THE WAY INTO THE FLOOR BOARD. THIS HAS HAPPENED THREE OTHER TIMES, WHERE THE BRAKES EVENTUALLY RESET THEMSELVES TO WHERE I GENTLY PUSH DOWN ON THE BRAKE PEDAL. AT THIS MOMENT I HAVE TO PUSH HARD ON THE BRAKE PEDAL ALL THE WAY DOWN TO THE FLOOR BOARD.",
        "vin": "2LMDJ6JK2DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268873,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING 50 MPH, THE VEHICLE DOWNSHIFTED ON ITS OWN. THE VEHICLE WAS COASTED TO THE SIDE OF THE ROAD AND RESTARTED. THE FAILURE ALSO OCCURRED WHILE ACCELERATING FROM A STOP. THE VEHICLE WAS TAKEN TO ROBINSON BROTHERS FORD (11455 AIRLINE HWY, BATON ROUGE, LA 70816, (225) 293-8900) MULTIPLE TIMES, BUT THE FAILURES COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS WAITING FOR A CALL BACK. THE FAILURE MILEAGE WAS APPROXIMATELY 14,000. *DT *TP  ISSUES ALSO OCCURS AT LOWER SPEEDS WHEN EXCELORATING WHEN TRY TO MOVE AT STOPPED, TRAFFIC LIGHT OR STOP SIGN *TP",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268971,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL WAS DIFFICULT TO DEPRESS AND AN ABNORMAL HISSING NOISE WAS DETECTED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO TEAM FORD LINCOLN (905 BRADY AVE, STEUBENVILLE, OH 43952, (740) 283-4131) WHERE IT WAS DIAGNOSED THAT THE VACUUM BOOSTER NEEDED TO REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 109,000.  THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M GETTING EXHAUST SMELL COMING OUT OF VENTS.  MAKING ME SICK & GIVING ME HEADACHES.. TOOK IT TO DEALER DID NOTHING, REPLACED CABIN FILTE ?  HAPPENS WHEN DRIVING BUT NOT ALWAYS. BEEN GOING ON FOR WEEKS.  NOW IT'S MAKING BAD NOISE UNDER CAR WHEN I START DRIVING FOR ABOUT 5 MINUTES THEN STOPS..",
        "vin": "2LMDJ8JK0DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE WRENCH ICON POPS UP AND THEN THE CAR GOES INTO LIMP MODE. THE ONLY WAY OUT OF THIS IS TO PUT THE CAR IN PARK PRESS THE STOP BUTTON THEN RESTART THE VEHICLE. THIS HAPPENS EVERY COUPLE OF WEEKS. I CALLED THE DEALERSHIP IN MEMPHIS AND THEY COULDN'T TELL ME WHAT TO DO OTHER THAN TO BRING THE CAR IN FOR 4-5 DAYS AND THEY WOULD TRY TO DETERMINE THE PROBLEM.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254256,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN A HISSING NOISE MADE WHILE DEPRESSING THE BRAKE PEDAL FOR SEVERAL MONTHS.  LATELY, WHILE PRESSING THE BRAKE PEDAL, IT FEELS 'SPONGY' WITHOUT A NOTICEABLE EFFECT ON BRAKING PERFORMANCE.  JUST RECENTLY, THE EFFORT REQUIRED TO STOP THE CAR HAS INCREASED TO THE POINT THAT IT FEELS LIKE THE POWER BRAKING SYSTEM IS HARDLY ASSISTING.     THIS MATCHES THE DESCRIPTION OF FIELD SERVICE ACTION 13N02 ISSUED BY FORD/ LINCOLN, WHICH ONLY APPLIES TO \"CERTAIN\" VEHICLES.  HOWEVER, UPON CONTACTING A LOCAL DEALERSHIP AND THE NATIONWIDE CALL CENTER IT WAS DISCOVERED THAT THIS VEHICLE WAS EXCLUDED FROM THE FSA.  THIS IS A POTENTIALLY LIFE THREATENING ISSUE, ESPECIALLY IF AN INDIVIDUAL DID NOT HAVE THIS SERVICED AND RELIED SOLELY ON DRIVING WITHOUT POWER BRAKES.  FORD/ LINCOLN SHOULD NOT BE ABLE TO PICK AND CHOOSE \"CERTAIN 2010-2013 MODEL YEAR EDGE AND MKX VEHICLES\" WHEN IT IS APPARENT FROM REVIEWING FORD EDGE AND LINCOLN MKX REPORTS ON CARCOMPLAINS.COM THAT BOTH VEHICLES EXHIBIT THIS ISSUE FREQUENTLY, AND THAT FORD/ LINCOLN HAVE EXCLUDED NUMEROUS VEHICLES FROM REPAIRS.  THE COMPANY IS AWARE THAT AN ISSUE EXISTS, BUT THERE ARE MULTIPLE INSTANCES OF FORD/ LINCOLN REFUSING TO REPLACE A FAULTY PART THAT SHOULD LAST THE LIFE OF A VEHICLE.  IT IS UNACCEPTABLE TO ALLOW A COMPANY TO OPERATE IN THIS MANNER.",
        "vin": "2LMDJ8JK2DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253382,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING 60 MPH, THE BRAKES FAILED. THE CONTACT DROVE TO APPLE FORD SHAKOPEE (1624 WESTON CT, SHAKOPEE, MN 55379, (952) 445-2420) WHERE IT WAS DIAGNOSED THAT THE BRAKE POWER BOOSTER MALFUNCTIONED AND NEEDED TO BE REPLACED; HOWEVER, THEY DID NOT HAVE THE PART AVAILABLE. THE DEALER STATED THAT THE VEHICLE SHOULD NOT BE DRIVEN BECAUSE THE BRAKES COULD FAIL COMPLETELY. THE VEHICLE WAS TOWED TO ANOTHER UNKNOWN FORD DEALER AND REPAIRED AT THE CONTACT'S EXPENSE. THE MANUFACTURER STATED THAT THERE WERE NO RECALLS FOR THE VEHICLE. THE FAILURE MILEAGE WAS 38,700.   *BF    CONSUMER SAYS THAT FAILURE IS SIMILAR TO THE FORD EDGE WHICH HAD A RECALL. CONSUMER MADE MANUFACTURER AWARE OF THIS CONNECTION, BUT THEY STILL REFUSED ASSISTANCE. *DL",
        "vin": "2LMDJ8JK0DB"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245337,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S POWER SHUT DOWN WITHOUT ANY WARNING ON BUSY CITY STREET (3 LANE ROAD). I WAS UNABLE TO STEER OR BRAKE. I HAD TO COAST OFF THE ROAD UNTIL CAR STOPPED. THEN I PUT IT INTO PARK. IT RESTARTED AND DROVE FINE AFTER THE RESTART. VERY SCARY. THANKFUL I WASN'T DRIVING 70 MPH ON BUSY INTERSTATE. THROTTLE BODY REPLACED RECENTLY AS ENGINE HAD BEEN  BUCKING AND WASN'T ACCELERATING WHEN GAS PEDAL WAS DEPRESSED.",
        "vin": "2LMDJ6JKXDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245119,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMEONE AT THE COMPANY EVIDENTLY DOES NOT UNDERSTAND THE AUTO ASSEMBLY PROCESS WHEREIN THE COMPONENT SUPPLIERS ARE REQUIRED TO WAREHOUSE COMPONENTS AND ASSEMBLIES FOR JUST IN TIME DELIVERY TO THE ASSEMBLY PLANTS. COMPONENTS AND ASSEMBLIES ARE STORED AND DELIVERED AS RETRIEVED , NOT IN ORDER OF MANUFACTURE, SO THE THE LAST PARTS DELIVERED MAY HAVE BEEN BUILT MONTHS BEFORE DELIVERY. BY SETTING A DEADLINE MANUFACTURE DATE OF MARCH 2013 FOR VACUUM BOOSTER ASSEMBLY YOU ARE ASSUMING THAT ALL THE DEFECTIVE PARTS HAVE BEEN PURGED FORM THE SYSTEM, WHEN THAT IS PROBABLY NOT THE CASE. SO MY 2013 LINCOLN MKX #2LMDJ6JK2DB[XXX] COULD POSSIBLY HAVE A VACUUM BOOSTER ASSEMBLY MANUFACTURED IN 2012, YET YOUR SYSTEM REFUSES TO ALLOW REPLACEMENT. THIS IS TOTALLY UNFAIR.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "2LMDJ6JK2DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244401,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING 65 MPH, THE CONTACT WAS UNABLE TO STOP THE VEHICLE WHEN THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT WAS ABLE TO MOVE THE VEHICLE TO THE SIDE OF THE ROAD WHERE IT EVENTUALLY STOPPED. THE VEHICLE WAS TAKEN TO STAR LINCOLN (24350 WEST 12 MILE ROAD, SOUTHFIELD, MI, 48034, (248) 354-4900) WHERE IT WAS DIAGNOSED THAT THE BRAKE BOOSTER FAILED. THE BRAKE BOOSTER WAS REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT ALSO STATED THAT THE FRONT BRAKES WERE PREVIOUSLY REPLACED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE BRAKE BOOSTER WARRANTY COVERAGE WAS FOR TEN YEARS AND 150,000 MILES. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243349,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FAMILY AND I WERE DRIVING ON I 20 FORT WORTH TX, DRIVING 60MPH. IT HAPPEN AGAIN WHILE DRIVING OUR 2013 LINCOLN MKX STARTED TO SLOW DOWN,WE KEPT PRESSING ON THE GAS PEDAL BUT NOTHING HAPPEN. WE WERE ABLE TO MOVE OVER TO THE FAR RIGHT HAND LANE. THIS INCIDENT TOOK PLACE SEVERAL TIMES THIS DAY AND WITH OUR CHILDREN IN THE CAR! ONE OF THE INCIDENTS ALMOST CAUSE AN ACCIDENT, BUT CARS WERE ABLE TO DIVERT AROUND US. CRAZY THING IS THAT NO WARNING LIGHTS HAD CAME ON NOR ARE ANY ON AT THIS POINT.  WE HAVE TRIED PRETTY MUCH FOR MOST OF THE DAY TO FIND SOME SORT OF ISSUE WITH OUR VEHICLE. HAVE DISCOVERED THAT THIS IS AN ON GOING ISSUE WITH MOST OF LINCOLN MKX. NO WARNING OR ANYTHING, YOUR VEHICLE WILL START TO SLOW DOWN AUTOMATICALLY AT ANY MOMENT IN WHICH PUTS YOUR LIFE AND YOUR FAMILIES LIVES IN DANGER. YET AGAIN NO ONE SEEMS TO BE ADDRESSING THIS ISSUE.  CONSUMER STATED I DO NOT KNOW EXACT MILEAGE AT INCIDENT, IT WAS ROUGHLY 4200. VEHICLE HAS BEEN TAKEN TO THE DEALERSHIP AND AN OIL CONSUMPTION TEST HAS BEEN STARTED AFTER OIL CHANGE. STICKER HAS BEEN PLACED ON WINDSHIELD FOR OIL CHANGE. SCHEDULED FOR 9286 MILES (5000 MILES OVER OIL CHANGE). VEHICLE WAS UNDER THE SERVICE MILEAGE WHEN THE STALL OCCURRED. NO WARNING LIGHTS OR NOISES BEFORE DURING OR AFTER EVENT. *JB",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 18, 2019, THE BRAKES ON MY 2013 MKX SUDDENLY BECAME VERY STIFF WITH  POOR BRAKING WHILE DRIVING IN TOWN.  I IMMEDIATELY TOOK IT TO A LOCAL SERVICE CENTER AND WAS INFORMED THAT THERE WAS A SAFETY RECALL ON THE 2013 MKX BRAKES AND IT WAS SUGGESTED I TAKE IT TO THE LOCAL FORD DEALERSHIP.  I WENT DIRECTLY THERE (LESS THAN 1 MILE) IT WAS DIAGNOSED BY THE SERVICE WRITER TO BE A DEFECTIVE BRAKE BOOSTER (BRAKE PEDAL STIFF, THEN WHILE PRESSING THE PEDAL, IT WENT TO THE FLOOR, AND A WHISTLING NOISE WAS HEARD) I HAD THE BRAKE BOOSTER REPLACED THE FOLLOWING DAY, HOWEVER THAT WAS NOT THE ONLY PROBLEM. THE BRAKES WENT FROM STIFF WITH POOR BRAKING ABILITY TO ABSOLUTELY NO BRAKES AT ALL.  INFORMED THAT THE PART NEEDED (ABS MODULE) IS ON NATIONAL BACKORDER-NONE CURRENTLY AVAILABLE IN THE UNITED STATES. MY CAR IS STILL AT THE REPAIR SHOP WAITING FOR THE NECESSARY PART TO COMPLETE THE BRAKE JOB. TODAY'S DATE IS AUGUST 7, 2019.  THE PART IS ON EMERGENCY ORDER, THERE IS NO INDICATION AS TO WHEN THE PART WILL BECOME AVAILABLE. I AM STRANDED WITHOUT A CAR.  I HAVE READ SEVERAL REPORTS OF EXACTLY THE SAME PROBLEM WITH THE 2013 LINCOLN MKX BRAKES AND SOME WERE RECALLED.  I WAS INFORMED THAT MINE WAS MANUFACTURED IN MAY 2013 AND THE RECALL ONLY COVERED THOSE MANUFACTURED THROUGH MARCH 2013.  I SEEMS OBVIOUS TO ME THAT THE PROBLEM WITH THE BRAKES WAS NOT RESOLVED AT THE MANUFACTURING PLANT, OR THE EXACT SAME ISSUE WOULD NOT STILL BE OCCURRING.    THIS IS A SERIOUS SAFETY ISSUE. DO WE HAVE TO WAIT TILL DEATHS AND SERIOUS INJURIES OCCUR BEFORE FORD COMPANY WILL DO THE RIGHT THING AND RECALL ALL 2013 LINCOLN MKX.  I HAD PLANS TO DRIVE MYSELF AND 2 GRANDSONS 300 MILES TO THE BEACH ON JULY 19,  WE WERE ALL DISAPPOINTED THAT OUR VACATION HAD TO BE CANCELLED, BUT I SHUTTER AT THE THOUGHT OF DRIVING ON THE INTERSTATE AND SUDDENLY HAVING NO BRAKES.  PLEASE DO THE RIGHT THING - RECALL 2013 MKX",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON INTERSTATE 69 IN HOUSTON, TEXAS WHEN I FEEL LT LIKE THE BRAKE PETAL WAS HARD TO PUSH AND ALSO HEARD A SOUND FROM THE DASH. THIS TERRIFIED ME SO I GOT OFF THE FREEWAY AND IMMEDIATELY LOOKED UP BRAKE CHECK LOCATION TO GO GET THE BRAKES CHECKED. I FOUND ONE 8 MILES AWAY AND DROVE THERE AND EXPLAINED TO A TECHNICIAN WHAT HAD HAPPEN. THE TECHNICIAN GOT INTO MY LINCOLN AND STEPPED ON THE BRAKE PEDAL AND SAID IT'S GOING ALL THE WAY DOWN TO THE FLOORBOARD AND HARD TO PUSH. AND HE ASKED ME IF IT FELT HARDER TO PUSH.  I TOLD HIM YES. HE CHECKED THE BRAKES OUT AND   TOLD ME IT WAS THE BRAKE BOOSTER. HE SAID WITH ONLY 41,700 MILES HE HIMSELF WOULD TAKE IT BACK TO THE DEALERSHIP. WE DON'T LIVE IN HOUSTON, AND WE WERE ON THE WAY HOME FROM HOUSTON AFTER MY HUSBAND HAVING SURGERY AND I NEEDED TO GET HIM HOME.  WE HAD NO CHOICE BUT TO DRIVE HOME. I DROVE IN THE MIDDLE LANE AT 55 MPH AND KEEPING A DISTANCE IN FRONT OF ME. WHEN I WOULD USE THE BRAKE I WOULD HAVE TO START BRAKING WAY AHEAD WHEN SOMEONE WOULD CUT I FRONT IF ME BECAUSE THE BRAKES WERE BARELY WORKING. I BABIED THE BRAKES ALL OUR 4 HOUR DRIVE HOME. PLEASE INFORM ME WHAT CAN BE DONE.  THIS SHOULD NOT BE HAPPENING TO A VEHICLE WITH ONLY 41,700 MILES. WE BOUGHT IT USED IN 2017 AFTER HURRICANE HARVEY. I'M THINKING THERE WAS A RECALL ON THE BRAKING SYSTEM AND IT WAS NEVER DONE BY THE PRIOR OWNERS AND THEY DECIDED TO SELL IT. THIS SHOULD APPLY TO THE LEMON LAW. BECAUSE WE WERE SOLD A DEFECTIVE VEHICLE. WE COULD HAVE BEEN KILLED  DRIVING ON A BUSY INTERSTATE IN HOUSTON TX.  TERRIFYING DRIVING HOME.  I",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230721,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED HAPPENING IN 2015, \"DOOR AJAR\" INDICATOR STAYS ON WHEN DOOR IS CLOSED, CAUSES INDICATOR LIGHT TO FLASH BACK AND FORTH BETWEEN THAT AND \"SHIFT TO PARK\" NON-STOP WHEN IN MOTION. IT PREVENTS THE CAR FROM BEING LOCKED WHILE STATIONARY AND IN MOTION, DANGEROUS WITH KIDS IN CAR. AT TIMES DOME LIGHTS WILL NOT GO OUT WHEN VEHICLE IS TURNED OFF. THE ALARM GOES AT RANDOM TIMES WHILE PARKED AND OFF, LAST NIGHT EVERY 2 HRS STARTING AT 12 AM. HAVE COME OUT OF WORK TO FIND LIGHTS FLASHING FROM ALARM HAVING GONE OFF. AFRAID TO PARK IN GARAGE NOW BECAUSE OF FIRE HAZARD. KEY FOB MUST BE PUSHED TO UNLOCK DRIVERS DOOR BUT NOT PASSENGER SIDE. STARTING IN 4-19 THE NAVIGATION SCREEN WHEN IN REVERSE AND BACKING UP RANDOMLY GOES BLACK.",
        "vin": "2LDMJ8JK0DB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I GOT INTO MY MKX AND CLOSED THE DOOR AND THE REAR WINDSHIELD EXPLODED, THERE WERE NO DINGS OR CHIPS AND NOTHING HIT INTO IT. I'VE BEEN READING ONLINE AND IT LOOKS LIKE ITS A PROBLEM I CAN'T AFFORD TO HAVE IT FIXED AND I AM HOPING FORD WILL DO THE RIGHT THING. THANK YOU",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210842,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER ISSUE",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189762,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE WAS IN PARK ON THE SIDE OF A STREET, IT SLIPPED OUT OF PARK AND ROLLED DOWN A HILL INTO A TREE DAMAGING THE FRONT BUMPER AND HOOD. THERE WAS $6500 IN DAMAGE.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, IN CITY TRAFFIC,  'LOW OIL PRESSURE' WARNING LIGHT CAME ON AND CAR STALLED. HAD TO PUT CAR INTO NEUTRAL AND RESTART. PULLED INTO A PARKING LOT TO CHECK OIL LEVELS AND IT WAS FINE.",
        "vin": "2LMDJ6JK1DB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156959,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT HEADLIGHTS (DRIVING LIGHTS) GO COMPLETELY OUT WHILE CAR IS DRIVING DOWN THE ROAD.  THIS STARTED WITH THE RIGHT HEADLIGHT WHEN THE CAR WAS LESS THAN TWO YEARS OLD AND NOW BOTH HEADLIGHTS GO OUT WHILE DRIVING.  THE LIGHTS CAN BE TURNED BACK ON BY TURNING THE SWITCH OFF AND THEN BACK ON.  VERY DANGEROUS TO DRIVE??",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145233,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL # 14V393000 IS WITH MAKE, MODEL & YEAR, BUT NOT VIN #.  STARTING A MONTH AGO, THE CAR ROLLS WHEN IN PARK ESPECIALLY ON UNEVEN PAVEMENT. SHOULD YOU LOSE POWER, AS  HAPPENS WITH THIS PROBLEM GOING 70 MPH, IT WILL RESULT IN DEADLY CRASH.  CONTACTED LINCOLN CUSTOMER SERVICE REPRESENTATIVE DESIREE WHO REFUSED TO PAY FOR INSPECTION TO SEE IF HALFSHAFT AND LINKSHAFT ARE THE PROBLEM.  CONSIDERING THIS COULD RESULT IN LOSS OF LIFE IN DEADLY ACCIDENT, YOU WOULD THINK THEY WOULD GLADLY PAY FOR THE INSPECTION.  I AM SUPPOSE TO PAY $175 FOR THIS. CAN YOU HELP?  SHE WOULDN'T    EVEN TELL ME WHERE MY CAR WAS MADE.  I FOUND IT WAS MADE AT FORD OF CANADA, LTD. AT OAKVILLE PLANT IN 2013.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL # 14V393000 IS FOR MY MAKE, MODEL & YEAR, BUT NOT THE VIN # (LINCOLN 2013 MKX).  THE CAR IS HAVING THE SAME PROBLEM AS ON THIS RECALL.  STARTING A WEEK AGO, MY CAR MOVES & ROLLS WHEN PUT IN PARK ESPECIALLY ON UNEVEN PAVEMENT.  SHOULD YOU LOSE POWER GOING 70 MPH IF THIS RECALL  IS CAUSING THE  PROBLEM, IT WILL RESULT IN DEADLY CRASH.  CONTACTED  LINCOLN CUSTOMER SERVICE REPRESENTATIVE WHO REFUSED TO PAY FOR INSPECTION TO CHECK IF HALFSHAFT AND LINKSHAFT ARE CAUSING  THE CAR TO MOVE WHEN IN PARK.  CONSIDERING THIS COULD RESULT IN LOSS OF LIFE IN DEADLY ACCIDENT, YOU WOULD THINK THEY WOULD GLADLY PAY FOR THE INSPECTION.  I AM SUPPOSE TO PAY $175 FOR THIS INSPECTION. CAN YOU HELP?  CAR WAS MADE AT FORD OF CANADA, LTD. AT OAKVILLE PLANT IN 2013.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133089,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR IN SEPTEMBER 29, 2013, WITH 3 MILES ON IT.  IT CURRENTLY HAS JUST OVER 20,000 MILES ON IT.  THE BRAKE BOOSTER STARTED HISSING, SQUEALING, WHEN I DEPRESSED THE BRAKES TO START THE CAR LAST WEEK, BUT I THOUGHT IT WAS BECAUSE I HAD JUST WASHED THE CAR.  NOW THE CAR WAS JUST OUT OF WARRANTY.  THIS SHOULD BE COVERED UNDER THE WARRANTY, BUT LINCOLN WANTS $1,000 TO REPAIR.",
        "vin": "2LMDJ6JK3DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DEPRESSING THE BRAKE PEDAL, A HISSING NOISE CAN BE HEARD COMING FROM THE VEHICLE AND THE PEDAL EFFORT REQUIRED TO STOP THE VEHICLE HAS BECOME HARDER. WHILE INVESTIGATING THIS MATTER, MY MECHANIC FOUND A RECALL CONCERNING THE EXACT SAME ISSUE I WAS HAVING ON THE SAME EXACT MAKE, MODEL, AND YEAR AS MINE (RECALL NUMBER 13NO2). WHEN I WENT TO THE FORD SERVICE DEPARTMENT, I WAS TURNED AWAY AS MY VIN WASN'T FOUND UNDER THAT RECALL EVEN THOUGH THEY ACKNOWLEDGED THAT MY VEHICLE WAS HAVING THE SAME ISSUES AS THE RECALL STATED FOR THE EXACT SAME VEHICLE AS MINE.",
        "vin": "2LMDJ6JK4DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR AJAR LIGHT WILL NOT GO OUT...CAUSING INTERIOR LIGHTS TO STAY ON AFFECTING VISIBILITY AT NIGHT,,,AND CAUSING BATTERY TO RUN DOWN... VEHICLE HAS ONLY BEEN DRIVEN 27,000 MILES ...VEHICLE WAS IN MOTION ON A CITY STREET WHEN THIS WAS NOTICED...ALSO DOORS WILL NOT LOCK AND ALARM WILL NOT SET WHEN PARKING  WHEN THIS DOOR SWITCH MALFUNCTIONS",
        "vin": "2LMDJ6JK2DB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120119,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER DIAPHRAGM LEAK, AIR HISSING SOUND FROM BRAKE BOOSTER.  FORD HAS ALREADY ISSUED 'CUSTOMER SATISFACTION PROGRAM' 13N02 REGARDING BRAKE BOOSTER/MASTER CYLINDER PROBLEM'   \"CERTAIN 2010-2013 MODEL YEAR EDGE AND MKX VEHICLES BUILT AT THE OAKVILLE ASSEMBLY PLANT FROM MAY 3, 2010 THROUGH MARCH 28, 2013.  AFFECTED VEHICLES ARE IDENTIFIED IN OASIS.\" OUR MKX WAS BUILT IN JULY OF 2013 AND IS EXPERIENCING THE SAME PROBLEM.",
        "vin": "2LMDJ8JK2DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR SENSOR FAULT. VEHICLE SENSOR READS DOOR AS OPEN WHEN CLOSED, DRAINS BATTERY.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR CONSTANTLY SAYS DOOR IS AJAR. WILL NOT ALLOW ME TO START CAR WITH MY KEY FOB. CAUSES ALARMS TO GO OFF WHILE DRIVING.",
        "vin": "2LMDJ8JK4DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104094,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 MKX DOES NOT RECOGNIZE WHEN GEAR SHIFTER HAS BEEN MOVED TO \"PARK\".  ERROR MESSAGE LIGHT \"SHIFT TO PARK\" COMES ON.  P LIGHT IS NOT ILLUMINATED.  DRIVER HAS TO REPEATEDLY SHIFT FROM PARK TO ANOTHER GEAR (NEUTRAL, DRIVE, PARK, REVERSE) AND BACK TO PARK UNTIL P IS ILLUMINATED AND RECOGNIZED TO BE IN PARK.  VEHICLE IS STATIONARY WHEN THIS OCCURS.  THIS BEGAN IN EARLY 6/2018 AND OCCURRED  INTERMITTENTLY UNTIL A NEW GEARSHIFT SWITCH FP #GT4Z-3F988-B WAS INSTALLED ON 6/22.  THIS ERROR HAS BEEN FREQUENTLY REPORTED IN MULTIPLE LINCOLN AND OTHER FORUMS.",
        "vin": "2LMDJ6JK5DB"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/08/2018",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100627,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED THAT THE FRONT DRIVER'S DOOR DID NOT SECURELY LATCH, CAUSING THE DOOR TO UNEXPECTEDLY OPEN WHILE THE CONTACT WAS DRIVING. THE CONTACT ALSO STATED THAT THE FAILURE CAUSED THE BATTERY IN THE VEHICLE TO DIE. THE CONTACT STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V210000 (LATCHES/LOCKS/LINKAGES). THE DEALER (FRANKLIN PARK LINCOLN, INC., 5272 MONROE ST, TOLEDO, OH 43623) REPLACED THE DOOR LATCH. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 39,362. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "04/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098969,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS 2013 LINCOLN MKX IN OCTOBER OF 2017. IT WAS A USED VEHICLE BUT APPEARED TO BE IN EXCELLENT CONDITION. IN APRIL, THE SUNROOF FLIPPED BACK AND CHIPPED THE BACK GLASS OF THE PANORAMIC ROOF.   CONSIDERING THIS IS A KNOWN PROBLEM REGARDING FORD AND THEIR SUNROOFS, MY INSURANCE REFUSES TO COVER IT. I AM A SINGLE MOTHER OF 3 AND JUST WANTED SOMETHING NICE FOR ONCE. THE DAMAGE COSTS MORE THAN THE CARS TRADE IN VALUE.   I HAVE HAD BAD LUCK WITH FORD IN THE PAST. I SHOULD HAVE KNOWN BETTER.",
        "vin": "2LMDJ6JK1DB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096228,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 LINCOLN MKX. CONSUMER WRITES IN REGARDS TO BROKEN BALL JOINTS. *LD    THE CONSUMER STATED 45 DAYS AFTER PURCHASING THE VEHICLE THE BALL JOINTS FAILED. THE CONSUMER REQUESTED TO BE REIMBURSED FOR THE REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS DRIVING TO WORK ON MARCH 15, 2018, AROUND 2 PM EST, ON A DIVIDED ROAD  AROUND 35 MPH. CLEAR SUNNY DAY WITH NO TRAFFIC AROUND HER. SHE HEARD A VERY LOUD NOISE AND PULLED INTO THE NEAREST PARKING LOT TO SEE WHAT HAPPENED. SHE LOOKED AT THE BODY OF CAR AND TIRES AND DID NOT SEE ANYTHING. SHE CONTINUED TO WORK, AROUND 3 MILES, AND LOOKED AGAIN WHEN SHE ARRIVED. SHE THEN NOTICED THE VISTA GLASS TO THE REAR OF THE SUNROOF HAD IMPLODED. FROM THE INSIDE IT WAS ALL SHATTERED BUT IN TACK. FROM THE OUTSIDE THERE WERE VISIBLE CRACKS. SEE INSIDE AND OUTSIDE PHOTO. WHEN WE CALLED LINCOLN TO SEE IF THERE WERE ANY RECALLS OR ANY KNOWN ISSUES, THEY SAID NO AND TO CALL INSURANCE SINCE GLASS IS NOT COVERED. WHEN WE RESEARCHED ON THE WEB, WE SAW A NUMBER OF POSTINGS FOR SIMILAR IMPLOSIONS ON LINCOLN MODELS AND FORD EDGE. POSTINGS SAID TO FILE A COMPLAINT FOR A RECALL.",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"DOOR AJAR\" INDICATOR STAYS ON WHEN THE DOORS ARE CLOSED.  THIS CAUSES OTHER INDICATOR LIGHTS TO ACTIVATE SUCH AS \"SHIFT TO PARK\".  IT ALSO PREVENTS THE CAR FROM BEING LOCKED FROM THE INSIDE. IT IS ANNOYING AND CAN BE DANGEROUS.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066199,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW-UP TO NHTSA ID NUMBERS: 11047965 AND 11055106. ENGINE SHUTDOWN AT SPEED ON HIGHWAY WITHOUT WARNING.  FIRST INCIDENT ON HIGHWAY AT SPEED IN CENTER OF 3 LANES.  AFTER FIRST INCIDENT, FILED NHTSA COMPLAINT 11047965, TOOK CAR TO DEALER AND REPLACED FUEL PRESSURE SENSOR BASED ON FAULT CODE.  ABOUT 2 WEEKS AND 400 MILES LATER, 2ND AND 3RD ENGINE SHUTDOWN INCIDENTS WITHIN 15 MINUTES AT SPEED ON INTERSTATE.  FILED NHTSA COMPLAINT 11055106 AND REPLACED THROTTLE BODY BASED ON DEALER RECOMMENDATION (NO CODES).  ABOUT 2 WEEKS AND 600 MILES LATER, 4TH ENGINE SHUTDOWN OCCURRENCE, THIS TIME AT 35 MPH ON NEIGHBORHOOD STREET. AS BEFORE ENGINE SHUTDOWN RESULTS IN LOSS OF PROPULSION, POWER STEERING, AND POWER BRAKES. AFTER STOPPING, ABLE TO RESTART ENGINE NORMALLY AND CONTINUE WITHOUT FURTHER INCIDENT. ENGINE SHUTDOWN IS ACCOMPANIED BY NO WARNINGS, ALARMS, OR INDICATIONS OTHER THEN THE INSTRUMENT PANEL GOING DARK AND THE LOSS OF PROPULSION. SO FAR HAVE BEEN FORTUNATE TO NAVIGATE TO THE RIGHT SHOULDER WITHOUT COLLISION AND COAST TO A STOP IN ALL 4 OCCURRENCES, THOUGH THIS IS DANGEROUS IN A HEAVY TRAFFIC ENVIRONMENT. MY ONLINE RESEARCH INDICATES THIS IS A RECURRING PROBLEM ON LINCOLN MKX AND FORD EDGE FOR MANY OTHER DRIVERS AND DEALERS ARE AT A LOSS TO EXPLAIN OR SUCCESSFULLY REPAIR.  MANUFACTURER NEEDS TO IDENTIFY CAUSE AND REPAIR BEOFRE SOMEONE GETS KILLED.",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SO FAR THIS HAS HAPPENED NOW 4 TIMES. WHILE DRIVING MY CARE AT 35 MPH, MY CAR WILL LOSE ALL POWER AS WELL AS THE STEERING WHEEL WILL LOCK. MY CAR WILL BEGAN TO GO IN ITS OWN DIRECTION AND I HAVE TO BRING THE CAR TO A COMPLETE STOP IN THE MIDDLE OF TRAFFIC, PUT IT IN PARK AND TURN IT OFF AND START IT BACK UP AGAIN. I HAVE TWO CHILDREN AND LOSING NOT ONLY THE POWER OF THE VEHICLE BUT ALSO THE STEERING IS VERY CONCERNING. I HAVE CONTACTED LINCOLN AND THEY HAVE LET ME KNOW THAT THIS IS A VALID RECALL FOR OVER 83,000 VEHICLES MADE IN THE SAME YEAR BUT IT IS NOT ON MY VEHICLES RECALL LIST. I AM VERY CONCERNED ABOUT THIS.",
        "vin": "2LMDJ6JKXDB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056927,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER HAS TEAR PREVENTING CAR FROM STOPPING WHEN BRAKE IS APPLIED,CAR HAS APPROXIMATELY 30100 MILES. TOOK CAR TO LINCOLN DEALER SERVICE DEPT AND WAS TOLD YES THERE IS A PROBLEMS WITH BRAKE BOOSTER BUT MY VIN NO HAS NOT BEEN RECALLED WHILE OTHERS WERE FOR 2013 AND THEREFORE MY CLAIM WOULD BE NOT HONORED UNDER RECALL",
        "vin": "2LMDJ6JK2DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055106,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW-UP TO NHTSA ID NUMBER: 11047965    AFTER FILING NHTSA COMPLAINT 11047965, TOOK CAR TO DEALER FOR INVESTIGATION.  COMPUTER HAD RECORDED A CODE FOR THE FUEL PRESSURE SENSOR WHICH WAS THEN REPLACED.  AFTER THE REPAIR, DROVE ABOUT 2 WEEKS AND 400 MILES (INCLUDING SEVERAL HOURS AT HIGHWAY SPEEDS) WITHOUT FURTHER INCIDENT.  THEN ON INTERSTATE HIGHWAY AT SPEED (70 MPH ON CRUISE CONTROL), THE ENGINE STOPPED WITHOUT WARNING OR ALARM, RESULTING IN LOSS OF PROPULSION, POWER STEERING, AND POWER BRAKES.  WAS ABLE TO COAST TO A STOP ON THE RIGHT SHOULDER WITHOUT COLLISION.  WAS ABLE TO RESTART ENGINE NORMALLY AND CONTINUE, BUT THE EVENT RECURRED A SECOND TIME 10 MINUTES LATER WITH THE SAME RESULTS.  WAS ABLE TO DRIVE ABOUT 80 MILES TO HOME WITHOUT FURTHER INCIDENT.  ENGINE SHUTDOWN IS ACCOMPANIED BY NO WARNINGS, ALARMS, OR INDICATIONS OTHER THEN THE INSTRUMENT PANEL GOING DARK AND THE LOSS OF PROPULSION.  FORTUNATELY HAVE BEEN ABLE TO GET TO RIGHT SHOULDER WITHOUT CAUSING A TRAFFIC INDECENT, THOUGH THIS WOULD BE DANGEROUS IN A HEAVY TRAFFIC ENVIRONMENT.  PLAN TO TAKE TO DEALER AGAIN NEXT WEEK FOR FURTHER INVESTIGATION.",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AT NIGHT, WHILE AT SPEED (60 MPH) IN CENTER LANE OF A CROWDED HIGHWAY DURING EVENING COMMUTE, THE ENGINE STOPPED, RESULTING IN LOSS OF PROPULSION, POWER STEERING, AND POWER BRAKES.  FORTUNATELY WAS ABLE TO COAST TO A STOP ON THE RIGHT SHOULDER WITHOUT COLLISION.  WAS ABLE TO RESTART ENGINE NORMALLY AND PROCEED HOME (ABOUT AN HOUR) WITHOUT FURTHER INCIDENT.  NEXT DAY DID SOME LOW SPEED (5 MPH) TESTING IN A QUIET AREA TO INVESTIGATE POSSIBLE CAUSES.  COULD NOT REPLICATE WITH ANY BUTTON ON REMOTE OR STEERING WHEEL.  SYMPTOMS COULD BE REPLICATED BY PRESSING ENGINE START/STOP BUTTON WHILE IN MOTION.  THIS BUTTON IS TOO HIGH TO HIT WITH DRIVER'S KNEE AND LOCATED WHERE ACCIDENTAL TOUCH BY DRIVER'S ARM/HAND IS HIGHLY UNLIKELY.  BOTH DRIVER AND FRONT SEAT PASSENGER SAY THIS BUTTON WAS NOT ACTIVATED DURING THE INCIDENT.  NO FURTHER RECURRENCE IN NORMAL DRIVING ON THE FOLLOWING DAY.  NO SYSTEM MESSAGES ON VEHICLE INFORMATION DISPLAY.  PLAN TO TAKE TO DEALER NEXT WEEK FOR FURTHER INVESTIGATION.  MILEAGE 55100",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046868,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST LEAK IN CABIN.    I PURCHASED THE 2013 MKX IN APRIL 2017, SOON AFTER I BEGAN NOTICING AN EXHAUST SMELL IN THE CAR SHORTLY AFTER FAST ACCELERATION.  I BROUGHT THE VEHICLE INTO THE FORD DEALERSHIP WHERE I PURCHASED IT IN JUNE AND JULY, WHO SEALED AND RESEALED THE BUMPER WHICH HAD NO IMPROVEMENT AND THEN BY DIRECTION FROM LINCOLN CORPORATE TOOK THE VEHICLE TO TWO OTHER DEALERSHIPS WHO REPEATED THE ORIGINAL REPAIRS AND HAVE YET TO FIX THE PROBLEM.  LINCOLN OFFERED ME AN X PLAN DISCOUNT TO PURCHASE A NEW FORD OR LINCOLN MODEL BUT STATED THAT AT THIS POINT THEY DO NOT HAVE ANY ADDITIONAL REPAIRS FOR THIS ISSUE.  THE VEHICLE CAN NOT BE DRIVEN FOR LONG DISTANCES WITHOUT PASSENGERS AND THE DRIVER EXPERIENCING HEADACHES, BURNING EYES, NAUSEA, AND DISORIENTATION.  THE SMELL IS NOTICEABLE DURING HARD ACCELARATION, HOWEVER, SYMPTOMS DEVELOP WITHIN THIRTY MINUTES OF DRIVING WITH THE A.C. ON AND OFF CAUSING ME TO BELIEVE FUMES ARE ENTERING THE CABIN DURING ALL DRIVING CONDITIONS BUT ONLY NOTICE THE ODOR DURING HARD ACCELERATION.  IS THERE ANYTHING THAT CAN BE DONE TO CORRECT THE ISSUE AS LINCOLN AS WELL AS THE SEVERAL DEALERSHIPS STATED THERE IS NO FIX BUT THEIR ENGINEERS ARE LOOKING INTO IT.  IN THE MEANTIME I CAN'T SAFELY DRIVE THE CAR FOR ANY LENGTH OF TIME AND I CAN'T AFFORD A NEW LINCOLN OR FORD EVEN WITH THE OFFERED DISCOUNT.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE USED IN NOVEMBER 2015. NOTICED EVERY TIME I PUT GASOLINE IN THE VEHICLE, IT WOULD NOT START ON THE FIRST ATTEMPT. MONTHS LATER, CHECK IN LIGHT COME ON, TOOK VEHICLE TO A FORD DELERSHIP (IN 2016) AND WAS TOLD NOTHING WAS WRONG WITH THE VEHICLE. AS TIME WENT ON, THE ISSUE WITH REFUELING AND ENGIN LIGHT COUNTIED. IN 2017 WHILE DRIVING ON THE HIGHWAY IN RUSH HOUR TRAFFIC, A WARNING LIGHT APPEARED (LOW OIL ENGIN PRESSURE) AND THE VEHICLE STALLED. DEALERSHIP SAID IT WAS THE THROTTLE BODY AND REPLACED IT. ABOUT A WEEK LATER, ENGIN LIGHT APPEARED AND ONE MONTH LATER RECEIVED SAME LOW OIL PRESSURE AND THE VEHICLE STALLED OUT AGAIN WHILE DRIVING. VEHICLE HAS NOT BEEN REPAIRED, CURRENTLY IN THE SHOP.",
        "vin": "2LMDJ6JK4DB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "10/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN GREEN X",
                "productModel": "RADIAL X",
                "productYear": "9999",
                "size": "P225/65R17",
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A 2013 LINCOLN MKX IN APRIL 2015; DEALER SAID THEY INSTALLED 4 NEW MICHELIN GREEN-X TIRES, LATITUDE TOUR 245/60 R18, DOT AP4A 005X, AND WAS TOLD THEY ARE RATED AT 90,000 MILES  I RECENTLY FELT A VIBRATION WHILE DRIVING AT 55-60 MPH SO I CHECKED THE TIRES VISUALLY AND FOUND WHAT LOOKED LIKE LITTLE JIGSAW SHAPED PIECES OF TREAD THAT YOU COULD ACTUALLY LIFT WITH A TOUCH OF YOUR FINGER!! I CALLED THE DEALER WHERE I BOUGHT THE CAR (& TIRES) AND THEY SAID THEY WOULD TOW IT TO THEIR SERVICE FACILITY. I DECIDED TO DRIVE IT THERE, AND BY THE TIME I ARRIVED (ABOUT 40-45 MILES) ALL THOSE FLAPS OF RUBBER WERE GONE!! THEY HAD COME OFF AND LEFT GAPING HOLES WHERE THE TREAD USED TO BE, ALL OVER THE FRONT TIRES.  THE SERVICE MANAGER SAID HE'D NEVER SEEN ANYTHING LIKE IT AND CALLED OTHER MECHANICS AND SERVICE PERSONNEL; THEY WERE ALL CURIOUS AS WELL.  THE DEALERSHIP REPLACED ALL 4 TIRES WITH MORE MICHELINS, THEN MY SON TOLD ME THE TIRES ARE DEFECTIVE AND SHOULD BE RECALLED. IT DOESN'T SEEM THAT MICHELIN IS VERY CONCERNED ABOUT THEIR CUSTOMER'S SAFETY, AS THIS WEBSITE DOESN'T LIST MY TIRES AS BEING RECALLED. THE DEALERSHIP CHARGED ME ABOUT $1000 FOR THE NEW TIRES, BUT I'M VERY WORRIED THESE TIRES ARE ALSO DEFECTIVE!!  I THINK MICHELIN OR THE DEALERSHIP SHOULD REPLACE THE TIRES FOR FREE, WITH SOMETHING ELSE THAT IS NOT DEFECTIVE!  I WILL NEVER BUY MICHELIN TIRES AGAIN, NOR WILL I BUY ANOTHER VEHICLE FROM THIS DEALERSHIP.",
        "vin": "2LMDJ8JK4DB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2017",
        "dateOfIncident": "10/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031953,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TUESDAY 10/3/2017 AROUND 5:35 PM WE WERE DRIVING THE 2013 MKX ON CALLAGHAN ROAD UNDER CONSTRUCTION AND STOPPED BEHIND ANOTHER CAR  WAITING FOR THE ONE LANE TRAFFIC TO MOVE FORWARD WHEN THE MKX UNEXPECTEDLY REVVED UP AND LUNGED TOWARDS THE REAR OF THE CAR IN FRONT OF US.  WE IMMEDIATELY RECOGNIZED THIS AS SUA SUDDEN UNINTENDED ACCELERATION. THE DRIVER HAD TO APPLY ADDITIONAL PRESSURE ON THE BRAKES TO HOLD THE CAR BACK.",
        "vin": "2LMDJ6JKXDB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2017",
        "dateOfIncident": "10/03/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NEAR THE END OF MY 35 MINUTE COMMUTE HOME I STOPPED AT A RED LIGHT ON A BUSY CITY STREET.  WHEN THE LIGHT TURNED GREEN, I PUT MY FOOT OFF THE BRAKE AND PLACED IT ON THE ACCELERATOR. . THE CAR WOULD NOT ACCELERATE.  THE LOW ENGINE PRESSURE LIGHT CAME ON. I TURNED THE STEERING WHEEL TO COAST THE CAR TO THE RIGHT LANE. I PUT THE CAR IN PARK. I HAD THE CAR TOWED TO A DEALER.  THE DEALER COULD NOT DUPLICATE THE PROBLEM AND THE COMPUTER HAD NO HISTORY OF THE ERROR MESSAAGE.  VERY TROUBLING.  I DRIVE THE FREEWAY TO WORK DURING EARLY MORNING HOURS.  IF THIS HAD OCCURRED ON THE FREEWAY, THE CAR WOULD'VE BEEN AN EASY TARGET FOR TRAFFIC BEHIND ME.",
        "vin": "2LMDJ6JK9DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTS OFF WHILE DRIVING. VEHICLE STALLS ON ACCELERATION.  THROTTLE BODY WAS REPLACED 14 DAYS AGO, ISSUE STILL EXISTS.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019308,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. ON SEVERAL OCCASIONS, WHILE DRIVING 75 MPH, THE ENGINE STALLED AND LOST POWER. ALSO, THE POWER TRAIN FAULTY INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER (BILL HOOF FORD LINCOLN, LOCATED AT 1500 N MORRISON BLVD, HAMMOND, LA 70401, (985) 345-1590), BUT NO DIAGNOSTIC CODES WERE FOUND AND THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 59,000.",
        "vin": "2LMDJ6JK1DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS BEEN OCCURRING SINCE 2014.  I HAVE TAKEN IT TO THE DEALERSHIP WHEN I LIVED IN OHIO ABOUT THIS ISSUE.  THE DOOR AJAR WARNING ON THE DASHBOARD AS WELL AS THE DOME LIGHT WHILE I'M DRIVING STAYS ON STATING THAT THE DOOR IS AJAR WHICH KEEPS THE DOORS FROM LOCKING AND THE DOME LIGHT STAYS ON WHICH IS A SAFETY ISSUE.  THIS ALSO OCCURS WHILE IT'S PARK AND IT SOMETIMES COMES ON BY ITSELF WHICH CAUSES THE ALARM TO GO OFF. THE DEALERSHIPS ARE AWARE OF THIS ISSUE ON THESE VEHICLES AND ARE WAITING FOR FORD/LINCOLN TO TAKE CORRECTIVE ACTION.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU PUT THE GEAR SHIFT IN PARK AND TURN THE SUV OFF, THE WARNING LIGHT WILL COME ON THE DASHBOARD STATING THAT THE VEHICLE IS NOT IN PARK.  YOU HAVE TO EITHER RESTART THE SUV AND TAKE IT OUT OF PARK A FEW TIMES OR DO NOT RESTART AND HIT THE BUTTON ON THE SHIFTER A FEW TIMES TO GET THE LIGHT TO TURN OFF.  THIS IS A REOCCURRING ISSUE THAT HAS OCCURRED SINCE 2015.",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/18/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LINCOLN MKX 2013 STALLS, THE WRENCH DISPLAYS, AND SLOWS DOWN. THAN YOU HAVE STOP AND RESTART CAR.  SO FAR THIS HAS HAPPENED OVER 5 TIMES IN ONE YEAR, MORE IN THE RECENT WEEKS. VERY DANGEROUS IN TRAFFIC. AFTER RESEARCH ON INTERNET LOOKS LIKE THROTTLE BODY BUT LINCOLN SAYS MY CAR IS NOT ON THE RECALL LIST",
        "vin": "2LMDJ6JKXDB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE NEW IN 2013 AND 3 OF 4 DOOR SENSORS HAVE MALFUNCTIONED.  THE DOOR AJAR LIGHT IS ALWAYS ON SO MY DOORS WILL NOT LOCK WHILE DRIVING.  THIS IS A VERY SERIOUS CONCERN AS I HAVE SMALL CHILDREN AS PASSENGERS, ALSO GOD FORBID I AM IN A SITUATION WHERE I NEED TO LOCK MYSELF IN MY CAR FOR SOME REASON; I AM SCREWED!  THE ALARM CONSTANTLY GOES OFF IF I LOCK/ARM THE ALARM OR AND LOCK DOORS BECAUSE OF THE DOOR SENSORS.  THE DOME LIGHT ILLUMINATES AT RANDOM TIMES WHILE DRIVING, VERY ANNOYING WHILE DRIVING AT NIGHT, ANOTHER SAFETY ISSUE IN MY OPINION.  WHEN THE FIRST SENSOR STARTED ACTING UP I TOOK THE VEHICLE TO THE DEALER AND THEY QUOTED ME $420! AS IT STANDS RIGHT NOW I WOULD HAVE TO PAY OVER $1200 TO REPAIR FAULTY DOOR SENSORS ON A VEHICLE THAT IS LESS THAN 5 YEARS OLD.  I WAS SIMPLY TOLD BY THE FORD DEALER THAT I SHOULD HAVE PURCHASED AN EXTENDED WARRANTY AND THAT THE ISSUE IS NOT COVERED UNDER A RECALL BECAUSE IT IS NOT A SAFETY ISSUE.  AS A PARENT WITH TWO YOUNG CHILDREN I REFUSE TO ACCEPT THAT NOT BEING ABLE TO LOCK MY DOORS WHILE DRIVING IS NOT A SAFETY ISSUE.  FROM WHAT  I HAVE BEEN READING ONLINE MANY FORD AND LINCOLN MODEL CARS ARE EXPERIENCING THE SAME ISSUES.  SOMEONE NEEDS TO HOLD FORD/LINCOLN ACCOUNTABLE AND MAKE THEM FIX THIS ISSUE AT NO CHARGE TO THE CONSUMER.  I ALREADY PAID THEM A HEFTY PRICE TO PURCHASE THE VEHICLE LESS THAN 5 YEARS AGO.  THERE IS ABSOLUTELY NO REASON ALL OF THESE MECHANISMS SHOULD BE FAILING OR ALREADY FAILED IN SUCH A SHORT AMOUNT OF TIME.  THIS IS UNACCEPTABLE!!!      * 11/01/2015 IS THE APPROXIMATE DATE WHEN SYMPTOMS/ISSUES FIRST BEGAN.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10993694,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT DID NOT LOCK, RESULTING IN DEATH OF DRIVER. DRIVER HIT A TREE HEAD ON THE SEATBELT DID NOT LOCK CAUSING DRIVER TO COME UP HIT THE REAR VIEW MIRROR WITH BACK OF HEAD THEN LAND ON TOP OF STEERING WHEEL.",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978661,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR WARNING ON DRIVERS DOOR WITH DOOR CLOSED.  DOME LIGHT STAYS ON.  DOORS WILL NOT LOCK.  THIS WARNING HAPPENS WHEN VEHICLE IS STATIONARY AND IN MOTION.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2017",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969519,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED THAT WHILE DRIVING AT 10 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE ELECTRONIC THROTTLE BODY FAILED ON TWO OCCASIONS. THE VEHICLE WAS REPAIRED AT THE DEALER WHERE THE THROTTLE BODY WAS REPLACED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 41,000.",
        "vin": "2LMDJ6JK6DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955389,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DOORS FAIL TO LATCH, WITH SEVERAL REPORTS INDICATING THAT THE 'DOOR AJAR' WARNING LIGHT ON THE DASH APPEARED AND CABIN LIGHTS STAYS ON WHILE DRIVING AND STAYS ON AFTER CLOSING DOORS! THE ONLY WAY TO TURN THEM OFF IS TO UNPLUG BATTERY! THIS IS THE 3RD TIME THAT I HAVE BEEN REPAIRING DIFFERENT DOORS LATCH AND I AM SURPRISED WHY CAR SAFETY RECALL HAS NOT BEEN ISSUED YET ON THESE MODELS. IT'S VERY EXPENSIVE TO REPAIR AND IT'S A CAUSING A MAJOR SAFETY ISSUE WHEN DRIVING NIGHT TIME WITH CABIN LIGHT ON AND AJAR WARNING SYSTEM IS OFF!!!! PLEASE NOTE THAT SAME ISSUE OCCURS EVERY YEAR WITH MORE THAN ONE DOOR (2014/2015/2016/2017)",
        "vin": "2LMDJ8JK1DB"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954243,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY LINCOLN MKX 2013 NEW FROM SUTTON FORD.  THE TIRES ON THE CAR AT THE TIME WERE PIRELLI SCORPION TIRES.  WITHIN LESS THAN YEAR FROM TIRE EXPLODED FROM THE SIDE WALL WHILE ON MY WAY TO WORK.  NO ONE WAS HURT.  HOWEVER, I HAD TO REPLACE THE TIRE.  LESS THAN A MONTH LATER TWO OTHER TIRES BEGAN TO LEAK WITH REPORT INITIALLY THAT IT WAS THE 20\" CHROME ALLOY WHEEL WHICH WAS MALFUNCTIONING.  THE REMAINING FOUR TIRES AND WHEELS WERE REPLACED LESS THAN A YEAR LATER I WAS CALLED A DEALER CLOSE TO WORK WHERE I HAD TAKEN THE CAR FOR OIL CHANGE AND TO REPORT RUMBLING WHEN I WAS DRIVING.      I RECEIVED A CALL FROM THAT DEALERSHIP STATING THE CAR WAS \"UNSAFE TO DRIVE\" THERE ISSUE WITH ESSENTIALLY ALL THE TIRES WITH SIDE WALL RUPTURE IMPENDING ON ONE AND REMAINING THREE WITH SEVERE COMPROMISE.  THESE TIRES WERE LESS THAN A YEAR OLD.  I HAD TO HAVE THE CAR TOWED TO A LOCAL FACILITY FOR REPAIR.  MY EXTENDED WARRANTLY ONLY PAID FOR 75 DOLLARS OF THE TOW. WHICH WAS 100 DOLLARS FOR ME.  I HAD FOUR NEW GOODYEAR TIRES PUT ON THE CAR AND DROVE HOME THAT EVENING .  THE NEXT MORNING WE AWOKE TO FIND TWO OF THE TIRES WERE FLAT.  I HAD TO HAVE A SECOND TOW TO THE REPAIR SHOP AND THETECHNICIAN THERE REPORTED A DEFECT WITHIN MY WHEELS.",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT NOTICED THAT THE BUMPER WAS CRACKED AND SEPARATED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED MONTHS LATER. THE CONTACT MENTIONED THAT THE BUMPER WAS ATTRACTING HEAT. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE TECHNICIAN NOTICED THAT THE BUMPER WAS VERY HOT AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 23,000.",
        "vin": "2LMDJ8JK7DB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOORS DO NOT LOCK WHILE DRIVING AND THE INTERIOR DOME LIGHT STAYS ON WHILE DRIVING.  IT HAS BEEN TO THE DEALERSHIP AND IT STOP FOR A FEW MONTHS AND STARTED RIGHT BACK DOING IT.  IT HAS BEEN DOING IT SINCE 2013.",
        "vin": "2LMDJ6JK7DB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING VARIOUS SPEEDS, EXHAUST FUMES ENTERED THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER SEVEN TIMES FOR DIAGNOSTIC TESTING, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE CONTACT STATED THAT THE VEHICLE'S UNDERCARRIAGE WAS COATED WITH A SEALANT; HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 0.",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS STATIONARY.  THE DOOR AJAR WARNING LIGHT, AT TIMES, REMAINS ON WHEN THE DOOR IS CLOSED WHICH AFFECTS SEVERAL ELECTRICAL COMPONENTS SUCH AS, AUTOMATIC DOOR LOCKS, ALARM SYSTEM, COURTESY LIGHTS AND OTHER ELECTRICAL COMPONENTS.  THE DOOR HAS TO BE SLAMMED SHUT SEVERAL TIMES TO MAKE THE WARNING LIGHT GO OFF AND MAKE THE INOPERABLE COMPONENTS OPERABLE. THE CAUSE OF THIS PROBLEM APPEARS TO BE A FAULTY DOOR LOCK SWITCH WHICH IS QUITE COMMON IN SEVERAL FORD/LINCOLN VEHICLES.  A RECALL OF THESE DOOR LOCK SWITCHES SHOULD BE ENTERTAINED.",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861265,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE DOOR IS CLOSED, THE DOOR AJAR LIGHT STAYS ON AND THE DOORS NEVER LOCK WHILE DRIVING.  ALSO THE DOOR CAN BE CLOSED AND THE DOOR AJAR LIGHT WILL NOT BE ON BUT  AT ANY MOMENT THE DOOR AJAR LIGHT WILL COME ON CAUSING THE FACTORY ALARM TO GO OFF AT ANY TIME, DAY OR NIGHT.  IT HAS BEEN TO THE DEALERSHIP NUMEROUS TIMES FOR THIS ISSUE SINCE 2013.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846164,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. WHILE DRIVING APPROXIMATELY 50 MPH, THE BRAKE PEDAL WAS DEPRESSED BUT FAILED TO STOP THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735728,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS BEEN A CONTINUOUS ISSUE WHEN USING THE CRUISE CONTROL AT ANY SPEED. WHEN THE CRUISE CONTROL IS ON, AND THE VEHICLE IS TRAVELING ON A DOWNHILL SLOPE, THERE IS A NOISE COMING FROM UNDER THE HOOD WHILE IT IS TRYING TO MAINTAIN THE SPEED. THE SOUND IS SOMETHING LIKE A HUMMING/GRINDING/TICKING NOISE. I HAVE HAD MULTIPLE TECHNICIANS GO FOR A DRIVE WITH ME TO TRY DIAGNOSE THE ISSUE AND THEY HAVE ALL SAID THAT THERE IS AN ISSUE. HOWEVER, TO DATE, THEY HAVE NOT BEEN ABLE TO FIX IT AND THE LAST TECHNICIAN SAID IT MUST BE A NORMAL NOISE, EVEN THOUGH NO OTHER LINCOLN I HAVE TEST DROVE CAN RECREATE THE NOISE.",
        "vin": "2LMDJ8JK3DE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2015",
        "dateOfIncident": "01/22/2015",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678752,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT FOR A WALK WITH 4 YEAR OLD SON AT THE MOUNTAIN, CAME BACK TO A MELTED MKX. FIRE  DEPARTMENT CAME. WITH IN A SPAN OF AN HOUR FIFTEEN MINUTES, THE VEHICLE CAB HAD MELTED AND COOLED TO TOUCH. WE BARELY ESCAPED POSSIBLE DEATH HAD I BEEN DRIVING ON THE FREEWAY.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660212,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC KEYS FOR THE CAR ARE WAY TOO SENSITIVE.  THEY CAN BE IN A PURSE OR BACKPACK AND THE BUTTONS CAN BE PRESSED DOWN.  THEY ARE ALSO EASILY PRESSED DOWN IF YOU HAVE THEM IN YOUR POCKET WITH ANOTHER ITEM.  ON MULTIPLE OCCASIONS WE HAVE WALKED OUT TO OUR CAR AND HAD THE WINDOWS ALL DOWN, THE SUN ROOF OPEN AND OR THE TAILGATE UP.  WE FREQUENTLY WILL SET OFF THE ALARM.  ONE TIME IT HAD STARTED RAINING HEAVILY AND THE WINDOWS HAD GOTTEN ROLLED DOWN.  CONSEQUENTLY THE INTERIOR OF THE CAR WAS SOAKED.  WE HAVE HAD OTHER CARS THAT HAD SIMILAR KEYS BUT HAVE NEVER HAD THIS PROBLEM. *TR",
        "vin": "2LMDJ8JK4DB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "02/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630118,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HEAVY RAIN STORM HAD TO PULL OVER TO THE SIDE OF THE ROAD.  WINDSHIELD WIPERS DID NOT OPERATE.    TOOK CAR INTO SERVICE.  THEY HAD TO REPLACE THE ENTIRE WINDSHIELD WIPER MOTOR ASSEMBLY.  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "07/28/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630141,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE OFF RAMP OF HIGHWAY, DASHBOARD WENT BLANK AND VEHICKE SHUT DOWN.  WAS ABLE TO RESTART AFTER A MINUTE OR 2  SAME PROBLEM AS PREVIOUS 6-14-14 INCIDENT.  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "08/26/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BUCKED SEVERAL TIMES BUT DID NOT LOSE POWER.  NEXT DAY 8-27 MILEAGE 14,254 THE CONTROL PANEL (PHONE, NAVIGATION, CLIMATE, SIRIUS) FROZE FOR AT LEAST 5 MILES.  DID NOT LOSE POWER THIS TIME.  SCREEN CAME BACK TO NORMAL AFTER ABOUT 2 TO 3 MINUTES.  THESE PROBLEMS REPORTED TO LINCOLN SERVICE AND WAS ADVISED TO BRING THE CAR IN AGAIN TUESDAY MORNING 9-2-14.  ALL INCIDENTS PREVIOUSLY REPORTED TO YOU, LINCOLN SERVICE COULD NOT FIND ANY PROBLEMS RELATING TO ALL THE INCIDENTS EXCEPT TO REPLACE THE FAULTY WINDSHIELD WIPER ASSEMBLY ON 2-06-14.  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "06/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630134,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTDOWN WHILE IN THE LEFT LANE OF HIGHWAY.  NO POWER.  DASHBOARD CONTROL PANEL BLACKED OUT AND VEHICLE SHUT DOWN.  WAS ABLE TO RESTART AFTER A MINUTE OR 2.  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR IN DRIVEWAY.  CAR STALLED AND LOST ALL POWER.  TRIED TO RESTART AND CAR STARTED AGAIN.  1 WEEK LATER, WHILE DRIVING DASHBOARD CONTROL PANEL (PHONE, NAVIGATION, CLIMATE,SIRIUS BLACKED OUT.  CAR STALLED IN MIDDLE OF  HIGHWAY.  NO POWER.    LATER THE SAME DAY, THE BRAKE PEDAL WENT DIRECTLY TO THE FLOOR WHEN STARTING.   *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR IN DRIVEWAY. CAR STALLED AND LOST ALL POWER.  TRIED TO RESTART AND CAR DID RESTART.  1 WEEK LATER WHILE DRIVING THE DASHBOARD CONTROL PANEL (PHONE, NAVIGATION, SIRIUS, CLIMATE BLACKENED OUT.  CAR STALLED IN MIDDLE OF HIGHWAY.  NO POWER.  LATER THE SAME DAY, BRAKE PEDAL WENT DIRECTLY TO THE FLOOR WHEN STARTING CAR.  *TR",
        "vin": "2LMDJ8JK3DB"
    },
    {
        "components": "ENGINE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "04/28/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595835,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN MKX. THE CONTACT STATED WHILE ATTEMPTING TO DECELERATE FOR A TRAFFIC LIGHT, THE ENGINE STALLED WITHOUT WARNING. AFTER RESTARTING, THE VEHICLE RESUMED NORMALLY. IN ADDITION, THE BACK UP CAMERA BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO WAS UNABLE TO DUPLICATE THE PROBLEM. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 2,964.",
        "vin": "2LMDJ6JK8DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2013",
        "dateOfIncident": "06/15/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520751,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED RECEIVING TRAFFIC INFO ON NAVIGATION SCREEN. ALL OTHER DATA RECEIVED VIA \"SYNC\" SYSTEM FROM SIRIUS OPERATING CORRECTLY. DEALER REPLACED COMPUTER MODULE THEY IDENTIFIED AS CONTROLLING THIS FUNCTION. NO CHANGE IN CONDITION. PROBLEM ESCALATED TO FORD TECH PEOPLE. A MONTH AGO, THE RADIO FUNCTIONS FAILED. IT REQUIRED A SYSTEM UPGRADE.  *TR",
        "vin": "2LMDJ8JK9DB"
    },
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NEAR THE END OF MY DAILY HOUR LONG COMMUTE HOME I WAS COMING UP TO A STOP SIGN, AS I WAS DECELERATING UP TO THE STOP SIGN, THE LOW OIL PRESSURE LIGHT CAME ON, THE STEERING SEIZE UP, THE ACCELERATOR FAILED TO FUNCTION, AND THE BRAKING WAS SLUGGISH.  I WAS LUCKILY ABLE TO STEER TO THE SIDE OF THE ROAD.  I PUT THE VEHICLE IN PARK, PRESSED THE POWER BUTTON TO TURN THE CAR OFF AND THE CAR TURNED OFF.  I TURNED THE CAR BACK ON AS NORMAL AND ALL SYSTEMS APPEARED TO FUNCTION AS IF NOTHING HAD HAPPENED.  I BROUGHT THE CAR IN FOR SERVICE AND THEY INFORMED ME THE COMPUTER DID NOT REGISTER ANY FAULTS, ERRORS, OR ISSUES.  THIS IS CONCERNING, BECAUSE IF THIS PROBLEM HAD OCCURRED ON THE HIGHWAY AT HIGHWAY SPEEDS AND I WERE TO LOSE ACCELERATION AND STEERING CONTROL, I WOULD NOT BE ABLE TO TYPE THIS REPORT.    THE DEALER SERVICE TECHNICIANS ARE UNABLE TO LOCATE THE ISSUE BECAUSE IT WAS NOT RECORDED.  *TR",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "04/02/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE HIGHWAY TO MY HOME, THE BLIND SPOT AND CROSS TRAFFIC SENSORS FAULTED.  THE WARNING MESSAGES CAME ON AND I TOOK THE CAR IN FOR SERVICE TO THE DEALERSHIP.  THEY INFORMED ME IT WAS A FAULTY BLIB MODULE AND WOULD NEED TO BE REPLACED.  FOR A TWO MONTH OLD CAR, THERE SEEM TO BE AN ABNORMAL NUMBER OF FAULTY COMPONENTS.  THIS COULD POSE A SAFETY HAZARD IF PEOPLE RELY ON THE BLIND SPOT AND CROSS TRAFFIC SENSORS TO ALERT THEM OF CLOSE CARS OR ON COMING CARS WHILE REVERSING.  *TR",
        "vin": "2LMDJ6JK0DB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505787,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT ABOUT 65MPH, THE SYNC SYSTEM SCREEN WENT BLACK, AFTER ABOUT 5 MINUTES, THE SYSTEM CAME BACK UP.  I WAS UTILIZING THE NAVIGATION SYSTEM AT THE TIME AND WAS FORCED TO STOP, RE-ENTER THE DETAILS OF THE LOCATION I WAS INTENDING TO VISIT.  THE SYNC SYSTEM SHOULD NEVER JUST RESTART ITSELF WITHOUT WARNING A DRIVER.    I AM CONCERNED THERE IS A MORE SEVERE PROBLEM WITH THE MAIN CONTROL SYSTEM WITH THIS PARTICULAR VEHICLE AS THREE OTHER ISSUES HAPPENED WITHIN A WEEK OF EACH OTHER.    1. BLIB MODULE (BLIND SPOT AND CROSS TRAFFIC SENSORS FAULTED AND NEEDED REPLACEMENT)  2. SYNC SYSTEM REBOOTS ITSELF WHILE DRIVING AND UTILIZING NAVIGATION  3. LOW PRESSURE ERROR POPS UP, STEERING BECOMES IMPOSSIBLE, ACCELERATION DIES, AND BRAKING SLUGGISH.  CAR REQUIRED SHUTDOWN AND RESTART TO RESOLVE.  *TR",
        "vin": "2LMDJ6JK0DB"
    }
]