[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/10/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424198,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nokian Tyres, Inc.",
                "productMake": "NOKIAN",
                "productModel": "ENTYRE 2.0",
                "productYear": "9999",
                "size": "205/55R 16XL 94H XLBW",
                "type": "Tire"
            }
        ],
        "summary": "The tire blow up and causing lost control and hit curbs and it’s causing accident and it’s damaged front and damaged engine, trans pan , transmission  and steering gear and linkage",
        "vin": "Jm1cw2blxd0"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244077,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE GONE TO MULTIPLE MECHANICS WITH NO HELP. MY VEHICLE SURGES OR REVS ANY TIME THE AC IS ON TO THE POINT THAT THE VEHICLE LUNGES FORWARD EVEN WHEN MY FOOT IS ON THE BRAKE. THIS OCCURS IN NEUTRAL, DRIVE AND PARK. IT SPECIFICALLY OCCURS WHEN I AM SLOWING DOWN, STOPPING, OR COASTING AT A LOW SPEED. IT ALSO JERKS WHEN IN DRIVE BUT NOT APPLYING THE GAS, THEN REVS WITH NO WARNING. NO CHECK ENGINE OR OTHER LIGHTS ARE COMING ON. I HAVE BEEN ON SEVERAL MAZDA FORUMS AND THIS SEEMS TO BE A RECURRING ISSUE WTH THIS VEHICLE. IT HAS CAUSED ME TO HIT A WALL (I WAS SLOWING DOWN, COMING INTO A PARKING SPACE) AND MY NEIGHBORS VEHICLE AS I WAS WAITING TO TURN RIGHT OUT OF OUR CONDOS.",
        "vin": "JM1CW2BL6D0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229841,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPEATEDLY GOING TO VARIOUS MECHANICS TO GET A DIAGNOSIS THROUGHOUT THE YEARS, THEY WERE ALL UNSUCCESSFUL TO FIND ANY REPORT THROUGH THE VEHICLE'S COMPUTER. HOWEVER, MY CAR'S ENGINE IS CONSTANTLY REVVED UP EVEN WHEN APPLYING THE BRAKES AN SLOWING DOWN CAUSING IT TO JERK FORWARD. THIS OCCURS SUDDENLY AND RANDOMLY WHEN I AM GOING AT SPEEDS BELOW 20 MPH INCLUDING WHILE ON IDLE. IF I NEITHER APPLY THE BRAKES NOR THE ACCELERATOR, IT WILL STILL DRIVE FORWARD AT 3 MPH IN RHYTHMIC JERKY WAVES. WE TOOK THE VEHICLE TO THE LOCAL MAZDA DEALER FOR A KEY REPLACEMENT WHEN WE FIRST PURCHASED IT, AND I BELIEVE WE REPORTED THE PROBLEM THERE FIRST, BUT AFTER THE RIDICULOUS SERVICE WE GOT, I NEVER WANTED TO RETURN THERE AGAIN. THIS HAS BEEN AN ONGOING ISSUE SINCE THE BEGINNING.",
        "vin": "JM1CW2BL3D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064601,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CURRENT RECALL ON MY VEHICLE INVOLVING THE REAR HATCH.  IT MAY DROP RANDOMLY AND WITH 2 CHILDREN I FIND IT EXTREMELY IRRESPONSIBLE THAT THIS HAS NOT BEEN RESOLVED SINCE 9/2016.  I DO NOT KNOW IF THERE IS A CERTAIN AMOUNT OF TIME MANUFACTURERS HAVE TO FIX A RECALL BUT, I FIND THIS UNACCEPTABLE.",
        "vin": "JM1CW2BL9D0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/01/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021027,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AN ONGOING ISSUE WITH THE POWER STEERING LIGHT COMING ON IN MY CAR. THERE WERE TIMES THAT I HAVE HAD MY CAR PARKED OVERNIGHT, GOT UP THE NEXT MORNING TO LEAVE FOR WORK, THE LIGHT WAS STILL ON FROM THE PREVIOUS AFTERNOON. THE LIGHT HAS COME ON WHILE I HAVE DRIVEN ON THE HIGHWAY GOING 55 MPH FOR NO APPARENT REASON...ON A STRAIGHT-AWAY. THE PAST TWO DAYS IT HAS GONE OFF AND ON AT LEAST THREE TIMES, AGAIN FOR NO GOOD REASON. THE VERY FIRST TIME I NOTICED THE LIGHT WAS A HOT, SUMMER DAY, BUT THE CAR HAD BEEN RUNNING WITH THE AIR ON. THINKING SOMETHING OVERHEATED, I SHUT THE CAR OFF AND HAD TO WAIT 45 MINUTES BEFORE THE LIGHT WOULD GO OFF. NOW EVEN WITH WEATHER GETTING COOLER AND THE LIGHT COMES ON, IT GOES BACK OFF WHEN IT FEELS LIKE IT, WITH NO EXPLANATION.",
        "vin": "JM1CW2BL1D0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985826,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO OPEN THE PASSENGER SIDE SLIDING DOOR IN THE WINTER THE HANDLE OF THE DOOR BROKE. A PLASTIC CONNECTOR ON THE FORWARD SIDE OF THE HANDLE, INSIDE THE DOOR BROKE OFF. AS I CALLED TO GET A QUOTE ON REPAIR I HEARD THAT THIS HAPPENS ALL THE TIME.     ONLY AFTER I GOT A RECALL FOR A PLASTIC PIECE ON THE LIFT GATE DID IT OCCUR TO ME THAT THIS IS A SAFETY ISSUE. IT IS NECESSARY TO HAVE A WORKING DOOR HANDLE AND ONE THAT WILL WORK IN ALL CIRCUMSTANCES.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981677,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA 5. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V644000 (STRUCTURE) WAS RECEIVED IN SEPTEMBER OF 2013. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM1CW2BL2D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970154,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS RECALL WAS ISSUED IN EARLY SEPTEMBER, 2016.  7 MONTHS HAVE GONE BY AND WE HAVE HEARD NOTHING MORE",
        "vin": "JM1CW2BL6D0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958028,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA 5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V644000 (STRUCTURE). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  ...UPDATED 05/11/17 *BF.. ...UPDATED 06/13/17 *BF  UPDATED 10/13/2017 *JS    *CN",
        "vin": "JM1CW2BL2D0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915295,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA 5. THE CONTACT STATED THAT THE STEERING WHEEL FAILED. THE CONTACT HAD TO EXERT FORCE TO TURN THE STEERING WHEEL. THE POWER STEERING INDICATOR ILLUMINATED AFTER THE FAILURE OCCURRED. THE CONTACT WAS ABLE TO RESTART THE ENGINE AND RESUMED NORMAL STEERING FUNCTION. THE VEHICLE WAS TAKEN TO THE DEALER AND THE POWER STEERING PUMP WAS REPLACED. THE MANUFACTURER ADVISED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V374000 (STEERING). THE APPROXIMATE FAILURE MILEAGE WAS 47,692.",
        "vin": "JM1CW2BL8D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914119,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PARKING BRAKE FAILED. MANUAL TRANSMISSION. THE VEHICLE WAS LEFT STATIONARY, PARKED IN A PARKING LOT ON ONLY A VERY SLIGHT INCLINE. THE PARKING BRAKE LEVER WAS PULLED UP AND ENGAGED, THE VEHICLE NOT MOVING AS ALL OCCUPANTS EXITED THE VEHICLE AND WALKED AWAY. UPON RETURNING TO THE PARKING LOT ABOUT 15 MINUTES LATER THE VEHICLE WAS FOUND TO HAVE ROLLED BACK AND ACROSS THE ENTIRE PARKING LOT, STOPPED BY ITS HITTING A CURB.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881305,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING MALFUNCTION:  UPON STARTING THE VEHICLE (IN THE PARKING LOT OF MY JOB, TO GO HOME) THE POWER STEERING MALFUNCTION LIGHT LIT UP IN THE DASHBOARD.  I CHECKED THE POWER STEERING FLUID LEVEL TO SEE IF IT WAS LOW - IT WAS NOT.  I CHECKED THE FUSES THAT MIGHT BE RELATED TO THE POWER STEERING - ALL FUSES SEEMED OKAY.  I DID SOME RESEARCH AND SAW THAT PREVIOUS YEARS OF THE MAZDA5 HAD A RECALL IN PLACE WITH REGARD TO THE POWER STEERING.  I AM CONCERNED MY VEHICLE MAY HAVE THE SAME ISSUE.  I WILL BE CONTACTING A MAZDA DEALERSHIP TO HAVE THE VEHICLE LOOKED AT TO GET MORE INFORMATION PERTAINING TO THIS ISSUE.",
        "vin": "JM1CW2BL5D0"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "04/16/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819831,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA MAZDA5. THE CONTACT STATED THAT WHILE DRIVING AT 50 MPH, THE VEHICLE STARTED TO SHAKE VIOLENTLY WITHOUT WARNING. IN ADDITION, THE REAR TIRE RIM WAS BENT. THE CONTACT ALSO STATED THAT IN ANOTHER OCCASION WHILE DRIVING AT 60 MPH, THE VEHICLE REAR SHIFTED TO THE RIGHT, THE CONTACT HAD TO SHIFT THE GEAR INTO FOURTH GEAR THEN BACK INTO DRIVE TO BE ABLE TO CONTROL THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE STEERING HANDLE AND THE SENSOR WERE REPLACED. THE PCM SYSTEM WERE ALSO PROGRAMMED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 38,211.",
        "vin": "JM1CW2BL9D0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/11/2016",
        "dateOfIncident": "01/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819470,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2013 MAZDA5 MINIVAN HAVE THE TOYO A20 ALL-SEASON RADIAL TIRE. TWO OF THE FOUR TIRES HAVE THE TREAD SEPARATING FROM THE SIDEWALL ALONG THE INSIDE AND OUTSIDE OF THE TIRE. THERE IS ACTUALLY A LINE AROUND THE CIRCUMFERENCE OF THE TIRE. WE HAD TO BE JUST A FEW MILES FROM COMPLETE AND CATASTROPHIC FAILURE OF TWO TIRES. THE TIRES HAVE 38,000 MILES ON THEM.    I HAVE HEARD A THUMP SOUND FOR THE PAST SEVERAL MONTHS AND HAVE CHECKED THE TIRES OFTEN BUT NEVER NOTICED ANYTHING. I WOULD HAVE TO WONDER IF THE SEPARATION WAS ONLY APPARENT WHILE THE TIRE WAS SPINNING AND CLOSED UP WHEN STOPPED UNTIL IT FINALLY BEGAN PULLING APART.     I HAVE KEPT THE TWO TIRES THAT HAVE SEPARATED AS WELL AS THE TWO THAT HAVE NOT YET SHOWN FAILURE. I WOULD LIKE TO TURN THEM OVER FOR SAFETY TESTING. THESE TIRES SHOULD NOT BE ON OUR NATIONS HIGHWAYS.",
        "vin": "JM1CW2BLXD0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10773983,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2013 MAZDA 5. WHILE DRIVING 40 MPH, THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD. THE FAILURE CAUSED THE CONTACT TO CRASH INTO THE REAR OF ANOTHER VEHICLE. THE CONTACT STATED THAT BOTH AIR BAGS DEPLOYED. A POLICE REPORT WAS  FILED. THE PASSENGER SUSTAINED INJURIES TO THE CHEST FROM THE SEAT BELT, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "JM1CW2CL2D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661587,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY BRAKES OF MAZDA 5 DO NOT WORK. MY CAR SLID OFF WHILE PARKED AND CRASHED AGAINST A MAILBOX. BOTH CAR AND MAILBOX WERE DAMAGED. MAZDA CLAIMS IT IS NOT RESPONSIBLE AS IT STATES IN ITS MANUAL THAT YOU NEED TO ALWAYS LEAVE THE CAR ON GEAR WHEN YOU PARK EVEN ON A FLAT LANDSCAPE. HOWEVER (1) SHOULDN'T THE EMERGENCY BRAKE STILL WORK AND (2) DOESN'T LEAVING THE CAR ON GEAR WHEN YOU PARK DAMAGE QUICKER THE GEAR BOX AND BRAKES? OTHER MAZDA 5 CAR OWNERS ALSO COMPLAIN THAT THEY REALLY HAVE TO PULL HARD TWICE OR THREE TIMES ON THE EMERGENCY BRAKES SO THAT IS STOPS CLICKING. THIS IS A SAFETY ISSUE AND MAZDA 5 CARS SHOULD BE RECALLED.   *JS",
        "vin": "JM1CW2BL2D0"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "05/19/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643803,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA 5. WHILE PARKED WITH THE EMERGENCY BRAKE ENGAGED, THE VEHICLE ROLLED AWAY. AS A RESULT, THE VEHICLE CRASHED INTO A FENCE. THE FAILURE OCCURRED TWICE. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000. ..UPDATED 11/18/14 *BF",
        "vin": "JM1CW2BL8D0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606192,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA 5.  THE CONTACT STATED THAT AFTER THE VEHICLE CAME TO A COMPLETE STOP ABRUPTLY, THE CONTACT'S SKULL HIT THE TOP OF THE HEAD RESTRAINT.  THE CONTACT STATED THAT THE HEAD RESTRAINS FAILED TO ADJUST INTO A FORWARD OR BACKWARD MOTION.  THE HEAD RESTRAINTS WERE ONLY ABLE TO BE ADJUSTED IN THE UP OR DOWN POSITION. THE FAILURE RECURRED SEVERAL TIMES.  THE MANUFACTURER WAS CONTACTED AND DID NOT OFFER A REMEDY.  THE FAILURE MILEAGE WAS 1,000 AND THE CURRENT MILEAGE WAS 2,500.",
        "vin": "JM1CW2DL2D0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583023,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA MAZDA5. THE CONTACT STATED THAT THE REAR PARKING SENSORS FAILED TO OPERATE WHILE REVERSING AT APPROXIMATELY 5 MPH. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "JM1CW2CL6D0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "01/08/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564239,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM PRESSING CHARGES AGAINST THE MAZDA COMPANY FOR FAILING TO CORRECTLY DIAGNOSE MY CAR WHEN I SENT IT TO BE REPAIRED AND FOR CAUSING DAMAGE TO MY ENGINE BY TELLING ME IT WAS READY TO BE DRIVEN AGAIN. I AM ALSO PRESSING CHARGES AGAINST MAZDA FOR PUTTING USED TIRES ON MY NEW CAR, MAKING IT UNSAFE TO DRIVE. MY STORY IS VERY LONG. I HAVE MANY DOCUMENTS I CAN SUBMIT TO BE USED AGAINST THEM. PLEASE GIVE ME THE CASE NUMBER AND A WAY I CAN SUBMIT MY DOCUMENTS.   *TR",
        "vin": "JM1CW2BL7D0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "04/19/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510014,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA HEADRESTS TILT TOO FAR FORWARD.  WE WERE READY TO BUY A MAZDA5 BUT WHEN MY WIFE GOT BEHIND THE WHEEL IN THE TEST DRIVE THE HEADREST PUSHED HER HEAD FORWARD; CANNOT ADJUST TILT. SHE GOT A HEADACHE AFTER THE TEST DRIVE.  THIS IS NOT SAFE. SHOULD SUPPORT FROM BOTTOM OF HEAD AND AROUND BACK OF HEAD -- INSTEAD IT PUSHED FORWARD FROM TOP OF HEAD!  WORST HEADREST I HAVE EVER SEEN -- NO REAL SUPPORT FOR HEAD. CUSTOMERS WILL (AND DO) TURN THESE AROUND, PROVIDING NO SUPPORT AND LITTLE PROTECTION.  *TR",
        "vin": ""
    }
]