[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451430,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Headed out to the store and engine was running rough and CEL was on.  Thought it was bad gas because I just put a few dollars in.   Added gas treatment and topped off tank and continued to store.    Stopped at Advanced Auto near the grocery store so they could pull the code.  It was a P0016 - cam position sensor.  If that was bad it would explain rough idle.  Leaving to come home engine was a bit rougher and realized there was no heat blowing.  Only 4 miles from home so kept driving figuring thermostat was broke but was concerned 2 things bad at once.  About a mile up the street complete loss of engine power, power everything was on.  Had no power steering or brakes.  Managed to coast into a parking lot.  Shut off engine, and waited.  Restarted engine, notice temp gauge starting to go higher - pulled back onto street but again lost power steering and brakes.     Managed to pull into parking log of auto repair shop and left vehicle there.  Contacted Mazda next day - they agreed it was mostly the water pump failure and could possible fix it.  Arranged for tow later in the week.  Mazda inspected and said they could not repair.  Needs new engine $5000-6000.",
        "vin": "jm3tb3cv2d0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437888,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes failed while driving. Mazda dealer did not fix this known defect under recall SSP93",
        "vin": "JM3TB3DV8D0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432651,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "Trans seems to slip going in and out of 4th gear. Just bought this car 3 days ago and it has been a consistent problem that didn't start until an hour after the purchase once it warmed up. Looks like it's the transfer case, this suv only has 106k on it ! This is absolutely ridiculous, Mazda needs to offer a recall for this issue so those who have the issue don't have to fork out MORE money for an issue that Mazda is well aware of with their vehicles",
        "vin": "JM3TB3CV1D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/04/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423422,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I turned in to a parking lot, as I went over a speed bump, the side curtain air bags randomly deployed. Luckily, I was going very slow and was not injured. Had I been on the road I woudl not have been able to see and it could have been very dangerous.  The car is at the Mazda service center and they have yet to let us know what is going to happen, if it can be repaired or what they plan to do.",
        "vin": "JM3TB2CA4D0"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423136,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The water pump went out with no notice or warning, flushed all the coolant/water into the engine and failed. Over a $2K repair for a known engine defect with active lawsuits out.  A Mazda water pump lawsuit alleges 2007-2016 Mazda CX-9 and 2009-2013 Mazda6 vehicles are equipped with pumps that suddenly fail and cause catastrophic engine failures.  The proposed class action lawsuit alleges the vehicles lose engine power and fail to accelerate and maintain speed. The vehicles also allegedly can't readily control steering and cannot fully engage the brakes.  The plaintiffs claim the vehicles are at risk of serious crashes because Mazda has failed to disclose the alleged water pump defects.  Please investigate for a recall asap!",
        "vin": "JM3TB2BA8D0"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413454,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER PUMP FAILED AND IMPACTED MY ENGINE AS WELL.  I JUST BROUGHT MY CAR IN AS WELL 10/20/2020 NO MENTION OF THIS ISSUE.   BEGINNING IN 2007 AND CONTINUING THROUGH THE 2016 MODEL YEAR, MAZDA HAS INCORPORATED ITS MZI CYCLONE ENGINE (THE 'CYCLONE ENGINE') INTO HUNDREDS OF THOUSANDS OF VEHICLES, WHICH INCLUDE THE CX-9 FOR MODEL YEARS 2007 THROUGH 2016 AND THE MAZDA 6 FOR MODEL YEARS 2009 THROUGH 2013. THE CYCLONE ENGINE CONTAINS AN INTERNAL CHAIN-DRIVEN WATER PUMP, WHICH MEANS THE TIMING CHAIN IS CONNECTED TO THE WATER PUMP AND PROVIDES THE POWER THE WATER PUMP NEEDS TO CIRCULATE COOLANT THROUGH THE ENGINE WHEN THE ENGINE IS RUNNING. THE CHAIN-DRIVEN WATER PUMP IS LOCATED INTERNAL TO THE CYCLONE ENGINE, BEHIND NUMEROUS ENGINE COMPONENTS, INCLUDING THE TIMING CHAIN COVER.  UNBEKNOWNST TO PURCHASERS AND LESSEES OF THESE VEHICLES, THE CYCLONE ENGINE CONTAINS A DEFECT IN DESIGN, MANUFACTURING, MATERIALS AND/OR WORKMANSHIP THAT CAUSES THE WATER PUMP TO SUDDENLY AND PREMATURELY FAIL WELL-BEFORE THE END OF THE USEFUL LIFE OF THE ENGINE, WHICH LEADS TO CATASTROPHIC ENGINE FAILURE OR A COSTLY REPLACEMENT DUE TO THE WATER PUMP'S INACCESSIBLE PLACEMENT IN THE ENGINE.  WHEN THE WATER PUMP PREMATURELY FAILS WITHOUT WARNING, COOLANT IS ABLE TO LEAK FROM THE WATER PUMP INTO THE OIL PAN AND/OR OTHER ENGINE COMPONENTS, ALLOWING IT TO MIX WITH THE ENGINE'S OIL. THE MIXTURE OF ENGINE OIL AND COOLANT CIRCULATES THROUGHOUT THE ENGINE, LEADING TO DESTRUCTION OF THE ENGINE. DESPITE HAVING KNOWLEDGE OF THIS DEFECT, MAZDA CONTINUED SELLING DEFECTIVE VEHICLES, FAILED TO DISCLOSE THE DEFECT TO OWNERS AND LESSEES, HAS NOT ISSUED A RECALL, AND HAS NOT REMEDIED THE ISSUE AND/OR COMPENSATED OWNERS AND LESSEES OF THE DEFECTIVE VEHICLES.",
        "vin": "JM3TB3DV8D0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/07/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403483,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING AND POWER BREAKING SUDDENLY FAILED WHILE TRAVELING AT ABOUT 40MPH.  THE CHECK ENGINE LIGHT HAD GONE ON A FEW MINUTES BEFORE THE CAR HAD THIS INCIDENT.  WITH CONSIDERABLE FORCE ON THE BRAKE I WAS ABLE TO GET THE CAR TO THE SIDE OF THE ROAD.  IT WAS TOWED TO A GARAGE WHERE THEY TOLD ME A 'WATER LINE HAD BROKE RESULTING IN THE ENGINE BECOMING SUDDENLY FILLED WITH COOLANT'.",
        "vin": "JM3TB2CU8D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/28/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390465,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO GET A CUP OF COFFEE, I WAS PULLING OUT AND DRIVING THROUGH THE COMPLEX WHEN THE AIRBAGS DEPLOYED FROM NOWHERE,  THE AIRBAGS WERE THE SIDE CURTAIN AIRBAGS FROM BOTH SIDES OF THE CAR. AT THE TIME OF THE DEPLOYMENT T MY CAR WAS STATIONARY, I WAS SITTING WITH MY LEFT BLINKER ON READY TO TURN.",
        "vin": "JM3TB2CV3D0"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383969,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR FAILED INTERNALLY WITH NO WARNING,  NO LEAKS NO ENGINE LIGHT NOTHING, MIXING ANTIFREEZE INTO THE OIL AND DESTROYING THE ENGINE. MY MACHINE INFORMED ME THAT THERE WAS NO WAY OF ME KNOWING THIS WAS HAPPENING AND ITS FAULTY THE WAY THEY MAKE THE RADIATOR IT CAUSES THIS TO HAPPEN. NOW MY RADIATOR IS BAD AND MY ENGINE. I WAS DRIVING AND SUDDENLY A NOISE STARTED THEN POWER WENT AND PULLED OVER AND WOULDN'T START AGAIN.  NO WARNING NOTHING. NO LEAKS NO ENGINE LIGHT PRIOR.",
        "vin": "JM3TB3CV4D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349740,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE BECAME VERY STIFF AND MADE A HISSING SOUND WHEN APPLIED WHILE DRIVING. I BROUGHT MY CAR TO AN INDEPENDENT MECHANIC AND BACK TO THE DEALER WHERE I BROUGHT THE CAR AND THEY BOTH CONFIRMED THAT I NEEDED TO REPLACE THE BRAKE BOOSTER. THAT THE HISSING SOUND WAS LEAKAGE.",
        "vin": "JM3TB2CA6D0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338892,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CX-9 NEW IN 2013, CAR NOW HAS 102,000 MILES. CAR STARTED TO SHUTTER WHEN GETTING OFF THE EXIT FROM A MAJOR HIGHWAY. THE PROBLEM WAS DISCOVERED WITH THE POWER TRANSFER UNIT. PICTURE INDICATES HEAVY SPLINE WEAR AND CORROSION. TRANSMISSION SPLINE ALSO HAS CORROSION AND WEAR. THIS WAS A VERY DANGEROUS SITUATION. THERE'S NO MAINTENANCE REQUIRED BY MAZDA FOR THE PTU OR THE TRANSMISSION. MAZDA SHOULD ISSUE A RECALL ON BOTH THE PTU AND THE TRANSMISSION. THIS IS A KNOWN ISSUE WITH MAZDA AND DISCUSSED ON MANY INTERNET FORUMS.",
        "vin": "JM3TB3DVXD0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "12/21/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329606,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND THE VEHICLE ACCELERATOR HOWEVER, THE VEHICLE WAS DIFFICULT TO STOP. THE CONTACT DEPRESSED THE BRAKE PEDAL TO SLOW AND STOP THE VEHICLE. THE VEHICLE WAS TOWED TO SANDY SANSING MAZDA LOCATED AT 6105 PENSACOLA BLVD, PENSACOLA, FL 32505, WHERE THE VEHICLE WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT THE THROTTLE VALVE BODY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF FAILURE AND A CASE WAS FILED. THE FAILURE MILEAGE WAS APPROXIMATELY 57,022. *BF THE CONSUEMNR STATED THAT THE VEHICLE WAS REPAIRED.*AS",
        "vin": "JM3TB2DAXD0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/15/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325986,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT STATED WHILE THE VEHICLE WAS AT A STAND STILL AT A TRAFFIC LIGHT, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC BUT NOT DIAGNOSED NOR REPAIRED. THE VEHICLE WAS THEN TOWED TO HOLIDAY MAZDA LOCATED AT 416 N ROLLING MEADOWS DR, FOND DU LAC, WI 54937, (920) 322-2550, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE WATER PUMP AND TIMING CHAIN NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 74,500.",
        "vin": "JM3TB3DVXD0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322326,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOOSTER HISSING WHEN APPLYING BREAKS WHILE TRAVELING AND STOPPED.",
        "vin": "JM3TB2CV3D0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318576,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2011 WE LEASED A CX9 AND WE ENJOYED IT SO MUCH THAT WE DECIDED TO PURCHASE A CX9 IN 2013.  JUST A COUPLE OF WEEKS AGO I HAD AN EXPERIENCE THAT WAS VERY FRIGHTENING.  I WAS DRIVING AND REALIZED THE HEAT WAS NOT COMING ON AND THAT WAS UNUSUAL.  THE CHECK ENGINE LIGHT CAME ON AND SOON AFTER THE CAR STOPPED RUNNING.  I AM FORTUNATE THAT I WAS NOT ON THE HIGHWAY AND WAS ABLE TO PULL OVER TO THE SHOULDER.  I NEEDED TO HAVE THE CAR TOWED AND WE HAD IT BROUGHT TO MAZDA IN DANBURY, CT.  WE FOUND OUT THE NEXT DAY THE ENGINE NEEDED TO BE REPLACED.  NEEDLESS TO SAY, WE WERE SHOCKED AND THEN VERY UPSET TO FIND OUT THAT IT WOULD COST 10,000 DOLLARS TO REPAIR.  WE HAVE HAD OUR CAR SERVICED REGULARLY BY COLONIAL MAZDA IN DANBURY, CT.  NOW WE HAVE A CAR THAT IS WORTH NOTHING.  NOW WE ARE PUT IN A POSITION TO REPLACE OUR CAR AND HAVE NOTHING TO TURN IN TO DEFER THE COST.  WITH RESEARCH WE HAVE FOUND THAT DUE TO THE DESIGN OF THE ENGINE MANY MAZDA CX9 HAVE HAD THE SAME PROBLEM DUE TO THE WATER PUMP LEAKING, THE TRANSFER CASE LEAKING, AND ANTIFREEZE GOING INTO THE ENGINE.  IN OUR OPINION, AND APPARENTLY TO MANY CASES WE HAVE READ ONLINE THIS SHOULD HAVE BEEN A RECALL. THIS IS SOMETHING THAT SHOULD BE LOOKED IN TO FOR THE SAFETY OF OTHERS.  FORTUNATELY, I WAS ON A SIDE ROAD, SOMEONE ELSE MAY NOT BE AS FORTUNATE.  THE DESIGN OF THE ENGINE IF FLAWED AND IS MORE THAN LIKELY WHY MAZDA IS NOT HAVING A RECALL, BECAUSE IT IS TOO EXPENSIVE TO REPAIR.",
        "vin": "JM3TB3CV8D0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "02/25/2020",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316715,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE AND MY MAZDA CX9 CAUGHT FIRE! I DIDN'T REALIZE IT SINCE IT WAS UNDER THE CAR AND THE CAR BESIDE INFORMED ME OF IT.   THIS WAS DUE TO THE TRANSFER CASE ISSUES THAT MAZDA HAD TO EXTEND THE WARRANTY ON THEM BECAUSE OF SO MANY ISSUES WITH THEM.   THEY ARE COVERED FOR 90 THOUSAND MILES OR 7 YEARS.    MY TRANSFER CASE WAS ALREADY REPLACED ONCE AND DO TO ISSUES AND NOW SINCE MY CAR IS PAST THE 7 YEARS BUT ONLY HAS 60 THOUSAND MILES THEY WILL NOT PAY FOR IT.   EVEN THOUGH THE TRANSFER CASE THEY REPLACED A FEW YEARS AGO SHOULD STILL BE UNDER WARRANTY.    THIS SITUATION COULD OF BEEN A LOT WORSE AND THANK GOODNESS MY CHILDREN WERE NOT IN THE CAR WITH ME.",
        "vin": "JM3TB3BV7D0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280993,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER PUMP CAUSED ANTIFREEZE TO MIX WITH MOTOR OIL CAUSING THE ENGINE TO HAVE TO BE REPLACE ON THREE OCCASIONS WITHIN 6 MONTHS",
        "vin": "JM3TB3BVXD0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234640,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD ROW SEAT BELT BUCKLES HAVE NOT HOLDERS PREVENTING IT FROM GOING UNDER AND BETWEEN THE SEATS WHEN SEATS ARE RAISED AND LOWERED.   RESULTING IN THE BUCKLES TO BE CRUSHED,BROKEN AND UNUSABLE  ENDANGERING PASSENGERS IN THIRD ROW TRAVEL WITHOUT SEAT BELTS ANYMORE",
        "vin": "JM3TB3DVXD0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222956,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BEING DRIVEN AT THE TIME ON A BUSY FREEWAY. WHEN STARTED OVERHEATING WITH NO WARNING. THE VEHICLE THEN CUT OFF ON FREEWAY WITH TRAFFIC BEHIND ME AT A FAST SPEED. THANKFULLY I WAS ABLE TO GET TO SHOULDER. TOWED CAR TO SHOP AND WAS TOLD THAT MAZDA HAS FAULTY WATER PUMPS AND THAT MY ENGINE WAS DESTROYED DUE TO COOLANT LEAKING INTO MY OIL WITH TURNED IT TO A THICK MUD. NEW ENGINE NEEDED. I RESEARCHED ONLINE AND THERE ARE COUNTLESS CONSUMERS COMPLAINING OF SAME ISSUE WITH MAZDA. THIS IS EXTREMELY DANGEROUS FOR YOUR CAR TO JUST STOP WHEN TRAVELING AT HIGH SPEEDS OR TRAVELING ON ANY HIGHWAY THERE NEEDS TO BE A RECALL ON THIS FAULTY WATER PUMP INSIDE OF THE MAZDA ENGINE. I BELIEVE SOME ONE SOON WILL BE INJURED OR KILLED BY THIS ISSUE! THANKFULLY IT WASN'T MY CHILD AND I.",
        "vin": "JM3TB2CA5D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/10/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222325,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES PEDAL ON MY WIFE'S CAR BECAME HARD WHEN PRESSED ON (REGARDLESS OF SPEED) AND NOTICED A HISSING NOISE WHEN APPLYING BRAKES. THE WORST AND SCARIEST PART IS THAT THE BRAKES DIDN'T STOP THE CAR AND FELT AS IF I WAS APPLYING THE BRAKES ON A CAR THAT WAS NOT TURNED ON. LUCKILY WE DIDN'T GET INTO ANY ACCIDENT AND STOP DRIVING THE CAR. HAD CAR TOWED TO MECHANIC WHO INFORMED ME THAT THE BRAKE BOOSTER WAS BAD AND NEEDED TO BE REPLACED.  CHECKING ONLINE AND THIS APPEARS TO HAVE BEEN AN KNOWN ISSUE WITH EARLIER CX9 CARS.",
        "vin": "JM3TB3DV2D0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209917,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE THIRD ROW THERE ARE NO KIND OF HOLDERS PREVENTING THE SEAT BELT BUCKLES FROM GOING UNDER AND BETWEEN THE SEATS WHEN THEY ARE FOLDED DOWN AND UP. THIS HAS RESULTED IN THEM GETTING TRAPPED BETWEEN THE SEATS AND UNDER THE FOLDING MECHANISM AND GETTING CRUSHED TO THE POINT OF BEING UNUSABLE AND UNSAFE. WE ARE CURRENTLY UNABLE TO USE THE BACK SEAT SEATBELTS DUE TO THEM BEING UNABLE TO BE BUCKLED AT ALL. WE DISCOVERED THIS WHILE THE CAR WAS PARKED WHEN WE WENT TO RETRIEVE THE REAR SEAT BELT BUCKLES FOR USE.",
        "vin": "JM3TB3CV1D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/22/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203058,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A FAULTY BRAKE BOOSTER.",
        "vin": "JM3TB2BA0D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163950,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN MY SUNROOF EXPLODED, SHOWERING GLASS INSIDE THE CAR. I DID NOT SEE ANYTHING HIT IT. THE BREAKAGE SEEMED TO BE SPONTANEOUS.",
        "vin": "JM3TB3CV5D0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151624,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BEING DRIVEN AT THE TIME ON A BUSY CITY STREET. WE NOTICED SOME NOISES WHICH WAS SOUNDING LIKE METAL CLANKING. THIS BECAME LOUDER IMMEDIATELY IN THE SPAN OF 5MINS AND THE TEMPERATURE SENSOR WENT OFF ON THE DASHBOARD. THE VEHICLE WAS BECOMING UNRESPONSIVE TO BRAKES IN THE MIDDLE OF COMMUTE TRAFFIC. LUCKILY WE GOT THE VEHICLE STOPPED ON THE SIDE OF THE SHOULDER WITHOUT ANY INJURIES TO ANYONE. UPON GETTING THE VEHICLE CHECKED BY A ASE CERTIFIED MECHANIC, IT WAS DIAGNOSED THAT THE INTERNAL WATER PUMP (SUGGESTED AS A BAD DESIGN BY THEM AND MANY OTHERS HAVE REPORTED SIMILAR STALLING SITUATIONS ON THE INTERNET) SOMEHOW MIXED UP THE COOLANT AND THE OIL FORMING A SLUDGE AND WAS UNABLE TO CONTROL THE TEMPERATURE AND LACK OF LUBRICATION CAUSED THE METAL CLANKING. THIS HAS RENDERED THE VEHICLE COMPLETELY INOPERABLE ONLY AFTER 5YEARS. SEEMS LIKE ENGINE NEEDS TO BE REPLACED. THIS RAISES SERIOUS SAFETY CONCERN THAT IF THIS HAPPENED ON A HIGHWAY OR IN THE MIDST OF TRAFFIC, THERE COULD BE SERIOUS LOSS OF LIFE OR INJURY TO THE PASSENGERS.  UPON CHECKING WITH MAZDA, IT WAS RULED THAT THERE IS NO RECALL FOR SOMETHING LIKE THIS YET. THIS STANCE FROM MAZDA IS BEING UTTERLY NOT RESPONSIBLE FOR THEIR DESIGN FLAWS AND PUTTING A PRODUCT OUT IN THE MARKET.",
        "vin": "JM3TB3CV3D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098510,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE PEDAL BECAME VERY HARD TO PRESS DOWN TO STOP MY VEHICLE.  A HISSING SOUND WAS COMING FROM THE PEDAL.  EVEN AT LOW SPEEDS 20-30 MILES PER HOUR I WAS NOT SURE IF MY CAR WOULD STOP.  I WAS PRESSING DOWN ON BRAKE PEDAL HAS HARD AS I COULD.  TOOK IT IN FOR REPAIR 5/22 I WAS TOLD IT WAS THE BRAKE BOOSTER ASSEMBLY THIS WAS KNOWN TO BE FAULTY IN THIS MODEL MAZDA BUT TO RECALL WAS INCORPORATED.  REPAIR COST WAS $760.00 PUT OF MY POCKET.",
        "vin": "JM3TB3DA8D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/07/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083790,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2013 MAZDA CX-9 HAS 48,841 MILES ON IT. BRAKES RECENTLY STARTED MAKING A HISSING NOISE THEN BECAME HARD TO DEPRESS. I HAD A DIFFICULT TIME STOPPING THE VEHICLE TO AVOID A COLLISION ON SEVERAL OCCASIONS. ALSO, I WAS SITTING AT AN INTERSECTION WITH CONSTRUCTION AND HAD TO SIT THROUGH SEVERAL RED LIGHTS, BRAKES WERE MAKING THE HISSING NOISE AND THE VEHICLE'S RPMS STARTED FLUCTUATING AND MY CAR DIED. WHEN I PUT THE CAR IN PARK, THE RPMS STOPPED FLUCTUATING BUT AS SOON AS I PUT IT IN DRIVE WITH THE BRAKES DEPRESSED, THE RPMS STARTED FLUCTUATING AGAIN. I RESEARCHED THE ISSUE AND FOUND NUMEROUS ONLINE COMPLAINTS REGARDING THIS ISSUE MAINLY WITH 2012 MAZDA CX-9 BRAKE POWER BOOST UNIT FAILURE. I CONTACTED THE MAZDA DEALER TO SCHEDULE SERVICE AND THEY ADVISED THERE IS NO KNOWN WARRANTY EXTENSION OR RECALL FOR THIS ISSUE FOR MY VIN.",
        "vin": "JM3TB2BA0D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/30/2018",
        "dateOfIncident": "02/25/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082208,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. WHILE DRIVING 45 MPH, THE CONTACT HEARD A HISSING SOUND WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO BROWNING MAZDA (18827 STUDEBAKER RD, CERRITOS, CA 90703, (562) 924-1414) WHERE IT WAS DIAGNOSED THAT THE VACUUM SEALS FAILED ON THE BRAKE POWER BOOSTER, AND THE BRAKE POWER BOOSTER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS INFORMED THAT THE ISSUE WAS DUE TO WEAR AND TEAR. THE MANUFACTURER PROVIDED CASE NUMBER: 1-1231715620. THE APPROXIMATE FAILURE MILEAGE WAS 51,000.",
        "vin": "JM3TB2DV7D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/10/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078504,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENTLY, MY CAR HAS A SAFETY RECALL FROM MAZDA AS OF JANUARY 2018 IN REFERENCE TO THE TAKATA AIRBAGS.  THE UNITED STATES DEPARTMENT OF TRANSPORTATION ( NHTSA) WHEN COMPLETING A VIN SEARCH DOESN'T HAVE MY CAR LISTED ON A RECALL IN REGARDS TO TAKATA AIRBAGS.  CAN SOMEONE EXPLAIN WHY THAT IS?   THANK YOU.",
        "vin": "JM3TB2CAD04"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063656,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AM I ENTITLED TO BEING PART OF THE CLASS ACTION LAWSUIT",
        "vin": "JM3TB2BAXD0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021867,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT APPROXIMATELY 60 MPH WHEN MY SUNROOF EXPLODED.  THERE WERE NO OTHER CARS AROUND ME THAT COULD HAVE THROWN A ROCK MY WAY.  IT JUST SOUNDED LIKE SOMETHING LANDED ON THE TOP OF MY CAR AND THEN I SAW GLASS FLYING OFF MY CAR FROM REARVIEW MIRROR WHEN I REALIZED IT WAS MY SUNROOF!!  SCARY AS HECK!!",
        "vin": "JM3TB2DA2D0"
    },
    {
        "components": "POWER TRAIN,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013134,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SEEMED AS IF THE TRANSMISSION WAS SLIPPING BETWEEN GEARS ON THE HIGHWAY IT WOULD TAKE FOREVER TO SWITCH INTO HIGHER GEARS FOR HIGHER SPEEDS THEN WHEN SLOWING DOWN IT WOULD JERK AND THEN FINALLY STOP OR IF I WAS IN TRAFFIC WHERE I DIDN'T NEED TO MAKE A COMPLETE STOP  IT WOULD JERK TO SLOW DOWN AND SKIP GEARS AND JERK TO SPEED BACK UP WHILE ON THE HIGH WAY TRAVELING AT NORMAL SPEED WITH CRUISE CONTROL SET IT WENT FROM 6TH GEAR TO 4TH GEAR FOR NO REASON AT ALL! THEN IT STARTED MAKING NOISES SOUNDING LIKE BOTH THE FRONT AND BACK END FIRST YOU WOULD ONLY HEAR THEM WHEN TURNING RIGHT OR LEFT THEN STARTED HEARING THEM IN REVERSE THEN YOU HEARD THEM WHILE DRIVING ALL THE TIME ON THE HIGHWAY BACK ROADS AND PARKING SOUNDED AS IF MY TIRES WERE GOING TO FALL OFF! I CONTACTED CARMAX BECAUSE THAT'S WHERE I PURCHASED THE CAR IN MARCH OF 2017 IT'S NOW AGUST 2017 AND TOLD THEM WHAT WAS HAPPENING THEY LIED FROM THE INITIAL PHONE CALL BUT THAT'S BESIDES THE POINT THEY HAD MY VEHICLE FOR A WEEK SAYING THEY WERE LOOKING AT IT  THOROUGHLY TO MAKE SURE WHAT THEY FOUND IN THE REAR DIFFERENTIAL WAS THE ISSUE THEY ASSURED ME IT WAS TOLD ME IF I HEARD THE NOISE BRING IT BACK ASAP  AS I WAS DRIVING THE VEHICLE HOME IT WAS STILL EXPERIENCING THE SAME ISSUES WE TRIED TO CALL THEM IMMEDIATELY BUT THEY WERE CLOSED WE CALLED THEM THAT MONDAY AND COULDN'T GET ANYBODY ON THE PHONE SO WE LEFT A MESSAGE WE CONTINUE TO CALL THEM FOR TWO WEEKS BEFORE THEY FINALLY GAVE US AN APPOINTMENT TO BRING THE CAR AND I COULD NOT DRIVE MY CAR FOR THE TWO WEEKS THAT I HAD IT IN MY POSSESSION BECAUSE I WAS TOLD THROUGH MY EXTENDED WARRANTEE THAT DRIVING MY VEHICLE WHILE IT WAS STILL DAMAGED WOULD VOID MY WARRANTY THE DAY AFTER WE DROP MY CAR OFF BACK AT CARMAX I WAS CALLED AND TOLD THAT THE DATE IT WAS PULLED OUT OF THE GARAGE ON THE ORIGINAL REPAIR DATE 3 WEEKS PRIOR THAT THE TECH NOTED TO BRING TO MAZDA",
        "vin": "JM3TB3CV7D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954472,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO STOP THE VEHICLE WHILE DRIVING AND THE BRAKE PEDAL MADE A HISSING SOUND AS IF AIR WAS ESCAPING. THE VEHICLE ALSO KEPT MOVING EVEN THOUGH THE BRAKE PEDAL WAS FULLY PRESSED TO THE FLOORBOARD. TOOK THE VEHICLE IN TO THE MAZDA DEALERSHIP THE NEXT DAY AND IT WAS CONFIRMED THAT THE BRAKE BOOSTER HAD FAILED INTERNALLY.",
        "vin": "JM3TB2CV2D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "11/16/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943752,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BROUGHT THE VEHICLE TO 2 DIFFERENT MAZDA DEALERS TO FIX THIS RECALL. THEY HAVE INSPECTED THE ISSUE AND DETERMINED IT NOT TO BE URGENT. THE LAST TIME, NOV 16, 2016, I WAS TOLD THE PARTS WOULD BE ORDERED AND I WOULD BE CONTACTED TO SET UP AN APPT FOR REPAIR. NO CONTACT YET. I AM FRUSTRATED.",
        "vin": "JM3TB3CV3D0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940185,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I USE MY REMOTE TO OPEN MY LIFTGATE IT GOES UP 3/4 WAY AND JUST DROPS. I WAS GETTING GROCERIES OUT OF MY TRUNK AREA AND HAD TO MOVE QUICKLY AS IT SUDDENLY CAME DOWN. AFTER CALLING MAZDA I WAS INFORMED OF A RECALL BUT MY CAR VIN WASN'T INCLUDED IN THE RECALL. IT SEEMS THE SAME INCIDENT HAS BEEN HAPPENING ON OTHER MAZDA VEHICLES. VEHICLE WAS STATIONARY IN MY DRIVEWAY TURNED OFF AND PARKED.  *TR",
        "vin": "JM3TB3DV7D0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918741,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISOR DOES NOT STAY IN PLACE.  THE VISOR'S LEVEL IS AT MY FOREHEAD, WHICH IS VERY DANGEROUS FOR VISIBILITY AND TO MY HEAD WITH ANY SUDDEN IMPACT.  I HAVE NEVER HAD THIS PROBLEM WITH ANY VEHICLE I HAVE OWNED.  THIS IS MY FIRST MAZDA.  I HAVE OWNED SEVERAL CHRYSLER TOWN & COUNTRY MINI VANS WITH NO PROBLEMS.   THE REPLACEMENT PART IS $189.00 AND ANOTHER $100.00 TO INSTALL A NEW SUN VISOR.",
        "vin": "JM3TB2CA5DO"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913635,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST COME OUT OF A TRAFFIC CIRCLE AND ENTERED A STRAIGHT STRETCH WHEN I HEARD A LOUD CRUNCHING  SOUND.  I WOULD ESTIMATE MY SPEED TO BE BETWEEN 15MPH AND 20 MPH .THE VEHICLE SHOOK BUT I WAS ABLE TO MOVE FORWARD BUT HAD DIFFICULTY STEERING AND COULD NOT BRAKE. THE CAR SPUTTERED TO A STOP THEN I HEARD A HISSING SOUND. WHEN I GOT OUT OF THE VEHICLE I SAW THE RIGHT FRONT WHEEL AT A RIGHT ANGLE TO THE FENDER AND FLUIDS  LEAKING ONTO THE PAVEMENT. THE WHEEL WAS NO LONGER ATTACHED. THE TOW DRIVER REPORTED THAT IT TOOK HIM ONE HOUR TO LOAD THE VEHICLE ONTO A FLATBED BECAUSE THE AXLE KEPT POPPING OUT WHEN HE TRIED TO MOVE THE VEHICLE. RIDGEWAY TOWING TRANSPORTED THE VEHICLE TO INGRAM PARK MAZDA, SAN ANTONIO, TEXAS. THE TOW DRIVER TOOK PHOTOS BEFORE LOADING THE VEHICLE BUT I DO NOT HAVE THEM. THE LEFT AND RIGHT LOWER CONTROL ARMS HAD BEEN REPLACED IN JULY 2016 UNDER RECALL 8515G.",
        "vin": "JM3TB2CA2D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/17/2016",
        "dateOfIncident": "09/17/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907398,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL BECAME VERY DIFFICULT TO DEPRESS, WITH HISSING SOUND.  HAD TO FULLY DEPRESS PEDAL TO BE ABLE TO STOP FROM MODERATE SPEEDS OF 20-30MPH.  RESEARCH INDICATES THE CX-9 HAS EXPERIENCED BRAKE BOOSTER FAILURE WITH THIS SYMPTOM IN PREVIOUS MODEL YEARS.",
        "vin": "JM3TB2DV3D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905492,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT A NORMAL HIGHWAY SPEED, THE SIDE AIR BAGS SUDDENLY INFLATED FOR NO APPARENT REASON, BOTH THE DRIVER AND PASSENGER SIDES.",
        "vin": "JM3TB2BV3D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893383,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. WHILE DRIVING APPROXIMATELY 10 MPH, THE CONTACT HEARD A LOUD ABNORMAL NOISE UNDER THE VEHICLE. THE VEHICLE STOPPED INDEPENDENTLY. THE CONTACT NOTICED THAT THE FRONT PASSENGER TIRE TWISTED INTO THE WHEEL WELL. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER BALL JOINT HAD FRACTURED. THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE FAILURE OCCURRED SHORTLY AFTER THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 48,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885005,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "A TRUCK SWERVED INTO MY LANE AND I TRIED TO BRAKE.  THE PEDAL DIDN'T IMMEDIATELY DEPRESS SO I HAD TO SERVE.  JUMPED A CURB AND HIT A SIGN.  MORE THAN $11,000 OF DAMAGE.  THE BRAKE IS VERY DIFFICULT TO DEPRESS QUICKLY.",
        "vin": "JM3TB2CV3D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855255,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX9. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION) HOWEVER, THE PART FOR THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JM3TB2DA3D0"
    },
    {
        "components": "SUSPENSION,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852643,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 MAZDA CX-9.  CONSUMER WRITES IN REGARDS TO FRONT LOWER CONTROL ARMS RECALL NOTICE AND VEHICLE SUN VISOR ISSUES.  *SMD  THE CONSUMER STATED THE SUN VISOR NO LONGER STAYS IN PLACE. *JB",
        "vin": "JM3TB2BA8D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "09/13/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852701,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION) HOWEVER, THE PART TO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3BV7D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851192,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF BRAKING POWER AND HISSING NOISE HEARD IN THE ENGINE COMPARTMENT.  THE FIRST TIME YOU BRAKE IT FELT OKAY BUT ANY SUBSEQUENT BRAKING IT FELT LIKE THERE WERE NO POWER BRAKES.  BRAKE PEDAL HAD TO BE PUSHED REALLY HARD TO GET IT TO EVEN STOP.  WHEN STOPPED AT A LIGHT FACING DOWN HILL, BRAKES STARTED TO SLOWLY LOOSE GRIP AND CAUSED THE CAR TO ROLL FORWARD.  IT FELT LIKE BRAKE FLUID WAS SLOWLY BEING DRAINED.  I HAD TO CONSIDER PUTTING THE CAR IN PARK WHILE STOPPED AT A LIGHT SO AS TO NOT RUN INTO THE CAR IN FRONT OF ME.  WE TOOK IT TO THE DEALER AND THEY FOUND THAT THE BRAKE BOOSTER WAS COMPLETELY FAULTY AND THEY REPLACED IT.  BRAKE PROBLEMS HAVE EXISTED ON OTHER MAZDA CX-9 VEHICLES: 2008, 2010 & 2011.  NHTSA ALREADY INVESTIGATED THE 2010-2011 CX-9'S AND MAZDA \"EXTENDED THE WARRANTY\" ON THOSE VEHICLES.  WHAT ABOUT THE 2013 CX-9'S?  WHY WAS THE PROBLEM NOT YET REMEDIED ON THE 2013?  WHAT GOOD IS A VEHICLE IF YOU CANNOT STOP?  SAFETY SHOULD BE FIRST PRIORITY AND MAZDA HAS FAILED MISERABLY WITH THE BRAKES.  THE BRAKE BOOSTER WAS SUPPOSEDLY \"FIXED\" UNDER WARRANTY, THE NEXT DAY THE ORANGE WRENCH MECHANIC LIGHT ILLUMINATED ON THE DASHBOARD AND CRUISE CONTROL BROKE FAILED TO ENGAGE.  IT TURNS OUT THE BRAKE BOOSTER AND BRAKING SWITCH WAS STILL FAULTY EVEN AFTER THE DEALER FIXED IT.  THE VEHICLE THOUGHT THE BRAKES WERE CONTINOUSLY BEING PUSHED SO THE CRUISE CONTROL WOULD NOT ENGAGE, EVEN THOUGH NO BRAKES WERE BEING PUSHED AND WE WERE DRIVING 55 MPH DOWN THE INTERSTATE.  WE TOOK IT BACK AND THEY HAVE SUPPOSEDLY \"FIXED IT THIS TIME\".  THIS IS THE 3RD MAJOR REPAIR (ALSO FAULTY AND REPLACED OR WILL BE: TORQUE CONVERTER, TRANSMISSION, LOWER CONTROL ARMS AND BALL JOINTS) OF THIS VEHICLE AND IT IS NOW LESS THAN 3 YEARS OLD!  I DO NOT THINK I WOULD BUY ANOTHER MAZDA AGAIN.",
        "vin": "JM3TB3CVXD0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822322,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE MANUFACTURER INFORMED THE CONTACT THAT IT WOULD BE SEVERAL MORE MONTHS BEFORE RECEIVING NOTIFICATION OF A REMEDY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JM3TB3CV2D0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809215,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1ZVBP8EM1E5"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/27/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807180,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V451000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10781545,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST CONTROL OF VEHICLE COMING DOWN A RAMP IN A PARKING GARAGE, CAUSING ME TO STRIKE POLE IN GARAGE, OR WOULD HAVE CAREENED OVER 6TH FL RAILING DOWN 6 STORIES TO STREET.  VEHICLE IN MOTION.",
        "vin": "JM3TB2BA0D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779998,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. WHILE DRIVING 40 MPH, THE BRAKES MADE A HISSING SOUND WHEN ENGAGED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 32,885.",
        "vin": "JM3TB2CA2D0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "03/23/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701335,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADRESTS ON THE 2013 MAZDA CX-9 ARE EXCRUCIATINGLY UNCOMFORTABLE.  THEY ANGLE AT A COMPLETELY UNNATURAL FORWARD ANGLE AND FORCE THE DRIVER'S HEAD FORWARD AND DOWN. IT WAS NOT OBVIOUS DURING THE TEST DRIVE.  AFTER 6 HRS OF DRIVING THOUGH, PAIN DEVELOPED IN NECK, UPPER SHOULDERS AND LOWER BACK. WHO DESIGNED THIS MESS?  WHY CAN'T THE HEADREST JUST BE STRAIGHT UP, LIKE IN THE BACK SEATS?   *TR",
        "vin": "JM3TB3DV8D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "10/25/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649900,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM IS FAUTY. SINCE PURCHASE NEW, NAVIGATION TRACKS FAULTY. MAZDA CAN NEVER FIX. I BROUGHT IT BACK MANY TIMES.",
        "vin": "JM3TB2DA5D0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "10/25/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649901,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM IS FAUTY. SINCE PURCHASE NEW, NAVIGATION TRACKS FAULTY. MAZDA CAN NEVER FIX. I BROUGHT IT BACK MANY TIMES.",
        "vin": "JM3TB2DA5D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/08/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599038,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A HISSING SOUND ON MY 2013 MAZDA CX-9  UPON BRAKING -ONLY BECAUSE RADIO WAS OFF. BRAKES BEGAN REQUIRING EXTRA FORCE IN ORDER TO STOP. WAS AT A STOP LIGHT AND REALIZED VEHICLE SLIGHTLY ROLL FORWARD.  PERIODICALLY BRAKES WOULD BECOME TIGHT AND FEEL LIKE CAR HAD TURNED OFF ESPECIALLY UPON PARKING AND BACKING UP. EXPLAINED SYMPTOMS TO SERVICE TECH AT MAZDA AND SCHEDULED TO HAVE VEHICLE LOOKED AT. UPON DRIVING TO DEALERSHIP (DURING MORNING TRAFFIC) I WAS CUT OFF BY ANOTHER VEHICLE AND HAD TO SLAM ON BRAKES WHICH IN IT'S MOST IMPORTANT MOMENT FAILED!! I ENDED UP SWERVING INTO ONCOMING TRAFFIC AND WAS COMPLETELY BLESSED NOT TO HAVE HIT OR HAVE BEEN HIT BY ANOTHER VEHICLE.  IRONICALLY THIS ALL HAPPENED RIGHT OUTSIDE THE DOORSTEPS OF THE DEALERSHIP. I WAS COMPLETELY SHAKEN UP AND VERY EMOTIONAL. HOW DO BRAKES ON A BRAND NEW CAR FAIL TO WORK??? SERVICE TECH SAID IT WAS THE BRAKE BOOSTER THAT FAILED AND STATED \"I WAS A VERY LUCKY GIRL\". MY CAR SINCE HAS BEEN FIXED, HOWEVER, I AM FEARFUL TO DRIVE IT AGAIN. IT WOULD BE ONE THING IF IT HAD BEEN AN ISOLATED INCIDENT, I UNDERSTAND NOTHING IN THIS WORLD IS PERFECT, HOWEVER, THIS IS NOT AN ISOLATED BUT YET COMMON PROBLEM. I WAS TOLD WHEN THE BRAKE BOOSTER GETS HOT OR OVERHEATS IT CAUSES A LEAK WHICH IN TURN CREATES THE BRAKE FAILURE. REALLY?? I LIVE IN FLORIDA IT'S ALWAYS HOT! SO BASICALLY EVEN THOUGH THE BRAKE BOOSTER HAS BEEN \"FIXED\" THERE'S A CHANCE FOR IT TO HAPPEN AGAIN. I'M SORRY BUT I'M NOT WILLING TO TAKE A CHANCE ON MY LIFE AGAIN! NOT SURE WHY THERE HASN'T BEEN A RECALL YET. PERHAPS SOMEONE HAS TO BE SERIOUSLY INJURED OR WORSE. PLEASE, PLEASE BE CAUTIOUS IF ANY OF THE SYMPTOMS MENTIONED ARISE AND HAVE THE CAR TOWED AND NOT DRIVEN TO YOUR DEALERSHIP OR MECHANIC.  *TR",
        "vin": "JM3TB2CA2D0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595603,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2013 CX9 I NOTICED THE BRAKES REQUIRED EXTREME FORCE TO ENGAGE AND I HEARD A HISSING SOUND WHEN I ENGAGED MY BRAKES.  SINCE I HAD  THE SAME ISSUE WITH THE BRAKES ON MY 2010 MODEL, I IMMEDIATELY CONTACTED THE DEALERSHIP WHERE THEY ARE CURRENTLY REPAIRING THE BRAKES UNDER WARRANTY.   *TR",
        "vin": "JM3TB2DA7D0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2013",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552858,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS CAR NEW, WENT TO HAVE OIL CHANGE AND THERE WAS OIL UNDERNEATH.  THE RIGHT PION SEAL WAS OUT.  HAD CAR TOWED AND I CONTACTED THE DEALERSHIP I FOUND OUT THE TRANSFER CASE IS OUT.  PRIOR TO THIS I SMELLED SOMETHING LIKE BURNING OIL, BUT WHEN I CONTACTED THE DEALERSHIP I WAS TOLD IT WAS PROBABLY THE UNDERCOATING THAT IS USED TO SHIP THESE CARS OVER THE OCEAN.  *TR",
        "vin": "JM3TB3BA2D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/18/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552780,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SAS ( AIRBAG,SIDEAIR BAG,SEATBELTPRETENSIONER )  WITHOUT REASON TURNS OFF AND ON. MY WIFE ( 96 LB ) IS NOT A CHILD AS DEFINED BY THEIR LITERATURE ( 66 LB ).  MY WIFE IS CONSEQUENTLY RENDERED PROTECTED AND THEN WITHOUT REASON, UNPROTECTED BY THE SAS SYSTEM BUILT INTO THE VEHICLE.  MAZDA'S POSITION IS THAT SHE SHOULD SIT IN THE BACK SEAT. THIS VEHICLE IS  UNSAFE FOR HER.  MAZDA WILL DO NOTHING BUT OFFER ME PLATITUDES, BUT NO SOLUTION TO THIS UNSAFE SITUATION. THIS IS CLEARLY BAD ENGINEERING AND DESIGN, PUTTING MANY PEOPLE IN HARMS WAY.  [XXX] VEHICLE SOLD BY GUNTHER MAZDA FORT LAUDERDALE. FLA    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JM3TB2BA9D0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550171,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG DEACTIVATED WARNING MESSAGE ILLUMINATED ALTHOUGH THERE WAS A PASSENGER OCCUPYING THE SEAT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE VEHICLE WAS PERFORMING UP TO SPECIFICATIONS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 50 AND THE CURRENT MILEAGE WAS 600.",
        "vin": "JM3TB2BA9D0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/27/2013",
        "dateOfIncident": "05/20/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537524,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX-9. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS WERE ENGAGED AND FAILED TO ILLUMINATE THE ROAD BEYOND 5 FEET. THE FAILURE RECURRED MORE FREQUENTLY WHEN DRIVING ON A MOUNTAINOUS ROAD. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO INFORMED THE CONTACT THAT THE VEHICLE FUNCTIONED AS DESIGNED. THE APPROXIMATE FAILURE MILEAGE WAS 150.",
        "vin": "JM3TB2CV8D0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "07/31/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10534909,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 MAZDA CX9. THE CONTACT STATED THAT THE  METAL ABOVE THE DRIVERS DOOR CHROME STRIP HAD A SHARP EDGE THAT CUT THE CONTACT BELOW THE LEFT EYE, WHILE HE EXITED THE VEHICLE.  THE CONTACT INSPECTED THE PASSENGER SIDE FRONT, AND THE REAR DOORS, AND ALSO FOUND THE DEFECTED CHROME WITH THE SHARP EDGE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION THE DEALER ADVISED THAT PLASTIC SHARPNESS WAS INDEED A DEFECT.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 9,000.",
        "vin": "JM3TB2DV7D0"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505485,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "CX-9",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VOICE ACTIVATED NAVIGATION FEATURE ON THE VEHICLE SHUTS DOWN AND BECOMES INOPERABLE WHEN STOPPING OR ACCELORATING FROM A STOPPED POSITION.  THE VOICE ACTIVATED FEATURE ONLY WORKS WHILE IN ONE LONG CONTINUOUS MOTION WHICH DEFEATS THE PURPOSE OF THE HANDS-FREE VOICE ACTIVATED NAVIGATION AND MAKES USING THE SYSTEM DIFFICULT IN URBAN ENVIRONMENTS.    THIS CONCERN WAS VOICED TO THE LOCAL DEALER AND SALES STAFF WHO COULD NOT FIGURE OUT WHY THE SYSTEM WAS MALFUNCTIONING THIS WAY AND ADVISED THAT THEY WERE NOT ABLE TO FIX IT.  NO REMEDY WAS AVAILABLE AND I AM STUCK WITH A VEHICLE THAT DOESN'T FUNCTION AS IT WAS ADVERTISED TO ME AND SOLD.  *TR",
        "vin": "JM3TB3DV9D0"
    }
]