[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/25/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2013 Lincoln Navigator. The contact stated that while driving at 30 MPH, the rear wheels seized and the vehicle made a screeching sound. The vehicle was taken to the dealer and diagnosed with wheel speed sensor failure. The contact was informed that the wheel speed sensor needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was notified of the defect and directed the contact to file a complaint with the NHTSA. The failure mileage was approximately 140,000.",
        "vin": "5lmjj2j59de"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON ACCESS ROAD ABOUT 45 MPH THE CAR JOLTED VERY HARD CAUSING ME TO NEARLY LOSE CONTROL COMPLETELY. THE SPEEDOMETER WENT TO ZERO AND IT SEEMED LIKED THE TRANSMISSION DOWNSHIFTED TO 1ST GEAR THEN IT WOULDN'T MOVE. I PULLED OVER AND CHECKED UNDER AND ALL AROUND CAR AND TURNED IT OFF AND RESTARTED IT. IT SEEMED FINE FOR ABOUT 2 MILES THEN DID SAME THING. I TURNED CAR OFF AND CALLED TOW GUY TO TAKE IT HOME.",
        "vin": "5LMJJ2J52DE"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN NAVIGATOR. WHEN THE FRONT PASSENGER SEAT BELT WAS REMOVED WHILE THE VEHICLE WAS IN MOTION, THE WARNING INDICATOR DID NOT ILLUMINATE. THE  FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND CONFIRMED THAT THE VEHICLE WAS OPERATING AS MANUFACTURED. THE FAILURE MILEAGE WAS APPROXIMATELY 35.",
        "vin": "5LMJJ3J5XDE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786849,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN NAVIGATOR. THE CONTACT STATED THAT WHILE THE VEHICLE PARKED AND ATTEMPTING TO ENTER, THERE WAS AN ABNORMAL NOISE AND THE VEHICLE ROLLED BACKWARDS. AS A RESULT, THE CONTACT WAS KNOCKED BY THE VEHICLE AS IT CONTINUED TO ROLL AWAY. THE CONTACT WAS ABLE TO ENTER THE VEHICLE AND DEPRESS THE BRAKE PEDAL IN ORDER FOR THE VEHICLE TO STOP. THE VEHICLE WAS TAKEN TO A DEALER WHO DIAGNOSED ADJUSTED THE TIMING IN THE TRANSMISSION BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 41,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "09/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10764635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD ON COLLISION ON DRIVERS SIDE OF FRONT OF NAVIGATOR; HOWEVER, ONLY THE PASSENGER AIR BAG DEPLOYED WITH NO PASSENGER IN THE SEAT, ONLY I WAS DRIVING, BUT MY AIRBAG DID NOT DEPLOY.  IT SEEM ODD TO ME...UPDATED 10/15/15 *BF",
        "vin": "5LMJJ3J58DE"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2013 LINCOLN NAVIGATOR THAT HAS SOME SERIOUS PROBLEMS WITH IT'S RAIN SENSING WIPERS.  THEY WILL STOP COMPLETELY DURING A RAIN OR RAIN/SNOW STORM.  OTHER TIMES THEY WON'T COME ON BY THEMSELVES.  THEY INSTEAD HAVE TO BE TURNED ON MANUALLY.  THEY HAVE COME ON AND STAYED ON FOR AT LEAST TWO MINUTES WHEN THERE HAS BEEN ABSOLUTELY NO RAIN OR MOISTURE IN THE AIR.    I AM SURE YOU WILL AGREE WITH ME THAT THIS CAN PROVE TO BE A VERY DANGEROUS SITUATION.    WE ALSO HAVE DOCUMENTATION ON THE DEALER'S WORK ORDERS SHOWING THE TIMES WE HAD BROUGHT OUR VEHICLE IN FOR THE PROBLEMS.    WE HAVE PICTURES PROVING OUR PROBLEM BUT THESE PICTURES HAVE BEEN COMPLETELY IGNORED BY BOTH THE LINCOLN REPS THEMSELVES AND THE DEALER'S SERVICE DEPARTMENT THAT WE PURCHASED OUR VEHICLE FROM NEW LAST MAY' WILLIAMS AUTO GROUP IN SAYRE, PA.  FROM THEIR TESTS THE WIPERS 'WORK AS THEY WERE DESIGNED TO'.    I AM GOING THROUGH THE PA LEMON LAW NOW BUT I WAS JUST CURIOUS IF THERE HAD BEEN OTHER VEHICLE OWNERS, FORD OR LINCOLN, THAT HAVE REPORTED THE SAME OR SIMILAR PROBLEM.    WHAT MAKES THIS VERY TROUBLESOME IS BOTH THE COMPANY'S AND THE WILLIAMS GROUP IGNORING OUR PROOF -- THE PICTURES.  PREVIOUSLY WE WERE HAVING PROBLEMS WITH OUR TAILGATE OPENING WHILE DRIVING THE VEHICLE, OUTSIDE MIRRORS MOVING ON THEIR OWN, DRIVERS SEAT ADJUSTING ON ITS OWN AND THE KEY LOCK NOT OPERATING AS IT SHOULD.  EVEN THOUGH NONE OF THESE WERE ABLE TO BE RECONSTRUCTED AT THE DEALERSHIP, THERE WERE 3 INSTANCES WHERE THESE WERE WITNESSED BY THE DEALER'S SERVICE EMPLOYEES.  SO THEY DID GO AHEAD AND REPLACE MANY OF THE MODULES BUT HAVE DONE NOTHING WITH THE WIPERS.  *TR",
        "vin": "5LMJJ2J55DE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 LINCOLN NAVIGATOR. THE CONTACT STATED THAT WHILE ENTERING THE VEHICLE, A PASSENGER'S FOOT BECAME TRAPPED IN THE RETRACTABLE RUNNING BOARD. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 5500.",
        "vin": "5LMJJ2H57DE"
    }
]