[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431061,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On Monday, August 30, 2021, just south of Temple, Texas on I-35 south, the sun roof shattered. It was about 89 degrees outside.",
        "vin": "19UUA8F28EA"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424865,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2014 Acura TL with 36,000 miles has developed serious aluminum alloy wheel corrosion and metal peeling on all four (4)  wheels and results in intermittent tire pressure loss. The Acura company refuses to replace at their cost the defective material alloy wheels which cost and the dealer is requesting per wheel $357.00 plus 245$ plus labour and for new tire pressure sensors located inside on the mag wheels. I believe that they did not use the proper balancing weights which are clearly recommend that Acura weights be used.   I have investigated the cause of this problem by consulting with automotive engineers and it is certainly in their view related to poor quality mag surface coating which causes moisture to enter in between the rim and wheel thus resulting in wheel corrosion and loss of tire pressure which when driving can result in a serious accident. Yes, tire pressure waring lights came on frequently. The Dealer did inspect the and notice the corrosion last fall (2020). It is in their files and noted on my invoice. Please note that I live in Quebec Canada J0E 1B0.",
        "vin": "19UUA8F54EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181151,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ONLY HAS 56,700 MILES ON IT AND THE EPS FAILED WHILE I WAS DRIVING THE CAR. NEARLY CAUSED A SERIOUS ACCIDENT WHEN THE STEERING FROZE AND I COULD NOT MOVE THE STEERING WHEEL.",
        "vin": "19UUA8F36EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F25EA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION/TORQUE CONVERTER ISSUE. IN LOWER SPEED CAR JERKS. REALLY BAD IN STOP AND GO TRAFFIC.THIS ISSUE IS WITH 2013/2014 TL. ON SLOW SPEED FROM 0 -40. DEALER SAY THEY AWARE OF THE ISSUE BUT DONT HAVE A FIX. THEY HAVE A RELEASE (S/B #16046) FROM MANUFACTURE REGARDING THE PROBLEM JUDDER FROM TORQUE CONVERTER LOCK-UP CLUTCH.",
        "vin": "19UUA8F52EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906300,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.   I WAS NOTIFIED ABOUT THE RECALL IN MAY 2016. I IMMEDIATELY CONTACTED THE DEALER IN WAPPINGERS FALLS, NY TO HAVE THEM GET THE PART. IT IS NOW 4 MONTHS AND NO NEWS IS AVAILABLE CONCERNING WHEN THE PART MAY BE DELIVERED. THE DEALER CONTINUES TO SEND ME NOTICES WITH BRIGHT RED TEXT WARNING THAT THE INSTALLED AIRBAGS MAY CAUSE DEATH OR OTHER SERIOUS INJURY. WHAT IS YOUR AGENCY DOING TO PRESSURE THE INVOLVED CORPORATIONS TO EXPEDITE THE DELIVERY OF THIS PART KNOWN TO CAUSE FATALITIES????",
        "vin": "19UUA9F53EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE CONTACT WAS INFORMED THAT THE DEALER PLACED HIM ON A WAITING LIST SEVERAL MONTHS AGO. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA9F52EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884626,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME (96 DAYS) FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. ....UPDATED 08/08/16 *BF  UPDATED 08/10/16.*JB",
        "vin": "19UUA9F50EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882218,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA TL.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS STILL NOT AVAILABLE TO REPAIR DRIVER FRONT AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "19UUA9F52EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862926,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS: I AM VERY DISSATISFIED WITH HOW HONDA/ACURA IS HANDLING THE RECALL OF THE 2014 ACURA TL AWD THAT I AM CURRENTLY LEASING. THE TWO OPTIONS THEY OFFERED IF I ACCEPT EITHER WILL END UP COSTING ME MORE MONEY AND PUTTING MORE CASH IN THEIR POCKET. I HAVE SPENT HOURS ON THE PHONE BEING TRANSFERRED FROM ONE DEPARTMENT TO ANOTHER 6 TIMES YESTERDAY WITHOUT SATISFACTION TO MY SITUATION AND YES I FIRST WENT TO DOWNTOWN ACURA IN CHICAGO TO DISCUSS MY OPTIONS. THE BEST DEAL THAT THEY COULD GIVE ME WAS TO TRADE IN MY 2014 ACURA TL AWD WHICH I AM PAYING $539.99 A MONTH & LEASE A 2016 ACURA FWD FOR 527.43 I DO NOT FEEL THIS IS A FAIR APPLES TO APPLES DEAL. I AM CURRENTLY LEASING AN AWD I DO NOT WANT TO DRIVE AN FWD.TO THEY WANT $569.57 A MO. FOR THE NEXT THREE YEARS FOR AN AWD. I WOULD HAVE TO PAY TAXES, TRANSFER OF TITLE FEES ECT. ACURA IS GOING TO MAKE MONEY IN THIS SITUATION LEASING ME A MORE EXPENSIVE VEHICLE AND I AM GOING TO LOOSE MONEY. SO WHO WOULD BE MAKING OUT ON THIS DEAL? ACURA OF COURSE. NOT ONLY ON THE INCREASED LEASE AMOUNT BUT WHEN THE PART IS AVAILABLE FOR THE 2014 ACURA THEY WILL BE ABLE TO SELL IT FOR A PRETTY PENNY SEEING AS HOW IT WILL BE AROUND 2 1/2 YEARS OLD WITH ONLY 21,000 MILES ON IT. TO BE HONEST I DON'T EVEN LIKE THE LOOKS OF THE NEW ACURA 2016. THE CHANGES THAT WERE MADE ARE NOT APPEALING TO ME. OPTION 2 IS TO GIVE THEM THE ACURA 2014 TO SIT ON THEIR LOT WHILE THEY RENT ME A TOYOTA COROLLA WHILE ALL THE WHILE I AM STILL PAYING $539.99 A MONTH FOR AN ACURA THAT I CAN'T EVEN DRIVE. I TRIED TRADING IT IN ON A NISSAN MARANO ONLY PROBLEM THEY WOULD LOSE MONEY TRYING TO GET ME A REASONABLE LEASE PAYMENT AFTER HAVING TO PAY OFF MY LEASE AT $5390.00. AS YOU CAN SEE I AM STUCK BETWEEN A ROCK AND A HARD PLACE. THIS ENTIRE SITUATION EXCUSE MY SLANG. SUCKS! I HOPE THERE WILL BE A CLASS ACTION SUIT STARTED AGAINST HONDA/ACURA.",
        "vin": "19UUA9F57EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860660,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE DEALER AND THE MANUFACTURER WERE UNABLE TO PROVIDE A REASONABLE TIME FRAME FOR THE PART TO BECOME AVAILABLE. THE INTERIM NOTIFICATION LETTER ONLY INDICATED THAT THE PART MAY BECOME AVAILABLE MID SUMMER 2016. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA8F51EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852723,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA TL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOLS CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "19UUA9F72EA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786091,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED AN ACURA TL 2014 SINCE NEW. I TOOK WELL CARE OF IT BUT THERE ARE MANY BIG CRACKS ON THE DASHBOARD. I FOUND MANY OTHERS HAVE THE SAME ISSUE. THIS SHOULD BE A RECALL. IT IS A LUXURY CAR AND IT SHOULD NOT HAVE THIS KIND OF ISSUE.",
        "vin": "19UUA662X4A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "09/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632065,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FINISHING WORK, I OPENED THE CAR DOOR, TURNED THE IGNITION ON AND THEN SHUT THE FRONT DOOR WHEN ALL OF A SUDDEN I HEARD A LOUD BOOM. I TURNED AROUND TO SEE MY REAR WINDSHIELD SPONTANEOUSLY SHATTERED WITH GLASS EVERYWHERE INCLUDING MY 2 CAR SEATS. MY CONCERN IS THAT THIS OCCURRED SPONTANEOUSLY WITHOUT TRAUMA OR CHANGE IN TEMPERATURE AND IF THIS OCCURRED WHILE IN MOTION OR IF MY GRANDCHILDREN WERE IN THE CAR, THEY COULD HAVE BEEN SEVERELY INJURED. THIS CAR IS NEWLY PURCHASED APPROXIMATELY 3-4 WEEKS AGO AND SPECIFICALLY BECAUSE I WAS UNDER THE IMPRESSION IT WAS ONE OF THE SAFEST CARS. NOW TO FIND THAT THIS IS NOT THE CASE, I AM ASKING FOR A NEW ACURA TL OR ELSE I AM CONSIDERING TRADING IT IN FOR ANOTHER NEW CAR. I CANNOT TAKE ANY CHANCES SINCE I CARE FOR MY GRANDCHILDREN AND NEED TO MAKE SURE THEY ARE SAFE. ANOTHER CONCERN, IS THAT EVEN IF THEY FIX THE DAMAGE, THE  WINDSHIELD WILL BE WEAKER THAN FACTORY INSTALLED AND MAY OCCUR AGAIN. THAT CANNOT HAPPEN. I AM EXTREMELY DISSATISFIED WITH THIS ACURA TL AND WILL SETTLE FOR NOTHING LESS THAN A NEW CAR OR I WILL BE FORCED TO TRADE IT IN.   *TR",
        "vin": "19UUA9F54EA"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "03/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577511,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY NEW CAR ACURA TL SH AWD (6 DAYS OLD) ON THE FREEWAY TRAVELING AT APPROXIMATELY 60 MPH ON A SUNNY DAY OUT IN THE OPEN WITH NO CARS IN FRONT OR ALONG SIDE ME, AND I HEARD WHAT SOUNDED LIKE A GUN SHOT.  I REALIZED THAT MY SUNROOF HAD EXPLODED.  I HAD THE SUN SHADE OPEN AND A FEW PIECES OF GLASS WERE ON ME AND THE PASSENGER SEAT.  THERE WERE ALSO A FEW PIECES IN THE PASSENGER SEAT, ON ME AND IN THE BACK SEAT, BUT MOST OF THE GLASS WAS BLOWN UPWARD AND OUT OF THE CAR.  THERE WERE NICKS IN THE PAINT, IN TWO LINES ON THE ROOF AND ON THE TRUNK.  SOME OF THE PIECES INSIDE THE CAR WERE VERY SMALL, BUT SOME WERE 3\" TO 4\" IN LENGTH.  ACURA SAYS IT MUST HAVE BEEN A ROCK AND WILL NOT COVER IT UNDER WARRANTY.  SOME OF THE REMAINING GLASS IN THE SUNROOF (APPROXIMATELY 15%) WAS POINTED IN AN UPWARD DIRECTION.  THERE IS NO EVIDENCE TO SUGGEST A ROCK HIT IT.  THIS IS MY FIFTH ACURA AND PROBABLY MY LAST.  *TR",
        "vin": "19UUA9F59EA"
    }
]