[
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "08/10/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621228,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "A.C.E.",
                "productModel": "30.1",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS NEW ACE 30.1 ON 7/25/2014. BY THE END OF THE SAME DAY, THE ONE LUGGAGE BIN ON  DRIVERS SIDE HAD FAILED AT THE CONNECTION TO THE OUTSIDE FRAME, AND THE  MUD ROOM BIN NEXT TO THE ENTRY STEPS HAD DONE THE SAME. I RE-ATTACHED THE 2 SCREWS (YES; ONLY 2), THAT  HELD THE BOX TO THE FRAME.   I ALSO REATTACHED THE MUD ROOM BOX. IN THIS CASE, THE SCREWS  HAD NOT BEEN DRIVEN THROUGH THE BOX INTO THE FRAME, SO THE BOX WAS HELD  ON ONLY BY ADHESIVE INSULATION.  DURING OUR TRIP BACK HOME,   ONE OF THE BEDROOM OVERHEAD  STORAGE DOORS BROKE OFF AT THE HINGE; THE GENERATOR WOULD STOP AFTER A  COUPLE OF HOURS AND THE GIANT  LUGGAGE BIN ALSO FAILED; AGAIN, ONLY 2 VISIBLE SCREWS HOLDING IT TO THE  OUTSIDE COACH FRAME.  I BELIEVE THE ISSUE WITH THE GENSET IS A DESIGN PROBLEM. THE LR SLIDE IS  ON TOP OF IT, ADDING TO ITS INABILITY TO \"BREATHE\".  THE OTHER ISSUE IS THAT WHEN WE'RE PARKED, AND EXTEND THE LR   SLIDE OUT, THE FLOOR OVER THE GENSET IS SO HOT, YOU CAN'T WALK ON IT FOR  AWHILE.  WE ALSO HAVE INTERIOR COMPONENTS, LIKE THE WINDOW SURROUNDS    COMING APART, A LR SLIDE THAT RATTLES SO BADLY BEHIND THE DRIVER WHILE  ON THE ROAD THAT I CAN'T HEAR SOMEONE IN THE PASSENGER SEAT, ETC.  SINCE THESE FAILURES, I HAVE HAD 11 SCREWS WHICH ATTACH THE LIVING ROOM SLIDE OUT RAILS TO THE SLIDE OUT BOX FALL OUT. I ALSO HAD A FAILURE OF THE ELECTRIC AWNING (FAILED IN OPEN POSITION). THOR MOTOR COACH WANTS TO HAVE ALL THESE ITEMS REPAIRED, WHICH I INITIALLY AGREED TO. I NOW, HOWEVER, CONSIDER THE COACH UNUSABLE, AND POTENTIALLY UNSAFE. I DESIRE A REPLACEMENT COACH WITH NO MANUFACTURING DEFECTS OR A FULL REFUND. I HAVE BEEN IN CONTACT WITH THOR VIA JOHN WOODCOX. THE EARLIEST I CAN GET AN APPOINTMENT WITH AN AUTHORIZED REPAIR CENTER IS 9/17/14. I NO LONGER BELIEVE REPAIR IS AN OPTION. THIS COACH IS FULL OF DEFECTS THAT RENDER IT CURRENTLY UNUSABLE AND POTENTIALLY UNSAFE.  *TR",
        "vin": "1F65F5DY7E0"
    }
]