[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452213,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlamp assemblies have failed due to apparent manufacturer defect. The defects are so significant that the vehicle becomes unsafe to drive at night, and even brand new bulb replacements have no effect.  The entire headlamp assemblies are defective and must be replaced.  These are known issues, and the predominent complaints listed not only on replacement part websites on the internet, but in NHTSA's own website for this vehicle - even more then the recalled airbags, are all specifically for this exact same issue being suffered by numerous complainants, but for some reason NHTSA has failed to recognize and enforce a recall on it.  Acura/Honda has not even issued a service bulletin on it to allow its dealers to repair it, despite it being a known issue, and Honda Financial Services even deceitfully denies warranty claims, even lying about contract terms to avoid coverage.  This is a serious safety issue affecting scores of owners of this vehicle, including the 2013, 2014, and 2015 model years, as reflected on the internet and in complaints.  Owners may not even realize they are driving with a defective headlight until they get into or cause an accident.  This needs to be flagged as an urgent RECALL requirement.",
        "vin": "5J8TB4H3XEL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "12/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11451614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "See attached letter for details. Incident date below reflects the VIN I currently own, when testing identified the safety-related defect. Accident details from previous same model.   The same headlamps were the subject of the July 14, 2014 NHTSA Acura ILX Electrical & Lights Recall: 14V323000 on the 2013-2014 Acura ILX model. Yet, Acura continued to use these headlamps and failed to rectify the defect across its model lineup. Instead, the inherently faulty engineering, material, and manufacturing was destined to slowly degrade the reflective surface of the projector cup and lens under the heat output of the low beam halogen bulb that was, by Acura design, the automatic daytime running lights that remain on whenever the engine is running.",
        "vin": "5J8TB4H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "02/06/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle is 2014 with 130K miles. We noticed that the headlights are getting dimmer to the point where it is unsafe to drive at night. The internal low beam reflector lens is fogged up preventing the headlight to light the road adequately. Called Acura dealer in Greenville SC and spoke to the service manager on 2/4/2022. He told me the heat from the headlamp is intense and the coating is starting to de-laminate causing the headlights to dim. He said Acura is aware of the problem but no recalls have been issued. He told me that Acura would not cover the repair and it would cost $2400 to replace both headlight assemblies. Many people have reported this problem but no recall has been issued....yet. This vehicle is unsafe to drive at night. I will be replacing the headlights at my own expense and keeping the headlight assemblies for further inspection if required. Dimming headlights is a slow process and we really started noticing it about a year ago.",
        "vin": "5J8TB3H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449861,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Acura RDX. The contact stated while driving at night the low beam headlights were extremely dim causing a visibility hazard to the driver; nearly causing the vehicle to hit a pedestrian. The vehicle was taken to the local dealer who diagnosed that the headlight assemblies needed to be replaced. The contact indicated that previously the light bulbs were replaced, and the lens were deep cleaned however, the failure persisted. The approximate failure mileage was 30,000.",
        "vin": "5J8TB3H37EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights are extremely dim. Have been since I purchased the car in 2015 and has worsened since. I’ve seen that this is a recurring issue with ACURA. It is unsafe for my family and Acura is charging upwards of $2700 to have this issue resolved.",
        "vin": "5J8tb3h38el"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Both headlights are very dim. The headlights have been gradually dimming. It is very dangerous to drive at night. Headlights should fail in this manner.",
        "vin": "5J8TB3H37EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446806,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlamp failure.  Headlamp light getting progressively dimmer, forcing me to drive with the brights on at all times after sunset, even on highways and on well - lit roads - causing hazard to other drivers.  I can barely see the cars ahead of me.   Inclimate weather is practically impossible to see at all - does not illuminate lane lines. I had the dealer change out the bulbs and inspect the outer housing. No difference with new bulbs and the outer housing is clear. Car is available for inspection. The dealer mechanic said this was a known problem for 2014 RDX and the chief mechanic confirmed the dimmness.  No other person has inspected the car and there were no warnings. The problem started around 95,000 miles.",
        "vin": "5J8TB4H36EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446680,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Q. Basic Introduction:  Like hundreds of people all over the internet, my 2014 Acura RDX base model's low-beam headlights deteriorated to the point of being of no use while driving.  Quite literally, without exaggeration, at night, I saw nothing but a faint glow on the street immediately in front of the car.    Q. What component or system failed or malfunctioned, and is it available for inspection upon request? The LOW BEAM headlights failed, becoming dim to the point of extreme danger.  I had to literally avoid driving anywhere at night.  And yes: I replaced the headlights with aftermarket replacements (not trusting the manufacturer), and I have the original headlights still in my possession.  Q. How was your safety or the safety of others put at risk? I was fortunate to be in a househould with more than one car, where I was able to simply never drive the car at night, other than occasions where we were out later than expected, and had to get home with virtually no usable low-beams.   Other people who only had one car, who had no choice, and most commonly, people whose low-beams deteriorated so gradually that they didn't notice, are driving around all over America.  We are all at risk.  Q. Has the problem been reproduced or confirmed by a dealer or independent service center? Many people in online communities have contacted dealers, but I personally did not, other than asking a service rep about it.  In my case, the person either didn't know, or pretended they didn't know about the problem.   Q. Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? No.  By avoiding driving it, having other cars, and being careful, there was no accident in my situation.   Q. Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? None, other than finally realizing the low beam headlights were not of any use.  I noticed in Summer 2020, at approx. 62,000 miles.",
        "vin": "5J8TB3H39EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446359,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlights problems of the 2014 Acura RDX.  Unable to see with headlights at night. I can't see the road. I have escaped couple of accidents luckily.",
        "vin": "5J8TB3H39EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443451,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Since I purchased my car in 2014 the headlights have dimmed tremendously.  So much that my husband pulled the car to the side of the road the other night because he insisted the headlights were burnt out.  I explained that they've been that way for a long time.  We absolutely cannot drive my car at night because it's as if we have no headlights.  I think this poses an extreme safety hazard.",
        "vin": "5j8tb3h38el"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443481,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlights are extremely dim - dangerous to drive at night.  Reported issue to dealer, who cleaned the lens but problem persists.",
        "vin": "5J8TB4H32EL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442849,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The diminished light output of the low beam headlights began to diminish visibility so significantly that it was reported to the dealer at 89,000 miles, in March 2020. The dealer response was \"normal operation of the headlights compared to other RDX.\"  The driver's visibility is now decreased to the point the visibility is like only the lo output driving lights are on. Hi beams have to be used when driving at night. This reduced output decreased driver's visibility and increases the risk of a crash.  Improper usage of high beams impacts oncoming vehicles, increasing the risk of a head on collision. I was driving on the Pennsylvania and Ohio turnpike last night for 5 hours in the rain and had to reduce speeds and drive with high beams on, causing a dangerous situation for myself and other drivers.  I called Acura customer service and they indicated no recalls and no TSB. I referenced NHTSA Recall 14V323000 for Acura ILX, same issue, and they said NHTSA has not issued recalls on the 2014 RDX. Many driver threads report same issue.",
        "vin": "5j8tb4h31el"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442941,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Certain areas of the roof and tailgate are peeling off, exposing bare metal. This is a one owner Car that has been garage since new.",
        "vin": "5J8TB3H51EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441854,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlight reflector material has deteriorated causing headlight brightness to dim so much that they are not much brighter than the running lights. Makes night driving EXTREMELY dangerous.  No warning lights. Has not cause me to crash yet, but have come close several times. At this point the car is essentially unusable at night. New bulbs don’t make a difference. Entire headlight assemblies must be replaced. Dealer claims this is not a safety issue. Cost to repair is >$2,000. Internet search shows this is a very common problem for this year car likely due to the material used for the reflector not being compatible with the headlight temperature.",
        "vin": "5J8TB3H3XEL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441042,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The main halogen headlights are dim and do not project, making it very unsafe to drive at night. This has been an ongoing issue over the last five years with my car but now it is worse to where I can't even drive at night. The high beams work fine. Yes, the car is available for inspection. It is not an issue with the plastic cover over the headlights or the light bulbs.  In multiple conversations with the dealer, there was some acknowledgement of the issue and the only solution is to replace the headlamp assembly for over $2000 which may not solve the issue. This problem has been reported online by many owners of the Acura 2013 -2015 RDXs and there have been no recalls for it.   See www.carproblemzoo.com and www. Carcomplaints for many complaints. It appears that the reflective coating in the headlamp deteriorates over time, causing the problem. See recall for the same problem in the 2013-2014 Acura ILX at https://hondanews.com/en-US/releases/statement-by-acura-regarding-headlight-recall-2014-2015-acura-rlx.   There should be an immediate recall for the 2014 RDX.  See Total number of problems by model year for Acura RDX    2021 RDX      22   2020 RDX    115    2019 RDX    202 there's a class action suit related to sudden deceleration and  hesitation when accelerating for 2019 and 2020 RDXs.    2018 RDX      29   2017 RDX      47   2016 RDX      38   2015 RDX    109    2014 RDX    111   2013 RDX      84 Please notice the higher number of problems for 2013-2015 - headlamp issue   2012 RDX      18   2011 RDX      20   2010 RDX      25   2009 RDX      15   2008 RDX      37   2007 RDX      68",
        "vin": "5J8TB4H38EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440665,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Deteriorated low beam lighting, so bad that you almost cannot drive at night. Bulbs are new and lens isn’t fogged. It seems on other models in the same year there was a recall due to deterioration of the headlights yet no recalls are open on my RDX.",
        "vin": "5J8TB4H32EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439751,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Acura RDX. The contact stated that while operating the vehicle at night with the headlights activated, the low beam headlights illuminated very dim causing a visibility hazard for the driver. The vehicle was taken to the local dealer who replaced the light bulbs and cleaned the headlight assembly, but the issue persisted. The cause of the failure was not determined. The manufacturer was not notified of the failure. The failure mileage was 86,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/16/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436986,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Lights are so dim cannot drive at night without brights. Have replaced lights to brightest and had lenses professionally refinished with no help.",
        "vin": "5J8TB4H30EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436148,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights are incredibly dim, I've replaced the actual bulb and that's not the problem there's something wrong with the housing and reading online it's a common problem , they are so bad the car can not be driven at night.",
        "vin": "5J8TB4H38EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights have become dim.  The bulbs have been changed several times LED and HID and casing cleaned.  In order to see at night we have to drive with high beams on. This has become dangerous for driving.  We tried switching the light order but the high beams are too powerful and can cause danger to other drivers. The dealers says we have to replace the headlight assembly kit $2k. This is an issue that many people are having.",
        "vin": "5J8TB3H39EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "the headlights are extremely dim, making it dangerous to drive at night.  The bulbs have been replaced multiple times, but the lights remain dim.  I literally am afraid to drive it at night.  You can see in online forums that this is apparently common for the 2014 RDX, yet my car (and other) have not been included in any recall.  This is a safety issue.",
        "vin": "5j8tb4h35el"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433568,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2014 RDX does not show to have an open recall based on my VIN but I am receiving an airbag warning and the make and model of my vehicle is included in the recall. I called the dealer where I purchased the vehicle and they said they don't have to honor the recall to replace the airbags. When I look up the warning message, my safety could be in jeopardy and this is my only vehicle.   Please confirm who to contact or what options I have to pursue this complaint since the dealership confirms they did not perform a replacement of the airbags before I purchased this vehicle and I have never received a notice to replace the airbags in my 2014 RDX.",
        "vin": "5J8TB3H57EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2021",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431887,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The low beam headlights have become very dim and it is difficult to see at night. I have replaced the bulbs and it did not help.",
        "vin": "5J8TB4H36EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429337,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Front headlights are very dim. I’m unable to drive long at night. I have to rely in the cars next to me to help light the road. Please fix this. There are many many complaints. I believe mine are getting dimmer. Correct this before there really is an accident.",
        "vin": "5j8tb3h37el"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlights (low beams only) are very dim to the point where it is dangerous to drive at night. Can only see a few feet in front of me. Original headlights, both passenger and driver side have the same problem. Changing bulbs does not improve the brightness at all. Problem started about a year ago, and has quickly become much worse. Checking online, I found hundreds of posts from other owners of 2013-2015 Acura RDX that are experiencing the same exact problem.",
        "vin": "5J8TB3H31EL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407336,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO SEE WITH HIGH OR LOW BEAMS AT NIGHT. PEOPLE FLASH THEIR HIGH BEAMS AT ME MEANWHILE I CAN'T SEE THE ROAD. I HAVE 2 YOUNG CHILDREN AND I'M TERRIFIED DRIVING AT NIGHT REPLACING THE BULBS DOESN'T WORK. ONLY THING I CAN FIND ONLINE SAYS TO REPLACE THE ENTIRE HEADLIGHT BECAUSE THE REFLECTIVE PROPERTIES THAT HEADLIGHTS HAVE WEAR DOWN TO NOTHING AND EVENTUALLY DON'T HAVE THE ABILITY TO REFLECT LIGHT AND ILLUMINATE THE ROADWAY. THAT WAS MY UNDERSTANDING OF THE ISSUE. IT'S OBVIOUS THAT THIS IS A SAFETY HAZARD AND SHOULD BE A RECALL ON THE VEHICLE! HOW MANY PEOPLE HAVE TO COMPLAIN BEFORE THIS HAZARD IS TAKEN MORE SERIOUSLY? DOES SOMEONE HAVE TO DIE IN A CAR ACCIDENT? THIS SEEMS LIKE A BIT MUCH AND A LOT OF PEOPLE BEING IGNORED! I BOUGHT THIS CAR AROUND THE MIDDLE OF FEBRUARY AND THERE HASN'T BEEN ONE NIGHT I'VE BEEN ABLE TO SEE YOU WHILE DRIVING. IF I WENT TO THE DEALERSHIP AT NIGHT TO PURCHASE THE VEHICLE AND HAD SEEN HOW HORRIBLY BAD THE LIGHTS WERE I WOULD HAVE NEVER PURCHASED IT! ACURA DEALERS REALLY NEED TO MAKE THIS RIGHT AND NOT WAIT FOR SOMEONE OR SOMEONE ELSE TO BE SERVERLY INJURED TO DO SOMETHING ABOUT A SERIOUS HAZARDOUS ISSUE IN THEIR VEHICLES!",
        "vin": "5J8TB4H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REFLECTIVE COATING THAT IS SUPPOSED TO ILLUMINATE YOUR BEAMS BREAKS DOWN IN A SHORT TIME RESULTING IN POOR LIGHTING OF ROADWAYS AT NIGHT. HONDA HAD A RECALL, ACURA MAY HAVE USED THE SAME MANUFACTURER. REPLACING BULBS DOES NOT CORRECT THE PROBLEM.  APPEARS TO BE SAME PROBLEM AS  NHTSA RECALL 14V323000 FOR ACURA ILX.  HELP!~  I HAVE APPROX. 88,000 MILES ON VEHICLE AND USE LIGHTS BOTH DAYTIME AND NIGHT TIME - NOW CAN ONLY USE HIGH BEAMS AT NIGHT.",
        "vin": "5J8TB3H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394410,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE DULL AND MAKES IT ARE TO SEE AT NIGHT.  CHANGED OUT BULBS BUT DID NOT FIX THE PROBLEM.  CONTACTED DEALERSHIP AND WAS TOLD IT IS A KNOWN DEFECT LIKE ISSUE WITH THE REFLECTORS/MIRRORS WITHIN THE HEADLIGHT AND WAS TOLD THE WHOLE HEADLIGHT NEEDS TO BE REPLACED. OVER $2,000 BUT DEALERSHIP WOULD GIVE A DISCOUNT.  IF ACURA IS AWARE THAT THE LIGHTS ARE SO DEM AT NIGHT THAT DRIVERS CAN NOT SEE CLEARLY, THIS IS A SAFETY ISSUE THEY SHOULD TAKE CARE OF. THIS IS ONGOING PROBLEM SINCE IVE OWNED THE VEHICLE AND HAS GOTTEN WORSE THROUGH THE YEARS.",
        "vin": "5J8TB3H34EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A LOCAL STREET AND I HEARD A LOUD POP.  BUT I DID NOT SEE ANYTHING BOUNCE OFF THE CAR.  THAN I HEARD WIND NOISE FROM THE SUNROOF AND PARTICLES.  I THAN DROVE HOME SLOWLY AND LOOK ON TOP OF MY CAR THE SUNROOF WAS SHATTER AND HAD A BIG HOLE.  I GOOGLE THE PROBLEM AND THERE WERE INCIDENT THAT HAPPEN THE SAME LIKE ME.",
        "vin": "5J8TB3H56EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394376,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DRIVER AND PASSENGER LOW BEAM HEADLIGHTS ILLUMINATION HAS DECREASED SIGNIFICANTLY TO THE POINT IT IS UNSAFE TO DRIVE AT NIGHT. IT DOES NOT PROVIDE PROPER LIGHTING TO ILLUMINATE ROAD, ROAD SIGNS OR OTHER VEHICLES. THE ILLUMINATION DOES NOT CHANGE IF VEHICLE IS STATIONARY OR WHILE DRIVING. VEH. HAS 80K MILES AND IT APPEARS ITS IS A COMMON PROBLEM WITH ACURAS OF THIS YEAR AND MODEL. INSTALLED NEW BULBS AND IT IS STILL TOO DIM.  VEHICLES WILL FLASH THEIR LIGHTS AT ME THINKING I DO NOT HAVE MY LOW BEAMS ON BUT I DO THEY JUST SUCK. IN MY RESEARCH, IT APPEARS THAT THERE IS AN ISSUE WITH A REFLECTIVE AREA INSIDE THE HEADLIGHT ASSEMBLY THAT AFFECTS THE BRIGHTNESS OF THE BULBS. I BELIEVE THIS HAS BEEN RECALLED ON A ANOTHER ACURA MODEL ABOUT THE SAME AGE. I ALSO UNDERSTAND THAT THE ONLY SOLUTION IS TO REPLACE THE ENTIRE HEADLIGHT ASSEMBLY WHICH COST OVER A COUPLE THOUSAND EACH. THE GLASS COVER OVER THE FRONT OF THE HEADLIGHT IS ALSO FOGGED OR YELLOWED A BIT WITH AGE BUT NOT CONCERNING.  I HAVE NOTICED THIS PROBLEM SINCE SUMMER OF 2020 BUT NOW IT IS TO THE POINT THAT I DO NOT DRIVE MY CAR AT NIGHT AND HAVE TO BORROW FAMILY MEMBERS' VEHICLES DUE TO MY AND OTHERS SAFETY",
        "vin": "5J8TB3H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388946,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO GO TO WORK EARLIER IN THE MORNING WHILE IT'S STILL DARK.  MY LIGHTS DON'T SEEM TO BE WORKING.  I HAD THE BULBS REPLACED  A COUPLE OF DAYS AGO AND IT STILL NOT MUCH OF A DIFFERENCE.  I PRAY EVERY TIME I'M DRIVING AT NIGHT BECAUSE I CAN'T SEE A THING AND DON'T WANT TO GET IN AN ACCIDENT.  I TOOK IT TO THE DEALER AND THEY RECOMMENDED I CHANGE THE HEADLIGHTS WHICH WILL COST OVER $2,000.  I AM SO FRUSTRATED WITH THIS AND I DON'T KNOW WHAT ELSE TO DO.",
        "vin": "5J8TB3H32EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386529,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS DO NOT EMIT ENOUGH LIGHT TO SAFELY OPERATE THE VEHICLE AT NIGHT. THE HIGH BEAM IS NECESSARY TO SEE THE ROAD, ROAD SIGNS OR ANY OBJECTS IN THE ROADWAY.",
        "vin": "5J8TB3H37EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT STATED THAT THE LO-BEAM HEADLIGHTS WERE VERY DIM, CAUSING A VISIBILITY HAZARD WHILE DRIVING AT NIGHT. THE CONTACT STATED THAT THE FAILURE WAS MORE EVIDENT WHILE DRIVING IN INCLEMENT WEATHER. THE CONTACT REPLACED THE BULBS TWICE HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN TO FOUNTAIN ACURA (8785 ORANGE BLOSSOM TRAIL, ORLANDO, FL 32809, (866) 458-3766). THE CONTACT WAS INFORMED THAT THE PROJECTOR LENS FAILED TO FUNCTION AS DESIGNED WHICH CAUSED THE LACK OF ILLUMINATION FROM THE HEADLIGHT BULBS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 98,000.",
        "vin": "5J8TB3H35EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384127,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I PURCHASED OUR RDX IN 2014 AND HAVE ENJOYED ALL ASPECTS OF THE CAR EXCEPT FOR THE HEADLIGHTS.  EVER SINCE WE HAVE OWNED THE CAR THE HEADLIGHTS HAVE BEEN DIM.  MY WIFE HAS NOT DRIVEN THE CAR VERY MUCH AT NIGHT IN THE LAST COUPLE OF YEARS BUT RECENTLY WE HAVE HAD TO DRIVE IT AT NIGHT AND THE HEADLIGHTS HAVE GOTTEN MUCH WORSE.  WE JUST TOOK IT IN FOR A QUOTE AND WE NEED TO REPLACE THEM AND IT WILL COST IN EXCESS OF $2700!  I CALLED ACURA TO COMPLAIN AND FUNNY AS IT MAY SOUND BUT THE WOMAN THAT I SPOKE TO SAID THAT HEADLIGHTS NOT WORKING IS NOT A SAFETY ISSUE AND THE HEADLIGHTS WILL NOT BE RECALLED.  I ASKED IF I DRIVE AT NIGHT AND CRASH BECAUSE I CANNOT SEE IF THAT WAS A SAFETY ISSUE AND SHE STILL SAID IT WASN'T.  I AM PERPLEXED THAT WHEN SOMEONE COMES OUT WITH A FAULTY PRODUCT THAT THE COMPANY WILL DO EVERYTHING IN THEIR POWER TO SAVE MONEY EVEN IF IT IS AT THE EXPENSE OF THE INDIVIDUAL THAT SUPPORTS THAT COMPANY.  IT IS HONDAS RESPONSIBILITY TO TAKE CARE OF THE ISSUE BUT OBVIOUSLY THEY DON'T CARE.  BASICALLY AT THIS POINT IF I WERE TO DRIVE WITHOUT THE LIGHTS ON I DON'T THINK THAT THERE WOULD BE MUCH OF A DIFFERENCE.",
        "vin": "5J8TB4H39EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376346,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT STATED THAT WHILE DRIVING AT NIGHT, THE LOW BEAM HEAD LIGHTS WERE VERY DIM, REDUCING THE VISIBILITY FOR THE DRIVER. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER PRECISION ACURA OF PRINCETON LOCATED AT 3001 US-1, LAWRENCEVILLE, NJ 08648, WHO DIAGNOSED THAT BOTH THE DRIVER'S AND PASSENGER'S SIDE HEADLIGHT ASSEMBLIES WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5J8TB4H33EL"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372427,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ROOF BODY PAINT IS PEELING NEAR THE TAIL GATE. REAR SUSPENSION IS CLUNKING WHEN DRIVING OVER MINOR ROAD IMPERFECTIONS.",
        "vin": "5J8TB4H56EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365813,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE STATED THAT THE HEADLIGHTS WERE VERY DIM, MAKING IT HARD TO SEE WHILE DRIVING AT NIGHT. THE VEHICLE WAS TAKEN TO GUNN ACURA (11911 INTERSTATE 10 W, SAN ANTONIO, TX 78230) WHERE THE CONTACT WAS INFORMED THAT THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED. THE CONTACT MENTIONED AN UNKNOWN MANUFACTURER HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO CONTACT THE DEALER FOR ADDITIONAL REPAIR OPTIONS. THE FAILURE MILEAGE WAS APPROXIMATELY 54,000.",
        "vin": "5J8TB3H30EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN 2014 ACURA RDX AND MY HEADLIGHTS ARE EXTREMELY DIM, MAKING IT HARD TO DRIVE AT NIGHT. THE LIGHTS HAVE BEEN REPLACED AND THAT DIDN'T HELP. I SAW MANY 2014 ACURA RDX OWNERS REPORTED SAME PROBLEM. HTTPS://WWW.CARPROBLEMZOO.COM/ACURA/RDX/HEADLIGHTS-PROBLEMS.PHP.  I WENT TO ACURA DEALER NEARBY MY HOME MULTIPLE TIMES AND THEY DON'T WANT TO HELP.  THIS IS DANGEROUS AND COULD CAUSE ME TO HAVE AN ACCIDENT.  PLEASE ADVICE WHAT I NEED TO DO.",
        "vin": "5J8TB3H30EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363308,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2014 ACURA RDX AND MY HEADLIGHTS ARE EXTREMELY DIM, MAKING IT HARD TO DRIVE AT NIGHT. THE LIGHTS HAVE BEEN REPLACED AND THAT DIDN'T HELP. IT HAS A NEWER BATTERY AND NO ALTERNATOR ISSUES. I HAVE SEEN ONLINE THAT CUSTOMERS ARE EXPERIENCING THE SAME PROBLEM AND THAT MY CAR IS NOT RECALLED FOR THIS ISSUE. OTHER ACURA VEHICLES HAVE BEEN RECALLED FOR THE SAME THING. I HAVE CONTACTED ACURA CLIENT SERVICES AND THEY BASICALLY SAID MY WARRANTY IS EXPIRED. THIS IS DANGEROUS AND COULD CAUSE ME TO HAVE AN ACCIDENT. IT SEEMS LIKE ACURA DOESN'T WANT TO TAKE RESPONSIBILITY FOR THIS ISSUE. *LN*DT*JB *TR",
        "vin": "5J8TB4H33EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEAD LIGHTS ARE NOT EFFECTIVE, PASSES INSPECTION BUT NOT ADEQUATE EVEN WITH UPGRADED LIGHT BULBS. PASSENGER WHILE SITTING IN PASSENGER SEAT ASKED IF LIGHTS WERE ON DURING NIGHTTIME ERRAND RUN. UNABLE TO DRIVE MUCH AT NIGHT AND IF IT IS RAINING OR FOGGY AT NIGHT THEN UNABLE TO USE. CURRENTLY EXPLORING USING LED LIGHT UPGRADE. CONCERNED LENSE MAY BE DISCOLORED AS WELL. ANOTHER RDX OWNER TOLD ME THEY HAD TO REPLACE WHOLE HEADLIGHT ASSEMBLIES DUE TO DAMAGED CAUSED BY OEM LIGHT BULB.",
        "vin": "5J8TB3H31EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS AT NIGHT ARE EXTREMELY DANGEROUS TO DRIVE WITH. THERE IS PRACTICALLY MINIMUM LIGHT PROJECTED ON THE ROAD AND FROM THE DRIVERS SEAT CAN ONLY BE SEEN 3 TO 4 FEET PROJECTING OUT FROM THE VEHICLE. ACURA PLEASE BE ACCOUNTABLE! THIS IS A CRITICAL DESIGN FLAW! REPLACING BULBS WITH EVEN BRIGHTER, HIGH POWER LEDS DOES NOT FIX THE ISSUE. THE HOUSING PROJECTOR IS FLAWED. THIS COULD BE A FATAL ISSUE!!!",
        "vin": "5J8TB3H33EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352750,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT LOW BEAM IS EXTREMELY DEEM. YOU CAN NOT DRIVE AT NIGHT TIME.",
        "vin": "5J8TB3H36EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331470,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUT VEHICLE A LITTLE OVER A MONTH AGO, BECAUSE OF THE PANDEMIC HAD NOT DRIVEN IT AT NIGHT UNTIL THIS PAST WEEKEND.  WHEN RETURNING HOME FROM OUT OF STATE, IT STARTED GETTING DARK LIGHTS WERE TURNED ON AS IT GOT DARKER WE COULD NOTICE THAT YOU COULDN'T SEE ANYTHING IN FRONT OF YOU UNLESS YOU HAS THE HIGH BEAMS ON, WHICH IS NOT SAFE TO DRIVE WITH ON A MAJOR HIGHWAY.  IT WAS VERY FRIGHTENING GETTING HOME WITHOUT GETTING INTO AN ACCIDENT.  WHEN I CHECKED THERE WAS A RECALL JN2 ISSUED FOR THIS SAME PROBLEM.  THE RECALL STATES THE FOLLOWING \"CONSEQUENCE: DELAMINATION OF THE ALUMINUM FILM MAY DIMINISH OUTPUT OF THE HEADLIGHT, INCREASING THE RISK OF A VEHICLE CRASH. REMEDY: HONDA WILL NOTIFY OWNERS, AND DEALERS WILL REPLACE BOTH OF THE HEADLIGHTS, FREE OF CHARGE\" BUT WHEN I CHECKED MY VIN # WAS NOT PART OF THE RECALL, WHICH I DON'T UNDERSTAND WHY SINCE WHAT THE RECALL STATES IS WHAT IS HAPPENING WITH OUR CAR.  I'VE CALLED AND KEEP GETTING THE RUNAROUND, AND I KEEP GETTING TOLD THERE ARE NO RECALLS FOR THAT VIN# WELL MAYBE THERE SHOULD BE. I JUST WANT MY CAR FIXED TO AVOID A MAJOR ACCIDENT A FATALITY.  *TR",
        "vin": "5J8TB3H51EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318349,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HALOGEN HEADLIGHTS (LOW BEAMS) ON THE BASE DEGRADE TO THE POINT THAT THEY ARE NOT BRIGHT ENOUGH FOR NIGHTTIME DRIVING. EVEN HIGH BEAMS ARE BARELY EFFECTIVE. REPLACING BULBS DOES NOT RESOLVE THE ISSUE.",
        "vin": "5J8TB3H39EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN'T SEE THE ROAD AT NIGHT.  LOWER BEAMS NOT PROJECTING LIGHT ON ROADWAY MAKING DRIVING AT NIGHT IMPOSSIBLE AND EXTREMELY DANGEROUS.",
        "vin": "5J8TB3H37EL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/01/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXTERIOR BLACK PLASTIC GARNISH PILLARS (BETWEEN THE WINDOWS) HAS SEVERELY DEFORMED FROM THE HEAT OF THE SUN. I HAVE REPLACED THEM TWICE, AS THEY HAVE DEFORMED AND WARPED SO MUCH THAT IT IS CAUSING FRICTION ON THE WINDOW OPERATION AND PREVENTS NORMAL WINDOW OPENING AND CLOSING. THE BLACK PLASTIC PART HAS A FLAT BLACK FINISH AND BECOMES EXTREMELY HOT FROM THE DIRECT SUNLIGHT OR REFLECTION OFF OTHER WINDOWS OF MY HOUSE OR OTHER CARS. THEY HAVE WARPED SO BADLY THAT I HAD TO REPLACED THEM TWICE. THE FIRST TIME AT THE DEALERS EXPENSE AND THE SECOND TIME AT MY EXPENSE. I HAVE NOTED THAT THE NEWER 2020 MODELS HAVE CHANGED THE PILLARS FROM A FLAT BLACK FINISH TO A HIGHLY REFLECTIVE SHINY BLACK FINISH, THAT WILL REFLECT THE LIGHT AND NOT BECOME AS HOT AS THE FLAT BLACK SOFT PLASTIC PILLARS THAT MY VEHICLE HAS. ACURA SHOULD RECALL THESE DEFECTIVE PARTS AND REPLACE THEM WITH A HARDER PLASTIC THAT WILL NOT WARP FROM THE HEAT OF THE SUN.",
        "vin": "5J8TB3H57EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301566,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE ON BUT ABSOLUTELY NO VISIBILITY ON THE ROAD AT NIGHT. HEAD LIGHT ENCLOSURE IS CLEAR AND NOT FOGGED OVER. SEVERE SAFETY ISSUE. OTHER ACURA AND HONDA HEADLIGHTS ON OTHER MODELS HAVE BEEN RECALLED FOR SAME ISSUE.",
        "vin": "5J8TB3H39EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289232,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-87 SOUTH ON A SMOOTH STRIP OF ROAD, WHICH WAS RECENTLY REPAVED. I HEARD AN EXPLOSION AND GLASS SHATTERING. GLANCED AROUND BUT ALL WINDOWS WERE INTACT. AT THE FIRST STOP I OPENED MY SUNROOF VISOR AND SHARDS OF BROKEN GLASS SHOWERED DOWN FROM THE SHATTERED SUN ROOF. MY CAR IS A 2014 ACURA RDX WITH TECH PACKAGE",
        "vin": "5J8TB4H5XEL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289159,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE WAY TOO DIM - EVEN AFTER CHANGING BULBS AND THE LENS IS NOT FOGGED AT ALL.  YOU CAN'T EVEN TELL IF YOUR LIGHTS ARE ON AT NIGHT - THIS IS A SERIOUS SAFETY ISSUE.  OTHER ACURA VEHICLES HAVE A RECALL FOR THIS.  IN RESEARCH - THE REFLECTIVE COATING THAT IS SUPPOSED TO ILLUMINATE YOUR BEAMS BREAKS DOWN IN A SHORT TIME RESULTING IN POOR LIGHTING OF ROADWAYS AT NIGHT. RECENTLY HAD SOMEONE IN THE CAR FOR THE 1ST TIME DRIVING AT NIGHT - AND THEY ASKED IF I HAD MY LIGHTS ON.  SO IT IS VERY NOTICEABLE BY PEOPLE.  IS THERE NOT A STANDARD OF LIGHTING THAT HAS TO BE MET FOR SAFETY?  AND IF THIS IS ISSUE - SHOULD IT NOT BE A RECALL??  LOOK AT ILX RECALL FOR SAME ISSUE- 2013-2014.",
        "vin": "5J8TB3H30EL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281318,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 ACURA RDX RUNNING/LOW BEAM HEADLIGHTS ARE DANGEROUSLY DIM. I FIRST NOTICED THIS LAST YEAR AND CHANGED OUT THE HALOGEN BULBS. I DO NOT DO MUCH DRIVING AT NIGHT.  IN THE PAST MONTH WITH THE TIME CHANGE, I CAN BARELY SEE AT NIGHT WHILE DRIVING.  THE HALOGEN BULB HAS BEEN CHANGED OUT AGAIN, SO ITS NOT THE BULB.  IT IS SOMETHING WITHIN THE HEADLIGHT ASSEMBLY ITSELF - VERY DIFFICULT TO DRIVE AT NIGHT.  AT TIMES I MUST TURN ON THE HIGH BEAMS WHEN DRIVING DOWN A DARK ROAD.   THIS CANNOT BE FIXED WITHOUT PURCHASING NEW COMPLETE HEADLIGHT ASSEMBLIES.",
        "vin": "5J8TB3H33EL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11210809,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED AND SHUT MY CAR OFF AT OUR LOCAL SHOPRITE PARKING LOT. I GOT OUT OF THE CAR AND MY SON WAS YELLING THAT HE COULDN'T GET OUT.THE SEATBELT HAD HIM TANGLED UP. I TOOK THE LATCH OFF AND TRIED TO LOOSEN THE SEAT BELT. HE TRIED PULLING THE SEAT BELT TO LOOSEN IT NOTHING. I TURNED THE CAR ON TO SEE IF IT WOULD LOOSEN THAT WAY NOTHING. I DROVE HOME. EVERYTHING WE ATTEMPTED THE SEAT BELT KEPT TIGHTENING. I TRIED PULLING IT OVER HIM UNDER HIM TOOK OFF HIS SHOES AND JEANS. REMEMBER IT WAS UNBUCKLED ALREADY. I GOT HOME AND TRIED TO UNSCREW THE BOLT THAT ATTACHED THE SEAT BELT TO THE CAR. UNFORTUNATELY, THE BIT WASN'T LONG ENOUGH. AT THIS POINT AN HOUR PASSED OF US TRYING EVERYTHING POSSIBLE TO GET HIM OUT. HIS STOMACH STARTED HURTING HIM. I HAD TO CUT THE SEATBELT. I WAS GOING TO CALL THE POLICE BUT I'M VERY HANDY AND I KNEW AT THIS POINT I HAD TRIED EVERYTHING POSSIBLE PLUS MY SON WAS IN PAIN, THE SEATBELT WAS HURTING HIS STOMACH. I HOPE SHARING THIS STORY HELPS OTHER PARENTS AND IF THIS HAPPENS TO YOU PLEASE REPORT IT. EVEN IF YOU ARE HANDY AND KNOW NOTHING CAN BE DONE REPORTING IT HELPS, THIS WAY IT'S NOT ONLY YOUR WORD. I BELIEVE SOMETHING IS VERY WRONG WITH THIS SEATBELT DESIGN. ON ANOTHER NOTE, PEOPLE MIGHT THINK MY KID WAS JUMPING AROUND CREATING HAVOC BUT MY SON IS ACTUALLY VERY RESERVED AND QUIET.",
        "vin": "5J8TB4H33EL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181146,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. WHILE DRIVING AT UNKNOWN SPEEDS ON UNEVEN PAVEMENT, THERE WAS AN ABNORMAL CLUCKING NOISE EMERGING FROM THE REAR OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO ACURA OF LIMERICK (77 AUTOPARK BLVD, LIMERICK, PA 19468, (610) 495-5888) WHERE IT WAS DIAGNOSED THAT THE REAR SUSPENSION SHOCKS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 09313264. THE MANUFACTURER STATED THAT THEY WOULD SPLIT THE COST OF THE REPAIRS. THE FAILURE MILEAGE WAS 36,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174753,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA HAS A REAR SUSPENSION ISSUE WITH MANY OF THEIR SUV'S BUT IS TRYING TO AVOID ISSUING A RECALL BECAUSE THEY'RE TOO CHEAP TO DO THE RIGHT THING.  THE REAR SHOCKS HAVE A DEFECT WHICH RESULTS IN A CLUNKING NOISE IN THE REAR OF THE CAR.  ACURA HAS ACKNOWLEDGED THE PROBLEM BUT WON'T GET OFF THEIR REAR ENDS AND FIX THE ISSUE.  MY CAR HAS BEEN SITTING AT ACURA IN DENVER COLORADO FOR OVER THREE MONTHS AND THEIR HANDS ARE TIED BECAUSE ACURA DOESN'T SEEM MOTIVATED TO FIX THE PROBLEM PROMPTLY.  THERE ARE THOUSANDS OF THESE CARS WAITING FOR REPLACEMENTS ALL OVER THE USA AND OTHERS ACURA OWNERS THAT DON'T EVEN KNOW THIS SITUATION IS GOING ON BECAUSE THEY ARE BEING MISLED AND ACURA IS INTENTIONALLY TRYING TO KEEP THIS UNDER WRAPS.",
        "vin": "5J8TB3H52EL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154086,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COLD THE TRANSMISSION APPEARS TO SLIP AND THEN HARD SHIFT FROM 1ST TO 2ND GEAR. CITY STREETS AND STARTING FROM A FULL STOP.  THIS HAS HAPPENED FROM PURCHASE DATE IN DECEMBER 2014.  THIS PROBLEM OCCURRED AGAIN TODAY 11/26/2018.",
        "vin": "5J8TB4H59EL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129481,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED WITH THE ENGINE OFF AT THE GAS STATION MY CHILD ATTEMPTED TO EXIT THE VEHICLE. UPON RELEASING THE DRIVER SIDE BACK SEAT, THE SEAT BELT HAD MY CHILD ENTANGLED TRYING TO GET OUT OF THE CAR. THE SEAT BELT WAS UNBUCKLED/UNLATCHED YET IT SOMEHOW ENTRAPPED MY CHILD . I WAS UNABLE TO LOOSEN THE SEAT BELT AND IT CONTINUED TO RETRACT AND TIGHTEN ON MY CHILD. MY CHILD WAS ALSO UNABLE TO LOOSEN THE SEAT BELT WHICH WAS WRAPPED AROUND BACK AND STOMACH CAUSING PAIN AND DISCOMFORT. MY CHILD WAS UNABLE TO SIT OR STAND UPRIGHT AS I ATTEMPTED TO PULL THE SEAT BELT OVERHEAD OR BELOW STOMACH; CHILD WAS FORCED TO REMAIN IN A SQUAT-LIKE POSITION.I CONTINUED TO PULL AT THE TOP RE-TRACTOR IN THE HOPES OF IT \"GIVING\" AND LOOSENING BUT THE DEVICE FAILED TO \"OVERRIDE.\" I  IMMEDIATELY WENT TO THE LOCAL FIRE DEPARTMENT WHERE THEY TRIED, UNSUCCESSFULLY, TO LOOSE THE HARNESS THAT WAS CREATED BY THE SEAT BELT, NOR WERE THEY ABLE TO REMOVE THE CHILD. THE FINAL DECISION WAS MADE, BY THE CHIEF, TO CUT THE SEAT BELT IN ORDER TO RELEASE THE CHILD.    I BELIEVE THAT THERE IS A DEVICE MALFUNCTION THAT IS A GRAVE SAFETY RISK OF STRANGULATION IF NOT PROPERLY REVIEWED AND REPLACED. I WAS EXPECTING THE BELT TO LOOSEN AFTER TUGGING AT IT AND THE FACT THAT TRAINED FIREFIGHTERS/PARAMEDICS COULDN'T PULL IT OUT IS QUITE ALARMING.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/08/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110100,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MOVING, DRIVER SIDE SUN VISOR WAS MOVED TO SIDE WINDOW. THE SUN VISOR BROKE OUT OF IT'S OUT OF SOCKET; BLOCKED DRIVER VISION AND WAS  DANGLING ON THE STEERING WHEEL.",
        "vin": "5J8TB3H5XEL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT WHEEL BEARINGS FAILED CATASTROPHICALLY AT 61,000 MILES",
        "vin": "5J8TB4H51EL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DRAINING REQUIRING A JUMPSTART.  EVERYTHING IS POWERED OFF WHEN CAR IS PARKED.  WHILE DRIVING AND PARKED I CAN FEEL THE CAR JUMP.",
        "vin": "5J8TB3H5XEL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "12/25/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT FLICKERING - WAS TOLD IT WAS BULB BUT HAVE FOUND COMPLAINTS ON THE BALLAST AND OTHER ACURA MODELS WITH PROBLEMS WITH HEADLIGHTS.  ACURA IS MAKING OVER $300-500 PLUS PER SERVICE CALL AND CLAIMS THIS IS A NON EXTENDED WARRANTY PROBLEM.     LIGHT FLICKERS WHILE PARKED, IN MOTION AT RANDOM TIMES.",
        "vin": "5J8TB4H52EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041852,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY TO WORK.  I WAS COMING DOWN THE HIGHWAY WHEN SUDDENLY WE HEARD WHAT SOUNDED LIKE A ROCK OR AN OTHER OBJECT HIT THE TOP OF MY VEHICLE BUT, WE DIDN'T SEE THE ROCK OR OBJECT.  IT WAS A HARD HIT PER THE SOUND.  MY SON WAS IN THE VEHICLE WITH ME.  HE PULLED BACK THE SUNROOF COVER AND WE SAW THAT THE SUNROOF WAS SHATTERED.  AS I DROPPED MY SON OFF AT WORK, WE WERE ABLE TO FURTHER EXAMINE THE DAMAGE.  THE SHATTERED PIECES OF GLASS WAS BLOWING OFF THE ROOF AS I CONTINUED TO DRIVE THE VEHICLE MAKING IT A SAFETY CONCERN.  THEREFORE, I HAD TO GET THE SUNROOF REPAIRED IMMEDIATELY.  I CONTACTED THE ACURA DEALERSHIP FIRST FOR THE REPAIR AND THEY INFORMED ME THAT THEY DIDN'T REPAIR SUNROOFS. AFTER SHOPPING AROUND FOR AN AFFORDABLE PRICE,  I TOOK IT TO A AUTO GLASS REPAIR SHOP AND THEY REPAIRED IT.  I FOUND MYSELF WITH AN UNEXPECTED OUT-OF- POCKET EXPENSIVE REPAIR COST OF A LITTLE LESS THAN $500.   I WAS LATER INFORMED OF AN CURRENT INVESTIGATION ON EXPLODING SUNROOFS.  I'M WONDERING IF THAT'S WHAT I EXPERIENCED WITH VEHICLE'S SUNROOF. I DO HAVE PHOTOS BUT NOT ABLE TO UPLOAD AT THIS TIME.",
        "vin": "5J8TB4H56EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003896,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, JULY 7, THE SUNROOF ON MY 2014 ACURA RDX EXPLODED WHILE DRIVING ON A HIGHWAY.  I HEARD A SOUND LIKE A BOMB GOING OFF, THEN I SAW GLASS FLY BEHIND MY CAR.  FORTUNATELY THERE WERE NO CARS BEHIND ME AT THAT TIME AND THE LINER INSIDE MY CAR WAS CLOSED OR GLASS WOULD HAVE FLOWN INTO THE CAR AND MOST LIKELY HURT MYSELF AND MY CLIENT.   I CALLED ACURA DEALER, AND THEY SAID THEY NEVER HEARD OF SUCH A THING.  AFTER SEARCHING ON THE INTERNET, I FOUND THAT THIS IS A CHRONIC PROBLEM AND HUNDAI AND AUDI HAVE ISSUED VOLUNTARY RECALLS OF SUN ROOF GLASS AND THAT MANY OTHER CAR MANUFACTURERS HAVE HAD THIS PROBLEM.  HERE IS A LINK TO A TV NEWS STORY ON THE ACURA RDX :  HTTP://WWW.NBCNEWYORK.COM/NEWS/LOCAL/SHATTERED-GLASS-SUNROOF--293692881.HTML.  THERE ARE THOUSANDS OF COMPLAINTS ABOUT THIS PROBLEM AT THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND THERE ARE CLASS ACTION SUITS UNDERWAY.  I AM IN THE PROCESS OF ASKING ACURA TO PAY FOR THE REPAIR WHICH WILL BE ABOUT $1,200 ($367 FOR THE GLASS AND THE REST LABOR CHARGES).  WITH ALL OF THE SUN ROOFS OUT THERE, THIS IS A SAFETY ISSUE FOR PEOPLE IN THE CAR AND OUTSIDE OF THE CAR WHEN THERE IS FLYING GLASS.  ACCORDING TO REPORTS, THINNING OF THE SUN ROOF GLASS AFTER 2010 COULD BE PARTLY RESPONSIBLE AS CAR MANUFACTURERS ATTEMPTED TO LIGHT WEIGHT FOR BETTER GAS MILEAGE.  ALSO, THE GLASS USED IS NOT THE SAME AS WINDSHIELD GLASS.  .  I AM HOPING THIS REPORT WILL MAKE OTHERS AWARE OF THIS SAFETY PROBLEM.",
        "vin": "5J8TB3H50EL"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2017",
        "dateOfIncident": "01/03/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985539,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1. FAULTY SHOCK ABSORBERS.  THIS IS KNOWN THE PROBLEM WITH ACURA'S.  MANY RDXS FRONT AND REAR SHOCKS MUST REPLACED, BEFORE 50,000 MILES  2. ABNORMALLY CORRODING BRAKE ROTORS.  3. FAULTY BUSHING ON SHOCK ABSORBERS.   THIS CAR CLUNKS LIKE THE JUNK PILE IT IS.  4. DEALERSHIP REQUESTING TRANSMISSION/TRANSAXLE FLUID CHANGE, ON A 28,000-MILE VEHICLE",
        "vin": "5J8TB3H58EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "01/03/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939679,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTERIOR MIRRORS PRESENT AN EXTREME SAFETY HAZARD SINCE THEY ARE NOT PROPERLY PLACED OR ADJUSTED TO ALLOW A PROPER BLIND-SPOT PICKUP OF VEHICLES.  THEY CAN NOT BE ADJUSTED TO A POSITION ANGLED ENOUGH TO SHOW THE BLIND SPOT AREA. EXTREMELY DANGEROUS FLAW.",
        "vin": "5J8TB4H57EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934951,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL ACURA RDX 2014 WAS NOTIFIED OF DEFECTIVE PART AND RECALL ISSUE BY ACURA DEALER SHIP, THEY STATED IT WOULD BE SIX TO EIGHT WEEKS TILL PARTS WERE AVAILABLE AND THOSE THAT CONTINUE TO DRIVE THEIR CAR INSTEAD OF A RENTAL OR PARKING IT DUE TO RISK WOULD BE FIRST TO GET PARTS. ELECTED TO KEEP DRIVING AT THE TIME. NOW IT HAS BEEN EIGHT MONTHS LATER DEC 2016 I HAVE NOT BEEN CONTACTED FURTHER. WHEN CONTACTING DEALER I ONLY GET ANOTHER OFFER FOR A RENTAL CAR.  I STILL HAVE TO PAY FULL PRICE ON MY LEASE.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\". THIS IS IN REFERENCE TO ACURA RDX 2014 THAT I OWN. ACURA ISSUED A RECALL BACK IN MARCH 2016 BUT THEY HAVE SHOWED LITTLE TO NO WILLINGNESS TO SERVICE THE RECALL. EVEN AFTER 8 MONTHS FROM THE NOTICE THEY HAVEN'T SERVICED THE PART. LEAVING ME AND MY FAMILY AT RISK. THIS IS A CALLOUS BEHAVIOR ON THE PART OF THE COMPANY. HONDA IS SHOWING NO RESPECT OR CONCERN FOR PEOPLE WHO ARE DRIVING THE VEHICLE AND PUTTING LIFE OF FAMILIES AT RISK. I WOULD SUGGEST STERN ACTION AGAINST THE FIRM AND THEY SHOULD BE FORCED TO COMPENSATE US FOR OUR TIME.",
        "vin": "5J8TB4H37EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902920,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA RDX.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER FRONT AIRBAG INFLATOR AIRBAG RECALL NOTICE.  *SMD",
        "vin": "5J8TB4H53EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909710,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ..UPDATED 11/03/16 *BF",
        "vin": "5J8TB4H53EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "05/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905393,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA RDX.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR RECALL NOTICE 16V-061.  *SMD",
        "vin": "5J8TB3H58EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 11/04/16*LJ  THE CONSUMER STATED THE NEW DRIVER'S SIDE AIR BAG WAS INSTALLED ON SEPTEMBER 25, 2016. UPDATED 11/17/16.*JB",
        "vin": "5J8TB4H58EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "09/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904738,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MANUFACTURER HAS FAILED OR IS UNABLE TO REMEDY THIS SAFETY RECALL (AIRBAG INFLATOR RECALLS). IT WAS PROMISED TO FIX IN SUMMER 2016",
        "vin": "5J8TB3H35EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903746,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M REACHING OUT REGARDING A TAKATA AIR BAG RECALL WHICH HAS BEEN IN EFFECT FOR SOME TIME.  I REACHED OUT TO MY DEALER'S SERVICE DEPARTMENT NUMEROUS TIMES TO HAVE THE AIRBAGS REPLACED (OVER THE LAST SEVERAL MONTHS).  I WAS TOLD THE FIRST TIME A COUPLE OF WEEKS THEN I CALLED IN TWO WEEKS AND THEY CLAIMED NOT UNTIL THE END OF THE SUMMER AND NOW I HAVEN'T HEARD ANYTHING.  I AM CONCERNED AS I HAVE TO USE MY VEHICLE FOR WORK DAILY AND I HAVEN'T HAD ANY RESOLUTION.  IS THERE SOMEPLACE ELSE I CAN GET MY RECALL TAKEN CARE OF?  MY CURRENT ACURA DEALER IS CLINTON ACURA IN NJ.  I AM CONCERNED FOR MY SAFETY.  I'VE BEEN REACHING OUT SINCE JULY, 2016 (BY THE WAY) - THEY HAVEN'T HAD THE PARTS..IT'S RIDICULOUS",
        "vin": "5J8TB4H57EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899116,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H52EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  TOLD BY ACURA DEALER TO DISABLE THE FRONT AIRBAG.  I TOLD THEM NO.  THEY SAID THEY WOULD CALL BECK AND I HAVE NOT HEARD FROM THEM YET.",
        "vin": "5J8TB3H53EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899225,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH, 2016 I RECEIVED A RECALL LETTER ABOUT THE DRIVER SIDE AIRBAG FROM ACURA. FINALLY ON 8/19/2016 (FIVE MONTHS LATER) I RECEIVED A CALL FROM APPLE TREE ACURA TO MAKE AN APPOINTMENT TO FIX THE AIRBAG. ON 8/23/2016 I DROPPED MY VEHICLE OFF AT APPLE TREE ACURA. WHEN I PICKED MY VEHICLE UP I WAS TOLD THAT THE AIRBAG WAS FIXED. BUT, ON THE INVOICE IT STATES THAT \"CLIENT ADVISED THAT THE VEHICLE IS SUBJECT TO ONE OR MORE RECALLS AFFECTING THE DRIVERS AND/OPR PASSENGERS FRONT AIRBAG INFLATORS. REDESIGNED AIRBAG INFLATORS ARE NOT AVAILABLE FOR INSTALLATION AT THIS TIME. ONCE REDESIGNED PARTS ARE AVAILABLE, THE REGISTERED OWNER WILL RECEIVE NOTICE TO RETURN FOR REPLACEMENT OF THE COMPONET. OPEN RECALL. REPLACED DR AIRBAG INFLATOR.\" PLEASE REVIEW ATTACHED RECALL LETTER AND INVOICE. THE CUSTOMER SERVICE PERSON NEVER ADVISED ME OF ANYTHING, HE GAVE ME THE INVOICE THEN DISAPPEARED. IT TOOK FIVE MONTHS AND ABOUT TEN PHONE CALLS TO EVEN GET AN APPOINTMENT. MOST OF MY CALLS WENT TO VOICEMAIL WITH NO RETURN CALLS. ON 8/29/2016 I CALLED NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION (NHTSA), I WAS PUT ON HOLD AND THEN DISCONNECTED. I HAD GIVEN THE PERSON MY CALL BACK NUMBER BUT IT HAS BEEN FIVE HOURS AND NO ONE HAS CALLED ME BACK. IT SEEMS THAT ACURA AND THE NHTSA ARE AVOIDING QUESTIONS AND CONCERNS ABOUT THIS RECALL. I WOULD LIKE TO KNOW WHEN AND IF MY VEHICLE WILL BE SAFE TO DRIVE?",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10901911,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I RECEIVED A RECALL NOTICE(NHTSA RECALL 16V-061) IN MARCH 2016.  AS OF TODAY, NO ADDITIONAL INFORMATION HAS BEEN RECEIVED IN REGARD TO THE STATUS OF THIS ISSUE.  WE ARE APPROACHING 6 MONTHS, WHICH SEEMS EXCESSIVE GIVEN THE DANGER THAT THE AIRBAG DEPLOYMENT COULD CAUSE.",
        "vin": "5J8TB4H31EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897084,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H55EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896765,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H51EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895892,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H56EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H52EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2016",
        "dateOfIncident": "07/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888005,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 16V-061.  RECEIVED RECALL NOTIFICATION FROM ACURA MARCH 2016.  IT HAS BEEN WELL OVER 60 DAYS AND NO FURTHER INFO FROM ACURA ABOUT PARTS AVAILABILITY.  I HAVE CONTACTED DEALER TWICE WHERE ORIGINAL PURCHASE WAS MADE(PARK ACURA) AND WAS TOLD THE PARTS ARE NOT YET AVAILABLE FROM ACURA.",
        "vin": "5J8TB4H52EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885895,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3834EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA RDX.  CONSUMER WRITES IN REGARDS TO VEHICLE MOTOR COMPANY FAILURE TO CORRECT AIRBAG RECALL DEFECT IN A TIMELY MANNER.  *SMD",
        "vin": "5J8TB4H50EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J8TB4H56EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884531,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR.  THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H59EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884558,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -   MY COMPLAINT IS BECAUSE OVER 2 MONTHS HAVE GONE BY SINCE THE FIRST TIME (MAY 05TH) I CONTACTED THE ACURA DEALER IN ORDER TO SCHEDULE THE AIR BAGS REPLACEMENT. THEY HAVE FAILED TO SOLVE WITHIN 60 DAYS OF OUR FIRST ATTEMPT TO SCHEDULE REMEDIATION. WE WERE APPOINTED A LOANER BUT  THAT JUST SEEMS TO MAKE ACURA LOSE THE SENSE OF URGENCY FOR THE REMEDIATION.",
        "vin": "5J8TBH57EL0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884379,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART FOR THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H58EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H53EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882933,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -- I FIRST LEARNED THAT MY VEHICLE WAS PART OF THE TAKATA RECALL IN MARCH 2016, WHEN I TOOK THE CAR IN FOR REGULAR SERVICE. AT THAT TIME, THE DEALERSHIP SAID THAT PARTS WERE NOT AVAILABLE. THEY DID NOT INSTRUCT ME TO STOP DRIVING THE CAR, WARN ME OF THE SERIOUSNESS OF THE RECALL, OR OFFER ME A RENTAL.  INSTEAD, I DROVE THE CAR UNTIL EARLY MAY, AND THEN CALLED TO CHECK ON THE STATUS OF PARTS. WITH PARTS STILL NOT AVAILABLE, THE DEALERSHIP THEN INSTRUCTED ME TO STOP DRIVING THE VEHICLE AND PUT ME IN A RENTAL. NOW, AFTER 2 MONTHS OF DRIVING A RENTAL AND 4 MONTHS OF KNOWING ABOUT THE RECALL, I STILL CANNOT GET ANY INFORMATION FROM ACURA ABOUT WHEN MY PARTS WILL BE AVAILABLE. MY CAR IS SITTING IN MY GARAGE WITH A DEAD BATTERY AND POTENTIALLY ADDITIONAL DAMAGE FROM THE PROLONGED STORAGE, I'M DRIVING A MUCH CHEAPER VEHICLE THAN THE ONE I PURCHASED AND AM STILL PAYING FOR, AND ACURA JUST KEEPS SAYING THAT THEY DON'T HAVE PARTS. I AM VERY FRUSTRATED AND EITHER WANT MY PARTS AND MY VEHICLE REPAIRED IN THE NEAR FUTURE OR WANT ACURA TO FACILITATE THE TRADE-IN OF MY VEHICLE FOR A 2017 MODEL, WHICH IS NOT RECALLED, BY MAKING UP SOME OF THE DIFFERENCE BETWEEN THE TRADE-IN VALUE OF MY VEHICLE AND THE COST OF A 2017 MODEL.",
        "vin": "5J8TB4H56EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY COMPLAINT IS THAT ACURA AND/OR MCGRATH ACURA DEALERSHIP IN MORTON GROOVE ILLINOIS IS NOT SUPPORTING THIS RECALL. I RECEIVED A RECALL NOTICE IN THE MAIL FROM ACURA, BACK IN FEBRUARY,2016, STATING MY VEHICLE IS PART OF THIS RECALL. IN FEBRUARY OR MARCH, I CALLED MCGRAFH ACURA DEALERSHIP IN MORTON GROOVE, ILLINOIS AND WAS TOLD THEY WOULDN'T HAVE PARTS UNTIL THE SUMMER. I CALLED THE SAME DEALER TODAY,7/6/2016, AND WAS TOLD PARTS WERE NOT THERE FOR MY SUV. SERVICE DEPARTMENT SAID PARTS WERE TRICALLING IN FROM ACURA AND THEY ARE APPROXIMATELY 200 PEOPLE AHEAD OF ME. SO I'M ON A WAITING LIST WITH NO DEFINITE TIME WHEN THEY WILL DO THE RECALL. HAVE YOU HAD OTHER COMPLAINTS LIKE THIS? THEIR RECALL NOTICE STATES MY SAFETY IS AT RISK BUT THEY DON'T' SEEM TO CONCERNED.",
        "vin": "5J8TB4H54EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881970,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H55EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876410,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H37EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875106,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA RDX.  CONSUMER WRITES IN REGARDS TO NO RESPONSE AFTER SEVERAL REQUESTS TO DEALERSHIP TO REPAIR DEFECTIVE AIRBAGS.  *SMD",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "05/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864813,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW UP LETTER FROM ACURA ABOUT AIR BAG, GIVEN A CASE#  04667931, AND PROMISED A LOANER CAR THROUGH DEALER; CENTER ACURA IN SHERMAN OAKS, CA. CONTACTED DEALER, REFUSED TO GIVE A LOANER CAR. CALLED ACURA BACK, NEVER HEAR ANYTHING!",
        "vin": "5J8TB4H57EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "02/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863890,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 ACURA RDX.  CONSUMER WRITES IN REGARDS TO DEALERSHIPS FAILURE WITHIN A REASONABLE TIME FRAME TO REPAIR DRIVERS FRONT AIRBAG INFLATOR RECALL.  CONSUMER STATES DEALERSHIP USED RECALL TO PRESSURE THEM INTO PURCHASING A NEW VEHICLE.  *SMD",
        "vin": "5J8TB3H36EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864223,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND THE DEALER STATED THAT THE PARTS MIGHT NOT BE AVAILABLE UNTIL MID AUGUST OF 2016. THE CONTACT FELT THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME OF THE RECALL REPAIR. THE DEALER WAS CONTACTED FOR MONTHS AND UPON SPEAKING TO THE MANUFACTURER THEY HAD NO ADDITIONAL INFORMATION OTHER THAN THE CONTACT MIGHT HAVE TO WAIT. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE",
        "vin": "5J8TB4H30EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862397,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2014 HONDA ACURA RDX FROM VANDERGRIFF ACURA IN 2014. I HAVE RECEIVED A SAFETY RECALL ON IT FOR FAULTY AIRBAGS. MY HUSBAND AND I ARE RETIRED, AND ARE VERY WORRIED ABOUT OUR CAR WE CAN'T DRIVE. WE DID GET A RENT CAR. IN THE RECALL LETTER, IT STATES WE SHOULD GET THE AIRBAG INSTALLED BY THE SUMMER. I HAVE AN EMAIL FROM AN EMPLOYEE OF VANDERGRIFF ACURA, THAT IT MIGHT BE FALL  BEFORE WE GET IT INSTALLED. RIGHT NOW, OUR BEAUTIFUL CAR IS SITTING IN THE GARAGE, HAS BEEN FOR 1 MONTH. WE REALLY CAN'T IMAGINE IT THERE UNTIL FALL? IS IT HARD ON A CAR TO LEAVE IT LIKE THIS? WE ARE WORRIED AND JUST DO NOT KNOW WHAT TO DO. WE PAID $32,000.00 FOR THIS CAR IN 2014, AND NOW WE FEEL LIKE VANDERGRIFF ACURA KNEW AT THE TIME THEY SOLD US THIS AUTO, THAT THE AIRBAGS WERE FAULTY, AND THEY PUT OUR LIVES AT DANGER.MY EMAIL ADDRESS IS [XXX] AND MY MAILING ADDRESS IS [XXX].      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5J8TB3H38EL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855445,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE MADE AN ABNORMAL NOISE. THE DEALER DIAGNOSED THAT THE DRIVER SIDE STRUT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "5J8TB3H52EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE DEALER AND MANUFACTURER INDICATED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H38EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853753,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) WAS RECEIVED IN MARCH OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J8TB4H36EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852387,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V061000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR.  THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACTS VEHICLE WOULD RECEIVE THE RECALL REPAIR AND ONLY INDICATED THAT THE PART MAY BECOME AVAILABLE MID SUMMER 2016. THE CONTACT WAS NOT EXPERIENCING A FAILURE.",
        "vin": "5J8TB4H54EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852159,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. WHILE PULLING INTO A PARKING SPACE, THE VEHICLE'S AIR BAGS DEPLOYED WITHOUT WARNING OR AN IMPACT. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS AWAITING DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "5J8TB4H32DL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852025,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT RECEIVED AN INTERIM NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE MANUFACTURER ONLY INDICATED THAT THE PARTS MAY BECOME AVAILABLE BY MID SUMMER 2016. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE DEALER WOULD BE SUPPLIED WITH THE PARTS AND THE MANUFACTURER WAS UNABLE TO PROVIDE A REASONABLE TIME FRAME TO REPAIR THE VEHICLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H57EL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825145,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 ACURA RDX. THE CONTACT HEARD AN ABNORMAL NOISE IN THE REAR OF THE VEHICLE WHILE DRIVING OVER DIVOTS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE REAR SHOCK ABSORBERS WERE DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 41,253....UPDATED 04/26/16 *BF",
        "vin": "5J8TB4H51EL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "11/02/2015",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790137,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE TWO 2014 RDX'S. WIFE HIT A DEER WITH DAMAGE TO THE RIGHT FRONT LIGHT AND RIGHT FRONT QUARTER PANEL. SUPPOSE TO BE A 3700.00 REPAIR BUT WHEN BODY SHOP DROVE RDX INTO THEIR BUILDING IT CAUGHT FIRE AND NOW WE HAVE A TOTALED 40,000 RDX. EVERYBODY HAS SAID THEY CAN'T EVER REMEMBER A ACURA EVER CATCHING ON FIRE. IN TALKING WITH A ACURA MECHANIC HE MENTIONED SOMETHING ABOUT THEY HAD SOME ELECTRICAL ISSUES ON THESE VEHICLES BUT NOTHING WAS PROVEN. WE ARE WAITING ON THE RESULTS FROM THE ELECTRICAL ENGINEERS THAT THE INSURANCE PEOPLE HAVE HIRED TO TRY TO DETERMINE IF THERE IS A PROBLEM WITH IT'S MANUFACTURING  OR SOMETHING ELSE THEY ARE ASKING IF ANY THING WAS LEAKING FROM THE VEHICLE AND AS FAR AS WE KNOW IT WASN'T LEAKING SINCE WE KEPT DRIVING IT UNTIL WE TOOK IT TO THE BODY SHOP. MY PROBLEM IS I DON'T WANT TO PARK THE OTHER RDX IN MY GARAGE NOT KNOWING IF THE VEHICLE HAS A MANUFACTURING ELECTRICAL PROBLEM. THE MECHANIC TOLD ME TO DISCONNECT MY BATTERY CABLE IF I WAS WORRIED. I DON'T FINE THAT AS A SOLUTION TO THE PROBLEM. THE OTHER PROBLEM WE HAVE IS THE CAR WAS BEING DRIVEN AND THEY PULL IT INTO THEIR SHOP WHERE THEY HAVE WORKED ON HONDA'S AND ACURA'S FOR A LOT OF YEARS AND THIS MODEL CATCHES ON FIRE. SOMETHING ISN'T RIGHT. MY WIFE TOOK SOME PICTURES ON HER PHONE OF HER RDX.",
        "vin": "5J8TB3H55EL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717711,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SECURITY SYSTEM ENGAGES ITSELF WHEN YOUR IN THE CAR  WITH ALL SYSTEMS SHUT DOWN. ALSO ENGAGES ITSELF WHEN   THE CAR IS ON AND IN GEAR. ALARM GOES OFF AND SECURITY LIGHT GOES ON AND CANT BE STOPPED BY KEY FOB OR TURNING THE CAR OFF. THEN TURNED THE CAR OFF AND THEN IT WOULD NOT START ALARM STILL SOUNDING THEN IT STARTED WHILE ALARM ON AND ALARM LIGHT ON AND DROVE A DISTANCE WITH ALARM SOUNDING THEN STOPED AND TURNED CAR OFG AND ALARM WENT OFF AND DID  NOT RESTART ITSELF AGAIN. MY CONCERNS HAVE BEEN BROUGHT TO THE RALLYE ACURA DESLER IN ROSLYN NY WHERE CAR PURCHASED SINCE MARCH BUT NO RESPONSE. I AM CONCERNED THAT ALARM ENGAGES ITSELF WHEN I AM DRIVING AND MAY TURN THE CAR OFF. MUST BE A SHORT OR DEFECT IN THE SYSTEM. ALSO THE ALARM IS ABLE TO BE TURNED ON WHEN ALL WINDOWS ARE WIDE OPEN. THESE ARE NOT ONLY SAFTEY CONCERNS BUT SECURITY ISSUES AS WELL. THE CAR ALARM IN PROGRESS CAN BE DRIVEN OFF AND SEEMINGLY HALTED WHEN STOPPED.",
        "vin": "5J8TB4H55EL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/26/2014",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661043,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKES ON MY 2014 ACURA RDX WORE OUT AFTER ONLY 15,000 MILES. THIS IS TWO TO THREE TIMES FASTER THAN ANY PREVIOUS VEHICLE. THEY WORE OUT SO QUICKLY THAT THE BRAKES WORE ALL THE WAY DOWN TO THE ROTOR CAUSING METAL TO RUB.   *TR",
        "vin": "5J8TB4H59EL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10620953,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I PURCHASED A NEW 2014 ACURA RDX WITH NAVIGATION IN EARLY MARCH 2014. IN CONSIDER THE NAVIGATION SYSTEM AND THE BLUETOOTH INTERFACE 'UNSAFE AT ANY SPEED'.  ACURA IN ITS INFINITE WISDOM DECIDED NOT TO OFFER A TOUCH SCREEN INTERFACE AND TO DISABLE MANUAL CONTROLS WHILE THE VEHICLE IS IN MOTION. 1 - THIS PREVENTS A PASSENGER FROM ENTERING TRIP DESTINATION. 2 - DETAILS OF A LOCATION MUST BE ENTERED ONE CHARACTER AT A TIME. 3 - THIS CAN ONLY BE DONE BY VOICE COMMAND FROM THE DRIVER'S STEERING WHEEL CONTROLS. 4 - AFTER PRESSING THE TALK BUTTON TWICE AND SPEAKING A LETTER, THE SYSTEMS RESPONDS WITH THREE NUMBERED CHOICES THAT MUST BE SELECTED BY PRESSING THE TALK BUTTON TWICE AND SPEAKING THE NUMBER NEXT TO THE CORRECT LETTER.  THIS MUST BE REPEATED FOR EVERY LETTER IN THE PLACE NAME, STREET NAME, STREET NUMBER AND CITY.  IT IS SO DISTRACTING TO BE INFINITELY MORE DANGEROUS THAN A TOUCH INTERFACE.    TO MAKE MATTERS WORSE, THE PRE-LOADED MAP IS INACCURATE. FOR INSTANCE, CALIFORNIA STATE HIGHWAY 1 IS NOT CATEGORIZED AS A MAJOR ROAD.  SO DIRECTIONS FROM NORTHERN CALIFORNIA TO BIG SURE FOR EXAMPLE WILL BE 2.5 HOURS LONGER THAN THEY SHOULD BE BECAUSE THE SYSTEM WANTS TO TAKE THE DRIVER DOWN TO SAN LUIS OBISPO AND THEN BACK NORTH UP THE COAST ON US 101.    NEITHER THE SALES DEPARTMENT, THE SERVICE DEPARTMENT, THE MAPPING COMPANY OR ACURA CLIENT RELATIONS SEEM TO BE REAL CONCERNED.    THIS WAS A TOTAL WASTE OF APPROXIMATELY $3,000.  WE MUST RELY ON A GARMIN IN THE CAR TO GET ACCURATE AND SAFE USAGE FOR NAVIGATION.    WE HAVE A CASE NUMBER WITH ACURA CLIENT RELATIONS AND WE WILL PURSUE THIS UNTIL WE RECEIVE A FIX OR RECOMPENSE.    I WORK IN THE TECH INDUSTRY IN USER TECHNICAL SUPPORT, SO THIS IS NOT A USER ISSUE.  *TR",
        "vin": "5J8TB4H56EL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "03/25/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCORDING TO DEALER AND ACURA FACTORY REPRESENTATIVE, RDX HAS FLOATING BRAKE PADS INSIDE CALIPER CLIPS. THE BRAKE PADS MAKE A VERY LOUD METAL ON METAL SOUND AGAINST CALIPER CLIPS OVER BUMPS, POT HOLES AND LANE DIVIDERS. ACURA CLAIMS THIS IS A CHARACTERISTIC OF THE CAR.  PHYSICS TELLS ME THAT METAL ON METAL WILL EVENTUALLY WEAR CAUSING BRAKE PAD FAILURE. DEALER IS CONCERNED AND FEELS EXPLANATION FROM ACURA IS UNSATISFACTORY. ACURA REPRESENTATIVE WILL WRITE A REPORT TO MANUFACTURER. ALL 2014 RDX MODELS HAVE SAME PROBLEM.  DEALER CAN NOT SAY THAT THERE IS NOT A SAFETY PROBLEM. DEALER SAYS, \"I DON'T THINK THERE IS A SAFETY PROBLEM\". THERE NEEDS TO BE AN IMMEDIATE INVESTIGATION INTO THIS ISSUE, BECAUSE IT AFFECTS HUNDREDS OF RDX OWNERS.  THE MANUFACTURER TO THIS POINT HAS HAD A VERY CAVALIER ATTITUDE THAT THE METAL ON METAL SITUATION JUST COMES WITH THE CAR. THE DEALER CONFIRMS,\"THE NOISE ISSUE IS SUBSTANTIAL\". THE DEALER HAS BENT OVER BACKWARDS TO ISOLATE THE ISSUE, BUT HAS NOT RECEIVED ANY BACK-UP OR HELP FROM THE ACURA. DEALER HAS USED RUBBERIZED PAINT AND NEW BRAKE PADS TO QUIET NOISE, BUT HAS TOLD ME THAT IT IS NOT A FIX.  IT IS DONE FOR DIAGNOSES PURPOSES. AT THIS TIME THERE IS AN OPPORTUNITY BY THE FEDERAL GOVERNMENT TO PREVENT INJURY OR DEATH BEFORE IT HAPPENS DOWN THE ROAD AS THE CAR AGES AND METAL WEARS. I STRONGLY FEEL THAT FEDERAL GOVERNMENT SHOULD INTERVENE IMMEDIATELY TO CHECK THIS SITUATION OUT FOR ALL 2014 RDX OWNERS. THANK YOU",
        "vin": "5J8TB4H51EL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/05/2014",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586603,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING JAMMED UP ABOUT 11 TIMES DURING A 1 MILE STRETCH OF ROAD - THE DRIVING CONDITIONS WERE PERFECTLY NORMAL - TRAFFIC AND I HAD TO RESTART THE VEHICLE 11 TIMES! THEN ON THE HIGHWAY IT AGAIN JAMMED UP AND I ALMOST GOT HIT BY A TRUCK SINCE I WAS TAKING AN EXIT.  *TR",
        "vin": "5J8TB3H58EL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/28/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575365,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SLOW SPEEDS (< 30 MPH), WHEN THE VEHICLE HITS A UNEVEN ROAD SURFACE, A LOAD DRONE/CLUNK NOISE OCCURS FROM THE READ OF THE VEHICLE. THE VEHICLE WAS SERVICED AT THE DEALER AND HAD THE REAR STRUTS REPLACED. PROBLEM WAS RECTIFIED BUT NOW THE ISSUE IS SLOWLY RETURNING. THIS ISSUE IS BEING SHARED BY MANY AS DISCUSSED ON THE ACURA RDX FORUMS.  *TR",
        "vin": "5J8TB4H58EL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "02/18/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568587,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES DO NOT STOP THE VEHICLE CONSISTENTLY. THE STORY OF MY INCIDENT GOES AS FOLLOWS: I WAS DRIVING IN DRY CONDITIONS AS I APPROACHED A STOP LIGHT AND BEGAN TO APPLY THE BRAKES. ONCE THE VEHICLE CAME TO A COMPLETE STOP THE CAR THEN BEGAN TO SLIDE INTO A BUSY INTERSECTION. THE ONLY WAY I WAS ABLE TO STOP WAS BY PUTTING THE CAR IN PARK. LUCKILY THE OTHER DRIVERS WERE ABLE TO SEE SOMETHING WAS WRONG AND DID NOT PROCEED TO DRIVE THROUGH ME.     THIS HAS HAPPENED TO ME TWICE! THE OTHER TIME I WAS DRIVING UNDER WET CONDITIONS AND THE CAR DID NOT EVEN COME TO A COMPLETE STOP. IT JUST CONTINUED TO SLIDE INTO THE INTERSECTION. I AM VERY CONCERNED FOR MY SAFETY AND LIFE! ACURA DEALERSHIP REFUSES TO ADMIT THAT THERE IS ANYTHING WRONG WITH THE VEHICLE AFTER INSPECTION AND I DON'T KNOW WHAT ELSE TO DO. THE DEALERSHIP HAS CONTINUED TO DISMISS MY CONCERNS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "02/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567073,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RDX AWD UNDER ICY CONDITIONS CAN KILL TORQUE TO ALL 4 WHEELS. IN MY CASE AS SOON AS ALL TORQUE WAS LOST THE VEHICLE IMMEDIATELY STARTED SLIDING DOWN THE INCLINE. I WAS ABLE TO STEER THE VEHICLE IN A 180 DEG TURN AND SLIDE FORWARD DOWN THE HILL UNTIL TORQUE TO THE WHEELS WAS FINALLY RESTORED. THERE IS NO MENTION OF LOSS OF TORQUE IN ANY ACURA LITERATURE AVAILABLE TO ME AND ACURA REFUSED TO PROVIDE INFORMATION AFTER THE INCIDENT WAS REPORTED. I CONSIDER THIS A SERIOUS DESIGN FLAW.  *TR",
        "vin": "5J8TB4H5XDL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/08/2014",
        "dateOfIncident": "02/08/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY RELATIVELY NEW ACURA TO THE POHANKA ACURA DEALER IN CHANTILLY VIRGINIA WHERE THE CAR WAS PURCHASED TO HAVE THE PASSENGER - SIDE MIRROR FIXED.  IT DOES NOT ROTATE TO THE RIGHT ENOUGH FOR ME TO SEE CARS TO MY RIGHT WELL ENOUGH.  THE SERVICE TECHNICIAN ([XXX]) ADMITTED THAT IT WAS A DEFECT, BUT SAID THAT IT COULD NOT BE REPAIRED BECAUSE ALL THE ACURA RDX'S WERE MADE THAT WAY AND COULD NOT BE CHANGED.  THIS DEFECT IS A DANGER TO MY DRIVING AND REALLY WARRANTS YOUR INVESTIGATION.  THANK YOU FOR YOUR TIME.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5J8TB3H59EL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "08/27/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10537816,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA RDX TECH PURCHASED 30 DAYS AGO, UP-SHIFTED WHILE PARKING INTO A PARKING SPOT IN A PARKING GARAGE.  THE VEHICLE SUDDENLY AND VIOLENTLY ACCELERATED WHEN PUSHING ON THE BRAKE BEFORE A COMPLETE STOP AND RAN INTO THE CHAIN LINKED FENCE.  THE DRIVER GOT A SEAT BELT BURN ON THE LEFT UPPER CHEST AND SOFT TISSUE INJURY TO THE NECK.   THE FRONT PART OF THE VEHICLE GOT SIGNIFICANT BODY DAMAGE. A COUPLE INCIDENCES OF THE CAR VIOLENTLY UPSHIFTED WHEN MOVING FROM A STOP WERE ALSO NOTED BEFORE THIS ACCIDENT HAPPENED.  THE CAR WAS BOUGHT BRAND NEW A MONTH AGO. THIS IS THE EXACT SIMILAR INCIDENCE TO THE COMPLAINT # 10510220.  ACURAZINE COMMUNITY FORUM HAS OTHER INCIDENCES SIMILAR TO MY ACCIDENT.  THIS IS A MAJOR SAFETY CONCERN.  THE VEHICLE WAS BROUGHT TO THE ACURA DEALER FOR INVESTIGATION. *TT",
        "vin": "5J8TB4H55EL"
    }
]