[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Airstream, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723869,
        "products": [
            {
                "manufacturer": "Airstream, Inc.",
                "productMake": "AIRSTREAM",
                "productModel": "INTERNATIONAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE AFTERNOON OF 25 MARCH 2015, I WAS DRIVING ALONE AND WEST ON INTERSTATE 205 IN THE VICINITY OF WEST LYNN IN MY 2014 DODGE RAM 3500 PICKUP TRUCK WHEN THE FRESH WATER TANK OF THE 2014 AIRSTREAM TRAVEL TRAILER I WAS TOWING FELL ONTO THE PAVEMENT.  THE TANK WAS FILLED WITH WATER AND I DRAGGED IT ABOUT 150 YARDS, LEAKING, UNTIL I PULLED OVER TO THE SIDE OF THE HIGHWAY.      WITHIN AN HOUR, AFTER PHONING THE SERVICE MANAGER AT NORTHWEST AIRSTREAM IN GLADSTONE, TWO TECHNICIANS ARRIVED ON THE SCENE.  THE SENIOR MAN REMARKED THAT HE HAD NEVER HEARD OR SEEN OF SUCH A THING BEFORE.  HE AND HIS ASSOCIATE MADE EMERGENCY ROADSIDE REPAIRS BY SECURING THE FRESHWATER TANK TO THE CHASSIS WITH AVAILABLE STRAPS.  THEY THEN GUIDED ME BACK TO THE AIRSTREAM SERVICE DEPARTMENT IN GLADSTONE THAT AFTERNOON AT LOW SPEED.  THE NEXT DAY, I WAS INFORMED THAT ALL 16 BOLTS SECURING THE FRESHWATER TANK TO THE UNDERSIDE OF THIS NEW AIRSTREAM HAD BEEN SHEARED OFF AND/OR STRIPPED.  AS WELL, THE STRAPS WERE BADLY DAMAGED.  AT THAT TIME, MY NEW AIRSTREAM HAD FOUR MONTHS OF USE AND AROUND 3500 MILES OF WEAR.      THE FRESHWATER TANK ITSELF WAS UNDAMAGED AND THE TECHNICIANS WERE ABLE TO MAKE THE REPAIRS UNDER WARRANTY.  I WAS ON THE ROAD AGAIN BY 26 MARCH.   I ASKED THE SERVICE MANAGER TO CONTACT THE AIRSTREAM FACTORY TO DETERMINE IF SIMILAR INCIDENTS HAD OCCURRED.  ON 5 JUNE 2015, I WAS PROVIDED A LETTER BY THE FACTORY STATING THAT NO AIRSTREAMS HAD BEEN RECALLED FOR FAULTY INSTALLATION OF THE FRESHWATER TANK IN WHICH IT SEPARATES ITSELF FROM THE UNDERSIDE OF THE TRAILER WHILE IN MOTION.  MOREOVER, INCIDENTS OF THIS NATURE WERE A 'RARITY.' THANKFULLY, THERE WERE NO INJURIES OR FATALITIES.  BUT THERE COULD HAVE BEEN.      I BELIEVE FOUL PLAY MAY HAVE BEEN INVOLVED AND THAT AIRSTREAM WAS NOT AT FAULT.  IN FACT, THEIR SERVICE HAS BEEN EXEMPLARY.",
        "vin": "1STJFYM26EJ"
    }
]